; ModuleID = 'alias.bc'
source_filename = "alias.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }
%struct.tree_decl_minimal = type { %struct.tree_common, i32, i32, %union.tree_node*, %union.tree_node* }
%struct.tree_common = type { %struct.tree_base, %union.tree_node*, %union.tree_node* }
%struct.tree_base = type { i64 }

!505 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!506 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!507 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!508 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!509 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!510 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!511 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!512 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!513 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!514 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!515 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!516 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!517 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!518 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!519 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!520 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "reg_note", file: !378, line: 836, baseType: !7, size: 32, elements: !521)
!521 = !{!522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553}
!522 = !DIEnumerator(name: "REG_DEP_TRUE", value: 0, isUnsigned: true)
!523 = !DIEnumerator(name: "REG_DEAD", value: 1, isUnsigned: true)
!524 = !DIEnumerator(name: "REG_INC", value: 2, isUnsigned: true)
!525 = !DIEnumerator(name: "REG_EQUIV", value: 3, isUnsigned: true)
!526 = !DIEnumerator(name: "REG_EQUAL", value: 4, isUnsigned: true)
!527 = !DIEnumerator(name: "REG_NONNEG", value: 5, isUnsigned: true)
!528 = !DIEnumerator(name: "REG_UNUSED", value: 6, isUnsigned: true)
!529 = !DIEnumerator(name: "REG_CC_SETTER", value: 7, isUnsigned: true)
!530 = !DIEnumerator(name: "REG_CC_USER", value: 8, isUnsigned: true)
!531 = !DIEnumerator(name: "REG_LABEL_TARGET", value: 9, isUnsigned: true)
!532 = !DIEnumerator(name: "REG_LABEL_OPERAND", value: 10, isUnsigned: true)
!533 = !DIEnumerator(name: "REG_DEP_OUTPUT", value: 11, isUnsigned: true)
!534 = !DIEnumerator(name: "REG_DEP_ANTI", value: 12, isUnsigned: true)
!535 = !DIEnumerator(name: "REG_BR_PROB", value: 13, isUnsigned: true)
!536 = !DIEnumerator(name: "REG_VALUE_PROFILE", value: 14, isUnsigned: true)
!537 = !DIEnumerator(name: "REG_NOALIAS", value: 15, isUnsigned: true)
!538 = !DIEnumerator(name: "REG_BR_PRED", value: 16, isUnsigned: true)
!539 = !DIEnumerator(name: "REG_FRAME_RELATED_EXPR", value: 17, isUnsigned: true)
!540 = !DIEnumerator(name: "REG_CFA_DEF_CFA", value: 18, isUnsigned: true)
!541 = !DIEnumerator(name: "REG_CFA_ADJUST_CFA", value: 19, isUnsigned: true)
!542 = !DIEnumerator(name: "REG_CFA_OFFSET", value: 20, isUnsigned: true)
!543 = !DIEnumerator(name: "REG_CFA_REGISTER", value: 21, isUnsigned: true)
!544 = !DIEnumerator(name: "REG_CFA_RESTORE", value: 22, isUnsigned: true)
!545 = !DIEnumerator(name: "REG_CFA_SET_VDRAP", value: 23, isUnsigned: true)
!546 = !DIEnumerator(name: "REG_EH_CONTEXT", value: 24, isUnsigned: true)
!547 = !DIEnumerator(name: "REG_EH_REGION", value: 25, isUnsigned: true)
!548 = !DIEnumerator(name: "REG_SAVE_NOTE", value: 26, isUnsigned: true)
!549 = !DIEnumerator(name: "REG_NORETURN", value: 27, isUnsigned: true)
!550 = !DIEnumerator(name: "REG_NON_LOCAL_GOTO", value: 28, isUnsigned: true)
!551 = !DIEnumerator(name: "REG_CROSSING_JUMP", value: 29, isUnsigned: true)
!552 = !DIEnumerator(name: "REG_SETJMP", value: 30, isUnsigned: true)
!553 = !DIEnumerator(name: "REG_NOTE_MAX", value: 31, isUnsigned: true)
!554 = !{!555, !556, !557, !558, !561, !562, !564, !568, !134, !710, !1920, !377, !709, !1922, !5, !1965, !1508, !575, !1966, !572, !559, !573, !520, !7, !1968, !1159, !1980, !1928, !1048, !567, !1982, !1905}
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!557 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !560)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "splay_tree_key", file: !565, line: 62, baseType: !566)
!565 = !DIFile(filename: "./include/splay-tree.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "libi_uhostptr_t", file: !565, line: 41, baseType: !567)
!567 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx_function", file: !378, line: 1875, baseType: !569)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DISubroutineType(types: !571)
!571 = !{!557, !572, !561}
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !574, line: 50, baseType: !575)
!574 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !378, line: 240, size: 384, elements: !577)
!577 = !{!578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !576, file: !378, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !576, file: !378, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !576, file: !378, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !576, file: !378, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !576, file: !378, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !576, file: !378, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !576, file: !378, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !576, file: !378, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !576, file: !378, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !576, file: !378, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !576, file: !378, line: 321, baseType: !589, size: 320, offset: 64)
!589 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !378, line: 315, size: 320, elements: !590)
!590 = !{!591, !1855, !1857, !1918, !1919}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !589, file: !378, line: 316, baseType: !592, size: 64)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !593, size: 64, elements: !608)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !378, line: 183, baseType: !594)
!594 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !378, line: 166, size: 64, elements: !595)
!595 = !{!596, !597, !598, !599, !600, !610, !611, !623, !647, !708, !1833, !1834, !1845, !1852}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !594, file: !378, line: 168, baseType: !557, size: 32)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !594, file: !378, line: 169, baseType: !7, size: 32)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !594, file: !378, line: 170, baseType: !562, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !594, file: !378, line: 171, baseType: !573, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !594, file: !378, line: 172, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !574, line: 53, baseType: !602)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !378, line: 359, size: 128, elements: !604)
!604 = !{!605, !606}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !603, file: !378, line: 360, baseType: !557, size: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !603, file: !378, line: 361, baseType: !607, size: 64, offset: 64)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !573, size: 64, elements: !608)
!608 = !{!609}
!609 = !DISubrange(count: 1)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !594, file: !378, line: 173, baseType: !5, size: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !594, file: !378, line: 174, baseType: !612, size: 32)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !378, line: 133, baseType: !613)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !378, line: 115, size: 32, elements: !614)
!614 = !{!615, !616, !617, !618, !619, !620, !621, !622}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !613, file: !378, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !613, file: !378, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !613, file: !378, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !613, file: !378, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !613, file: !378, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !613, file: !378, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !613, file: !378, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !613, file: !378, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !594, file: !378, line: 175, baseType: !624, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !626, line: 23, size: 320, elements: !627)
!626 = !DIFile(filename: "./cselib.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!627 = !{!628, !629, !630, !631, !638, !646}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !625, file: !626, line: 25, baseType: !7, size: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !625, file: !626, line: 28, baseType: !557, size: 32, offset: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "val_rtx", scope: !625, file: !626, line: 31, baseType: !573, size: 64, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "locs", scope: !625, file: !626, line: 35, baseType: !632, size: 64, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "elt_loc_list", file: !626, line: 45, size: 192, elements: !634)
!634 = !{!635, !636, !637}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !633, file: !626, line: 47, baseType: !632, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !633, file: !626, line: 49, baseType: !573, size: 64, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "setting_insn", scope: !633, file: !626, line: 51, baseType: !573, size: 64, offset: 128)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "addr_list", scope: !625, file: !626, line: 39, baseType: !639, size: 64, offset: 192)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "elt_list", file: !626, line: 55, size: 128, elements: !641)
!641 = !{!642, !643}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !640, file: !626, line: 56, baseType: !639, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "elt", scope: !640, file: !626, line: 57, baseType: !644, size: 64, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "cselib_val", file: !626, line: 42, baseType: !625)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "next_containing_mem", scope: !625, file: !626, line: 41, baseType: !624, size: 64, offset: 256)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !594, file: !378, line: 176, baseType: !648, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !650, line: 75, size: 256, elements: !651)
!650 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!651 = !{!652, !666, !667, !668}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !649, file: !650, line: 76, baseType: !653, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !650, line: 68, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !650, line: 63, size: 320, elements: !656)
!656 = !{!657, !659, !660, !661}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !655, file: !650, line: 64, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !655, file: !650, line: 65, baseType: !658, size: 64, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !655, file: !650, line: 66, baseType: !7, size: 32, offset: 128)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !655, file: !650, line: 67, baseType: !662, size: 128, offset: 192)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !663, size: 128, elements: !664)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !650, line: 29, baseType: !567)
!664 = !{!665}
!665 = !DISubrange(count: 2)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !649, file: !650, line: 77, baseType: !653, size: 64, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !649, file: !650, line: 78, baseType: !7, size: 32, offset: 128)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !649, file: !650, line: 79, baseType: !669, size: 64, offset: 192)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !650, line: 49, baseType: !671)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !650, line: 45, size: 832, elements: !672)
!672 = !{!673, !674, !675}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !671, file: !650, line: 46, baseType: !658, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !671, file: !650, line: 47, baseType: !648, size: 64, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !671, file: !650, line: 48, baseType: !676, size: 704, offset: 128)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !677, line: 164, size: 704, elements: !678)
!677 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!678 = !{!679, !681, !691, !692, !693, !694, !695, !696, !700, !704, !705, !706, !707}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !676, file: !677, line: 166, baseType: !680, size: 64)
!680 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !676, file: !677, line: 167, baseType: !682, size: 64, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !677, line: 157, size: 192, elements: !684)
!684 = !{!685, !686, !687}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !683, file: !677, line: 159, baseType: !559, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !683, file: !677, line: 160, baseType: !682, size: 64, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !683, file: !677, line: 161, baseType: !688, size: 32, offset: 128)
!688 = !DICompositeType(tag: DW_TAG_array_type, baseType: !560, size: 32, elements: !689)
!689 = !{!690}
!690 = !DISubrange(count: 4)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !676, file: !677, line: 168, baseType: !559, size: 64, offset: 128)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !676, file: !677, line: 169, baseType: !559, size: 64, offset: 192)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !676, file: !677, line: 170, baseType: !559, size: 64, offset: 256)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !676, file: !677, line: 171, baseType: !680, size: 64, offset: 320)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !676, file: !677, line: 172, baseType: !557, size: 32, offset: 384)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !676, file: !677, line: 176, baseType: !697, size: 64, offset: 448)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DISubroutineType(types: !699)
!699 = !{!682, !561, !680}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !676, file: !677, line: 177, baseType: !701, size: 64, offset: 512)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{null, !561, !682}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !676, file: !677, line: 178, baseType: !561, size: 64, offset: 576)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !676, file: !677, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !676, file: !677, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !676, file: !677, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !594, file: !378, line: 177, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !574, line: 56, baseType: !710)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !135, line: 3371, size: 1792, elements: !712)
!712 = !{!713, !746, !752, !763, !782, !793, !798, !805, !811, !824, !836, !874, !879, !907, !924, !925, !930, !939, !945, !950, !954, !958, !1482, !1531, !1537, !1543, !1550, !1563, !1577, !1594, !1606, !1628, !1643, !1815}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !711, file: !135, line: 3372, baseType: !714, size: 64)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !135, line: 360, size: 64, elements: !715)
!715 = !{!716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !714, file: !135, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !714, file: !135, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !714, file: !135, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !714, file: !135, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !714, file: !135, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !714, file: !135, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !714, file: !135, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !714, file: !135, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !714, file: !135, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !714, file: !135, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !714, file: !135, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !714, file: !135, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !714, file: !135, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !714, file: !135, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !714, file: !135, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !714, file: !135, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !714, file: !135, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !714, file: !135, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !714, file: !135, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !714, file: !135, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !714, file: !135, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !714, file: !135, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !714, file: !135, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !714, file: !135, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !714, file: !135, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !714, file: !135, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !714, file: !135, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !714, file: !135, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !714, file: !135, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !714, file: !135, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !711, file: !135, line: 3373, baseType: !747, size: 192)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !135, line: 402, size: 192, elements: !748)
!748 = !{!749, !750, !751}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !747, file: !135, line: 403, baseType: !714, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !747, file: !135, line: 404, baseType: !709, size: 64, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !747, file: !135, line: 405, baseType: !709, size: 64, offset: 128)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !711, file: !135, line: 3374, baseType: !753, size: 320)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !135, line: 1384, size: 320, elements: !754)
!754 = !{!755, !756}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !753, file: !135, line: 1385, baseType: !747, size: 192)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !753, file: !135, line: 1386, baseType: !757, size: 128, offset: 192)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !758, line: 58, baseType: !759)
!758 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !758, line: 54, size: 128, elements: !760)
!760 = !{!761, !762}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !759, file: !758, line: 56, baseType: !567, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !759, file: !758, line: 57, baseType: !680, size: 64, offset: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !711, file: !135, line: 3375, baseType: !764, size: 256)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !135, line: 1397, size: 256, elements: !765)
!765 = !{!766, !767}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !764, file: !135, line: 1398, baseType: !747, size: 192)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !764, file: !135, line: 1399, baseType: !768, size: 64, offset: 192)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !770, line: 52, size: 256, elements: !771)
!770 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!771 = !{!772, !773, !774, !775, !776, !777, !778}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !769, file: !770, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !769, file: !770, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !769, file: !770, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !769, file: !770, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !769, file: !770, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !769, file: !770, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !769, file: !770, line: 62, baseType: !779, size: 192, offset: 64)
!779 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 192, elements: !780)
!780 = !{!781}
!781 = !DISubrange(count: 3)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !711, file: !135, line: 3376, baseType: !783, size: 256)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !135, line: 1408, size: 256, elements: !784)
!784 = !{!785, !786}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !783, file: !135, line: 1409, baseType: !747, size: 192)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !783, file: !135, line: 1410, baseType: !787, size: 64, offset: 192)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !789, line: 27, size: 192, elements: !790)
!789 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!790 = !{!791, !792}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !788, file: !789, line: 29, baseType: !757, size: 128)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !788, file: !789, line: 30, baseType: !5, size: 32, offset: 128)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !711, file: !135, line: 3377, baseType: !794, size: 256)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !135, line: 1437, size: 256, elements: !795)
!795 = !{!796, !797}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !794, file: !135, line: 1438, baseType: !747, size: 192)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !794, file: !135, line: 1439, baseType: !709, size: 64, offset: 192)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !711, file: !135, line: 3378, baseType: !799, size: 256)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !135, line: 1418, size: 256, elements: !800)
!800 = !{!801, !802, !803}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !799, file: !135, line: 1419, baseType: !747, size: 192)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !799, file: !135, line: 1420, baseType: !557, size: 32, offset: 192)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !799, file: !135, line: 1421, baseType: !804, size: 8, offset: 224)
!804 = !DICompositeType(tag: DW_TAG_array_type, baseType: !560, size: 8, elements: !608)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !711, file: !135, line: 3379, baseType: !806, size: 320)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !135, line: 1428, size: 320, elements: !807)
!807 = !{!808, !809, !810}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !806, file: !135, line: 1429, baseType: !747, size: 192)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !806, file: !135, line: 1430, baseType: !709, size: 64, offset: 192)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !806, file: !135, line: 1431, baseType: !709, size: 64, offset: 256)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !711, file: !135, line: 3380, baseType: !812, size: 320)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !135, line: 1460, size: 320, elements: !813)
!813 = !{!814, !815}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !812, file: !135, line: 1461, baseType: !747, size: 192)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !812, file: !135, line: 1462, baseType: !816, size: 128, offset: 192)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !817, line: 31, size: 128, elements: !818)
!817 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!818 = !{!819, !822, !823}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !816, file: !817, line: 32, baseType: !820, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !556)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !816, file: !817, line: 33, baseType: !7, size: 32, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !816, file: !817, line: 34, baseType: !7, size: 32, offset: 96)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !711, file: !135, line: 3381, baseType: !825, size: 384)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !135, line: 2507, size: 384, elements: !826)
!826 = !{!827, !828, !833, !834, !835}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !825, file: !135, line: 2508, baseType: !747, size: 192)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !825, file: !135, line: 2509, baseType: !829, size: 32, offset: 192)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !830, line: 58, baseType: !831)
!830 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !832, line: 44, baseType: !7)
!832 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!833 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !825, file: !135, line: 2510, baseType: !7, size: 32, offset: 224)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !825, file: !135, line: 2511, baseType: !709, size: 64, offset: 256)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !825, file: !135, line: 2512, baseType: !709, size: 64, offset: 320)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !711, file: !135, line: 3382, baseType: !837, size: 896)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !135, line: 2652, size: 896, elements: !838)
!838 = !{!839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !837, file: !135, line: 2653, baseType: !825, size: 384)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !837, file: !135, line: 2654, baseType: !709, size: 64, offset: 384)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !837, file: !135, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !837, file: !135, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !837, file: !135, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !837, file: !135, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !837, file: !135, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !837, file: !135, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !837, file: !135, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !837, file: !135, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !837, file: !135, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !837, file: !135, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !837, file: !135, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !837, file: !135, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !837, file: !135, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !837, file: !135, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !837, file: !135, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !837, file: !135, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !837, file: !135, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !837, file: !135, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !837, file: !135, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !837, file: !135, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !837, file: !135, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !837, file: !135, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !837, file: !135, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !837, file: !135, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !837, file: !135, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !837, file: !135, line: 2703, baseType: !7, size: 32, offset: 512)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !837, file: !135, line: 2705, baseType: !709, size: 64, offset: 576)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !837, file: !135, line: 2706, baseType: !709, size: 64, offset: 640)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !837, file: !135, line: 2707, baseType: !709, size: 64, offset: 704)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !837, file: !135, line: 2708, baseType: !709, size: 64, offset: 768)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !837, file: !135, line: 2711, baseType: !872, size: 64, offset: 832)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !135, line: 2711, flags: DIFlagFwdDecl)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !711, file: !135, line: 3383, baseType: !875, size: 960)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !135, line: 2756, size: 960, elements: !876)
!876 = !{!877, !878}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !875, file: !135, line: 2757, baseType: !837, size: 896)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !875, file: !135, line: 2758, baseType: !573, size: 64, offset: 896)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !711, file: !135, line: 3384, baseType: !880, size: 1472)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !135, line: 3114, size: 1472, elements: !881)
!881 = !{!882, !903, !904, !905, !906}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !880, file: !135, line: 3115, baseType: !883, size: 1216)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !135, line: 2984, size: 1216, elements: !884)
!884 = !{!885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !883, file: !135, line: 2985, baseType: !875, size: 960)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !883, file: !135, line: 2986, baseType: !709, size: 64, offset: 960)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !883, file: !135, line: 2987, baseType: !709, size: 64, offset: 1024)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !883, file: !135, line: 2988, baseType: !709, size: 64, offset: 1088)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !883, file: !135, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !883, file: !135, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !883, file: !135, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !883, file: !135, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !883, file: !135, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !883, file: !135, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !883, file: !135, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !883, file: !135, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !883, file: !135, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !883, file: !135, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !883, file: !135, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !883, file: !135, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !883, file: !135, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !883, file: !135, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !880, file: !135, line: 3117, baseType: !709, size: 64, offset: 1216)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !880, file: !135, line: 3119, baseType: !709, size: 64, offset: 1280)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !880, file: !135, line: 3121, baseType: !709, size: 64, offset: 1344)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !880, file: !135, line: 3123, baseType: !709, size: 64, offset: 1408)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !711, file: !135, line: 3385, baseType: !908, size: 1088)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !135, line: 2874, size: 1088, elements: !909)
!909 = !{!910, !911, !912}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !908, file: !135, line: 2875, baseType: !875, size: 960)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !908, file: !135, line: 2876, baseType: !573, size: 64, offset: 960)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !908, file: !135, line: 2877, baseType: !913, size: 64, offset: 1024)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !915, line: 172, size: 128, elements: !916)
!915 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!916 = !{!917, !918, !919, !920, !921, !922, !923}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !914, file: !915, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !914, file: !915, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !914, file: !915, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !914, file: !915, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !914, file: !915, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !914, file: !915, line: 195, baseType: !7, size: 32, offset: 32)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !914, file: !915, line: 199, baseType: !709, size: 64, offset: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !711, file: !135, line: 3386, baseType: !883, size: 1216)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !711, file: !135, line: 3387, baseType: !926, size: 1280)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !135, line: 3093, size: 1280, elements: !927)
!927 = !{!928, !929}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !926, file: !135, line: 3094, baseType: !883, size: 1216)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !926, file: !135, line: 3095, baseType: !913, size: 64, offset: 1216)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !711, file: !135, line: 3388, baseType: !931, size: 1216)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !135, line: 2824, size: 1216, elements: !932)
!932 = !{!933, !934, !935, !936, !937, !938}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !931, file: !135, line: 2825, baseType: !837, size: 896)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !931, file: !135, line: 2827, baseType: !709, size: 64, offset: 896)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !931, file: !135, line: 2828, baseType: !709, size: 64, offset: 960)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !931, file: !135, line: 2829, baseType: !709, size: 64, offset: 1024)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !931, file: !135, line: 2830, baseType: !709, size: 64, offset: 1088)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !931, file: !135, line: 2831, baseType: !709, size: 64, offset: 1152)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !711, file: !135, line: 3389, baseType: !940, size: 1024)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !135, line: 2850, size: 1024, elements: !941)
!941 = !{!942, !943, !944}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !940, file: !135, line: 2851, baseType: !875, size: 960)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !940, file: !135, line: 2852, baseType: !557, size: 32, offset: 960)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !940, file: !135, line: 2853, baseType: !557, size: 32, offset: 992)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !711, file: !135, line: 3390, baseType: !946, size: 1024)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !135, line: 2857, size: 1024, elements: !947)
!947 = !{!948, !949}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !946, file: !135, line: 2858, baseType: !875, size: 960)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !946, file: !135, line: 2859, baseType: !913, size: 64, offset: 960)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !711, file: !135, line: 3391, baseType: !951, size: 960)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !135, line: 2862, size: 960, elements: !952)
!952 = !{!953}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !951, file: !135, line: 2863, baseType: !875, size: 960)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !711, file: !135, line: 3392, baseType: !955, size: 1472)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !135, line: 3304, size: 1472, elements: !956)
!956 = !{!957}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !955, file: !135, line: 3305, baseType: !880, size: 1472)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !711, file: !135, line: 3393, baseType: !959, size: 1792)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !135, line: 3248, size: 1792, elements: !960)
!960 = !{!961, !962, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !959, file: !135, line: 3249, baseType: !880, size: 1472)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !959, file: !135, line: 3251, baseType: !963, size: 64, offset: 1472)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !965, line: 463, size: 1152, elements: !966)
!965 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!966 = !{!967, !970, !1286, !1287, !1402, !1405, !1406, !1407, !1408, !1409, !1410, !1434, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !964, file: !965, line: 464, baseType: !968, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !965, line: 464, flags: DIFlagFwdDecl)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !964, file: !965, line: 467, baseType: !971, size: 64, offset: 64)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !330, line: 374, size: 640, elements: !973)
!973 = !{!974, !1261, !1262, !1275, !1276, !1277, !1278, !1279, !1280, !1282, !1284, !1285}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !972, file: !330, line: 377, baseType: !975, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !574, line: 111, baseType: !976)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !330, line: 217, size: 832, elements: !978)
!978 = !{!979, !1226, !1227, !1228, !1231, !1235, !1236, !1237, !1255, !1256, !1257, !1258, !1259, !1260}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !977, file: !330, line: 219, baseType: !980, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !330, line: 151, baseType: !982)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !330, line: 151, size: 128, elements: !983)
!983 = !{!984}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !982, file: !330, line: 151, baseType: !985, size: 128)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !330, line: 150, baseType: !986)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !330, line: 150, size: 128, elements: !987)
!987 = !{!988, !989, !990}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !986, file: !330, line: 150, baseType: !7, size: 32)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !986, file: !330, line: 150, baseType: !7, size: 32, offset: 32)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !986, file: !330, line: 150, baseType: !991, size: 64, offset: 64)
!991 = !DICompositeType(tag: DW_TAG_array_type, baseType: !992, size: 64, elements: !608)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !574, line: 108, baseType: !993)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !330, line: 122, size: 512, elements: !995)
!995 = !{!996, !997, !998, !1218, !1219, !1220, !1221, !1222, !1223, !1224}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !994, file: !330, line: 124, baseType: !976, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !994, file: !330, line: 125, baseType: !976, size: 64, offset: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !994, file: !330, line: 131, baseType: !999, size: 64, offset: 128)
!999 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !330, line: 128, size: 64, elements: !1000)
!1000 = !{!1001, !1217}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !999, file: !330, line: 129, baseType: !1002, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !574, line: 66, baseType: !1003)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !1005, line: 143, size: 192, elements: !1006)
!1005 = !DIFile(filename: "./gimple.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1006 = !{!1007, !1215, !1216}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1004, file: !1005, line: 145, baseType: !1008, size: 64)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !574, line: 69, baseType: !1009)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !1005, line: 136, size: 192, elements: !1011)
!1011 = !{!1012, !1213, !1214}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1010, file: !1005, line: 137, baseType: !1013, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !574, line: 58, baseType: !1014)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !1005, line: 737, size: 768, elements: !1016)
!1016 = !{!1017, !1034, !1068, !1074, !1079, !1084, !1091, !1097, !1103, !1108, !1122, !1127, !1133, !1138, !1148, !1153, !1171, !1178, !1185, !1191, !1196, !1202, !1208}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1015, file: !1005, line: 738, baseType: !1018, size: 256)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !1005, line: 271, size: 256, elements: !1019)
!1019 = !{!1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1018, file: !1005, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !1018, file: !1005, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1018, file: !1005, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !1018, file: !1005, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !1018, file: !1005, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !1018, file: !1005, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !1018, file: !1005, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1018, file: !1005, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !1018, file: !1005, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1018, file: !1005, line: 312, baseType: !7, size: 32, offset: 32)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !1018, file: !1005, line: 316, baseType: !829, size: 32, offset: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !1018, file: !1005, line: 319, baseType: !7, size: 32, offset: 96)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1018, file: !1005, line: 323, baseType: !976, size: 64, offset: 128)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1018, file: !1005, line: 327, baseType: !709, size: 64, offset: 192)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !1015, file: !1005, line: 739, baseType: !1035, size: 448)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !1005, line: 350, size: 448, elements: !1036)
!1036 = !{!1037, !1066}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1035, file: !1005, line: 353, baseType: !1038, size: 384)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !1005, line: 333, size: 384, elements: !1039)
!1039 = !{!1040, !1041, !1049}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1038, file: !1005, line: 336, baseType: !1018, size: 256)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !1038, file: !1005, line: 343, baseType: !1042, size: 64, offset: 256)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1044, line: 37, size: 128, elements: !1045)
!1044 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1045 = !{!1046, !1047}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1043, file: !1044, line: 39, baseType: !1042, size: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1043, file: !1044, line: 40, baseType: !1048, size: 64, offset: 64)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !1038, file: !1005, line: 344, baseType: !1050, size: 64, offset: 320)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1044, line: 45, size: 320, elements: !1052)
!1052 = !{!1053, !1054}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1051, file: !1044, line: 47, baseType: !1050, size: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1051, file: !1044, line: 48, baseType: !1055, size: 256, offset: 64)
!1055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !135, line: 1883, size: 256, elements: !1056)
!1056 = !{!1057, !1059, !1060, !1065}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1055, file: !135, line: 1884, baseType: !1058, size: 64)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1055, file: !135, line: 1885, baseType: !1058, size: 64, offset: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1055, file: !135, line: 1891, baseType: !1061, size: 64, offset: 128)
!1061 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1055, file: !135, line: 1891, size: 64, elements: !1062)
!1062 = !{!1063, !1064}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1061, file: !135, line: 1891, baseType: !1013, size: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1061, file: !135, line: 1891, baseType: !709, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1055, file: !135, line: 1892, baseType: !1048, size: 64, offset: 192)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1035, file: !1005, line: 359, baseType: !1067, size: 64, offset: 384)
!1067 = !DICompositeType(tag: DW_TAG_array_type, baseType: !709, size: 64, elements: !608)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !1015, file: !1005, line: 740, baseType: !1069, size: 512)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !1005, line: 365, size: 512, elements: !1070)
!1070 = !{!1071, !1072, !1073}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1069, file: !1005, line: 368, baseType: !1038, size: 384)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1069, file: !1005, line: 373, baseType: !709, size: 64, offset: 384)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1069, file: !1005, line: 374, baseType: !709, size: 64, offset: 448)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !1015, file: !1005, line: 741, baseType: !1075, size: 576)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !1005, line: 380, size: 576, elements: !1076)
!1076 = !{!1077, !1078}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1075, file: !1005, line: 383, baseType: !1069, size: 512)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1075, file: !1005, line: 389, baseType: !1067, size: 64, offset: 512)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1015, file: !1005, line: 742, baseType: !1080, size: 320)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !1005, line: 395, size: 320, elements: !1081)
!1081 = !{!1082, !1083}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1080, file: !1005, line: 397, baseType: !1018, size: 256)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1080, file: !1005, line: 400, baseType: !1002, size: 64, offset: 256)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !1015, file: !1005, line: 743, baseType: !1085, size: 448)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !1005, line: 406, size: 448, elements: !1086)
!1086 = !{!1087, !1088, !1089, !1090}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1085, file: !1005, line: 408, baseType: !1018, size: 256)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1085, file: !1005, line: 412, baseType: !709, size: 64, offset: 256)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1085, file: !1005, line: 420, baseType: !709, size: 64, offset: 320)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1085, file: !1005, line: 423, baseType: !1002, size: 64, offset: 384)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !1015, file: !1005, line: 744, baseType: !1092, size: 384)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !1005, line: 429, size: 384, elements: !1093)
!1093 = !{!1094, !1095, !1096}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1092, file: !1005, line: 431, baseType: !1018, size: 256)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1092, file: !1005, line: 434, baseType: !709, size: 64, offset: 256)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1092, file: !1005, line: 437, baseType: !1002, size: 64, offset: 320)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !1015, file: !1005, line: 745, baseType: !1098, size: 384)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !1005, line: 443, size: 384, elements: !1099)
!1099 = !{!1100, !1101, !1102}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1098, file: !1005, line: 445, baseType: !1018, size: 256)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1098, file: !1005, line: 449, baseType: !709, size: 64, offset: 256)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1098, file: !1005, line: 453, baseType: !1002, size: 64, offset: 320)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !1015, file: !1005, line: 746, baseType: !1104, size: 320)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !1005, line: 459, size: 320, elements: !1105)
!1105 = !{!1106, !1107}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1104, file: !1005, line: 461, baseType: !1018, size: 256)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1104, file: !1005, line: 464, baseType: !709, size: 64, offset: 256)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !1015, file: !1005, line: 747, baseType: !1109, size: 768)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !1005, line: 469, size: 768, elements: !1110)
!1110 = !{!1111, !1112, !1113, !1114, !1115}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1109, file: !1005, line: 471, baseType: !1018, size: 256)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1109, file: !1005, line: 474, baseType: !7, size: 32, offset: 256)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1109, file: !1005, line: 475, baseType: !7, size: 32, offset: 288)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1109, file: !1005, line: 478, baseType: !709, size: 64, offset: 320)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1109, file: !1005, line: 481, baseType: !1116, size: 384, offset: 384)
!1116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1117, size: 384, elements: !608)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !135, line: 1917, size: 384, elements: !1118)
!1118 = !{!1119, !1120, !1121}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1117, file: !135, line: 1920, baseType: !1055, size: 256)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1117, file: !135, line: 1921, baseType: !709, size: 64, offset: 256)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1117, file: !135, line: 1922, baseType: !829, size: 32, offset: 320)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !1015, file: !1005, line: 748, baseType: !1123, size: 320)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !1005, line: 487, size: 320, elements: !1124)
!1124 = !{!1125, !1126}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1123, file: !1005, line: 490, baseType: !1018, size: 256)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1123, file: !1005, line: 494, baseType: !557, size: 32, offset: 256)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !1015, file: !1005, line: 749, baseType: !1128, size: 384)
!1128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !1005, line: 500, size: 384, elements: !1129)
!1129 = !{!1130, !1131, !1132}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1128, file: !1005, line: 502, baseType: !1018, size: 256)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1128, file: !1005, line: 506, baseType: !1002, size: 64, offset: 256)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1128, file: !1005, line: 510, baseType: !1002, size: 64, offset: 320)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !1015, file: !1005, line: 750, baseType: !1134, size: 320)
!1134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !1005, line: 529, size: 320, elements: !1135)
!1135 = !{!1136, !1137}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1134, file: !1005, line: 531, baseType: !1018, size: 256)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1134, file: !1005, line: 540, baseType: !1002, size: 64, offset: 256)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !1015, file: !1005, line: 751, baseType: !1139, size: 704)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !1005, line: 546, size: 704, elements: !1140)
!1140 = !{!1141, !1142, !1143, !1144, !1145, !1146, !1147}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1139, file: !1005, line: 549, baseType: !1069, size: 512)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1139, file: !1005, line: 553, baseType: !562, size: 64, offset: 512)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1139, file: !1005, line: 557, baseType: !556, size: 8, offset: 576)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1139, file: !1005, line: 558, baseType: !556, size: 8, offset: 584)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1139, file: !1005, line: 559, baseType: !556, size: 8, offset: 592)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1139, file: !1005, line: 560, baseType: !556, size: 8, offset: 600)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1139, file: !1005, line: 566, baseType: !1067, size: 64, offset: 640)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !1015, file: !1005, line: 752, baseType: !1149, size: 384)
!1149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !1005, line: 571, size: 384, elements: !1150)
!1150 = !{!1151, !1152}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1149, file: !1005, line: 573, baseType: !1080, size: 320)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1149, file: !1005, line: 577, baseType: !709, size: 64, offset: 320)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !1015, file: !1005, line: 753, baseType: !1154, size: 576)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !1005, line: 600, size: 576, elements: !1155)
!1155 = !{!1156, !1157, !1158, !1161, !1170}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1154, file: !1005, line: 602, baseType: !1080, size: 320)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1154, file: !1005, line: 605, baseType: !709, size: 64, offset: 320)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1154, file: !1005, line: 609, baseType: !1159, size: 64, offset: 384)
!1159 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1160, line: 46, baseType: !567)
!1160 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1154, file: !1005, line: 612, baseType: !1162, size: 64, offset: 448)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !1005, line: 581, size: 320, elements: !1164)
!1164 = !{!1165, !1166, !1167, !1168, !1169}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1163, file: !1005, line: 583, baseType: !134, size: 32)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1163, file: !1005, line: 586, baseType: !709, size: 64, offset: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1163, file: !1005, line: 589, baseType: !709, size: 64, offset: 128)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1163, file: !1005, line: 592, baseType: !709, size: 64, offset: 192)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1163, file: !1005, line: 595, baseType: !709, size: 64, offset: 256)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1154, file: !1005, line: 616, baseType: !1002, size: 64, offset: 512)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !1015, file: !1005, line: 754, baseType: !1172, size: 512)
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !1005, line: 622, size: 512, elements: !1173)
!1173 = !{!1174, !1175, !1176, !1177}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1172, file: !1005, line: 624, baseType: !1080, size: 320)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1172, file: !1005, line: 628, baseType: !709, size: 64, offset: 320)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1172, file: !1005, line: 632, baseType: !709, size: 64, offset: 384)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1172, file: !1005, line: 636, baseType: !709, size: 64, offset: 448)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !1015, file: !1005, line: 755, baseType: !1179, size: 704)
!1179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !1005, line: 642, size: 704, elements: !1180)
!1180 = !{!1181, !1182, !1183, !1184}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1179, file: !1005, line: 644, baseType: !1172, size: 512)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1179, file: !1005, line: 648, baseType: !709, size: 64, offset: 512)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1179, file: !1005, line: 652, baseType: !709, size: 64, offset: 576)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1179, file: !1005, line: 653, baseType: !709, size: 64, offset: 640)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !1015, file: !1005, line: 756, baseType: !1186, size: 448)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !1005, line: 663, size: 448, elements: !1187)
!1187 = !{!1188, !1189, !1190}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1186, file: !1005, line: 665, baseType: !1080, size: 320)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1186, file: !1005, line: 668, baseType: !709, size: 64, offset: 320)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1186, file: !1005, line: 673, baseType: !709, size: 64, offset: 384)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !1015, file: !1005, line: 757, baseType: !1192, size: 384)
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !1005, line: 694, size: 384, elements: !1193)
!1193 = !{!1194, !1195}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1192, file: !1005, line: 696, baseType: !1080, size: 320)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1192, file: !1005, line: 699, baseType: !709, size: 64, offset: 320)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !1015, file: !1005, line: 758, baseType: !1197, size: 384)
!1197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !1005, line: 681, size: 384, elements: !1198)
!1198 = !{!1199, !1200, !1201}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1197, file: !1005, line: 683, baseType: !1018, size: 256)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1197, file: !1005, line: 686, baseType: !709, size: 64, offset: 256)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1197, file: !1005, line: 689, baseType: !709, size: 64, offset: 320)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !1015, file: !1005, line: 759, baseType: !1203, size: 384)
!1203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !1005, line: 707, size: 384, elements: !1204)
!1204 = !{!1205, !1206, !1207}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1203, file: !1005, line: 709, baseType: !1018, size: 256)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1203, file: !1005, line: 712, baseType: !709, size: 64, offset: 256)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1203, file: !1005, line: 712, baseType: !709, size: 64, offset: 320)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !1015, file: !1005, line: 760, baseType: !1209, size: 320)
!1209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !1005, line: 718, size: 320, elements: !1210)
!1210 = !{!1211, !1212}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1209, file: !1005, line: 720, baseType: !1018, size: 256)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1209, file: !1005, line: 723, baseType: !709, size: 64, offset: 256)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1010, file: !1005, line: 138, baseType: !1009, size: 64, offset: 64)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1010, file: !1005, line: 139, baseType: !1009, size: 64, offset: 128)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1004, file: !1005, line: 146, baseType: !1008, size: 64, offset: 64)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1004, file: !1005, line: 152, baseType: !1002, size: 64, offset: 128)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !999, file: !330, line: 130, baseType: !573, size: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !994, file: !330, line: 134, baseType: !561, size: 64, offset: 192)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !994, file: !330, line: 137, baseType: !709, size: 64, offset: 256)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !994, file: !330, line: 138, baseType: !829, size: 32, offset: 320)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !994, file: !330, line: 142, baseType: !7, size: 32, offset: 352)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !994, file: !330, line: 144, baseType: !557, size: 32, offset: 384)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !994, file: !330, line: 145, baseType: !557, size: 32, offset: 416)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !994, file: !330, line: 146, baseType: !1225, size: 64, offset: 448)
!1225 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !330, line: 119, baseType: !680)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !977, file: !330, line: 220, baseType: !980, size: 64, offset: 64)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !977, file: !330, line: 223, baseType: !561, size: 64, offset: 128)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !977, file: !330, line: 226, baseType: !1229, size: 64, offset: 192)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64)
!1230 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !330, line: 185, flags: DIFlagFwdDecl)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !977, file: !330, line: 229, baseType: !1232, size: 128, offset: 256)
!1232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1233, size: 128, elements: !664)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64)
!1234 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !330, line: 229, flags: DIFlagFwdDecl)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !977, file: !330, line: 232, baseType: !976, size: 64, offset: 384)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !977, file: !330, line: 233, baseType: !976, size: 64, offset: 448)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !977, file: !330, line: 238, baseType: !1238, size: 64, offset: 512)
!1238 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !330, line: 235, size: 64, elements: !1239)
!1239 = !{!1240, !1246}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1238, file: !330, line: 236, baseType: !1241, size: 64)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64)
!1242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !330, line: 273, size: 128, elements: !1243)
!1243 = !{!1244, !1245}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1242, file: !330, line: 275, baseType: !1002, size: 64)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1242, file: !330, line: 278, baseType: !1002, size: 64, offset: 64)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1238, file: !330, line: 237, baseType: !1247, size: 64)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64)
!1248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !330, line: 259, size: 320, elements: !1249)
!1249 = !{!1250, !1251, !1252, !1253, !1254}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1248, file: !330, line: 261, baseType: !573, size: 64)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1248, file: !330, line: 262, baseType: !573, size: 64, offset: 64)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1248, file: !330, line: 266, baseType: !573, size: 64, offset: 128)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1248, file: !330, line: 267, baseType: !573, size: 64, offset: 192)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1248, file: !330, line: 270, baseType: !557, size: 32, offset: 256)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !977, file: !330, line: 241, baseType: !1225, size: 64, offset: 576)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !977, file: !330, line: 244, baseType: !557, size: 32, offset: 640)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !977, file: !330, line: 247, baseType: !557, size: 32, offset: 672)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !977, file: !330, line: 250, baseType: !557, size: 32, offset: 704)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !977, file: !330, line: 253, baseType: !557, size: 32, offset: 736)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !977, file: !330, line: 256, baseType: !557, size: 32, offset: 768)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !972, file: !330, line: 378, baseType: !975, size: 64, offset: 64)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !972, file: !330, line: 381, baseType: !1263, size: 64, offset: 128)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64)
!1264 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !330, line: 282, baseType: !1265)
!1265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !330, line: 282, size: 128, elements: !1266)
!1266 = !{!1267}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1265, file: !330, line: 282, baseType: !1268, size: 128)
!1268 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !330, line: 281, baseType: !1269)
!1269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !330, line: 281, size: 128, elements: !1270)
!1270 = !{!1271, !1272, !1273}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1269, file: !330, line: 281, baseType: !7, size: 32)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1269, file: !330, line: 281, baseType: !7, size: 32, offset: 32)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1269, file: !330, line: 281, baseType: !1274, size: 64, offset: 64)
!1274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !975, size: 64, elements: !608)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !972, file: !330, line: 384, baseType: !557, size: 32, offset: 192)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !972, file: !330, line: 387, baseType: !557, size: 32, offset: 224)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !972, file: !330, line: 390, baseType: !557, size: 32, offset: 256)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !972, file: !330, line: 394, baseType: !1263, size: 64, offset: 320)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !972, file: !330, line: 396, baseType: !329, size: 32, offset: 384)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !972, file: !330, line: 399, baseType: !1281, size: 64, offset: 416)
!1281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 64, elements: !664)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !972, file: !330, line: 402, baseType: !1283, size: 64, offset: 480)
!1283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !664)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !972, file: !330, line: 406, baseType: !557, size: 32, offset: 544)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !972, file: !330, line: 409, baseType: !557, size: 32, offset: 576)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !964, file: !965, line: 470, baseType: !1003, size: 64, offset: 128)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !964, file: !965, line: 473, baseType: !1288, size: 64, offset: 192)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64)
!1289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !915, line: 39, size: 1152, elements: !1290)
!1290 = !{!1291, !1341, !1354, !1366, !1367, !1379, !1380, !1384, !1385, !1386, !1387, !1388}
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1289, file: !915, line: 41, baseType: !1292, size: 64)
!1292 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1293, line: 144, baseType: !1294)
!1293 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64)
!1295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1293, line: 100, size: 896, elements: !1296)
!1296 = !{!1297, !1305, !1310, !1315, !1317, !1318, !1319, !1320, !1321, !1322, !1327, !1329, !1330, !1335, !1340}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1295, file: !1293, line: 102, baseType: !1298, size: 64)
!1298 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1293, line: 52, baseType: !1299)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64)
!1300 = !DISubroutineType(types: !1301)
!1301 = !{!1302, !1303}
!1302 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1293, line: 47, baseType: !7)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64)
!1304 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1295, file: !1293, line: 105, baseType: !1306, size: 64, offset: 64)
!1306 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1293, line: 59, baseType: !1307)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64)
!1308 = !DISubroutineType(types: !1309)
!1309 = !{!557, !1303, !1303}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1295, file: !1293, line: 108, baseType: !1311, size: 64, offset: 128)
!1311 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1293, line: 63, baseType: !1312)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64)
!1313 = !DISubroutineType(types: !1314)
!1314 = !{null, !561}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1295, file: !1293, line: 111, baseType: !1316, size: 64, offset: 192)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1295, file: !1293, line: 114, baseType: !1159, size: 64, offset: 256)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1295, file: !1293, line: 117, baseType: !1159, size: 64, offset: 320)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1295, file: !1293, line: 120, baseType: !1159, size: 64, offset: 384)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1295, file: !1293, line: 124, baseType: !7, size: 32, offset: 448)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1295, file: !1293, line: 128, baseType: !7, size: 32, offset: 480)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1295, file: !1293, line: 131, baseType: !1323, size: 64, offset: 512)
!1323 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1293, line: 75, baseType: !1324)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64)
!1325 = !DISubroutineType(types: !1326)
!1326 = !{!561, !1159, !1159}
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1295, file: !1293, line: 132, baseType: !1328, size: 64, offset: 576)
!1328 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1293, line: 78, baseType: !1312)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1295, file: !1293, line: 135, baseType: !561, size: 64, offset: 640)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1295, file: !1293, line: 136, baseType: !1331, size: 64, offset: 704)
!1331 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1293, line: 82, baseType: !1332)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64)
!1333 = !DISubroutineType(types: !1334)
!1334 = !{!561, !561, !1159, !1159}
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1295, file: !1293, line: 137, baseType: !1336, size: 64, offset: 768)
!1336 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1293, line: 83, baseType: !1337)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64)
!1338 = !DISubroutineType(types: !1339)
!1339 = !{null, !561, !561}
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1295, file: !1293, line: 141, baseType: !7, size: 32, offset: 832)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1289, file: !915, line: 48, baseType: !1342, size: 64, offset: 64)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64)
!1343 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !1005, line: 35, baseType: !1344)
!1344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !1005, line: 35, size: 128, elements: !1345)
!1345 = !{!1346}
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1344, file: !1005, line: 35, baseType: !1347, size: 128)
!1347 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !1005, line: 33, baseType: !1348)
!1348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !1005, line: 33, size: 128, elements: !1349)
