; ModuleID = 'alloca.bc'
source_filename = "alloca.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%union.hdr = type { %struct.anon }
%struct.anon = type { %union.hdr*, i8* }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stdout = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@stdin = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@stack_dir = internal unnamed_addr global i32 0, align 4, !dbg !0
@last_alloca_header = internal unnamed_addr global %union.hdr* null, align 8, !dbg !44
@libiberty_optr = common dso_local local_unnamed_addr global i8* null, align 8, !dbg !30
@libiberty_nptr = common dso_local local_unnamed_addr global i8* null, align 8, !dbg !32
@libiberty_len = common dso_local local_unnamed_addr global i64 0, align 8, !dbg !34
@find_stack_direction.addr = internal unnamed_addr global i8* null, align 8, !dbg !37

; Function Attrs: inlinehint nounwind uwtable
define dso_local i32 @vprintf(i8* noalias %__fmt, %struct.__va_list_tag* %__arg) local_unnamed_addr #0 !dbg !50 {
entry:

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "stack_dir", scope: !2, file: !3, line: 102, type: !8, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !29, nameTableKind: None)
!3 = !DIFile(filename: "alloca.c", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!4 = !{}
!5 = !{!6, !7, !8, !9, !12, !13, !10, !15}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!8 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "header", file: !3, line: 148, baseType: !17)
!17 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "hdr", file: !3, line: 140, size: 128, elements: !18)
!18 = !{!19, !23}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !17, file: !3, line: 142, baseType: !20, size: 64)
!20 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 64, elements: !21)
!21 = !{!22}
!22 = !DISubrange(count: 8)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !17, file: !3, line: 147, baseType: !24, size: 128)
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !17, file: !3, line: 143, size: 128, elements: !25)
!25 = !{!26, !28}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !24, file: !3, line: 145, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "deep", scope: !24, file: !3, line: 146, baseType: !10, size: 64, offset: 64)
!29 = !{!30, !32, !34, !0, !37, !44}
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "libiberty_optr", scope: !2, file: !3, line: 63, type: !13, isLocal: false, isDefinition: true)
!32 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression())
!33 = distinct !DIGlobalVariable(name: "libiberty_nptr", scope: !2, file: !3, line: 64, type: !10, isLocal: false, isDefinition: true)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "libiberty_len", scope: !2, file: !3, line: 65, type: !36, isLocal: false, isDefinition: true)
!36 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "addr", scope: !39, file: !3, line: 108, type: !10, isLocal: true, isDefinition: true)
!39 = distinct !DISubprogram(name: "find_stack_direction", scope: !3, file: !3, line: 106, type: !40, scopeLine: 107, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !42)
!40 = !DISubroutineType(types: !41)
!41 = !{null}
!42 = !{!43}
!43 = !DILocalVariable(name: "dummy", scope: !39, file: !3, line: 109, type: !11)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "last_alloca_header", scope: !2, file: !3, line: 150, type: !15, isLocal: true, isDefinition: true)
!46 = !{i32 2, !"Dwarf Version", i32 4}
!47 = !{i32 2, !"Debug Info Version", i32 3}
!48 = !{i32 1, !"wchar_size", i32 4}
!49 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!50 = distinct !DISubprogram(name: "vprintf", scope: !51, file: !51, line: 39, type: !52, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !63)
!51 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!52 = !DISubroutineType(types: !53)
!53 = !{!8, !54, !55}
!54 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !13)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, size: 192, elements: !57)
!57 = !{!58, !60, !61, !62}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !56, file: !3, baseType: !59, size: 32)
!59 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !56, file: !3, baseType: !59, size: 32, offset: 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !56, file: !3, baseType: !12, size: 64, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !56, file: !3, baseType: !12, size: 64, offset: 128)
!63 = !{!64, !65}
!64 = !DILocalVariable(name: "__fmt", arg: 1, scope: !50, file: !51, line: 39, type: !54)
!65 = !DILocalVariable(name: "__arg", arg: 2, scope: !50, file: !51, line: 39, type: !55)
!66 = !DILocation(line: 0, scope: !50)
!67 = !DILocation(line: 41, column: 20, scope: !50)
!68 = !DILocation(line: 41, column: 10, scope: !50)
!69 = !DILocation(line: 41, column: 3, scope: !50)
!70 = distinct !DISubprogram(name: "getchar", scope: !51, file: !51, line: 47, type: !71, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!71 = !DISubroutineType(types: !72)
!72 = !{!8}
!73 = !DILocation(line: 49, column: 16, scope: !70)
!74 = !DILocation(line: 49, column: 10, scope: !70)
!75 = !DILocation(line: 49, column: 3, scope: !70)
!76 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !51, file: !51, line: 56, type: !77, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !137)
!77 = !DISubroutineType(types: !78)
!78 = !{!8, !79}
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !81, line: 7, baseType: !82)
!81 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !83, line: 49, size: 1728, elements: !84)
!83 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!84 = !{!85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !100, !102, !103, !104, !108, !110, !112, !116, !119, !121, !124, !127, !128, !129, !132, !133}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !82, file: !83, line: 51, baseType: !8, size: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !82, file: !83, line: 54, baseType: !10, size: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !82, file: !83, line: 55, baseType: !10, size: 64, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !82, file: !83, line: 56, baseType: !10, size: 64, offset: 192)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !82, file: !83, line: 57, baseType: !10, size: 64, offset: 256)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !82, file: !83, line: 58, baseType: !10, size: 64, offset: 320)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !82, file: !83, line: 59, baseType: !10, size: 64, offset: 384)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !82, file: !83, line: 60, baseType: !10, size: 64, offset: 448)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !82, file: !83, line: 61, baseType: !10, size: 64, offset: 512)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !82, file: !83, line: 64, baseType: !10, size: 64, offset: 576)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !82, file: !83, line: 65, baseType: !10, size: 64, offset: 640)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !82, file: !83, line: 66, baseType: !10, size: 64, offset: 704)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !82, file: !83, line: 68, baseType: !98, size: 64, offset: 768)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !83, line: 36, flags: DIFlagFwdDecl)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !82, file: !83, line: 70, baseType: !101, size: 64, offset: 832)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !82, file: !83, line: 72, baseType: !8, size: 32, offset: 896)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !82, file: !83, line: 73, baseType: !8, size: 32, offset: 928)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !82, file: !83, line: 74, baseType: !105, size: 64, offset: 960)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !106, line: 152, baseType: !107)
!106 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!107 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !82, file: !83, line: 77, baseType: !109, size: 16, offset: 1024)
!109 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !82, file: !83, line: 78, baseType: !111, size: 8, offset: 1040)
!111 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !82, file: !83, line: 79, baseType: !113, size: 8, offset: 1048)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 8, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 1)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !82, file: !83, line: 81, baseType: !117, size: 64, offset: 1088)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !83, line: 43, baseType: null)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !82, file: !83, line: 89, baseType: !120, size: 64, offset: 1152)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !106, line: 153, baseType: !107)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !82, file: !83, line: 91, baseType: !122, size: 64, offset: 1216)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !83, line: 37, flags: DIFlagFwdDecl)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !82, file: !83, line: 92, baseType: !125, size: 64, offset: 1280)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !83, line: 38, flags: DIFlagFwdDecl)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !82, file: !83, line: 93, baseType: !101, size: 64, offset: 1344)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !82, file: !83, line: 94, baseType: !12, size: 64, offset: 1408)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !82, file: !83, line: 95, baseType: !130, size: 64, offset: 1472)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !131, line: 46, baseType: !36)
!131 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !82, file: !83, line: 96, baseType: !8, size: 32, offset: 1536)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !82, file: !83, line: 98, baseType: !134, size: 160, offset: 1568)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 160, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 20)
!137 = !{!138}
!138 = !DILocalVariable(name: "__fp", arg: 1, scope: !76, file: !51, line: 56, type: !79)
!139 = !DILocation(line: 0, scope: !76)
!140 = !DILocation(line: 58, column: 10, scope: !76)
!141 = !DILocation(line: 58, column: 3, scope: !76)
!142 = distinct !DISubprogram(name: "getc_unlocked", scope: !51, file: !51, line: 66, type: !77, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !143)
!143 = !{!144}
!144 = !DILocalVariable(name: "__fp", arg: 1, scope: !142, file: !51, line: 66, type: !79)
!145 = !DILocation(line: 0, scope: !142)
!146 = !DILocation(line: 68, column: 10, scope: !142)
!147 = !DILocation(line: 68, column: 3, scope: !142)
!148 = distinct !DISubprogram(name: "getchar_unlocked", scope: !51, file: !51, line: 73, type: !71, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!149 = !DILocation(line: 75, column: 10, scope: !148)
!150 = !DILocation(line: 75, column: 3, scope: !148)
!151 = distinct !DISubprogram(name: "putchar", scope: !51, file: !51, line: 82, type: !152, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !154)
!152 = !DISubroutineType(types: !153)
!153 = !{!8, !8}
!154 = !{!155}
!155 = !DILocalVariable(name: "__c", arg: 1, scope: !151, file: !51, line: 82, type: !8)
!156 = !DILocation(line: 0, scope: !151)
!157 = !DILocation(line: 84, column: 21, scope: !151)
!158 = !DILocation(line: 84, column: 10, scope: !151)
!159 = !DILocation(line: 84, column: 3, scope: !151)
!160 = distinct !DISubprogram(name: "fputc_unlocked", scope: !51, file: !51, line: 91, type: !161, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !163)
!161 = !DISubroutineType(types: !162)
!162 = !{!8, !8, !79}
!163 = !{!164, !165}
!164 = !DILocalVariable(name: "__c", arg: 1, scope: !160, file: !51, line: 91, type: !8)
!165 = !DILocalVariable(name: "__stream", arg: 2, scope: !160, file: !51, line: 91, type: !79)
!166 = !DILocation(line: 0, scope: !160)
!167 = !DILocation(line: 93, column: 10, scope: !160)
!168 = !DILocation(line: 93, column: 3, scope: !160)
!169 = distinct !DISubprogram(name: "putc_unlocked", scope: !51, file: !51, line: 101, type: !161, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !170)
!170 = !{!171, !172}
!171 = !DILocalVariable(name: "__c", arg: 1, scope: !169, file: !51, line: 101, type: !8)
!172 = !DILocalVariable(name: "__stream", arg: 2, scope: !169, file: !51, line: 101, type: !79)
!173 = !DILocation(line: 0, scope: !169)
!174 = !DILocation(line: 103, column: 10, scope: !169)
!175 = !DILocation(line: 103, column: 3, scope: !169)
!176 = distinct !DISubprogram(name: "putchar_unlocked", scope: !51, file: !51, line: 108, type: !152, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !177)
!177 = !{!178}
!178 = !DILocalVariable(name: "__c", arg: 1, scope: !176, file: !51, line: 108, type: !8)
!179 = !DILocation(line: 0, scope: !176)
!180 = !DILocation(line: 110, column: 10, scope: !176)
!181 = !DILocation(line: 110, column: 3, scope: !176)
!182 = distinct !DISubprogram(name: "getline", scope: !51, file: !51, line: 118, type: !183, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !187)
!183 = !DISubroutineType(types: !184)
!184 = !{!185, !9, !186, !79}
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !106, line: 193, baseType: !107)
