; ModuleID = 'alloc-pool.bc'
source_filename = "alloc-pool.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.stat64 = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.alloc_pool_def = type { i8*, i64, %struct.alloc_pool_list_def*, i8*, i64, i64, i64, i64, %struct.alloc_pool_list_def*, i64, i64 }
%struct.alloc_pool_list_def = type { %struct.alloc_pool_list_def* }

@stdout = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@stdin = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [13 x i8] c"alloc-pool.c\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"?\00", align 1

; Function Attrs: inlinehint nounwind uwtable

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, nameTableKind: None)
!1 = !DIFile(filename: "alloc-pool.c", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2 = !{}
!3 = !{!4, !5, !6, !7, !10, !11, !13, !8, !23, !36}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "alloc_pool_def", file: !15, line: 32, size: 704, elements: !16)
!15 = !DIFile(filename: "./alloc-pool.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!16 = !{!17, !18, !22, !28, !29, !30, !31, !32, !33, !34, !35}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !14, file: !15, line: 34, baseType: !11, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "elts_per_block", scope: !14, file: !15, line: 38, baseType: !19, size: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !20, line: 46, baseType: !21)
!20 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!21 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "returned_free_list", scope: !14, file: !15, line: 41, baseType: !23, size: 64, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_pool_list", file: !15, line: 30, baseType: !24)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "alloc_pool_list_def", file: !15, line: 26, size: 64, elements: !26)
!26 = !{!27}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !25, file: !15, line: 28, baseType: !24, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "virgin_free_list", scope: !14, file: !15, line: 45, baseType: !8, size: 64, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "virgin_elts_remaining", scope: !14, file: !15, line: 49, baseType: !19, size: 64, offset: 256)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "elts_allocated", scope: !14, file: !15, line: 51, baseType: !19, size: 64, offset: 320)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "elts_free", scope: !14, file: !15, line: 52, baseType: !19, size: 64, offset: 384)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_allocated", scope: !14, file: !15, line: 53, baseType: !19, size: 64, offset: 448)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "block_list", scope: !14, file: !15, line: 54, baseType: !23, size: 64, offset: 512)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !14, file: !15, line: 55, baseType: !19, size: 64, offset: 576)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "elt_size", scope: !14, file: !15, line: 56, baseType: !19, size: 64, offset: 640)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocation_object", file: !1, line: 49, baseType: !38)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "allocation_object_def", file: !1, line: 30, size: 64, elements: !39)
!39 = !{!40}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !38, file: !1, line: 48, baseType: !41, size: 64)
!41 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !38, file: !1, line: 37, size: 64, elements: !42)
!42 = !{!43, !47, !48}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !41, file: !1, line: 40, baseType: !44, size: 8)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8, elements: !45)
!45 = !{!46}
!46 = !DISubrange(count: 1)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "align_p", scope: !41, file: !1, line: 46, baseType: !8, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "align_i", scope: !41, file: !1, line: 47, baseType: !49, size: 64)
!49 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!50 = !{i32 2, !"Dwarf Version", i32 4}
!51 = !{i32 2, !"Debug Info Version", i32 3}
!52 = !{i32 1, !"wchar_size", i32 4}
!53 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!54 = distinct !DISubprogram(name: "vprintf", scope: !55, file: !55, line: 39, type: !56, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !67)
!55 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!56 = !DISubroutineType(types: !57)
!57 = !{!6, !58, !59}
!58 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !11)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, elements: !61)
!61 = !{!62, !64, !65, !66}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !60, file: !1, baseType: !63, size: 32)
!63 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !60, file: !1, baseType: !63, size: 32, offset: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !60, file: !1, baseType: !10, size: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !60, file: !1, baseType: !10, size: 64, offset: 128)
!67 = !{!68, !69}
!68 = !DILocalVariable(name: "__fmt", arg: 1, scope: !54, file: !55, line: 39, type: !58)
!69 = !DILocalVariable(name: "__arg", arg: 2, scope: !54, file: !55, line: 39, type: !59)
!70 = !DILocation(line: 0, scope: !54)
!71 = !DILocation(line: 41, column: 20, scope: !54)
!72 = !DILocation(line: 41, column: 10, scope: !54)
!73 = !DILocation(line: 41, column: 3, scope: !54)
!74 = distinct !DISubprogram(name: "getchar", scope: !55, file: !55, line: 47, type: !75, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !2)
!75 = !DISubroutineType(types: !76)
!76 = !{!6}
!77 = !DILocation(line: 49, column: 16, scope: !74)
!78 = !DILocation(line: 49, column: 10, scope: !74)
!79 = !DILocation(line: 49, column: 3, scope: !74)
!80 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !55, file: !55, line: 56, type: !81, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !135)
!81 = !DISubroutineType(types: !82)
!82 = !{!6, !83}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !85, line: 7, baseType: !86)
!85 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !87, line: 49, size: 1728, elements: !88)
!87 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!88 = !{!89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !104, !106, !107, !108, !111, !113, !115, !116, !119, !121, !124, !127, !128, !129, !130, !131}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !86, file: !87, line: 51, baseType: !6, size: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !86, file: !87, line: 54, baseType: !8, size: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !86, file: !87, line: 55, baseType: !8, size: 64, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !86, file: !87, line: 56, baseType: !8, size: 64, offset: 192)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !86, file: !87, line: 57, baseType: !8, size: 64, offset: 256)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !86, file: !87, line: 58, baseType: !8, size: 64, offset: 320)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !86, file: !87, line: 59, baseType: !8, size: 64, offset: 384)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !86, file: !87, line: 60, baseType: !8, size: 64, offset: 448)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !86, file: !87, line: 61, baseType: !8, size: 64, offset: 512)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !86, file: !87, line: 64, baseType: !8, size: 64, offset: 576)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !86, file: !87, line: 65, baseType: !8, size: 64, offset: 640)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !86, file: !87, line: 66, baseType: !8, size: 64, offset: 704)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !86, file: !87, line: 68, baseType: !102, size: 64, offset: 768)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !87, line: 36, flags: DIFlagFwdDecl)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !86, file: !87, line: 70, baseType: !105, size: 64, offset: 832)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !86, file: !87, line: 72, baseType: !6, size: 32, offset: 896)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !86, file: !87, line: 73, baseType: !6, size: 32, offset: 928)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !86, file: !87, line: 74, baseType: !109, size: 64, offset: 960)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !110, line: 152, baseType: !49)
!110 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !86, file: !87, line: 77, baseType: !112, size: 16, offset: 1024)
!112 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !86, file: !87, line: 78, baseType: !114, size: 8, offset: 1040)
!114 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !86, file: !87, line: 79, baseType: !44, size: 8, offset: 1048)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !86, file: !87, line: 81, baseType: !117, size: 64, offset: 1088)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !87, line: 43, baseType: null)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !86, file: !87, line: 89, baseType: !120, size: 64, offset: 1152)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !110, line: 153, baseType: !49)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !86, file: !87, line: 91, baseType: !122, size: 64, offset: 1216)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !87, line: 37, flags: DIFlagFwdDecl)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !86, file: !87, line: 92, baseType: !125, size: 64, offset: 1280)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !87, line: 38, flags: DIFlagFwdDecl)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !86, file: !87, line: 93, baseType: !105, size: 64, offset: 1344)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !86, file: !87, line: 94, baseType: !10, size: 64, offset: 1408)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !86, file: !87, line: 95, baseType: !19, size: 64, offset: 1472)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !86, file: !87, line: 96, baseType: !6, size: 32, offset: 1536)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !86, file: !87, line: 98, baseType: !132, size: 160, offset: 1568)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 160, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 20)
!135 = !{!136}
!136 = !DILocalVariable(name: "__fp", arg: 1, scope: !80, file: !55, line: 56, type: !83)
!137 = !DILocation(line: 0, scope: !80)
!138 = !DILocation(line: 58, column: 10, scope: !80)
!139 = !DILocation(line: 58, column: 3, scope: !80)
!140 = distinct !DISubprogram(name: "getc_unlocked", scope: !55, file: !55, line: 66, type: !81, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !141)
!141 = !{!142}
!142 = !DILocalVariable(name: "__fp", arg: 1, scope: !140, file: !55, line: 66, type: !83)
!143 = !DILocation(line: 0, scope: !140)
!144 = !DILocation(line: 68, column: 10, scope: !140)
!145 = !DILocation(line: 68, column: 3, scope: !140)
!146 = distinct !DISubprogram(name: "getchar_unlocked", scope: !55, file: !55, line: 73, type: !75, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !2)
!147 = !DILocation(line: 75, column: 10, scope: !146)
!148 = !DILocation(line: 75, column: 3, scope: !146)
!149 = distinct !DISubprogram(name: "putchar", scope: !55, file: !55, line: 82, type: !150, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !152)
!150 = !DISubroutineType(types: !151)
!151 = !{!6, !6}
!152 = !{!153}
!153 = !DILocalVariable(name: "__c", arg: 1, scope: !149, file: !55, line: 82, type: !6)
!154 = !DILocation(line: 0, scope: !149)
!155 = !DILocation(line: 84, column: 21, scope: !149)
!156 = !DILocation(line: 84, column: 10, scope: !149)
!157 = !DILocation(line: 84, column: 3, scope: !149)
!158 = distinct !DISubprogram(name: "fputc_unlocked", scope: !55, file: !55, line: 91, type: !159, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !161)
!159 = !DISubroutineType(types: !160)
!160 = !{!6, !6, !83}
!161 = !{!162, !163}
!162 = !DILocalVariable(name: "__c", arg: 1, scope: !158, file: !55, line: 91, type: !6)
!163 = !DILocalVariable(name: "__stream", arg: 2, scope: !158, file: !55, line: 91, type: !83)
!164 = !DILocation(line: 0, scope: !158)
!165 = !DILocation(line: 93, column: 10, scope: !158)
!166 = !DILocation(line: 93, column: 3, scope: !158)
!167 = distinct !DISubprogram(name: "putc_unlocked", scope: !55, file: !55, line: 101, type: !159, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !168)
!168 = !{!169, !170}
!169 = !DILocalVariable(name: "__c", arg: 1, scope: !167, file: !55, line: 101, type: !6)
!170 = !DILocalVariable(name: "__stream", arg: 2, scope: !167, file: !55, line: 101, type: !83)
!171 = !DILocation(line: 0, scope: !167)
!172 = !DILocation(line: 103, column: 10, scope: !167)
!173 = !DILocation(line: 103, column: 3, scope: !167)
!174 = distinct !DISubprogram(name: "putchar_unlocked", scope: !55, file: !55, line: 108, type: !150, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !175)
!175 = !{!176}
!176 = !DILocalVariable(name: "__c", arg: 1, scope: !174, file: !55, line: 108, type: !6)
!177 = !DILocation(line: 0, scope: !174)
!178 = !DILocation(line: 110, column: 10, scope: !174)
!179 = !DILocation(line: 110, column: 3, scope: !174)
!180 = distinct !DISubprogram(name: "getline", scope: !55, file: !55, line: 118, type: !181, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !185)
!181 = !DISubroutineType(types: !182)
!182 = !{!183, !7, !184, !83}
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !110, line: 193, baseType: !49)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!185 = !{!186, !187, !188}
!186 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !180, file: !55, line: 118, type: !7)
!187 = !DILocalVariable(name: "__n", arg: 2, scope: !180, file: !55, line: 118, type: !184)
!188 = !DILocalVariable(name: "__stream", arg: 3, scope: !180, file: !55, line: 118, type: !83)
!189 = !DILocation(line: 0, scope: !180)
!190 = !DILocation(line: 120, column: 10, scope: !180)
!191 = !DILocation(line: 120, column: 3, scope: !180)
!192 = distinct !DISubprogram(name: "feof_unlocked", scope: !55, file: !55, line: 128, type: !81, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !193)
!193 = !{!194}
!194 = !DILocalVariable(name: "__stream", arg: 1, scope: !192, file: !55, line: 128, type: !83)
!195 = !DILocation(line: 0, scope: !192)
!196 = !DILocation(line: 130, column: 10, scope: !192)
!197 = !DILocation(line: 130, column: 3, scope: !192)
!198 = distinct !DISubprogram(name: "ferror_unlocked", scope: !55, file: !55, line: 135, type: !81, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !199)
!199 = !{!200}
!200 = !DILocalVariable(name: "__stream", arg: 1, scope: !198, file: !55, line: 135, type: !83)
!201 = !DILocation(line: 0, scope: !198)
!202 = !DILocation(line: 137, column: 10, scope: !198)
!203 = !DILocation(line: 137, column: 3, scope: !198)
!204 = distinct !DISubprogram(name: "tolower", scope: !205, file: !205, line: 207, type: !150, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !206)
!205 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!206 = !{!207}
!207 = !DILocalVariable(name: "__c", arg: 1, scope: !204, file: !205, line: 207, type: !6)
!208 = !DILocation(line: 0, scope: !204)
!209 = !DILocation(line: 209, column: 22, scope: !204)
!210 = !DILocation(line: 209, column: 39, scope: !204)
!211 = !DILocation(line: 209, column: 38, scope: !204)
!212 = !DILocation(line: 209, column: 37, scope: !204)
!213 = !DILocation(line: 209, column: 10, scope: !204)
!214 = !DILocation(line: 209, column: 3, scope: !204)
!215 = distinct !DISubprogram(name: "toupper", scope: !205, file: !205, line: 213, type: !150, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !216)
!216 = !{!217}
!217 = !DILocalVariable(name: "__c", arg: 1, scope: !215, file: !205, line: 213, type: !6)
!218 = !DILocation(line: 0, scope: !215)
!219 = !DILocation(line: 215, column: 22, scope: !215)
!220 = !DILocation(line: 215, column: 39, scope: !215)
!221 = !DILocation(line: 215, column: 38, scope: !215)
!222 = !DILocation(line: 215, column: 37, scope: !215)
!223 = !DILocation(line: 215, column: 10, scope: !215)
!224 = !DILocation(line: 215, column: 3, scope: !215)
!225 = distinct !DISubprogram(name: "atoi", scope: !226, file: !226, line: 361, type: !227, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !229)
!226 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!227 = !DISubroutineType(types: !228)
!228 = !{!6, !11}
!229 = !{!230}
!230 = !DILocalVariable(name: "__nptr", arg: 1, scope: !225, file: !226, line: 361, type: !11)
!231 = !DILocation(line: 0, scope: !225)
!232 = !DILocation(line: 363, column: 16, scope: !225)
!233 = !DILocation(line: 363, column: 10, scope: !225)
!234 = !DILocation(line: 363, column: 3, scope: !225)
!235 = distinct !DISubprogram(name: "atol", scope: !226, file: !226, line: 366, type: !236, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !238)
!236 = !DISubroutineType(types: !237)
!237 = !{!49, !11}
!238 = !{!239}
!239 = !DILocalVariable(name: "__nptr", arg: 1, scope: !235, file: !226, line: 366, type: !11)
!240 = !DILocation(line: 0, scope: !235)
!241 = !DILocation(line: 368, column: 10, scope: !235)
!242 = !DILocation(line: 368, column: 3, scope: !235)
!243 = distinct !DISubprogram(name: "atoll", scope: !226, file: !226, line: 373, type: !244, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !247)
!244 = !DISubroutineType(types: !245)
!245 = !{!246, !11}
!246 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!247 = !{!248}
!248 = !DILocalVariable(name: "__nptr", arg: 1, scope: !243, file: !226, line: 373, type: !11)
!249 = !DILocation(line: 0, scope: !243)
!250 = !DILocation(line: 375, column: 10, scope: !243)
!251 = !DILocation(line: 375, column: 3, scope: !243)
!252 = distinct !DISubprogram(name: "bsearch", scope: !253, file: !253, line: 20, type: !254, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !262)
!253 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!254 = !DISubroutineType(types: !255)
!255 = !{!10, !256, !256, !19, !19, !258}
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !226, line: 808, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{!6, !256, !256}
!262 = !{!263, !264, !265, !266, !267, !268, !269, !270, !271, !272}
!263 = !DILocalVariable(name: "__key", arg: 1, scope: !252, file: !253, line: 20, type: !256)
!264 = !DILocalVariable(name: "__base", arg: 2, scope: !252, file: !253, line: 20, type: !256)
!265 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !252, file: !253, line: 20, type: !19)
!266 = !DILocalVariable(name: "__size", arg: 4, scope: !252, file: !253, line: 20, type: !19)
!267 = !DILocalVariable(name: "__compar", arg: 5, scope: !252, file: !253, line: 21, type: !258)
!268 = !DILocalVariable(name: "__l", scope: !252, file: !253, line: 23, type: !19)
!269 = !DILocalVariable(name: "__u", scope: !252, file: !253, line: 23, type: !19)
!270 = !DILocalVariable(name: "__idx", scope: !252, file: !253, line: 23, type: !19)
!271 = !DILocalVariable(name: "__p", scope: !252, file: !253, line: 24, type: !256)
!272 = !DILocalVariable(name: "__comparison", scope: !252, file: !253, line: 25, type: !6)
!273 = !DILocation(line: 0, scope: !252)
!274 = !DILocation(line: 29, column: 3, scope: !252)
!275 = !DILocation(line: 27, column: 7, scope: !252)
!276 = !DILocation(line: 29, column: 14, scope: !252)
!277 = !DILocation(line: 31, column: 20, scope: !278)
!278 = distinct !DILexicalBlock(scope: !252, file: !253, line: 30, column: 5)
!279 = !DILocation(line: 31, column: 27, scope: !278)
!280 = !DILocation(line: 32, column: 56, scope: !278)
!281 = !DILocation(line: 32, column: 47, scope: !278)
!282 = !DILocation(line: 33, column: 22, scope: !278)
!283 = !DILocation(line: 34, column: 24, scope: !284)
!284 = distinct !DILexicalBlock(scope: !278, file: !253, line: 34, column: 11)
!285 = !DILocation(line: 34, column: 11, scope: !278)
!286 = !DILocation(line: 36, column: 29, scope: !287)
!287 = distinct !DILexicalBlock(scope: !284, file: !253, line: 36, column: 16)
!288 = !DILocation(line: 36, column: 16, scope: !284)
!289 = !DILocation(line: 37, column: 14, scope: !287)
!290 = distinct !{!290, !274, !291}
!291 = !DILocation(line: 40, column: 5, scope: !252)
!292 = !DILocation(line: 43, column: 1, scope: !252)
!293 = distinct !DISubprogram(name: "atof", scope: !294, file: !294, line: 25, type: !295, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !298)
!294 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!295 = !DISubroutineType(types: !296)
!296 = !{!297, !11}
!297 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!298 = !{!299}
!299 = !DILocalVariable(name: "__nptr", arg: 1, scope: !293, file: !294, line: 25, type: !11)
!300 = !DILocation(line: 0, scope: !293)
!301 = !DILocation(line: 27, column: 10, scope: !293)
!302 = !DILocation(line: 27, column: 3, scope: !293)
!303 = distinct !DISubprogram(name: "strtoimax", scope: !304, file: !304, line: 324, type: !305, scopeLine: 326, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !311)
!304 = !DIFile(filename: "/usr/include/inttypes.h", directory: "")
!305 = !DISubroutineType(types: !306)
!306 = !{!307, !58, !310, !6}
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !308, line: 101, baseType: !309)
!308 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !110, line: 72, baseType: !49)
!310 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !7)
!311 = !{!312, !313, !314}
!312 = !DILocalVariable(name: "nptr", arg: 1, scope: !303, file: !304, line: 324, type: !58)
!313 = !DILocalVariable(name: "endptr", arg: 2, scope: !303, file: !304, line: 324, type: !310)
!314 = !DILocalVariable(name: "base", arg: 3, scope: !303, file: !304, line: 324, type: !6)
!315 = !DILocation(line: 0, scope: !303)
!316 = !DILocation(line: 327, column: 10, scope: !303)
!317 = !DILocation(line: 327, column: 3, scope: !303)
!318 = distinct !DISubprogram(name: "strtoumax", scope: !304, file: !304, line: 336, type: !319, scopeLine: 338, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !323)
!319 = !DISubroutineType(types: !320)
!320 = !{!321, !58, !310, !6}
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !308, line: 102, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !110, line: 73, baseType: !21)
!323 = !{!324, !325, !326}
!324 = !DILocalVariable(name: "nptr", arg: 1, scope: !318, file: !304, line: 336, type: !58)
!325 = !DILocalVariable(name: "endptr", arg: 2, scope: !318, file: !304, line: 336, type: !310)
!326 = !DILocalVariable(name: "base", arg: 3, scope: !318, file: !304, line: 336, type: !6)
!327 = !DILocation(line: 0, scope: !318)
!328 = !DILocation(line: 339, column: 10, scope: !318)
!329 = !DILocation(line: 339, column: 3, scope: !318)
!330 = distinct !DISubprogram(name: "wcstoimax", scope: !304, file: !304, line: 348, type: !331, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !340)
!331 = !DISubroutineType(types: !332)
!332 = !{!307, !333, !337, !6}
!333 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gwchar_t", file: !304, line: 34, baseType: !6)
!337 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!340 = !{!341, !342, !343}
!341 = !DILocalVariable(name: "nptr", arg: 1, scope: !330, file: !304, line: 348, type: !333)
!342 = !DILocalVariable(name: "endptr", arg: 2, scope: !330, file: !304, line: 348, type: !337)
!343 = !DILocalVariable(name: "base", arg: 3, scope: !330, file: !304, line: 348, type: !6)
!344 = !DILocation(line: 0, scope: !330)
!345 = !DILocation(line: 351, column: 10, scope: !330)
!346 = !DILocation(line: 351, column: 3, scope: !330)
!347 = distinct !DISubprogram(name: "wcstoumax", scope: !304, file: !304, line: 362, type: !348, scopeLine: 364, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !350)
!348 = !DISubroutineType(types: !349)
!349 = !{!321, !333, !337, !6}
!350 = !{!351, !352, !353}
!351 = !DILocalVariable(name: "nptr", arg: 1, scope: !347, file: !304, line: 362, type: !333)
!352 = !DILocalVariable(name: "endptr", arg: 2, scope: !347, file: !304, line: 362, type: !337)
!353 = !DILocalVariable(name: "base", arg: 3, scope: !347, file: !304, line: 362, type: !6)
!354 = !DILocation(line: 0, scope: !347)
!355 = !DILocation(line: 365, column: 10, scope: !347)
!356 = !DILocation(line: 365, column: 3, scope: !347)
!357 = distinct !DISubprogram(name: "stat", scope: !358, file: !358, line: 453, type: !359, scopeLine: 454, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !398)
!358 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "")
!359 = !DISubroutineType(types: !360)
!360 = !{!6, !11, !361}
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !363, line: 46, size: 1152, elements: !364)
!363 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!364 = !{!365, !367, !369, !371, !373, !375, !377, !378, !379, !380, !382, !384, !392, !393, !394}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !362, file: !363, line: 48, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !110, line: 145, baseType: !21)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !362, file: !363, line: 53, baseType: !368, size: 64, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !110, line: 148, baseType: !21)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !362, file: !363, line: 61, baseType: !370, size: 64, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !110, line: 151, baseType: !21)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !362, file: !363, line: 62, baseType: !372, size: 32, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !110, line: 150, baseType: !63)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !362, file: !363, line: 64, baseType: !374, size: 32, offset: 224)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !110, line: 146, baseType: !63)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !362, file: !363, line: 65, baseType: !376, size: 32, offset: 256)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !110, line: 147, baseType: !63)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !362, file: !363, line: 67, baseType: !6, size: 32, offset: 288)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !362, file: !363, line: 69, baseType: !366, size: 64, offset: 320)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !362, file: !363, line: 74, baseType: !109, size: 64, offset: 384)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !362, file: !363, line: 78, baseType: !381, size: 64, offset: 448)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !110, line: 174, baseType: !49)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !362, file: !363, line: 80, baseType: !383, size: 64, offset: 512)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !110, line: 179, baseType: !49)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !362, file: !363, line: 91, baseType: !385, size: 128, offset: 576)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !386, line: 10, size: 128, elements: !387)
!386 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!387 = !{!388, !390}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !385, file: !386, line: 12, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !110, line: 160, baseType: !49)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !385, file: !386, line: 16, baseType: !391, size: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !110, line: 196, baseType: !49)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !362, file: !363, line: 92, baseType: !385, size: 128, offset: 704)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !362, file: !363, line: 93, baseType: !385, size: 128, offset: 832)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !362, file: !363, line: 106, baseType: !395, size: 192, offset: 960)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !391, size: 192, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 3)
!398 = !{!399, !400}
!399 = !DILocalVariable(name: "__path", arg: 1, scope: !357, file: !358, line: 453, type: !11)
!400 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !357, file: !358, line: 453, type: !361)
!401 = !DILocation(line: 0, scope: !357)
!402 = !DILocation(line: 455, column: 10, scope: !357)
!403 = !DILocation(line: 455, column: 3, scope: !357)
!404 = distinct !DISubprogram(name: "lstat", scope: !358, file: !358, line: 460, type: !359, scopeLine: 461, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !405)
!405 = !{!406, !407}
!406 = !DILocalVariable(name: "__path", arg: 1, scope: !404, file: !358, line: 460, type: !11)
!407 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !404, file: !358, line: 460, type: !361)
!408 = !DILocation(line: 0, scope: !404)
!409 = !DILocation(line: 462, column: 10, scope: !404)
!410 = !DILocation(line: 462, column: 3, scope: !404)
!411 = distinct !DISubprogram(name: "fstat", scope: !358, file: !358, line: 467, type: !412, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !414)
!412 = !DISubroutineType(types: !413)
!413 = !{!6, !6, !361}
!414 = !{!415, !416}
!415 = !DILocalVariable(name: "__fd", arg: 1, scope: !411, file: !358, line: 467, type: !6)
!416 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !411, file: !358, line: 467, type: !361)
!417 = !DILocation(line: 0, scope: !411)
!418 = !DILocation(line: 469, column: 10, scope: !411)
!419 = !DILocation(line: 469, column: 3, scope: !411)
!420 = distinct !DISubprogram(name: "fstatat", scope: !358, file: !358, line: 474, type: !421, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !423)
!421 = !DISubroutineType(types: !422)
!422 = !{!6, !6, !11, !361, !6}
!423 = !{!424, !425, !426, !427}
!424 = !DILocalVariable(name: "__fd", arg: 1, scope: !420, file: !358, line: 474, type: !6)
!425 = !DILocalVariable(name: "__filename", arg: 2, scope: !420, file: !358, line: 474, type: !11)
!426 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !420, file: !358, line: 474, type: !361)
!427 = !DILocalVariable(name: "__flag", arg: 4, scope: !420, file: !358, line: 474, type: !6)
!428 = !DILocation(line: 0, scope: !420)
!429 = !DILocation(line: 477, column: 10, scope: !420)
!430 = !DILocation(line: 477, column: 3, scope: !420)
!431 = distinct !DISubprogram(name: "mknod", scope: !358, file: !358, line: 483, type: !432, scopeLine: 484, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !434)
!432 = !DISubroutineType(types: !433)
!433 = !{!6, !11, !372, !366}
!434 = !{!435, !436, !437}
!435 = !DILocalVariable(name: "__path", arg: 1, scope: !431, file: !358, line: 483, type: !11)
!436 = !DILocalVariable(name: "__mode", arg: 2, scope: !431, file: !358, line: 483, type: !372)
!437 = !DILocalVariable(name: "__dev", arg: 3, scope: !431, file: !358, line: 483, type: !366)
!438 = !DILocation(line: 0, scope: !431)
!439 = !DILocation(line: 485, column: 10, scope: !431)
!440 = !DILocation(line: 485, column: 3, scope: !431)
!441 = distinct !DISubprogram(name: "mknodat", scope: !358, file: !358, line: 491, type: !442, scopeLine: 493, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !444)
!442 = !DISubroutineType(types: !443)
!443 = !{!6, !6, !11, !372, !366}
!444 = !{!445, !446, !447, !448}
!445 = !DILocalVariable(name: "__fd", arg: 1, scope: !441, file: !358, line: 491, type: !6)
!446 = !DILocalVariable(name: "__path", arg: 2, scope: !441, file: !358, line: 491, type: !11)
!447 = !DILocalVariable(name: "__mode", arg: 3, scope: !441, file: !358, line: 491, type: !372)
!448 = !DILocalVariable(name: "__dev", arg: 4, scope: !441, file: !358, line: 491, type: !366)
!449 = !DILocation(line: 0, scope: !441)
!450 = !DILocation(line: 494, column: 10, scope: !441)
!451 = !DILocation(line: 494, column: 3, scope: !441)
!452 = distinct !DISubprogram(name: "stat64", scope: !358, file: !358, line: 502, type: !453, scopeLine: 503, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !475)
!453 = !DISubroutineType(types: !454)
!454 = !{!6, !11, !455}
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !363, line: 119, size: 1152, elements: !457)
!457 = !{!458, !459, !461, !462, !463, !464, !465, !466, !467, !468, !469, !471, !472, !473, !474}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !456, file: !363, line: 121, baseType: !366, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !456, file: !363, line: 123, baseType: !460, size: 64, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !110, line: 149, baseType: !21)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !456, file: !363, line: 124, baseType: !370, size: 64, offset: 128)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !456, file: !363, line: 125, baseType: !372, size: 32, offset: 192)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !456, file: !363, line: 132, baseType: !374, size: 32, offset: 224)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !456, file: !363, line: 133, baseType: !376, size: 32, offset: 256)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !456, file: !363, line: 135, baseType: !6, size: 32, offset: 288)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !456, file: !363, line: 136, baseType: !366, size: 64, offset: 320)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !456, file: !363, line: 137, baseType: !109, size: 64, offset: 384)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !456, file: !363, line: 143, baseType: !381, size: 64, offset: 448)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !456, file: !363, line: 144, baseType: !470, size: 64, offset: 512)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !110, line: 180, baseType: !49)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !456, file: !363, line: 152, baseType: !385, size: 128, offset: 576)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !456, file: !363, line: 153, baseType: !385, size: 128, offset: 704)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !456, file: !363, line: 154, baseType: !385, size: 128, offset: 832)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !456, file: !363, line: 164, baseType: !395, size: 192, offset: 960)
!475 = !{!476, !477}
!476 = !DILocalVariable(name: "__path", arg: 1, scope: !452, file: !358, line: 502, type: !11)
!477 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !452, file: !358, line: 502, type: !455)
!478 = !DILocation(line: 0, scope: !452)
!479 = !DILocation(line: 504, column: 10, scope: !452)
!480 = !DILocation(line: 504, column: 3, scope: !452)
!481 = distinct !DISubprogram(name: "lstat64", scope: !358, file: !358, line: 509, type: !453, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !482)
!482 = !{!483, !484}
!483 = !DILocalVariable(name: "__path", arg: 1, scope: !481, file: !358, line: 509, type: !11)
!484 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !481, file: !358, line: 509, type: !455)
!485 = !DILocation(line: 0, scope: !481)
!486 = !DILocation(line: 511, column: 10, scope: !481)
!487 = !DILocation(line: 511, column: 3, scope: !481)
!488 = distinct !DISubprogram(name: "fstat64", scope: !358, file: !358, line: 516, type: !489, scopeLine: 517, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !491)
!489 = !DISubroutineType(types: !490)
!490 = !{!6, !6, !455}
!491 = !{!492, !493}
!492 = !DILocalVariable(name: "__fd", arg: 1, scope: !488, file: !358, line: 516, type: !6)
!493 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !488, file: !358, line: 516, type: !455)
!494 = !DILocation(line: 0, scope: !488)
!495 = !DILocation(line: 518, column: 10, scope: !488)
!496 = !DILocation(line: 518, column: 3, scope: !488)
!497 = distinct !DISubprogram(name: "fstatat64", scope: !358, file: !358, line: 523, type: !498, scopeLine: 525, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !500)
!498 = !DISubroutineType(types: !499)
!499 = !{!6, !6, !11, !455, !6}
!500 = !{!501, !502, !503, !504}
!501 = !DILocalVariable(name: "__fd", arg: 1, scope: !497, file: !358, line: 523, type: !6)
!502 = !DILocalVariable(name: "__filename", arg: 2, scope: !497, file: !358, line: 523, type: !11)
!503 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !497, file: !358, line: 523, type: !455)
!504 = !DILocalVariable(name: "__flag", arg: 4, scope: !497, file: !358, line: 523, type: !6)
!505 = !DILocation(line: 0, scope: !497)
!506 = !DILocation(line: 526, column: 10, scope: !497)
!507 = !DILocation(line: 526, column: 3, scope: !497)
!508 = distinct !DISubprogram(name: "create_alloc_pool", scope: !1, file: !1, line: 132, type: !509, scopeLine: 133, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !512)
!509 = !DISubroutineType(types: !510)
!510 = !{!511, !11, !19, !19}
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_pool", file: !15, line: 58, baseType: !13)
!512 = !{!513, !514, !515, !516, !517}
!513 = !DILocalVariable(name: "name", arg: 1, scope: !508, file: !1, line: 132, type: !11)
!514 = !DILocalVariable(name: "size", arg: 2, scope: !508, file: !1, line: 132, type: !19)
!515 = !DILocalVariable(name: "num", arg: 3, scope: !508, file: !1, line: 132, type: !19)
!516 = !DILocalVariable(name: "pool", scope: !508, file: !1, line: 134, type: !511)
!517 = !DILocalVariable(name: "header_size", scope: !508, file: !1, line: 135, type: !19)
!518 = !DILocation(line: 0, scope: !508)
!519 = !DILocation(line: 140, column: 3, scope: !508)
!520 = !DILocation(line: 143, column: 7, scope: !508)
!521 = !DILocation(line: 147, column: 10, scope: !508)
!522 = !DILocation(line: 155, column: 3, scope: !508)
!523 = !DILocation(line: 158, column: 10, scope: !508)
!524 = !DILocation(line: 161, column: 9, scope: !508)
!525 = !DILocation(line: 161, column: 14, scope: !508)
!526 = !DILocation(line: 167, column: 9, scope: !508)
!527 = !DILocation(line: 167, column: 18, scope: !508)
