; ModuleID = 'attribs.bc'
source_filename = "attribs.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.htab = type { i32 (i8*)*, i32 (i8*, i8*)*, void (i8*)*, i8**, i64, i64, i64, i32, i32, i8* (i64, i64)*, void (i8*)*, i8*, i8* (i8*, i64, i64)*, void (i8*, i8*)*, i32 }
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }

!297 = !DIEnumerator(name: "POSTINCREMENT_EXPR", value: 128, isUnsigned: true)
!298 = !DIEnumerator(name: "VA_ARG_EXPR", value: 129, isUnsigned: true)
!299 = !DIEnumerator(name: "TRY_CATCH_EXPR", value: 130, isUnsigned: true)
!300 = !DIEnumerator(name: "TRY_FINALLY_EXPR", value: 131, isUnsigned: true)
!301 = !DIEnumerator(name: "DECL_EXPR", value: 132, isUnsigned: true)
!302 = !DIEnumerator(name: "LABEL_EXPR", value: 133, isUnsigned: true)
!303 = !DIEnumerator(name: "GOTO_EXPR", value: 134, isUnsigned: true)
!304 = !DIEnumerator(name: "RETURN_EXPR", value: 135, isUnsigned: true)
!305 = !DIEnumerator(name: "EXIT_EXPR", value: 136, isUnsigned: true)
!306 = !DIEnumerator(name: "LOOP_EXPR", value: 137, isUnsigned: true)
!307 = !DIEnumerator(name: "SWITCH_EXPR", value: 138, isUnsigned: true)
!308 = !DIEnumerator(name: "CASE_LABEL_EXPR", value: 139, isUnsigned: true)
!309 = !DIEnumerator(name: "ASM_EXPR", value: 140, isUnsigned: true)
!310 = !DIEnumerator(name: "SSA_NAME", value: 141, isUnsigned: true)
!311 = !DIEnumerator(name: "CATCH_EXPR", value: 142, isUnsigned: true)
!312 = !DIEnumerator(name: "EH_FILTER_EXPR", value: 143, isUnsigned: true)
!313 = !DIEnumerator(name: "SCEV_KNOWN", value: 144, isUnsigned: true)
!314 = !DIEnumerator(name: "SCEV_NOT_KNOWN", value: 145, isUnsigned: true)
!315 = !DIEnumerator(name: "POLYNOMIAL_CHREC", value: 146, isUnsigned: true)
!316 = !DIEnumerator(name: "STATEMENT_LIST", value: 147, isUnsigned: true)
!317 = !DIEnumerator(name: "ASSERT_EXPR", value: 148, isUnsigned: true)
!318 = !DIEnumerator(name: "TREE_BINFO", value: 149, isUnsigned: true)
!319 = !DIEnumerator(name: "WITH_SIZE_EXPR", value: 150, isUnsigned: true)
!320 = !DIEnumerator(name: "REALIGN_LOAD_EXPR", value: 151, isUnsigned: true)
!321 = !DIEnumerator(name: "TARGET_MEM_REF", value: 152, isUnsigned: true)
!322 = !DIEnumerator(name: "OMP_PARALLEL", value: 153, isUnsigned: true)
!323 = !DIEnumerator(name: "OMP_TASK", value: 154, isUnsigned: true)
!324 = !DIEnumerator(name: "OMP_FOR", value: 155, isUnsigned: true)
!325 = !DIEnumerator(name: "OMP_SECTIONS", value: 156, isUnsigned: true)
!326 = !DIEnumerator(name: "OMP_SINGLE", value: 157, isUnsigned: true)
!327 = !DIEnumerator(name: "OMP_SECTION", value: 158, isUnsigned: true)
!328 = !DIEnumerator(name: "OMP_MASTER", value: 159, isUnsigned: true)
!329 = !DIEnumerator(name: "OMP_ORDERED", value: 160, isUnsigned: true)
!330 = !DIEnumerator(name: "OMP_CRITICAL", value: 161, isUnsigned: true)
!331 = !DIEnumerator(name: "OMP_ATOMIC", value: 162, isUnsigned: true)
!332 = !DIEnumerator(name: "OMP_CLAUSE", value: 163, isUnsigned: true)
!333 = !DIEnumerator(name: "REDUC_MAX_EXPR", value: 164, isUnsigned: true)
!334 = !DIEnumerator(name: "REDUC_MIN_EXPR", value: 165, isUnsigned: true)
!335 = !DIEnumerator(name: "REDUC_PLUS_EXPR", value: 166, isUnsigned: true)
!336 = !DIEnumerator(name: "DOT_PROD_EXPR", value: 167, isUnsigned: true)
!337 = !DIEnumerator(name: "WIDEN_SUM_EXPR", value: 168, isUnsigned: true)
!338 = !DIEnumerator(name: "WIDEN_MULT_EXPR", value: 169, isUnsigned: true)
!339 = !DIEnumerator(name: "VEC_LSHIFT_EXPR", value: 170, isUnsigned: true)
!340 = !DIEnumerator(name: "VEC_RSHIFT_EXPR", value: 171, isUnsigned: true)
!341 = !DIEnumerator(name: "VEC_WIDEN_MULT_HI_EXPR", value: 172, isUnsigned: true)
!342 = !DIEnumerator(name: "VEC_WIDEN_MULT_LO_EXPR", value: 173, isUnsigned: true)
!343 = !DIEnumerator(name: "VEC_UNPACK_HI_EXPR", value: 174, isUnsigned: true)
!344 = !DIEnumerator(name: "VEC_UNPACK_LO_EXPR", value: 175, isUnsigned: true)
!345 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_HI_EXPR", value: 176, isUnsigned: true)
!346 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_LO_EXPR", value: 177, isUnsigned: true)
!347 = !DIEnumerator(name: "VEC_PACK_TRUNC_EXPR", value: 178, isUnsigned: true)
!348 = !DIEnumerator(name: "VEC_PACK_SAT_EXPR", value: 179, isUnsigned: true)
!349 = !DIEnumerator(name: "VEC_PACK_FIX_TRUNC_EXPR", value: 180, isUnsigned: true)
!350 = !DIEnumerator(name: "VEC_EXTRACT_EVEN_EXPR", value: 181, isUnsigned: true)
!351 = !DIEnumerator(name: "VEC_EXTRACT_ODD_EXPR", value: 182, isUnsigned: true)
!352 = !DIEnumerator(name: "VEC_INTERLEAVE_HIGH_EXPR", value: 183, isUnsigned: true)
!353 = !DIEnumerator(name: "VEC_INTERLEAVE_LOW_EXPR", value: 184, isUnsigned: true)
!354 = !DIEnumerator(name: "PREDICT_EXPR", value: 185, isUnsigned: true)
!355 = !DIEnumerator(name: "OPTIMIZATION_NODE", value: 186, isUnsigned: true)
!356 = !DIEnumerator(name: "TARGET_OPTION_NODE", value: 187, isUnsigned: true)
!357 = !DIEnumerator(name: "LAST_AND_UNUSED_TREE_CODE", value: 188, isUnsigned: true)
!358 = !DIEnumerator(name: "C_MAYBE_CONST_EXPR", value: 189, isUnsigned: true)
!359 = !DIEnumerator(name: "EXCESS_PRECISION_EXPR", value: 190, isUnsigned: true)
!360 = !DIEnumerator(name: "MAX_TREE_CODES", value: 191, isUnsigned: true)
!361 = !{!362, !363, !364, !365, !368, !369, !371, !1186, !388, !167, !1188}
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!364 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !367)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_spec", file: !135, line: 4046, size: 256, elements: !373)
!373 = !{!374, !376, !378, !379, !381, !382, !383}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !372, file: !135, line: 4050, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !369)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "min_length", scope: !372, file: !135, line: 4052, baseType: !377, size: 32, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !364)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "max_length", scope: !372, file: !135, line: 4055, baseType: !377, size: 32, offset: 96)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "decl_required", scope: !372, file: !135, line: 4063, baseType: !380, size: 8, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !363)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "type_required", scope: !372, file: !135, line: 4066, baseType: !380, size: 8, offset: 136)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "function_type_required", scope: !372, file: !135, line: 4071, baseType: !380, size: 8, offset: 144)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !372, file: !135, line: 4086, baseType: !384, size: 64, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !385)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!388, !901, !388, !388, !364, !362}
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !389, line: 56, baseType: !390)
!389 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !135, line: 3371, size: 1792, elements: !392)
!392 = !{!393, !426, !432, !445, !464, !475, !480, !489, !495, !507, !519, !557, !710, !738, !746, !747, !752, !761, !767, !772, !776, !780, !809, !856, !862, !869, !876, !902, !927, !944, !956, !978, !996, !1168}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !391, file: !135, line: 3372, baseType: !394, size: 64)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !135, line: 360, size: 64, elements: !395)
!395 = !{!396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !394, file: !135, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !394, file: !135, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !394, file: !135, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !394, file: !135, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !394, file: !135, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !394, file: !135, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !394, file: !135, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !394, file: !135, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !394, file: !135, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !394, file: !135, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !394, file: !135, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !394, file: !135, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !394, file: !135, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !394, file: !135, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !394, file: !135, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !394, file: !135, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !394, file: !135, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !394, file: !135, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !394, file: !135, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !394, file: !135, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !394, file: !135, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !394, file: !135, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !394, file: !135, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !394, file: !135, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !394, file: !135, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !394, file: !135, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !394, file: !135, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !394, file: !135, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !394, file: !135, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !394, file: !135, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !391, file: !135, line: 3373, baseType: !427, size: 192)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !135, line: 402, size: 192, elements: !428)
!428 = !{!429, !430, !431}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !427, file: !135, line: 403, baseType: !394, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !427, file: !135, line: 404, baseType: !388, size: 64, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !427, file: !135, line: 405, baseType: !388, size: 64, offset: 128)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !391, file: !135, line: 3374, baseType: !433, size: 320)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !135, line: 1384, size: 320, elements: !434)
!434 = !{!435, !436}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !433, file: !135, line: 1385, baseType: !427, size: 192)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !433, file: !135, line: 1386, baseType: !437, size: 128, offset: 192)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !438, line: 58, baseType: !439)
!438 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !438, line: 54, size: 128, elements: !440)
!440 = !{!441, !443}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !439, file: !438, line: 56, baseType: !442, size: 64)
!442 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !439, file: !438, line: 57, baseType: !444, size: 64, offset: 64)
!444 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !391, file: !135, line: 3375, baseType: !446, size: 256)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !135, line: 1397, size: 256, elements: !447)
!447 = !{!448, !449}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !446, file: !135, line: 1398, baseType: !427, size: 192)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !446, file: !135, line: 1399, baseType: !450, size: 64, offset: 192)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !452, line: 52, size: 256, elements: !453)
!452 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!453 = !{!454, !455, !456, !457, !458, !459, !460}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !451, file: !452, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !451, file: !452, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !451, file: !452, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !451, file: !452, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !451, file: !452, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !451, file: !452, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !451, file: !452, line: 62, baseType: !461, size: 192, offset: 64)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !442, size: 192, elements: !462)
!462 = !{!463}
!463 = !DISubrange(count: 3)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !391, file: !135, line: 3376, baseType: !465, size: 256)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !135, line: 1408, size: 256, elements: !466)
!466 = !{!467, !468}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !465, file: !135, line: 1409, baseType: !427, size: 192)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !465, file: !135, line: 1410, baseType: !469, size: 64, offset: 192)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !471, line: 27, size: 192, elements: !472)
!471 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!472 = !{!473, !474}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !470, file: !471, line: 29, baseType: !437, size: 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !470, file: !471, line: 30, baseType: !5, size: 32, offset: 128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !391, file: !135, line: 3377, baseType: !476, size: 256)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !135, line: 1437, size: 256, elements: !477)
!477 = !{!478, !479}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !476, file: !135, line: 1438, baseType: !427, size: 192)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !476, file: !135, line: 1439, baseType: !388, size: 64, offset: 192)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !391, file: !135, line: 3378, baseType: !481, size: 256)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !135, line: 1418, size: 256, elements: !482)
!482 = !{!483, !484, !485}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !481, file: !135, line: 1419, baseType: !427, size: 192)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !481, file: !135, line: 1420, baseType: !364, size: 32, offset: 192)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !481, file: !135, line: 1421, baseType: !486, size: 8, offset: 224)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 8, elements: !487)
!487 = !{!488}
!488 = !DISubrange(count: 1)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !391, file: !135, line: 3379, baseType: !490, size: 320)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !135, line: 1428, size: 320, elements: !491)
!491 = !{!492, !493, !494}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !490, file: !135, line: 1429, baseType: !427, size: 192)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !490, file: !135, line: 1430, baseType: !388, size: 64, offset: 192)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !490, file: !135, line: 1431, baseType: !388, size: 64, offset: 256)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !391, file: !135, line: 3380, baseType: !496, size: 320)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !135, line: 1460, size: 320, elements: !497)
!497 = !{!498, !499}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !496, file: !135, line: 1461, baseType: !427, size: 192)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !496, file: !135, line: 1462, baseType: !500, size: 128, offset: 192)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !501, line: 31, size: 128, elements: !502)
!501 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!502 = !{!503, !505, !506}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !500, file: !501, line: 32, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !500, file: !501, line: 33, baseType: !7, size: 32, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !500, file: !501, line: 34, baseType: !7, size: 32, offset: 96)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !391, file: !135, line: 3381, baseType: !508, size: 384)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !135, line: 2507, size: 384, elements: !509)
!509 = !{!510, !511, !516, !517, !518}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !508, file: !135, line: 2508, baseType: !427, size: 192)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !508, file: !135, line: 2509, baseType: !512, size: 32, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !513, line: 58, baseType: !514)
!513 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !515, line: 44, baseType: !7)
!515 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!516 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !508, file: !135, line: 2510, baseType: !7, size: 32, offset: 224)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !508, file: !135, line: 2511, baseType: !388, size: 64, offset: 256)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !508, file: !135, line: 2512, baseType: !388, size: 64, offset: 320)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !391, file: !135, line: 3382, baseType: !520, size: 896)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !135, line: 2652, size: 896, elements: !521)
!521 = !{!522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !520, file: !135, line: 2653, baseType: !508, size: 384)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !520, file: !135, line: 2654, baseType: !388, size: 64, offset: 384)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !520, file: !135, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !520, file: !135, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !520, file: !135, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !520, file: !135, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !520, file: !135, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !520, file: !135, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !520, file: !135, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !520, file: !135, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !520, file: !135, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !520, file: !135, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !520, file: !135, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !520, file: !135, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !520, file: !135, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !520, file: !135, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !520, file: !135, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !520, file: !135, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !520, file: !135, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !520, file: !135, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !520, file: !135, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !520, file: !135, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !520, file: !135, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !520, file: !135, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !520, file: !135, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !520, file: !135, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !520, file: !135, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !520, file: !135, line: 2703, baseType: !7, size: 32, offset: 512)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !520, file: !135, line: 2705, baseType: !388, size: 64, offset: 576)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !520, file: !135, line: 2706, baseType: !388, size: 64, offset: 640)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !520, file: !135, line: 2707, baseType: !388, size: 64, offset: 704)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !520, file: !135, line: 2708, baseType: !388, size: 64, offset: 768)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !520, file: !135, line: 2711, baseType: !555, size: 64, offset: 832)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !135, line: 2711, flags: DIFlagFwdDecl)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !391, file: !135, line: 3383, baseType: !558, size: 960)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !135, line: 2756, size: 960, elements: !559)
!559 = !{!560, !561}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !558, file: !135, line: 2757, baseType: !520, size: 896)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !558, file: !135, line: 2758, baseType: !562, size: 64, offset: 896)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !389, line: 50, baseType: !563)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !565, line: 240, size: 384, elements: !566)
!565 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!566 = !{!567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !564, file: !565, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !564, file: !565, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !564, file: !565, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !564, file: !565, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !564, file: !565, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !564, file: !565, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !564, file: !565, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !564, file: !565, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !564, file: !565, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !564, file: !565, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !564, file: !565, line: 321, baseType: !578, size: 320, offset: 64)
!578 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !565, line: 315, size: 320, elements: !579)
!579 = !{!580, !643, !645, !708, !709}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !578, file: !565, line: 316, baseType: !581, size: 64)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !582, size: 64, elements: !487)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !565, line: 183, baseType: !583)
!583 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !565, line: 166, size: 64, elements: !584)
!584 = !{!585, !586, !587, !588, !589, !597, !598, !610, !613, !616, !617, !620, !633, !640}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !583, file: !565, line: 168, baseType: !364, size: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !583, file: !565, line: 169, baseType: !7, size: 32)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !583, file: !565, line: 170, baseType: !369, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !583, file: !565, line: 171, baseType: !562, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !583, file: !565, line: 172, baseType: !590, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !389, line: 53, baseType: !591)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !565, line: 359, size: 128, elements: !593)
!593 = !{!594, !595}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !592, file: !565, line: 360, baseType: !364, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !592, file: !565, line: 361, baseType: !596, size: 64, offset: 64)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !562, size: 64, elements: !487)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !583, file: !565, line: 173, baseType: !5, size: 32)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !583, file: !565, line: 174, baseType: !599, size: 32)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !565, line: 133, baseType: !600)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !565, line: 115, size: 32, elements: !601)
!601 = !{!602, !603, !604, !605, !606, !607, !608, !609}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !600, file: !565, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !600, file: !565, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !600, file: !565, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !600, file: !565, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !600, file: !565, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !600, file: !565, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !600, file: !565, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !600, file: !565, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !583, file: !565, line: 175, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !565, line: 175, flags: DIFlagFwdDecl)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !583, file: !565, line: 176, baseType: !614, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !389, line: 46, flags: DIFlagFwdDecl)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !583, file: !565, line: 177, baseType: !388, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !583, file: !565, line: 178, baseType: !618, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !389, line: 110, flags: DIFlagFwdDecl)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !583, file: !565, line: 179, baseType: !621, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !565, line: 150, baseType: !623)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !565, line: 142, size: 320, elements: !624)
!624 = !{!625, !626, !627, !628, !631, !632}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !623, file: !565, line: 144, baseType: !388, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !623, file: !565, line: 145, baseType: !562, size: 64, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !623, file: !565, line: 146, baseType: !562, size: 64, offset: 128)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !623, file: !565, line: 147, baseType: !629, size: 32, offset: 192)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !630, line: 31, baseType: !364)
!630 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!631 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !623, file: !565, line: 148, baseType: !7, size: 32, offset: 224)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !623, file: !565, line: 149, baseType: !363, size: 8, offset: 256)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !583, file: !565, line: 180, baseType: !634, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !565, line: 162, baseType: !636)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !565, line: 159, size: 128, elements: !637)
!637 = !{!638, !639}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !636, file: !565, line: 160, baseType: !388, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !636, file: !565, line: 161, baseType: !444, size: 64, offset: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !583, file: !565, line: 181, baseType: !641, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !565, line: 181, flags: DIFlagFwdDecl)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !578, file: !565, line: 317, baseType: !644, size: 64)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 64, elements: !487)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !578, file: !565, line: 318, baseType: !646, size: 320)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !565, line: 188, size: 320, elements: !647)
!647 = !{!648, !650, !707}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !646, file: !565, line: 190, baseType: !649, size: 192)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !582, size: 192, elements: !462)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !646, file: !565, line: 193, baseType: !651, size: 64, offset: 192)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !565, line: 206, size: 320, elements: !653)
!653 = !{!654, !692, !693, !694, !706}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !652, file: !565, line: 208, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !389, line: 62, baseType: !657)
!657 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !658, line: 538, size: 256, elements: !659)
!658 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!659 = !{!660, !664, !670, !683}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !657, file: !658, line: 539, baseType: !661, size: 32)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !658, line: 482, size: 32, elements: !662)
!662 = !{!663}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !661, file: !658, line: 484, baseType: !7, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !657, file: !658, line: 540, baseType: !665, size: 192)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !658, line: 488, size: 192, elements: !666)
!666 = !{!667, !668, !669}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !665, file: !658, line: 489, baseType: !661, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !665, file: !658, line: 492, baseType: !369, size: 64, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !665, file: !658, line: 496, baseType: !388, size: 64, offset: 128)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !657, file: !658, line: 541, baseType: !671, size: 256)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !658, line: 504, size: 256, elements: !672)
!672 = !{!673, !674, !681, !682}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !671, file: !658, line: 505, baseType: !661, size: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !671, file: !658, line: 509, baseType: !675, size: 64, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !658, line: 501, baseType: !676)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DISubroutineType(types: !678)
!678 = !{null, !679}
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !671, file: !658, line: 510, baseType: !679, size: 64, offset: 128)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !671, file: !658, line: 513, baseType: !655, size: 64, offset: 192)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !657, file: !658, line: 542, baseType: !684, size: 128)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !658, line: 530, size: 128, elements: !685)
!685 = !{!686, !687}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !684, file: !658, line: 531, baseType: !661, size: 32)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !684, file: !658, line: 534, baseType: !688, size: 64, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !658, line: 525, baseType: !689)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{!363, !388, !369, !442, !442}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !652, file: !565, line: 211, baseType: !7, size: 32, offset: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !652, file: !565, line: 214, baseType: !444, size: 64, offset: 128)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !652, file: !565, line: 224, baseType: !695, size: 64, offset: 192)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !565, line: 202, baseType: !697)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !565, line: 202, size: 128, elements: !698)
!698 = !{!699}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !697, file: !565, line: 202, baseType: !700, size: 128)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !565, line: 200, baseType: !701)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !565, line: 200, size: 128, elements: !702)
!702 = !{!703, !704, !705}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !701, file: !565, line: 200, baseType: !7, size: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !701, file: !565, line: 200, baseType: !7, size: 32, offset: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !701, file: !565, line: 200, baseType: !596, size: 64, offset: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !652, file: !565, line: 234, baseType: !695, size: 64, offset: 256)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !646, file: !565, line: 197, baseType: !444, size: 64, offset: 256)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !578, file: !565, line: 319, baseType: !451, size: 256)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !578, file: !565, line: 320, baseType: !470, size: 192)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !391, file: !135, line: 3384, baseType: !711, size: 1472)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !135, line: 3114, size: 1472, elements: !712)
!712 = !{!713, !734, !735, !736, !737}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !711, file: !135, line: 3115, baseType: !714, size: 1216)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !135, line: 2984, size: 1216, elements: !715)
!715 = !{!716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !714, file: !135, line: 2985, baseType: !558, size: 960)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !714, file: !135, line: 2986, baseType: !388, size: 64, offset: 960)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !714, file: !135, line: 2987, baseType: !388, size: 64, offset: 1024)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !714, file: !135, line: 2988, baseType: !388, size: 64, offset: 1088)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !714, file: !135, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !714, file: !135, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !714, file: !135, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !714, file: !135, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !714, file: !135, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !714, file: !135, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !714, file: !135, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !714, file: !135, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !714, file: !135, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !714, file: !135, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !714, file: !135, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !714, file: !135, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !714, file: !135, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !714, file: !135, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !711, file: !135, line: 3117, baseType: !388, size: 64, offset: 1216)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !711, file: !135, line: 3119, baseType: !388, size: 64, offset: 1280)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !711, file: !135, line: 3121, baseType: !388, size: 64, offset: 1344)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !711, file: !135, line: 3123, baseType: !388, size: 64, offset: 1408)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !391, file: !135, line: 3385, baseType: !739, size: 1088)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !135, line: 2874, size: 1088, elements: !740)
!740 = !{!741, !742, !743}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !739, file: !135, line: 2875, baseType: !558, size: 960)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !739, file: !135, line: 2876, baseType: !562, size: 64, offset: 960)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !739, file: !135, line: 2877, baseType: !744, size: 64, offset: 1024)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !135, line: 2856, flags: DIFlagFwdDecl)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !391, file: !135, line: 3386, baseType: !714, size: 1216)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !391, file: !135, line: 3387, baseType: !748, size: 1280)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !135, line: 3093, size: 1280, elements: !749)
!749 = !{!750, !751}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !748, file: !135, line: 3094, baseType: !714, size: 1216)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !748, file: !135, line: 3095, baseType: !744, size: 64, offset: 1216)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !391, file: !135, line: 3388, baseType: !753, size: 1216)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !135, line: 2824, size: 1216, elements: !754)
!754 = !{!755, !756, !757, !758, !759, !760}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !753, file: !135, line: 2825, baseType: !520, size: 896)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !753, file: !135, line: 2827, baseType: !388, size: 64, offset: 896)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !753, file: !135, line: 2828, baseType: !388, size: 64, offset: 960)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !753, file: !135, line: 2829, baseType: !388, size: 64, offset: 1024)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !753, file: !135, line: 2830, baseType: !388, size: 64, offset: 1088)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !753, file: !135, line: 2831, baseType: !388, size: 64, offset: 1152)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !391, file: !135, line: 3389, baseType: !762, size: 1024)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !135, line: 2850, size: 1024, elements: !763)
!763 = !{!764, !765, !766}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !762, file: !135, line: 2851, baseType: !558, size: 960)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !762, file: !135, line: 2852, baseType: !364, size: 32, offset: 960)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !762, file: !135, line: 2853, baseType: !364, size: 32, offset: 992)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !391, file: !135, line: 3390, baseType: !768, size: 1024)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !135, line: 2857, size: 1024, elements: !769)
!769 = !{!770, !771}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !768, file: !135, line: 2858, baseType: !558, size: 960)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !768, file: !135, line: 2859, baseType: !744, size: 64, offset: 960)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !391, file: !135, line: 3391, baseType: !773, size: 960)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !135, line: 2862, size: 960, elements: !774)
!774 = !{!775}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !773, file: !135, line: 2863, baseType: !558, size: 960)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !391, file: !135, line: 3392, baseType: !777, size: 1472)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !135, line: 3304, size: 1472, elements: !778)
!778 = !{!779}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !777, file: !135, line: 3305, baseType: !711, size: 1472)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !391, file: !135, line: 3393, baseType: !781, size: 1792)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !135, line: 3248, size: 1792, elements: !782)
!782 = !{!783, !784, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !781, file: !135, line: 3249, baseType: !711, size: 1472)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !781, file: !135, line: 3251, baseType: !785, size: 64, offset: 1472)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !787, line: 41, flags: DIFlagFwdDecl)
!787 = !DIFile(filename: "./statistics.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!788 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !781, file: !135, line: 3254, baseType: !388, size: 64, offset: 1536)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !781, file: !135, line: 3257, baseType: !388, size: 64, offset: 1600)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !781, file: !135, line: 3258, baseType: !388, size: 64, offset: 1664)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !781, file: !135, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !781, file: !135, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !781, file: !135, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !781, file: !135, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !781, file: !135, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !781, file: !135, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !781, file: !135, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !781, file: !135, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !781, file: !135, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !781, file: !135, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !781, file: !135, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !781, file: !135, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !781, file: !135, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !781, file: !135, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !781, file: !135, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !781, file: !135, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !781, file: !135, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !781, file: !135, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !391, file: !135, line: 3394, baseType: !810, size: 1344)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !135, line: 2279, size: 1344, elements: !811)
!811 = !{!812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !845, !846, !847, !848, !849, !850, !851, !852, !853}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !810, file: !135, line: 2280, baseType: !427, size: 192)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !810, file: !135, line: 2281, baseType: !388, size: 64, offset: 192)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !810, file: !135, line: 2282, baseType: !388, size: 64, offset: 256)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !810, file: !135, line: 2283, baseType: !388, size: 64, offset: 320)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !810, file: !135, line: 2284, baseType: !388, size: 64, offset: 384)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !810, file: !135, line: 2285, baseType: !7, size: 32, offset: 448)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !810, file: !135, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !810, file: !135, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !810, file: !135, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !810, file: !135, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !810, file: !135, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !810, file: !135, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !810, file: !135, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !810, file: !135, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !810, file: !135, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !810, file: !135, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !810, file: !135, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !810, file: !135, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !810, file: !135, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !810, file: !135, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !810, file: !135, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !810, file: !135, line: 2305, baseType: !7, size: 32, offset: 512)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !810, file: !135, line: 2306, baseType: !629, size: 32, offset: 544)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !810, file: !135, line: 2307, baseType: !388, size: 64, offset: 576)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !810, file: !135, line: 2308, baseType: !388, size: 64, offset: 640)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !810, file: !135, line: 2314, baseType: !838, size: 64, offset: 704)
!838 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !135, line: 2309, size: 64, elements: !839)
!839 = !{!840, !841, !842}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !838, file: !135, line: 2310, baseType: !364, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !838, file: !135, line: 2311, baseType: !369, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !838, file: !135, line: 2312, baseType: !843, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !135, line: 2277, flags: DIFlagFwdDecl)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !810, file: !135, line: 2315, baseType: !388, size: 64, offset: 768)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !810, file: !135, line: 2316, baseType: !388, size: 64, offset: 832)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !810, file: !135, line: 2317, baseType: !388, size: 64, offset: 896)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !810, file: !135, line: 2318, baseType: !388, size: 64, offset: 960)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !810, file: !135, line: 2319, baseType: !388, size: 64, offset: 1024)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !810, file: !135, line: 2320, baseType: !388, size: 64, offset: 1088)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !810, file: !135, line: 2321, baseType: !388, size: 64, offset: 1152)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !810, file: !135, line: 2322, baseType: !388, size: 64, offset: 1216)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !810, file: !135, line: 2324, baseType: !854, size: 64, offset: 1280)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !135, line: 2324, flags: DIFlagFwdDecl)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !391, file: !135, line: 3395, baseType: !857, size: 320)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !135, line: 1469, size: 320, elements: !858)
!858 = !{!859, !860, !861}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !857, file: !135, line: 1470, baseType: !427, size: 192)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !857, file: !135, line: 1471, baseType: !388, size: 64, offset: 192)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !857, file: !135, line: 1472, baseType: !388, size: 64, offset: 256)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !391, file: !135, line: 3396, baseType: !863, size: 320)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !135, line: 1482, size: 320, elements: !864)
!864 = !{!865, !866, !867}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !863, file: !135, line: 1483, baseType: !427, size: 192)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !863, file: !135, line: 1484, baseType: !364, size: 32, offset: 192)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !863, file: !135, line: 1485, baseType: !868, size: 64, offset: 256)
!868 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 64, elements: !487)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !391, file: !135, line: 3397, baseType: !870, size: 384)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !135, line: 1829, size: 384, elements: !871)
!871 = !{!872, !873, !874, !875}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !870, file: !135, line: 1830, baseType: !427, size: 192)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !870, file: !135, line: 1831, baseType: !512, size: 32, offset: 192)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !870, file: !135, line: 1832, baseType: !388, size: 64, offset: 256)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !870, file: !135, line: 1835, baseType: !868, size: 64, offset: 320)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !391, file: !135, line: 3398, baseType: !877, size: 704)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !135, line: 1898, size: 704, elements: !878)
!878 = !{!879, !880, !881, !885, !886, !889}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !877, file: !135, line: 1899, baseType: !427, size: 192)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !877, file: !135, line: 1902, baseType: !388, size: 64, offset: 192)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !877, file: !135, line: 1905, baseType: !882, size: 64, offset: 256)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !389, line: 58, baseType: !883)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !389, line: 57, flags: DIFlagFwdDecl)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !877, file: !135, line: 1908, baseType: !7, size: 32, offset: 320)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !877, file: !135, line: 1911, baseType: !887, size: 64, offset: 384)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !135, line: 1876, flags: DIFlagFwdDecl)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !877, file: !135, line: 1914, baseType: !890, size: 256, offset: 448)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !135, line: 1883, size: 256, elements: !891)
!891 = !{!892, !894, !895, !900}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !890, file: !135, line: 1884, baseType: !893, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !890, file: !135, line: 1885, baseType: !893, size: 64, offset: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !890, file: !135, line: 1891, baseType: !896, size: 64, offset: 128)
!896 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !890, file: !135, line: 1891, size: 64, elements: !897)
!897 = !{!898, !899}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !896, file: !135, line: 1891, baseType: !882, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !896, file: !135, line: 1891, baseType: !388, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !890, file: !135, line: 1892, baseType: !901, size: 64, offset: 192)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !391, file: !135, line: 3399, baseType: !903, size: 704)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !135, line: 2008, size: 704, elements: !904)
!904 = !{!905, !906, !907, !908, !909, !910, !922, !923, !924, !925, !926}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !903, file: !135, line: 2009, baseType: !427, size: 192)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !903, file: !135, line: 2011, baseType: !7, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !903, file: !135, line: 2012, baseType: !7, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !903, file: !135, line: 2014, baseType: !512, size: 32, offset: 224)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !903, file: !135, line: 2016, baseType: !388, size: 64, offset: 256)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !903, file: !135, line: 2017, baseType: !911, size: 64, offset: 320)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !135, line: 183, baseType: !913)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !135, line: 183, size: 128, elements: !914)
!914 = !{!915}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !913, file: !135, line: 183, baseType: !916, size: 128)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !135, line: 182, baseType: !917)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !135, line: 182, size: 128, elements: !918)
!918 = !{!919, !920, !921}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !917, file: !135, line: 182, baseType: !7, size: 32)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !917, file: !135, line: 182, baseType: !7, size: 32, offset: 32)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !917, file: !135, line: 182, baseType: !868, size: 64, offset: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !903, file: !135, line: 2019, baseType: !388, size: 64, offset: 384)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !903, file: !135, line: 2020, baseType: !388, size: 64, offset: 448)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !903, file: !135, line: 2021, baseType: !388, size: 64, offset: 512)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !903, file: !135, line: 2022, baseType: !388, size: 64, offset: 576)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !903, file: !135, line: 2023, baseType: !388, size: 64, offset: 640)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !391, file: !135, line: 3400, baseType: !928, size: 832)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !135, line: 2430, size: 832, elements: !929)
!929 = !{!930, !931, !932, !933, !934, !935, !936, !937, !938, !939}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !928, file: !135, line: 2431, baseType: !427, size: 192)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !928, file: !135, line: 2433, baseType: !388, size: 64, offset: 192)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !928, file: !135, line: 2434, baseType: !388, size: 64, offset: 256)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !928, file: !135, line: 2435, baseType: !388, size: 64, offset: 320)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !928, file: !135, line: 2436, baseType: !388, size: 64, offset: 384)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "base_accesses", scope: !928, file: !135, line: 2437, baseType: !911, size: 64, offset: 448)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "inheritance", scope: !928, file: !135, line: 2438, baseType: !388, size: 64, offset: 512)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_subvtt", scope: !928, file: !135, line: 2440, baseType: !388, size: 64, offset: 576)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_vptr", scope: !928, file: !135, line: 2441, baseType: !388, size: 64, offset: 640)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "base_binfos", scope: !928, file: !135, line: 2443, baseType: !940, size: 128, offset: 704)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_none", file: !135, line: 182, baseType: !941)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_none", file: !135, line: 182, size: 128, elements: !942)
!942 = !{!943}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !941, file: !135, line: 182, baseType: !916, size: 128)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "stmt_list", scope: !391, file: !135, line: 3401, baseType: !945, size: 320)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list", file: !135, line: 3327, size: 320, elements: !946)
!946 = !{!947, !948, !955}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !945, file: !135, line: 3329, baseType: !427, size: 192)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !945, file: !135, line: 3330, baseType: !949, size: 64, offset: 192)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list_node", file: !135, line: 3320, size: 192, elements: !951)
!951 = !{!952, !953, !954}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !950, file: !135, line: 3322, baseType: !949, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !950, file: !135, line: 3323, baseType: !949, size: 64, offset: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !950, file: !135, line: 3324, baseType: !388, size: 64, offset: 128)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !945, file: !135, line: 3331, baseType: !949, size: 64, offset: 256)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "constructor", scope: !391, file: !135, line: 3402, baseType: !957, size: 256)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_constructor", file: !135, line: 1540, size: 256, elements: !958)
!958 = !{!959, !960}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !957, file: !135, line: 1541, baseType: !427, size: 192)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !957, file: !135, line: 1542, baseType: !961, size: 64, offset: 192)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_gc", file: !135, line: 1538, baseType: !963)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_gc", file: !135, line: 1538, size: 192, elements: !964)
!964 = !{!965}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !963, file: !135, line: 1538, baseType: !966, size: 192)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_base", file: !135, line: 1537, baseType: !967)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_base", file: !135, line: 1537, size: 192, elements: !968)
!968 = !{!969, !970, !971}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !967, file: !135, line: 1537, baseType: !7, size: 32)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !967, file: !135, line: 1537, baseType: !7, size: 32, offset: 32)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !967, file: !135, line: 1537, baseType: !972, size: 128, offset: 64)
!972 = !DICompositeType(tag: DW_TAG_array_type, baseType: !973, size: 128, elements: !487)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "constructor_elt", file: !135, line: 1535, baseType: !974)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "constructor_elt_d", file: !135, line: 1532, size: 128, elements: !975)
!975 = !{!976, !977}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !974, file: !135, line: 1533, baseType: !388, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !974, file: !135, line: 1534, baseType: !388, size: 64, offset: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "omp_clause", scope: !391, file: !135, line: 3403, baseType: !979, size: 512)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_omp_clause", file: !135, line: 1938, size: 512, elements: !980)
!980 = !{!981, !982, !983, !984, !990, !994, !995}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !979, file: !135, line: 1939, baseType: !427, size: 192)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !979, file: !135, line: 1940, baseType: !512, size: 32, offset: 192)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !979, file: !135, line: 1941, baseType: !134, size: 32, offset: 224)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !979, file: !135, line: 1946, baseType: !985, size: 32, offset: 256)
!985 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "omp_clause_subcode", file: !135, line: 1942, size: 32, elements: !986)
!986 = !{!987, !988, !989}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "default_kind", scope: !985, file: !135, line: 1943, baseType: !153, size: 32)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "schedule_kind", scope: !985, file: !135, line: 1944, baseType: !160, size: 32)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "reduction_code", scope: !985, file: !135, line: 1945, baseType: !167, size: 32)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reduction_init", scope: !979, file: !135, line: 1950, baseType: !991, size: 64, offset: 320)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !389, line: 66, baseType: !992)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !389, line: 65, flags: DIFlagFwdDecl)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reduction_merge", scope: !979, file: !135, line: 1951, baseType: !991, size: 64, offset: 384)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !979, file: !135, line: 1953, baseType: !868, size: 64, offset: 448)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "optimization", scope: !391, file: !135, line: 3404, baseType: !997, size: 1664)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_optimization_option", file: !135, line: 3337, size: 1664, elements: !998)
!998 = !{!999, !1000}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !997, file: !135, line: 3338, baseType: !427, size: 192)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !997, file: !135, line: 3341, baseType: !1001, size: 1472, offset: 192)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cl_optimization", file: !1002, line: 410, size: 1472, elements: !1003)
!1002 = !DIFile(filename: "./options.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1003 = !{!1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "align_functions", scope: !1001, file: !1002, line: 412, baseType: !364, size: 32)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "align_jumps", scope: !1001, file: !1002, line: 413, baseType: !364, size: 32, offset: 32)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "align_labels", scope: !1001, file: !1002, line: 414, baseType: !364, size: 32, offset: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "align_loops", scope: !1001, file: !1002, line: 415, baseType: !364, size: 32, offset: 96)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_stalled_insns", scope: !1001, file: !1002, line: 416, baseType: !364, size: 32, offset: 128)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_stalled_insns_dep", scope: !1001, file: !1002, line: 417, baseType: !364, size: 32, offset: 160)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "optimize", scope: !1001, file: !1002, line: 418, baseType: !363, size: 8, offset: 192)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_size", scope: !1001, file: !1002, line: 419, baseType: !363, size: 8, offset: 200)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "flag_argument_noalias", scope: !1001, file: !1002, line: 420, baseType: !1013, size: 8, offset: 208)
!1013 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "flag_asynchronous_unwind_tables", scope: !1001, file: !1002, line: 421, baseType: !1013, size: 8, offset: 216)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_on_count_reg", scope: !1001, file: !1002, line: 422, baseType: !1013, size: 8, offset: 224)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_probabilities", scope: !1001, file: !1002, line: 423, baseType: !1013, size: 8, offset: 232)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_target_load_optimize", scope: !1001, file: !1002, line: 424, baseType: !1013, size: 8, offset: 240)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_target_load_optimize2", scope: !1001, file: !1002, line: 425, baseType: !1013, size: 8, offset: 248)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "flag_btr_bb_exclusive", scope: !1001, file: !1002, line: 426, baseType: !1013, size: 8, offset: 256)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "flag_caller_saves", scope: !1001, file: !1002, line: 427, baseType: !1013, size: 8, offset: 264)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "flag_no_common", scope: !1001, file: !1002, line: 428, baseType: !1013, size: 8, offset: 272)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "flag_conserve_stack", scope: !1001, file: !1002, line: 429, baseType: !1013, size: 8, offset: 280)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cprop_registers", scope: !1001, file: !1002, line: 430, baseType: !1013, size: 8, offset: 288)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "flag_crossjumping", scope: !1001, file: !1002, line: 431, baseType: !1013, size: 8, offset: 296)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cse_follow_jumps", scope: !1001, file: !1002, line: 432, baseType: !1013, size: 8, offset: 304)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cx_fortran_rules", scope: !1001, file: !1002, line: 433, baseType: !1013, size: 8, offset: 312)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cx_limited_range", scope: !1001, file: !1002, line: 434, baseType: !1013, size: 8, offset: 320)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "flag_data_sections", scope: !1001, file: !1002, line: 435, baseType: !1013, size: 8, offset: 328)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "flag_dce", scope: !1001, file: !1002, line: 436, baseType: !1013, size: 8, offset: 336)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "flag_defer_pop", scope: !1001, file: !1002, line: 437, baseType: !1013, size: 8, offset: 344)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "flag_delayed_branch", scope: !1001, file: !1002, line: 438, baseType: !1013, size: 8, offset: 352)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "flag_delete_null_pointer_checks", scope: !1001, file: !1002, line: 439, baseType: !1013, size: 8, offset: 360)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "flag_dse", scope: !1001, file: !1002, line: 440, baseType: !1013, size: 8, offset: 368)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "flag_early_inlining", scope: !1001, file: !1002, line: 441, baseType: !1013, size: 8, offset: 376)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "flag_exceptions", scope: !1001, file: !1002, line: 442, baseType: !1013, size: 8, offset: 384)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "flag_expensive_optimizations", scope: !1001, file: !1002, line: 443, baseType: !1013, size: 8, offset: 392)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "flag_finite_math_only", scope: !1001, file: !1002, line: 444, baseType: !1013, size: 8, offset: 400)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "flag_float_store", scope: !1001, file: !1002, line: 445, baseType: !1013, size: 8, offset: 408)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "flag_forward_propagate", scope: !1001, file: !1002, line: 446, baseType: !1013, size: 8, offset: 416)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse", scope: !1001, file: !1002, line: 447, baseType: !1013, size: 8, offset: 424)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_after_reload", scope: !1001, file: !1002, line: 448, baseType: !1013, size: 8, offset: 432)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_las", scope: !1001, file: !1002, line: 449, baseType: !1013, size: 8, offset: 440)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_lm", scope: !1001, file: !1002, line: 450, baseType: !1013, size: 8, offset: 448)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_sm", scope: !1001, file: !1002, line: 451, baseType: !1013, size: 8, offset: 456)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "flag_graphite_identity", scope: !1001, file: !1002, line: 452, baseType: !1013, size: 8, offset: 464)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "flag_guess_branch_prob", scope: !1001, file: !1002, line: 453, baseType: !1013, size: 8, offset: 472)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "flag_if_conversion", scope: !1001, file: !1002, line: 454, baseType: !1013, size: 8, offset: 480)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "flag_if_conversion2", scope: !1001, file: !1002, line: 455, baseType: !1013, size: 8, offset: 488)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_functions", scope: !1001, file: !1002, line: 456, baseType: !1013, size: 8, offset: 496)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_functions_called_once", scope: !1001, file: !1002, line: 457, baseType: !1013, size: 8, offset: 504)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_small_functions", scope: !1001, file: !1002, line: 458, baseType: !1013, size: 8, offset: 512)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_cp", scope: !1001, file: !1002, line: 459, baseType: !1013, size: 8, offset: 520)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_cp_clone", scope: !1001, file: !1002, line: 460, baseType: !1013, size: 8, offset: 528)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_matrix_reorg", scope: !1001, file: !1002, line: 461, baseType: !1013, size: 8, offset: 536)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_pta", scope: !1001, file: !1002, line: 462, baseType: !1013, size: 8, offset: 544)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_pure_const", scope: !1001, file: !1002, line: 463, baseType: !1013, size: 8, offset: 552)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_reference", scope: !1001, file: !1002, line: 464, baseType: !1013, size: 8, offset: 560)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_sra", scope: !1001, file: !1002, line: 465, baseType: !1013, size: 8, offset: 568)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_type_escape", scope: !1001, file: !1002, line: 466, baseType: !1013, size: 8, offset: 576)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ivopts", scope: !1001, file: !1002, line: 467, baseType: !1013, size: 8, offset: 584)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "flag_jump_tables", scope: !1001, file: !1002, line: 468, baseType: !1013, size: 8, offset: 592)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_block", scope: !1001, file: !1002, line: 469, baseType: !1013, size: 8, offset: 600)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_interchange", scope: !1001, file: !1002, line: 470, baseType: !1013, size: 8, offset: 608)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_parallelize_all", scope: !1001, file: !1002, line: 471, baseType: !1013, size: 8, offset: 616)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_strip_mine", scope: !1001, file: !1002, line: 472, baseType: !1013, size: 8, offset: 624)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "flag_lto_report", scope: !1001, file: !1002, line: 473, baseType: !1013, size: 8, offset: 632)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ltrans", scope: !1001, file: !1002, line: 474, baseType: !1013, size: 8, offset: 640)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "flag_errno_math", scope: !1001, file: !1002, line: 475, baseType: !1013, size: 8, offset: 648)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "flag_merge_constants", scope: !1001, file: !1002, line: 476, baseType: !1013, size: 8, offset: 656)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "flag_modulo_sched", scope: !1001, file: !1002, line: 477, baseType: !1013, size: 8, offset: 664)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "flag_move_loop_invariants", scope: !1001, file: !1002, line: 478, baseType: !1013, size: 8, offset: 672)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "flag_non_call_exceptions", scope: !1001, file: !1002, line: 479, baseType: !1013, size: 8, offset: 680)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "flag_omit_frame_pointer", scope: !1001, file: !1002, line: 480, baseType: !1013, size: 8, offset: 688)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "flag_regmove", scope: !1001, file: !1002, line: 481, baseType: !1013, size: 8, offset: 696)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "flag_optimize_sibling_calls", scope: !1001, file: !1002, line: 482, baseType: !1013, size: 8, offset: 704)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "flag_pack_struct", scope: !1001, file: !1002, line: 483, baseType: !1013, size: 8, offset: 712)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "flag_peel_loops", scope: !1001, file: !1002, line: 484, baseType: !1013, size: 8, offset: 720)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "flag_no_peephole", scope: !1001, file: !1002, line: 485, baseType: !1013, size: 8, offset: 728)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "flag_peephole2", scope: !1001, file: !1002, line: 486, baseType: !1013, size: 8, offset: 736)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "flag_predictive_commoning", scope: !1001, file: !1002, line: 487, baseType: !1013, size: 8, offset: 744)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "flag_prefetch_loop_arrays", scope: !1001, file: !1002, line: 488, baseType: !1013, size: 8, offset: 752)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "flag_pcc_struct_return", scope: !1001, file: !1002, line: 489, baseType: !1013, size: 8, offset: 760)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "flag_rename_registers", scope: !1001, file: !1002, line: 490, baseType: !1013, size: 8, offset: 768)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "flag_reorder_blocks", scope: !1001, file: !1002, line: 491, baseType: !1013, size: 8, offset: 776)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "flag_reorder_blocks_and_partition", scope: !1001, file: !1002, line: 492, baseType: !1013, size: 8, offset: 784)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "flag_reorder_functions", scope: !1001, file: !1002, line: 493, baseType: !1013, size: 8, offset: 792)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "flag_rerun_cse_after_loop", scope: !1001, file: !1002, line: 494, baseType: !1013, size: 8, offset: 800)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "flag_resched_modulo_sched", scope: !1001, file: !1002, line: 495, baseType: !1013, size: 8, offset: 808)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "flag_rounding_math", scope: !1001, file: !1002, line: 496, baseType: !1013, size: 8, offset: 816)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_critical_path_heuristic", scope: !1001, file: !1002, line: 497, baseType: !1013, size: 8, offset: 824)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_dep_count_heuristic", scope: !1001, file: !1002, line: 498, baseType: !1013, size: 8, offset: 832)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_group_heuristic", scope: !1001, file: !1002, line: 499, baseType: !1013, size: 8, offset: 840)
