; ModuleID = 'bb-reorder.bc'
source_filename = "bb-reorder.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }

!633 = !DIEnumerator(name: "SMIN", value: 70, isUnsigned: true)
!634 = !DIEnumerator(name: "SMAX", value: 71, isUnsigned: true)
!635 = !DIEnumerator(name: "UMIN", value: 72, isUnsigned: true)
!636 = !DIEnumerator(name: "UMAX", value: 73, isUnsigned: true)
!637 = !DIEnumerator(name: "PRE_DEC", value: 74, isUnsigned: true)
!638 = !DIEnumerator(name: "PRE_INC", value: 75, isUnsigned: true)
!639 = !DIEnumerator(name: "POST_DEC", value: 76, isUnsigned: true)
!640 = !DIEnumerator(name: "POST_INC", value: 77, isUnsigned: true)
!641 = !DIEnumerator(name: "PRE_MODIFY", value: 78, isUnsigned: true)
!642 = !DIEnumerator(name: "POST_MODIFY", value: 79, isUnsigned: true)
!643 = !DIEnumerator(name: "NE", value: 80, isUnsigned: true)
!644 = !DIEnumerator(name: "EQ", value: 81, isUnsigned: true)
!645 = !DIEnumerator(name: "GE", value: 82, isUnsigned: true)
!646 = !DIEnumerator(name: "GT", value: 83, isUnsigned: true)
!647 = !DIEnumerator(name: "LE", value: 84, isUnsigned: true)
!648 = !DIEnumerator(name: "LT", value: 85, isUnsigned: true)
!649 = !DIEnumerator(name: "GEU", value: 86, isUnsigned: true)
!650 = !DIEnumerator(name: "GTU", value: 87, isUnsigned: true)
!651 = !DIEnumerator(name: "LEU", value: 88, isUnsigned: true)
!652 = !DIEnumerator(name: "LTU", value: 89, isUnsigned: true)
!653 = !DIEnumerator(name: "UNORDERED", value: 90, isUnsigned: true)
!654 = !DIEnumerator(name: "ORDERED", value: 91, isUnsigned: true)
!655 = !DIEnumerator(name: "UNEQ", value: 92, isUnsigned: true)
!656 = !DIEnumerator(name: "UNGE", value: 93, isUnsigned: true)
!657 = !DIEnumerator(name: "UNGT", value: 94, isUnsigned: true)
!658 = !DIEnumerator(name: "UNLE", value: 95, isUnsigned: true)
!659 = !DIEnumerator(name: "UNLT", value: 96, isUnsigned: true)
!660 = !DIEnumerator(name: "LTGT", value: 97, isUnsigned: true)
!661 = !DIEnumerator(name: "SIGN_EXTEND", value: 98, isUnsigned: true)
!662 = !DIEnumerator(name: "ZERO_EXTEND", value: 99, isUnsigned: true)
!663 = !DIEnumerator(name: "TRUNCATE", value: 100, isUnsigned: true)
!664 = !DIEnumerator(name: "FLOAT_EXTEND", value: 101, isUnsigned: true)
!665 = !DIEnumerator(name: "FLOAT_TRUNCATE", value: 102, isUnsigned: true)
!666 = !DIEnumerator(name: "FLOAT", value: 103, isUnsigned: true)
!667 = !DIEnumerator(name: "FIX", value: 104, isUnsigned: true)
!668 = !DIEnumerator(name: "UNSIGNED_FLOAT", value: 105, isUnsigned: true)
!669 = !DIEnumerator(name: "UNSIGNED_FIX", value: 106, isUnsigned: true)
!670 = !DIEnumerator(name: "FRACT_CONVERT", value: 107, isUnsigned: true)
!671 = !DIEnumerator(name: "UNSIGNED_FRACT_CONVERT", value: 108, isUnsigned: true)
!672 = !DIEnumerator(name: "SAT_FRACT", value: 109, isUnsigned: true)
!673 = !DIEnumerator(name: "UNSIGNED_SAT_FRACT", value: 110, isUnsigned: true)
!674 = !DIEnumerator(name: "ABS", value: 111, isUnsigned: true)
!675 = !DIEnumerator(name: "SQRT", value: 112, isUnsigned: true)
!676 = !DIEnumerator(name: "BSWAP", value: 113, isUnsigned: true)
!677 = !DIEnumerator(name: "FFS", value: 114, isUnsigned: true)
!678 = !DIEnumerator(name: "CLZ", value: 115, isUnsigned: true)
!679 = !DIEnumerator(name: "CTZ", value: 116, isUnsigned: true)
!680 = !DIEnumerator(name: "POPCOUNT", value: 117, isUnsigned: true)
!681 = !DIEnumerator(name: "PARITY", value: 118, isUnsigned: true)
!682 = !DIEnumerator(name: "SIGN_EXTRACT", value: 119, isUnsigned: true)
!683 = !DIEnumerator(name: "ZERO_EXTRACT", value: 120, isUnsigned: true)
!684 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!685 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!686 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!687 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!688 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!689 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!690 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!691 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!692 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!693 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!694 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!695 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!696 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!697 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!698 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!699 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!700 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!701 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!702 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!703 = !{!704, !705, !706, !707, !710, !711, !713, !747, !751, !740, !560, !783, !1820, !896, !1821}
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!706 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !709)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "bbro_basic_block_data", file: !3, line: 133, baseType: !715)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bbro_basic_block_data_def", file: !3, line: 117, size: 256, elements: !716)
!716 = !{!717, !718, !719, !720, !745}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "start_of_trace", scope: !715, file: !3, line: 120, baseType: !706, size: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "end_of_trace", scope: !715, file: !3, line: 123, baseType: !706, size: 32, offset: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "in_trace", scope: !715, file: !3, line: 126, baseType: !706, size: 32, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !715, file: !3, line: 129, baseType: !721, size: 64, offset: 128)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "fibheap_t", file: !722, line: 57, baseType: !723)
!722 = !DIFile(filename: "./include/fibheap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fibheap", file: !722, line: 52, size: 192, elements: !725)
!725 = !{!726, !730, !744}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !724, file: !722, line: 54, baseType: !727, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !728, line: 46, baseType: !729)
!728 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!729 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !724, file: !722, line: 55, baseType: !731, size: 64, offset: 64)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fibnode", file: !722, line: 59, size: 448, elements: !733)
!733 = !{!734, !735, !736, !737, !738, !741, !742, !743}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !732, file: !722, line: 61, baseType: !731, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !732, file: !722, line: 62, baseType: !731, size: 64, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !732, file: !722, line: 63, baseType: !731, size: 64, offset: 128)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !732, file: !722, line: 64, baseType: !731, size: 64, offset: 192)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !732, file: !722, line: 65, baseType: !739, size: 64, offset: 256)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "fibheapkey_t", file: !722, line: 50, baseType: !740)
!740 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !732, file: !722, line: 66, baseType: !710, size: 64, offset: 320)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "degree", scope: !732, file: !722, line: 71, baseType: !7, size: 31, offset: 384, flags: DIFlagBitField, extraData: i64 384)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !732, file: !722, line: 72, baseType: !7, size: 1, offset: 415, flags: DIFlagBitField, extraData: i64 384)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !724, file: !722, line: 56, baseType: !731, size: 64, offset: 128)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !715, file: !3, line: 132, baseType: !746, size: 64, offset: 192)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "fibnode_t", file: !722, line: 74, baseType: !731)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trace", file: !3, line: 149, size: 192, elements: !749)
!749 = !{!750, !1817, !1818, !1819}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !748, file: !3, line: 152, baseType: !751, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !752, line: 111, baseType: !753)
!752 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !135, line: 217, size: 832, elements: !755)
!755 = !{!756, !1782, !1783, !1784, !1787, !1791, !1792, !1793, !1811, !1812, !1813, !1814, !1815, !1816}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !754, file: !135, line: 219, baseType: !757, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !135, line: 151, baseType: !759)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !135, line: 151, size: 128, elements: !760)
!760 = !{!761}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !759, file: !135, line: 151, baseType: !762, size: 128)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !135, line: 150, baseType: !763)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !135, line: 150, size: 128, elements: !764)
!764 = !{!765, !766, !767}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !763, file: !135, line: 150, baseType: !7, size: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !763, file: !135, line: 150, baseType: !7, size: 32, offset: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !763, file: !135, line: 150, baseType: !768, size: 64, offset: 64)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 64, elements: !817)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !752, line: 108, baseType: !770)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !135, line: 122, size: 512, elements: !772)
!772 = !{!773, !774, !775, !1774, !1775, !1776, !1777, !1778, !1779, !1780}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !771, file: !135, line: 124, baseType: !753, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !771, file: !135, line: 125, baseType: !753, size: 64, offset: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !771, file: !135, line: 131, baseType: !776, size: 64, offset: 128)
!776 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !135, line: 128, size: 64, elements: !777)
!777 = !{!778, !782}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !776, file: !135, line: 129, baseType: !779, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !752, line: 66, baseType: !780)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !752, line: 65, flags: DIFlagFwdDecl)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !776, file: !135, line: 130, baseType: !783, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !752, line: 50, baseType: !784)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !561, line: 240, size: 384, elements: !786)
!786 = !{!787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !785, file: !561, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !785, file: !561, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !785, file: !561, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !785, file: !561, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !785, file: !561, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !785, file: !561, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !785, file: !561, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !785, file: !561, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !785, file: !561, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !785, file: !561, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !785, file: !561, line: 321, baseType: !798, size: 320, offset: 64)
!798 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !561, line: 315, size: 320, elements: !799)
!799 = !{!800, !1709, !1711, !1772, !1773}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !798, file: !561, line: 316, baseType: !801, size: 64)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !802, size: 64, elements: !817)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !561, line: 183, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !561, line: 166, size: 64, elements: !804)
!804 = !{!805, !806, !807, !808, !809, !819, !820, !832, !835, !895, !1687, !1688, !1699, !1706}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !803, file: !561, line: 168, baseType: !706, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !803, file: !561, line: 169, baseType: !7, size: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !803, file: !561, line: 170, baseType: !711, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !803, file: !561, line: 171, baseType: !783, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !803, file: !561, line: 172, baseType: !810, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !752, line: 53, baseType: !811)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !561, line: 359, size: 128, elements: !813)
!813 = !{!814, !815}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !812, file: !561, line: 360, baseType: !706, size: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !812, file: !561, line: 361, baseType: !816, size: 64, offset: 64)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !783, size: 64, elements: !817)
!817 = !{!818}
!818 = !DISubrange(count: 1)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !803, file: !561, line: 173, baseType: !5, size: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !803, file: !561, line: 174, baseType: !821, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !561, line: 133, baseType: !822)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !561, line: 115, size: 32, elements: !823)
!823 = !{!824, !825, !826, !827, !828, !829, !830, !831}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !822, file: !561, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !822, file: !561, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !822, file: !561, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !822, file: !561, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !822, file: !561, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !822, file: !561, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !822, file: !561, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !822, file: !561, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !803, file: !561, line: 175, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !561, line: 175, flags: DIFlagFwdDecl)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !803, file: !561, line: 176, baseType: !836, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !838, line: 75, size: 256, elements: !839)
!838 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!839 = !{!840, !854, !855, !856}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !837, file: !838, line: 76, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !838, line: 68, baseType: !843)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !838, line: 63, size: 320, elements: !844)
!844 = !{!845, !847, !848, !849}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !843, file: !838, line: 64, baseType: !846, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !843, file: !838, line: 65, baseType: !846, size: 64, offset: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !843, file: !838, line: 66, baseType: !7, size: 32, offset: 128)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !843, file: !838, line: 67, baseType: !850, size: 128, offset: 192)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !851, size: 128, elements: !852)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !838, line: 29, baseType: !729)
!852 = !{!853}
!853 = !DISubrange(count: 2)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !837, file: !838, line: 77, baseType: !841, size: 64, offset: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !837, file: !838, line: 78, baseType: !7, size: 32, offset: 128)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !837, file: !838, line: 79, baseType: !857, size: 64, offset: 192)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !838, line: 49, baseType: !859)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !838, line: 45, size: 832, elements: !860)
!860 = !{!861, !862, !863}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !859, file: !838, line: 46, baseType: !846, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !859, file: !838, line: 47, baseType: !836, size: 64, offset: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !859, file: !838, line: 48, baseType: !864, size: 704, offset: 128)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !865, line: 164, size: 704, elements: !866)
!865 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!866 = !{!867, !868, !878, !879, !880, !881, !882, !883, !887, !891, !892, !893, !894}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !864, file: !865, line: 166, baseType: !740, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !864, file: !865, line: 167, baseType: !869, size: 64, offset: 64)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !865, line: 157, size: 192, elements: !871)
!871 = !{!872, !873, !874}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !870, file: !865, line: 159, baseType: !708, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !870, file: !865, line: 160, baseType: !869, size: 64, offset: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !870, file: !865, line: 161, baseType: !875, size: 32, offset: 128)
!875 = !DICompositeType(tag: DW_TAG_array_type, baseType: !709, size: 32, elements: !876)
!876 = !{!877}
!877 = !DISubrange(count: 4)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !864, file: !865, line: 168, baseType: !708, size: 64, offset: 128)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !864, file: !865, line: 169, baseType: !708, size: 64, offset: 192)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !864, file: !865, line: 170, baseType: !708, size: 64, offset: 256)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !864, file: !865, line: 171, baseType: !740, size: 64, offset: 320)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !864, file: !865, line: 172, baseType: !706, size: 32, offset: 384)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !864, file: !865, line: 176, baseType: !884, size: 64, offset: 448)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DISubroutineType(types: !886)
!886 = !{!869, !710, !740}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !864, file: !865, line: 177, baseType: !888, size: 64, offset: 512)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DISubroutineType(types: !890)
!890 = !{null, !710, !869}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !864, file: !865, line: 178, baseType: !710, size: 64, offset: 576)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !864, file: !865, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !864, file: !865, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !864, file: !865, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !803, file: !561, line: 177, baseType: !896, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !752, line: 56, baseType: !897)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !151, line: 3371, size: 1792, elements: !899)
!899 = !{!900, !933, !939, !950, !969, !980, !985, !992, !998, !1011, !1023, !1061, !1066, !1094, !1102, !1103, !1108, !1117, !1123, !1128, !1132, !1136, !1311, !1360, !1366, !1373, !1380, !1406, !1431, !1448, !1460, !1482, !1497, !1669}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !898, file: !151, line: 3372, baseType: !901, size: 64)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !151, line: 360, size: 64, elements: !902)
!902 = !{!903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !901, file: !151, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !901, file: !151, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !901, file: !151, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !901, file: !151, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !901, file: !151, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !901, file: !151, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !901, file: !151, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !901, file: !151, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !901, file: !151, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !901, file: !151, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !901, file: !151, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !901, file: !151, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !901, file: !151, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !901, file: !151, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !901, file: !151, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !901, file: !151, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !901, file: !151, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !901, file: !151, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !901, file: !151, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !901, file: !151, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !901, file: !151, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !901, file: !151, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !901, file: !151, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !901, file: !151, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !901, file: !151, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !901, file: !151, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !901, file: !151, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !901, file: !151, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !901, file: !151, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !901, file: !151, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !898, file: !151, line: 3373, baseType: !934, size: 192)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !151, line: 402, size: 192, elements: !935)
!935 = !{!936, !937, !938}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !934, file: !151, line: 403, baseType: !901, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !934, file: !151, line: 404, baseType: !896, size: 64, offset: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !934, file: !151, line: 405, baseType: !896, size: 64, offset: 128)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !898, file: !151, line: 3374, baseType: !940, size: 320)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !151, line: 1384, size: 320, elements: !941)
!941 = !{!942, !943}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !940, file: !151, line: 1385, baseType: !934, size: 192)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !940, file: !151, line: 1386, baseType: !944, size: 128, offset: 192)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !945, line: 58, baseType: !946)
!945 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !945, line: 54, size: 128, elements: !947)
!947 = !{!948, !949}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !946, file: !945, line: 56, baseType: !729, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !946, file: !945, line: 57, baseType: !740, size: 64, offset: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !898, file: !151, line: 3375, baseType: !951, size: 256)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !151, line: 1397, size: 256, elements: !952)
!952 = !{!953, !954}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !951, file: !151, line: 1398, baseType: !934, size: 192)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !951, file: !151, line: 1399, baseType: !955, size: 64, offset: 192)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !957, line: 52, size: 256, elements: !958)
!957 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!958 = !{!959, !960, !961, !962, !963, !964, !965}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !956, file: !957, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !956, file: !957, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !956, file: !957, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !956, file: !957, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !956, file: !957, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !956, file: !957, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !956, file: !957, line: 62, baseType: !966, size: 192, offset: 64)
!966 = !DICompositeType(tag: DW_TAG_array_type, baseType: !729, size: 192, elements: !967)
!967 = !{!968}
!968 = !DISubrange(count: 3)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !898, file: !151, line: 3376, baseType: !970, size: 256)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !151, line: 1408, size: 256, elements: !971)
!971 = !{!972, !973}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !970, file: !151, line: 1409, baseType: !934, size: 192)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !970, file: !151, line: 1410, baseType: !974, size: 64, offset: 192)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !976, line: 27, size: 192, elements: !977)
!976 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!977 = !{!978, !979}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !975, file: !976, line: 29, baseType: !944, size: 128)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !975, file: !976, line: 30, baseType: !5, size: 32, offset: 128)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !898, file: !151, line: 3377, baseType: !981, size: 256)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !151, line: 1437, size: 256, elements: !982)
!982 = !{!983, !984}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !981, file: !151, line: 1438, baseType: !934, size: 192)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !981, file: !151, line: 1439, baseType: !896, size: 64, offset: 192)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !898, file: !151, line: 3378, baseType: !986, size: 256)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !151, line: 1418, size: 256, elements: !987)
!987 = !{!988, !989, !990}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !986, file: !151, line: 1419, baseType: !934, size: 192)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !986, file: !151, line: 1420, baseType: !706, size: 32, offset: 192)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !986, file: !151, line: 1421, baseType: !991, size: 8, offset: 224)
!991 = !DICompositeType(tag: DW_TAG_array_type, baseType: !709, size: 8, elements: !817)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !898, file: !151, line: 3379, baseType: !993, size: 320)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !151, line: 1428, size: 320, elements: !994)
!994 = !{!995, !996, !997}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !993, file: !151, line: 1429, baseType: !934, size: 192)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !993, file: !151, line: 1430, baseType: !896, size: 64, offset: 192)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !993, file: !151, line: 1431, baseType: !896, size: 64, offset: 256)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !898, file: !151, line: 3380, baseType: !999, size: 320)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !151, line: 1460, size: 320, elements: !1000)
!1000 = !{!1001, !1002}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !999, file: !151, line: 1461, baseType: !934, size: 192)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !999, file: !151, line: 1462, baseType: !1003, size: 128, offset: 192)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1004, line: 31, size: 128, elements: !1005)
!1004 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1005 = !{!1006, !1009, !1010}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1003, file: !1004, line: 32, baseType: !1007, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !705)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1003, file: !1004, line: 33, baseType: !7, size: 32, offset: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1003, file: !1004, line: 34, baseType: !7, size: 32, offset: 96)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !898, file: !151, line: 3381, baseType: !1012, size: 384)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !151, line: 2507, size: 384, elements: !1013)
!1013 = !{!1014, !1015, !1020, !1021, !1022}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1012, file: !151, line: 2508, baseType: !934, size: 192)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1012, file: !151, line: 2509, baseType: !1016, size: 32, offset: 192)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1017, line: 58, baseType: !1018)
!1017 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1019, line: 44, baseType: !7)
!1019 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1012, file: !151, line: 2510, baseType: !7, size: 32, offset: 224)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1012, file: !151, line: 2511, baseType: !896, size: 64, offset: 256)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1012, file: !151, line: 2512, baseType: !896, size: 64, offset: 320)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !898, file: !151, line: 3382, baseType: !1024, size: 896)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !151, line: 2652, size: 896, elements: !1025)
!1025 = !{!1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1024, file: !151, line: 2653, baseType: !1012, size: 384)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1024, file: !151, line: 2654, baseType: !896, size: 64, offset: 384)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1024, file: !151, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1024, file: !151, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1024, file: !151, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1024, file: !151, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1024, file: !151, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1024, file: !151, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1024, file: !151, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1024, file: !151, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1024, file: !151, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1024, file: !151, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1024, file: !151, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1024, file: !151, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1024, file: !151, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1024, file: !151, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1024, file: !151, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1024, file: !151, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1024, file: !151, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1024, file: !151, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1024, file: !151, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1024, file: !151, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1024, file: !151, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1024, file: !151, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1024, file: !151, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1024, file: !151, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1024, file: !151, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1024, file: !151, line: 2703, baseType: !7, size: 32, offset: 512)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1024, file: !151, line: 2705, baseType: !896, size: 64, offset: 576)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1024, file: !151, line: 2706, baseType: !896, size: 64, offset: 640)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1024, file: !151, line: 2707, baseType: !896, size: 64, offset: 704)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1024, file: !151, line: 2708, baseType: !896, size: 64, offset: 768)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1024, file: !151, line: 2711, baseType: !1059, size: 64, offset: 832)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1060 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !151, line: 2711, flags: DIFlagFwdDecl)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !898, file: !151, line: 3383, baseType: !1062, size: 960)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !151, line: 2756, size: 960, elements: !1063)
!1063 = !{!1064, !1065}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1062, file: !151, line: 2757, baseType: !1024, size: 896)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1062, file: !151, line: 2758, baseType: !783, size: 64, offset: 896)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !898, file: !151, line: 3384, baseType: !1067, size: 1472)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !151, line: 3114, size: 1472, elements: !1068)
!1068 = !{!1069, !1090, !1091, !1092, !1093}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1067, file: !151, line: 3115, baseType: !1070, size: 1216)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !151, line: 2984, size: 1216, elements: !1071)
!1071 = !{!1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1070, file: !151, line: 2985, baseType: !1062, size: 960)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1070, file: !151, line: 2986, baseType: !896, size: 64, offset: 960)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1070, file: !151, line: 2987, baseType: !896, size: 64, offset: 1024)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1070, file: !151, line: 2988, baseType: !896, size: 64, offset: 1088)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1070, file: !151, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1070, file: !151, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1070, file: !151, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1070, file: !151, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1070, file: !151, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1070, file: !151, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1070, file: !151, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1070, file: !151, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1070, file: !151, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1070, file: !151, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1070, file: !151, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1070, file: !151, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1070, file: !151, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1070, file: !151, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1067, file: !151, line: 3117, baseType: !896, size: 64, offset: 1216)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1067, file: !151, line: 3119, baseType: !896, size: 64, offset: 1280)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1067, file: !151, line: 3121, baseType: !896, size: 64, offset: 1344)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1067, file: !151, line: 3123, baseType: !896, size: 64, offset: 1408)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !898, file: !151, line: 3385, baseType: !1095, size: 1088)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !151, line: 2874, size: 1088, elements: !1096)
!1096 = !{!1097, !1098, !1099}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1095, file: !151, line: 2875, baseType: !1062, size: 960)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1095, file: !151, line: 2876, baseType: !783, size: 64, offset: 960)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1095, file: !151, line: 2877, baseType: !1100, size: 64, offset: 1024)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64)
!1101 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !151, line: 2856, flags: DIFlagFwdDecl)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !898, file: !151, line: 3386, baseType: !1070, size: 1216)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !898, file: !151, line: 3387, baseType: !1104, size: 1280)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !151, line: 3093, size: 1280, elements: !1105)
!1105 = !{!1106, !1107}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1104, file: !151, line: 3094, baseType: !1070, size: 1216)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1104, file: !151, line: 3095, baseType: !1100, size: 64, offset: 1216)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !898, file: !151, line: 3388, baseType: !1109, size: 1216)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !151, line: 2824, size: 1216, elements: !1110)
!1110 = !{!1111, !1112, !1113, !1114, !1115, !1116}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1109, file: !151, line: 2825, baseType: !1024, size: 896)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1109, file: !151, line: 2827, baseType: !896, size: 64, offset: 896)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1109, file: !151, line: 2828, baseType: !896, size: 64, offset: 960)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1109, file: !151, line: 2829, baseType: !896, size: 64, offset: 1024)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1109, file: !151, line: 2830, baseType: !896, size: 64, offset: 1088)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1109, file: !151, line: 2831, baseType: !896, size: 64, offset: 1152)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !898, file: !151, line: 3389, baseType: !1118, size: 1024)
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !151, line: 2850, size: 1024, elements: !1119)
!1119 = !{!1120, !1121, !1122}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1118, file: !151, line: 2851, baseType: !1062, size: 960)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1118, file: !151, line: 2852, baseType: !706, size: 32, offset: 960)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1118, file: !151, line: 2853, baseType: !706, size: 32, offset: 992)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !898, file: !151, line: 3390, baseType: !1124, size: 1024)
!1124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !151, line: 2857, size: 1024, elements: !1125)
!1125 = !{!1126, !1127}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1124, file: !151, line: 2858, baseType: !1062, size: 960)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1124, file: !151, line: 2859, baseType: !1100, size: 64, offset: 960)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !898, file: !151, line: 3391, baseType: !1129, size: 960)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !151, line: 2862, size: 960, elements: !1130)
!1130 = !{!1131}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1129, file: !151, line: 2863, baseType: !1062, size: 960)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !898, file: !151, line: 3392, baseType: !1133, size: 1472)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !151, line: 3304, size: 1472, elements: !1134)
!1134 = !{!1135}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1133, file: !151, line: 3305, baseType: !1067, size: 1472)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !898, file: !151, line: 3393, baseType: !1137, size: 1792)
!1137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !151, line: 3248, size: 1792, elements: !1138)
!1138 = !{!1139, !1140, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1137, file: !151, line: 3249, baseType: !1067, size: 1472)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1137, file: !151, line: 3251, baseType: !1141, size: 64, offset: 1472)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64)
!1142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1143, line: 463, size: 1152, elements: !1144)
!1143 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1144 = !{!1145, !1148, !1178, !1179, !1182, !1185, !1235, !1236, !1237, !1238, !1239, !1263, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1142, file: !1143, line: 464, baseType: !1146, size: 64)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64)
!1147 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1143, line: 464, flags: DIFlagFwdDecl)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1142, file: !1143, line: 467, baseType: !1149, size: 64, offset: 64)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64)
!1150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !135, line: 374, size: 640, elements: !1151)
!1151 = !{!1152, !1153, !1154, !1167, !1168, !1169, !1170, !1171, !1172, !1174, !1176, !1177}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1150, file: !135, line: 377, baseType: !751, size: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1150, file: !135, line: 378, baseType: !751, size: 64, offset: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1150, file: !135, line: 381, baseType: !1155, size: 64, offset: 128)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !135, line: 282, baseType: !1157)
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !135, line: 282, size: 128, elements: !1158)
!1158 = !{!1159}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1157, file: !135, line: 282, baseType: !1160, size: 128)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !135, line: 281, baseType: !1161)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !135, line: 281, size: 128, elements: !1162)
!1162 = !{!1163, !1164, !1165}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1161, file: !135, line: 281, baseType: !7, size: 32)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1161, file: !135, line: 281, baseType: !7, size: 32, offset: 32)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1161, file: !135, line: 281, baseType: !1166, size: 64, offset: 64)
!1166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !751, size: 64, elements: !817)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1150, file: !135, line: 384, baseType: !706, size: 32, offset: 192)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1150, file: !135, line: 387, baseType: !706, size: 32, offset: 224)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1150, file: !135, line: 390, baseType: !706, size: 32, offset: 256)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1150, file: !135, line: 394, baseType: !1155, size: 64, offset: 320)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1150, file: !135, line: 396, baseType: !134, size: 32, offset: 384)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1150, file: !135, line: 399, baseType: !1173, size: 64, offset: 416)
!1173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 64, elements: !852)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1150, file: !135, line: 402, baseType: !1175, size: 64, offset: 480)
!1175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !852)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1150, file: !135, line: 406, baseType: !706, size: 32, offset: 544)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1150, file: !135, line: 409, baseType: !706, size: 32, offset: 576)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1142, file: !1143, line: 470, baseType: !780, size: 64, offset: 128)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1142, file: !1143, line: 473, baseType: !1180, size: 64, offset: 192)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64)
!1181 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1143, line: 166, flags: DIFlagFwdDecl)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1142, file: !1143, line: 476, baseType: !1183, size: 64, offset: 256)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64)
!1184 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1143, line: 476, flags: DIFlagFwdDecl)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1142, file: !1143, line: 479, baseType: !1186, size: 64, offset: 320)
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1187, line: 144, baseType: !1188)
!1187 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64)
!1189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1187, line: 100, size: 896, elements: !1190)
!1190 = !{!1191, !1199, !1204, !1209, !1211, !1212, !1213, !1214, !1215, !1216, !1221, !1223, !1224, !1229, !1234}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1189, file: !1187, line: 102, baseType: !1192, size: 64)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1187, line: 52, baseType: !1193)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64)
!1194 = !DISubroutineType(types: !1195)
!1195 = !{!1196, !1197}
!1196 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1187, line: 47, baseType: !7)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64)
!1198 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1189, file: !1187, line: 105, baseType: !1200, size: 64, offset: 64)
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1187, line: 59, baseType: !1201)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64)
!1202 = !DISubroutineType(types: !1203)
!1203 = !{!706, !1197, !1197}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1189, file: !1187, line: 108, baseType: !1205, size: 64, offset: 128)
!1205 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1187, line: 63, baseType: !1206)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64)
!1207 = !DISubroutineType(types: !1208)
!1208 = !{null, !710}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1189, file: !1187, line: 111, baseType: !1210, size: 64, offset: 192)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1189, file: !1187, line: 114, baseType: !727, size: 64, offset: 256)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1189, file: !1187, line: 117, baseType: !727, size: 64, offset: 320)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1189, file: !1187, line: 120, baseType: !727, size: 64, offset: 384)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1189, file: !1187, line: 124, baseType: !7, size: 32, offset: 448)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1189, file: !1187, line: 128, baseType: !7, size: 32, offset: 480)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1189, file: !1187, line: 131, baseType: !1217, size: 64, offset: 512)
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1187, line: 75, baseType: !1218)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64)
!1219 = !DISubroutineType(types: !1220)
!1220 = !{!710, !727, !727}
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1189, file: !1187, line: 132, baseType: !1222, size: 64, offset: 576)
!1222 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1187, line: 78, baseType: !1206)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1189, file: !1187, line: 135, baseType: !710, size: 64, offset: 640)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1189, file: !1187, line: 136, baseType: !1225, size: 64, offset: 704)
!1225 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1187, line: 82, baseType: !1226)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64)
!1227 = !DISubroutineType(types: !1228)
!1228 = !{!710, !710, !727, !727}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1189, file: !1187, line: 137, baseType: !1230, size: 64, offset: 768)
!1230 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1187, line: 83, baseType: !1231)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64)
!1232 = !DISubroutineType(types: !1233)
!1233 = !{null, !710, !710}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1189, file: !1187, line: 141, baseType: !7, size: 32, offset: 832)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1142, file: !1143, line: 484, baseType: !896, size: 64, offset: 384)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1142, file: !1143, line: 488, baseType: !896, size: 64, offset: 448)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1142, file: !1143, line: 493, baseType: !896, size: 64, offset: 512)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1142, file: !1143, line: 496, baseType: !896, size: 64, offset: 576)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1142, file: !1143, line: 501, baseType: !1240, size: 64, offset: 640)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64)
!1241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !146, line: 2355, size: 576, elements: !1242)
!1242 = !{!1243, !1246, !1247, !1248, !1249, !1251, !1252, !1257, !1258, !1259, !1260, !1261, !1262}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1241, file: !146, line: 2356, baseType: !1244, size: 64)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64)
!1245 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !146, line: 2356, flags: DIFlagFwdDecl)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1241, file: !146, line: 2357, baseType: !711, size: 64, offset: 64)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1241, file: !146, line: 2358, baseType: !706, size: 32, offset: 128)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1241, file: !146, line: 2359, baseType: !706, size: 32, offset: 160)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1241, file: !146, line: 2360, baseType: !1250, size: 128, offset: 192)
!1250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !706, size: 128, elements: !876)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1241, file: !146, line: 2364, baseType: !706, size: 32, offset: 320)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1241, file: !146, line: 2367, baseType: !1253, size: 128, offset: 384)
!1253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !146, line: 2349, size: 128, elements: !1254)
!1254 = !{!1255, !1256}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1253, file: !146, line: 2351, baseType: !783, size: 64)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1253, file: !146, line: 2352, baseType: !740, size: 64, offset: 64)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1241, file: !146, line: 2371, baseType: !145, size: 32, offset: 512)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1241, file: !146, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1241, file: !146, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1241, file: !146, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1241, file: !146, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1241, file: !146, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1142, file: !1143, line: 504, baseType: !1264, size: 64, offset: 704)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64)
!1265 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1143, line: 504, flags: DIFlagFwdDecl)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1142, file: !1143, line: 507, baseType: !1186, size: 64, offset: 768)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1142, file: !1143, line: 510, baseType: !706, size: 32, offset: 832)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1142, file: !1143, line: 513, baseType: !706, size: 32, offset: 864)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1142, file: !1143, line: 516, baseType: !1016, size: 32, offset: 896)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1142, file: !1143, line: 519, baseType: !1016, size: 32, offset: 928)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1142, file: !1143, line: 522, baseType: !7, size: 32, offset: 960)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1142, file: !1143, line: 523, baseType: !7, size: 32, offset: 992)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1142, file: !1143, line: 528, baseType: !711, size: 64, offset: 1024)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1142, file: !1143, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1142, file: !1143, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1142, file: !1143, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1142, file: !1143, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1142, file: !1143, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1142, file: !1143, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1142, file: !1143, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1142, file: !1143, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1142, file: !1143, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1142, file: !1143, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1142, file: !1143, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1142, file: !1143, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1142, file: !1143, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1142, file: !1143, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1142, file: !1143, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1142, file: !1143, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1137, file: !151, line: 3254, baseType: !896, size: 64, offset: 1536)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1137, file: !151, line: 3257, baseType: !896, size: 64, offset: 1600)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1137, file: !151, line: 3258, baseType: !896, size: 64, offset: 1664)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1137, file: !151, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1137, file: !151, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1137, file: !151, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1137, file: !151, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1137, file: !151, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1137, file: !151, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1137, file: !151, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1137, file: !151, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1137, file: !151, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1137, file: !151, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1137, file: !151, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1137, file: !151, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1137, file: !151, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1137, file: !151, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1137, file: !151, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1137, file: !151, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1137, file: !151, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1137, file: !151, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !898, file: !151, line: 3394, baseType: !1312, size: 1344)
!1312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !151, line: 2279, size: 1344, elements: !1313)
!1313 = !{!1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1339, !1340, !1341, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357}
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1312, file: !151, line: 2280, baseType: !934, size: 192)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1312, file: !151, line: 2281, baseType: !896, size: 64, offset: 192)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1312, file: !151, line: 2282, baseType: !896, size: 64, offset: 256)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1312, file: !151, line: 2283, baseType: !896, size: 64, offset: 320)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1312, file: !151, line: 2284, baseType: !896, size: 64, offset: 384)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1312, file: !151, line: 2285, baseType: !7, size: 32, offset: 448)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1312, file: !151, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1312, file: !151, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1312, file: !151, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1312, file: !151, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1312, file: !151, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1312, file: !151, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1312, file: !151, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1312, file: !151, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1312, file: !151, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1312, file: !151, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1312, file: !151, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1312, file: !151, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1312, file: !151, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1312, file: !151, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1312, file: !151, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1312, file: !151, line: 2305, baseType: !7, size: 32, offset: 512)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1312, file: !151, line: 2306, baseType: !1337, size: 32, offset: 544)
!1337 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1338, line: 31, baseType: !706)
!1338 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1312, file: !151, line: 2307, baseType: !896, size: 64, offset: 576)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1312, file: !151, line: 2308, baseType: !896, size: 64, offset: 640)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1312, file: !151, line: 2314, baseType: !1342, size: 64, offset: 704)
!1342 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !151, line: 2309, size: 64, elements: !1343)
!1343 = !{!1344, !1345, !1346}
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1342, file: !151, line: 2310, baseType: !706, size: 32)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1342, file: !151, line: 2311, baseType: !711, size: 64)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1342, file: !151, line: 2312, baseType: !1347, size: 64)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64)
!1348 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !151, line: 2277, flags: DIFlagFwdDecl)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1312, file: !151, line: 2315, baseType: !896, size: 64, offset: 768)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1312, file: !151, line: 2316, baseType: !896, size: 64, offset: 832)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1312, file: !151, line: 2317, baseType: !896, size: 64, offset: 896)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1312, file: !151, line: 2318, baseType: !896, size: 64, offset: 960)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1312, file: !151, line: 2319, baseType: !896, size: 64, offset: 1024)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1312, file: !151, line: 2320, baseType: !896, size: 64, offset: 1088)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1312, file: !151, line: 2321, baseType: !896, size: 64, offset: 1152)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1312, file: !151, line: 2322, baseType: !896, size: 64, offset: 1216)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1312, file: !151, line: 2324, baseType: !1358, size: 64, offset: 1280)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64)
!1359 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !151, line: 2324, flags: DIFlagFwdDecl)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !898, file: !151, line: 3395, baseType: !1361, size: 320)
!1361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !151, line: 1469, size: 320, elements: !1362)
!1362 = !{!1363, !1364, !1365}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1361, file: !151, line: 1470, baseType: !934, size: 192)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1361, file: !151, line: 1471, baseType: !896, size: 64, offset: 192)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1361, file: !151, line: 1472, baseType: !896, size: 64, offset: 256)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !898, file: !151, line: 3396, baseType: !1367, size: 320)
!1367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !151, line: 1482, size: 320, elements: !1368)
!1368 = !{!1369, !1370, !1371}
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1367, file: !151, line: 1483, baseType: !934, size: 192)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1367, file: !151, line: 1484, baseType: !706, size: 32, offset: 192)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1367, file: !151, line: 1485, baseType: !1372, size: 64, offset: 256)
!1372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !896, size: 64, elements: !817)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !898, file: !151, line: 3397, baseType: !1374, size: 384)
!1374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !151, line: 1829, size: 384, elements: !1375)
!1375 = !{!1376, !1377, !1378, !1379}
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1374, file: !151, line: 1830, baseType: !934, size: 192)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1374, file: !151, line: 1831, baseType: !1016, size: 32, offset: 192)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1374, file: !151, line: 1832, baseType: !896, size: 64, offset: 256)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1374, file: !151, line: 1835, baseType: !1372, size: 64, offset: 320)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !898, file: !151, line: 3398, baseType: !1381, size: 704)
!1381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !151, line: 1898, size: 704, elements: !1382)
!1382 = !{!1383, !1384, !1385, !1389, !1390, !1393}
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1381, file: !151, line: 1899, baseType: !934, size: 192)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1381, file: !151, line: 1902, baseType: !896, size: 64, offset: 192)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1381, file: !151, line: 1905, baseType: !1386, size: 64, offset: 256)
!1386 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !752, line: 58, baseType: !1387)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1388, size: 64)
!1388 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !752, line: 57, flags: DIFlagFwdDecl)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1381, file: !151, line: 1908, baseType: !7, size: 32, offset: 320)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1381, file: !151, line: 1911, baseType: !1391, size: 64, offset: 384)
!1391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1392, size: 64)
!1392 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !151, line: 1876, flags: DIFlagFwdDecl)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1381, file: !151, line: 1914, baseType: !1394, size: 256, offset: 448)
!1394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !151, line: 1883, size: 256, elements: !1395)
!1395 = !{!1396, !1398, !1399, !1404}
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1394, file: !151, line: 1884, baseType: !1397, size: 64)
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1394, size: 64)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1394, file: !151, line: 1885, baseType: !1397, size: 64, offset: 64)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1394, file: !151, line: 1891, baseType: !1400, size: 64, offset: 128)
!1400 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1394, file: !151, line: 1891, size: 64, elements: !1401)
!1401 = !{!1402, !1403}
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1400, file: !151, line: 1891, baseType: !1386, size: 64)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1400, file: !151, line: 1891, baseType: !896, size: 64)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1394, file: !151, line: 1892, baseType: !1405, size: 64, offset: 192)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !898, file: !151, line: 3399, baseType: !1407, size: 704)
!1407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !151, line: 2008, size: 704, elements: !1408)
!1408 = !{!1409, !1410, !1411, !1412, !1413, !1414, !1426, !1427, !1428, !1429, !1430}
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1407, file: !151, line: 2009, baseType: !934, size: 192)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1407, file: !151, line: 2011, baseType: !7, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !1407, file: !151, line: 2012, baseType: !7, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1407, file: !151, line: 2014, baseType: !1016, size: 32, offset: 224)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1407, file: !151, line: 2016, baseType: !896, size: 64, offset: 256)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !1407, file: !151, line: 2017, baseType: !1415, size: 64, offset: 320)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64)
!1416 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !151, line: 183, baseType: !1417)
!1417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !151, line: 183, size: 128, elements: !1418)
!1418 = !{!1419}
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1417, file: !151, line: 183, baseType: !1420, size: 128)
!1420 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !151, line: 182, baseType: !1421)
!1421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !151, line: 182, size: 128, elements: !1422)
!1422 = !{!1423, !1424, !1425}
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1421, file: !151, line: 182, baseType: !7, size: 32)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1421, file: !151, line: 182, baseType: !7, size: 32, offset: 32)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1421, file: !151, line: 182, baseType: !1372, size: 64, offset: 64)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !1407, file: !151, line: 2019, baseType: !896, size: 64, offset: 384)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !1407, file: !151, line: 2020, baseType: !896, size: 64, offset: 448)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1407, file: !151, line: 2021, baseType: !896, size: 64, offset: 512)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !1407, file: !151, line: 2022, baseType: !896, size: 64, offset: 576)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !1407, file: !151, line: 2023, baseType: !896, size: 64, offset: 640)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !898, file: !151, line: 3400, baseType: !1432, size: 832)
!1432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !151, line: 2430, size: 832, elements: !1433)
!1433 = !{!1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443}
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1432, file: !151, line: 2431, baseType: !934, size: 192)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1432, file: !151, line: 2433, baseType: !896, size: 64, offset: 192)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !1432, file: !151, line: 2434, baseType: !896, size: 64, offset: 256)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !1432, file: !151, line: 2435, baseType: !896, size: 64, offset: 320)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !1432, file: !151, line: 2436, baseType: !896, size: 64, offset: 384)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "base_accesses", scope: !1432, file: !151, line: 2437, baseType: !1415, size: 64, offset: 448)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "inheritance", scope: !1432, file: !151, line: 2438, baseType: !896, size: 64, offset: 512)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_subvtt", scope: !1432, file: !151, line: 2440, baseType: !896, size: 64, offset: 576)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_vptr", scope: !1432, file: !151, line: 2441, baseType: !896, size: 64, offset: 640)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "base_binfos", scope: !1432, file: !151, line: 2443, baseType: !1444, size: 128, offset: 704)
!1444 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_none", file: !151, line: 182, baseType: !1445)
!1445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_none", file: !151, line: 182, size: 128, elements: !1446)
!1446 = !{!1447}
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1445, file: !151, line: 182, baseType: !1420, size: 128)
