; ModuleID = 'bt-load.bc'
source_filename = "bt-load.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.rtl_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }

!683 = !DIEnumerator(name: "GT", value: 83, isUnsigned: true)
!684 = !DIEnumerator(name: "LE", value: 84, isUnsigned: true)
!685 = !DIEnumerator(name: "LT", value: 85, isUnsigned: true)
!686 = !DIEnumerator(name: "GEU", value: 86, isUnsigned: true)
!687 = !DIEnumerator(name: "GTU", value: 87, isUnsigned: true)
!688 = !DIEnumerator(name: "LEU", value: 88, isUnsigned: true)
!689 = !DIEnumerator(name: "LTU", value: 89, isUnsigned: true)
!690 = !DIEnumerator(name: "UNORDERED", value: 90, isUnsigned: true)
!691 = !DIEnumerator(name: "ORDERED", value: 91, isUnsigned: true)
!692 = !DIEnumerator(name: "UNEQ", value: 92, isUnsigned: true)
!693 = !DIEnumerator(name: "UNGE", value: 93, isUnsigned: true)
!694 = !DIEnumerator(name: "UNGT", value: 94, isUnsigned: true)
!695 = !DIEnumerator(name: "UNLE", value: 95, isUnsigned: true)
!696 = !DIEnumerator(name: "UNLT", value: 96, isUnsigned: true)
!697 = !DIEnumerator(name: "LTGT", value: 97, isUnsigned: true)
!698 = !DIEnumerator(name: "SIGN_EXTEND", value: 98, isUnsigned: true)
!699 = !DIEnumerator(name: "ZERO_EXTEND", value: 99, isUnsigned: true)
!700 = !DIEnumerator(name: "TRUNCATE", value: 100, isUnsigned: true)
!701 = !DIEnumerator(name: "FLOAT_EXTEND", value: 101, isUnsigned: true)
!702 = !DIEnumerator(name: "FLOAT_TRUNCATE", value: 102, isUnsigned: true)
!703 = !DIEnumerator(name: "FLOAT", value: 103, isUnsigned: true)
!704 = !DIEnumerator(name: "FIX", value: 104, isUnsigned: true)
!705 = !DIEnumerator(name: "UNSIGNED_FLOAT", value: 105, isUnsigned: true)
!706 = !DIEnumerator(name: "UNSIGNED_FIX", value: 106, isUnsigned: true)
!707 = !DIEnumerator(name: "FRACT_CONVERT", value: 107, isUnsigned: true)
!708 = !DIEnumerator(name: "UNSIGNED_FRACT_CONVERT", value: 108, isUnsigned: true)
!709 = !DIEnumerator(name: "SAT_FRACT", value: 109, isUnsigned: true)
!710 = !DIEnumerator(name: "UNSIGNED_SAT_FRACT", value: 110, isUnsigned: true)
!711 = !DIEnumerator(name: "ABS", value: 111, isUnsigned: true)
!712 = !DIEnumerator(name: "SQRT", value: 112, isUnsigned: true)
!713 = !DIEnumerator(name: "BSWAP", value: 113, isUnsigned: true)
!714 = !DIEnumerator(name: "FFS", value: 114, isUnsigned: true)
!715 = !DIEnumerator(name: "CLZ", value: 115, isUnsigned: true)
!716 = !DIEnumerator(name: "CTZ", value: 116, isUnsigned: true)
!717 = !DIEnumerator(name: "POPCOUNT", value: 117, isUnsigned: true)
!718 = !DIEnumerator(name: "PARITY", value: 118, isUnsigned: true)
!719 = !DIEnumerator(name: "SIGN_EXTRACT", value: 119, isUnsigned: true)
!720 = !DIEnumerator(name: "ZERO_EXTRACT", value: 120, isUnsigned: true)
!721 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!722 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!723 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!724 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!725 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!726 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!727 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!728 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!729 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!730 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!731 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!732 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!733 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!734 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!735 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!736 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!737 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!738 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!739 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!740 = !{!741, !742, !743, !744, !747, !748, !750, !754, !753, !757, !760, !761, !1961, !745, !1962, !1963, !1964, !597, !800, !762, !1937, !7, !759, !220, !1945, !1965, !1985}
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!743 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !746)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DISubroutineType(types: !752)
!752 = !{!747, !753}
!753 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DISubroutineType(types: !756)
!756 = !{null, !747}
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "HARD_REG_ELT_TYPE", file: !758, line: 42, baseType: !759)
!758 = !DIFile(filename: "./hard-reg-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!759 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "btr_def", file: !3, line: 110, baseType: !762)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "btr_def_s", file: !3, line: 76, size: 640, elements: !764)
!764 = !{!765, !766, !767, !1931, !1932, !1933, !1934, !1935, !1943, !1956, !1957, !1958, !1959, !1960}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "next_this_bb", scope: !763, file: !3, line: 78, baseType: !762, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "next_this_group", scope: !763, file: !3, line: 79, baseType: !762, size: 64, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !763, file: !3, line: 80, baseType: !768, size: 64, offset: 128)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !769, line: 111, baseType: !770)
!769 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !356, line: 217, size: 832, elements: !772)
!772 = !{!773, !1896, !1897, !1898, !1901, !1905, !1906, !1907, !1925, !1926, !1927, !1928, !1929, !1930}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !771, file: !356, line: 219, baseType: !774, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !356, line: 151, baseType: !776)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !356, line: 151, size: 128, elements: !777)
!777 = !{!778}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !776, file: !356, line: 151, baseType: !779, size: 128)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !356, line: 150, baseType: !780)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !356, line: 150, size: 128, elements: !781)
!781 = !{!782, !783, !784}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !780, file: !356, line: 150, baseType: !7, size: 32)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !780, file: !356, line: 150, baseType: !7, size: 32, offset: 32)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !780, file: !356, line: 150, baseType: !785, size: 64, offset: 64)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !786, size: 64, elements: !834)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !769, line: 108, baseType: !787)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !356, line: 122, size: 512, elements: !789)
!789 = !{!790, !791, !792, !1888, !1889, !1890, !1891, !1892, !1893, !1894}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !788, file: !356, line: 124, baseType: !770, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !788, file: !356, line: 125, baseType: !770, size: 64, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !788, file: !356, line: 131, baseType: !793, size: 64, offset: 128)
!793 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !356, line: 128, size: 64, elements: !794)
!794 = !{!795, !799}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !793, file: !356, line: 129, baseType: !796, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !769, line: 66, baseType: !797)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !769, line: 65, flags: DIFlagFwdDecl)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !793, file: !356, line: 130, baseType: !800, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !769, line: 50, baseType: !801)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !598, line: 240, size: 384, elements: !803)
!803 = !{!804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !802, file: !598, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !802, file: !598, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !802, file: !598, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !802, file: !598, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !802, file: !598, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !802, file: !598, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !802, file: !598, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !802, file: !598, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !802, file: !598, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !802, file: !598, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !802, file: !598, line: 321, baseType: !815, size: 320, offset: 64)
!815 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !598, line: 315, size: 320, elements: !816)
!816 = !{!817, !1823, !1825, !1886, !1887}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !815, file: !598, line: 316, baseType: !818, size: 64)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !819, size: 64, elements: !834)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !598, line: 183, baseType: !820)
!820 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !598, line: 166, size: 64, elements: !821)
!821 = !{!822, !823, !824, !825, !826, !836, !837, !849, !852, !912, !1801, !1802, !1813, !1820}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !820, file: !598, line: 168, baseType: !743, size: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !820, file: !598, line: 169, baseType: !7, size: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !820, file: !598, line: 170, baseType: !748, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !820, file: !598, line: 171, baseType: !800, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !820, file: !598, line: 172, baseType: !827, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !769, line: 53, baseType: !828)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !598, line: 359, size: 128, elements: !830)
!830 = !{!831, !832}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !829, file: !598, line: 360, baseType: !743, size: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !829, file: !598, line: 361, baseType: !833, size: 64, offset: 64)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !800, size: 64, elements: !834)
!834 = !{!835}
!835 = !DISubrange(count: 1)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !820, file: !598, line: 173, baseType: !220, size: 32)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !820, file: !598, line: 174, baseType: !838, size: 32)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !598, line: 133, baseType: !839)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !598, line: 115, size: 32, elements: !840)
!840 = !{!841, !842, !843, !844, !845, !846, !847, !848}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !839, file: !598, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !839, file: !598, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !839, file: !598, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !839, file: !598, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !839, file: !598, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !839, file: !598, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !839, file: !598, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !839, file: !598, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !820, file: !598, line: 175, baseType: !850, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !598, line: 175, flags: DIFlagFwdDecl)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !820, file: !598, line: 176, baseType: !853, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !855, line: 75, size: 256, elements: !856)
!855 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!856 = !{!857, !871, !872, !873}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !854, file: !855, line: 76, baseType: !858, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !855, line: 68, baseType: !860)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !855, line: 63, size: 320, elements: !861)
!861 = !{!862, !864, !865, !866}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !860, file: !855, line: 64, baseType: !863, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !860, file: !855, line: 65, baseType: !863, size: 64, offset: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !860, file: !855, line: 66, baseType: !7, size: 32, offset: 128)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !860, file: !855, line: 67, baseType: !867, size: 128, offset: 192)
!867 = !DICompositeType(tag: DW_TAG_array_type, baseType: !868, size: 128, elements: !869)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !855, line: 29, baseType: !759)
!869 = !{!870}
!870 = !DISubrange(count: 2)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !854, file: !855, line: 77, baseType: !858, size: 64, offset: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !854, file: !855, line: 78, baseType: !7, size: 32, offset: 128)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !854, file: !855, line: 79, baseType: !874, size: 64, offset: 192)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !855, line: 49, baseType: !876)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !855, line: 45, size: 832, elements: !877)
!877 = !{!878, !879, !880}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !876, file: !855, line: 46, baseType: !863, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !876, file: !855, line: 47, baseType: !853, size: 64, offset: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !876, file: !855, line: 48, baseType: !881, size: 704, offset: 128)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !882, line: 164, size: 704, elements: !883)
!882 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!883 = !{!884, !885, !895, !896, !897, !898, !899, !900, !904, !908, !909, !910, !911}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !881, file: !882, line: 166, baseType: !753, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !881, file: !882, line: 167, baseType: !886, size: 64, offset: 64)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !882, line: 157, size: 192, elements: !888)
!888 = !{!889, !890, !891}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !887, file: !882, line: 159, baseType: !745, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !887, file: !882, line: 160, baseType: !886, size: 64, offset: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !887, file: !882, line: 161, baseType: !892, size: 32, offset: 128)
!892 = !DICompositeType(tag: DW_TAG_array_type, baseType: !746, size: 32, elements: !893)
!893 = !{!894}
!894 = !DISubrange(count: 4)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !881, file: !882, line: 168, baseType: !745, size: 64, offset: 128)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !881, file: !882, line: 169, baseType: !745, size: 64, offset: 192)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !881, file: !882, line: 170, baseType: !745, size: 64, offset: 256)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !881, file: !882, line: 171, baseType: !753, size: 64, offset: 320)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !881, file: !882, line: 172, baseType: !743, size: 32, offset: 384)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !881, file: !882, line: 176, baseType: !901, size: 64, offset: 448)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DISubroutineType(types: !903)
!903 = !{!886, !747, !753}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !881, file: !882, line: 177, baseType: !905, size: 64, offset: 512)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DISubroutineType(types: !907)
!907 = !{null, !747, !886}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !881, file: !882, line: 178, baseType: !747, size: 64, offset: 576)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !881, file: !882, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !881, file: !882, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !881, file: !882, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !820, file: !598, line: 177, baseType: !913, size: 64)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !769, line: 56, baseType: !914)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !371, line: 3371, size: 1792, elements: !916)
!916 = !{!917, !950, !956, !967, !986, !997, !1002, !1009, !1015, !1028, !1040, !1078, !1083, !1111, !1119, !1120, !1125, !1134, !1140, !1145, !1149, !1153, !1437, !1486, !1492, !1498, !1505, !1531, !1545, !1562, !1574, !1596, !1611, !1783}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !915, file: !371, line: 3372, baseType: !918, size: 64)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !371, line: 360, size: 64, elements: !919)
!919 = !{!920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !918, file: !371, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !918, file: !371, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !918, file: !371, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !918, file: !371, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !918, file: !371, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !918, file: !371, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !918, file: !371, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !918, file: !371, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !918, file: !371, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !918, file: !371, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !918, file: !371, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !918, file: !371, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !918, file: !371, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !918, file: !371, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !918, file: !371, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !918, file: !371, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !918, file: !371, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !918, file: !371, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !918, file: !371, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !918, file: !371, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !918, file: !371, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !918, file: !371, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !918, file: !371, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !918, file: !371, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !918, file: !371, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !918, file: !371, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !918, file: !371, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !918, file: !371, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !918, file: !371, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !918, file: !371, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !915, file: !371, line: 3373, baseType: !951, size: 192)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !371, line: 402, size: 192, elements: !952)
!952 = !{!953, !954, !955}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !951, file: !371, line: 403, baseType: !918, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !951, file: !371, line: 404, baseType: !913, size: 64, offset: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !951, file: !371, line: 405, baseType: !913, size: 64, offset: 128)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !915, file: !371, line: 3374, baseType: !957, size: 320)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !371, line: 1384, size: 320, elements: !958)
!958 = !{!959, !960}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !957, file: !371, line: 1385, baseType: !951, size: 192)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !957, file: !371, line: 1386, baseType: !961, size: 128, offset: 192)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !962, line: 58, baseType: !963)
!962 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !962, line: 54, size: 128, elements: !964)
!964 = !{!965, !966}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !963, file: !962, line: 56, baseType: !759, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !963, file: !962, line: 57, baseType: !753, size: 64, offset: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !915, file: !371, line: 3375, baseType: !968, size: 256)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !371, line: 1397, size: 256, elements: !969)
!969 = !{!970, !971}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !968, file: !371, line: 1398, baseType: !951, size: 192)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !968, file: !371, line: 1399, baseType: !972, size: 64, offset: 192)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !974, line: 52, size: 256, elements: !975)
!974 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!975 = !{!976, !977, !978, !979, !980, !981, !982}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !973, file: !974, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !973, file: !974, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !973, file: !974, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !973, file: !974, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !973, file: !974, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !973, file: !974, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !973, file: !974, line: 62, baseType: !983, size: 192, offset: 64)
!983 = !DICompositeType(tag: DW_TAG_array_type, baseType: !759, size: 192, elements: !984)
!984 = !{!985}
!985 = !DISubrange(count: 3)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !915, file: !371, line: 3376, baseType: !987, size: 256)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !371, line: 1408, size: 256, elements: !988)
!988 = !{!989, !990}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !987, file: !371, line: 1409, baseType: !951, size: 192)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !987, file: !371, line: 1410, baseType: !991, size: 64, offset: 192)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !993, line: 27, size: 192, elements: !994)
!993 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!994 = !{!995, !996}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !992, file: !993, line: 29, baseType: !961, size: 128)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !992, file: !993, line: 30, baseType: !220, size: 32, offset: 128)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !915, file: !371, line: 3377, baseType: !998, size: 256)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !371, line: 1437, size: 256, elements: !999)
!999 = !{!1000, !1001}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !998, file: !371, line: 1438, baseType: !951, size: 192)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !998, file: !371, line: 1439, baseType: !913, size: 64, offset: 192)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !915, file: !371, line: 3378, baseType: !1003, size: 256)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !371, line: 1418, size: 256, elements: !1004)
!1004 = !{!1005, !1006, !1007}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1003, file: !371, line: 1419, baseType: !951, size: 192)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1003, file: !371, line: 1420, baseType: !743, size: 32, offset: 192)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1003, file: !371, line: 1421, baseType: !1008, size: 8, offset: 224)
!1008 = !DICompositeType(tag: DW_TAG_array_type, baseType: !746, size: 8, elements: !834)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !915, file: !371, line: 3379, baseType: !1010, size: 320)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !371, line: 1428, size: 320, elements: !1011)
!1011 = !{!1012, !1013, !1014}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1010, file: !371, line: 1429, baseType: !951, size: 192)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !1010, file: !371, line: 1430, baseType: !913, size: 64, offset: 192)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !1010, file: !371, line: 1431, baseType: !913, size: 64, offset: 256)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !915, file: !371, line: 3380, baseType: !1016, size: 320)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !371, line: 1460, size: 320, elements: !1017)
!1017 = !{!1018, !1019}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1016, file: !371, line: 1461, baseType: !951, size: 192)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1016, file: !371, line: 1462, baseType: !1020, size: 128, offset: 192)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1021, line: 31, size: 128, elements: !1022)
!1021 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1022 = !{!1023, !1026, !1027}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1020, file: !1021, line: 32, baseType: !1024, size: 64)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !742)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1020, file: !1021, line: 33, baseType: !7, size: 32, offset: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1020, file: !1021, line: 34, baseType: !7, size: 32, offset: 96)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !915, file: !371, line: 3381, baseType: !1029, size: 384)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !371, line: 2507, size: 384, elements: !1030)
!1030 = !{!1031, !1032, !1037, !1038, !1039}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1029, file: !371, line: 2508, baseType: !951, size: 192)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1029, file: !371, line: 2509, baseType: !1033, size: 32, offset: 192)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1034, line: 58, baseType: !1035)
!1034 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1036, line: 44, baseType: !7)
!1036 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1029, file: !371, line: 2510, baseType: !7, size: 32, offset: 224)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1029, file: !371, line: 2511, baseType: !913, size: 64, offset: 256)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1029, file: !371, line: 2512, baseType: !913, size: 64, offset: 320)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !915, file: !371, line: 3382, baseType: !1041, size: 896)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !371, line: 2652, size: 896, elements: !1042)
!1042 = !{!1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1041, file: !371, line: 2653, baseType: !1029, size: 384)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1041, file: !371, line: 2654, baseType: !913, size: 64, offset: 384)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1041, file: !371, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1041, file: !371, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1041, file: !371, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1041, file: !371, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1041, file: !371, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1041, file: !371, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1041, file: !371, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1041, file: !371, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1041, file: !371, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1041, file: !371, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1041, file: !371, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1041, file: !371, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1041, file: !371, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1041, file: !371, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1041, file: !371, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1041, file: !371, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1041, file: !371, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1041, file: !371, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1041, file: !371, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1041, file: !371, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1041, file: !371, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1041, file: !371, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1041, file: !371, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1041, file: !371, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1041, file: !371, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1041, file: !371, line: 2703, baseType: !7, size: 32, offset: 512)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1041, file: !371, line: 2705, baseType: !913, size: 64, offset: 576)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1041, file: !371, line: 2706, baseType: !913, size: 64, offset: 640)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1041, file: !371, line: 2707, baseType: !913, size: 64, offset: 704)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1041, file: !371, line: 2708, baseType: !913, size: 64, offset: 768)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1041, file: !371, line: 2711, baseType: !1076, size: 64, offset: 832)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !371, line: 2711, flags: DIFlagFwdDecl)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !915, file: !371, line: 3383, baseType: !1079, size: 960)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !371, line: 2756, size: 960, elements: !1080)
!1080 = !{!1081, !1082}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1079, file: !371, line: 2757, baseType: !1041, size: 896)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1079, file: !371, line: 2758, baseType: !800, size: 64, offset: 896)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !915, file: !371, line: 3384, baseType: !1084, size: 1472)
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !371, line: 3114, size: 1472, elements: !1085)
!1085 = !{!1086, !1107, !1108, !1109, !1110}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1084, file: !371, line: 3115, baseType: !1087, size: 1216)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !371, line: 2984, size: 1216, elements: !1088)
!1088 = !{!1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1087, file: !371, line: 2985, baseType: !1079, size: 960)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1087, file: !371, line: 2986, baseType: !913, size: 64, offset: 960)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1087, file: !371, line: 2987, baseType: !913, size: 64, offset: 1024)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1087, file: !371, line: 2988, baseType: !913, size: 64, offset: 1088)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1087, file: !371, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1087, file: !371, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1087, file: !371, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1087, file: !371, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1087, file: !371, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1087, file: !371, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1087, file: !371, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1087, file: !371, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1087, file: !371, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1087, file: !371, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1087, file: !371, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1087, file: !371, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1087, file: !371, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1087, file: !371, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1084, file: !371, line: 3117, baseType: !913, size: 64, offset: 1216)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1084, file: !371, line: 3119, baseType: !913, size: 64, offset: 1280)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1084, file: !371, line: 3121, baseType: !913, size: 64, offset: 1344)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1084, file: !371, line: 3123, baseType: !913, size: 64, offset: 1408)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !915, file: !371, line: 3385, baseType: !1112, size: 1088)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !371, line: 2874, size: 1088, elements: !1113)
!1113 = !{!1114, !1115, !1116}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1112, file: !371, line: 2875, baseType: !1079, size: 960)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1112, file: !371, line: 2876, baseType: !800, size: 64, offset: 960)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1112, file: !371, line: 2877, baseType: !1117, size: 64, offset: 1024)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !371, line: 2856, flags: DIFlagFwdDecl)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !915, file: !371, line: 3386, baseType: !1087, size: 1216)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !915, file: !371, line: 3387, baseType: !1121, size: 1280)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !371, line: 3093, size: 1280, elements: !1122)
!1122 = !{!1123, !1124}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1121, file: !371, line: 3094, baseType: !1087, size: 1216)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1121, file: !371, line: 3095, baseType: !1117, size: 64, offset: 1216)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !915, file: !371, line: 3388, baseType: !1126, size: 1216)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !371, line: 2824, size: 1216, elements: !1127)
!1127 = !{!1128, !1129, !1130, !1131, !1132, !1133}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1126, file: !371, line: 2825, baseType: !1041, size: 896)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1126, file: !371, line: 2827, baseType: !913, size: 64, offset: 896)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1126, file: !371, line: 2828, baseType: !913, size: 64, offset: 960)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1126, file: !371, line: 2829, baseType: !913, size: 64, offset: 1024)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1126, file: !371, line: 2830, baseType: !913, size: 64, offset: 1088)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1126, file: !371, line: 2831, baseType: !913, size: 64, offset: 1152)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !915, file: !371, line: 3389, baseType: !1135, size: 1024)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !371, line: 2850, size: 1024, elements: !1136)
!1136 = !{!1137, !1138, !1139}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1135, file: !371, line: 2851, baseType: !1079, size: 960)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1135, file: !371, line: 2852, baseType: !743, size: 32, offset: 960)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1135, file: !371, line: 2853, baseType: !743, size: 32, offset: 992)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !915, file: !371, line: 3390, baseType: !1141, size: 1024)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !371, line: 2857, size: 1024, elements: !1142)
!1142 = !{!1143, !1144}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1141, file: !371, line: 2858, baseType: !1079, size: 960)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1141, file: !371, line: 2859, baseType: !1117, size: 64, offset: 960)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !915, file: !371, line: 3391, baseType: !1146, size: 960)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !371, line: 2862, size: 960, elements: !1147)
!1147 = !{!1148}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1146, file: !371, line: 2863, baseType: !1079, size: 960)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !915, file: !371, line: 3392, baseType: !1150, size: 1472)
!1150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !371, line: 3304, size: 1472, elements: !1151)
!1151 = !{!1152}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1150, file: !371, line: 3305, baseType: !1084, size: 1472)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !915, file: !371, line: 3393, baseType: !1154, size: 1792)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !371, line: 3248, size: 1792, elements: !1155)
!1155 = !{!1156, !1157, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1154, file: !371, line: 3249, baseType: !1084, size: 1472)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1154, file: !371, line: 3251, baseType: !1158, size: 64, offset: 1472)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1160, line: 463, size: 1152, elements: !1161)
!1160 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1161 = !{!1162, !1323, !1353, !1354, !1357, !1360, !1361, !1362, !1363, !1364, !1365, !1389, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1159, file: !1160, line: 464, baseType: !1163, size: 64)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64)
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !349, line: 194, size: 384, elements: !1165)
!1165 = !{!1166, !1215, !1228, !1242, !1291, !1304}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !1164, file: !349, line: 197, baseType: !1167, size: 64)
!1167 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !349, line: 182, baseType: !1168)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64)
!1169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !349, line: 116, size: 704, elements: !1170)
!1170 = !{!1171, !1172, !1173, !1174, !1175, !1176, !1203, !1212, !1213, !1214}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !1169, file: !349, line: 119, baseType: !1168, size: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1169, file: !349, line: 122, baseType: !1168, size: 64, offset: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !1169, file: !349, line: 123, baseType: !1168, size: 64, offset: 128)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1169, file: !349, line: 126, baseType: !743, size: 32, offset: 192)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1169, file: !349, line: 129, baseType: !348, size: 32, offset: 224)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1169, file: !349, line: 165, baseType: !1177, size: 192, offset: 256)
!1177 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !349, line: 132, size: 192, elements: !1178)
!1178 = !{!1179, !1192, !1198}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !1177, file: !349, line: 137, baseType: !1180, size: 128)
!1180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !349, line: 133, size: 128, elements: !1181)
!1181 = !{!1182, !1191}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !1180, file: !349, line: 135, baseType: !1183, size: 64)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64)
!1184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !349, line: 93, size: 320, elements: !1185)
!1185 = !{!1186, !1187, !1188, !1189, !1190}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !1184, file: !349, line: 96, baseType: !1183, size: 64)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !1184, file: !349, line: 97, baseType: !1183, size: 64, offset: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1184, file: !349, line: 101, baseType: !913, size: 64, offset: 128)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !1184, file: !349, line: 106, baseType: !913, size: 64, offset: 192)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1184, file: !349, line: 111, baseType: !913, size: 64, offset: 256)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !1180, file: !349, line: 136, baseType: !1183, size: 64, offset: 64)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !1177, file: !349, line: 151, baseType: !1193, size: 192)
!1193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !349, line: 139, size: 192, elements: !1194)
!1194 = !{!1195, !1196, !1197}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1193, file: !349, line: 141, baseType: !913, size: 64)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1193, file: !349, line: 145, baseType: !913, size: 64, offset: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1193, file: !349, line: 150, baseType: !743, size: 32, offset: 128)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !1177, file: !349, line: 164, baseType: !1199, size: 128)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !349, line: 153, size: 128, elements: !1200)
!1200 = !{!1201, !1202}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !1199, file: !349, line: 161, baseType: !913, size: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !1199, file: !349, line: 163, baseType: !1033, size: 32, offset: 64)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !1169, file: !349, line: 168, baseType: !1204, size: 64, offset: 448)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64)
!1205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !349, line: 67, size: 320, elements: !1206)
!1206 = !{!1207, !1208, !1209, !1210, !1211}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !1205, file: !349, line: 70, baseType: !1204, size: 64)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1205, file: !349, line: 73, baseType: !1168, size: 64, offset: 64)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !1205, file: !349, line: 78, baseType: !913, size: 64, offset: 128)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !1205, file: !349, line: 85, baseType: !800, size: 64, offset: 192)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1205, file: !349, line: 88, baseType: !743, size: 32, offset: 256)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !1169, file: !349, line: 173, baseType: !800, size: 64, offset: 512)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !1169, file: !349, line: 173, baseType: !800, size: 64, offset: 576)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !1169, file: !349, line: 177, baseType: !742, size: 8, offset: 640)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !1164, file: !349, line: 200, baseType: !1216, size: 64, offset: 64)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !349, line: 185, baseType: !1218)
!1218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !349, line: 185, size: 128, elements: !1219)
!1219 = !{!1220}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1218, file: !349, line: 185, baseType: !1221, size: 128)
!1221 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !349, line: 184, baseType: !1222)
!1222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !349, line: 184, size: 128, elements: !1223)
!1223 = !{!1224, !1225, !1226}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1222, file: !349, line: 184, baseType: !7, size: 32)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1222, file: !349, line: 184, baseType: !7, size: 32, offset: 32)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1222, file: !349, line: 184, baseType: !1227, size: 64, offset: 64)
!1227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1167, size: 64, elements: !834)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !1164, file: !349, line: 203, baseType: !1229, size: 64, offset: 128)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64)
!1230 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !349, line: 189, baseType: !1231)
!1231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !349, line: 189, size: 128, elements: !1232)
!1232 = !{!1233}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1231, file: !349, line: 189, baseType: !1234, size: 128)
!1234 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !349, line: 188, baseType: !1235)
!1235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !349, line: 188, size: 128, elements: !1236)
!1236 = !{!1237, !1238, !1239}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1235, file: !349, line: 188, baseType: !7, size: 32)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1235, file: !349, line: 188, baseType: !7, size: 32, offset: 32)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1235, file: !349, line: 188, baseType: !1240, size: 64, offset: 64)
!1240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1241, size: 64, elements: !834)
!1241 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !349, line: 180, baseType: !1204)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !1164, file: !349, line: 207, baseType: !1243, size: 64, offset: 192)
!1243 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1244, line: 144, baseType: !1245)
!1244 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64)
!1246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1244, line: 100, size: 896, elements: !1247)
!1247 = !{!1248, !1256, !1261, !1263, !1265, !1268, !1269, !1270, !1271, !1272, !1277, !1279, !1280, !1285, !1290}
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1246, file: !1244, line: 102, baseType: !1249, size: 64)
!1249 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1244, line: 52, baseType: !1250)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64)
!1251 = !DISubroutineType(types: !1252)
!1252 = !{!1253, !1254}
!1253 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1244, line: 47, baseType: !7)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64)
!1255 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1246, file: !1244, line: 105, baseType: !1257, size: 64, offset: 64)
!1257 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1244, line: 59, baseType: !1258)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64)
!1259 = !DISubroutineType(types: !1260)
!1260 = !{!743, !1254, !1254}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1246, file: !1244, line: 108, baseType: !1262, size: 64, offset: 128)
!1262 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1244, line: 63, baseType: !754)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1246, file: !1244, line: 111, baseType: !1264, size: 64, offset: 192)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1246, file: !1244, line: 114, baseType: !1266, size: 64, offset: 256)
!1266 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1267, line: 46, baseType: !759)
!1267 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1246, file: !1244, line: 117, baseType: !1266, size: 64, offset: 320)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1246, file: !1244, line: 120, baseType: !1266, size: 64, offset: 384)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1246, file: !1244, line: 124, baseType: !7, size: 32, offset: 448)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1246, file: !1244, line: 128, baseType: !7, size: 32, offset: 480)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1246, file: !1244, line: 131, baseType: !1273, size: 64, offset: 512)
!1273 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1244, line: 75, baseType: !1274)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64)
!1275 = !DISubroutineType(types: !1276)
!1276 = !{!747, !1266, !1266}
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1246, file: !1244, line: 132, baseType: !1278, size: 64, offset: 576)
!1278 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1244, line: 78, baseType: !754)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1246, file: !1244, line: 135, baseType: !747, size: 64, offset: 640)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1246, file: !1244, line: 136, baseType: !1281, size: 64, offset: 704)
!1281 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1244, line: 82, baseType: !1282)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64)
!1283 = !DISubroutineType(types: !1284)
!1284 = !{!747, !747, !1266, !1266}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1246, file: !1244, line: 137, baseType: !1286, size: 64, offset: 768)
!1286 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1244, line: 83, baseType: !1287)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64)
!1288 = !DISubroutineType(types: !1289)
!1289 = !{null, !747, !747}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1246, file: !1244, line: 141, baseType: !7, size: 32, offset: 832)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !1164, file: !349, line: 211, baseType: !1292, size: 64, offset: 256)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64)
!1293 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !371, line: 183, baseType: !1294)
!1294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !371, line: 183, size: 128, elements: !1295)
!1295 = !{!1296}
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1294, file: !371, line: 183, baseType: !1297, size: 128)
!1297 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !371, line: 182, baseType: !1298)
!1298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !371, line: 182, size: 128, elements: !1299)
!1299 = !{!1300, !1301, !1302}
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1298, file: !371, line: 182, baseType: !7, size: 32)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1298, file: !371, line: 182, baseType: !7, size: 32, offset: 32)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1298, file: !371, line: 182, baseType: !1303, size: 64, offset: 64)
!1303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !913, size: 64, elements: !834)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !1164, file: !349, line: 220, baseType: !1305, size: 64, offset: 320)
!1305 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !349, line: 217, size: 64, elements: !1306)
!1306 = !{!1307, !1308}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !1305, file: !349, line: 218, baseType: !1292, size: 64)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !1305, file: !349, line: 219, baseType: !1309, size: 64)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64)
!1310 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !1311, line: 29, baseType: !1312)
!1311 = !DIFile(filename: "./vecprim.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !1311, line: 29, size: 96, elements: !1313)
!1313 = !{!1314}
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1312, file: !1311, line: 29, baseType: !1315, size: 96)
!1315 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !1311, line: 27, baseType: !1316)
!1316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !1311, line: 27, size: 96, elements: !1317)
!1317 = !{!1318, !1319, !1320}
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1316, file: !1311, line: 27, baseType: !7, size: 32)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1316, file: !1311, line: 27, baseType: !7, size: 32, offset: 32)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1316, file: !1311, line: 27, baseType: !1321, size: 8, offset: 64)
!1321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1322, size: 8, elements: !834)
!1322 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !1311, line: 26, baseType: !742)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1159, file: !1160, line: 467, baseType: !1324, size: 64, offset: 64)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64)
!1325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !356, line: 374, size: 640, elements: !1326)
!1326 = !{!1327, !1328, !1329, !1342, !1343, !1344, !1345, !1346, !1347, !1349, !1351, !1352}
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1325, file: !356, line: 377, baseType: !768, size: 64)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1325, file: !356, line: 378, baseType: !768, size: 64, offset: 64)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1325, file: !356, line: 381, baseType: !1330, size: 64, offset: 128)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64)
!1331 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !356, line: 282, baseType: !1332)
!1332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !356, line: 282, size: 128, elements: !1333)
!1333 = !{!1334}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1332, file: !356, line: 282, baseType: !1335, size: 128)
!1335 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !356, line: 281, baseType: !1336)
!1336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !356, line: 281, size: 128, elements: !1337)
!1337 = !{!1338, !1339, !1340}
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1336, file: !356, line: 281, baseType: !7, size: 32)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1336, file: !356, line: 281, baseType: !7, size: 32, offset: 32)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1336, file: !356, line: 281, baseType: !1341, size: 64, offset: 64)
!1341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !768, size: 64, elements: !834)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1325, file: !356, line: 384, baseType: !743, size: 32, offset: 192)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1325, file: !356, line: 387, baseType: !743, size: 32, offset: 224)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1325, file: !356, line: 390, baseType: !743, size: 32, offset: 256)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1325, file: !356, line: 394, baseType: !1330, size: 64, offset: 320)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1325, file: !356, line: 396, baseType: !355, size: 32, offset: 384)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1325, file: !356, line: 399, baseType: !1348, size: 64, offset: 416)
!1348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 64, elements: !869)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1325, file: !356, line: 402, baseType: !1350, size: 64, offset: 480)
!1350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !869)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1325, file: !356, line: 406, baseType: !743, size: 32, offset: 544)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1325, file: !356, line: 409, baseType: !743, size: 32, offset: 576)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1159, file: !1160, line: 470, baseType: !797, size: 64, offset: 128)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1159, file: !1160, line: 473, baseType: !1355, size: 64, offset: 192)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64)
!1356 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1160, line: 166, flags: DIFlagFwdDecl)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1159, file: !1160, line: 476, baseType: !1358, size: 64, offset: 256)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64)
!1359 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1160, line: 476, flags: DIFlagFwdDecl)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1159, file: !1160, line: 479, baseType: !1243, size: 64, offset: 320)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1159, file: !1160, line: 484, baseType: !913, size: 64, offset: 384)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1159, file: !1160, line: 488, baseType: !913, size: 64, offset: 448)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1159, file: !1160, line: 493, baseType: !913, size: 64, offset: 512)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1159, file: !1160, line: 496, baseType: !913, size: 64, offset: 576)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1159, file: !1160, line: 501, baseType: !1366, size: 64, offset: 640)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64)
!1367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !190, line: 2355, size: 576, elements: !1368)
!1368 = !{!1369, !1372, !1373, !1374, !1375, !1377, !1378, !1383, !1384, !1385, !1386, !1387, !1388}
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1367, file: !190, line: 2356, baseType: !1370, size: 64)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64)
!1371 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !190, line: 2356, flags: DIFlagFwdDecl)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1367, file: !190, line: 2357, baseType: !748, size: 64, offset: 64)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1367, file: !190, line: 2358, baseType: !743, size: 32, offset: 128)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1367, file: !190, line: 2359, baseType: !743, size: 32, offset: 160)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1367, file: !190, line: 2360, baseType: !1376, size: 128, offset: 192)
!1376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !743, size: 128, elements: !893)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1367, file: !190, line: 2364, baseType: !743, size: 32, offset: 320)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1367, file: !190, line: 2367, baseType: !1379, size: 128, offset: 384)
!1379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !190, line: 2349, size: 128, elements: !1380)
!1380 = !{!1381, !1382}
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1379, file: !190, line: 2351, baseType: !800, size: 64)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1379, file: !190, line: 2352, baseType: !753, size: 64, offset: 64)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1367, file: !190, line: 2371, baseType: !366, size: 32, offset: 512)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1367, file: !190, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1367, file: !190, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1367, file: !190, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1367, file: !190, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1367, file: !190, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1159, file: !1160, line: 504, baseType: !1390, size: 64, offset: 704)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64)
!1391 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1160, line: 504, flags: DIFlagFwdDecl)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1159, file: !1160, line: 507, baseType: !1243, size: 64, offset: 768)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1159, file: !1160, line: 510, baseType: !743, size: 32, offset: 832)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1159, file: !1160, line: 513, baseType: !743, size: 32, offset: 864)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1159, file: !1160, line: 516, baseType: !1033, size: 32, offset: 896)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1159, file: !1160, line: 519, baseType: !1033, size: 32, offset: 928)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1159, file: !1160, line: 522, baseType: !7, size: 32, offset: 960)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1159, file: !1160, line: 523, baseType: !7, size: 32, offset: 992)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1159, file: !1160, line: 528, baseType: !748, size: 64, offset: 1024)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1159, file: !1160, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1159, file: !1160, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1159, file: !1160, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1159, file: !1160, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1159, file: !1160, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1159, file: !1160, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1159, file: !1160, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1159, file: !1160, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1159, file: !1160, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1159, file: !1160, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1159, file: !1160, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1159, file: !1160, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1159, file: !1160, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1159, file: !1160, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1159, file: !1160, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1159, file: !1160, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1154, file: !371, line: 3254, baseType: !913, size: 64, offset: 1536)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1154, file: !371, line: 3257, baseType: !913, size: 64, offset: 1600)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1154, file: !371, line: 3258, baseType: !913, size: 64, offset: 1664)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1154, file: !371, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1154, file: !371, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1154, file: !371, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1154, file: !371, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1154, file: !371, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1154, file: !371, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1154, file: !371, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1154, file: !371, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1154, file: !371, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1154, file: !371, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1154, file: !371, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1154, file: !371, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1154, file: !371, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1154, file: !371, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1154, file: !371, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1154, file: !371, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1154, file: !371, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1154, file: !371, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !915, file: !371, line: 3394, baseType: !1438, size: 1344)
!1438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !371, line: 2279, size: 1344, elements: !1439)
!1439 = !{!1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1465, !1466, !1467, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483}
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1438, file: !371, line: 2280, baseType: !951, size: 192)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1438, file: !371, line: 2281, baseType: !913, size: 64, offset: 192)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1438, file: !371, line: 2282, baseType: !913, size: 64, offset: 256)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1438, file: !371, line: 2283, baseType: !913, size: 64, offset: 320)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1438, file: !371, line: 2284, baseType: !913, size: 64, offset: 384)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1438, file: !371, line: 2285, baseType: !7, size: 32, offset: 448)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1438, file: !371, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1438, file: !371, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1438, file: !371, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1438, file: !371, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1438, file: !371, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1438, file: !371, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1438, file: !371, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1438, file: !371, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1438, file: !371, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1438, file: !371, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1438, file: !371, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1438, file: !371, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1438, file: !371, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1438, file: !371, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1438, file: !371, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1438, file: !371, line: 2305, baseType: !7, size: 32, offset: 512)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1438, file: !371, line: 2306, baseType: !1463, size: 32, offset: 544)
!1463 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1464, line: 31, baseType: !743)
!1464 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1438, file: !371, line: 2307, baseType: !913, size: 64, offset: 576)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1438, file: !371, line: 2308, baseType: !913, size: 64, offset: 640)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1438, file: !371, line: 2314, baseType: !1468, size: 64, offset: 704)
!1468 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !371, line: 2309, size: 64, elements: !1469)
!1469 = !{!1470, !1471, !1472}
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1468, file: !371, line: 2310, baseType: !743, size: 32)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1468, file: !371, line: 2311, baseType: !748, size: 64)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1468, file: !371, line: 2312, baseType: !1473, size: 64)
!1473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1474, size: 64)
!1474 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !371, line: 2277, flags: DIFlagFwdDecl)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1438, file: !371, line: 2315, baseType: !913, size: 64, offset: 768)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1438, file: !371, line: 2316, baseType: !913, size: 64, offset: 832)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1438, file: !371, line: 2317, baseType: !913, size: 64, offset: 896)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1438, file: !371, line: 2318, baseType: !913, size: 64, offset: 960)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1438, file: !371, line: 2319, baseType: !913, size: 64, offset: 1024)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1438, file: !371, line: 2320, baseType: !913, size: 64, offset: 1088)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1438, file: !371, line: 2321, baseType: !913, size: 64, offset: 1152)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1438, file: !371, line: 2322, baseType: !913, size: 64, offset: 1216)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1438, file: !371, line: 2324, baseType: !1484, size: 64, offset: 1280)
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1485, size: 64)
!1485 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !371, line: 2324, flags: DIFlagFwdDecl)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !915, file: !371, line: 3395, baseType: !1487, size: 320)
!1487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !371, line: 1469, size: 320, elements: !1488)
!1488 = !{!1489, !1490, !1491}
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1487, file: !371, line: 1470, baseType: !951, size: 192)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1487, file: !371, line: 1471, baseType: !913, size: 64, offset: 192)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1487, file: !371, line: 1472, baseType: !913, size: 64, offset: 256)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !915, file: !371, line: 3396, baseType: !1493, size: 320)
!1493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !371, line: 1482, size: 320, elements: !1494)
!1494 = !{!1495, !1496, !1497}
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1493, file: !371, line: 1483, baseType: !951, size: 192)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1493, file: !371, line: 1484, baseType: !743, size: 32, offset: 192)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1493, file: !371, line: 1485, baseType: !1303, size: 64, offset: 256)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !915, file: !371, line: 3397, baseType: !1499, size: 384)
!1499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !371, line: 1829, size: 384, elements: !1500)
!1500 = !{!1501, !1502, !1503, !1504}
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1499, file: !371, line: 1830, baseType: !951, size: 192)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1499, file: !371, line: 1831, baseType: !1033, size: 32, offset: 192)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1499, file: !371, line: 1832, baseType: !913, size: 64, offset: 256)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1499, file: !371, line: 1835, baseType: !1303, size: 64, offset: 320)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !915, file: !371, line: 3398, baseType: !1506, size: 704)
