; ModuleID = 'builtins.bc'
source_filename = "builtins.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

!2812 = !DIEnumerator(name: "GIMPLE_BIND", value: 10, isUnsigned: true)
!2813 = !DIEnumerator(name: "GIMPLE_CATCH", value: 11, isUnsigned: true)
!2814 = !DIEnumerator(name: "GIMPLE_EH_FILTER", value: 12, isUnsigned: true)
!2815 = !DIEnumerator(name: "GIMPLE_EH_MUST_NOT_THROW", value: 13, isUnsigned: true)
!2816 = !DIEnumerator(name: "GIMPLE_RESX", value: 14, isUnsigned: true)
!2817 = !DIEnumerator(name: "GIMPLE_EH_DISPATCH", value: 15, isUnsigned: true)
!2818 = !DIEnumerator(name: "GIMPLE_PHI", value: 16, isUnsigned: true)
!2819 = !DIEnumerator(name: "GIMPLE_TRY", value: 17, isUnsigned: true)
!2820 = !DIEnumerator(name: "GIMPLE_NOP", value: 18, isUnsigned: true)
!2821 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!2822 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!2823 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!2824 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!2825 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!2826 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!2827 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!2828 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!2829 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!2830 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!2831 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!2832 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!2833 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!2834 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!2835 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!2836 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!2837 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!2838 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !1248, line: 727, baseType: !7, size: 32, elements: !2839)
!2839 = !{!2840, !2841, !2842, !2843, !2844, !2845, !2846, !2847, !2848, !2849, !2850, !2851, !2852, !2853, !2854, !2855, !2856, !2857, !2858, !2859, !2860, !2861, !2862, !2863}
!2840 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!2841 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!2842 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!2843 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!2844 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!2845 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!2846 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!2847 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!2848 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!2849 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!2850 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!2851 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!2852 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!2853 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!2854 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!2855 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!2856 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!2857 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!2858 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!2859 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!2860 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!2861 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!2862 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!2863 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!2864 = !{!2865, !2866, !1249, !2867, !2870, !2871, !134, !7, !2873, !4297, !3000, !2914, !3048, !4299, !384, !2927, !2868, !3231, !1255, !5, !2929, !3197, !4300}
!2865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2866, size: 64)
!2866 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!2867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2868, size: 64)
!2868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2869, size: 64)
!2869 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!2870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!2871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2872, size: 64)
!2872 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !2869)
!2873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2874, size: 64)
!2874 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !135, line: 3371, size: 1792, elements: !2875)
!2875 = !{!2876, !2909, !2917, !2930, !2949, !2960, !2965, !2974, !2980, !2993, !3005, !3043, !3534, !3562, !3579, !3580, !3585, !3594, !3600, !3605, !3609, !3613, !3948, !3995, !4001, !4007, !4014, !4027, !4041, !4058, !4070, !4092, !4107, !4279}
!2876 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2874, file: !135, line: 3372, baseType: !2877, size: 64)
!2877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !135, line: 360, size: 64, elements: !2878)
!2878 = !{!2879, !2880, !2881, !2882, !2883, !2884, !2885, !2886, !2887, !2888, !2889, !2890, !2891, !2892, !2893, !2894, !2895, !2896, !2897, !2898, !2899, !2900, !2901, !2902, !2903, !2904, !2905, !2906, !2907, !2908}
!2879 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !2877, file: !135, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!2880 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !2877, file: !135, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!2881 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !2877, file: !135, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!2882 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !2877, file: !135, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!2883 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !2877, file: !135, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!2884 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !2877, file: !135, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!2885 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !2877, file: !135, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!2886 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !2877, file: !135, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!2887 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !2877, file: !135, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!2888 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !2877, file: !135, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!2889 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !2877, file: !135, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!2890 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !2877, file: !135, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!2891 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !2877, file: !135, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!2892 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !2877, file: !135, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!2893 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !2877, file: !135, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!2894 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !2877, file: !135, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!2895 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !2877, file: !135, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!2896 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !2877, file: !135, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!2897 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !2877, file: !135, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!2898 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !2877, file: !135, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!2899 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !2877, file: !135, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!2900 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !2877, file: !135, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!2901 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !2877, file: !135, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!2902 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !2877, file: !135, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!2903 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !2877, file: !135, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!2904 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !2877, file: !135, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!2905 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !2877, file: !135, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!2906 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !2877, file: !135, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!2907 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !2877, file: !135, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!2908 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !2877, file: !135, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!2909 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2874, file: !135, line: 3373, baseType: !2910, size: 192)
!2910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !135, line: 402, size: 192, elements: !2911)
!2911 = !{!2912, !2913, !2916}
!2912 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2910, file: !135, line: 403, baseType: !2877, size: 64)
!2913 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !2910, file: !135, line: 404, baseType: !2914, size: 64, offset: 64)
!2914 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !2915, line: 56, baseType: !2873)
!2915 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2916 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !2910, file: !135, line: 405, baseType: !2914, size: 64, offset: 128)
!2917 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !2874, file: !135, line: 3374, baseType: !2918, size: 320)
!2918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !135, line: 1384, size: 320, elements: !2919)
!2919 = !{!2920, !2921}
!2920 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2918, file: !135, line: 1385, baseType: !2910, size: 192)
!2921 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !2918, file: !135, line: 1386, baseType: !2922, size: 128, offset: 192)
!2922 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !2923, line: 58, baseType: !2924)
!2923 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2924 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2923, line: 54, size: 128, elements: !2925)
!2925 = !{!2926, !2928}
!2926 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !2924, file: !2923, line: 56, baseType: !2927, size: 64)
!2927 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!2928 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !2924, file: !2923, line: 57, baseType: !2929, size: 64, offset: 64)
!2929 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!2930 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !2874, file: !135, line: 3375, baseType: !2931, size: 256)
!2931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !135, line: 1397, size: 256, elements: !2932)
!2932 = !{!2933, !2934}
!2933 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2931, file: !135, line: 1398, baseType: !2910, size: 192)
!2934 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !2931, file: !135, line: 1399, baseType: !2935, size: 64, offset: 192)
!2935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2936, size: 64)
!2936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !2937, line: 52, size: 256, elements: !2938)
!2937 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2938 = !{!2939, !2940, !2941, !2942, !2943, !2944, !2945}
!2939 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !2936, file: !2937, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!2940 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !2936, file: !2937, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!2941 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !2936, file: !2937, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!2942 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !2936, file: !2937, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!2943 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !2936, file: !2937, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!2944 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !2936, file: !2937, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!2945 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !2936, file: !2937, line: 62, baseType: !2946, size: 192, offset: 64)
!2946 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2927, size: 192, elements: !2947)
!2947 = !{!2948}
!2948 = !DISubrange(count: 3)
!2949 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !2874, file: !135, line: 3376, baseType: !2950, size: 256)
!2950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !135, line: 1408, size: 256, elements: !2951)
!2951 = !{!2952, !2953}
!2952 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2950, file: !135, line: 1409, baseType: !2910, size: 192)
!2953 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !2950, file: !135, line: 1410, baseType: !2954, size: 64, offset: 192)
!2954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2955, size: 64)
!2955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !2956, line: 27, size: 192, elements: !2957)
!2956 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2957 = !{!2958, !2959}
!2958 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !2955, file: !2956, line: 29, baseType: !2922, size: 128)
!2959 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !2955, file: !2956, line: 30, baseType: !5, size: 32, offset: 128)
!2960 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !2874, file: !135, line: 3377, baseType: !2961, size: 256)
!2961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !135, line: 1437, size: 256, elements: !2962)
!2962 = !{!2963, !2964}
!2963 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2961, file: !135, line: 1438, baseType: !2910, size: 192)
!2964 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !2961, file: !135, line: 1439, baseType: !2914, size: 64, offset: 192)
!2965 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !2874, file: !135, line: 3378, baseType: !2966, size: 256)
!2966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !135, line: 1418, size: 256, elements: !2967)
!2967 = !{!2968, !2969, !2970}
!2968 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2966, file: !135, line: 1419, baseType: !2910, size: 192)
!2969 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !2966, file: !135, line: 1420, baseType: !1249, size: 32, offset: 192)
!2970 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !2966, file: !135, line: 1421, baseType: !2971, size: 8, offset: 224)
!2971 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2869, size: 8, elements: !2972)
!2972 = !{!2973}
!2973 = !DISubrange(count: 1)
!2974 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !2874, file: !135, line: 3379, baseType: !2975, size: 320)
!2975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !135, line: 1428, size: 320, elements: !2976)
!2976 = !{!2977, !2978, !2979}
!2977 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2975, file: !135, line: 1429, baseType: !2910, size: 192)
!2978 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !2975, file: !135, line: 1430, baseType: !2914, size: 64, offset: 192)
!2979 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !2975, file: !135, line: 1431, baseType: !2914, size: 64, offset: 256)
!2980 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !2874, file: !135, line: 3380, baseType: !2981, size: 320)
!2981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !135, line: 1460, size: 320, elements: !2982)
!2982 = !{!2983, !2984}
!2983 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2981, file: !135, line: 1461, baseType: !2910, size: 192)
!2984 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !2981, file: !135, line: 1462, baseType: !2985, size: 128, offset: 192)
!2985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !2986, line: 31, size: 128, elements: !2987)
!2986 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2987 = !{!2988, !2991, !2992}
!2988 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !2985, file: !2986, line: 32, baseType: !2989, size: 64)
!2989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2990, size: 64)
!2990 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !2866)
!2991 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !2985, file: !2986, line: 33, baseType: !7, size: 32, offset: 64)
!2992 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !2985, file: !2986, line: 34, baseType: !7, size: 32, offset: 96)
!2993 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !2874, file: !135, line: 3381, baseType: !2994, size: 384)
!2994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !135, line: 2507, size: 384, elements: !2995)
!2995 = !{!2996, !2997, !3002, !3003, !3004}
!2996 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2994, file: !135, line: 2508, baseType: !2910, size: 192)
!2997 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !2994, file: !135, line: 2509, baseType: !2998, size: 32, offset: 192)
!2998 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !2999, line: 58, baseType: !3000)
!2999 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!3000 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !3001, line: 44, baseType: !7)
!3001 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!3002 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !2994, file: !135, line: 2510, baseType: !7, size: 32, offset: 224)
!3003 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2994, file: !135, line: 2511, baseType: !2914, size: 64, offset: 256)
!3004 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !2994, file: !135, line: 2512, baseType: !2914, size: 64, offset: 320)
!3005 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !2874, file: !135, line: 3382, baseType: !3006, size: 896)
!3006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !135, line: 2652, size: 896, elements: !3007)
!3007 = !{!3008, !3009, !3010, !3011, !3012, !3013, !3014, !3015, !3016, !3017, !3018, !3019, !3020, !3021, !3022, !3023, !3024, !3025, !3026, !3027, !3028, !3029, !3030, !3031, !3032, !3033, !3034, !3035, !3036, !3037, !3038, !3039, !3040}
!3008 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3006, file: !135, line: 2653, baseType: !2994, size: 384)
!3009 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3006, file: !135, line: 2654, baseType: !2914, size: 64, offset: 384)
!3010 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !3006, file: !135, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!3011 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !3006, file: !135, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!3012 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !3006, file: !135, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!3013 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !3006, file: !135, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!3014 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !3006, file: !135, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!3015 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !3006, file: !135, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!3016 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !3006, file: !135, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!3017 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !3006, file: !135, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!3018 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !3006, file: !135, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!3019 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !3006, file: !135, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!3020 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !3006, file: !135, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!3021 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !3006, file: !135, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!3022 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !3006, file: !135, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!3023 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !3006, file: !135, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!3024 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !3006, file: !135, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!3025 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !3006, file: !135, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!3026 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !3006, file: !135, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!3027 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !3006, file: !135, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!3028 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !3006, file: !135, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!3029 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !3006, file: !135, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!3030 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !3006, file: !135, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!3031 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !3006, file: !135, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!3032 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !3006, file: !135, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!3033 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !3006, file: !135, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!3034 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !3006, file: !135, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!3035 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3006, file: !135, line: 2703, baseType: !7, size: 32, offset: 512)
!3036 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !3006, file: !135, line: 2705, baseType: !2914, size: 64, offset: 576)
!3037 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !3006, file: !135, line: 2706, baseType: !2914, size: 64, offset: 640)
!3038 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !3006, file: !135, line: 2707, baseType: !2914, size: 64, offset: 704)
!3039 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !3006, file: !135, line: 2708, baseType: !2914, size: 64, offset: 768)
!3040 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !3006, file: !135, line: 2711, baseType: !3041, size: 64, offset: 832)
!3041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3042, size: 64)
!3042 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !135, line: 2711, flags: DIFlagFwdDecl)
!3043 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !2874, file: !135, line: 3383, baseType: !3044, size: 960)
!3044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !135, line: 2756, size: 960, elements: !3045)
!3045 = !{!3046, !3047}
!3046 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3044, file: !135, line: 2757, baseType: !3006, size: 896)
!3047 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !3044, file: !135, line: 2758, baseType: !3048, size: 64, offset: 896)
!3048 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !2915, line: 50, baseType: !3049)
!3049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3050, size: 64)
!3050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !385, line: 240, size: 384, elements: !3051)
!3051 = !{!3052, !3053, !3054, !3055, !3056, !3057, !3058, !3059, !3060, !3061, !3062}
!3052 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !3050, file: !385, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!3053 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !3050, file: !385, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!3054 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !3050, file: !385, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!3055 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !3050, file: !385, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!3056 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !3050, file: !385, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!3057 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !3050, file: !385, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!3058 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !3050, file: !385, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!3059 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !3050, file: !385, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!3060 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !3050, file: !385, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!3061 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !3050, file: !385, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!3062 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !3050, file: !385, line: 321, baseType: !3063, size: 320, offset: 64)
!3063 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !385, line: 315, size: 320, elements: !3064)
!3064 = !{!3065, !3467, !3469, !3532, !3533}
!3065 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !3063, file: !385, line: 316, baseType: !3066, size: 64)
!3066 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3067, size: 64, elements: !2972)
!3067 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !385, line: 183, baseType: !3068)
!3068 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !385, line: 166, size: 64, elements: !3069)
!3069 = !{!3070, !3071, !3072, !3073, !3074, !3082, !3083, !3095, !3098, !3158, !3159, !3444, !3457, !3464}
!3070 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !3068, file: !385, line: 168, baseType: !1249, size: 32)
!3071 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !3068, file: !385, line: 169, baseType: !7, size: 32)
!3072 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !3068, file: !385, line: 170, baseType: !2871, size: 64)
!3073 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !3068, file: !385, line: 171, baseType: !3048, size: 64)
!3074 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !3068, file: !385, line: 172, baseType: !3075, size: 64)
!3075 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !2915, line: 53, baseType: !3076)
!3076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3077, size: 64)
!3077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !385, line: 359, size: 128, elements: !3078)
!3078 = !{!3079, !3080}
!3079 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !3077, file: !385, line: 360, baseType: !1249, size: 32)
!3080 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !3077, file: !385, line: 361, baseType: !3081, size: 64, offset: 64)
!3081 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3048, size: 64, elements: !2972)
!3082 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !3068, file: !385, line: 173, baseType: !5, size: 32)
!3083 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !3068, file: !385, line: 174, baseType: !3084, size: 32)
!3084 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !385, line: 133, baseType: !3085)
!3085 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !385, line: 115, size: 32, elements: !3086)
!3086 = !{!3087, !3088, !3089, !3090, !3091, !3092, !3093, !3094}
!3087 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !3085, file: !385, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!3088 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !3085, file: !385, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!3089 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !3085, file: !385, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!3090 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !3085, file: !385, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!3091 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !3085, file: !385, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!3092 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !3085, file: !385, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!3093 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !3085, file: !385, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!3094 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !3085, file: !385, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!3095 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !3068, file: !385, line: 175, baseType: !3096, size: 64)
!3096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3097, size: 64)
!3097 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !385, line: 175, flags: DIFlagFwdDecl)
!3098 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !3068, file: !385, line: 176, baseType: !3099, size: 64)
!3099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3100, size: 64)
!3100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !3101, line: 75, size: 256, elements: !3102)
!3101 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!3102 = !{!3103, !3117, !3118, !3119}
!3103 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !3100, file: !3101, line: 76, baseType: !3104, size: 64)
!3104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3105, size: 64)
!3105 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !3101, line: 68, baseType: !3106)
!3106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !3101, line: 63, size: 320, elements: !3107)
!3107 = !{!3108, !3110, !3111, !3112}
!3108 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !3106, file: !3101, line: 64, baseType: !3109, size: 64)
!3109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3106, size: 64)
!3110 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !3106, file: !3101, line: 65, baseType: !3109, size: 64, offset: 64)
!3111 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !3106, file: !3101, line: 66, baseType: !7, size: 32, offset: 128)
!3112 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !3106, file: !3101, line: 67, baseType: !3113, size: 128, offset: 192)
!3113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3114, size: 128, elements: !3115)
!3114 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !3101, line: 29, baseType: !2927)
!3115 = !{!3116}
!3116 = !DISubrange(count: 2)
!3117 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !3100, file: !3101, line: 77, baseType: !3104, size: 64, offset: 64)
!3118 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !3100, file: !3101, line: 78, baseType: !7, size: 32, offset: 128)
!3119 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !3100, file: !3101, line: 79, baseType: !3120, size: 64, offset: 192)
!3120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3121, size: 64)
!3121 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !3101, line: 49, baseType: !3122)
!3122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !3101, line: 45, size: 832, elements: !3123)
!3123 = !{!3124, !3125, !3126}
!3124 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !3122, file: !3101, line: 46, baseType: !3109, size: 64)
!3125 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !3122, file: !3101, line: 47, baseType: !3099, size: 64, offset: 64)
!3126 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !3122, file: !3101, line: 48, baseType: !3127, size: 704, offset: 128)
!3127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !3128, line: 164, size: 704, elements: !3129)
!3128 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!3129 = !{!3130, !3131, !3141, !3142, !3143, !3144, !3145, !3146, !3150, !3154, !3155, !3156, !3157}
!3130 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !3127, file: !3128, line: 166, baseType: !2929, size: 64)
!3131 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !3127, file: !3128, line: 167, baseType: !3132, size: 64, offset: 64)
!3132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3133, size: 64)
!3133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !3128, line: 157, size: 192, elements: !3134)
!3134 = !{!3135, !3136, !3137}
!3135 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !3133, file: !3128, line: 159, baseType: !2868, size: 64)
!3136 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !3133, file: !3128, line: 160, baseType: !3132, size: 64, offset: 64)
!3137 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !3133, file: !3128, line: 161, baseType: !3138, size: 32, offset: 128)
!3138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2869, size: 32, elements: !3139)
!3139 = !{!3140}
!3140 = !DISubrange(count: 4)
!3141 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !3127, file: !3128, line: 168, baseType: !2868, size: 64, offset: 128)
!3142 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !3127, file: !3128, line: 169, baseType: !2868, size: 64, offset: 192)
!3143 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !3127, file: !3128, line: 170, baseType: !2868, size: 64, offset: 256)
!3144 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !3127, file: !3128, line: 171, baseType: !2929, size: 64, offset: 320)
!3145 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !3127, file: !3128, line: 172, baseType: !1249, size: 32, offset: 384)
!3146 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !3127, file: !3128, line: 176, baseType: !3147, size: 64, offset: 448)
!3147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3148, size: 64)
!3148 = !DISubroutineType(types: !3149)
!3149 = !{!3132, !2870, !2929}
!3150 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !3127, file: !3128, line: 177, baseType: !3151, size: 64, offset: 512)
!3151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3152, size: 64)
!3152 = !DISubroutineType(types: !3153)
!3153 = !{null, !2870, !3132}
!3154 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !3127, file: !3128, line: 178, baseType: !2870, size: 64, offset: 576)
!3155 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !3127, file: !3128, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!3156 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !3127, file: !3128, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!3157 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !3127, file: !3128, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!3158 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !3068, file: !385, line: 177, baseType: !2914, size: 64)
!3159 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !3068, file: !385, line: 178, baseType: !3160, size: 64)
!3160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3161, size: 64)
!3161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !337, line: 217, size: 832, elements: !3162)
!3162 = !{!3163, !3409, !3410, !3411, !3414, !3418, !3419, !3420, !3438, !3439, !3440, !3441, !3442, !3443}
!3163 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !3161, file: !337, line: 219, baseType: !3164, size: 64)
!3164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3165, size: 64)
!3165 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !337, line: 151, baseType: !3166)
!3166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !337, line: 151, size: 128, elements: !3167)
!3167 = !{!3168}
!3168 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !3166, file: !337, line: 151, baseType: !3169, size: 128)
!3169 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !337, line: 150, baseType: !3170)
!3170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !337, line: 150, size: 128, elements: !3171)
!3171 = !{!3172, !3173, !3174}
!3172 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !3170, file: !337, line: 150, baseType: !7, size: 32)
!3173 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !3170, file: !337, line: 150, baseType: !7, size: 32, offset: 32)
!3174 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !3170, file: !337, line: 150, baseType: !3175, size: 64, offset: 64)
!3175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3176, size: 64, elements: !2972)
!3176 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !2915, line: 108, baseType: !3177)
!3177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3178, size: 64)
!3178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !337, line: 122, size: 512, elements: !3179)
!3179 = !{!3180, !3181, !3182, !3401, !3402, !3403, !3404, !3405, !3406, !3407}
!3180 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !3178, file: !337, line: 124, baseType: !3160, size: 64)
!3181 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !3178, file: !337, line: 125, baseType: !3160, size: 64, offset: 64)
!3182 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !3178, file: !337, line: 131, baseType: !3183, size: 64, offset: 128)
!3183 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !337, line: 128, size: 64, elements: !3184)
!3184 = !{!3185, !3400}
!3185 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !3183, file: !337, line: 129, baseType: !3186, size: 64)
!3186 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !2915, line: 66, baseType: !3187)
!3187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3188, size: 64)
!3188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !1248, line: 143, size: 192, elements: !3189)
!3189 = !{!3190, !3398, !3399}
!3190 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !3188, file: !1248, line: 145, baseType: !3191, size: 64)
!3191 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !2915, line: 69, baseType: !3192)
!3192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3193, size: 64)
!3193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !1248, line: 136, size: 192, elements: !3194)
!3194 = !{!3195, !3396, !3397}
!3195 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !3193, file: !1248, line: 137, baseType: !3196, size: 64)
!3196 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !2915, line: 58, baseType: !3197)
!3197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3198, size: 64)
!3198 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !1248, line: 737, size: 768, elements: !3199)
!3199 = !{!3200, !3217, !3251, !3257, !3262, !3267, !3274, !3280, !3286, !3291, !3305, !3310, !3316, !3321, !3331, !3336, !3354, !3361, !3368, !3374, !3379, !3385, !3391}
!3200 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3198, file: !1248, line: 738, baseType: !3201, size: 256)
!3201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !1248, line: 271, size: 256, elements: !3202)
!3202 = !{!3203, !3204, !3205, !3206, !3207, !3208, !3209, !3210, !3211, !3212, !3213, !3214, !3215, !3216}
!3203 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !3201, file: !1248, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!3204 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !3201, file: !1248, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!3205 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !3201, file: !1248, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!3206 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !3201, file: !1248, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!3207 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !3201, file: !1248, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!3208 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !3201, file: !1248, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!3209 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !3201, file: !1248, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!3210 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !3201, file: !1248, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!3211 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !3201, file: !1248, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!3212 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !3201, file: !1248, line: 312, baseType: !7, size: 32, offset: 32)
!3213 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !3201, file: !1248, line: 316, baseType: !2998, size: 32, offset: 64)
!3214 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !3201, file: !1248, line: 319, baseType: !7, size: 32, offset: 96)
!3215 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !3201, file: !1248, line: 323, baseType: !3160, size: 64, offset: 128)
!3216 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !3201, file: !1248, line: 327, baseType: !2914, size: 64, offset: 192)
!3217 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !3198, file: !1248, line: 739, baseType: !3218, size: 448)
!3218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !1248, line: 350, size: 448, elements: !3219)
!3219 = !{!3220, !3249}
!3220 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !3218, file: !1248, line: 353, baseType: !3221, size: 384)
!3221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !1248, line: 333, size: 384, elements: !3222)
!3222 = !{!3223, !3224, !3232}
!3223 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3221, file: !1248, line: 336, baseType: !3201, size: 256)
!3224 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !3221, file: !1248, line: 343, baseType: !3225, size: 64, offset: 256)
!3225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3226, size: 64)
!3226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !3227, line: 37, size: 128, elements: !3228)
!3227 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!3228 = !{!3229, !3230}
!3229 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !3226, file: !3227, line: 39, baseType: !3225, size: 64)
!3230 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !3226, file: !3227, line: 40, baseType: !3231, size: 64, offset: 64)
!3231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2914, size: 64)
!3232 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !3221, file: !1248, line: 344, baseType: !3233, size: 64, offset: 320)
!3233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3234, size: 64)
!3234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !3227, line: 45, size: 320, elements: !3235)
!3235 = !{!3236, !3237}
!3236 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !3234, file: !3227, line: 47, baseType: !3233, size: 64)
!3237 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !3234, file: !3227, line: 48, baseType: !3238, size: 256, offset: 64)
!3238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !135, line: 1883, size: 256, elements: !3239)
!3239 = !{!3240, !3242, !3243, !3248}
!3240 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !3238, file: !135, line: 1884, baseType: !3241, size: 64)
!3241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3238, size: 64)
!3242 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !3238, file: !135, line: 1885, baseType: !3241, size: 64, offset: 64)
!3243 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !3238, file: !135, line: 1891, baseType: !3244, size: 64, offset: 128)
!3244 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !3238, file: !135, line: 1891, size: 64, elements: !3245)
!3245 = !{!3246, !3247}
!3246 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !3244, file: !135, line: 1891, baseType: !3196, size: 64)
!3247 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !3244, file: !135, line: 1891, baseType: !2914, size: 64)
!3248 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !3238, file: !135, line: 1892, baseType: !3231, size: 64, offset: 192)
!3249 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !3218, file: !1248, line: 359, baseType: !3250, size: 64, offset: 384)
!3250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2914, size: 64, elements: !2972)
!3251 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !3198, file: !1248, line: 740, baseType: !3252, size: 512)
!3252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !1248, line: 365, size: 512, elements: !3253)
!3253 = !{!3254, !3255, !3256}
!3254 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !3252, file: !1248, line: 368, baseType: !3221, size: 384)
!3255 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !3252, file: !1248, line: 373, baseType: !2914, size: 64, offset: 384)
!3256 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !3252, file: !1248, line: 374, baseType: !2914, size: 64, offset: 448)
!3257 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !3198, file: !1248, line: 741, baseType: !3258, size: 576)
!3258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !1248, line: 380, size: 576, elements: !3259)
!3259 = !{!3260, !3261}
!3260 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !3258, file: !1248, line: 383, baseType: !3252, size: 512)
!3261 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !3258, file: !1248, line: 389, baseType: !3250, size: 64, offset: 512)
!3262 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !3198, file: !1248, line: 742, baseType: !3263, size: 320)
!3263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !1248, line: 395, size: 320, elements: !3264)
!3264 = !{!3265, !3266}
!3265 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3263, file: !1248, line: 397, baseType: !3201, size: 256)
!3266 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !3263, file: !1248, line: 400, baseType: !3186, size: 64, offset: 256)
!3267 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !3198, file: !1248, line: 743, baseType: !3268, size: 448)
!3268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !1248, line: 406, size: 448, elements: !3269)
!3269 = !{!3270, !3271, !3272, !3273}
!3270 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3268, file: !1248, line: 408, baseType: !3201, size: 256)
!3271 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !3268, file: !1248, line: 412, baseType: !2914, size: 64, offset: 256)
!3272 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !3268, file: !1248, line: 420, baseType: !2914, size: 64, offset: 320)
!3273 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !3268, file: !1248, line: 423, baseType: !3186, size: 64, offset: 384)
!3274 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !3198, file: !1248, line: 744, baseType: !3275, size: 384)
!3275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !1248, line: 429, size: 384, elements: !3276)
!3276 = !{!3277, !3278, !3279}
!3277 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3275, file: !1248, line: 431, baseType: !3201, size: 256)
!3278 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !3275, file: !1248, line: 434, baseType: !2914, size: 64, offset: 256)
!3279 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !3275, file: !1248, line: 437, baseType: !3186, size: 64, offset: 320)
!3280 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !3198, file: !1248, line: 745, baseType: !3281, size: 384)
!3281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !1248, line: 443, size: 384, elements: !3282)
!3282 = !{!3283, !3284, !3285}
!3283 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3281, file: !1248, line: 445, baseType: !3201, size: 256)
!3284 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !3281, file: !1248, line: 449, baseType: !2914, size: 64, offset: 256)
!3285 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !3281, file: !1248, line: 453, baseType: !3186, size: 64, offset: 320)
!3286 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !3198, file: !1248, line: 746, baseType: !3287, size: 320)
!3287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !1248, line: 459, size: 320, elements: !3288)
!3288 = !{!3289, !3290}
!3289 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3287, file: !1248, line: 461, baseType: !3201, size: 256)
!3290 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !3287, file: !1248, line: 464, baseType: !2914, size: 64, offset: 256)
!3291 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !3198, file: !1248, line: 747, baseType: !3292, size: 768)
!3292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !1248, line: 469, size: 768, elements: !3293)
!3293 = !{!3294, !3295, !3296, !3297, !3298}
!3294 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3292, file: !1248, line: 471, baseType: !3201, size: 256)
!3295 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !3292, file: !1248, line: 474, baseType: !7, size: 32, offset: 256)
!3296 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !3292, file: !1248, line: 475, baseType: !7, size: 32, offset: 288)
!3297 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !3292, file: !1248, line: 478, baseType: !2914, size: 64, offset: 320)
!3298 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !3292, file: !1248, line: 481, baseType: !3299, size: 384, offset: 384)
!3299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3300, size: 384, elements: !2972)
!3300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !135, line: 1917, size: 384, elements: !3301)
!3301 = !{!3302, !3303, !3304}
!3302 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !3300, file: !135, line: 1920, baseType: !3238, size: 256)
!3303 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !3300, file: !135, line: 1921, baseType: !2914, size: 64, offset: 256)
!3304 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !3300, file: !135, line: 1922, baseType: !2998, size: 32, offset: 320)
!3305 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !3198, file: !1248, line: 748, baseType: !3306, size: 320)
!3306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !1248, line: 487, size: 320, elements: !3307)
!3307 = !{!3308, !3309}
!3308 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3306, file: !1248, line: 490, baseType: !3201, size: 256)
!3309 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !3306, file: !1248, line: 494, baseType: !1249, size: 32, offset: 256)
!3310 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !3198, file: !1248, line: 749, baseType: !3311, size: 384)
!3311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !1248, line: 500, size: 384, elements: !3312)
!3312 = !{!3313, !3314, !3315}
!3313 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3311, file: !1248, line: 502, baseType: !3201, size: 256)
!3314 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !3311, file: !1248, line: 506, baseType: !3186, size: 64, offset: 256)
!3315 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !3311, file: !1248, line: 510, baseType: !3186, size: 64, offset: 320)
!3316 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !3198, file: !1248, line: 750, baseType: !3317, size: 320)
!3317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !1248, line: 529, size: 320, elements: !3318)
!3318 = !{!3319, !3320}
!3319 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3317, file: !1248, line: 531, baseType: !3201, size: 256)
!3320 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !3317, file: !1248, line: 540, baseType: !3186, size: 64, offset: 256)
!3321 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !3198, file: !1248, line: 751, baseType: !3322, size: 704)
!3322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !1248, line: 546, size: 704, elements: !3323)
!3323 = !{!3324, !3325, !3326, !3327, !3328, !3329, !3330}
!3324 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !3322, file: !1248, line: 549, baseType: !3252, size: 512)
!3325 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !3322, file: !1248, line: 553, baseType: !2871, size: 64, offset: 512)
!3326 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !3322, file: !1248, line: 557, baseType: !2866, size: 8, offset: 576)
!3327 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !3322, file: !1248, line: 558, baseType: !2866, size: 8, offset: 584)
!3328 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !3322, file: !1248, line: 559, baseType: !2866, size: 8, offset: 592)
!3329 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !3322, file: !1248, line: 560, baseType: !2866, size: 8, offset: 600)
!3330 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !3322, file: !1248, line: 566, baseType: !3250, size: 64, offset: 640)
!3331 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !3198, file: !1248, line: 752, baseType: !3332, size: 384)
!3332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !1248, line: 571, size: 384, elements: !3333)
!3333 = !{!3334, !3335}
!3334 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !3332, file: !1248, line: 573, baseType: !3263, size: 320)
!3335 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !3332, file: !1248, line: 577, baseType: !2914, size: 64, offset: 320)
!3336 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !3198, file: !1248, line: 753, baseType: !3337, size: 576)
!3337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !1248, line: 600, size: 576, elements: !3338)
!3338 = !{!3339, !3340, !3341, !3344, !3353}
!3339 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !3337, file: !1248, line: 602, baseType: !3263, size: 320)
!3340 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !3337, file: !1248, line: 605, baseType: !2914, size: 64, offset: 320)
!3341 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !3337, file: !1248, line: 609, baseType: !3342, size: 64, offset: 384)
!3342 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !3343, line: 46, baseType: !2927)
!3343 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!3344 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !3337, file: !1248, line: 612, baseType: !3345, size: 64, offset: 448)
!3345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3346, size: 64)
!3346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !1248, line: 581, size: 320, elements: !3347)
!3347 = !{!3348, !3349, !3350, !3351, !3352}
!3348 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !3346, file: !1248, line: 583, baseType: !134, size: 32)
!3349 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !3346, file: !1248, line: 586, baseType: !2914, size: 64, offset: 64)
!3350 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !3346, file: !1248, line: 589, baseType: !2914, size: 64, offset: 128)
!3351 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !3346, file: !1248, line: 592, baseType: !2914, size: 64, offset: 192)
!3352 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !3346, file: !1248, line: 595, baseType: !2914, size: 64, offset: 256)
!3353 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !3337, file: !1248, line: 616, baseType: !3186, size: 64, offset: 512)
!3354 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !3198, file: !1248, line: 754, baseType: !3355, size: 512)
!3355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !1248, line: 622, size: 512, elements: !3356)
!3356 = !{!3357, !3358, !3359, !3360}
!3357 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !3355, file: !1248, line: 624, baseType: !3263, size: 320)
!3358 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !3355, file: !1248, line: 628, baseType: !2914, size: 64, offset: 320)
!3359 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !3355, file: !1248, line: 632, baseType: !2914, size: 64, offset: 384)
!3360 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !3355, file: !1248, line: 636, baseType: !2914, size: 64, offset: 448)
!3361 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !3198, file: !1248, line: 755, baseType: !3362, size: 704)
!3362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !1248, line: 642, size: 704, elements: !3363)
!3363 = !{!3364, !3365, !3366, !3367}
!3364 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !3362, file: !1248, line: 644, baseType: !3355, size: 512)
!3365 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !3362, file: !1248, line: 648, baseType: !2914, size: 64, offset: 512)
!3366 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !3362, file: !1248, line: 652, baseType: !2914, size: 64, offset: 576)
!3367 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !3362, file: !1248, line: 653, baseType: !2914, size: 64, offset: 640)
!3368 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !3198, file: !1248, line: 756, baseType: !3369, size: 448)
!3369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !1248, line: 663, size: 448, elements: !3370)
!3370 = !{!3371, !3372, !3373}
!3371 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !3369, file: !1248, line: 665, baseType: !3263, size: 320)
!3372 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !3369, file: !1248, line: 668, baseType: !2914, size: 64, offset: 320)
!3373 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !3369, file: !1248, line: 673, baseType: !2914, size: 64, offset: 384)
!3374 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !3198, file: !1248, line: 757, baseType: !3375, size: 384)
!3375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !1248, line: 694, size: 384, elements: !3376)
!3376 = !{!3377, !3378}
!3377 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !3375, file: !1248, line: 696, baseType: !3263, size: 320)
!3378 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !3375, file: !1248, line: 699, baseType: !2914, size: 64, offset: 320)
!3379 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !3198, file: !1248, line: 758, baseType: !3380, size: 384)
!3380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !1248, line: 681, size: 384, elements: !3381)
!3381 = !{!3382, !3383, !3384}
!3382 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3380, file: !1248, line: 683, baseType: !3201, size: 256)
!3383 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !3380, file: !1248, line: 686, baseType: !2914, size: 64, offset: 256)
!3384 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !3380, file: !1248, line: 689, baseType: !2914, size: 64, offset: 320)
!3385 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !3198, file: !1248, line: 759, baseType: !3386, size: 384)
!3386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !1248, line: 707, size: 384, elements: !3387)
!3387 = !{!3388, !3389, !3390}
!3388 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3386, file: !1248, line: 709, baseType: !3201, size: 256)
!3389 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !3386, file: !1248, line: 712, baseType: !2914, size: 64, offset: 256)
!3390 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !3386, file: !1248, line: 712, baseType: !2914, size: 64, offset: 320)
!3391 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !3198, file: !1248, line: 760, baseType: !3392, size: 320)
!3392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !1248, line: 718, size: 320, elements: !3393)
!3393 = !{!3394, !3395}
!3394 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3392, file: !1248, line: 720, baseType: !3201, size: 256)
!3395 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !3392, file: !1248, line: 723, baseType: !2914, size: 64, offset: 256)
!3396 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !3193, file: !1248, line: 138, baseType: !3192, size: 64, offset: 64)
!3397 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !3193, file: !1248, line: 139, baseType: !3192, size: 64, offset: 128)
!3398 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !3188, file: !1248, line: 146, baseType: !3191, size: 64, offset: 64)
!3399 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !3188, file: !1248, line: 152, baseType: !3186, size: 64, offset: 128)
!3400 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !3183, file: !337, line: 130, baseType: !3048, size: 64)
!3401 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !3178, file: !337, line: 134, baseType: !2870, size: 64, offset: 192)
!3402 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !3178, file: !337, line: 137, baseType: !2914, size: 64, offset: 256)
!3403 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !3178, file: !337, line: 138, baseType: !2998, size: 32, offset: 320)
!3404 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !3178, file: !337, line: 142, baseType: !7, size: 32, offset: 352)
!3405 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !3178, file: !337, line: 144, baseType: !1249, size: 32, offset: 384)
!3406 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !3178, file: !337, line: 145, baseType: !1249, size: 32, offset: 416)
!3407 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !3178, file: !337, line: 146, baseType: !3408, size: 64, offset: 448)
!3408 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !337, line: 119, baseType: !2929)
!3409 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !3161, file: !337, line: 220, baseType: !3164, size: 64, offset: 64)
!3410 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !3161, file: !337, line: 223, baseType: !2870, size: 64, offset: 128)
!3411 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !3161, file: !337, line: 226, baseType: !3412, size: 64, offset: 192)
!3412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3413, size: 64)
!3413 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !337, line: 185, flags: DIFlagFwdDecl)
!3414 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !3161, file: !337, line: 229, baseType: !3415, size: 128, offset: 256)
!3415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3416, size: 128, elements: !3115)
!3416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3417, size: 64)
!3417 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !337, line: 229, flags: DIFlagFwdDecl)
!3418 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !3161, file: !337, line: 232, baseType: !3160, size: 64, offset: 384)
!3419 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !3161, file: !337, line: 233, baseType: !3160, size: 64, offset: 448)
!3420 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !3161, file: !337, line: 238, baseType: !3421, size: 64, offset: 512)
!3421 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !337, line: 235, size: 64, elements: !3422)
!3422 = !{!3423, !3429}
!3423 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !3421, file: !337, line: 236, baseType: !3424, size: 64)
!3424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3425, size: 64)
!3425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !337, line: 273, size: 128, elements: !3426)
!3426 = !{!3427, !3428}
!3427 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !3425, file: !337, line: 275, baseType: !3186, size: 64)
!3428 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !3425, file: !337, line: 278, baseType: !3186, size: 64, offset: 64)
!3429 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !3421, file: !337, line: 237, baseType: !3430, size: 64)
!3430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3431, size: 64)
!3431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !337, line: 259, size: 320, elements: !3432)
!3432 = !{!3433, !3434, !3435, !3436, !3437}
!3433 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !3431, file: !337, line: 261, baseType: !3048, size: 64)
!3434 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !3431, file: !337, line: 262, baseType: !3048, size: 64, offset: 64)
!3435 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !3431, file: !337, line: 266, baseType: !3048, size: 64, offset: 128)
!3436 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !3431, file: !337, line: 267, baseType: !3048, size: 64, offset: 192)
!3437 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !3431, file: !337, line: 270, baseType: !1249, size: 32, offset: 256)
!3438 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !3161, file: !337, line: 241, baseType: !3408, size: 64, offset: 576)
!3439 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !3161, file: !337, line: 244, baseType: !1249, size: 32, offset: 640)
!3440 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !3161, file: !337, line: 247, baseType: !1249, size: 32, offset: 672)
!3441 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !3161, file: !337, line: 250, baseType: !1249, size: 32, offset: 704)
!3442 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !3161, file: !337, line: 253, baseType: !1249, size: 32, offset: 736)
!3443 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !3161, file: !337, line: 256, baseType: !1249, size: 32, offset: 768)
!3444 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !3068, file: !385, line: 179, baseType: !3445, size: 64)
!3445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3446, size: 64)
!3446 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !385, line: 150, baseType: !3447)
!3447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !385, line: 142, size: 320, elements: !3448)
!3448 = !{!3449, !3450, !3451, !3452, !3455, !3456}
!3449 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !3447, file: !385, line: 144, baseType: !2914, size: 64)
!3450 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !3447, file: !385, line: 145, baseType: !3048, size: 64, offset: 64)
!3451 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3447, file: !385, line: 146, baseType: !3048, size: 64, offset: 128)
!3452 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !3447, file: !385, line: 147, baseType: !3453, size: 32, offset: 192)
!3453 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !3454, line: 31, baseType: !1249)
!3454 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!3455 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3447, file: !385, line: 148, baseType: !7, size: 32, offset: 224)
!3456 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !3447, file: !385, line: 149, baseType: !2866, size: 8, offset: 256)
!3457 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !3068, file: !385, line: 180, baseType: !3458, size: 64)
!3458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3459, size: 64)
!3459 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !385, line: 162, baseType: !3460)
!3460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !385, line: 159, size: 128, elements: !3461)
!3461 = !{!3462, !3463}
!3462 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !3460, file: !385, line: 160, baseType: !2914, size: 64)
!3463 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !3460, file: !385, line: 161, baseType: !2929, size: 64, offset: 64)
!3464 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !3068, file: !385, line: 181, baseType: !3465, size: 64)
!3465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3466, size: 64)
!3466 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !385, line: 181, flags: DIFlagFwdDecl)
!3467 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !3063, file: !385, line: 317, baseType: !3468, size: 64)
!3468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2929, size: 64, elements: !2972)
!3469 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !3063, file: !385, line: 318, baseType: !3470, size: 320)
!3470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !385, line: 188, size: 320, elements: !3471)
!3471 = !{!3472, !3474, !3531}
!3472 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !3470, file: !385, line: 190, baseType: !3473, size: 192)
!3473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3067, size: 192, elements: !2947)
!3474 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !3470, file: !385, line: 193, baseType: !3475, size: 64, offset: 192)
!3475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3476, size: 64)
!3476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !385, line: 206, size: 320, elements: !3477)
!3477 = !{!3478, !3516, !3517, !3518, !3530}
!3478 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !3476, file: !385, line: 208, baseType: !3479, size: 64)
!3479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3480, size: 64)
!3480 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !2915, line: 62, baseType: !3481)
!3481 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !3482, line: 538, size: 256, elements: !3483)
!3482 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!3483 = !{!3484, !3488, !3494, !3507}
!3484 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3481, file: !3482, line: 539, baseType: !3485, size: 32)
!3485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !3482, line: 482, size: 32, elements: !3486)
!3486 = !{!3487}
!3487 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !3485, file: !3482, line: 484, baseType: !7, size: 32)
!3488 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !3481, file: !3482, line: 540, baseType: !3489, size: 192)
!3489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !3482, line: 488, size: 192, elements: !3490)
!3490 = !{!3491, !3492, !3493}
!3491 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3489, file: !3482, line: 489, baseType: !3485, size: 32)
!3492 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !3489, file: !3482, line: 492, baseType: !2871, size: 64, offset: 64)
!3493 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !3489, file: !3482, line: 496, baseType: !2914, size: 64, offset: 128)
!3494 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !3481, file: !3482, line: 541, baseType: !3495, size: 256)
!3495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !3482, line: 504, size: 256, elements: !3496)
!3496 = !{!3497, !3498, !3505, !3506}
!3497 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3495, file: !3482, line: 505, baseType: !3485, size: 32)
!3498 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !3495, file: !3482, line: 509, baseType: !3499, size: 64, offset: 64)
!3499 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !3482, line: 501, baseType: !3500)
!3500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3501, size: 64)
!3501 = !DISubroutineType(types: !3502)
!3502 = !{null, !3503}
!3503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3504, size: 64)
!3504 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!3505 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !3495, file: !3482, line: 510, baseType: !3503, size: 64, offset: 128)
!3506 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !3495, file: !3482, line: 513, baseType: !3479, size: 64, offset: 192)
!3507 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !3481, file: !3482, line: 542, baseType: !3508, size: 128)
!3508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !3482, line: 530, size: 128, elements: !3509)
!3509 = !{!3510, !3511}
!3510 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3508, file: !3482, line: 531, baseType: !3485, size: 32)
!3511 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !3508, file: !3482, line: 534, baseType: !3512, size: 64, offset: 64)
!3512 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !3482, line: 525, baseType: !3513)
!3513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3514, size: 64)
!3514 = !DISubroutineType(types: !3515)
!3515 = !{!2866, !2914, !2871, !2927, !2927}
!3516 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !3476, file: !385, line: 211, baseType: !7, size: 32, offset: 64)
!3517 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3476, file: !385, line: 214, baseType: !2929, size: 64, offset: 128)
!3518 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !3476, file: !385, line: 224, baseType: !3519, size: 64, offset: 192)
!3519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3520, size: 64)
!3520 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !385, line: 202, baseType: !3521)
!3521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !385, line: 202, size: 128, elements: !3522)
!3522 = !{!3523}
!3523 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !3521, file: !385, line: 202, baseType: !3524, size: 128)
!3524 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !385, line: 200, baseType: !3525)
!3525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !385, line: 200, size: 128, elements: !3526)
!3526 = !{!3527, !3528, !3529}
!3527 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !3525, file: !385, line: 200, baseType: !7, size: 32)
!3528 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !3525, file: !385, line: 200, baseType: !7, size: 32, offset: 32)
!3529 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !3525, file: !385, line: 200, baseType: !3081, size: 64, offset: 64)
!3530 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !3476, file: !385, line: 234, baseType: !3519, size: 64, offset: 256)
!3531 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !3470, file: !385, line: 197, baseType: !2929, size: 64, offset: 256)
!3532 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !3063, file: !385, line: 319, baseType: !2936, size: 256)
!3533 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !3063, file: !385, line: 320, baseType: !2955, size: 192)
!3534 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !2874, file: !135, line: 3384, baseType: !3535, size: 1472)
!3535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !135, line: 3114, size: 1472, elements: !3536)
!3536 = !{!3537, !3558, !3559, !3560, !3561}
!3537 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3535, file: !135, line: 3115, baseType: !3538, size: 1216)
!3538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !135, line: 2984, size: 1216, elements: !3539)
!3539 = !{!3540, !3541, !3542, !3543, !3544, !3545, !3546, !3547, !3548, !3549, !3550, !3551, !3552, !3553, !3554, !3555, !3556, !3557}
!3540 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3538, file: !135, line: 2985, baseType: !3044, size: 960)
!3541 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !3538, file: !135, line: 2986, baseType: !2914, size: 64, offset: 960)
!3542 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !3538, file: !135, line: 2987, baseType: !2914, size: 64, offset: 1024)
!3543 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !3538, file: !135, line: 2988, baseType: !2914, size: 64, offset: 1088)
!3544 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !3538, file: !135, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!3545 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !3538, file: !135, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!3546 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !3538, file: !135, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!3547 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !3538, file: !135, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!3548 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !3538, file: !135, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!3549 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !3538, file: !135, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!3550 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !3538, file: !135, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!3551 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !3538, file: !135, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!3552 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !3538, file: !135, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!3553 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !3538, file: !135, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!3554 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !3538, file: !135, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!3555 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !3538, file: !135, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!3556 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !3538, file: !135, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!3557 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !3538, file: !135, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!3558 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !3535, file: !135, line: 3117, baseType: !2914, size: 64, offset: 1216)
!3559 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !3535, file: !135, line: 3119, baseType: !2914, size: 64, offset: 1280)
!3560 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !3535, file: !135, line: 3121, baseType: !2914, size: 64, offset: 1344)
!3561 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !3535, file: !135, line: 3123, baseType: !2914, size: 64, offset: 1408)
!3562 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !2874, file: !135, line: 3385, baseType: !3563, size: 1088)
!3563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !135, line: 2874, size: 1088, elements: !3564)
!3564 = !{!3565, !3566, !3567}
!3565 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3563, file: !135, line: 2875, baseType: !3044, size: 960)
!3566 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !3563, file: !135, line: 2876, baseType: !3048, size: 64, offset: 960)
!3567 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !3563, file: !135, line: 2877, baseType: !3568, size: 64, offset: 1024)
!3568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3569, size: 64)
!3569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !3570, line: 172, size: 128, elements: !3571)
!3570 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!3571 = !{!3572, !3573, !3574, !3575, !3576, !3577, !3578}
!3572 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !3569, file: !3570, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!3573 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !3569, file: !3570, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!3574 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !3569, file: !3570, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!3575 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !3569, file: !3570, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!3576 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !3569, file: !3570, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!3577 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !3569, file: !3570, line: 195, baseType: !7, size: 32, offset: 32)
!3578 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !3569, file: !3570, line: 199, baseType: !2914, size: 64, offset: 64)
!3579 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !2874, file: !135, line: 3386, baseType: !3538, size: 1216)
!3580 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !2874, file: !135, line: 3387, baseType: !3581, size: 1280)
!3581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !135, line: 3093, size: 1280, elements: !3582)
!3582 = !{!3583, !3584}
!3583 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3581, file: !135, line: 3094, baseType: !3538, size: 1216)
!3584 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !3581, file: !135, line: 3095, baseType: !3568, size: 64, offset: 1216)
!3585 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !2874, file: !135, line: 3388, baseType: !3586, size: 1216)
!3586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !135, line: 2824, size: 1216, elements: !3587)
!3587 = !{!3588, !3589, !3590, !3591, !3592, !3593}
!3588 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3586, file: !135, line: 2825, baseType: !3006, size: 896)
!3589 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !3586, file: !135, line: 2827, baseType: !2914, size: 64, offset: 896)
!3590 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !3586, file: !135, line: 2828, baseType: !2914, size: 64, offset: 960)
!3591 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !3586, file: !135, line: 2829, baseType: !2914, size: 64, offset: 1024)
!3592 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !3586, file: !135, line: 2830, baseType: !2914, size: 64, offset: 1088)
!3593 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !3586, file: !135, line: 2831, baseType: !2914, size: 64, offset: 1152)
!3594 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !2874, file: !135, line: 3389, baseType: !3595, size: 1024)
!3595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !135, line: 2850, size: 1024, elements: !3596)
!3596 = !{!3597, !3598, !3599}
!3597 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3595, file: !135, line: 2851, baseType: !3044, size: 960)
!3598 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !3595, file: !135, line: 2852, baseType: !1249, size: 32, offset: 960)
!3599 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !3595, file: !135, line: 2853, baseType: !1249, size: 32, offset: 992)
!3600 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !2874, file: !135, line: 3390, baseType: !3601, size: 1024)
!3601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !135, line: 2857, size: 1024, elements: !3602)
!3602 = !{!3603, !3604}
!3603 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3601, file: !135, line: 2858, baseType: !3044, size: 960)
!3604 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !3601, file: !135, line: 2859, baseType: !3568, size: 64, offset: 960)
!3605 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !2874, file: !135, line: 3391, baseType: !3606, size: 960)
!3606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !135, line: 2862, size: 960, elements: !3607)
!3607 = !{!3608}
!3608 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3606, file: !135, line: 2863, baseType: !3044, size: 960)
!3609 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !2874, file: !135, line: 3392, baseType: !3610, size: 1472)
!3610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !135, line: 3304, size: 1472, elements: !3611)
!3611 = !{!3612}
!3612 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3610, file: !135, line: 3305, baseType: !3535, size: 1472)
!3613 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !2874, file: !135, line: 3393, baseType: !3614, size: 1792)
!3614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !135, line: 3248, size: 1792, elements: !3615)
!3615 = !{!3616, !3617, !3927, !3928, !3929, !3930, !3931, !3932, !3933, !3934, !3935, !3936, !3937, !3938, !3939, !3940, !3941, !3942, !3943, !3944, !3945, !3946, !3947}
!3616 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3614, file: !135, line: 3249, baseType: !3535, size: 1472)
!3617 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !3614, file: !135, line: 3251, baseType: !3618, size: 64, offset: 1472)
!3618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3619, size: 64)
!3619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !3620, line: 463, size: 1152, elements: !3621)
!3620 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!3621 = !{!3622, !3781, !3812, !3813, !3868, !3871, !3872, !3873, !3874, !3875, !3876, !3900, !3903, !3904, !3905, !3906, !3907, !3908, !3909, !3910, !3911, !3912, !3913, !3914, !3915, !3916, !3917, !3918, !3919, !3920, !3921, !3922, !3923, !3924, !3925, !3926}
!3622 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !3619, file: !3620, line: 464, baseType: !3623, size: 64)
!3623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3624, size: 64)
!3624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !330, line: 194, size: 384, elements: !3625)
!3625 = !{!3626, !3675, !3688, !3702, !3750, !3762}
!3626 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !3624, file: !330, line: 197, baseType: !3627, size: 64)
!3627 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !330, line: 182, baseType: !3628)
!3628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3629, size: 64)
!3629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !330, line: 116, size: 704, elements: !3630)
!3630 = !{!3631, !3632, !3633, !3634, !3635, !3636, !3663, !3672, !3673, !3674}
!3631 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !3629, file: !330, line: 119, baseType: !3628, size: 64)
!3632 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !3629, file: !330, line: 122, baseType: !3628, size: 64, offset: 64)
!3633 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !3629, file: !330, line: 123, baseType: !3628, size: 64, offset: 128)
!3634 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !3629, file: !330, line: 126, baseType: !1249, size: 32, offset: 192)
!3635 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !3629, file: !330, line: 129, baseType: !329, size: 32, offset: 224)
!3636 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !3629, file: !330, line: 165, baseType: !3637, size: 192, offset: 256)
!3637 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !330, line: 132, size: 192, elements: !3638)
!3638 = !{!3639, !3652, !3658}
!3639 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !3637, file: !330, line: 137, baseType: !3640, size: 128)
!3640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !330, line: 133, size: 128, elements: !3641)
!3641 = !{!3642, !3651}
!3642 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !3640, file: !330, line: 135, baseType: !3643, size: 64)
!3643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3644, size: 64)
!3644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !330, line: 93, size: 320, elements: !3645)
!3645 = !{!3646, !3647, !3648, !3649, !3650}
!3646 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !3644, file: !330, line: 96, baseType: !3643, size: 64)
!3647 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !3644, file: !330, line: 97, baseType: !3643, size: 64, offset: 64)
!3648 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !3644, file: !330, line: 101, baseType: !2914, size: 64, offset: 128)
