; ModuleID = 'c-common.bc'
source_filename = "c-common.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }
%struct.tree_decl_minimal = type { %struct.tree_common, i32, i32, %union.tree_node*, %union.tree_node* }
%struct.tree_common = type { %struct.tree_base, %union.tree_node*, %union.tree_node* }
%struct.tree_base = type { i64 }

!1473 = !DIEnumerator(name: "BT_FN_VOID_OMPFN_PTR_UINT_LONG_LONG_LONG_LONG", value: 230, isUnsigned: true)
!1474 = !DIEnumerator(name: "BT_FN_VOID_OMPFN_PTR_OMPCPYFN_LONG_LONG_BOOL_UINT", value: 231, isUnsigned: true)
!1475 = !DIEnumerator(name: "BT_FN_BOOL_BOOL_ULL_ULL_ULL_ULL_ULLPTR_ULLPTR", value: 232, isUnsigned: true)
!1476 = !DIEnumerator(name: "BT_FN_VOID_VAR", value: 233, isUnsigned: true)
!1477 = !DIEnumerator(name: "BT_FN_INT_VAR", value: 234, isUnsigned: true)
!1478 = !DIEnumerator(name: "BT_FN_PTR_VAR", value: 235, isUnsigned: true)
!1479 = !DIEnumerator(name: "BT_FN_VOID_VALIST_REF_VAR", value: 236, isUnsigned: true)
!1480 = !DIEnumerator(name: "BT_FN_VOID_CONST_PTR_VAR", value: 237, isUnsigned: true)
!1481 = !DIEnumerator(name: "BT_FN_INT_CONST_STRING_VAR", value: 238, isUnsigned: true)
!1482 = !DIEnumerator(name: "BT_FN_INT_FILEPTR_CONST_STRING_VAR", value: 239, isUnsigned: true)
!1483 = !DIEnumerator(name: "BT_FN_INT_STRING_CONST_STRING_VAR", value: 240, isUnsigned: true)
!1484 = !DIEnumerator(name: "BT_FN_INT_CONST_STRING_CONST_STRING_VAR", value: 241, isUnsigned: true)
!1485 = !DIEnumerator(name: "BT_FN_INT_INT_CONST_STRING_VAR", value: 242, isUnsigned: true)
!1486 = !DIEnumerator(name: "BT_FN_INT_STRING_SIZE_CONST_STRING_VAR", value: 243, isUnsigned: true)
!1487 = !DIEnumerator(name: "BT_FN_SSIZE_STRING_SIZE_CONST_STRING_VAR", value: 244, isUnsigned: true)
!1488 = !DIEnumerator(name: "BT_FN_INT_FILEPTR_INT_CONST_STRING_VAR", value: 245, isUnsigned: true)
!1489 = !DIEnumerator(name: "BT_FN_INT_STRING_INT_SIZE_CONST_STRING_VAR", value: 246, isUnsigned: true)
!1490 = !DIEnumerator(name: "BT_FN_INT_STRING_SIZE_INT_SIZE_CONST_STRING_VAR", value: 247, isUnsigned: true)
!1491 = !DIEnumerator(name: "BT_FN_INT_INT_INT_INT_INT_INT_VAR", value: 248, isUnsigned: true)
!1492 = !DIEnumerator(name: "BT_PTR_FN_VOID_VAR", value: 249, isUnsigned: true)
!1493 = !DIEnumerator(name: "BT_FN_PTR_PTR_FN_VOID_VAR_PTR_SIZE", value: 250, isUnsigned: true)
!1494 = !DIEnumerator(name: "BT_LAST", value: 251, isUnsigned: true)
!1495 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "built_in_class", file: !140, line: 205, baseType: !7, size: 32, elements: !1496)
!1496 = !{!1497, !1498, !1499, !1500}
!1497 = !DIEnumerator(name: "NOT_BUILT_IN", value: 0, isUnsigned: true)
!1498 = !DIEnumerator(name: "BUILT_IN_FRONTEND", value: 1, isUnsigned: true)
!1499 = !DIEnumerator(name: "BUILT_IN_MD", value: 2, isUnsigned: true)
!1500 = !DIEnumerator(name: "BUILT_IN_NORMAL", value: 3, isUnsigned: true)
!1501 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "symbol_visibility", file: !140, line: 2465, baseType: !7, size: 32, elements: !1502)
!1502 = !{!1503, !1504, !1505, !1506}
!1503 = !DIEnumerator(name: "VISIBILITY_DEFAULT", value: 0, isUnsigned: true)
!1504 = !DIEnumerator(name: "VISIBILITY_PROTECTED", value: 1, isUnsigned: true)
!1505 = !DIEnumerator(name: "VISIBILITY_HIDDEN", value: 2, isUnsigned: true)
!1506 = !DIEnumerator(name: "VISIBILITY_INTERNAL", value: 3, isUnsigned: true)
!1507 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tls_model", file: !1508, line: 97, baseType: !7, size: 32, elements: !1509)
!1508 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1509 = !{!1510, !1511, !1512, !1513, !1514, !1515, !1516}
!1510 = !DIEnumerator(name: "TLS_MODEL_NONE", value: 0, isUnsigned: true)
!1511 = !DIEnumerator(name: "TLS_MODEL_EMULATED", value: 1, isUnsigned: true)
!1512 = !DIEnumerator(name: "TLS_MODEL_REAL", value: 2, isUnsigned: true)
!1513 = !DIEnumerator(name: "TLS_MODEL_GLOBAL_DYNAMIC", value: 2, isUnsigned: true)
!1514 = !DIEnumerator(name: "TLS_MODEL_LOCAL_DYNAMIC", value: 3, isUnsigned: true)
!1515 = !DIEnumerator(name: "TLS_MODEL_INITIAL_EXEC", value: 4, isUnsigned: true)
!1516 = !DIEnumerator(name: "TLS_MODEL_LOCAL_EXEC", value: 5, isUnsigned: true)
!1517 = !{!1518, !1519, !1520, !1521, !1524, !1525, !1527, !139, !1522, !1653, !1528, !2791, !1580, !2793, !2328, !2796, !11, !382, !2322, !2797, !2804, !2807, !1582, !2808, !2809, !2811, !2816, !2817, !2818, !1997, !2830, !2842, !2847, !2855, !2856, !2857, !7, !2519, !2859}
!1518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1519, size: 64)
!1519 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1520 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!1521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1522, size: 64)
!1522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1523, size: 64)
!1523 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!1524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1526, size: 64)
!1526 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1523)
!1527 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !1508, line: 56, baseType: !1528)
!1528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1529, size: 64)
!1529 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !140, line: 3371, size: 1792, elements: !1530)
!1530 = !{!1531, !1564, !1570, !1583, !1602, !1613, !1618, !1627, !1633, !1646, !1658, !1696, !2189, !2217, !2225, !2226, !2231, !2240, !2246, !2251, !2255, !2259, !2433, !2480, !2486, !2492, !2499, !2510, !2535, !2552, !2564, !2586, !2601, !2773}
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1529, file: !140, line: 3372, baseType: !1532, size: 64)
!1532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !140, line: 360, size: 64, elements: !1533)
!1533 = !{!1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563}
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1532, file: !140, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !1532, file: !140, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !1532, file: !140, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !1532, file: !140, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !1532, file: !140, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !1532, file: !140, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !1532, file: !140, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !1532, file: !140, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !1532, file: !140, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !1532, file: !140, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !1532, file: !140, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !1532, file: !140, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !1532, file: !140, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !1532, file: !140, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !1532, file: !140, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !1532, file: !140, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !1532, file: !140, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !1532, file: !140, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1532, file: !140, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1532, file: !140, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1532, file: !140, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1532, file: !140, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1532, file: !140, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1532, file: !140, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1532, file: !140, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1532, file: !140, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !1532, file: !140, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !1532, file: !140, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !1532, file: !140, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !1532, file: !140, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1529, file: !140, line: 3373, baseType: !1565, size: 192)
!1565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !140, line: 402, size: 192, elements: !1566)
!1566 = !{!1567, !1568, !1569}
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1565, file: !140, line: 403, baseType: !1532, size: 64)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !1565, file: !140, line: 404, baseType: !1527, size: 64, offset: 64)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1565, file: !140, line: 405, baseType: !1527, size: 64, offset: 128)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1529, file: !140, line: 3374, baseType: !1571, size: 320)
!1571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !140, line: 1384, size: 320, elements: !1572)
!1572 = !{!1573, !1574}
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1571, file: !140, line: 1385, baseType: !1565, size: 192)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1571, file: !140, line: 1386, baseType: !1575, size: 128, offset: 192)
!1575 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !1576, line: 58, baseType: !1577)
!1576 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1577 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1576, line: 54, size: 128, elements: !1578)
!1578 = !{!1579, !1581}
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !1577, file: !1576, line: 56, baseType: !1580, size: 64)
!1580 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !1577, file: !1576, line: 57, baseType: !1582, size: 64, offset: 64)
!1582 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !1529, file: !140, line: 3375, baseType: !1584, size: 256)
!1584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !140, line: 1397, size: 256, elements: !1585)
!1585 = !{!1586, !1587}
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1584, file: !140, line: 1398, baseType: !1565, size: 192)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !1584, file: !140, line: 1399, baseType: !1588, size: 64, offset: 192)
!1588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1589, size: 64)
!1589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !1590, line: 52, size: 256, elements: !1591)
!1590 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1591 = !{!1592, !1593, !1594, !1595, !1596, !1597, !1598}
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !1589, file: !1590, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !1589, file: !1590, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !1589, file: !1590, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !1589, file: !1590, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1589, file: !1590, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !1589, file: !1590, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !1589, file: !1590, line: 62, baseType: !1599, size: 192, offset: 64)
!1599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1580, size: 192, elements: !1600)
!1600 = !{!1601}
!1601 = !DISubrange(count: 3)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !1529, file: !140, line: 3376, baseType: !1603, size: 256)
!1603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !140, line: 1408, size: 256, elements: !1604)
!1604 = !{!1605, !1606}
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1603, file: !140, line: 1409, baseType: !1565, size: 192)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !1603, file: !140, line: 1410, baseType: !1607, size: 64, offset: 192)
!1607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1608, size: 64)
!1608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !1609, line: 27, size: 192, elements: !1610)
!1609 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1610 = !{!1611, !1612}
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1608, file: !1609, line: 29, baseType: !1575, size: 128)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1608, file: !1609, line: 30, baseType: !11, size: 32, offset: 128)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !1529, file: !140, line: 3377, baseType: !1614, size: 256)
!1614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !140, line: 1437, size: 256, elements: !1615)
!1615 = !{!1616, !1617}
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1614, file: !140, line: 1438, baseType: !1565, size: 192)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1614, file: !140, line: 1439, baseType: !1527, size: 64, offset: 192)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1529, file: !140, line: 3378, baseType: !1619, size: 256)
!1619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !140, line: 1418, size: 256, elements: !1620)
!1620 = !{!1621, !1622, !1623}
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1619, file: !140, line: 1419, baseType: !1565, size: 192)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1619, file: !140, line: 1420, baseType: !1520, size: 32, offset: 192)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1619, file: !140, line: 1421, baseType: !1624, size: 8, offset: 224)
!1624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1523, size: 8, elements: !1625)
!1625 = !{!1626}
!1626 = !DISubrange(count: 1)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !1529, file: !140, line: 3379, baseType: !1628, size: 320)
!1628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !140, line: 1428, size: 320, elements: !1629)
!1629 = !{!1630, !1631, !1632}
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1628, file: !140, line: 1429, baseType: !1565, size: 192)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !1628, file: !140, line: 1430, baseType: !1527, size: 64, offset: 192)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !1628, file: !140, line: 1431, baseType: !1527, size: 64, offset: 256)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !1529, file: !140, line: 3380, baseType: !1634, size: 320)
!1634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !140, line: 1460, size: 320, elements: !1635)
!1635 = !{!1636, !1637}
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1634, file: !140, line: 1461, baseType: !1565, size: 192)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1634, file: !140, line: 1462, baseType: !1638, size: 128, offset: 192)
!1638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1639, line: 31, size: 128, elements: !1640)
!1639 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1640 = !{!1641, !1644, !1645}
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1638, file: !1639, line: 32, baseType: !1642, size: 64)
!1642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1643, size: 64)
!1643 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1519)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1638, file: !1639, line: 33, baseType: !7, size: 32, offset: 64)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1638, file: !1639, line: 34, baseType: !7, size: 32, offset: 96)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !1529, file: !140, line: 3381, baseType: !1647, size: 384)
!1647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !140, line: 2507, size: 384, elements: !1648)
!1648 = !{!1649, !1650, !1655, !1656, !1657}
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1647, file: !140, line: 2508, baseType: !1565, size: 192)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1647, file: !140, line: 2509, baseType: !1651, size: 32, offset: 192)
!1651 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1652, line: 58, baseType: !1653)
!1652 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1653 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1654, line: 44, baseType: !7)
!1654 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1647, file: !140, line: 2510, baseType: !7, size: 32, offset: 224)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1647, file: !140, line: 2511, baseType: !1527, size: 64, offset: 256)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1647, file: !140, line: 2512, baseType: !1527, size: 64, offset: 320)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !1529, file: !140, line: 3382, baseType: !1659, size: 896)
!1659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !140, line: 2652, size: 896, elements: !1660)
!1660 = !{!1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693}
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1659, file: !140, line: 2653, baseType: !1647, size: 384)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1659, file: !140, line: 2654, baseType: !1527, size: 64, offset: 384)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1659, file: !140, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1659, file: !140, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1659, file: !140, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1659, file: !140, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1659, file: !140, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1659, file: !140, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1659, file: !140, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1659, file: !140, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1659, file: !140, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1659, file: !140, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1659, file: !140, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1659, file: !140, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1659, file: !140, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1659, file: !140, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1659, file: !140, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1659, file: !140, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1659, file: !140, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1659, file: !140, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1659, file: !140, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1659, file: !140, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1659, file: !140, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1659, file: !140, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1659, file: !140, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1659, file: !140, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1659, file: !140, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1659, file: !140, line: 2703, baseType: !7, size: 32, offset: 512)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1659, file: !140, line: 2705, baseType: !1527, size: 64, offset: 576)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1659, file: !140, line: 2706, baseType: !1527, size: 64, offset: 640)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1659, file: !140, line: 2707, baseType: !1527, size: 64, offset: 704)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1659, file: !140, line: 2708, baseType: !1527, size: 64, offset: 768)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1659, file: !140, line: 2711, baseType: !1694, size: 64, offset: 832)
!1694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1695, size: 64)
!1695 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !140, line: 2711, flags: DIFlagFwdDecl)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !1529, file: !140, line: 3383, baseType: !1697, size: 960)
!1697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !140, line: 2756, size: 960, elements: !1698)
!1698 = !{!1699, !1700}
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1697, file: !140, line: 2757, baseType: !1659, size: 896)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1697, file: !140, line: 2758, baseType: !1701, size: 64, offset: 896)
!1701 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !1508, line: 50, baseType: !1702)
!1702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1703, size: 64)
!1703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !1704, line: 240, size: 384, elements: !1705)
!1704 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1705 = !{!1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716}
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1703, file: !1704, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1703, file: !1704, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !1703, file: !1704, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !1703, file: !1704, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !1703, file: !1704, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !1703, file: !1704, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !1703, file: !1704, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1703, file: !1704, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !1703, file: !1704, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !1703, file: !1704, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1703, file: !1704, line: 321, baseType: !1717, size: 320, offset: 64)
!1717 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !1704, line: 315, size: 320, elements: !1718)
!1718 = !{!1719, !2122, !2124, !2187, !2188}
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1717, file: !1704, line: 316, baseType: !1720, size: 64)
!1720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1721, size: 64, elements: !1625)
!1721 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !1704, line: 183, baseType: !1722)
!1722 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !1704, line: 166, size: 64, elements: !1723)
!1723 = !{!1724, !1725, !1726, !1727, !1728, !1736, !1737, !1749, !1752, !1812, !1813, !2099, !2112, !2119}
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !1722, file: !1704, line: 168, baseType: !1520, size: 32)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !1722, file: !1704, line: 169, baseType: !7, size: 32)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !1722, file: !1704, line: 170, baseType: !1525, size: 64)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !1722, file: !1704, line: 171, baseType: !1701, size: 64)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !1722, file: !1704, line: 172, baseType: !1729, size: 64)
!1729 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !1508, line: 53, baseType: !1730)
!1730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1731, size: 64)
!1731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !1704, line: 359, size: 128, elements: !1732)
!1732 = !{!1733, !1734}
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !1731, file: !1704, line: 360, baseType: !1520, size: 32)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !1731, file: !1704, line: 361, baseType: !1735, size: 64, offset: 64)
!1735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1701, size: 64, elements: !1625)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !1722, file: !1704, line: 173, baseType: !11, size: 32)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !1722, file: !1704, line: 174, baseType: !1738, size: 32)
!1738 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !1704, line: 133, baseType: !1739)
!1739 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1704, line: 115, size: 32, elements: !1740)
!1740 = !{!1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748}
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !1739, file: !1704, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !1739, file: !1704, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !1739, file: !1704, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !1739, file: !1704, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !1739, file: !1704, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !1739, file: !1704, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !1739, file: !1704, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1739, file: !1704, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !1722, file: !1704, line: 175, baseType: !1750, size: 64)
!1750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1751, size: 64)
!1751 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !1704, line: 175, flags: DIFlagFwdDecl)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !1722, file: !1704, line: 176, baseType: !1753, size: 64)
!1753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1754, size: 64)
!1754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1755, line: 75, size: 256, elements: !1756)
!1755 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1756 = !{!1757, !1771, !1772, !1773}
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1754, file: !1755, line: 76, baseType: !1758, size: 64)
!1758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1759, size: 64)
!1759 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1755, line: 68, baseType: !1760)
!1760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1755, line: 63, size: 320, elements: !1761)
!1761 = !{!1762, !1764, !1765, !1766}
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1760, file: !1755, line: 64, baseType: !1763, size: 64)
!1763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1760, size: 64)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1760, file: !1755, line: 65, baseType: !1763, size: 64, offset: 64)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1760, file: !1755, line: 66, baseType: !7, size: 32, offset: 128)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1760, file: !1755, line: 67, baseType: !1767, size: 128, offset: 192)
!1767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1768, size: 128, elements: !1769)
!1768 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1755, line: 29, baseType: !1580)
!1769 = !{!1770}
!1770 = !DISubrange(count: 2)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1754, file: !1755, line: 77, baseType: !1758, size: 64, offset: 64)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1754, file: !1755, line: 78, baseType: !7, size: 32, offset: 128)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1754, file: !1755, line: 79, baseType: !1774, size: 64, offset: 192)
!1774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1775, size: 64)
!1775 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1755, line: 49, baseType: !1776)
!1776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1755, line: 45, size: 832, elements: !1777)
!1777 = !{!1778, !1779, !1780}
!1778 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1776, file: !1755, line: 46, baseType: !1763, size: 64)
!1779 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1776, file: !1755, line: 47, baseType: !1753, size: 64, offset: 64)
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1776, file: !1755, line: 48, baseType: !1781, size: 704, offset: 128)
!1781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1782, line: 164, size: 704, elements: !1783)
!1782 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1783 = !{!1784, !1785, !1795, !1796, !1797, !1798, !1799, !1800, !1804, !1808, !1809, !1810, !1811}
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1781, file: !1782, line: 166, baseType: !1582, size: 64)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1781, file: !1782, line: 167, baseType: !1786, size: 64, offset: 64)
!1786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1787, size: 64)
!1787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1782, line: 157, size: 192, elements: !1788)
!1788 = !{!1789, !1790, !1791}
!1789 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1787, file: !1782, line: 159, baseType: !1522, size: 64)
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1787, file: !1782, line: 160, baseType: !1786, size: 64, offset: 64)
!1791 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1787, file: !1782, line: 161, baseType: !1792, size: 32, offset: 128)
!1792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1523, size: 32, elements: !1793)
!1793 = !{!1794}
!1794 = !DISubrange(count: 4)
!1795 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1781, file: !1782, line: 168, baseType: !1522, size: 64, offset: 128)
!1796 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1781, file: !1782, line: 169, baseType: !1522, size: 64, offset: 192)
!1797 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1781, file: !1782, line: 170, baseType: !1522, size: 64, offset: 256)
!1798 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1781, file: !1782, line: 171, baseType: !1582, size: 64, offset: 320)
!1799 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1781, file: !1782, line: 172, baseType: !1520, size: 32, offset: 384)
!1800 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1781, file: !1782, line: 176, baseType: !1801, size: 64, offset: 448)
!1801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1802, size: 64)
!1802 = !DISubroutineType(types: !1803)
!1803 = !{!1786, !1524, !1582}
!1804 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1781, file: !1782, line: 177, baseType: !1805, size: 64, offset: 512)
!1805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1806, size: 64)
!1806 = !DISubroutineType(types: !1807)
!1807 = !{null, !1524, !1786}
!1808 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1781, file: !1782, line: 178, baseType: !1524, size: 64, offset: 576)
!1809 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1781, file: !1782, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1810 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1781, file: !1782, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1811 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1781, file: !1782, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1812 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !1722, file: !1704, line: 177, baseType: !1527, size: 64)
!1813 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !1722, file: !1704, line: 178, baseType: !1814, size: 64)
!1814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1815, size: 64)
!1815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !335, line: 217, size: 832, elements: !1816)
!1816 = !{!1817, !2064, !2065, !2066, !2069, !2073, !2074, !2075, !2093, !2094, !2095, !2096, !2097, !2098}
!1817 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1815, file: !335, line: 219, baseType: !1818, size: 64)
!1818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1819, size: 64)
!1819 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !335, line: 151, baseType: !1820)
!1820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !335, line: 151, size: 128, elements: !1821)
!1821 = !{!1822}
!1822 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1820, file: !335, line: 151, baseType: !1823, size: 128)
!1823 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !335, line: 150, baseType: !1824)
!1824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !335, line: 150, size: 128, elements: !1825)
!1825 = !{!1826, !1827, !1828}
!1826 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1824, file: !335, line: 150, baseType: !7, size: 32)
!1827 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1824, file: !335, line: 150, baseType: !7, size: 32, offset: 32)
!1828 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1824, file: !335, line: 150, baseType: !1829, size: 64, offset: 64)
!1829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1830, size: 64, elements: !1625)
!1830 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !1508, line: 108, baseType: !1831)
!1831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1832, size: 64)
!1832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !335, line: 122, size: 512, elements: !1833)
!1833 = !{!1834, !1835, !1836, !2056, !2057, !2058, !2059, !2060, !2061, !2062}
!1834 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1832, file: !335, line: 124, baseType: !1814, size: 64)
!1835 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1832, file: !335, line: 125, baseType: !1814, size: 64, offset: 64)
!1836 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1832, file: !335, line: 131, baseType: !1837, size: 64, offset: 128)
!1837 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !335, line: 128, size: 64, elements: !1838)
!1838 = !{!1839, !2055}
!1839 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1837, file: !335, line: 129, baseType: !1840, size: 64)
!1840 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !1508, line: 66, baseType: !1841)
!1841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1842, size: 64)
!1842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !1843, line: 143, size: 192, elements: !1844)
!1843 = !DIFile(filename: "./gimple.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1844 = !{!1845, !2053, !2054}
!1845 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1842, file: !1843, line: 145, baseType: !1846, size: 64)
!1846 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !1508, line: 69, baseType: !1847)
!1847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1848, size: 64)
!1848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !1843, line: 136, size: 192, elements: !1849)
!1849 = !{!1850, !2051, !2052}
!1850 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1848, file: !1843, line: 137, baseType: !1851, size: 64)
!1851 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !1508, line: 58, baseType: !1852)
!1852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1853, size: 64)
!1853 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !1843, line: 737, size: 768, elements: !1854)
!1854 = !{!1855, !1872, !1906, !1912, !1917, !1922, !1929, !1935, !1941, !1946, !1960, !1965, !1971, !1976, !1986, !1991, !2009, !2016, !2023, !2029, !2034, !2040, !2046}
!1855 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1853, file: !1843, line: 738, baseType: !1856, size: 256)
!1856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !1843, line: 271, size: 256, elements: !1857)
!1857 = !{!1858, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1871}
!1858 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1856, file: !1843, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1859 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !1856, file: !1843, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1860 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1856, file: !1843, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1861 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !1856, file: !1843, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1862 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !1856, file: !1843, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1863 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !1856, file: !1843, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1864 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !1856, file: !1843, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!1865 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1856, file: !1843, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!1866 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !1856, file: !1843, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1867 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1856, file: !1843, line: 312, baseType: !7, size: 32, offset: 32)
!1868 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !1856, file: !1843, line: 316, baseType: !1651, size: 32, offset: 64)
!1869 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !1856, file: !1843, line: 319, baseType: !7, size: 32, offset: 96)
!1870 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1856, file: !1843, line: 323, baseType: !1814, size: 64, offset: 128)
!1871 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1856, file: !1843, line: 327, baseType: !1527, size: 64, offset: 192)
!1872 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !1853, file: !1843, line: 739, baseType: !1873, size: 448)
!1873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !1843, line: 350, size: 448, elements: !1874)
!1874 = !{!1875, !1904}
!1875 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1873, file: !1843, line: 353, baseType: !1876, size: 384)
!1876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !1843, line: 333, size: 384, elements: !1877)
!1877 = !{!1878, !1879, !1887}
!1878 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1876, file: !1843, line: 336, baseType: !1856, size: 256)
!1879 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !1876, file: !1843, line: 343, baseType: !1880, size: 64, offset: 256)
!1880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1881, size: 64)
!1881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1882, line: 37, size: 128, elements: !1883)
!1882 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1883 = !{!1884, !1885}
!1884 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1881, file: !1882, line: 39, baseType: !1880, size: 64)
!1885 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1881, file: !1882, line: 40, baseType: !1886, size: 64, offset: 64)
!1886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1527, size: 64)
!1887 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !1876, file: !1843, line: 344, baseType: !1888, size: 64, offset: 320)
!1888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1889, size: 64)
!1889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1882, line: 45, size: 320, elements: !1890)
!1890 = !{!1891, !1892}
!1891 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1889, file: !1882, line: 47, baseType: !1888, size: 64)
!1892 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1889, file: !1882, line: 48, baseType: !1893, size: 256, offset: 64)
!1893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !140, line: 1883, size: 256, elements: !1894)
!1894 = !{!1895, !1897, !1898, !1903}
!1895 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1893, file: !140, line: 1884, baseType: !1896, size: 64)
!1896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1893, size: 64)
!1897 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1893, file: !140, line: 1885, baseType: !1896, size: 64, offset: 64)
!1898 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1893, file: !140, line: 1891, baseType: !1899, size: 64, offset: 128)
!1899 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1893, file: !140, line: 1891, size: 64, elements: !1900)
!1900 = !{!1901, !1902}
!1901 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1899, file: !140, line: 1891, baseType: !1851, size: 64)
!1902 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1899, file: !140, line: 1891, baseType: !1527, size: 64)
!1903 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1893, file: !140, line: 1892, baseType: !1886, size: 64, offset: 192)
!1904 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1873, file: !1843, line: 359, baseType: !1905, size: 64, offset: 384)
!1905 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1527, size: 64, elements: !1625)
!1906 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !1853, file: !1843, line: 740, baseType: !1907, size: 512)
!1907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !1843, line: 365, size: 512, elements: !1908)
!1908 = !{!1909, !1910, !1911}
!1909 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1907, file: !1843, line: 368, baseType: !1876, size: 384)
!1910 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1907, file: !1843, line: 373, baseType: !1527, size: 64, offset: 384)
!1911 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1907, file: !1843, line: 374, baseType: !1527, size: 64, offset: 448)
!1912 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !1853, file: !1843, line: 741, baseType: !1913, size: 576)
!1913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !1843, line: 380, size: 576, elements: !1914)
!1914 = !{!1915, !1916}
!1915 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1913, file: !1843, line: 383, baseType: !1907, size: 512)
!1916 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1913, file: !1843, line: 389, baseType: !1905, size: 64, offset: 512)
!1917 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1853, file: !1843, line: 742, baseType: !1918, size: 320)
!1918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !1843, line: 395, size: 320, elements: !1919)
!1919 = !{!1920, !1921}
!1920 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1918, file: !1843, line: 397, baseType: !1856, size: 256)
!1921 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1918, file: !1843, line: 400, baseType: !1840, size: 64, offset: 256)
!1922 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !1853, file: !1843, line: 743, baseType: !1923, size: 448)
!1923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !1843, line: 406, size: 448, elements: !1924)
!1924 = !{!1925, !1926, !1927, !1928}
!1925 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1923, file: !1843, line: 408, baseType: !1856, size: 256)
!1926 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1923, file: !1843, line: 412, baseType: !1527, size: 64, offset: 256)
!1927 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1923, file: !1843, line: 420, baseType: !1527, size: 64, offset: 320)
!1928 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1923, file: !1843, line: 423, baseType: !1840, size: 64, offset: 384)
!1929 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !1853, file: !1843, line: 744, baseType: !1930, size: 384)
!1930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !1843, line: 429, size: 384, elements: !1931)
!1931 = !{!1932, !1933, !1934}
!1932 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1930, file: !1843, line: 431, baseType: !1856, size: 256)
!1933 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1930, file: !1843, line: 434, baseType: !1527, size: 64, offset: 256)
!1934 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1930, file: !1843, line: 437, baseType: !1840, size: 64, offset: 320)
!1935 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !1853, file: !1843, line: 745, baseType: !1936, size: 384)
!1936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !1843, line: 443, size: 384, elements: !1937)
!1937 = !{!1938, !1939, !1940}
!1938 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1936, file: !1843, line: 445, baseType: !1856, size: 256)
!1939 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1936, file: !1843, line: 449, baseType: !1527, size: 64, offset: 256)
!1940 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1936, file: !1843, line: 453, baseType: !1840, size: 64, offset: 320)
!1941 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !1853, file: !1843, line: 746, baseType: !1942, size: 320)
!1942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !1843, line: 459, size: 320, elements: !1943)
!1943 = !{!1944, !1945}
!1944 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1942, file: !1843, line: 461, baseType: !1856, size: 256)
!1945 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1942, file: !1843, line: 464, baseType: !1527, size: 64, offset: 256)
!1946 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !1853, file: !1843, line: 747, baseType: !1947, size: 768)
!1947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !1843, line: 469, size: 768, elements: !1948)
!1948 = !{!1949, !1950, !1951, !1952, !1953}
!1949 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1947, file: !1843, line: 471, baseType: !1856, size: 256)
!1950 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1947, file: !1843, line: 474, baseType: !7, size: 32, offset: 256)
!1951 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1947, file: !1843, line: 475, baseType: !7, size: 32, offset: 288)
!1952 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1947, file: !1843, line: 478, baseType: !1527, size: 64, offset: 320)
!1953 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1947, file: !1843, line: 481, baseType: !1954, size: 384, offset: 384)
!1954 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1955, size: 384, elements: !1625)
!1955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !140, line: 1917, size: 384, elements: !1956)
!1956 = !{!1957, !1958, !1959}
!1957 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1955, file: !140, line: 1920, baseType: !1893, size: 256)
!1958 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1955, file: !140, line: 1921, baseType: !1527, size: 64, offset: 256)
!1959 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1955, file: !140, line: 1922, baseType: !1651, size: 32, offset: 320)
!1960 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !1853, file: !1843, line: 748, baseType: !1961, size: 320)
!1961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !1843, line: 487, size: 320, elements: !1962)
!1962 = !{!1963, !1964}
!1963 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1961, file: !1843, line: 490, baseType: !1856, size: 256)
!1964 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1961, file: !1843, line: 494, baseType: !1520, size: 32, offset: 256)
!1965 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !1853, file: !1843, line: 749, baseType: !1966, size: 384)
!1966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !1843, line: 500, size: 384, elements: !1967)
!1967 = !{!1968, !1969, !1970}
!1968 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1966, file: !1843, line: 502, baseType: !1856, size: 256)
!1969 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1966, file: !1843, line: 506, baseType: !1840, size: 64, offset: 256)
!1970 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1966, file: !1843, line: 510, baseType: !1840, size: 64, offset: 320)
!1971 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !1853, file: !1843, line: 750, baseType: !1972, size: 320)
!1972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !1843, line: 529, size: 320, elements: !1973)
!1973 = !{!1974, !1975}
!1974 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1972, file: !1843, line: 531, baseType: !1856, size: 256)
!1975 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1972, file: !1843, line: 540, baseType: !1840, size: 64, offset: 256)
!1976 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !1853, file: !1843, line: 751, baseType: !1977, size: 704)
!1977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !1843, line: 546, size: 704, elements: !1978)
!1978 = !{!1979, !1980, !1981, !1982, !1983, !1984, !1985}
!1979 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1977, file: !1843, line: 549, baseType: !1907, size: 512)
!1980 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1977, file: !1843, line: 553, baseType: !1525, size: 64, offset: 512)
!1981 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1977, file: !1843, line: 557, baseType: !1519, size: 8, offset: 576)
!1982 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1977, file: !1843, line: 558, baseType: !1519, size: 8, offset: 584)
!1983 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1977, file: !1843, line: 559, baseType: !1519, size: 8, offset: 592)
!1984 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1977, file: !1843, line: 560, baseType: !1519, size: 8, offset: 600)
!1985 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1977, file: !1843, line: 566, baseType: !1905, size: 64, offset: 640)
!1986 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !1853, file: !1843, line: 752, baseType: !1987, size: 384)
!1987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !1843, line: 571, size: 384, elements: !1988)
!1988 = !{!1989, !1990}
!1989 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1987, file: !1843, line: 573, baseType: !1918, size: 320)
!1990 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1987, file: !1843, line: 577, baseType: !1527, size: 64, offset: 320)
!1991 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !1853, file: !1843, line: 753, baseType: !1992, size: 576)
!1992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !1843, line: 600, size: 576, elements: !1993)
!1993 = !{!1994, !1995, !1996, !1999, !2008}
!1994 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1992, file: !1843, line: 602, baseType: !1918, size: 320)
!1995 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1992, file: !1843, line: 605, baseType: !1527, size: 64, offset: 320)
!1996 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1992, file: !1843, line: 609, baseType: !1997, size: 64, offset: 384)
!1997 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1998, line: 46, baseType: !1580)
!1998 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1999 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1992, file: !1843, line: 612, baseType: !2000, size: 64, offset: 448)
!2000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2001, size: 64)
!2001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !1843, line: 581, size: 320, elements: !2002)
!2002 = !{!2003, !2004, !2005, !2006, !2007}
!2003 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !2001, file: !1843, line: 583, baseType: !139, size: 32)
!2004 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !2001, file: !1843, line: 586, baseType: !1527, size: 64, offset: 64)
!2005 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !2001, file: !1843, line: 589, baseType: !1527, size: 64, offset: 128)
!2006 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !2001, file: !1843, line: 592, baseType: !1527, size: 64, offset: 192)
!2007 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !2001, file: !1843, line: 595, baseType: !1527, size: 64, offset: 256)
!2008 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1992, file: !1843, line: 616, baseType: !1840, size: 64, offset: 512)
!2009 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !1853, file: !1843, line: 754, baseType: !2010, size: 512)
!2010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !1843, line: 622, size: 512, elements: !2011)
!2011 = !{!2012, !2013, !2014, !2015}
!2012 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !2010, file: !1843, line: 624, baseType: !1918, size: 320)
!2013 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !2010, file: !1843, line: 628, baseType: !1527, size: 64, offset: 320)
!2014 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !2010, file: !1843, line: 632, baseType: !1527, size: 64, offset: 384)
!2015 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !2010, file: !1843, line: 636, baseType: !1527, size: 64, offset: 448)
!2016 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !1853, file: !1843, line: 755, baseType: !2017, size: 704)
!2017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !1843, line: 642, size: 704, elements: !2018)
!2018 = !{!2019, !2020, !2021, !2022}
!2019 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !2017, file: !1843, line: 644, baseType: !2010, size: 512)
!2020 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !2017, file: !1843, line: 648, baseType: !1527, size: 64, offset: 512)
!2021 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !2017, file: !1843, line: 652, baseType: !1527, size: 64, offset: 576)
!2022 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !2017, file: !1843, line: 653, baseType: !1527, size: 64, offset: 640)
!2023 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !1853, file: !1843, line: 756, baseType: !2024, size: 448)
!2024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !1843, line: 663, size: 448, elements: !2025)
!2025 = !{!2026, !2027, !2028}
!2026 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !2024, file: !1843, line: 665, baseType: !1918, size: 320)
!2027 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !2024, file: !1843, line: 668, baseType: !1527, size: 64, offset: 320)
!2028 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !2024, file: !1843, line: 673, baseType: !1527, size: 64, offset: 384)
!2029 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !1853, file: !1843, line: 757, baseType: !2030, size: 384)
!2030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !1843, line: 694, size: 384, elements: !2031)
!2031 = !{!2032, !2033}
!2032 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !2030, file: !1843, line: 696, baseType: !1918, size: 320)
!2033 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !2030, file: !1843, line: 699, baseType: !1527, size: 64, offset: 320)
!2034 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !1853, file: !1843, line: 758, baseType: !2035, size: 384)
!2035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !1843, line: 681, size: 384, elements: !2036)
!2036 = !{!2037, !2038, !2039}
!2037 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2035, file: !1843, line: 683, baseType: !1856, size: 256)
!2038 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !2035, file: !1843, line: 686, baseType: !1527, size: 64, offset: 256)
!2039 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !2035, file: !1843, line: 689, baseType: !1527, size: 64, offset: 320)
!2040 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !1853, file: !1843, line: 759, baseType: !2041, size: 384)
!2041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !1843, line: 707, size: 384, elements: !2042)
!2042 = !{!2043, !2044, !2045}
!2043 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2041, file: !1843, line: 709, baseType: !1856, size: 256)
!2044 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !2041, file: !1843, line: 712, baseType: !1527, size: 64, offset: 256)
!2045 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !2041, file: !1843, line: 712, baseType: !1527, size: 64, offset: 320)
!2046 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !1853, file: !1843, line: 760, baseType: !2047, size: 320)
!2047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !1843, line: 718, size: 320, elements: !2048)
!2048 = !{!2049, !2050}
!2049 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2047, file: !1843, line: 720, baseType: !1856, size: 256)
!2050 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !2047, file: !1843, line: 723, baseType: !1527, size: 64, offset: 256)
!2051 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1848, file: !1843, line: 138, baseType: !1847, size: 64, offset: 64)
!2052 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1848, file: !1843, line: 139, baseType: !1847, size: 64, offset: 128)
!2053 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1842, file: !1843, line: 146, baseType: !1846, size: 64, offset: 64)
!2054 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1842, file: !1843, line: 152, baseType: !1840, size: 64, offset: 128)
!2055 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1837, file: !335, line: 130, baseType: !1701, size: 64)
!2056 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1832, file: !335, line: 134, baseType: !1524, size: 64, offset: 192)
!2057 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1832, file: !335, line: 137, baseType: !1527, size: 64, offset: 256)
!2058 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1832, file: !335, line: 138, baseType: !1651, size: 32, offset: 320)
!2059 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1832, file: !335, line: 142, baseType: !7, size: 32, offset: 352)
!2060 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1832, file: !335, line: 144, baseType: !1520, size: 32, offset: 384)
!2061 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1832, file: !335, line: 145, baseType: !1520, size: 32, offset: 416)
!2062 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1832, file: !335, line: 146, baseType: !2063, size: 64, offset: 448)
!2063 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !335, line: 119, baseType: !1582)
!2064 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1815, file: !335, line: 220, baseType: !1818, size: 64, offset: 64)
!2065 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1815, file: !335, line: 223, baseType: !1524, size: 64, offset: 128)
!2066 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1815, file: !335, line: 226, baseType: !2067, size: 64, offset: 192)
!2067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2068, size: 64)
!2068 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !335, line: 185, flags: DIFlagFwdDecl)
!2069 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1815, file: !335, line: 229, baseType: !2070, size: 128, offset: 256)
!2070 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2071, size: 128, elements: !1769)
!2071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2072, size: 64)
!2072 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !335, line: 229, flags: DIFlagFwdDecl)
!2073 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1815, file: !335, line: 232, baseType: !1814, size: 64, offset: 384)
!2074 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1815, file: !335, line: 233, baseType: !1814, size: 64, offset: 448)
!2075 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1815, file: !335, line: 238, baseType: !2076, size: 64, offset: 512)
!2076 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !335, line: 235, size: 64, elements: !2077)
!2077 = !{!2078, !2084}
!2078 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !2076, file: !335, line: 236, baseType: !2079, size: 64)
!2079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2080, size: 64)
!2080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !335, line: 273, size: 128, elements: !2081)
!2081 = !{!2082, !2083}
!2082 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !2080, file: !335, line: 275, baseType: !1840, size: 64)
!2083 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !2080, file: !335, line: 278, baseType: !1840, size: 64, offset: 64)
!2084 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !2076, file: !335, line: 237, baseType: !2085, size: 64)
!2085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2086, size: 64)
!2086 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !335, line: 259, size: 320, elements: !2087)
!2087 = !{!2088, !2089, !2090, !2091, !2092}
!2088 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !2086, file: !335, line: 261, baseType: !1701, size: 64)
!2089 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !2086, file: !335, line: 262, baseType: !1701, size: 64, offset: 64)
!2090 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !2086, file: !335, line: 266, baseType: !1701, size: 64, offset: 128)
!2091 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !2086, file: !335, line: 267, baseType: !1701, size: 64, offset: 192)
!2092 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !2086, file: !335, line: 270, baseType: !1520, size: 32, offset: 256)
!2093 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1815, file: !335, line: 241, baseType: !2063, size: 64, offset: 576)
!2094 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1815, file: !335, line: 244, baseType: !1520, size: 32, offset: 640)
!2095 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1815, file: !335, line: 247, baseType: !1520, size: 32, offset: 672)
!2096 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1815, file: !335, line: 250, baseType: !1520, size: 32, offset: 704)
!2097 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1815, file: !335, line: 253, baseType: !1520, size: 32, offset: 736)
!2098 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1815, file: !335, line: 256, baseType: !1520, size: 32, offset: 768)
!2099 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !1722, file: !1704, line: 179, baseType: !2100, size: 64)
!2100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2101, size: 64)
!2101 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !1704, line: 150, baseType: !2102)
!2102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !1704, line: 142, size: 320, elements: !2103)
!2103 = !{!2104, !2105, !2106, !2107, !2110, !2111}
!2104 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !2102, file: !1704, line: 144, baseType: !1527, size: 64)
!2105 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2102, file: !1704, line: 145, baseType: !1701, size: 64, offset: 64)
!2106 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2102, file: !1704, line: 146, baseType: !1701, size: 64, offset: 128)
!2107 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !2102, file: !1704, line: 147, baseType: !2108, size: 32, offset: 192)
!2108 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !2109, line: 31, baseType: !1520)
!2109 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2110 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !2102, file: !1704, line: 148, baseType: !7, size: 32, offset: 224)
!2111 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !2102, file: !1704, line: 149, baseType: !1519, size: 8, offset: 256)
!2112 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !1722, file: !1704, line: 180, baseType: !2113, size: 64)
!2113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2114, size: 64)
!2114 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !1704, line: 162, baseType: !2115)
!2115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !1704, line: 159, size: 128, elements: !2116)
!2116 = !{!2117, !2118}
!2117 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !2115, file: !1704, line: 160, baseType: !1527, size: 64)
!2118 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2115, file: !1704, line: 161, baseType: !1582, size: 64, offset: 64)
!2119 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !1722, file: !1704, line: 181, baseType: !2120, size: 64)
!2120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2121, size: 64)
!2121 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !1704, line: 181, flags: DIFlagFwdDecl)
!2122 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !1717, file: !1704, line: 317, baseType: !2123, size: 64)
!2123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1582, size: 64, elements: !1625)
!2124 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !1717, file: !1704, line: 318, baseType: !2125, size: 320)
!2125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !1704, line: 188, size: 320, elements: !2126)
!2126 = !{!2127, !2129, !2186}
!2127 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !2125, file: !1704, line: 190, baseType: !2128, size: 192)
!2128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1721, size: 192, elements: !1600)
!2129 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !2125, file: !1704, line: 193, baseType: !2130, size: 64, offset: 192)
!2130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2131, size: 64)
!2131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !1704, line: 206, size: 320, elements: !2132)
!2132 = !{!2133, !2171, !2172, !2173, !2185}
!2133 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !2131, file: !1704, line: 208, baseType: !2134, size: 64)
!2134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2135, size: 64)
!2135 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !1508, line: 62, baseType: !2136)
!2136 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !2137, line: 538, size: 256, elements: !2138)
!2137 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2138 = !{!2139, !2143, !2149, !2162}
!2139 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2136, file: !2137, line: 539, baseType: !2140, size: 32)
!2140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !2137, line: 482, size: 32, elements: !2141)
!2141 = !{!2142}
!2142 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !2140, file: !2137, line: 484, baseType: !7, size: 32)
!2143 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !2136, file: !2137, line: 540, baseType: !2144, size: 192)
!2144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !2137, line: 488, size: 192, elements: !2145)
!2145 = !{!2146, !2147, !2148}
!2146 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2144, file: !2137, line: 489, baseType: !2140, size: 32)
!2147 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2144, file: !2137, line: 492, baseType: !1525, size: 64, offset: 64)
!2148 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !2144, file: !2137, line: 496, baseType: !1527, size: 64, offset: 128)
!2149 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !2136, file: !2137, line: 541, baseType: !2150, size: 256)
!2150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !2137, line: 504, size: 256, elements: !2151)
!2151 = !{!2152, !2153, !2160, !2161}
!2152 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2150, file: !2137, line: 505, baseType: !2140, size: 32)
!2153 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !2150, file: !2137, line: 509, baseType: !2154, size: 64, offset: 64)
!2154 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !2137, line: 501, baseType: !2155)
!2155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2156, size: 64)
!2156 = !DISubroutineType(types: !2157)
!2157 = !{null, !2158}
!2158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2159, size: 64)
!2159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!2160 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !2150, file: !2137, line: 510, baseType: !2158, size: 64, offset: 128)
!2161 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2150, file: !2137, line: 513, baseType: !2134, size: 64, offset: 192)
!2162 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !2136, file: !2137, line: 542, baseType: !2163, size: 128)
!2163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !2137, line: 530, size: 128, elements: !2164)
!2164 = !{!2165, !2166}
!2165 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2163, file: !2137, line: 531, baseType: !2140, size: 32)
!2166 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !2163, file: !2137, line: 534, baseType: !2167, size: 64, offset: 64)
!2167 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !2137, line: 525, baseType: !2168)
!2168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2169, size: 64)
!2169 = !DISubroutineType(types: !2170)
!2170 = !{!1519, !1527, !1525, !1580, !1580}
!2171 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !2131, file: !1704, line: 211, baseType: !7, size: 32, offset: 64)
!2172 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2131, file: !1704, line: 214, baseType: !1582, size: 64, offset: 128)
!2173 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !2131, file: !1704, line: 224, baseType: !2174, size: 64, offset: 192)
!2174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2175, size: 64)
!2175 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !1704, line: 202, baseType: !2176)
!2176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !1704, line: 202, size: 128, elements: !2177)
!2177 = !{!2178}
!2178 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2176, file: !1704, line: 202, baseType: !2179, size: 128)
!2179 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !1704, line: 200, baseType: !2180)
!2180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !1704, line: 200, size: 128, elements: !2181)
!2181 = !{!2182, !2183, !2184}
!2182 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2180, file: !1704, line: 200, baseType: !7, size: 32)
!2183 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2180, file: !1704, line: 200, baseType: !7, size: 32, offset: 32)
!2184 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2180, file: !1704, line: 200, baseType: !1735, size: 64, offset: 64)
!2185 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !2131, file: !1704, line: 234, baseType: !2174, size: 64, offset: 256)
!2186 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2125, file: !1704, line: 197, baseType: !1582, size: 64, offset: 256)
!2187 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !1717, file: !1704, line: 319, baseType: !1589, size: 256)
!2188 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !1717, file: !1704, line: 320, baseType: !1608, size: 192)
!2189 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !1529, file: !140, line: 3384, baseType: !2190, size: 1472)
!2190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !140, line: 3114, size: 1472, elements: !2191)
!2191 = !{!2192, !2213, !2214, !2215, !2216}
!2192 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2190, file: !140, line: 3115, baseType: !2193, size: 1216)
!2193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !140, line: 2984, size: 1216, elements: !2194)
!2194 = !{!2195, !2196, !2197, !2198, !2199, !2200, !2201, !2202, !2203, !2204, !2205, !2206, !2207, !2208, !2209, !2210, !2211, !2212}
!2195 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2193, file: !140, line: 2985, baseType: !1697, size: 960)
!2196 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !2193, file: !140, line: 2986, baseType: !1527, size: 64, offset: 960)
!2197 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !2193, file: !140, line: 2987, baseType: !1527, size: 64, offset: 1024)
!2198 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !2193, file: !140, line: 2988, baseType: !1527, size: 64, offset: 1088)
!2199 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !2193, file: !140, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!2200 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !2193, file: !140, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!2201 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !2193, file: !140, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!2202 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !2193, file: !140, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!2203 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !2193, file: !140, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!2204 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !2193, file: !140, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!2205 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !2193, file: !140, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!2206 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !2193, file: !140, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!2207 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !2193, file: !140, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!2208 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !2193, file: !140, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!2209 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !2193, file: !140, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!2210 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !2193, file: !140, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!2211 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !2193, file: !140, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!2212 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !2193, file: !140, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!2213 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !2190, file: !140, line: 3117, baseType: !1527, size: 64, offset: 1216)
!2214 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !2190, file: !140, line: 3119, baseType: !1527, size: 64, offset: 1280)
!2215 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !2190, file: !140, line: 3121, baseType: !1527, size: 64, offset: 1344)
!2216 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !2190, file: !140, line: 3123, baseType: !1527, size: 64, offset: 1408)
!2217 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !1529, file: !140, line: 3385, baseType: !2218, size: 1088)
!2218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !140, line: 2874, size: 1088, elements: !2219)
!2219 = !{!2220, !2221, !2222}
!2220 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2218, file: !140, line: 2875, baseType: !1697, size: 960)
!2221 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !2218, file: !140, line: 2876, baseType: !1701, size: 64, offset: 960)
!2222 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2218, file: !140, line: 2877, baseType: !2223, size: 64, offset: 1024)
!2223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2224, size: 64)
!2224 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !140, line: 2856, flags: DIFlagFwdDecl)
!2225 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !1529, file: !140, line: 3386, baseType: !2193, size: 1216)
!2226 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !1529, file: !140, line: 3387, baseType: !2227, size: 1280)
!2227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !140, line: 3093, size: 1280, elements: !2228)
!2228 = !{!2229, !2230}
!2229 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2227, file: !140, line: 3094, baseType: !2193, size: 1216)
!2230 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2227, file: !140, line: 3095, baseType: !2223, size: 64, offset: 1216)
!2231 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !1529, file: !140, line: 3388, baseType: !2232, size: 1216)
!2232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !140, line: 2824, size: 1216, elements: !2233)
!2233 = !{!2234, !2235, !2236, !2237, !2238, !2239}
!2234 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2232, file: !140, line: 2825, baseType: !1659, size: 896)
!2235 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2232, file: !140, line: 2827, baseType: !1527, size: 64, offset: 896)
!2236 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !2232, file: !140, line: 2828, baseType: !1527, size: 64, offset: 960)
!2237 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !2232, file: !140, line: 2829, baseType: !1527, size: 64, offset: 1024)
!2238 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !2232, file: !140, line: 2830, baseType: !1527, size: 64, offset: 1088)
!2239 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !2232, file: !140, line: 2831, baseType: !1527, size: 64, offset: 1152)
!2240 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !1529, file: !140, line: 3389, baseType: !2241, size: 1024)
!2241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !140, line: 2850, size: 1024, elements: !2242)
!2242 = !{!2243, !2244, !2245}
!2243 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2241, file: !140, line: 2851, baseType: !1697, size: 960)
!2244 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !2241, file: !140, line: 2852, baseType: !1520, size: 32, offset: 960)
!2245 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !2241, file: !140, line: 2853, baseType: !1520, size: 32, offset: 992)
!2246 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !1529, file: !140, line: 3390, baseType: !2247, size: 1024)
!2247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !140, line: 2857, size: 1024, elements: !2248)
!2248 = !{!2249, !2250}
!2249 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2247, file: !140, line: 2858, baseType: !1697, size: 960)
!2250 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2247, file: !140, line: 2859, baseType: !2223, size: 64, offset: 960)
!2251 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !1529, file: !140, line: 3391, baseType: !2252, size: 960)
!2252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !140, line: 2862, size: 960, elements: !2253)
!2253 = !{!2254}
!2254 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2252, file: !140, line: 2863, baseType: !1697, size: 960)
!2255 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !1529, file: !140, line: 3392, baseType: !2256, size: 1472)
!2256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !140, line: 3304, size: 1472, elements: !2257)
!2257 = !{!2258}
!2258 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2256, file: !140, line: 3305, baseType: !2190, size: 1472)
!2259 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !1529, file: !140, line: 3393, baseType: !2260, size: 1792)
!2260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !140, line: 3248, size: 1792, elements: !2261)
!2261 = !{!2262, !2263, !2412, !2413, !2414, !2415, !2416, !2417, !2418, !2419, !2420, !2421, !2422, !2423, !2424, !2425, !2426, !2427, !2428, !2429, !2430, !2431, !2432}
!2262 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2260, file: !140, line: 3249, baseType: !2190, size: 1472)
!2263 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !2260, file: !140, line: 3251, baseType: !2264, size: 64, offset: 1472)
!2264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2265, size: 64)
!2265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !2266, line: 463, size: 1152, elements: !2267)
!2266 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2267 = !{!2268, !2271, !2302, !2303, !2306, !2309, !2357, !2358, !2359, !2360, !2361, !2385, !2388, !2389, !2390, !2391, !2392, !2393, !2394, !2395, !2396, !2397, !2398, !2399, !2400, !2401, !2402, !2403, !2404, !2405, !2406, !2407, !2408, !2409, !2410, !2411}
!2268 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !2265, file: !2266, line: 464, baseType: !2269, size: 64)
!2269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2270, size: 64)
!2270 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !2266, line: 464, flags: DIFlagFwdDecl)
!2271 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !2265, file: !2266, line: 467, baseType: !2272, size: 64, offset: 64)
!2272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2273, size: 64)
!2273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !335, line: 374, size: 640, elements: !2274)
!2274 = !{!2275, !2277, !2278, !2291, !2292, !2293, !2294, !2295, !2296, !2298, !2300, !2301}
!2275 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !2273, file: !335, line: 377, baseType: !2276, size: 64)
!2276 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !1508, line: 111, baseType: !1814)
!2277 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !2273, file: !335, line: 378, baseType: !2276, size: 64, offset: 64)
!2278 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !2273, file: !335, line: 381, baseType: !2279, size: 64, offset: 128)
!2279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2280, size: 64)
!2280 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !335, line: 282, baseType: !2281)
!2281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !335, line: 282, size: 128, elements: !2282)
!2282 = !{!2283}
!2283 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2281, file: !335, line: 282, baseType: !2284, size: 128)
!2284 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !335, line: 281, baseType: !2285)
!2285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !335, line: 281, size: 128, elements: !2286)
!2286 = !{!2287, !2288, !2289}
!2287 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2285, file: !335, line: 281, baseType: !7, size: 32)
!2288 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2285, file: !335, line: 281, baseType: !7, size: 32, offset: 32)
!2289 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2285, file: !335, line: 281, baseType: !2290, size: 64, offset: 64)
!2290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2276, size: 64, elements: !1625)
!2291 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !2273, file: !335, line: 384, baseType: !1520, size: 32, offset: 192)
!2292 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !2273, file: !335, line: 387, baseType: !1520, size: 32, offset: 224)
!2293 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !2273, file: !335, line: 390, baseType: !1520, size: 32, offset: 256)
!2294 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !2273, file: !335, line: 394, baseType: !2279, size: 64, offset: 320)
