; ModuleID = 'c-convert.bc'
source_filename = "c-convert.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }
%struct.tree_decl_minimal = type { %struct.tree_common, i32, i32, %union.tree_node*, %union.tree_node* }
%struct.tree_common = type { %struct.tree_base, %union.tree_node*, %union.tree_node* }
%struct.tree_base = type { i64 }

!178 = !DIEnumerator(name: "CASE_LABEL_EXPR", value: 139, isUnsigned: true)
!179 = !DIEnumerator(name: "ASM_EXPR", value: 140, isUnsigned: true)
!180 = !DIEnumerator(name: "SSA_NAME", value: 141, isUnsigned: true)
!181 = !DIEnumerator(name: "CATCH_EXPR", value: 142, isUnsigned: true)
!182 = !DIEnumerator(name: "EH_FILTER_EXPR", value: 143, isUnsigned: true)
!183 = !DIEnumerator(name: "SCEV_KNOWN", value: 144, isUnsigned: true)
!184 = !DIEnumerator(name: "SCEV_NOT_KNOWN", value: 145, isUnsigned: true)
!185 = !DIEnumerator(name: "POLYNOMIAL_CHREC", value: 146, isUnsigned: true)
!186 = !DIEnumerator(name: "STATEMENT_LIST", value: 147, isUnsigned: true)
!187 = !DIEnumerator(name: "ASSERT_EXPR", value: 148, isUnsigned: true)
!188 = !DIEnumerator(name: "TREE_BINFO", value: 149, isUnsigned: true)
!189 = !DIEnumerator(name: "WITH_SIZE_EXPR", value: 150, isUnsigned: true)
!190 = !DIEnumerator(name: "REALIGN_LOAD_EXPR", value: 151, isUnsigned: true)
!191 = !DIEnumerator(name: "TARGET_MEM_REF", value: 152, isUnsigned: true)
!192 = !DIEnumerator(name: "OMP_PARALLEL", value: 153, isUnsigned: true)
!193 = !DIEnumerator(name: "OMP_TASK", value: 154, isUnsigned: true)
!194 = !DIEnumerator(name: "OMP_FOR", value: 155, isUnsigned: true)
!195 = !DIEnumerator(name: "OMP_SECTIONS", value: 156, isUnsigned: true)
!196 = !DIEnumerator(name: "OMP_SINGLE", value: 157, isUnsigned: true)
!197 = !DIEnumerator(name: "OMP_SECTION", value: 158, isUnsigned: true)
!198 = !DIEnumerator(name: "OMP_MASTER", value: 159, isUnsigned: true)
!199 = !DIEnumerator(name: "OMP_ORDERED", value: 160, isUnsigned: true)
!200 = !DIEnumerator(name: "OMP_CRITICAL", value: 161, isUnsigned: true)
!201 = !DIEnumerator(name: "OMP_ATOMIC", value: 162, isUnsigned: true)
!202 = !DIEnumerator(name: "OMP_CLAUSE", value: 163, isUnsigned: true)
!203 = !DIEnumerator(name: "REDUC_MAX_EXPR", value: 164, isUnsigned: true)
!204 = !DIEnumerator(name: "REDUC_MIN_EXPR", value: 165, isUnsigned: true)
!205 = !DIEnumerator(name: "REDUC_PLUS_EXPR", value: 166, isUnsigned: true)
!206 = !DIEnumerator(name: "DOT_PROD_EXPR", value: 167, isUnsigned: true)
!207 = !DIEnumerator(name: "WIDEN_SUM_EXPR", value: 168, isUnsigned: true)
!208 = !DIEnumerator(name: "WIDEN_MULT_EXPR", value: 169, isUnsigned: true)
!209 = !DIEnumerator(name: "VEC_LSHIFT_EXPR", value: 170, isUnsigned: true)
!210 = !DIEnumerator(name: "VEC_RSHIFT_EXPR", value: 171, isUnsigned: true)
!211 = !DIEnumerator(name: "VEC_WIDEN_MULT_HI_EXPR", value: 172, isUnsigned: true)
!212 = !DIEnumerator(name: "VEC_WIDEN_MULT_LO_EXPR", value: 173, isUnsigned: true)
!213 = !DIEnumerator(name: "VEC_UNPACK_HI_EXPR", value: 174, isUnsigned: true)
!214 = !DIEnumerator(name: "VEC_UNPACK_LO_EXPR", value: 175, isUnsigned: true)
!215 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_HI_EXPR", value: 176, isUnsigned: true)
!216 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_LO_EXPR", value: 177, isUnsigned: true)
!217 = !DIEnumerator(name: "VEC_PACK_TRUNC_EXPR", value: 178, isUnsigned: true)
!218 = !DIEnumerator(name: "VEC_PACK_SAT_EXPR", value: 179, isUnsigned: true)
!219 = !DIEnumerator(name: "VEC_PACK_FIX_TRUNC_EXPR", value: 180, isUnsigned: true)
!220 = !DIEnumerator(name: "VEC_EXTRACT_EVEN_EXPR", value: 181, isUnsigned: true)
!221 = !DIEnumerator(name: "VEC_EXTRACT_ODD_EXPR", value: 182, isUnsigned: true)
!222 = !DIEnumerator(name: "VEC_INTERLEAVE_HIGH_EXPR", value: 183, isUnsigned: true)
!223 = !DIEnumerator(name: "VEC_INTERLEAVE_LOW_EXPR", value: 184, isUnsigned: true)
!224 = !DIEnumerator(name: "PREDICT_EXPR", value: 185, isUnsigned: true)
!225 = !DIEnumerator(name: "OPTIMIZATION_NODE", value: 186, isUnsigned: true)
!226 = !DIEnumerator(name: "TARGET_OPTION_NODE", value: 187, isUnsigned: true)
!227 = !DIEnumerator(name: "LAST_AND_UNUSED_TREE_CODE", value: 188, isUnsigned: true)
!228 = !DIEnumerator(name: "C_MAYBE_CONST_EXPR", value: 189, isUnsigned: true)
!229 = !DIEnumerator(name: "EXCESS_PRECISION_EXPR", value: 190, isUnsigned: true)
!230 = !DIEnumerator(name: "MAX_TREE_CODES", value: 191, isUnsigned: true)
!231 = !{!232, !233, !234, !235, !238, !239, !37, !241}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!234 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !237)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !242, line: 44, baseType: !5)
!242 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!243 = !{i32 2, !"Dwarf Version", i32 4}
!244 = !{i32 2, !"Debug Info Version", i32 3}
!245 = !{i32 1, !"wchar_size", i32 4}
!246 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!247 = distinct !DISubprogram(name: "vprintf", scope: !248, file: !248, line: 39, type: !249, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !259)
!248 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!249 = !DISubroutineType(types: !250)
!250 = !{!234, !251, !252}
!251 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !239)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, elements: !254)
!254 = !{!255, !256, !257, !258}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !253, file: !1, baseType: !5, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !253, file: !1, baseType: !5, size: 32, offset: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !253, file: !1, baseType: !238, size: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !253, file: !1, baseType: !238, size: 64, offset: 128)
!259 = !{!260, !261}
!260 = !DILocalVariable(name: "__fmt", arg: 1, scope: !247, file: !248, line: 39, type: !251)
!261 = !DILocalVariable(name: "__arg", arg: 2, scope: !247, file: !248, line: 39, type: !252)
!262 = !DILocation(line: 0, scope: !247)
!263 = !DILocation(line: 41, column: 20, scope: !247)
!264 = !DILocation(line: 41, column: 10, scope: !247)
!265 = !DILocation(line: 41, column: 3, scope: !247)
!266 = distinct !DISubprogram(name: "getchar", scope: !248, file: !248, line: 47, type: !267, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !269)
!267 = !DISubroutineType(types: !268)
!268 = !{!234}
!269 = !{}
!270 = !DILocation(line: 49, column: 16, scope: !266)
!271 = !DILocation(line: 49, column: 10, scope: !266)
!272 = !DILocation(line: 49, column: 3, scope: !266)
!273 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !248, file: !248, line: 56, type: !274, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !335)
!274 = !DISubroutineType(types: !275)
!275 = !{!234, !276}
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !278, line: 7, baseType: !279)
!278 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !280, line: 49, size: 1728, elements: !281)
!280 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!281 = !{!282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !297, !299, !300, !301, !305, !307, !309, !313, !316, !318, !321, !324, !325, !326, !330, !331}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !279, file: !280, line: 51, baseType: !234, size: 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !279, file: !280, line: 54, baseType: !236, size: 64, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !279, file: !280, line: 55, baseType: !236, size: 64, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !279, file: !280, line: 56, baseType: !236, size: 64, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !279, file: !280, line: 57, baseType: !236, size: 64, offset: 256)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !279, file: !280, line: 58, baseType: !236, size: 64, offset: 320)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !279, file: !280, line: 59, baseType: !236, size: 64, offset: 384)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !279, file: !280, line: 60, baseType: !236, size: 64, offset: 448)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !279, file: !280, line: 61, baseType: !236, size: 64, offset: 512)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !279, file: !280, line: 64, baseType: !236, size: 64, offset: 576)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !279, file: !280, line: 65, baseType: !236, size: 64, offset: 640)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !279, file: !280, line: 66, baseType: !236, size: 64, offset: 704)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !279, file: !280, line: 68, baseType: !295, size: 64, offset: 768)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !280, line: 36, flags: DIFlagFwdDecl)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !279, file: !280, line: 70, baseType: !298, size: 64, offset: 832)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !279, file: !280, line: 72, baseType: !234, size: 32, offset: 896)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !279, file: !280, line: 73, baseType: !234, size: 32, offset: 928)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !279, file: !280, line: 74, baseType: !302, size: 64, offset: 960)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !303, line: 152, baseType: !304)
!303 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!304 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !279, file: !280, line: 77, baseType: !306, size: 16, offset: 1024)
!306 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !279, file: !280, line: 78, baseType: !308, size: 8, offset: 1040)
!308 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !279, file: !280, line: 79, baseType: !310, size: 8, offset: 1048)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 8, elements: !311)
!311 = !{!312}
!312 = !DISubrange(count: 1)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !279, file: !280, line: 81, baseType: !314, size: 64, offset: 1088)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !280, line: 43, baseType: null)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !279, file: !280, line: 89, baseType: !317, size: 64, offset: 1152)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !303, line: 153, baseType: !304)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !279, file: !280, line: 91, baseType: !319, size: 64, offset: 1216)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !280, line: 37, flags: DIFlagFwdDecl)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !279, file: !280, line: 92, baseType: !322, size: 64, offset: 1280)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !280, line: 38, flags: DIFlagFwdDecl)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !279, file: !280, line: 93, baseType: !298, size: 64, offset: 1344)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !279, file: !280, line: 94, baseType: !238, size: 64, offset: 1408)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !279, file: !280, line: 95, baseType: !327, size: 64, offset: 1472)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !328, line: 46, baseType: !329)
!328 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!329 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !279, file: !280, line: 96, baseType: !234, size: 32, offset: 1536)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !279, file: !280, line: 98, baseType: !332, size: 160, offset: 1568)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 160, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 20)
!335 = !{!336}
!336 = !DILocalVariable(name: "__fp", arg: 1, scope: !273, file: !248, line: 56, type: !276)
!337 = !DILocation(line: 0, scope: !273)
!338 = !DILocation(line: 58, column: 10, scope: !273)
!339 = !DILocation(line: 58, column: 3, scope: !273)
!340 = distinct !DISubprogram(name: "getc_unlocked", scope: !248, file: !248, line: 66, type: !274, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !341)
!341 = !{!342}
!342 = !DILocalVariable(name: "__fp", arg: 1, scope: !340, file: !248, line: 66, type: !276)
!343 = !DILocation(line: 0, scope: !340)
!344 = !DILocation(line: 68, column: 10, scope: !340)
!345 = !DILocation(line: 68, column: 3, scope: !340)
!346 = distinct !DISubprogram(name: "getchar_unlocked", scope: !248, file: !248, line: 73, type: !267, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !269)
!347 = !DILocation(line: 75, column: 10, scope: !346)
!348 = !DILocation(line: 75, column: 3, scope: !346)
!349 = distinct !DISubprogram(name: "putchar", scope: !248, file: !248, line: 82, type: !350, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !352)
!350 = !DISubroutineType(types: !351)
!351 = !{!234, !234}
!352 = !{!353}
!353 = !DILocalVariable(name: "__c", arg: 1, scope: !349, file: !248, line: 82, type: !234)
!354 = !DILocation(line: 0, scope: !349)
!355 = !DILocation(line: 84, column: 21, scope: !349)
!356 = !DILocation(line: 84, column: 10, scope: !349)
!357 = !DILocation(line: 84, column: 3, scope: !349)
!358 = distinct !DISubprogram(name: "fputc_unlocked", scope: !248, file: !248, line: 91, type: !359, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !361)
!359 = !DISubroutineType(types: !360)
!360 = !{!234, !234, !276}
!361 = !{!362, !363}
!362 = !DILocalVariable(name: "__c", arg: 1, scope: !358, file: !248, line: 91, type: !234)
!363 = !DILocalVariable(name: "__stream", arg: 2, scope: !358, file: !248, line: 91, type: !276)
!364 = !DILocation(line: 0, scope: !358)
!365 = !DILocation(line: 93, column: 10, scope: !358)
!366 = !DILocation(line: 93, column: 3, scope: !358)
!367 = distinct !DISubprogram(name: "putc_unlocked", scope: !248, file: !248, line: 101, type: !359, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !368)
!368 = !{!369, !370}
!369 = !DILocalVariable(name: "__c", arg: 1, scope: !367, file: !248, line: 101, type: !234)
!370 = !DILocalVariable(name: "__stream", arg: 2, scope: !367, file: !248, line: 101, type: !276)
!371 = !DILocation(line: 0, scope: !367)
!372 = !DILocation(line: 103, column: 10, scope: !367)
!373 = !DILocation(line: 103, column: 3, scope: !367)
!374 = distinct !DISubprogram(name: "putchar_unlocked", scope: !248, file: !248, line: 108, type: !350, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !375)
!375 = !{!376}
!376 = !DILocalVariable(name: "__c", arg: 1, scope: !374, file: !248, line: 108, type: !234)
!377 = !DILocation(line: 0, scope: !374)
!378 = !DILocation(line: 110, column: 10, scope: !374)
!379 = !DILocation(line: 110, column: 3, scope: !374)
!380 = distinct !DISubprogram(name: "getline", scope: !248, file: !248, line: 118, type: !381, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !385)
!381 = !DISubroutineType(types: !382)
!382 = !{!383, !235, !384, !276}
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !303, line: 193, baseType: !304)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!385 = !{!386, !387, !388}
!386 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !380, file: !248, line: 118, type: !235)
!387 = !DILocalVariable(name: "__n", arg: 2, scope: !380, file: !248, line: 118, type: !384)
!388 = !DILocalVariable(name: "__stream", arg: 3, scope: !380, file: !248, line: 118, type: !276)
!389 = !DILocation(line: 0, scope: !380)
!390 = !DILocation(line: 120, column: 10, scope: !380)
!391 = !DILocation(line: 120, column: 3, scope: !380)
!392 = distinct !DISubprogram(name: "feof_unlocked", scope: !248, file: !248, line: 128, type: !274, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !393)
!393 = !{!394}
!394 = !DILocalVariable(name: "__stream", arg: 1, scope: !392, file: !248, line: 128, type: !276)
!395 = !DILocation(line: 0, scope: !392)
!396 = !DILocation(line: 130, column: 10, scope: !392)
!397 = !DILocation(line: 130, column: 3, scope: !392)
!398 = distinct !DISubprogram(name: "ferror_unlocked", scope: !248, file: !248, line: 135, type: !274, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !399)
!399 = !{!400}
!400 = !DILocalVariable(name: "__stream", arg: 1, scope: !398, file: !248, line: 135, type: !276)
!401 = !DILocation(line: 0, scope: !398)
!402 = !DILocation(line: 137, column: 10, scope: !398)
!403 = !DILocation(line: 137, column: 3, scope: !398)
!404 = distinct !DISubprogram(name: "tolower", scope: !405, file: !405, line: 207, type: !350, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !406)
!405 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!406 = !{!407}
!407 = !DILocalVariable(name: "__c", arg: 1, scope: !404, file: !405, line: 207, type: !234)
!408 = !DILocation(line: 0, scope: !404)
!409 = !DILocation(line: 209, column: 22, scope: !404)
!410 = !DILocation(line: 209, column: 39, scope: !404)
!411 = !DILocation(line: 209, column: 38, scope: !404)
!412 = !DILocation(line: 209, column: 37, scope: !404)
!413 = !DILocation(line: 209, column: 10, scope: !404)
!414 = !DILocation(line: 209, column: 3, scope: !404)
!415 = distinct !DISubprogram(name: "toupper", scope: !405, file: !405, line: 213, type: !350, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !416)
!416 = !{!417}
!417 = !DILocalVariable(name: "__c", arg: 1, scope: !415, file: !405, line: 213, type: !234)
!418 = !DILocation(line: 0, scope: !415)
!419 = !DILocation(line: 215, column: 22, scope: !415)
!420 = !DILocation(line: 215, column: 39, scope: !415)
!421 = !DILocation(line: 215, column: 38, scope: !415)
!422 = !DILocation(line: 215, column: 37, scope: !415)
!423 = !DILocation(line: 215, column: 10, scope: !415)
!424 = !DILocation(line: 215, column: 3, scope: !415)
!425 = distinct !DISubprogram(name: "atoi", scope: !426, file: !426, line: 361, type: !427, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !429)
!426 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!427 = !DISubroutineType(types: !428)
!428 = !{!234, !239}
!429 = !{!430}
!430 = !DILocalVariable(name: "__nptr", arg: 1, scope: !425, file: !426, line: 361, type: !239)
!431 = !DILocation(line: 0, scope: !425)
!432 = !DILocation(line: 363, column: 16, scope: !425)
!433 = !DILocation(line: 363, column: 10, scope: !425)
!434 = !DILocation(line: 363, column: 3, scope: !425)
!435 = distinct !DISubprogram(name: "atol", scope: !426, file: !426, line: 366, type: !436, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !438)
!436 = !DISubroutineType(types: !437)
!437 = !{!304, !239}
!438 = !{!439}
!439 = !DILocalVariable(name: "__nptr", arg: 1, scope: !435, file: !426, line: 366, type: !239)
!440 = !DILocation(line: 0, scope: !435)
!441 = !DILocation(line: 368, column: 10, scope: !435)
!442 = !DILocation(line: 368, column: 3, scope: !435)
!443 = distinct !DISubprogram(name: "atoll", scope: !426, file: !426, line: 373, type: !444, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !447)
!444 = !DISubroutineType(types: !445)
!445 = !{!446, !239}
!446 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!447 = !{!448}
!448 = !DILocalVariable(name: "__nptr", arg: 1, scope: !443, file: !426, line: 373, type: !239)
!449 = !DILocation(line: 0, scope: !443)
!450 = !DILocation(line: 375, column: 10, scope: !443)
!451 = !DILocation(line: 375, column: 3, scope: !443)
!452 = distinct !DISubprogram(name: "bsearch", scope: !453, file: !453, line: 20, type: !454, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !462)
!453 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!454 = !DISubroutineType(types: !455)
!455 = !{!238, !456, !456, !327, !327, !458}
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !426, line: 808, baseType: !459)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{!234, !456, !456}
!462 = !{!463, !464, !465, !466, !467, !468, !469, !470, !471, !472}
!463 = !DILocalVariable(name: "__key", arg: 1, scope: !452, file: !453, line: 20, type: !456)
!464 = !DILocalVariable(name: "__base", arg: 2, scope: !452, file: !453, line: 20, type: !456)
!465 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !452, file: !453, line: 20, type: !327)
!466 = !DILocalVariable(name: "__size", arg: 4, scope: !452, file: !453, line: 20, type: !327)
!467 = !DILocalVariable(name: "__compar", arg: 5, scope: !452, file: !453, line: 21, type: !458)
!468 = !DILocalVariable(name: "__l", scope: !452, file: !453, line: 23, type: !327)
!469 = !DILocalVariable(name: "__u", scope: !452, file: !453, line: 23, type: !327)
!470 = !DILocalVariable(name: "__idx", scope: !452, file: !453, line: 23, type: !327)
!471 = !DILocalVariable(name: "__p", scope: !452, file: !453, line: 24, type: !456)
!472 = !DILocalVariable(name: "__comparison", scope: !452, file: !453, line: 25, type: !234)
!473 = !DILocation(line: 0, scope: !452)
!474 = !DILocation(line: 29, column: 3, scope: !452)
!475 = !DILocation(line: 27, column: 7, scope: !452)
!476 = !DILocation(line: 29, column: 14, scope: !452)
!477 = !DILocation(line: 31, column: 20, scope: !478)
!478 = distinct !DILexicalBlock(scope: !452, file: !453, line: 30, column: 5)
!479 = !DILocation(line: 31, column: 27, scope: !478)
!480 = !DILocation(line: 32, column: 56, scope: !478)
!481 = !DILocation(line: 32, column: 47, scope: !478)
!482 = !DILocation(line: 33, column: 22, scope: !478)
!483 = !DILocation(line: 34, column: 24, scope: !484)
!484 = distinct !DILexicalBlock(scope: !478, file: !453, line: 34, column: 11)
!485 = !DILocation(line: 34, column: 11, scope: !478)
!486 = !DILocation(line: 36, column: 29, scope: !487)
!487 = distinct !DILexicalBlock(scope: !484, file: !453, line: 36, column: 16)
!488 = !DILocation(line: 36, column: 16, scope: !484)
!489 = !DILocation(line: 37, column: 14, scope: !487)
!490 = distinct !{!490, !474, !491}
!491 = !DILocation(line: 40, column: 5, scope: !452)
!492 = !DILocation(line: 43, column: 1, scope: !452)
!493 = distinct !DISubprogram(name: "atof", scope: !494, file: !494, line: 25, type: !495, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !498)
!494 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!495 = !DISubroutineType(types: !496)
!496 = !{!497, !239}
!497 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!498 = !{!499}
!499 = !DILocalVariable(name: "__nptr", arg: 1, scope: !493, file: !494, line: 25, type: !239)
!500 = !DILocation(line: 0, scope: !493)
!501 = !DILocation(line: 27, column: 10, scope: !493)
!502 = !DILocation(line: 27, column: 3, scope: !493)
!503 = distinct !DISubprogram(name: "strtoimax", scope: !504, file: !504, line: 324, type: !505, scopeLine: 326, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !511)
!504 = !DIFile(filename: "/usr/include/inttypes.h", directory: "")
!505 = !DISubroutineType(types: !506)
!506 = !{!507, !251, !510, !234}
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !508, line: 101, baseType: !509)
!508 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !303, line: 72, baseType: !304)
!510 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !235)
!511 = !{!512, !513, !514}
!512 = !DILocalVariable(name: "nptr", arg: 1, scope: !503, file: !504, line: 324, type: !251)
!513 = !DILocalVariable(name: "endptr", arg: 2, scope: !503, file: !504, line: 324, type: !510)
!514 = !DILocalVariable(name: "base", arg: 3, scope: !503, file: !504, line: 324, type: !234)
!515 = !DILocation(line: 0, scope: !503)
!516 = !DILocation(line: 327, column: 10, scope: !503)
!517 = !DILocation(line: 327, column: 3, scope: !503)
!518 = distinct !DISubprogram(name: "strtoumax", scope: !504, file: !504, line: 336, type: !519, scopeLine: 338, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !523)
!519 = !DISubroutineType(types: !520)
!520 = !{!521, !251, !510, !234}
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !508, line: 102, baseType: !522)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !303, line: 73, baseType: !329)
!523 = !{!524, !525, !526}
!524 = !DILocalVariable(name: "nptr", arg: 1, scope: !518, file: !504, line: 336, type: !251)
!525 = !DILocalVariable(name: "endptr", arg: 2, scope: !518, file: !504, line: 336, type: !510)
!526 = !DILocalVariable(name: "base", arg: 3, scope: !518, file: !504, line: 336, type: !234)
!527 = !DILocation(line: 0, scope: !518)
!528 = !DILocation(line: 339, column: 10, scope: !518)
!529 = !DILocation(line: 339, column: 3, scope: !518)
!530 = distinct !DISubprogram(name: "wcstoimax", scope: !504, file: !504, line: 348, type: !531, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !540)
!531 = !DISubroutineType(types: !532)
!532 = !{!507, !533, !537, !234}
!533 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !534)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !536)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gwchar_t", file: !504, line: 34, baseType: !234)
!537 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !538)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!540 = !{!541, !542, !543}
!541 = !DILocalVariable(name: "nptr", arg: 1, scope: !530, file: !504, line: 348, type: !533)
!542 = !DILocalVariable(name: "endptr", arg: 2, scope: !530, file: !504, line: 348, type: !537)
!543 = !DILocalVariable(name: "base", arg: 3, scope: !530, file: !504, line: 348, type: !234)
!544 = !DILocation(line: 0, scope: !530)
!545 = !DILocation(line: 351, column: 10, scope: !530)
!546 = !DILocation(line: 351, column: 3, scope: !530)
!547 = distinct !DISubprogram(name: "wcstoumax", scope: !504, file: !504, line: 362, type: !548, scopeLine: 364, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !550)
!548 = !DISubroutineType(types: !549)
!549 = !{!521, !533, !537, !234}
!550 = !{!551, !552, !553}
!551 = !DILocalVariable(name: "nptr", arg: 1, scope: !547, file: !504, line: 362, type: !533)
!552 = !DILocalVariable(name: "endptr", arg: 2, scope: !547, file: !504, line: 362, type: !537)
!553 = !DILocalVariable(name: "base", arg: 3, scope: !547, file: !504, line: 362, type: !234)
!554 = !DILocation(line: 0, scope: !547)
!555 = !DILocation(line: 365, column: 10, scope: !547)
!556 = !DILocation(line: 365, column: 3, scope: !547)
!557 = distinct !DISubprogram(name: "stat", scope: !558, file: !558, line: 453, type: !559, scopeLine: 454, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !598)
!558 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "")
!559 = !DISubroutineType(types: !560)
!560 = !{!234, !239, !561}
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !563, line: 46, size: 1152, elements: !564)
!563 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!564 = !{!565, !567, !569, !571, !573, !575, !577, !578, !579, !580, !582, !584, !592, !593, !594}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !562, file: !563, line: 48, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !303, line: 145, baseType: !329)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !562, file: !563, line: 53, baseType: !568, size: 64, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !303, line: 148, baseType: !329)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !562, file: !563, line: 61, baseType: !570, size: 64, offset: 128)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !303, line: 151, baseType: !329)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !562, file: !563, line: 62, baseType: !572, size: 32, offset: 192)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !303, line: 150, baseType: !5)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !562, file: !563, line: 64, baseType: !574, size: 32, offset: 224)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !303, line: 146, baseType: !5)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !562, file: !563, line: 65, baseType: !576, size: 32, offset: 256)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !303, line: 147, baseType: !5)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !562, file: !563, line: 67, baseType: !234, size: 32, offset: 288)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !562, file: !563, line: 69, baseType: !566, size: 64, offset: 320)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !562, file: !563, line: 74, baseType: !302, size: 64, offset: 384)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !562, file: !563, line: 78, baseType: !581, size: 64, offset: 448)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !303, line: 174, baseType: !304)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !562, file: !563, line: 80, baseType: !583, size: 64, offset: 512)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !303, line: 179, baseType: !304)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !562, file: !563, line: 91, baseType: !585, size: 128, offset: 576)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !586, line: 10, size: 128, elements: !587)
!586 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!587 = !{!588, !590}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !585, file: !586, line: 12, baseType: !589, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !303, line: 160, baseType: !304)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !585, file: !586, line: 16, baseType: !591, size: 64, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !303, line: 196, baseType: !304)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !562, file: !563, line: 92, baseType: !585, size: 128, offset: 704)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !562, file: !563, line: 93, baseType: !585, size: 128, offset: 832)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !562, file: !563, line: 106, baseType: !595, size: 192, offset: 960)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !591, size: 192, elements: !596)
!596 = !{!597}
!597 = !DISubrange(count: 3)
!598 = !{!599, !600}
!599 = !DILocalVariable(name: "__path", arg: 1, scope: !557, file: !558, line: 453, type: !239)
!600 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !557, file: !558, line: 453, type: !561)
!601 = !DILocation(line: 0, scope: !557)
!602 = !DILocation(line: 455, column: 10, scope: !557)
!603 = !DILocation(line: 455, column: 3, scope: !557)
!604 = distinct !DISubprogram(name: "lstat", scope: !558, file: !558, line: 460, type: !559, scopeLine: 461, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !605)
!605 = !{!606, !607}
!606 = !DILocalVariable(name: "__path", arg: 1, scope: !604, file: !558, line: 460, type: !239)
!607 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !604, file: !558, line: 460, type: !561)
!608 = !DILocation(line: 0, scope: !604)
!609 = !DILocation(line: 462, column: 10, scope: !604)
!610 = !DILocation(line: 462, column: 3, scope: !604)
!611 = distinct !DISubprogram(name: "fstat", scope: !558, file: !558, line: 467, type: !612, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !614)
!612 = !DISubroutineType(types: !613)
!613 = !{!234, !234, !561}
!614 = !{!615, !616}
!615 = !DILocalVariable(name: "__fd", arg: 1, scope: !611, file: !558, line: 467, type: !234)
!616 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !611, file: !558, line: 467, type: !561)
!617 = !DILocation(line: 0, scope: !611)
!618 = !DILocation(line: 469, column: 10, scope: !611)
!619 = !DILocation(line: 469, column: 3, scope: !611)
!620 = distinct !DISubprogram(name: "fstatat", scope: !558, file: !558, line: 474, type: !621, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !623)
!621 = !DISubroutineType(types: !622)
!622 = !{!234, !234, !239, !561, !234}
!623 = !{!624, !625, !626, !627}
!624 = !DILocalVariable(name: "__fd", arg: 1, scope: !620, file: !558, line: 474, type: !234)
!625 = !DILocalVariable(name: "__filename", arg: 2, scope: !620, file: !558, line: 474, type: !239)
!626 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !620, file: !558, line: 474, type: !561)
!627 = !DILocalVariable(name: "__flag", arg: 4, scope: !620, file: !558, line: 474, type: !234)
!628 = !DILocation(line: 0, scope: !620)
!629 = !DILocation(line: 477, column: 10, scope: !620)
!630 = !DILocation(line: 477, column: 3, scope: !620)
!631 = distinct !DISubprogram(name: "mknod", scope: !558, file: !558, line: 483, type: !632, scopeLine: 484, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !634)
!632 = !DISubroutineType(types: !633)
!633 = !{!234, !239, !572, !566}
!634 = !{!635, !636, !637}
!635 = !DILocalVariable(name: "__path", arg: 1, scope: !631, file: !558, line: 483, type: !239)
!636 = !DILocalVariable(name: "__mode", arg: 2, scope: !631, file: !558, line: 483, type: !572)
!637 = !DILocalVariable(name: "__dev", arg: 3, scope: !631, file: !558, line: 483, type: !566)
!638 = !DILocation(line: 0, scope: !631)
!639 = !DILocation(line: 485, column: 10, scope: !631)
!640 = !DILocation(line: 485, column: 3, scope: !631)
!641 = distinct !DISubprogram(name: "mknodat", scope: !558, file: !558, line: 491, type: !642, scopeLine: 493, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !644)
!642 = !DISubroutineType(types: !643)
!643 = !{!234, !234, !239, !572, !566}
!644 = !{!645, !646, !647, !648}
!645 = !DILocalVariable(name: "__fd", arg: 1, scope: !641, file: !558, line: 491, type: !234)
!646 = !DILocalVariable(name: "__path", arg: 2, scope: !641, file: !558, line: 491, type: !239)
!647 = !DILocalVariable(name: "__mode", arg: 3, scope: !641, file: !558, line: 491, type: !572)
!648 = !DILocalVariable(name: "__dev", arg: 4, scope: !641, file: !558, line: 491, type: !566)
!649 = !DILocation(line: 0, scope: !641)
!650 = !DILocation(line: 494, column: 10, scope: !641)
!651 = !DILocation(line: 494, column: 3, scope: !641)
!652 = distinct !DISubprogram(name: "stat64", scope: !558, file: !558, line: 502, type: !653, scopeLine: 503, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !675)
!653 = !DISubroutineType(types: !654)
!654 = !{!234, !239, !655}
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !563, line: 119, size: 1152, elements: !657)
!657 = !{!658, !659, !661, !662, !663, !664, !665, !666, !667, !668, !669, !671, !672, !673, !674}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !656, file: !563, line: 121, baseType: !566, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !656, file: !563, line: 123, baseType: !660, size: 64, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !303, line: 149, baseType: !329)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !656, file: !563, line: 124, baseType: !570, size: 64, offset: 128)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !656, file: !563, line: 125, baseType: !572, size: 32, offset: 192)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !656, file: !563, line: 132, baseType: !574, size: 32, offset: 224)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !656, file: !563, line: 133, baseType: !576, size: 32, offset: 256)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !656, file: !563, line: 135, baseType: !234, size: 32, offset: 288)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !656, file: !563, line: 136, baseType: !566, size: 64, offset: 320)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !656, file: !563, line: 137, baseType: !302, size: 64, offset: 384)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !656, file: !563, line: 143, baseType: !581, size: 64, offset: 448)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !656, file: !563, line: 144, baseType: !670, size: 64, offset: 512)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !303, line: 180, baseType: !304)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !656, file: !563, line: 152, baseType: !585, size: 128, offset: 576)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !656, file: !563, line: 153, baseType: !585, size: 128, offset: 704)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !656, file: !563, line: 154, baseType: !585, size: 128, offset: 832)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !656, file: !563, line: 164, baseType: !595, size: 192, offset: 960)
!675 = !{!676, !677}
!676 = !DILocalVariable(name: "__path", arg: 1, scope: !652, file: !558, line: 502, type: !239)
!677 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !652, file: !558, line: 502, type: !655)
!678 = !DILocation(line: 0, scope: !652)
!679 = !DILocation(line: 504, column: 10, scope: !652)
!680 = !DILocation(line: 504, column: 3, scope: !652)
!681 = distinct !DISubprogram(name: "lstat64", scope: !558, file: !558, line: 509, type: !653, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !682)
!682 = !{!683, !684}
!683 = !DILocalVariable(name: "__path", arg: 1, scope: !681, file: !558, line: 509, type: !239)
!684 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !681, file: !558, line: 509, type: !655)
!685 = !DILocation(line: 0, scope: !681)
!686 = !DILocation(line: 511, column: 10, scope: !681)
!687 = !DILocation(line: 511, column: 3, scope: !681)
!688 = distinct !DISubprogram(name: "fstat64", scope: !558, file: !558, line: 516, type: !689, scopeLine: 517, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !691)
!689 = !DISubroutineType(types: !690)
!690 = !{!234, !234, !655}
!691 = !{!692, !693}
!692 = !DILocalVariable(name: "__fd", arg: 1, scope: !688, file: !558, line: 516, type: !234)
!693 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !688, file: !558, line: 516, type: !655)
!694 = !DILocation(line: 0, scope: !688)
!695 = !DILocation(line: 518, column: 10, scope: !688)
!696 = !DILocation(line: 518, column: 3, scope: !688)
!697 = distinct !DISubprogram(name: "fstatat64", scope: !558, file: !558, line: 523, type: !698, scopeLine: 525, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !700)
!698 = !DISubroutineType(types: !699)
!699 = !{!234, !234, !239, !655, !234}
!700 = !{!701, !702, !703, !704}
!701 = !DILocalVariable(name: "__fd", arg: 1, scope: !697, file: !558, line: 523, type: !234)
!702 = !DILocalVariable(name: "__filename", arg: 2, scope: !697, file: !558, line: 523, type: !239)
!703 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !697, file: !558, line: 523, type: !655)
!704 = !DILocalVariable(name: "__flag", arg: 4, scope: !697, file: !558, line: 523, type: !234)
!705 = !DILocation(line: 0, scope: !697)
!706 = !DILocation(line: 526, column: 10, scope: !697)
!707 = !DILocation(line: 526, column: 3, scope: !697)
!708 = distinct !DISubprogram(name: "convert", scope: !1, file: !1, line: 68, type: !709, scopeLine: 69, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1343)
!709 = !DISubroutineType(types: !710)
!710 = !{!711, !711, !711}
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !712, line: 56, baseType: !713)
!712 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !4, line: 3371, size: 1792, elements: !715)
!715 = !{!716, !749, !755, !766, !773, !780, !785, !791, !797, !810, !820, !858, !866, !894, !902, !903, !908, !917, !923, !928, !932, !936, !965, !1014, !1020, !1027, !1034, !1060, !1085, !1102, !1114, !1136, !1154, !1325}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !714, file: !4, line: 3372, baseType: !717, size: 64)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !4, line: 360, size: 64, elements: !718)
!718 = !{!719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !717, file: !4, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !717, file: !4, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !717, file: !4, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !717, file: !4, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !717, file: !4, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !717, file: !4, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !717, file: !4, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !717, file: !4, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !717, file: !4, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !717, file: !4, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !717, file: !4, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !717, file: !4, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !717, file: !4, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !717, file: !4, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !717, file: !4, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !717, file: !4, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !717, file: !4, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !717, file: !4, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !717, file: !4, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !717, file: !4, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !717, file: !4, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !717, file: !4, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !717, file: !4, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !717, file: !4, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !717, file: !4, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !717, file: !4, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !717, file: !4, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !717, file: !4, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !717, file: !4, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !717, file: !4, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !714, file: !4, line: 3373, baseType: !750, size: 192)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !4, line: 402, size: 192, elements: !751)
!751 = !{!752, !753, !754}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !750, file: !4, line: 403, baseType: !717, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !750, file: !4, line: 404, baseType: !711, size: 64, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !750, file: !4, line: 405, baseType: !711, size: 64, offset: 128)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !714, file: !4, line: 3374, baseType: !756, size: 320)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !4, line: 1384, size: 320, elements: !757)
!757 = !{!758, !759}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !756, file: !4, line: 1385, baseType: !750, size: 192)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !756, file: !4, line: 1386, baseType: !760, size: 128, offset: 192)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !761, line: 58, baseType: !762)
!761 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !761, line: 54, size: 128, elements: !763)
!763 = !{!764, !765}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !762, file: !761, line: 56, baseType: !329, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !762, file: !761, line: 57, baseType: !304, size: 64, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !714, file: !4, line: 3375, baseType: !767, size: 256)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !4, line: 1397, size: 256, elements: !768)
!768 = !{!769, !770}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !767, file: !4, line: 1398, baseType: !750, size: 192)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !767, file: !4, line: 1399, baseType: !771, size: 64, offset: 192)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !4, line: 1392, flags: DIFlagFwdDecl)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !714, file: !4, line: 3376, baseType: !774, size: 256)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !4, line: 1408, size: 256, elements: !775)
!775 = !{!776, !777}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !774, file: !4, line: 1409, baseType: !750, size: 192)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !774, file: !4, line: 1410, baseType: !778, size: 64, offset: 192)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !4, line: 1403, flags: DIFlagFwdDecl)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !714, file: !4, line: 3377, baseType: !781, size: 256)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !4, line: 1437, size: 256, elements: !782)
!782 = !{!783, !784}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !781, file: !4, line: 1438, baseType: !750, size: 192)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !781, file: !4, line: 1439, baseType: !711, size: 64, offset: 192)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !714, file: !4, line: 3378, baseType: !786, size: 256)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !4, line: 1418, size: 256, elements: !787)
!787 = !{!788, !789, !790}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !786, file: !4, line: 1419, baseType: !750, size: 192)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !786, file: !4, line: 1420, baseType: !234, size: 32, offset: 192)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !786, file: !4, line: 1421, baseType: !310, size: 8, offset: 224)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !714, file: !4, line: 3379, baseType: !792, size: 320)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !4, line: 1428, size: 320, elements: !793)
!793 = !{!794, !795, !796}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !792, file: !4, line: 1429, baseType: !750, size: 192)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !792, file: !4, line: 1430, baseType: !711, size: 64, offset: 192)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !792, file: !4, line: 1431, baseType: !711, size: 64, offset: 256)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !714, file: !4, line: 3380, baseType: !798, size: 320)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !4, line: 1460, size: 320, elements: !799)
!799 = !{!800, !801}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !798, file: !4, line: 1461, baseType: !750, size: 192)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !798, file: !4, line: 1462, baseType: !802, size: 128, offset: 192)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !803, line: 31, size: 128, elements: !804)
!803 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!804 = !{!805, !808, !809}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !802, file: !803, line: 32, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !233)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !802, file: !803, line: 33, baseType: !5, size: 32, offset: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !802, file: !803, line: 34, baseType: !5, size: 32, offset: 96)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !714, file: !4, line: 3381, baseType: !811, size: 384)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !4, line: 2507, size: 384, elements: !812)
!812 = !{!813, !814, !817, !818, !819}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !811, file: !4, line: 2508, baseType: !750, size: 192)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !811, file: !4, line: 2509, baseType: !815, size: 32, offset: 192)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !816, line: 58, baseType: !241)
!816 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!817 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !811, file: !4, line: 2510, baseType: !5, size: 32, offset: 224)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !811, file: !4, line: 2511, baseType: !711, size: 64, offset: 256)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !811, file: !4, line: 2512, baseType: !711, size: 64, offset: 320)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !714, file: !4, line: 3382, baseType: !821, size: 896)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !4, line: 2652, size: 896, elements: !822)
!822 = !{!823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !821, file: !4, line: 2653, baseType: !811, size: 384)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !821, file: !4, line: 2654, baseType: !711, size: 64, offset: 384)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !821, file: !4, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !821, file: !4, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !821, file: !4, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !821, file: !4, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !821, file: !4, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !821, file: !4, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !821, file: !4, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !821, file: !4, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !821, file: !4, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !821, file: !4, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !821, file: !4, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !821, file: !4, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !821, file: !4, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !821, file: !4, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !821, file: !4, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !821, file: !4, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !821, file: !4, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !821, file: !4, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !821, file: !4, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !821, file: !4, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !821, file: !4, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !821, file: !4, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !821, file: !4, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !821, file: !4, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !821, file: !4, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !821, file: !4, line: 2703, baseType: !5, size: 32, offset: 512)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !821, file: !4, line: 2705, baseType: !711, size: 64, offset: 576)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !821, file: !4, line: 2706, baseType: !711, size: 64, offset: 640)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !821, file: !4, line: 2707, baseType: !711, size: 64, offset: 704)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !821, file: !4, line: 2708, baseType: !711, size: 64, offset: 768)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !821, file: !4, line: 2711, baseType: !856, size: 64, offset: 832)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !4, line: 2711, flags: DIFlagFwdDecl)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !714, file: !4, line: 3383, baseType: !859, size: 960)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !4, line: 2756, size: 960, elements: !860)
!860 = !{!861, !862}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !859, file: !4, line: 2757, baseType: !821, size: 896)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !859, file: !4, line: 2758, baseType: !863, size: 64, offset: 896)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !712, line: 50, baseType: !864)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !712, line: 49, flags: DIFlagFwdDecl)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !714, file: !4, line: 3384, baseType: !867, size: 1472)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !4, line: 3114, size: 1472, elements: !868)
!868 = !{!869, !890, !891, !892, !893}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !867, file: !4, line: 3115, baseType: !870, size: 1216)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !4, line: 2984, size: 1216, elements: !871)
!871 = !{!872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !870, file: !4, line: 2985, baseType: !859, size: 960)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !870, file: !4, line: 2986, baseType: !711, size: 64, offset: 960)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !870, file: !4, line: 2987, baseType: !711, size: 64, offset: 1024)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !870, file: !4, line: 2988, baseType: !711, size: 64, offset: 1088)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !870, file: !4, line: 2991, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !870, file: !4, line: 2992, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !870, file: !4, line: 2993, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !870, file: !4, line: 2994, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !870, file: !4, line: 2995, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !870, file: !4, line: 2996, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !870, file: !4, line: 2998, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !870, file: !4, line: 3000, baseType: !5, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !870, file: !4, line: 3002, baseType: !5, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !870, file: !4, line: 3003, baseType: !5, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !870, file: !4, line: 3004, baseType: !5, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !870, file: !4, line: 3005, baseType: !5, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !870, file: !4, line: 3007, baseType: !5, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !870, file: !4, line: 3010, baseType: !5, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !867, file: !4, line: 3117, baseType: !711, size: 64, offset: 1216)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !867, file: !4, line: 3119, baseType: !711, size: 64, offset: 1280)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !867, file: !4, line: 3121, baseType: !711, size: 64, offset: 1344)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !867, file: !4, line: 3123, baseType: !711, size: 64, offset: 1408)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !714, file: !4, line: 3385, baseType: !895, size: 1088)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !4, line: 2874, size: 1088, elements: !896)
!896 = !{!897, !898, !899}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !895, file: !4, line: 2875, baseType: !859, size: 960)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !895, file: !4, line: 2876, baseType: !863, size: 64, offset: 960)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !895, file: !4, line: 2877, baseType: !900, size: 64, offset: 1024)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !4, line: 2856, flags: DIFlagFwdDecl)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !714, file: !4, line: 3386, baseType: !870, size: 1216)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !714, file: !4, line: 3387, baseType: !904, size: 1280)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !4, line: 3093, size: 1280, elements: !905)
!905 = !{!906, !907}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !904, file: !4, line: 3094, baseType: !870, size: 1216)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !904, file: !4, line: 3095, baseType: !900, size: 64, offset: 1216)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !714, file: !4, line: 3388, baseType: !909, size: 1216)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !4, line: 2824, size: 1216, elements: !910)
!910 = !{!911, !912, !913, !914, !915, !916}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !909, file: !4, line: 2825, baseType: !821, size: 896)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !909, file: !4, line: 2827, baseType: !711, size: 64, offset: 896)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !909, file: !4, line: 2828, baseType: !711, size: 64, offset: 960)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !909, file: !4, line: 2829, baseType: !711, size: 64, offset: 1024)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !909, file: !4, line: 2830, baseType: !711, size: 64, offset: 1088)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !909, file: !4, line: 2831, baseType: !711, size: 64, offset: 1152)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !714, file: !4, line: 3389, baseType: !918, size: 1024)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !4, line: 2850, size: 1024, elements: !919)
!919 = !{!920, !921, !922}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !918, file: !4, line: 2851, baseType: !859, size: 960)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !918, file: !4, line: 2852, baseType: !234, size: 32, offset: 960)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !918, file: !4, line: 2853, baseType: !234, size: 32, offset: 992)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !714, file: !4, line: 3390, baseType: !924, size: 1024)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !4, line: 2857, size: 1024, elements: !925)
!925 = !{!926, !927}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !924, file: !4, line: 2858, baseType: !859, size: 960)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !924, file: !4, line: 2859, baseType: !900, size: 64, offset: 960)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !714, file: !4, line: 3391, baseType: !929, size: 960)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !4, line: 2862, size: 960, elements: !930)
!930 = !{!931}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !929, file: !4, line: 2863, baseType: !859, size: 960)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !714, file: !4, line: 3392, baseType: !933, size: 1472)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !4, line: 3304, size: 1472, elements: !934)
!934 = !{!935}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !933, file: !4, line: 3305, baseType: !867, size: 1472)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !714, file: !4, line: 3393, baseType: !937, size: 1792)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !4, line: 3248, size: 1792, elements: !938)
!938 = !{!939, !940, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !937, file: !4, line: 3249, baseType: !867, size: 1472)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !937, file: !4, line: 3251, baseType: !941, size: 64, offset: 1472)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !943, line: 41, flags: DIFlagFwdDecl)
!943 = !DIFile(filename: "./statistics.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!944 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !937, file: !4, line: 3254, baseType: !711, size: 64, offset: 1536)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !937, file: !4, line: 3257, baseType: !711, size: 64, offset: 1600)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !937, file: !4, line: 3258, baseType: !711, size: 64, offset: 1664)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !937, file: !4, line: 3264, baseType: !5, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !937, file: !4, line: 3265, baseType: !5, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !937, file: !4, line: 3267, baseType: !5, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !937, file: !4, line: 3268, baseType: !5, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !937, file: !4, line: 3269, baseType: !5, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !937, file: !4, line: 3271, baseType: !5, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !937, file: !4, line: 3272, baseType: !5, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !937, file: !4, line: 3273, baseType: !5, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !937, file: !4, line: 3274, baseType: !5, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !937, file: !4, line: 3275, baseType: !5, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !937, file: !4, line: 3276, baseType: !5, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !937, file: !4, line: 3277, baseType: !5, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !937, file: !4, line: 3279, baseType: !5, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !937, file: !4, line: 3280, baseType: !5, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !937, file: !4, line: 3281, baseType: !5, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !937, file: !4, line: 3282, baseType: !5, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !937, file: !4, line: 3283, baseType: !5, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !937, file: !4, line: 3284, baseType: !5, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !714, file: !4, line: 3394, baseType: !966, size: 1344)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !4, line: 2279, size: 1344, elements: !967)
!967 = !{!968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !993, !994, !995, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !966, file: !4, line: 2280, baseType: !750, size: 192)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !966, file: !4, line: 2281, baseType: !711, size: 64, offset: 192)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !966, file: !4, line: 2282, baseType: !711, size: 64, offset: 256)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !966, file: !4, line: 2283, baseType: !711, size: 64, offset: 320)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !966, file: !4, line: 2284, baseType: !711, size: 64, offset: 384)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !966, file: !4, line: 2285, baseType: !5, size: 32, offset: 448)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !966, file: !4, line: 2287, baseType: !5, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !966, file: !4, line: 2288, baseType: !5, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !966, file: !4, line: 2289, baseType: !5, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !966, file: !4, line: 2290, baseType: !5, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !966, file: !4, line: 2291, baseType: !5, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !966, file: !4, line: 2292, baseType: !5, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !966, file: !4, line: 2294, baseType: !5, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !966, file: !4, line: 2296, baseType: !5, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !966, file: !4, line: 2297, baseType: !5, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !966, file: !4, line: 2298, baseType: !5, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !966, file: !4, line: 2299, baseType: !5, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !966, file: !4, line: 2300, baseType: !5, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !966, file: !4, line: 2301, baseType: !5, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !966, file: !4, line: 2302, baseType: !5, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !966, file: !4, line: 2303, baseType: !5, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !966, file: !4, line: 2305, baseType: !5, size: 32, offset: 512)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !966, file: !4, line: 2306, baseType: !991, size: 32, offset: 544)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !992, line: 31, baseType: !234)
!992 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!993 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !966, file: !4, line: 2307, baseType: !711, size: 64, offset: 576)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !966, file: !4, line: 2308, baseType: !711, size: 64, offset: 640)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !966, file: !4, line: 2314, baseType: !996, size: 64, offset: 704)
!996 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !4, line: 2309, size: 64, elements: !997)
!997 = !{!998, !999, !1000}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !996, file: !4, line: 2310, baseType: !234, size: 32)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !996, file: !4, line: 2311, baseType: !239, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !996, file: !4, line: 2312, baseType: !1001, size: 64)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !4, line: 2277, flags: DIFlagFwdDecl)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !966, file: !4, line: 2315, baseType: !711, size: 64, offset: 768)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !966, file: !4, line: 2316, baseType: !711, size: 64, offset: 832)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !966, file: !4, line: 2317, baseType: !711, size: 64, offset: 896)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !966, file: !4, line: 2318, baseType: !711, size: 64, offset: 960)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !966, file: !4, line: 2319, baseType: !711, size: 64, offset: 1024)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !966, file: !4, line: 2320, baseType: !711, size: 64, offset: 1088)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !966, file: !4, line: 2321, baseType: !711, size: 64, offset: 1152)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !966, file: !4, line: 2322, baseType: !711, size: 64, offset: 1216)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !966, file: !4, line: 2324, baseType: !1012, size: 64, offset: 1280)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !4, line: 2324, flags: DIFlagFwdDecl)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !714, file: !4, line: 3395, baseType: !1015, size: 320)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !4, line: 1469, size: 320, elements: !1016)
!1016 = !{!1017, !1018, !1019}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1015, file: !4, line: 1470, baseType: !750, size: 192)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1015, file: !4, line: 1471, baseType: !711, size: 64, offset: 192)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1015, file: !4, line: 1472, baseType: !711, size: 64, offset: 256)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !714, file: !4, line: 3396, baseType: !1021, size: 320)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !4, line: 1482, size: 320, elements: !1022)
!1022 = !{!1023, !1024, !1025}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1021, file: !4, line: 1483, baseType: !750, size: 192)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1021, file: !4, line: 1484, baseType: !234, size: 32, offset: 192)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1021, file: !4, line: 1485, baseType: !1026, size: 64, offset: 256)
!1026 = !DICompositeType(tag: DW_TAG_array_type, baseType: !711, size: 64, elements: !311)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !714, file: !4, line: 3397, baseType: !1028, size: 384)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !4, line: 1829, size: 384, elements: !1029)
!1029 = !{!1030, !1031, !1032, !1033}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1028, file: !4, line: 1830, baseType: !750, size: 192)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1028, file: !4, line: 1831, baseType: !815, size: 32, offset: 192)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1028, file: !4, line: 1832, baseType: !711, size: 64, offset: 256)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1028, file: !4, line: 1835, baseType: !1026, size: 64, offset: 320)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !714, file: !4, line: 3398, baseType: !1035, size: 704)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !4, line: 1898, size: 704, elements: !1036)
!1036 = !{!1037, !1038, !1039, !1043, !1044, !1047}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1035, file: !4, line: 1899, baseType: !750, size: 192)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1035, file: !4, line: 1902, baseType: !711, size: 64, offset: 192)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1035, file: !4, line: 1905, baseType: !1040, size: 64, offset: 256)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !712, line: 58, baseType: !1041)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !712, line: 57, flags: DIFlagFwdDecl)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1035, file: !4, line: 1908, baseType: !5, size: 32, offset: 320)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1035, file: !4, line: 1911, baseType: !1045, size: 64, offset: 384)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !4, line: 1876, flags: DIFlagFwdDecl)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1035, file: !4, line: 1914, baseType: !1048, size: 256, offset: 448)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !4, line: 1883, size: 256, elements: !1049)
!1049 = !{!1050, !1052, !1053, !1058}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1048, file: !4, line: 1884, baseType: !1051, size: 64)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1048, file: !4, line: 1885, baseType: !1051, size: 64, offset: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1048, file: !4, line: 1891, baseType: !1054, size: 64, offset: 128)
!1054 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1048, file: !4, line: 1891, size: 64, elements: !1055)
!1055 = !{!1056, !1057}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1054, file: !4, line: 1891, baseType: !1040, size: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1054, file: !4, line: 1891, baseType: !711, size: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1048, file: !4, line: 1892, baseType: !1059, size: 64, offset: 192)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !714, file: !4, line: 3399, baseType: !1061, size: 704)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !4, line: 2008, size: 704, elements: !1062)
!1062 = !{!1063, !1064, !1065, !1066, !1067, !1068, !1080, !1081, !1082, !1083, !1084}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1061, file: !4, line: 2009, baseType: !750, size: 192)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1061, file: !4, line: 2011, baseType: !5, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !1061, file: !4, line: 2012, baseType: !5, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1061, file: !4, line: 2014, baseType: !815, size: 32, offset: 224)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1061, file: !4, line: 2016, baseType: !711, size: 64, offset: 256)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !1061, file: !4, line: 2017, baseType: !1069, size: 64, offset: 320)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !4, line: 183, baseType: !1071)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !4, line: 183, size: 128, elements: !1072)
!1072 = !{!1073}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1071, file: !4, line: 183, baseType: !1074, size: 128)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !4, line: 182, baseType: !1075)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !4, line: 182, size: 128, elements: !1076)
!1076 = !{!1077, !1078, !1079}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1075, file: !4, line: 182, baseType: !5, size: 32)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1075, file: !4, line: 182, baseType: !5, size: 32, offset: 32)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1075, file: !4, line: 182, baseType: !1026, size: 64, offset: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !1061, file: !4, line: 2019, baseType: !711, size: 64, offset: 384)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !1061, file: !4, line: 2020, baseType: !711, size: 64, offset: 448)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1061, file: !4, line: 2021, baseType: !711, size: 64, offset: 512)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !1061, file: !4, line: 2022, baseType: !711, size: 64, offset: 576)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !1061, file: !4, line: 2023, baseType: !711, size: 64, offset: 640)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !714, file: !4, line: 3400, baseType: !1086, size: 832)
!1086 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !4, line: 2430, size: 832, elements: !1087)
!1087 = !{!1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1086, file: !4, line: 2431, baseType: !750, size: 192)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1086, file: !4, line: 2433, baseType: !711, size: 64, offset: 192)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !1086, file: !4, line: 2434, baseType: !711, size: 64, offset: 256)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !1086, file: !4, line: 2435, baseType: !711, size: 64, offset: 320)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !1086, file: !4, line: 2436, baseType: !711, size: 64, offset: 384)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "base_accesses", scope: !1086, file: !4, line: 2437, baseType: !1069, size: 64, offset: 448)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "inheritance", scope: !1086, file: !4, line: 2438, baseType: !711, size: 64, offset: 512)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_subvtt", scope: !1086, file: !4, line: 2440, baseType: !711, size: 64, offset: 576)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_vptr", scope: !1086, file: !4, line: 2441, baseType: !711, size: 64, offset: 640)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "base_binfos", scope: !1086, file: !4, line: 2443, baseType: !1098, size: 128, offset: 704)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_none", file: !4, line: 182, baseType: !1099)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_none", file: !4, line: 182, size: 128, elements: !1100)
!1100 = !{!1101}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1099, file: !4, line: 182, baseType: !1074, size: 128)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "stmt_list", scope: !714, file: !4, line: 3401, baseType: !1103, size: 320)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list", file: !4, line: 3327, size: 320, elements: !1104)
!1104 = !{!1105, !1106, !1113}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1103, file: !4, line: 3329, baseType: !750, size: 192)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1103, file: !4, line: 3330, baseType: !1107, size: 64, offset: 192)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list_node", file: !4, line: 3320, size: 192, elements: !1109)
!1109 = !{!1110, !1111, !1112}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1108, file: !4, line: 3322, baseType: !1107, size: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1108, file: !4, line: 3323, baseType: !1107, size: 64, offset: 64)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1108, file: !4, line: 3324, baseType: !711, size: 64, offset: 128)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1103, file: !4, line: 3331, baseType: !1107, size: 64, offset: 256)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "constructor", scope: !714, file: !4, line: 3402, baseType: !1115, size: 256)
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_constructor", file: !4, line: 1540, size: 256, elements: !1116)
!1116 = !{!1117, !1118}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1115, file: !4, line: 1541, baseType: !750, size: 192)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !1115, file: !4, line: 1542, baseType: !1119, size: 64, offset: 192)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_gc", file: !4, line: 1538, baseType: !1121)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_gc", file: !4, line: 1538, size: 192, elements: !1122)
!1122 = !{!1123}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1121, file: !4, line: 1538, baseType: !1124, size: 192)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_base", file: !4, line: 1537, baseType: !1125)
