; ModuleID = 'c-decl.bc'
source_filename = "c-decl.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }
%struct.tree_decl_minimal = type { %struct.tree_common, i32, i32, %union.tree_node*, %union.tree_node* }
%struct.tree_common = type { %struct.tree_base, %union.tree_node*, %union.tree_node* }
%struct.tree_base = type { i64 }

!570 = !DIEnumerator(name: "cts_none", value: 0, isUnsigned: true)
!571 = !DIEnumerator(name: "cts_void", value: 1, isUnsigned: true)
!572 = !DIEnumerator(name: "cts_bool", value: 2, isUnsigned: true)
!573 = !DIEnumerator(name: "cts_char", value: 3, isUnsigned: true)
!574 = !DIEnumerator(name: "cts_int", value: 4, isUnsigned: true)
!575 = !DIEnumerator(name: "cts_float", value: 5, isUnsigned: true)
!576 = !DIEnumerator(name: "cts_double", value: 6, isUnsigned: true)
!577 = !DIEnumerator(name: "cts_dfloat32", value: 7, isUnsigned: true)
!578 = !DIEnumerator(name: "cts_dfloat64", value: 8, isUnsigned: true)
!579 = !DIEnumerator(name: "cts_dfloat128", value: 9, isUnsigned: true)
!580 = !DIEnumerator(name: "cts_fract", value: 10, isUnsigned: true)
!581 = !DIEnumerator(name: "cts_accum", value: 11, isUnsigned: true)
!582 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_storage_class", file: !564, line: 180, baseType: !7, size: 32, elements: !583)
!583 = !{!584, !585, !586, !587, !588, !589}
!584 = !DIEnumerator(name: "csc_none", value: 0, isUnsigned: true)
!585 = !DIEnumerator(name: "csc_auto", value: 1, isUnsigned: true)
!586 = !DIEnumerator(name: "csc_extern", value: 2, isUnsigned: true)
!587 = !DIEnumerator(name: "csc_register", value: 3, isUnsigned: true)
!588 = !DIEnumerator(name: "csc_static", value: 4, isUnsigned: true)
!589 = !DIEnumerator(name: "csc_typedef", value: 5, isUnsigned: true)
!590 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_declarator_kind", file: !564, line: 285, baseType: !7, size: 32, elements: !591)
!591 = !{!592, !593, !594, !595, !596}
!592 = !DIEnumerator(name: "cdk_id", value: 0, isUnsigned: true)
!593 = !DIEnumerator(name: "cdk_function", value: 1, isUnsigned: true)
!594 = !DIEnumerator(name: "cdk_array", value: 2, isUnsigned: true)
!595 = !DIEnumerator(name: "cdk_pointer", value: 3, isUnsigned: true)
!596 = !DIEnumerator(name: "cdk_attrs", value: 4, isUnsigned: true)
!597 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "deprecated_states", file: !3, line: 82, baseType: !7, size: 32, elements: !598)
!598 = !{!599, !600}
!599 = !DIEnumerator(name: "DEPRECATED_NORMAL", value: 0, isUnsigned: true)
!600 = !DIEnumerator(name: "DEPRECATED_SUPPRESS", value: 1, isUnsigned: true)
!601 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_typespec_kind", file: !564, line: 137, baseType: !7, size: 32, elements: !602)
!602 = !{!603, !604, !605, !606, !607, !608, !609}
!603 = !DIEnumerator(name: "ctsk_resword", value: 0, isUnsigned: true)
!604 = !DIEnumerator(name: "ctsk_tagref", value: 1, isUnsigned: true)
!605 = !DIEnumerator(name: "ctsk_tagfirstref", value: 2, isUnsigned: true)
!606 = !DIEnumerator(name: "ctsk_tagdef", value: 3, isUnsigned: true)
!607 = !DIEnumerator(name: "ctsk_typedef", value: 4, isUnsigned: true)
!608 = !DIEnumerator(name: "ctsk_objc", value: 5, isUnsigned: true)
!609 = !DIEnumerator(name: "ctsk_typeof", value: 6, isUnsigned: true)
!610 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "decl_context", file: !3, line: 70, baseType: !7, size: 32, elements: !611)
!611 = !{!612, !613, !614, !615, !616}
!612 = !DIEnumerator(name: "NORMAL", value: 0, isUnsigned: true)
!613 = !DIEnumerator(name: "FUNCDEF", value: 1, isUnsigned: true)
!614 = !DIEnumerator(name: "PARM", value: 2, isUnsigned: true)
!615 = !DIEnumerator(name: "FIELD", value: 3, isUnsigned: true)
!616 = !DIEnumerator(name: "TYPENAME", value: 4, isUnsigned: true)
!617 = !{!618, !619, !620, !621, !624, !625, !134, !627, !629, !397, !2128, !672, !2129, !2077, !2111, !2137, !2138, !1477, !2059, !2141, !622, !1622, !2162, !1725, !1729, !1605, !2186, !2190, !2224, !1107, !2061, !2069, !2225, !801, !1507, !7, !2110, !2098, !2166, !2172, !2184}
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!620 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !623)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !628, line: 44, baseType: !7)
!628 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lang_identifier", file: !3, line: 242, size: 640, elements: !631)
!631 = !{!632, !2060, !2126, !2127}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "common_id", scope: !630, file: !3, line: 243, baseType: !633, size: 448)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "c_common_identifier", file: !398, line: 261, size: 448, elements: !634)
!634 = !{!635, !2038}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !633, file: !398, line: 262, baseType: !636, size: 192)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !135, line: 402, size: 192, elements: !637)
!637 = !{!638, !671, !2037}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !636, file: !135, line: 403, baseType: !639, size: 64)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !135, line: 360, size: 64, elements: !640)
!640 = !{!641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !639, file: !135, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !639, file: !135, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !639, file: !135, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !639, file: !135, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !639, file: !135, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !639, file: !135, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !639, file: !135, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !639, file: !135, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !639, file: !135, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !639, file: !135, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !639, file: !135, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !639, file: !135, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !639, file: !135, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !639, file: !135, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !639, file: !135, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !639, file: !135, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !639, file: !135, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !639, file: !135, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !639, file: !135, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !639, file: !135, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !639, file: !135, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !639, file: !135, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !639, file: !135, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !639, file: !135, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !639, file: !135, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !639, file: !135, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !639, file: !135, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !639, file: !135, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !639, file: !135, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !639, file: !135, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !636, file: !135, line: 404, baseType: !672, size: 64, offset: 64)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !673, line: 56, baseType: !674)
!673 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !135, line: 3371, size: 1792, elements: !676)
!676 = !{!677, !678, !679, !692, !711, !722, !727, !736, !742, !755, !765, !806, !1299, !1327, !1335, !1336, !1341, !1350, !1356, !1361, !1365, !1369, !1680, !1737, !1743, !1749, !1756, !1767, !1781, !1798, !1810, !1832, !1847, !2019}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !675, file: !135, line: 3372, baseType: !639, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !675, file: !135, line: 3373, baseType: !636, size: 192)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !675, file: !135, line: 3374, baseType: !680, size: 320)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !135, line: 1384, size: 320, elements: !681)
!681 = !{!682, !683}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !680, file: !135, line: 1385, baseType: !636, size: 192)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !680, file: !135, line: 1386, baseType: !684, size: 128, offset: 192)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !685, line: 58, baseType: !686)
!685 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !685, line: 54, size: 128, elements: !687)
!687 = !{!688, !690}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !686, file: !685, line: 56, baseType: !689, size: 64)
!689 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !686, file: !685, line: 57, baseType: !691, size: 64, offset: 64)
!691 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !675, file: !135, line: 3375, baseType: !693, size: 256)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !135, line: 1397, size: 256, elements: !694)
!694 = !{!695, !696}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !693, file: !135, line: 1398, baseType: !636, size: 192)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !693, file: !135, line: 1399, baseType: !697, size: 64, offset: 192)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !699, line: 52, size: 256, elements: !700)
!699 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!700 = !{!701, !702, !703, !704, !705, !706, !707}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !698, file: !699, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !698, file: !699, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !698, file: !699, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !698, file: !699, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !698, file: !699, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !698, file: !699, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !698, file: !699, line: 62, baseType: !708, size: 192, offset: 64)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !689, size: 192, elements: !709)
!709 = !{!710}
!710 = !DISubrange(count: 3)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !675, file: !135, line: 3376, baseType: !712, size: 256)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !135, line: 1408, size: 256, elements: !713)
!713 = !{!714, !715}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !712, file: !135, line: 1409, baseType: !636, size: 192)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !712, file: !135, line: 1410, baseType: !716, size: 64, offset: 192)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !718, line: 27, size: 192, elements: !719)
!718 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!719 = !{!720, !721}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !717, file: !718, line: 29, baseType: !684, size: 128)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !717, file: !718, line: 30, baseType: !5, size: 32, offset: 128)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !675, file: !135, line: 3377, baseType: !723, size: 256)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !135, line: 1437, size: 256, elements: !724)
!724 = !{!725, !726}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !723, file: !135, line: 1438, baseType: !636, size: 192)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !723, file: !135, line: 1439, baseType: !672, size: 64, offset: 192)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !675, file: !135, line: 3378, baseType: !728, size: 256)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !135, line: 1418, size: 256, elements: !729)
!729 = !{!730, !731, !732}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !728, file: !135, line: 1419, baseType: !636, size: 192)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !728, file: !135, line: 1420, baseType: !620, size: 32, offset: 192)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !728, file: !135, line: 1421, baseType: !733, size: 8, offset: 224)
!733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !623, size: 8, elements: !734)
!734 = !{!735}
!735 = !DISubrange(count: 1)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !675, file: !135, line: 3379, baseType: !737, size: 320)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !135, line: 1428, size: 320, elements: !738)
!738 = !{!739, !740, !741}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !737, file: !135, line: 1429, baseType: !636, size: 192)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !737, file: !135, line: 1430, baseType: !672, size: 64, offset: 192)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !737, file: !135, line: 1431, baseType: !672, size: 64, offset: 256)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !675, file: !135, line: 3380, baseType: !743, size: 320)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !135, line: 1460, size: 320, elements: !744)
!744 = !{!745, !746}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !743, file: !135, line: 1461, baseType: !636, size: 192)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !743, file: !135, line: 1462, baseType: !747, size: 128, offset: 192)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !748, line: 31, size: 128, elements: !749)
!748 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!749 = !{!750, !753, !754}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !747, file: !748, line: 32, baseType: !751, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !619)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !747, file: !748, line: 33, baseType: !7, size: 32, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !747, file: !748, line: 34, baseType: !7, size: 32, offset: 96)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !675, file: !135, line: 3381, baseType: !756, size: 384)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !135, line: 2507, size: 384, elements: !757)
!757 = !{!758, !759, !762, !763, !764}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !756, file: !135, line: 2508, baseType: !636, size: 192)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !756, file: !135, line: 2509, baseType: !760, size: 32, offset: 192)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !761, line: 58, baseType: !627)
!761 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!762 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !756, file: !135, line: 2510, baseType: !7, size: 32, offset: 224)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !756, file: !135, line: 2511, baseType: !672, size: 64, offset: 256)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !756, file: !135, line: 2512, baseType: !672, size: 64, offset: 320)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !675, file: !135, line: 3382, baseType: !766, size: 896)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !135, line: 2652, size: 896, elements: !767)
!767 = !{!768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !766, file: !135, line: 2653, baseType: !756, size: 384)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !766, file: !135, line: 2654, baseType: !672, size: 64, offset: 384)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !766, file: !135, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !766, file: !135, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !766, file: !135, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !766, file: !135, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !766, file: !135, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !766, file: !135, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !766, file: !135, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !766, file: !135, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !766, file: !135, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !766, file: !135, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !766, file: !135, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !766, file: !135, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !766, file: !135, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !766, file: !135, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !766, file: !135, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !766, file: !135, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !766, file: !135, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !766, file: !135, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !766, file: !135, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !766, file: !135, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !766, file: !135, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !766, file: !135, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !766, file: !135, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !766, file: !135, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !766, file: !135, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !766, file: !135, line: 2703, baseType: !7, size: 32, offset: 512)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !766, file: !135, line: 2705, baseType: !672, size: 64, offset: 576)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !766, file: !135, line: 2706, baseType: !672, size: 64, offset: 640)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !766, file: !135, line: 2707, baseType: !672, size: 64, offset: 704)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !766, file: !135, line: 2708, baseType: !672, size: 64, offset: 768)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !766, file: !135, line: 2711, baseType: !801, size: 64, offset: 832)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !803, line: 39, size: 8, elements: !804)
!803 = !DIFile(filename: "./c-lang.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!804 = !{!805}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !802, file: !803, line: 40, baseType: !623, size: 8)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !675, file: !135, line: 3383, baseType: !807, size: 960)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !135, line: 2756, size: 960, elements: !808)
!808 = !{!809, !810}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !807, file: !135, line: 2757, baseType: !766, size: 896)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !807, file: !135, line: 2758, baseType: !811, size: 64, offset: 896)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !673, line: 50, baseType: !812)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !814, line: 240, size: 384, elements: !815)
!814 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!815 = !{!816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !813, file: !814, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !813, file: !814, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !813, file: !814, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !813, file: !814, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !813, file: !814, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !813, file: !814, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !813, file: !814, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !813, file: !814, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !813, file: !814, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !813, file: !814, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !813, file: !814, line: 321, baseType: !827, size: 320, offset: 64)
!827 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !814, line: 315, size: 320, elements: !828)
!828 = !{!829, !1232, !1234, !1297, !1298}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !827, file: !814, line: 316, baseType: !830, size: 64)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !831, size: 64, elements: !734)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !814, line: 183, baseType: !832)
!832 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !814, line: 166, size: 64, elements: !833)
!833 = !{!834, !835, !836, !837, !838, !846, !847, !859, !862, !922, !923, !1209, !1222, !1229}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !832, file: !814, line: 168, baseType: !620, size: 32)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !832, file: !814, line: 169, baseType: !7, size: 32)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !832, file: !814, line: 170, baseType: !625, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !832, file: !814, line: 171, baseType: !811, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !832, file: !814, line: 172, baseType: !839, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !673, line: 53, baseType: !840)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !814, line: 359, size: 128, elements: !842)
!842 = !{!843, !844}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !841, file: !814, line: 360, baseType: !620, size: 32)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !841, file: !814, line: 361, baseType: !845, size: 64, offset: 64)
!845 = !DICompositeType(tag: DW_TAG_array_type, baseType: !811, size: 64, elements: !734)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !832, file: !814, line: 173, baseType: !5, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !832, file: !814, line: 174, baseType: !848, size: 32)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !814, line: 133, baseType: !849)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !814, line: 115, size: 32, elements: !850)
!850 = !{!851, !852, !853, !854, !855, !856, !857, !858}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !849, file: !814, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !849, file: !814, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !849, file: !814, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !849, file: !814, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !849, file: !814, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !849, file: !814, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !849, file: !814, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !849, file: !814, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !832, file: !814, line: 175, baseType: !860, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !814, line: 175, flags: DIFlagFwdDecl)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !832, file: !814, line: 176, baseType: !863, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !865, line: 75, size: 256, elements: !866)
!865 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!866 = !{!867, !881, !882, !883}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !864, file: !865, line: 76, baseType: !868, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !865, line: 68, baseType: !870)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !865, line: 63, size: 320, elements: !871)
!871 = !{!872, !874, !875, !876}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !870, file: !865, line: 64, baseType: !873, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !870, file: !865, line: 65, baseType: !873, size: 64, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !870, file: !865, line: 66, baseType: !7, size: 32, offset: 128)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !870, file: !865, line: 67, baseType: !877, size: 128, offset: 192)
!877 = !DICompositeType(tag: DW_TAG_array_type, baseType: !878, size: 128, elements: !879)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !865, line: 29, baseType: !689)
!879 = !{!880}
!880 = !DISubrange(count: 2)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !864, file: !865, line: 77, baseType: !868, size: 64, offset: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !864, file: !865, line: 78, baseType: !7, size: 32, offset: 128)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !864, file: !865, line: 79, baseType: !884, size: 64, offset: 192)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !865, line: 49, baseType: !886)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !865, line: 45, size: 832, elements: !887)
!887 = !{!888, !889, !890}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !886, file: !865, line: 46, baseType: !873, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !886, file: !865, line: 47, baseType: !863, size: 64, offset: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !886, file: !865, line: 48, baseType: !891, size: 704, offset: 128)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !892, line: 164, size: 704, elements: !893)
!892 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!893 = !{!894, !895, !905, !906, !907, !908, !909, !910, !914, !918, !919, !920, !921}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !891, file: !892, line: 166, baseType: !691, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !891, file: !892, line: 167, baseType: !896, size: 64, offset: 64)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !892, line: 157, size: 192, elements: !898)
!898 = !{!899, !900, !901}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !897, file: !892, line: 159, baseType: !622, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !897, file: !892, line: 160, baseType: !896, size: 64, offset: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !897, file: !892, line: 161, baseType: !902, size: 32, offset: 128)
!902 = !DICompositeType(tag: DW_TAG_array_type, baseType: !623, size: 32, elements: !903)
!903 = !{!904}
!904 = !DISubrange(count: 4)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !891, file: !892, line: 168, baseType: !622, size: 64, offset: 128)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !891, file: !892, line: 169, baseType: !622, size: 64, offset: 192)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !891, file: !892, line: 170, baseType: !622, size: 64, offset: 256)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !891, file: !892, line: 171, baseType: !691, size: 64, offset: 320)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !891, file: !892, line: 172, baseType: !620, size: 32, offset: 384)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !891, file: !892, line: 176, baseType: !911, size: 64, offset: 448)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DISubroutineType(types: !913)
!913 = !{!896, !624, !691}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !891, file: !892, line: 177, baseType: !915, size: 64, offset: 512)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DISubroutineType(types: !917)
!917 = !{null, !624, !896}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !891, file: !892, line: 178, baseType: !624, size: 64, offset: 576)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !891, file: !892, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !891, file: !892, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !891, file: !892, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !832, file: !814, line: 177, baseType: !672, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !832, file: !814, line: 178, baseType: !924, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !337, line: 217, size: 832, elements: !926)
!926 = !{!927, !1174, !1175, !1176, !1179, !1183, !1184, !1185, !1203, !1204, !1205, !1206, !1207, !1208}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !925, file: !337, line: 219, baseType: !928, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !337, line: 151, baseType: !930)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !337, line: 151, size: 128, elements: !931)
!931 = !{!932}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !930, file: !337, line: 151, baseType: !933, size: 128)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !337, line: 150, baseType: !934)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !337, line: 150, size: 128, elements: !935)
!935 = !{!936, !937, !938}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !934, file: !337, line: 150, baseType: !7, size: 32)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !934, file: !337, line: 150, baseType: !7, size: 32, offset: 32)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !934, file: !337, line: 150, baseType: !939, size: 64, offset: 64)
!939 = !DICompositeType(tag: DW_TAG_array_type, baseType: !940, size: 64, elements: !734)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !673, line: 108, baseType: !941)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !337, line: 122, size: 512, elements: !943)
!943 = !{!944, !945, !946, !1166, !1167, !1168, !1169, !1170, !1171, !1172}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !942, file: !337, line: 124, baseType: !924, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !942, file: !337, line: 125, baseType: !924, size: 64, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !942, file: !337, line: 131, baseType: !947, size: 64, offset: 128)
!947 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !337, line: 128, size: 64, elements: !948)
!948 = !{!949, !1165}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !947, file: !337, line: 129, baseType: !950, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !673, line: 66, baseType: !951)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !953, line: 143, size: 192, elements: !954)
!953 = !DIFile(filename: "./gimple.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!954 = !{!955, !1163, !1164}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !952, file: !953, line: 145, baseType: !956, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !673, line: 69, baseType: !957)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !953, line: 136, size: 192, elements: !959)
!959 = !{!960, !1161, !1162}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !958, file: !953, line: 137, baseType: !961, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !673, line: 58, baseType: !962)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !953, line: 737, size: 768, elements: !964)
!964 = !{!965, !982, !1016, !1022, !1027, !1032, !1039, !1045, !1051, !1056, !1070, !1075, !1081, !1086, !1096, !1101, !1119, !1126, !1133, !1139, !1144, !1150, !1156}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !963, file: !953, line: 738, baseType: !966, size: 256)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !953, line: 271, size: 256, elements: !967)
!967 = !{!968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !966, file: !953, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !966, file: !953, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !966, file: !953, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !966, file: !953, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !966, file: !953, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !966, file: !953, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !966, file: !953, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !966, file: !953, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !966, file: !953, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !966, file: !953, line: 312, baseType: !7, size: 32, offset: 32)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !966, file: !953, line: 316, baseType: !760, size: 32, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !966, file: !953, line: 319, baseType: !7, size: 32, offset: 96)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !966, file: !953, line: 323, baseType: !924, size: 64, offset: 128)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !966, file: !953, line: 327, baseType: !672, size: 64, offset: 192)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !963, file: !953, line: 739, baseType: !983, size: 448)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !953, line: 350, size: 448, elements: !984)
!984 = !{!985, !1014}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !983, file: !953, line: 353, baseType: !986, size: 384)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !953, line: 333, size: 384, elements: !987)
!987 = !{!988, !989, !997}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !986, file: !953, line: 336, baseType: !966, size: 256)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !986, file: !953, line: 343, baseType: !990, size: 64, offset: 256)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !992, line: 37, size: 128, elements: !993)
!992 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!993 = !{!994, !995}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !991, file: !992, line: 39, baseType: !990, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !991, file: !992, line: 40, baseType: !996, size: 64, offset: 64)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !986, file: !953, line: 344, baseType: !998, size: 64, offset: 320)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !992, line: 45, size: 320, elements: !1000)
!1000 = !{!1001, !1002}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !999, file: !992, line: 47, baseType: !998, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !999, file: !992, line: 48, baseType: !1003, size: 256, offset: 64)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !135, line: 1883, size: 256, elements: !1004)
!1004 = !{!1005, !1007, !1008, !1013}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1003, file: !135, line: 1884, baseType: !1006, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1003, file: !135, line: 1885, baseType: !1006, size: 64, offset: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1003, file: !135, line: 1891, baseType: !1009, size: 64, offset: 128)
!1009 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1003, file: !135, line: 1891, size: 64, elements: !1010)
!1010 = !{!1011, !1012}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1009, file: !135, line: 1891, baseType: !961, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1009, file: !135, line: 1891, baseType: !672, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1003, file: !135, line: 1892, baseType: !996, size: 64, offset: 192)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !983, file: !953, line: 359, baseType: !1015, size: 64, offset: 384)
!1015 = !DICompositeType(tag: DW_TAG_array_type, baseType: !672, size: 64, elements: !734)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !963, file: !953, line: 740, baseType: !1017, size: 512)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !953, line: 365, size: 512, elements: !1018)
!1018 = !{!1019, !1020, !1021}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1017, file: !953, line: 368, baseType: !986, size: 384)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1017, file: !953, line: 373, baseType: !672, size: 64, offset: 384)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1017, file: !953, line: 374, baseType: !672, size: 64, offset: 448)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !963, file: !953, line: 741, baseType: !1023, size: 576)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !953, line: 380, size: 576, elements: !1024)
!1024 = !{!1025, !1026}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1023, file: !953, line: 383, baseType: !1017, size: 512)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1023, file: !953, line: 389, baseType: !1015, size: 64, offset: 512)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !963, file: !953, line: 742, baseType: !1028, size: 320)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !953, line: 395, size: 320, elements: !1029)
!1029 = !{!1030, !1031}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1028, file: !953, line: 397, baseType: !966, size: 256)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1028, file: !953, line: 400, baseType: !950, size: 64, offset: 256)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !963, file: !953, line: 743, baseType: !1033, size: 448)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !953, line: 406, size: 448, elements: !1034)
!1034 = !{!1035, !1036, !1037, !1038}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1033, file: !953, line: 408, baseType: !966, size: 256)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1033, file: !953, line: 412, baseType: !672, size: 64, offset: 256)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1033, file: !953, line: 420, baseType: !672, size: 64, offset: 320)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1033, file: !953, line: 423, baseType: !950, size: 64, offset: 384)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !963, file: !953, line: 744, baseType: !1040, size: 384)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !953, line: 429, size: 384, elements: !1041)
!1041 = !{!1042, !1043, !1044}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1040, file: !953, line: 431, baseType: !966, size: 256)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1040, file: !953, line: 434, baseType: !672, size: 64, offset: 256)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1040, file: !953, line: 437, baseType: !950, size: 64, offset: 320)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !963, file: !953, line: 745, baseType: !1046, size: 384)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !953, line: 443, size: 384, elements: !1047)
!1047 = !{!1048, !1049, !1050}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1046, file: !953, line: 445, baseType: !966, size: 256)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1046, file: !953, line: 449, baseType: !672, size: 64, offset: 256)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1046, file: !953, line: 453, baseType: !950, size: 64, offset: 320)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !963, file: !953, line: 746, baseType: !1052, size: 320)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !953, line: 459, size: 320, elements: !1053)
!1053 = !{!1054, !1055}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1052, file: !953, line: 461, baseType: !966, size: 256)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1052, file: !953, line: 464, baseType: !672, size: 64, offset: 256)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !963, file: !953, line: 747, baseType: !1057, size: 768)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !953, line: 469, size: 768, elements: !1058)
!1058 = !{!1059, !1060, !1061, !1062, !1063}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1057, file: !953, line: 471, baseType: !966, size: 256)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1057, file: !953, line: 474, baseType: !7, size: 32, offset: 256)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1057, file: !953, line: 475, baseType: !7, size: 32, offset: 288)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1057, file: !953, line: 478, baseType: !672, size: 64, offset: 320)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1057, file: !953, line: 481, baseType: !1064, size: 384, offset: 384)
!1064 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1065, size: 384, elements: !734)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !135, line: 1917, size: 384, elements: !1066)
!1066 = !{!1067, !1068, !1069}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1065, file: !135, line: 1920, baseType: !1003, size: 256)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1065, file: !135, line: 1921, baseType: !672, size: 64, offset: 256)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1065, file: !135, line: 1922, baseType: !760, size: 32, offset: 320)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !963, file: !953, line: 748, baseType: !1071, size: 320)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !953, line: 487, size: 320, elements: !1072)
!1072 = !{!1073, !1074}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1071, file: !953, line: 490, baseType: !966, size: 256)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1071, file: !953, line: 494, baseType: !620, size: 32, offset: 256)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !963, file: !953, line: 749, baseType: !1076, size: 384)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !953, line: 500, size: 384, elements: !1077)
!1077 = !{!1078, !1079, !1080}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1076, file: !953, line: 502, baseType: !966, size: 256)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1076, file: !953, line: 506, baseType: !950, size: 64, offset: 256)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1076, file: !953, line: 510, baseType: !950, size: 64, offset: 320)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !963, file: !953, line: 750, baseType: !1082, size: 320)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !953, line: 529, size: 320, elements: !1083)
!1083 = !{!1084, !1085}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1082, file: !953, line: 531, baseType: !966, size: 256)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1082, file: !953, line: 540, baseType: !950, size: 64, offset: 256)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !963, file: !953, line: 751, baseType: !1087, size: 704)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !953, line: 546, size: 704, elements: !1088)
!1088 = !{!1089, !1090, !1091, !1092, !1093, !1094, !1095}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1087, file: !953, line: 549, baseType: !1017, size: 512)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1087, file: !953, line: 553, baseType: !625, size: 64, offset: 512)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1087, file: !953, line: 557, baseType: !619, size: 8, offset: 576)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1087, file: !953, line: 558, baseType: !619, size: 8, offset: 584)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1087, file: !953, line: 559, baseType: !619, size: 8, offset: 592)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1087, file: !953, line: 560, baseType: !619, size: 8, offset: 600)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1087, file: !953, line: 566, baseType: !1015, size: 64, offset: 640)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !963, file: !953, line: 752, baseType: !1097, size: 384)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !953, line: 571, size: 384, elements: !1098)
!1098 = !{!1099, !1100}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1097, file: !953, line: 573, baseType: !1028, size: 320)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1097, file: !953, line: 577, baseType: !672, size: 64, offset: 320)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !963, file: !953, line: 753, baseType: !1102, size: 576)
!1102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !953, line: 600, size: 576, elements: !1103)
!1103 = !{!1104, !1105, !1106, !1109, !1118}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1102, file: !953, line: 602, baseType: !1028, size: 320)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1102, file: !953, line: 605, baseType: !672, size: 64, offset: 320)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1102, file: !953, line: 609, baseType: !1107, size: 64, offset: 384)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1108, line: 46, baseType: !689)
!1108 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1102, file: !953, line: 612, baseType: !1110, size: 64, offset: 448)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !953, line: 581, size: 320, elements: !1112)
!1112 = !{!1113, !1114, !1115, !1116, !1117}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1111, file: !953, line: 583, baseType: !134, size: 32)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1111, file: !953, line: 586, baseType: !672, size: 64, offset: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1111, file: !953, line: 589, baseType: !672, size: 64, offset: 128)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1111, file: !953, line: 592, baseType: !672, size: 64, offset: 192)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1111, file: !953, line: 595, baseType: !672, size: 64, offset: 256)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1102, file: !953, line: 616, baseType: !950, size: 64, offset: 512)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !963, file: !953, line: 754, baseType: !1120, size: 512)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !953, line: 622, size: 512, elements: !1121)
!1121 = !{!1122, !1123, !1124, !1125}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1120, file: !953, line: 624, baseType: !1028, size: 320)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1120, file: !953, line: 628, baseType: !672, size: 64, offset: 320)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1120, file: !953, line: 632, baseType: !672, size: 64, offset: 384)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1120, file: !953, line: 636, baseType: !672, size: 64, offset: 448)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !963, file: !953, line: 755, baseType: !1127, size: 704)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !953, line: 642, size: 704, elements: !1128)
!1128 = !{!1129, !1130, !1131, !1132}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1127, file: !953, line: 644, baseType: !1120, size: 512)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1127, file: !953, line: 648, baseType: !672, size: 64, offset: 512)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1127, file: !953, line: 652, baseType: !672, size: 64, offset: 576)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1127, file: !953, line: 653, baseType: !672, size: 64, offset: 640)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !963, file: !953, line: 756, baseType: !1134, size: 448)
!1134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !953, line: 663, size: 448, elements: !1135)
!1135 = !{!1136, !1137, !1138}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1134, file: !953, line: 665, baseType: !1028, size: 320)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1134, file: !953, line: 668, baseType: !672, size: 64, offset: 320)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1134, file: !953, line: 673, baseType: !672, size: 64, offset: 384)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !963, file: !953, line: 757, baseType: !1140, size: 384)
!1140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !953, line: 694, size: 384, elements: !1141)
!1141 = !{!1142, !1143}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1140, file: !953, line: 696, baseType: !1028, size: 320)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1140, file: !953, line: 699, baseType: !672, size: 64, offset: 320)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !963, file: !953, line: 758, baseType: !1145, size: 384)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !953, line: 681, size: 384, elements: !1146)
!1146 = !{!1147, !1148, !1149}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1145, file: !953, line: 683, baseType: !966, size: 256)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1145, file: !953, line: 686, baseType: !672, size: 64, offset: 256)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1145, file: !953, line: 689, baseType: !672, size: 64, offset: 320)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !963, file: !953, line: 759, baseType: !1151, size: 384)
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !953, line: 707, size: 384, elements: !1152)
!1152 = !{!1153, !1154, !1155}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1151, file: !953, line: 709, baseType: !966, size: 256)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1151, file: !953, line: 712, baseType: !672, size: 64, offset: 256)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1151, file: !953, line: 712, baseType: !672, size: 64, offset: 320)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !963, file: !953, line: 760, baseType: !1157, size: 320)
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !953, line: 718, size: 320, elements: !1158)
!1158 = !{!1159, !1160}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1157, file: !953, line: 720, baseType: !966, size: 256)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1157, file: !953, line: 723, baseType: !672, size: 64, offset: 256)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !958, file: !953, line: 138, baseType: !957, size: 64, offset: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !958, file: !953, line: 139, baseType: !957, size: 64, offset: 128)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !952, file: !953, line: 146, baseType: !956, size: 64, offset: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !952, file: !953, line: 152, baseType: !950, size: 64, offset: 128)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !947, file: !337, line: 130, baseType: !811, size: 64)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !942, file: !337, line: 134, baseType: !624, size: 64, offset: 192)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !942, file: !337, line: 137, baseType: !672, size: 64, offset: 256)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !942, file: !337, line: 138, baseType: !760, size: 32, offset: 320)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !942, file: !337, line: 142, baseType: !7, size: 32, offset: 352)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !942, file: !337, line: 144, baseType: !620, size: 32, offset: 384)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !942, file: !337, line: 145, baseType: !620, size: 32, offset: 416)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !942, file: !337, line: 146, baseType: !1173, size: 64, offset: 448)
!1173 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !337, line: 119, baseType: !691)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !925, file: !337, line: 220, baseType: !928, size: 64, offset: 64)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !925, file: !337, line: 223, baseType: !624, size: 64, offset: 128)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !925, file: !337, line: 226, baseType: !1177, size: 64, offset: 192)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64)
!1178 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !337, line: 185, flags: DIFlagFwdDecl)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !925, file: !337, line: 229, baseType: !1180, size: 128, offset: 256)
!1180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1181, size: 128, elements: !879)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64)
!1182 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !337, line: 229, flags: DIFlagFwdDecl)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !925, file: !337, line: 232, baseType: !924, size: 64, offset: 384)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !925, file: !337, line: 233, baseType: !924, size: 64, offset: 448)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !925, file: !337, line: 238, baseType: !1186, size: 64, offset: 512)
!1186 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !337, line: 235, size: 64, elements: !1187)
!1187 = !{!1188, !1194}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1186, file: !337, line: 236, baseType: !1189, size: 64)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !337, line: 273, size: 128, elements: !1191)
!1191 = !{!1192, !1193}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1190, file: !337, line: 275, baseType: !950, size: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1190, file: !337, line: 278, baseType: !950, size: 64, offset: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1186, file: !337, line: 237, baseType: !1195, size: 64)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64)
!1196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !337, line: 259, size: 320, elements: !1197)
!1197 = !{!1198, !1199, !1200, !1201, !1202}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1196, file: !337, line: 261, baseType: !811, size: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1196, file: !337, line: 262, baseType: !811, size: 64, offset: 64)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1196, file: !337, line: 266, baseType: !811, size: 64, offset: 128)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1196, file: !337, line: 267, baseType: !811, size: 64, offset: 192)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1196, file: !337, line: 270, baseType: !620, size: 32, offset: 256)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !925, file: !337, line: 241, baseType: !1173, size: 64, offset: 576)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !925, file: !337, line: 244, baseType: !620, size: 32, offset: 640)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !925, file: !337, line: 247, baseType: !620, size: 32, offset: 672)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !925, file: !337, line: 250, baseType: !620, size: 32, offset: 704)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !925, file: !337, line: 253, baseType: !620, size: 32, offset: 736)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !925, file: !337, line: 256, baseType: !620, size: 32, offset: 768)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !832, file: !814, line: 179, baseType: !1210, size: 64)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !814, line: 150, baseType: !1212)
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !814, line: 142, size: 320, elements: !1213)
!1213 = !{!1214, !1215, !1216, !1217, !1220, !1221}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1212, file: !814, line: 144, baseType: !672, size: 64)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1212, file: !814, line: 145, baseType: !811, size: 64, offset: 64)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1212, file: !814, line: 146, baseType: !811, size: 64, offset: 128)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1212, file: !814, line: 147, baseType: !1218, size: 32, offset: 192)
!1218 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1219, line: 31, baseType: !620)
!1219 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1212, file: !814, line: 148, baseType: !7, size: 32, offset: 224)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1212, file: !814, line: 149, baseType: !619, size: 8, offset: 256)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !832, file: !814, line: 180, baseType: !1223, size: 64)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !814, line: 162, baseType: !1225)
!1225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !814, line: 159, size: 128, elements: !1226)
!1226 = !{!1227, !1228}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1225, file: !814, line: 160, baseType: !672, size: 64)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1225, file: !814, line: 161, baseType: !691, size: 64, offset: 64)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !832, file: !814, line: 181, baseType: !1230, size: 64)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64)
!1231 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !814, line: 181, flags: DIFlagFwdDecl)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !827, file: !814, line: 317, baseType: !1233, size: 64)
!1233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !691, size: 64, elements: !734)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !827, file: !814, line: 318, baseType: !1235, size: 320)
!1235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !814, line: 188, size: 320, elements: !1236)
!1236 = !{!1237, !1239, !1296}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1235, file: !814, line: 190, baseType: !1238, size: 192)
!1238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !831, size: 192, elements: !709)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1235, file: !814, line: 193, baseType: !1240, size: 64, offset: 192)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64)
!1241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !814, line: 206, size: 320, elements: !1242)
!1242 = !{!1243, !1281, !1282, !1283, !1295}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1241, file: !814, line: 208, baseType: !1244, size: 64)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64)
!1245 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !673, line: 62, baseType: !1246)
!1246 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1247, line: 538, size: 256, elements: !1248)
!1247 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1248 = !{!1249, !1253, !1259, !1272}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1246, file: !1247, line: 539, baseType: !1250, size: 32)
!1250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1247, line: 482, size: 32, elements: !1251)
!1251 = !{!1252}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1250, file: !1247, line: 484, baseType: !7, size: 32)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1246, file: !1247, line: 540, baseType: !1254, size: 192)
!1254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1247, line: 488, size: 192, elements: !1255)
!1255 = !{!1256, !1257, !1258}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1254, file: !1247, line: 489, baseType: !1250, size: 32)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1254, file: !1247, line: 492, baseType: !625, size: 64, offset: 64)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1254, file: !1247, line: 496, baseType: !672, size: 64, offset: 128)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1246, file: !1247, line: 541, baseType: !1260, size: 256)
!1260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1247, line: 504, size: 256, elements: !1261)
!1261 = !{!1262, !1263, !1270, !1271}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1260, file: !1247, line: 505, baseType: !1250, size: 32)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1260, file: !1247, line: 509, baseType: !1264, size: 64, offset: 64)
!1264 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1247, line: 501, baseType: !1265)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64)
!1266 = !DISubroutineType(types: !1267)
!1267 = !{null, !1268}
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64)
!1269 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1260, file: !1247, line: 510, baseType: !1268, size: 64, offset: 128)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1260, file: !1247, line: 513, baseType: !1244, size: 64, offset: 192)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1246, file: !1247, line: 542, baseType: !1273, size: 128)
!1273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1247, line: 530, size: 128, elements: !1274)
!1274 = !{!1275, !1276}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1273, file: !1247, line: 531, baseType: !1250, size: 32)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1273, file: !1247, line: 534, baseType: !1277, size: 64, offset: 64)
!1277 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1247, line: 525, baseType: !1278)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64)
!1279 = !DISubroutineType(types: !1280)
!1280 = !{!619, !672, !625, !689, !689}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1241, file: !814, line: 211, baseType: !7, size: 32, offset: 64)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1241, file: !814, line: 214, baseType: !691, size: 64, offset: 128)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1241, file: !814, line: 224, baseType: !1284, size: 64, offset: 192)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64)
!1285 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !814, line: 202, baseType: !1286)
!1286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !814, line: 202, size: 128, elements: !1287)
!1287 = !{!1288}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1286, file: !814, line: 202, baseType: !1289, size: 128)
!1289 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !814, line: 200, baseType: !1290)
!1290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !814, line: 200, size: 128, elements: !1291)
!1291 = !{!1292, !1293, !1294}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1290, file: !814, line: 200, baseType: !7, size: 32)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1290, file: !814, line: 200, baseType: !7, size: 32, offset: 32)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1290, file: !814, line: 200, baseType: !845, size: 64, offset: 64)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1241, file: !814, line: 234, baseType: !1284, size: 64, offset: 256)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1235, file: !814, line: 197, baseType: !691, size: 64, offset: 256)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !827, file: !814, line: 319, baseType: !698, size: 256)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !827, file: !814, line: 320, baseType: !717, size: 192)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !675, file: !135, line: 3384, baseType: !1300, size: 1472)
!1300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !135, line: 3114, size: 1472, elements: !1301)
!1301 = !{!1302, !1323, !1324, !1325, !1326}
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1300, file: !135, line: 3115, baseType: !1303, size: 1216)
!1303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !135, line: 2984, size: 1216, elements: !1304)
!1304 = !{!1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1303, file: !135, line: 2985, baseType: !807, size: 960)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1303, file: !135, line: 2986, baseType: !672, size: 64, offset: 960)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1303, file: !135, line: 2987, baseType: !672, size: 64, offset: 1024)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1303, file: !135, line: 2988, baseType: !672, size: 64, offset: 1088)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1303, file: !135, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1303, file: !135, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1303, file: !135, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1303, file: !135, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1303, file: !135, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1303, file: !135, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1303, file: !135, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1303, file: !135, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1303, file: !135, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1303, file: !135, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1303, file: !135, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1303, file: !135, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1303, file: !135, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1303, file: !135, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1300, file: !135, line: 3117, baseType: !672, size: 64, offset: 1216)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1300, file: !135, line: 3119, baseType: !672, size: 64, offset: 1280)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1300, file: !135, line: 3121, baseType: !672, size: 64, offset: 1344)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1300, file: !135, line: 3123, baseType: !672, size: 64, offset: 1408)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !675, file: !135, line: 3385, baseType: !1328, size: 1088)
!1328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !135, line: 2874, size: 1088, elements: !1329)
!1329 = !{!1330, !1331, !1332}
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1328, file: !135, line: 2875, baseType: !807, size: 960)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1328, file: !135, line: 2876, baseType: !811, size: 64, offset: 960)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1328, file: !135, line: 2877, baseType: !1333, size: 64, offset: 1024)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64)
!1334 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !135, line: 2856, flags: DIFlagFwdDecl)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !675, file: !135, line: 3386, baseType: !1303, size: 1216)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !675, file: !135, line: 3387, baseType: !1337, size: 1280)
!1337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !135, line: 3093, size: 1280, elements: !1338)
!1338 = !{!1339, !1340}
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1337, file: !135, line: 3094, baseType: !1303, size: 1216)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1337, file: !135, line: 3095, baseType: !1333, size: 64, offset: 1216)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !675, file: !135, line: 3388, baseType: !1342, size: 1216)
!1342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !135, line: 2824, size: 1216, elements: !1343)
!1343 = !{!1344, !1345, !1346, !1347, !1348, !1349}
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1342, file: !135, line: 2825, baseType: !766, size: 896)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1342, file: !135, line: 2827, baseType: !672, size: 64, offset: 896)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1342, file: !135, line: 2828, baseType: !672, size: 64, offset: 960)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1342, file: !135, line: 2829, baseType: !672, size: 64, offset: 1024)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1342, file: !135, line: 2830, baseType: !672, size: 64, offset: 1088)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1342, file: !135, line: 2831, baseType: !672, size: 64, offset: 1152)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !675, file: !135, line: 3389, baseType: !1351, size: 1024)
!1351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !135, line: 2850, size: 1024, elements: !1352)
!1352 = !{!1353, !1354, !1355}
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1351, file: !135, line: 2851, baseType: !807, size: 960)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1351, file: !135, line: 2852, baseType: !620, size: 32, offset: 960)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1351, file: !135, line: 2853, baseType: !620, size: 32, offset: 992)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !675, file: !135, line: 3390, baseType: !1357, size: 1024)
!1357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !135, line: 2857, size: 1024, elements: !1358)
!1358 = !{!1359, !1360}
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1357, file: !135, line: 2858, baseType: !807, size: 960)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1357, file: !135, line: 2859, baseType: !1333, size: 64, offset: 960)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !675, file: !135, line: 3391, baseType: !1362, size: 960)
!1362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !135, line: 2862, size: 960, elements: !1363)
!1363 = !{!1364}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1362, file: !135, line: 2863, baseType: !807, size: 960)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !675, file: !135, line: 3392, baseType: !1366, size: 1472)
!1366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !135, line: 3304, size: 1472, elements: !1367)
!1367 = !{!1368}
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1366, file: !135, line: 3305, baseType: !1300, size: 1472)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !675, file: !135, line: 3393, baseType: !1370, size: 1792)
!1370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !135, line: 3248, size: 1792, elements: !1371)
!1371 = !{!1372, !1373, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679}
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1370, file: !135, line: 3249, baseType: !1300, size: 1472)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1370, file: !135, line: 3251, baseType: !1374, size: 64, offset: 1472)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64)
!1375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1376, line: 463, size: 1152, elements: !1377)
!1376 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1377 = !{!1378, !1537, !1568, !1569, !1572, !1575, !1576, !1577, !1578, !1579, !1580, !1604, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658}
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1375, file: !1376, line: 464, baseType: !1379, size: 64)
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64)
!1380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !330, line: 194, size: 384, elements: !1381)
!1381 = !{!1382, !1431, !1444, !1458, !1506, !1518}
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !1380, file: !330, line: 197, baseType: !1383, size: 64)
!1383 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !330, line: 182, baseType: !1384)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64)
!1385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !330, line: 116, size: 704, elements: !1386)
!1386 = !{!1387, !1388, !1389, !1390, !1391, !1392, !1419, !1428, !1429, !1430}
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !1385, file: !330, line: 119, baseType: !1384, size: 64)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1385, file: !330, line: 122, baseType: !1384, size: 64, offset: 64)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !1385, file: !330, line: 123, baseType: !1384, size: 64, offset: 128)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1385, file: !330, line: 126, baseType: !620, size: 32, offset: 192)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1385, file: !330, line: 129, baseType: !329, size: 32, offset: 224)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1385, file: !330, line: 165, baseType: !1393, size: 192, offset: 256)
!1393 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !330, line: 132, size: 192, elements: !1394)
!1394 = !{!1395, !1408, !1414}
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !1393, file: !330, line: 137, baseType: !1396, size: 128)
!1396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !330, line: 133, size: 128, elements: !1397)
!1397 = !{!1398, !1407}
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !1396, file: !330, line: 135, baseType: !1399, size: 64)
!1399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1400, size: 64)
!1400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !330, line: 93, size: 320, elements: !1401)
!1401 = !{!1402, !1403, !1404, !1405, !1406}
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !1400, file: !330, line: 96, baseType: !1399, size: 64)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !1400, file: !330, line: 97, baseType: !1399, size: 64, offset: 64)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1400, file: !330, line: 101, baseType: !672, size: 64, offset: 128)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !1400, file: !330, line: 106, baseType: !672, size: 64, offset: 192)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1400, file: !330, line: 111, baseType: !672, size: 64, offset: 256)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !1396, file: !330, line: 136, baseType: !1399, size: 64, offset: 64)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !1393, file: !330, line: 151, baseType: !1409, size: 192)
!1409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !330, line: 139, size: 192, elements: !1410)
!1410 = !{!1411, !1412, !1413}
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1409, file: !330, line: 141, baseType: !672, size: 64)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1409, file: !330, line: 145, baseType: !672, size: 64, offset: 64)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1409, file: !330, line: 150, baseType: !620, size: 32, offset: 128)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !1393, file: !330, line: 164, baseType: !1415, size: 128)
