; ModuleID = 'c-format.bc'
source_filename = "c-format.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }
%struct.tree_decl_minimal = type { %struct.tree_common, i32, i32, %union.tree_node*, %union.tree_node* }
%struct.tree_common = type { %struct.tree_base, %union.tree_node*, %union.tree_node* }
%struct.tree_base = type { i64 }

!205 = !DIEnumerator(name: "REDUC_MAX_EXPR", value: 164, isUnsigned: true)
!206 = !DIEnumerator(name: "REDUC_MIN_EXPR", value: 165, isUnsigned: true)
!207 = !DIEnumerator(name: "REDUC_PLUS_EXPR", value: 166, isUnsigned: true)
!208 = !DIEnumerator(name: "DOT_PROD_EXPR", value: 167, isUnsigned: true)
!209 = !DIEnumerator(name: "WIDEN_SUM_EXPR", value: 168, isUnsigned: true)
!210 = !DIEnumerator(name: "WIDEN_MULT_EXPR", value: 169, isUnsigned: true)
!211 = !DIEnumerator(name: "VEC_LSHIFT_EXPR", value: 170, isUnsigned: true)
!212 = !DIEnumerator(name: "VEC_RSHIFT_EXPR", value: 171, isUnsigned: true)
!213 = !DIEnumerator(name: "VEC_WIDEN_MULT_HI_EXPR", value: 172, isUnsigned: true)
!214 = !DIEnumerator(name: "VEC_WIDEN_MULT_LO_EXPR", value: 173, isUnsigned: true)
!215 = !DIEnumerator(name: "VEC_UNPACK_HI_EXPR", value: 174, isUnsigned: true)
!216 = !DIEnumerator(name: "VEC_UNPACK_LO_EXPR", value: 175, isUnsigned: true)
!217 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_HI_EXPR", value: 176, isUnsigned: true)
!218 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_LO_EXPR", value: 177, isUnsigned: true)
!219 = !DIEnumerator(name: "VEC_PACK_TRUNC_EXPR", value: 178, isUnsigned: true)
!220 = !DIEnumerator(name: "VEC_PACK_SAT_EXPR", value: 179, isUnsigned: true)
!221 = !DIEnumerator(name: "VEC_PACK_FIX_TRUNC_EXPR", value: 180, isUnsigned: true)
!222 = !DIEnumerator(name: "VEC_EXTRACT_EVEN_EXPR", value: 181, isUnsigned: true)
!223 = !DIEnumerator(name: "VEC_EXTRACT_ODD_EXPR", value: 182, isUnsigned: true)
!224 = !DIEnumerator(name: "VEC_INTERLEAVE_HIGH_EXPR", value: 183, isUnsigned: true)
!225 = !DIEnumerator(name: "VEC_INTERLEAVE_LOW_EXPR", value: 184, isUnsigned: true)
!226 = !DIEnumerator(name: "PREDICT_EXPR", value: 185, isUnsigned: true)
!227 = !DIEnumerator(name: "OPTIMIZATION_NODE", value: 186, isUnsigned: true)
!228 = !DIEnumerator(name: "TARGET_OPTION_NODE", value: 187, isUnsigned: true)
!229 = !DIEnumerator(name: "LAST_AND_UNUSED_TREE_CODE", value: 188, isUnsigned: true)
!230 = !DIEnumerator(name: "C_MAYBE_CONST_EXPR", value: 189, isUnsigned: true)
!231 = !DIEnumerator(name: "EXCESS_PRECISION_EXPR", value: 190, isUnsigned: true)
!232 = !DIEnumerator(name: "MAX_TREE_CODES", value: 191, isUnsigned: true)
!233 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "format_lengths", file: !234, line: 26, baseType: !7, size: 32, elements: !235)
!234 = !DIFile(filename: "./c-format.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!235 = !{!236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248}
!236 = !DIEnumerator(name: "FMT_LEN_none", value: 0, isUnsigned: true)
!237 = !DIEnumerator(name: "FMT_LEN_hh", value: 1, isUnsigned: true)
!238 = !DIEnumerator(name: "FMT_LEN_h", value: 2, isUnsigned: true)
!239 = !DIEnumerator(name: "FMT_LEN_l", value: 3, isUnsigned: true)
!240 = !DIEnumerator(name: "FMT_LEN_ll", value: 4, isUnsigned: true)
!241 = !DIEnumerator(name: "FMT_LEN_L", value: 5, isUnsigned: true)
!242 = !DIEnumerator(name: "FMT_LEN_z", value: 6, isUnsigned: true)
!243 = !DIEnumerator(name: "FMT_LEN_t", value: 7, isUnsigned: true)
!244 = !DIEnumerator(name: "FMT_LEN_j", value: 8, isUnsigned: true)
!245 = !DIEnumerator(name: "FMT_LEN_H", value: 9, isUnsigned: true)
!246 = !DIEnumerator(name: "FMT_LEN_D", value: 10, isUnsigned: true)
!247 = !DIEnumerator(name: "FMT_LEN_DD", value: 11, isUnsigned: true)
!248 = !DIEnumerator(name: "FMT_LEN_MAX", value: 12, isUnsigned: true)
!249 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "format_std_version", file: !234, line: 45, baseType: !7, size: 32, elements: !250)
!250 = !{!251, !252, !253, !254, !255}
!251 = !DIEnumerator(name: "STD_C89", value: 0, isUnsigned: true)
!252 = !DIEnumerator(name: "STD_C94", value: 1, isUnsigned: true)
!253 = !DIEnumerator(name: "STD_C9L", value: 2, isUnsigned: true)
!254 = !DIEnumerator(name: "STD_C99", value: 3, isUnsigned: true)
!255 = !DIEnumerator(name: "STD_EXT", value: 4, isUnsigned: true)
!256 = !{!257, !258, !259, !260, !263, !264, !266, !39, !906, !981, !268, !1006, !1008, !1009, !261, !1025, !1026}
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!259 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !262)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !267, line: 56, baseType: !268)
!267 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !6, line: 3371, size: 1792, elements: !270)
!270 = !{!271, !304, !310, !323, !330, !337, !342, !351, !357, !370, !382, !420, !428, !456, !464, !465, !470, !479, !485, !490, !494, !498, !527, !576, !582, !589, !596, !622, !647, !664, !676, !698, !716, !888}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !269, file: !6, line: 3372, baseType: !272, size: 64)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !6, line: 360, size: 64, elements: !273)
!273 = !{!274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !272, file: !6, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !272, file: !6, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !272, file: !6, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !272, file: !6, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !272, file: !6, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !272, file: !6, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !272, file: !6, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !272, file: !6, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !272, file: !6, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !272, file: !6, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !272, file: !6, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !272, file: !6, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !272, file: !6, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !272, file: !6, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !272, file: !6, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !272, file: !6, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !272, file: !6, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !272, file: !6, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !272, file: !6, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !272, file: !6, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !272, file: !6, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !272, file: !6, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !272, file: !6, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !272, file: !6, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !272, file: !6, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !272, file: !6, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !272, file: !6, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !272, file: !6, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !272, file: !6, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !272, file: !6, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !269, file: !6, line: 3373, baseType: !305, size: 192)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !6, line: 402, size: 192, elements: !306)
!306 = !{!307, !308, !309}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !305, file: !6, line: 403, baseType: !272, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !305, file: !6, line: 404, baseType: !266, size: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !305, file: !6, line: 405, baseType: !266, size: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !269, file: !6, line: 3374, baseType: !311, size: 320)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !6, line: 1384, size: 320, elements: !312)
!312 = !{!313, !314}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !311, file: !6, line: 1385, baseType: !305, size: 192)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !311, file: !6, line: 1386, baseType: !315, size: 128, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !316, line: 58, baseType: !317)
!316 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !316, line: 54, size: 128, elements: !318)
!318 = !{!319, !321}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !317, file: !316, line: 56, baseType: !320, size: 64)
!320 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !317, file: !316, line: 57, baseType: !322, size: 64, offset: 64)
!322 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !269, file: !6, line: 3375, baseType: !324, size: 256)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !6, line: 1397, size: 256, elements: !325)
!325 = !{!326, !327}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !324, file: !6, line: 1398, baseType: !305, size: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !324, file: !6, line: 1399, baseType: !328, size: 64, offset: 192)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !6, line: 1392, flags: DIFlagFwdDecl)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !269, file: !6, line: 3376, baseType: !331, size: 256)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !6, line: 1408, size: 256, elements: !332)
!332 = !{!333, !334}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !331, file: !6, line: 1409, baseType: !305, size: 192)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !331, file: !6, line: 1410, baseType: !335, size: 64, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !6, line: 1403, flags: DIFlagFwdDecl)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !269, file: !6, line: 3377, baseType: !338, size: 256)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !6, line: 1437, size: 256, elements: !339)
!339 = !{!340, !341}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !338, file: !6, line: 1438, baseType: !305, size: 192)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !338, file: !6, line: 1439, baseType: !266, size: 64, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !269, file: !6, line: 3378, baseType: !343, size: 256)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !6, line: 1418, size: 256, elements: !344)
!344 = !{!345, !346, !347}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !343, file: !6, line: 1419, baseType: !305, size: 192)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !343, file: !6, line: 1420, baseType: !259, size: 32, offset: 192)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !343, file: !6, line: 1421, baseType: !348, size: 8, offset: 224)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 8, elements: !349)
!349 = !{!350}
!350 = !DISubrange(count: 1)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !269, file: !6, line: 3379, baseType: !352, size: 320)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !6, line: 1428, size: 320, elements: !353)
!353 = !{!354, !355, !356}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !352, file: !6, line: 1429, baseType: !305, size: 192)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !352, file: !6, line: 1430, baseType: !266, size: 64, offset: 192)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !352, file: !6, line: 1431, baseType: !266, size: 64, offset: 256)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !269, file: !6, line: 3380, baseType: !358, size: 320)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !6, line: 1460, size: 320, elements: !359)
!359 = !{!360, !361}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !358, file: !6, line: 1461, baseType: !305, size: 192)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !358, file: !6, line: 1462, baseType: !362, size: 128, offset: 192)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !363, line: 31, size: 128, elements: !364)
!363 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!364 = !{!365, !368, !369}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !362, file: !363, line: 32, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !258)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !362, file: !363, line: 33, baseType: !7, size: 32, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !362, file: !363, line: 34, baseType: !7, size: 32, offset: 96)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !269, file: !6, line: 3381, baseType: !371, size: 384)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !6, line: 2507, size: 384, elements: !372)
!372 = !{!373, !374, !379, !380, !381}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !371, file: !6, line: 2508, baseType: !305, size: 192)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !371, file: !6, line: 2509, baseType: !375, size: 32, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !376, line: 58, baseType: !377)
!376 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !378, line: 44, baseType: !7)
!378 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!379 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !371, file: !6, line: 2510, baseType: !7, size: 32, offset: 224)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !371, file: !6, line: 2511, baseType: !266, size: 64, offset: 256)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !371, file: !6, line: 2512, baseType: !266, size: 64, offset: 320)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !269, file: !6, line: 3382, baseType: !383, size: 896)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !6, line: 2652, size: 896, elements: !384)
!384 = !{!385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !383, file: !6, line: 2653, baseType: !371, size: 384)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !383, file: !6, line: 2654, baseType: !266, size: 64, offset: 384)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !383, file: !6, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !383, file: !6, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !383, file: !6, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !383, file: !6, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !383, file: !6, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !383, file: !6, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !383, file: !6, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !383, file: !6, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !383, file: !6, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !383, file: !6, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !383, file: !6, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !383, file: !6, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !383, file: !6, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !383, file: !6, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !383, file: !6, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !383, file: !6, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !383, file: !6, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !383, file: !6, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !383, file: !6, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !383, file: !6, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !383, file: !6, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !383, file: !6, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !383, file: !6, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !383, file: !6, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !383, file: !6, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !383, file: !6, line: 2703, baseType: !7, size: 32, offset: 512)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !383, file: !6, line: 2705, baseType: !266, size: 64, offset: 576)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !383, file: !6, line: 2706, baseType: !266, size: 64, offset: 640)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !383, file: !6, line: 2707, baseType: !266, size: 64, offset: 704)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !383, file: !6, line: 2708, baseType: !266, size: 64, offset: 768)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !383, file: !6, line: 2711, baseType: !418, size: 64, offset: 832)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !6, line: 2711, flags: DIFlagFwdDecl)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !269, file: !6, line: 3383, baseType: !421, size: 960)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !6, line: 2756, size: 960, elements: !422)
!422 = !{!423, !424}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !421, file: !6, line: 2757, baseType: !383, size: 896)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !421, file: !6, line: 2758, baseType: !425, size: 64, offset: 896)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !267, line: 50, baseType: !426)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !267, line: 49, flags: DIFlagFwdDecl)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !269, file: !6, line: 3384, baseType: !429, size: 1472)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !6, line: 3114, size: 1472, elements: !430)
!430 = !{!431, !452, !453, !454, !455}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !429, file: !6, line: 3115, baseType: !432, size: 1216)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !6, line: 2984, size: 1216, elements: !433)
!433 = !{!434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !432, file: !6, line: 2985, baseType: !421, size: 960)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !432, file: !6, line: 2986, baseType: !266, size: 64, offset: 960)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !432, file: !6, line: 2987, baseType: !266, size: 64, offset: 1024)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !432, file: !6, line: 2988, baseType: !266, size: 64, offset: 1088)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !432, file: !6, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !432, file: !6, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !432, file: !6, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !432, file: !6, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !432, file: !6, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !432, file: !6, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !432, file: !6, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !432, file: !6, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !432, file: !6, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !432, file: !6, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !432, file: !6, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !432, file: !6, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !432, file: !6, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !432, file: !6, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !429, file: !6, line: 3117, baseType: !266, size: 64, offset: 1216)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !429, file: !6, line: 3119, baseType: !266, size: 64, offset: 1280)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !429, file: !6, line: 3121, baseType: !266, size: 64, offset: 1344)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !429, file: !6, line: 3123, baseType: !266, size: 64, offset: 1408)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !269, file: !6, line: 3385, baseType: !457, size: 1088)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !6, line: 2874, size: 1088, elements: !458)
!458 = !{!459, !460, !461}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !457, file: !6, line: 2875, baseType: !421, size: 960)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !457, file: !6, line: 2876, baseType: !425, size: 64, offset: 960)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !457, file: !6, line: 2877, baseType: !462, size: 64, offset: 1024)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !6, line: 2856, flags: DIFlagFwdDecl)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !269, file: !6, line: 3386, baseType: !432, size: 1216)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !269, file: !6, line: 3387, baseType: !466, size: 1280)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !6, line: 3093, size: 1280, elements: !467)
!467 = !{!468, !469}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !466, file: !6, line: 3094, baseType: !432, size: 1216)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !466, file: !6, line: 3095, baseType: !462, size: 64, offset: 1216)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !269, file: !6, line: 3388, baseType: !471, size: 1216)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !6, line: 2824, size: 1216, elements: !472)
!472 = !{!473, !474, !475, !476, !477, !478}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !471, file: !6, line: 2825, baseType: !383, size: 896)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !471, file: !6, line: 2827, baseType: !266, size: 64, offset: 896)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !471, file: !6, line: 2828, baseType: !266, size: 64, offset: 960)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !471, file: !6, line: 2829, baseType: !266, size: 64, offset: 1024)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !471, file: !6, line: 2830, baseType: !266, size: 64, offset: 1088)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !471, file: !6, line: 2831, baseType: !266, size: 64, offset: 1152)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !269, file: !6, line: 3389, baseType: !480, size: 1024)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !6, line: 2850, size: 1024, elements: !481)
!481 = !{!482, !483, !484}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !480, file: !6, line: 2851, baseType: !421, size: 960)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !480, file: !6, line: 2852, baseType: !259, size: 32, offset: 960)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !480, file: !6, line: 2853, baseType: !259, size: 32, offset: 992)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !269, file: !6, line: 3390, baseType: !486, size: 1024)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !6, line: 2857, size: 1024, elements: !487)
!487 = !{!488, !489}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !486, file: !6, line: 2858, baseType: !421, size: 960)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !486, file: !6, line: 2859, baseType: !462, size: 64, offset: 960)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !269, file: !6, line: 3391, baseType: !491, size: 960)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !6, line: 2862, size: 960, elements: !492)
!492 = !{!493}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !491, file: !6, line: 2863, baseType: !421, size: 960)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !269, file: !6, line: 3392, baseType: !495, size: 1472)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !6, line: 3304, size: 1472, elements: !496)
!496 = !{!497}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !495, file: !6, line: 3305, baseType: !429, size: 1472)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !269, file: !6, line: 3393, baseType: !499, size: 1792)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !6, line: 3248, size: 1792, elements: !500)
!500 = !{!501, !502, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !499, file: !6, line: 3249, baseType: !429, size: 1472)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !499, file: !6, line: 3251, baseType: !503, size: 64, offset: 1472)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !505, line: 41, flags: DIFlagFwdDecl)
!505 = !DIFile(filename: "./statistics.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!506 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !499, file: !6, line: 3254, baseType: !266, size: 64, offset: 1536)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !499, file: !6, line: 3257, baseType: !266, size: 64, offset: 1600)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !499, file: !6, line: 3258, baseType: !266, size: 64, offset: 1664)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !499, file: !6, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !499, file: !6, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !499, file: !6, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !499, file: !6, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !499, file: !6, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !499, file: !6, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !499, file: !6, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !499, file: !6, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !499, file: !6, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !499, file: !6, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !499, file: !6, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !499, file: !6, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !499, file: !6, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !499, file: !6, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !499, file: !6, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !499, file: !6, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !499, file: !6, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !499, file: !6, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !269, file: !6, line: 3394, baseType: !528, size: 1344)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !6, line: 2279, size: 1344, elements: !529)
!529 = !{!530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !555, !556, !557, !565, !566, !567, !568, !569, !570, !571, !572, !573}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !528, file: !6, line: 2280, baseType: !305, size: 192)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !528, file: !6, line: 2281, baseType: !266, size: 64, offset: 192)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !528, file: !6, line: 2282, baseType: !266, size: 64, offset: 256)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !528, file: !6, line: 2283, baseType: !266, size: 64, offset: 320)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !528, file: !6, line: 2284, baseType: !266, size: 64, offset: 384)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !528, file: !6, line: 2285, baseType: !7, size: 32, offset: 448)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !528, file: !6, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !528, file: !6, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !528, file: !6, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !528, file: !6, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !528, file: !6, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !528, file: !6, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !528, file: !6, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !528, file: !6, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !528, file: !6, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !528, file: !6, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !528, file: !6, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !528, file: !6, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !528, file: !6, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !528, file: !6, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !528, file: !6, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !528, file: !6, line: 2305, baseType: !7, size: 32, offset: 512)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !528, file: !6, line: 2306, baseType: !553, size: 32, offset: 544)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !554, line: 31, baseType: !259)
!554 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!555 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !528, file: !6, line: 2307, baseType: !266, size: 64, offset: 576)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !528, file: !6, line: 2308, baseType: !266, size: 64, offset: 640)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !528, file: !6, line: 2314, baseType: !558, size: 64, offset: 704)
!558 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !6, line: 2309, size: 64, elements: !559)
!559 = !{!560, !561, !562}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !558, file: !6, line: 2310, baseType: !259, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !558, file: !6, line: 2311, baseType: !264, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !558, file: !6, line: 2312, baseType: !563, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !6, line: 2277, flags: DIFlagFwdDecl)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !528, file: !6, line: 2315, baseType: !266, size: 64, offset: 768)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !528, file: !6, line: 2316, baseType: !266, size: 64, offset: 832)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !528, file: !6, line: 2317, baseType: !266, size: 64, offset: 896)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !528, file: !6, line: 2318, baseType: !266, size: 64, offset: 960)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !528, file: !6, line: 2319, baseType: !266, size: 64, offset: 1024)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !528, file: !6, line: 2320, baseType: !266, size: 64, offset: 1088)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !528, file: !6, line: 2321, baseType: !266, size: 64, offset: 1152)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !528, file: !6, line: 2322, baseType: !266, size: 64, offset: 1216)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !528, file: !6, line: 2324, baseType: !574, size: 64, offset: 1280)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !6, line: 2324, flags: DIFlagFwdDecl)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !269, file: !6, line: 3395, baseType: !577, size: 320)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !6, line: 1469, size: 320, elements: !578)
!578 = !{!579, !580, !581}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !577, file: !6, line: 1470, baseType: !305, size: 192)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !577, file: !6, line: 1471, baseType: !266, size: 64, offset: 192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !577, file: !6, line: 1472, baseType: !266, size: 64, offset: 256)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !269, file: !6, line: 3396, baseType: !583, size: 320)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !6, line: 1482, size: 320, elements: !584)
!584 = !{!585, !586, !587}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !583, file: !6, line: 1483, baseType: !305, size: 192)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !583, file: !6, line: 1484, baseType: !259, size: 32, offset: 192)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !583, file: !6, line: 1485, baseType: !588, size: 64, offset: 256)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 64, elements: !349)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !269, file: !6, line: 3397, baseType: !590, size: 384)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !6, line: 1829, size: 384, elements: !591)
!591 = !{!592, !593, !594, !595}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !590, file: !6, line: 1830, baseType: !305, size: 192)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !590, file: !6, line: 1831, baseType: !375, size: 32, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !590, file: !6, line: 1832, baseType: !266, size: 64, offset: 256)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !590, file: !6, line: 1835, baseType: !588, size: 64, offset: 320)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !269, file: !6, line: 3398, baseType: !597, size: 704)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !6, line: 1898, size: 704, elements: !598)
!598 = !{!599, !600, !601, !605, !606, !609}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !597, file: !6, line: 1899, baseType: !305, size: 192)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !597, file: !6, line: 1902, baseType: !266, size: 64, offset: 192)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !597, file: !6, line: 1905, baseType: !602, size: 64, offset: 256)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !267, line: 58, baseType: !603)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !267, line: 57, flags: DIFlagFwdDecl)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !597, file: !6, line: 1908, baseType: !7, size: 32, offset: 320)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !597, file: !6, line: 1911, baseType: !607, size: 64, offset: 384)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !6, line: 1876, flags: DIFlagFwdDecl)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !597, file: !6, line: 1914, baseType: !610, size: 256, offset: 448)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !6, line: 1883, size: 256, elements: !611)
!611 = !{!612, !614, !615, !620}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !610, file: !6, line: 1884, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !610, file: !6, line: 1885, baseType: !613, size: 64, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !610, file: !6, line: 1891, baseType: !616, size: 64, offset: 128)
!616 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !610, file: !6, line: 1891, size: 64, elements: !617)
!617 = !{!618, !619}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !616, file: !6, line: 1891, baseType: !602, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !616, file: !6, line: 1891, baseType: !266, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !610, file: !6, line: 1892, baseType: !621, size: 64, offset: 192)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !269, file: !6, line: 3399, baseType: !623, size: 704)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !6, line: 2008, size: 704, elements: !624)
!624 = !{!625, !626, !627, !628, !629, !630, !642, !643, !644, !645, !646}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !623, file: !6, line: 2009, baseType: !305, size: 192)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !623, file: !6, line: 2011, baseType: !7, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !623, file: !6, line: 2012, baseType: !7, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !623, file: !6, line: 2014, baseType: !375, size: 32, offset: 224)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !623, file: !6, line: 2016, baseType: !266, size: 64, offset: 256)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !623, file: !6, line: 2017, baseType: !631, size: 64, offset: 320)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !6, line: 183, baseType: !633)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !6, line: 183, size: 128, elements: !634)
!634 = !{!635}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !633, file: !6, line: 183, baseType: !636, size: 128)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !6, line: 182, baseType: !637)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !6, line: 182, size: 128, elements: !638)
!638 = !{!639, !640, !641}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !637, file: !6, line: 182, baseType: !7, size: 32)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !637, file: !6, line: 182, baseType: !7, size: 32, offset: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !637, file: !6, line: 182, baseType: !588, size: 64, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !623, file: !6, line: 2019, baseType: !266, size: 64, offset: 384)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !623, file: !6, line: 2020, baseType: !266, size: 64, offset: 448)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !623, file: !6, line: 2021, baseType: !266, size: 64, offset: 512)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !623, file: !6, line: 2022, baseType: !266, size: 64, offset: 576)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !623, file: !6, line: 2023, baseType: !266, size: 64, offset: 640)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !269, file: !6, line: 3400, baseType: !648, size: 832)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !6, line: 2430, size: 832, elements: !649)
!649 = !{!650, !651, !652, !653, !654, !655, !656, !657, !658, !659}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !648, file: !6, line: 2431, baseType: !305, size: 192)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !648, file: !6, line: 2433, baseType: !266, size: 64, offset: 192)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !648, file: !6, line: 2434, baseType: !266, size: 64, offset: 256)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !648, file: !6, line: 2435, baseType: !266, size: 64, offset: 320)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !648, file: !6, line: 2436, baseType: !266, size: 64, offset: 384)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "base_accesses", scope: !648, file: !6, line: 2437, baseType: !631, size: 64, offset: 448)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "inheritance", scope: !648, file: !6, line: 2438, baseType: !266, size: 64, offset: 512)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_subvtt", scope: !648, file: !6, line: 2440, baseType: !266, size: 64, offset: 576)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_vptr", scope: !648, file: !6, line: 2441, baseType: !266, size: 64, offset: 640)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "base_binfos", scope: !648, file: !6, line: 2443, baseType: !660, size: 128, offset: 704)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_none", file: !6, line: 182, baseType: !661)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_none", file: !6, line: 182, size: 128, elements: !662)
!662 = !{!663}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !661, file: !6, line: 182, baseType: !636, size: 128)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "stmt_list", scope: !269, file: !6, line: 3401, baseType: !665, size: 320)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list", file: !6, line: 3327, size: 320, elements: !666)
!666 = !{!667, !668, !675}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !665, file: !6, line: 3329, baseType: !305, size: 192)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !665, file: !6, line: 3330, baseType: !669, size: 64, offset: 192)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list_node", file: !6, line: 3320, size: 192, elements: !671)
!671 = !{!672, !673, !674}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !670, file: !6, line: 3322, baseType: !669, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !670, file: !6, line: 3323, baseType: !669, size: 64, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !670, file: !6, line: 3324, baseType: !266, size: 64, offset: 128)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !665, file: !6, line: 3331, baseType: !669, size: 64, offset: 256)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "constructor", scope: !269, file: !6, line: 3402, baseType: !677, size: 256)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_constructor", file: !6, line: 1540, size: 256, elements: !678)
!678 = !{!679, !680}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !677, file: !6, line: 1541, baseType: !305, size: 192)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !677, file: !6, line: 1542, baseType: !681, size: 64, offset: 192)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_gc", file: !6, line: 1538, baseType: !683)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_gc", file: !6, line: 1538, size: 192, elements: !684)
!684 = !{!685}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !683, file: !6, line: 1538, baseType: !686, size: 192)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_base", file: !6, line: 1537, baseType: !687)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_base", file: !6, line: 1537, size: 192, elements: !688)
!688 = !{!689, !690, !691}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !687, file: !6, line: 1537, baseType: !7, size: 32)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !687, file: !6, line: 1537, baseType: !7, size: 32, offset: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !687, file: !6, line: 1537, baseType: !692, size: 128, offset: 64)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !693, size: 128, elements: !349)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "constructor_elt", file: !6, line: 1535, baseType: !694)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "constructor_elt_d", file: !6, line: 1532, size: 128, elements: !695)
!695 = !{!696, !697}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !694, file: !6, line: 1533, baseType: !266, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !694, file: !6, line: 1534, baseType: !266, size: 64, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "omp_clause", scope: !269, file: !6, line: 3403, baseType: !699, size: 512)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_omp_clause", file: !6, line: 1938, size: 512, elements: !700)
!700 = !{!701, !702, !703, !704, !710, !714, !715}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !699, file: !6, line: 1939, baseType: !305, size: 192)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !699, file: !6, line: 1940, baseType: !375, size: 32, offset: 192)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !699, file: !6, line: 1941, baseType: !5, size: 32, offset: 224)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !699, file: !6, line: 1946, baseType: !705, size: 32, offset: 256)
!705 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "omp_clause_subcode", file: !6, line: 1942, size: 32, elements: !706)
!706 = !{!707, !708, !709}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "default_kind", scope: !705, file: !6, line: 1943, baseType: !25, size: 32)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "schedule_kind", scope: !705, file: !6, line: 1944, baseType: !32, size: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "reduction_code", scope: !705, file: !6, line: 1945, baseType: !39, size: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reduction_init", scope: !699, file: !6, line: 1950, baseType: !711, size: 64, offset: 320)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !267, line: 66, baseType: !712)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !267, line: 65, flags: DIFlagFwdDecl)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reduction_merge", scope: !699, file: !6, line: 1951, baseType: !711, size: 64, offset: 384)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !699, file: !6, line: 1953, baseType: !588, size: 64, offset: 448)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "optimization", scope: !269, file: !6, line: 3404, baseType: !717, size: 1664)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_optimization_option", file: !6, line: 3337, size: 1664, elements: !718)
!718 = !{!719, !720}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !717, file: !6, line: 3338, baseType: !305, size: 192)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !717, file: !6, line: 3341, baseType: !721, size: 1472, offset: 192)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cl_optimization", file: !722, line: 410, size: 1472, elements: !723)
!722 = !DIFile(filename: "./options.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!723 = !{!724, !725, !726, !727, !728, !729, !730, !731, !732, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "align_functions", scope: !721, file: !722, line: 412, baseType: !259, size: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "align_jumps", scope: !721, file: !722, line: 413, baseType: !259, size: 32, offset: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "align_labels", scope: !721, file: !722, line: 414, baseType: !259, size: 32, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "align_loops", scope: !721, file: !722, line: 415, baseType: !259, size: 32, offset: 96)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_stalled_insns", scope: !721, file: !722, line: 416, baseType: !259, size: 32, offset: 128)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_stalled_insns_dep", scope: !721, file: !722, line: 417, baseType: !259, size: 32, offset: 160)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "optimize", scope: !721, file: !722, line: 418, baseType: !258, size: 8, offset: 192)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_size", scope: !721, file: !722, line: 419, baseType: !258, size: 8, offset: 200)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "flag_argument_noalias", scope: !721, file: !722, line: 420, baseType: !733, size: 8, offset: 208)
!733 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "flag_asynchronous_unwind_tables", scope: !721, file: !722, line: 421, baseType: !733, size: 8, offset: 216)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_on_count_reg", scope: !721, file: !722, line: 422, baseType: !733, size: 8, offset: 224)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_probabilities", scope: !721, file: !722, line: 423, baseType: !733, size: 8, offset: 232)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_target_load_optimize", scope: !721, file: !722, line: 424, baseType: !733, size: 8, offset: 240)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_target_load_optimize2", scope: !721, file: !722, line: 425, baseType: !733, size: 8, offset: 248)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "flag_btr_bb_exclusive", scope: !721, file: !722, line: 426, baseType: !733, size: 8, offset: 256)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "flag_caller_saves", scope: !721, file: !722, line: 427, baseType: !733, size: 8, offset: 264)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "flag_no_common", scope: !721, file: !722, line: 428, baseType: !733, size: 8, offset: 272)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "flag_conserve_stack", scope: !721, file: !722, line: 429, baseType: !733, size: 8, offset: 280)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cprop_registers", scope: !721, file: !722, line: 430, baseType: !733, size: 8, offset: 288)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "flag_crossjumping", scope: !721, file: !722, line: 431, baseType: !733, size: 8, offset: 296)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cse_follow_jumps", scope: !721, file: !722, line: 432, baseType: !733, size: 8, offset: 304)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cx_fortran_rules", scope: !721, file: !722, line: 433, baseType: !733, size: 8, offset: 312)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cx_limited_range", scope: !721, file: !722, line: 434, baseType: !733, size: 8, offset: 320)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "flag_data_sections", scope: !721, file: !722, line: 435, baseType: !733, size: 8, offset: 328)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "flag_dce", scope: !721, file: !722, line: 436, baseType: !733, size: 8, offset: 336)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "flag_defer_pop", scope: !721, file: !722, line: 437, baseType: !733, size: 8, offset: 344)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "flag_delayed_branch", scope: !721, file: !722, line: 438, baseType: !733, size: 8, offset: 352)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "flag_delete_null_pointer_checks", scope: !721, file: !722, line: 439, baseType: !733, size: 8, offset: 360)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "flag_dse", scope: !721, file: !722, line: 440, baseType: !733, size: 8, offset: 368)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "flag_early_inlining", scope: !721, file: !722, line: 441, baseType: !733, size: 8, offset: 376)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "flag_exceptions", scope: !721, file: !722, line: 442, baseType: !733, size: 8, offset: 384)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "flag_expensive_optimizations", scope: !721, file: !722, line: 443, baseType: !733, size: 8, offset: 392)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "flag_finite_math_only", scope: !721, file: !722, line: 444, baseType: !733, size: 8, offset: 400)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "flag_float_store", scope: !721, file: !722, line: 445, baseType: !733, size: 8, offset: 408)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "flag_forward_propagate", scope: !721, file: !722, line: 446, baseType: !733, size: 8, offset: 416)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse", scope: !721, file: !722, line: 447, baseType: !733, size: 8, offset: 424)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_after_reload", scope: !721, file: !722, line: 448, baseType: !733, size: 8, offset: 432)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_las", scope: !721, file: !722, line: 449, baseType: !733, size: 8, offset: 440)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_lm", scope: !721, file: !722, line: 450, baseType: !733, size: 8, offset: 448)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_sm", scope: !721, file: !722, line: 451, baseType: !733, size: 8, offset: 456)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "flag_graphite_identity", scope: !721, file: !722, line: 452, baseType: !733, size: 8, offset: 464)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "flag_guess_branch_prob", scope: !721, file: !722, line: 453, baseType: !733, size: 8, offset: 472)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "flag_if_conversion", scope: !721, file: !722, line: 454, baseType: !733, size: 8, offset: 480)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "flag_if_conversion2", scope: !721, file: !722, line: 455, baseType: !733, size: 8, offset: 488)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_functions", scope: !721, file: !722, line: 456, baseType: !733, size: 8, offset: 496)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_functions_called_once", scope: !721, file: !722, line: 457, baseType: !733, size: 8, offset: 504)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_small_functions", scope: !721, file: !722, line: 458, baseType: !733, size: 8, offset: 512)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_cp", scope: !721, file: !722, line: 459, baseType: !733, size: 8, offset: 520)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_cp_clone", scope: !721, file: !722, line: 460, baseType: !733, size: 8, offset: 528)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_matrix_reorg", scope: !721, file: !722, line: 461, baseType: !733, size: 8, offset: 536)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_pta", scope: !721, file: !722, line: 462, baseType: !733, size: 8, offset: 544)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_pure_const", scope: !721, file: !722, line: 463, baseType: !733, size: 8, offset: 552)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_reference", scope: !721, file: !722, line: 464, baseType: !733, size: 8, offset: 560)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_sra", scope: !721, file: !722, line: 465, baseType: !733, size: 8, offset: 568)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_type_escape", scope: !721, file: !722, line: 466, baseType: !733, size: 8, offset: 576)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ivopts", scope: !721, file: !722, line: 467, baseType: !733, size: 8, offset: 584)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "flag_jump_tables", scope: !721, file: !722, line: 468, baseType: !733, size: 8, offset: 592)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_block", scope: !721, file: !722, line: 469, baseType: !733, size: 8, offset: 600)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_interchange", scope: !721, file: !722, line: 470, baseType: !733, size: 8, offset: 608)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_parallelize_all", scope: !721, file: !722, line: 471, baseType: !733, size: 8, offset: 616)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_strip_mine", scope: !721, file: !722, line: 472, baseType: !733, size: 8, offset: 624)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "flag_lto_report", scope: !721, file: !722, line: 473, baseType: !733, size: 8, offset: 632)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ltrans", scope: !721, file: !722, line: 474, baseType: !733, size: 8, offset: 640)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "flag_errno_math", scope: !721, file: !722, line: 475, baseType: !733, size: 8, offset: 648)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "flag_merge_constants", scope: !721, file: !722, line: 476, baseType: !733, size: 8, offset: 656)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "flag_modulo_sched", scope: !721, file: !722, line: 477, baseType: !733, size: 8, offset: 664)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "flag_move_loop_invariants", scope: !721, file: !722, line: 478, baseType: !733, size: 8, offset: 672)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "flag_non_call_exceptions", scope: !721, file: !722, line: 479, baseType: !733, size: 8, offset: 680)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "flag_omit_frame_pointer", scope: !721, file: !722, line: 480, baseType: !733, size: 8, offset: 688)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "flag_regmove", scope: !721, file: !722, line: 481, baseType: !733, size: 8, offset: 696)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "flag_optimize_sibling_calls", scope: !721, file: !722, line: 482, baseType: !733, size: 8, offset: 704)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "flag_pack_struct", scope: !721, file: !722, line: 483, baseType: !733, size: 8, offset: 712)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "flag_peel_loops", scope: !721, file: !722, line: 484, baseType: !733, size: 8, offset: 720)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "flag_no_peephole", scope: !721, file: !722, line: 485, baseType: !733, size: 8, offset: 728)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "flag_peephole2", scope: !721, file: !722, line: 486, baseType: !733, size: 8, offset: 736)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "flag_predictive_commoning", scope: !721, file: !722, line: 487, baseType: !733, size: 8, offset: 744)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "flag_prefetch_loop_arrays", scope: !721, file: !722, line: 488, baseType: !733, size: 8, offset: 752)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "flag_pcc_struct_return", scope: !721, file: !722, line: 489, baseType: !733, size: 8, offset: 760)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "flag_rename_registers", scope: !721, file: !722, line: 490, baseType: !733, size: 8, offset: 768)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "flag_reorder_blocks", scope: !721, file: !722, line: 491, baseType: !733, size: 8, offset: 776)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "flag_reorder_blocks_and_partition", scope: !721, file: !722, line: 492, baseType: !733, size: 8, offset: 784)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "flag_reorder_functions", scope: !721, file: !722, line: 493, baseType: !733, size: 8, offset: 792)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "flag_rerun_cse_after_loop", scope: !721, file: !722, line: 494, baseType: !733, size: 8, offset: 800)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "flag_resched_modulo_sched", scope: !721, file: !722, line: 495, baseType: !733, size: 8, offset: 808)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "flag_rounding_math", scope: !721, file: !722, line: 496, baseType: !733, size: 8, offset: 816)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_critical_path_heuristic", scope: !721, file: !722, line: 497, baseType: !733, size: 8, offset: 824)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_dep_count_heuristic", scope: !721, file: !722, line: 498, baseType: !733, size: 8, offset: 832)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_group_heuristic", scope: !721, file: !722, line: 499, baseType: !733, size: 8, offset: 840)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_interblock", scope: !721, file: !722, line: 500, baseType: !733, size: 8, offset: 848)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_last_insn_heuristic", scope: !721, file: !722, line: 501, baseType: !733, size: 8, offset: 856)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_pressure", scope: !721, file: !722, line: 502, baseType: !733, size: 8, offset: 864)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_rank_heuristic", scope: !721, file: !722, line: 503, baseType: !733, size: 8, offset: 872)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_speculative", scope: !721, file: !722, line: 504, baseType: !733, size: 8, offset: 880)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_spec_insn_heuristic", scope: !721, file: !722, line: 505, baseType: !733, size: 8, offset: 888)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_speculative_load", scope: !721, file: !722, line: 506, baseType: !733, size: 8, offset: 896)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_speculative_load_dangerous", scope: !721, file: !722, line: 507, baseType: !733, size: 8, offset: 904)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched2_use_superblocks", scope: !721, file: !722, line: 508, baseType: !733, size: 8, offset: 912)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_insns", scope: !721, file: !722, line: 509, baseType: !733, size: 8, offset: 920)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_insns_after_reload", scope: !721, file: !722, line: 510, baseType: !733, size: 8, offset: 928)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "flag_section_anchors", scope: !721, file: !722, line: 511, baseType: !733, size: 8, offset: 936)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sel_sched_pipelining", scope: !721, file: !722, line: 512, baseType: !733, size: 8, offset: 944)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sel_sched_pipelining_outer_loops", scope: !721, file: !722, line: 513, baseType: !733, size: 8, offset: 952)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sel_sched_reschedule_pipelined", scope: !721, file: !722, line: 514, baseType: !733, size: 8, offset: 960)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "flag_selective_scheduling", scope: !721, file: !722, line: 515, baseType: !733, size: 8, offset: 968)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "flag_selective_scheduling2", scope: !721, file: !722, line: 516, baseType: !733, size: 8, offset: 976)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "flag_signaling_nans", scope: !721, file: !722, line: 517, baseType: !733, size: 8, offset: 984)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "flag_signed_zeros", scope: !721, file: !722, line: 518, baseType: !733, size: 8, offset: 992)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "flag_single_precision_constant", scope: !721, file: !722, line: 519, baseType: !733, size: 8, offset: 1000)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "flag_split_ivs_in_unroller", scope: !721, file: !722, line: 520, baseType: !733, size: 8, offset: 1008)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "flag_split_wide_types", scope: !721, file: !722, line: 521, baseType: !733, size: 8, offset: 1016)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "flag_strict_aliasing", scope: !721, file: !722, line: 522, baseType: !733, size: 8, offset: 1024)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "flag_thread_jumps", scope: !721, file: !722, line: 523, baseType: !733, size: 8, offset: 1032)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "flag_toplevel_reorder", scope: !721, file: !722, line: 524, baseType: !733, size: 8, offset: 1040)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "flag_trapping_math", scope: !721, file: !722, line: 525, baseType: !733, size: 8, offset: 1048)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "flag_trapv", scope: !721, file: !722, line: 526, baseType: !733, size: 8, offset: 1056)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_builtin_call_dce", scope: !721, file: !722, line: 527, baseType: !733, size: 8, offset: 1064)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_ccp", scope: !721, file: !722, line: 528, baseType: !733, size: 8, offset: 1072)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_ch", scope: !721, file: !722, line: 529, baseType: !733, size: 8, offset: 1080)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_copy_prop", scope: !721, file: !722, line: 530, baseType: !733, size: 8, offset: 1088)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_copyrename", scope: !721, file: !722, line: 531, baseType: !733, size: 8, offset: 1096)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_cselim", scope: !721, file: !722, line: 532, baseType: !733, size: 8, offset: 1104)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_dce", scope: !721, file: !722, line: 533, baseType: !733, size: 8, offset: 1112)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_dom", scope: !721, file: !722, line: 534, baseType: !733, size: 8, offset: 1120)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_dse", scope: !721, file: !722, line: 535, baseType: !733, size: 8, offset: 1128)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_forwprop", scope: !721, file: !722, line: 536, baseType: !733, size: 8, offset: 1136)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_fre", scope: !721, file: !722, line: 537, baseType: !733, size: 8, offset: 1144)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_loop_distribution", scope: !721, file: !722, line: 538, baseType: !733, size: 8, offset: 1152)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_loop_im", scope: !721, file: !722, line: 539, baseType: !733, size: 8, offset: 1160)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_loop_ivcanon", scope: !721, file: !722, line: 540, baseType: !733, size: 8, offset: 1168)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_loop_linear", scope: !721, file: !722, line: 541, baseType: !733, size: 8, offset: 1176)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_loop_optimize", scope: !721, file: !722, line: 542, baseType: !733, size: 8, offset: 1184)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_live_range_split", scope: !721, file: !722, line: 543, baseType: !733, size: 8, offset: 1192)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_phiprop", scope: !721, file: !722, line: 544, baseType: !733, size: 8, offset: 1200)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_pre", scope: !721, file: !722, line: 545, baseType: !733, size: 8, offset: 1208)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_pta", scope: !721, file: !722, line: 546, baseType: !733, size: 8, offset: 1216)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_reassoc", scope: !721, file: !722, line: 547, baseType: !733, size: 8, offset: 1224)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_scev_cprop", scope: !721, file: !722, line: 548, baseType: !733, size: 8, offset: 1232)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_sink", scope: !721, file: !722, line: 549, baseType: !733, size: 8, offset: 1240)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_slp_vectorize", scope: !721, file: !722, line: 550, baseType: !733, size: 8, offset: 1248)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_sra", scope: !721, file: !722, line: 551, baseType: !733, size: 8, offset: 1256)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_switch_conversion", scope: !721, file: !722, line: 552, baseType: !733, size: 8, offset: 1264)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_ter", scope: !721, file: !722, line: 553, baseType: !733, size: 8, offset: 1272)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_vect_loop_version", scope: !721, file: !722, line: 554, baseType: !733, size: 8, offset: 1280)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_vectorize", scope: !721, file: !722, line: 555, baseType: !733, size: 8, offset: 1288)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_vrp", scope: !721, file: !722, line: 556, baseType: !733, size: 8, offset: 1296)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unit_at_a_time", scope: !721, file: !722, line: 557, baseType: !733, size: 8, offset: 1304)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unroll_all_loops", scope: !721, file: !722, line: 558, baseType: !733, size: 8, offset: 1312)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unroll_loops", scope: !721, file: !722, line: 559, baseType: !733, size: 8, offset: 1320)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unsafe_loop_optimizations", scope: !721, file: !722, line: 560, baseType: !733, size: 8, offset: 1328)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unsafe_math_optimizations", scope: !721, file: !722, line: 561, baseType: !733, size: 8, offset: 1336)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unswitch_loops", scope: !721, file: !722, line: 562, baseType: !733, size: 8, offset: 1344)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unwind_tables", scope: !721, file: !722, line: 563, baseType: !733, size: 8, offset: 1352)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "flag_var_tracking", scope: !721, file: !722, line: 564, baseType: !733, size: 8, offset: 1360)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "flag_var_tracking_assignments", scope: !721, file: !722, line: 565, baseType: !733, size: 8, offset: 1368)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "flag_var_tracking_assignments_toggle", scope: !721, file: !722, line: 566, baseType: !733, size: 8, offset: 1376)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "flag_var_tracking_uninit", scope: !721, file: !722, line: 567, baseType: !733, size: 8, offset: 1384)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "flag_variable_expansion_in_unroller", scope: !721, file: !722, line: 568, baseType: !733, size: 8, offset: 1392)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "flag_vect_cost_model", scope: !721, file: !722, line: 569, baseType: !733, size: 8, offset: 1400)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "flag_value_profile_transformations", scope: !721, file: !722, line: 570, baseType: !733, size: 8, offset: 1408)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "flag_web", scope: !721, file: !722, line: 571, baseType: !733, size: 8, offset: 1416)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "flag_whole_program", scope: !721, file: !722, line: 572, baseType: !733, size: 8, offset: 1424)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "flag_wpa", scope: !721, file: !722, line: 573, baseType: !733, size: 8, offset: 1432)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "flag_wrapv", scope: !721, file: !722, line: 574, baseType: !733, size: 8, offset: 1440)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "target_option", scope: !269, file: !6, line: 3405, baseType: !889, size: 384)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_target_option", file: !6, line: 3352, size: 384, elements: !890)
!890 = !{!891, !892}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !889, file: !6, line: 3353, baseType: !305, size: 192)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !889, file: !6, line: 3356, baseType: !893, size: 192, offset: 192)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cl_target_option", file: !722, line: 578, size: 192, elements: !894)
!894 = !{!895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "ix86_isa_flags_explicit", scope: !893, file: !722, line: 580, baseType: !259, size: 32)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "target_flags_explicit", scope: !893, file: !722, line: 581, baseType: !259, size: 32, offset: 32)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "target_flags", scope: !893, file: !722, line: 582, baseType: !259, size: 32, offset: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "ix86_isa_flags", scope: !893, file: !722, line: 583, baseType: !259, size: 32, offset: 96)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !893, file: !722, line: 584, baseType: !258, size: 8, offset: 128)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "arch_specified", scope: !893, file: !722, line: 585, baseType: !258, size: 8, offset: 136)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "branch_cost", scope: !893, file: !722, line: 586, baseType: !258, size: 8, offset: 144)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "fpmath", scope: !893, file: !722, line: 587, baseType: !258, size: 8, offset: 152)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "schedule", scope: !893, file: !722, line: 588, baseType: !258, size: 8, offset: 160)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "tune", scope: !893, file: !722, line: 589, baseType: !258, size: 8, offset: 168)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "tune_defaulted", scope: !893, file: !722, line: 590, baseType: !258, size: 8, offset: 176)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "format_kind_info", file: !234, line: 252, baseType: !908)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !234, line: 209, size: 832, elements: !909)
!909 = !{!910, !911, !924, !948, !949, !950, !962, !972, !973, !974, !975, !976, !977, !978, !979, !980}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !908, file: !234, line: 213, baseType: !264, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "length_char_specs", scope: !908, file: !234, line: 215, baseType: !912, size: 64, offset: 64)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !914)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "format_length_info", file: !234, line: 103, baseType: !915)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !234, line: 85, size: 320, elements: !916)
!916 = !{!917, !918, !919, !920, !921, !922, !923}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !915, file: !234, line: 90, baseType: !264, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !915, file: !234, line: 92, baseType: !233, size: 32, offset: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "std", scope: !915, file: !234, line: 94, baseType: !249, size: 32, offset: 96)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "double_name", scope: !915, file: !234, line: 96, baseType: !264, size: 64, offset: 128)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "double_index", scope: !915, file: !234, line: 97, baseType: !233, size: 32, offset: 192)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "double_std", scope: !915, file: !234, line: 98, baseType: !249, size: 32, offset: 224)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_identity_flag", scope: !915, file: !234, line: 102, baseType: !259, size: 32, offset: 256)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "conversion_specs", scope: !908, file: !234, line: 217, baseType: !925, size: 64, offset: 128)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !927)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "format_char_info", file: !234, line: 159, baseType: !928)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "format_char_info", file: !234, line: 130, size: 2624, elements: !929)
!929 = !{!930, !931, !932, !933, !943, !944, !945}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "format_chars", scope: !928, file: !234, line: 132, baseType: !264, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_count", scope: !928, file: !234, line: 133, baseType: !259, size: 32, offset: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "std", scope: !928, file: !234, line: 134, baseType: !249, size: 32, offset: 96)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !928, file: !234, line: 136, baseType: !934, size: 2304, offset: 128)
!934 = !DICompositeType(tag: DW_TAG_array_type, baseType: !935, size: 2304, elements: !941)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "format_type_detail", file: !234, line: 119, baseType: !936)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !234, line: 108, size: 192, elements: !937)
!937 = !{!938, !939, !940}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "std", scope: !936, file: !234, line: 113, baseType: !249, size: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !936, file: !234, line: 116, baseType: !264, size: 64, offset: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !936, file: !234, line: 118, baseType: !621, size: 64, offset: 128)
!941 = !{!942}
!942 = !DISubrange(count: 12)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "flag_chars", scope: !928, file: !234, line: 143, baseType: !264, size: 64, offset: 2432)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !928, file: !234, line: 153, baseType: !264, size: 64, offset: 2496)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !928, file: !234, line: 158, baseType: !946, size: 64, offset: 2560)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !928)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "flag_chars", scope: !908, file: !234, line: 219, baseType: !264, size: 64, offset: 192)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "modifier_chars", scope: !908, file: !234, line: 221, baseType: !264, size: 64, offset: 256)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "flag_specs", scope: !908, file: !234, line: 223, baseType: !951, size: 64, offset: 320)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !953)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "format_flag_spec", file: !234, line: 187, baseType: !954)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !234, line: 163, size: 320, elements: !955)
!955 = !{!956, !957, !958, !959, !960, !961}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "flag_char", scope: !954, file: !234, line: 166, baseType: !259, size: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "predicate", scope: !954, file: !234, line: 175, baseType: !259, size: 32, offset: 32)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "skip_next_char", scope: !954, file: !234, line: 178, baseType: !259, size: 32, offset: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !954, file: !234, line: 181, baseType: !264, size: 64, offset: 128)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !954, file: !234, line: 184, baseType: !264, size: 64, offset: 192)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "std", scope: !954, file: !234, line: 186, baseType: !249, size: 32, offset: 256)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "bad_flag_pairs", scope: !908, file: !234, line: 225, baseType: !963, size: 64, offset: 384)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !965)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "format_flag_pair", file: !234, line: 205, baseType: !966)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !234, line: 192, size: 128, elements: !967)
!967 = !{!968, !969, !970, !971}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "flag_char1", scope: !966, file: !234, line: 195, baseType: !259, size: 32)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "flag_char2", scope: !966, file: !234, line: 197, baseType: !259, size: 32, offset: 32)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "ignored", scope: !966, file: !234, line: 200, baseType: !259, size: 32, offset: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "predicate", scope: !966, file: !234, line: 204, baseType: !259, size: 32, offset: 96)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !908, file: !234, line: 227, baseType: !259, size: 32, offset: 448)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "width_char", scope: !908, file: !234, line: 229, baseType: !259, size: 32, offset: 480)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "left_precision_char", scope: !908, file: !234, line: 232, baseType: !259, size: 32, offset: 512)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "precision_char", scope: !908, file: !234, line: 235, baseType: !259, size: 32, offset: 544)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "suppression_char", scope: !908, file: !234, line: 238, baseType: !259, size: 32, offset: 576)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "length_code_char", scope: !908, file: !234, line: 243, baseType: !259, size: 32, offset: 608)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_char", scope: !908, file: !234, line: 245, baseType: !259, size: 32, offset: 640)
