; ModuleID = 'c-lang.bc'
source_filename = "c-lang.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.attribute_spec = type { i8*, i32, i32, i8, i8, i8, %union.tree_node* (%union.tree_node**, %union.tree_node*, %union.tree_node*, i32, i8*)* }
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }

!357 = !DIEnumerator(name: "V4SImode", value: 65, isUnsigned: true)
!358 = !DIEnumerator(name: "V2DImode", value: 66, isUnsigned: true)
!359 = !DIEnumerator(name: "V1TImode", value: 67, isUnsigned: true)
!360 = !DIEnumerator(name: "V32QImode", value: 68, isUnsigned: true)
!361 = !DIEnumerator(name: "V16HImode", value: 69, isUnsigned: true)
!362 = !DIEnumerator(name: "V8SImode", value: 70, isUnsigned: true)
!363 = !DIEnumerator(name: "V4DImode", value: 71, isUnsigned: true)
!364 = !DIEnumerator(name: "V2TImode", value: 72, isUnsigned: true)
!365 = !DIEnumerator(name: "V64QImode", value: 73, isUnsigned: true)
!366 = !DIEnumerator(name: "V32HImode", value: 74, isUnsigned: true)
!367 = !DIEnumerator(name: "V16SImode", value: 75, isUnsigned: true)
!368 = !DIEnumerator(name: "V8DImode", value: 76, isUnsigned: true)
!369 = !DIEnumerator(name: "V4TImode", value: 77, isUnsigned: true)
!370 = !DIEnumerator(name: "V2SFmode", value: 78, isUnsigned: true)
!371 = !DIEnumerator(name: "V4SFmode", value: 79, isUnsigned: true)
!372 = !DIEnumerator(name: "V2DFmode", value: 80, isUnsigned: true)
!373 = !DIEnumerator(name: "V8SFmode", value: 81, isUnsigned: true)
!374 = !DIEnumerator(name: "V4DFmode", value: 82, isUnsigned: true)
!375 = !DIEnumerator(name: "V2TFmode", value: 83, isUnsigned: true)
!376 = !DIEnumerator(name: "V16SFmode", value: 84, isUnsigned: true)
!377 = !DIEnumerator(name: "V8DFmode", value: 85, isUnsigned: true)
!378 = !DIEnumerator(name: "V4TFmode", value: 86, isUnsigned: true)
!379 = !DIEnumerator(name: "MAX_MACHINE_MODE", value: 87, isUnsigned: true)
!380 = !DIEnumerator(name: "MIN_MODE_RANDOM", value: 0, isUnsigned: true)
!381 = !DIEnumerator(name: "MAX_MODE_RANDOM", value: 1, isUnsigned: true)
!382 = !DIEnumerator(name: "MIN_MODE_CC", value: 2, isUnsigned: true)
!383 = !DIEnumerator(name: "MAX_MODE_CC", value: 12, isUnsigned: true)
!384 = !DIEnumerator(name: "MIN_MODE_INT", value: 14, isUnsigned: true)
!385 = !DIEnumerator(name: "MAX_MODE_INT", value: 19, isUnsigned: true)
!386 = !DIEnumerator(name: "MIN_MODE_PARTIAL_INT", value: 0, isUnsigned: true)
!387 = !DIEnumerator(name: "MAX_MODE_PARTIAL_INT", value: 0, isUnsigned: true)
!388 = !DIEnumerator(name: "MIN_MODE_FRACT", value: 20, isUnsigned: true)
!389 = !DIEnumerator(name: "MAX_MODE_FRACT", value: 24, isUnsigned: true)
!390 = !DIEnumerator(name: "MIN_MODE_UFRACT", value: 25, isUnsigned: true)
!391 = !DIEnumerator(name: "MAX_MODE_UFRACT", value: 29, isUnsigned: true)
!392 = !DIEnumerator(name: "MIN_MODE_ACCUM", value: 30, isUnsigned: true)
!393 = !DIEnumerator(name: "MAX_MODE_ACCUM", value: 33, isUnsigned: true)
!394 = !DIEnumerator(name: "MIN_MODE_UACCUM", value: 34, isUnsigned: true)
!395 = !DIEnumerator(name: "MAX_MODE_UACCUM", value: 37, isUnsigned: true)
!396 = !DIEnumerator(name: "MIN_MODE_FLOAT", value: 38, isUnsigned: true)
!397 = !DIEnumerator(name: "MAX_MODE_FLOAT", value: 41, isUnsigned: true)
!398 = !DIEnumerator(name: "MIN_MODE_DECIMAL_FLOAT", value: 42, isUnsigned: true)
!399 = !DIEnumerator(name: "MAX_MODE_DECIMAL_FLOAT", value: 44, isUnsigned: true)
!400 = !DIEnumerator(name: "MIN_MODE_COMPLEX_INT", value: 45, isUnsigned: true)
!401 = !DIEnumerator(name: "MAX_MODE_COMPLEX_INT", value: 50, isUnsigned: true)
!402 = !DIEnumerator(name: "MIN_MODE_COMPLEX_FLOAT", value: 51, isUnsigned: true)
!403 = !DIEnumerator(name: "MAX_MODE_COMPLEX_FLOAT", value: 54, isUnsigned: true)
!404 = !DIEnumerator(name: "MIN_MODE_VECTOR_INT", value: 55, isUnsigned: true)
!405 = !DIEnumerator(name: "MAX_MODE_VECTOR_INT", value: 77, isUnsigned: true)
!406 = !DIEnumerator(name: "MIN_MODE_VECTOR_FRACT", value: 0, isUnsigned: true)
!407 = !DIEnumerator(name: "MAX_MODE_VECTOR_FRACT", value: 0, isUnsigned: true)
!408 = !DIEnumerator(name: "MIN_MODE_VECTOR_UFRACT", value: 0, isUnsigned: true)
!409 = !DIEnumerator(name: "MAX_MODE_VECTOR_UFRACT", value: 0, isUnsigned: true)
!410 = !DIEnumerator(name: "MIN_MODE_VECTOR_ACCUM", value: 0, isUnsigned: true)
!411 = !DIEnumerator(name: "MAX_MODE_VECTOR_ACCUM", value: 0, isUnsigned: true)
!412 = !DIEnumerator(name: "MIN_MODE_VECTOR_UACCUM", value: 0, isUnsigned: true)
!413 = !DIEnumerator(name: "MAX_MODE_VECTOR_UACCUM", value: 0, isUnsigned: true)
!414 = !DIEnumerator(name: "MIN_MODE_VECTOR_FLOAT", value: 78, isUnsigned: true)
!415 = !DIEnumerator(name: "MAX_MODE_VECTOR_FLOAT", value: 86, isUnsigned: true)
!416 = !DIEnumerator(name: "NUM_MACHINE_MODES", value: 87, isUnsigned: true)
!417 = !{!418, !419, !420, !421, !424, !425}
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!420 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !423)
!427 = !{!0, !428, !1960, !1978, !1983, !2003, !2006}
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(name: "lang_hooks", scope: !2, file: !3, line: 49, type: !430, isLocal: false, isDefinition: true)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lang_hooks", file: !284, line: 250, size: 5440, elements: !431)
!431 = !{!432, !433, !437, !1495, !1499, !1504, !1715, !1719, !1723, !1727, !1731, !1735, !1739, !1743, !1747, !1748, !1749, !1750, !1751, !1756, !1757, !1758, !1759, !1763, !1764, !1768, !1773, !1777, !1795, !1796, !1797, !1804, !1812, !1826, !1876, !1929, !1941, !1942, !1943, !1944, !1949, !1950, !1951, !1952, !1953, !1957, !1958, !1959}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !430, file: !284, line: 253, baseType: !425, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "identifier_size", scope: !430, file: !284, line: 257, baseType: !434, size: 64, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !435, line: 46, baseType: !436)
!435 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!436 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "free_lang_data", scope: !430, file: !284, line: 260, baseType: !438, size: 64, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{null, !441}
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !442, line: 56, baseType: !443)
!442 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !14, line: 3371, size: 1792, elements: !445)
!445 = !{!446, !479, !485, !497, !504, !511, !516, !525, !531, !544, !556, !594, !602, !630, !638, !639, !644, !653, !659, !664, !668, !672, !1135, !1184, !1190, !1196, !1203, !1214, !1239, !1256, !1268, !1290, !1305, !1477}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !444, file: !14, line: 3372, baseType: !447, size: 64)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !14, line: 360, size: 64, elements: !448)
!448 = !{!449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !447, file: !14, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !447, file: !14, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !447, file: !14, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !447, file: !14, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !447, file: !14, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !447, file: !14, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !447, file: !14, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !447, file: !14, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !447, file: !14, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !447, file: !14, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !447, file: !14, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !447, file: !14, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !447, file: !14, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !447, file: !14, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !447, file: !14, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !447, file: !14, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !447, file: !14, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !447, file: !14, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !447, file: !14, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !447, file: !14, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !447, file: !14, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !447, file: !14, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !447, file: !14, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !447, file: !14, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !447, file: !14, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !447, file: !14, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !447, file: !14, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !447, file: !14, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !447, file: !14, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !447, file: !14, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !444, file: !14, line: 3373, baseType: !480, size: 192)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !14, line: 402, size: 192, elements: !481)
!481 = !{!482, !483, !484}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !480, file: !14, line: 403, baseType: !447, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !480, file: !14, line: 404, baseType: !441, size: 64, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !480, file: !14, line: 405, baseType: !441, size: 64, offset: 128)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !444, file: !14, line: 3374, baseType: !486, size: 320)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !14, line: 1384, size: 320, elements: !487)
!487 = !{!488, !489}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !486, file: !14, line: 1385, baseType: !480, size: 192)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !486, file: !14, line: 1386, baseType: !490, size: 128, offset: 192)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !491, line: 58, baseType: !492)
!491 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !491, line: 54, size: 128, elements: !493)
!493 = !{!494, !495}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !492, file: !491, line: 56, baseType: !436, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !492, file: !491, line: 57, baseType: !496, size: 64, offset: 64)
!496 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !444, file: !14, line: 3375, baseType: !498, size: 256)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !14, line: 1397, size: 256, elements: !499)
!499 = !{!500, !501}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !498, file: !14, line: 1398, baseType: !480, size: 192)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !498, file: !14, line: 1399, baseType: !502, size: 64, offset: 192)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !14, line: 1392, flags: DIFlagFwdDecl)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !444, file: !14, line: 3376, baseType: !505, size: 256)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !14, line: 1408, size: 256, elements: !506)
!506 = !{!507, !508}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !505, file: !14, line: 1409, baseType: !480, size: 192)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !505, file: !14, line: 1410, baseType: !509, size: 64, offset: 192)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !14, line: 1403, flags: DIFlagFwdDecl)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !444, file: !14, line: 3377, baseType: !512, size: 256)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !14, line: 1437, size: 256, elements: !513)
!513 = !{!514, !515}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !512, file: !14, line: 1438, baseType: !480, size: 192)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !512, file: !14, line: 1439, baseType: !441, size: 64, offset: 192)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !444, file: !14, line: 3378, baseType: !517, size: 256)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !14, line: 1418, size: 256, elements: !518)
!518 = !{!519, !520, !521}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !517, file: !14, line: 1419, baseType: !480, size: 192)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !517, file: !14, line: 1420, baseType: !420, size: 32, offset: 192)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !517, file: !14, line: 1421, baseType: !522, size: 8, offset: 224)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !423, size: 8, elements: !523)
!523 = !{!524}
!524 = !DISubrange(count: 1)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !444, file: !14, line: 3379, baseType: !526, size: 320)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !14, line: 1428, size: 320, elements: !527)
!527 = !{!528, !529, !530}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !526, file: !14, line: 1429, baseType: !480, size: 192)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !526, file: !14, line: 1430, baseType: !441, size: 64, offset: 192)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !526, file: !14, line: 1431, baseType: !441, size: 64, offset: 256)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !444, file: !14, line: 3380, baseType: !532, size: 320)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !14, line: 1460, size: 320, elements: !533)
!533 = !{!534, !535}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !532, file: !14, line: 1461, baseType: !480, size: 192)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !532, file: !14, line: 1462, baseType: !536, size: 128, offset: 192)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !537, line: 31, size: 128, elements: !538)
!537 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!538 = !{!539, !542, !543}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !536, file: !537, line: 32, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !419)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !536, file: !537, line: 33, baseType: !7, size: 32, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !536, file: !537, line: 34, baseType: !7, size: 32, offset: 96)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !444, file: !14, line: 3381, baseType: !545, size: 384)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !14, line: 2507, size: 384, elements: !546)
!546 = !{!547, !548, !553, !554, !555}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !545, file: !14, line: 2508, baseType: !480, size: 192)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !545, file: !14, line: 2509, baseType: !549, size: 32, offset: 192)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !550, line: 58, baseType: !551)
!550 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !552, line: 44, baseType: !7)
!552 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!553 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !545, file: !14, line: 2510, baseType: !7, size: 32, offset: 224)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !545, file: !14, line: 2511, baseType: !441, size: 64, offset: 256)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !545, file: !14, line: 2512, baseType: !441, size: 64, offset: 320)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !444, file: !14, line: 3382, baseType: !557, size: 896)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !14, line: 2652, size: 896, elements: !558)
!558 = !{!559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !557, file: !14, line: 2653, baseType: !545, size: 384)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !557, file: !14, line: 2654, baseType: !441, size: 64, offset: 384)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !557, file: !14, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !557, file: !14, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !557, file: !14, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !557, file: !14, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !557, file: !14, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !557, file: !14, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !557, file: !14, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !557, file: !14, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !557, file: !14, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !557, file: !14, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !557, file: !14, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !557, file: !14, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !557, file: !14, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !557, file: !14, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !557, file: !14, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !557, file: !14, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !557, file: !14, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !557, file: !14, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !557, file: !14, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !557, file: !14, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !557, file: !14, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !557, file: !14, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !557, file: !14, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !557, file: !14, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !557, file: !14, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !557, file: !14, line: 2703, baseType: !7, size: 32, offset: 512)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !557, file: !14, line: 2705, baseType: !441, size: 64, offset: 576)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !557, file: !14, line: 2706, baseType: !441, size: 64, offset: 640)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !557, file: !14, line: 2707, baseType: !441, size: 64, offset: 704)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !557, file: !14, line: 2708, baseType: !441, size: 64, offset: 768)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !557, file: !14, line: 2711, baseType: !592, size: 64, offset: 832)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !14, line: 2711, flags: DIFlagFwdDecl)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !444, file: !14, line: 3383, baseType: !595, size: 960)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !14, line: 2756, size: 960, elements: !596)
!596 = !{!597, !598}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !595, file: !14, line: 2757, baseType: !557, size: 896)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !595, file: !14, line: 2758, baseType: !599, size: 64, offset: 896)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !442, line: 50, baseType: !600)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !442, line: 49, flags: DIFlagFwdDecl)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !444, file: !14, line: 3384, baseType: !603, size: 1472)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !14, line: 3114, size: 1472, elements: !604)
!604 = !{!605, !626, !627, !628, !629}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !603, file: !14, line: 3115, baseType: !606, size: 1216)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !14, line: 2984, size: 1216, elements: !607)
!607 = !{!608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !606, file: !14, line: 2985, baseType: !595, size: 960)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !606, file: !14, line: 2986, baseType: !441, size: 64, offset: 960)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !606, file: !14, line: 2987, baseType: !441, size: 64, offset: 1024)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !606, file: !14, line: 2988, baseType: !441, size: 64, offset: 1088)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !606, file: !14, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !606, file: !14, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !606, file: !14, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !606, file: !14, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !606, file: !14, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !606, file: !14, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !606, file: !14, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !606, file: !14, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !606, file: !14, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !606, file: !14, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !606, file: !14, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !606, file: !14, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !606, file: !14, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !606, file: !14, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !603, file: !14, line: 3117, baseType: !441, size: 64, offset: 1216)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !603, file: !14, line: 3119, baseType: !441, size: 64, offset: 1280)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !603, file: !14, line: 3121, baseType: !441, size: 64, offset: 1344)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !603, file: !14, line: 3123, baseType: !441, size: 64, offset: 1408)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !444, file: !14, line: 3385, baseType: !631, size: 1088)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !14, line: 2874, size: 1088, elements: !632)
!632 = !{!633, !634, !635}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !631, file: !14, line: 2875, baseType: !595, size: 960)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !631, file: !14, line: 2876, baseType: !599, size: 64, offset: 960)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !631, file: !14, line: 2877, baseType: !636, size: 64, offset: 1024)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !14, line: 2856, flags: DIFlagFwdDecl)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !444, file: !14, line: 3386, baseType: !606, size: 1216)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !444, file: !14, line: 3387, baseType: !640, size: 1280)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !14, line: 3093, size: 1280, elements: !641)
!641 = !{!642, !643}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !640, file: !14, line: 3094, baseType: !606, size: 1216)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !640, file: !14, line: 3095, baseType: !636, size: 64, offset: 1216)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !444, file: !14, line: 3388, baseType: !645, size: 1216)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !14, line: 2824, size: 1216, elements: !646)
!646 = !{!647, !648, !649, !650, !651, !652}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !645, file: !14, line: 2825, baseType: !557, size: 896)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !645, file: !14, line: 2827, baseType: !441, size: 64, offset: 896)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !645, file: !14, line: 2828, baseType: !441, size: 64, offset: 960)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !645, file: !14, line: 2829, baseType: !441, size: 64, offset: 1024)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !645, file: !14, line: 2830, baseType: !441, size: 64, offset: 1088)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !645, file: !14, line: 2831, baseType: !441, size: 64, offset: 1152)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !444, file: !14, line: 3389, baseType: !654, size: 1024)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !14, line: 2850, size: 1024, elements: !655)
!655 = !{!656, !657, !658}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !654, file: !14, line: 2851, baseType: !595, size: 960)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !654, file: !14, line: 2852, baseType: !420, size: 32, offset: 960)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !654, file: !14, line: 2853, baseType: !420, size: 32, offset: 992)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !444, file: !14, line: 3390, baseType: !660, size: 1024)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !14, line: 2857, size: 1024, elements: !661)
!661 = !{!662, !663}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !660, file: !14, line: 2858, baseType: !595, size: 960)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !660, file: !14, line: 2859, baseType: !636, size: 64, offset: 960)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !444, file: !14, line: 3391, baseType: !665, size: 960)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !14, line: 2862, size: 960, elements: !666)
!666 = !{!667}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !665, file: !14, line: 2863, baseType: !595, size: 960)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !444, file: !14, line: 3392, baseType: !669, size: 1472)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !14, line: 3304, size: 1472, elements: !670)
!670 = !{!671}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !669, file: !14, line: 3305, baseType: !603, size: 1472)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !444, file: !14, line: 3393, baseType: !673, size: 1792)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !14, line: 3248, size: 1792, elements: !674)
!674 = !{!675, !676, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !673, file: !14, line: 3249, baseType: !603, size: 1472)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !673, file: !14, line: 3251, baseType: !677, size: 64, offset: 1472)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !679, line: 463, size: 1152, elements: !680)
!679 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!680 = !{!681, !684, !1000, !1001, !1004, !1007, !1057, !1058, !1059, !1060, !1061, !1087, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !678, file: !679, line: 464, baseType: !682, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !679, line: 464, flags: DIFlagFwdDecl)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !678, file: !679, line: 467, baseType: !685, size: 64, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !209, line: 374, size: 640, elements: !687)
!687 = !{!688, !975, !976, !989, !990, !991, !992, !993, !994, !996, !998, !999}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !686, file: !209, line: 377, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !442, line: 111, baseType: !690)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !209, line: 217, size: 832, elements: !692)
!692 = !{!693, !938, !939, !940, !943, !949, !950, !951, !969, !970, !971, !972, !973, !974}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !691, file: !209, line: 219, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !209, line: 151, baseType: !696)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !209, line: 151, size: 128, elements: !697)
!697 = !{!698}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !696, file: !209, line: 151, baseType: !699, size: 128)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !209, line: 150, baseType: !700)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !209, line: 150, size: 128, elements: !701)
!701 = !{!702, !703, !704}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !700, file: !209, line: 150, baseType: !7, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !700, file: !209, line: 150, baseType: !7, size: 32, offset: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !700, file: !209, line: 150, baseType: !705, size: 64, offset: 64)
!705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !706, size: 64, elements: !523)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !442, line: 108, baseType: !707)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !209, line: 122, size: 512, elements: !709)
!709 = !{!710, !711, !712, !930, !931, !932, !933, !934, !935, !936}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !708, file: !209, line: 124, baseType: !690, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !708, file: !209, line: 125, baseType: !690, size: 64, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !708, file: !209, line: 131, baseType: !713, size: 64, offset: 128)
!713 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !209, line: 128, size: 64, elements: !714)
!714 = !{!715, !929}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !713, file: !209, line: 129, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !442, line: 66, baseType: !717)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !719, line: 143, size: 192, elements: !720)
!719 = !DIFile(filename: "./gimple.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!720 = !{!721, !927, !928}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !718, file: !719, line: 145, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !442, line: 69, baseType: !723)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !719, line: 136, size: 192, elements: !725)
!725 = !{!726, !925, !926}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !724, file: !719, line: 137, baseType: !727, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !442, line: 58, baseType: !728)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !719, line: 737, size: 768, elements: !730)
!730 = !{!731, !748, !782, !788, !793, !798, !805, !811, !817, !822, !836, !841, !847, !852, !862, !867, !883, !890, !897, !903, !908, !914, !920}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !729, file: !719, line: 738, baseType: !732, size: 256)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !719, line: 271, size: 256, elements: !733)
!733 = !{!734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !732, file: !719, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !732, file: !719, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !732, file: !719, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !732, file: !719, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !732, file: !719, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !732, file: !719, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !732, file: !719, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !732, file: !719, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !732, file: !719, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !732, file: !719, line: 312, baseType: !7, size: 32, offset: 32)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !732, file: !719, line: 316, baseType: !549, size: 32, offset: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !732, file: !719, line: 319, baseType: !7, size: 32, offset: 96)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !732, file: !719, line: 323, baseType: !690, size: 64, offset: 128)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !732, file: !719, line: 327, baseType: !441, size: 64, offset: 192)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !729, file: !719, line: 739, baseType: !749, size: 448)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !719, line: 350, size: 448, elements: !750)
!750 = !{!751, !780}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !749, file: !719, line: 353, baseType: !752, size: 384)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !719, line: 333, size: 384, elements: !753)
!753 = !{!754, !755, !763}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !752, file: !719, line: 336, baseType: !732, size: 256)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !752, file: !719, line: 343, baseType: !756, size: 64, offset: 256)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !758, line: 37, size: 128, elements: !759)
!758 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!759 = !{!760, !761}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !757, file: !758, line: 39, baseType: !756, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !757, file: !758, line: 40, baseType: !762, size: 64, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !752, file: !719, line: 344, baseType: !764, size: 64, offset: 320)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !758, line: 45, size: 320, elements: !766)
!766 = !{!767, !768}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !765, file: !758, line: 47, baseType: !764, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !765, file: !758, line: 48, baseType: !769, size: 256, offset: 64)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !14, line: 1883, size: 256, elements: !770)
!770 = !{!771, !773, !774, !779}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !769, file: !14, line: 1884, baseType: !772, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !769, file: !14, line: 1885, baseType: !772, size: 64, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !769, file: !14, line: 1891, baseType: !775, size: 64, offset: 128)
!775 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !769, file: !14, line: 1891, size: 64, elements: !776)
!776 = !{!777, !778}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !775, file: !14, line: 1891, baseType: !727, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !775, file: !14, line: 1891, baseType: !441, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !769, file: !14, line: 1892, baseType: !762, size: 64, offset: 192)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !749, file: !719, line: 359, baseType: !781, size: 64, offset: 384)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !441, size: 64, elements: !523)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !729, file: !719, line: 740, baseType: !783, size: 512)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !719, line: 365, size: 512, elements: !784)
!784 = !{!785, !786, !787}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !783, file: !719, line: 368, baseType: !752, size: 384)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !783, file: !719, line: 373, baseType: !441, size: 64, offset: 384)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !783, file: !719, line: 374, baseType: !441, size: 64, offset: 448)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !729, file: !719, line: 741, baseType: !789, size: 576)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !719, line: 380, size: 576, elements: !790)
!790 = !{!791, !792}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !789, file: !719, line: 383, baseType: !783, size: 512)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !789, file: !719, line: 389, baseType: !781, size: 64, offset: 512)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !729, file: !719, line: 742, baseType: !794, size: 320)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !719, line: 395, size: 320, elements: !795)
!795 = !{!796, !797}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !794, file: !719, line: 397, baseType: !732, size: 256)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !794, file: !719, line: 400, baseType: !716, size: 64, offset: 256)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !729, file: !719, line: 743, baseType: !799, size: 448)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !719, line: 406, size: 448, elements: !800)
!800 = !{!801, !802, !803, !804}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !799, file: !719, line: 408, baseType: !732, size: 256)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !799, file: !719, line: 412, baseType: !441, size: 64, offset: 256)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !799, file: !719, line: 420, baseType: !441, size: 64, offset: 320)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !799, file: !719, line: 423, baseType: !716, size: 64, offset: 384)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !729, file: !719, line: 744, baseType: !806, size: 384)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !719, line: 429, size: 384, elements: !807)
!807 = !{!808, !809, !810}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !806, file: !719, line: 431, baseType: !732, size: 256)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !806, file: !719, line: 434, baseType: !441, size: 64, offset: 256)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !806, file: !719, line: 437, baseType: !716, size: 64, offset: 320)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !729, file: !719, line: 745, baseType: !812, size: 384)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !719, line: 443, size: 384, elements: !813)
!813 = !{!814, !815, !816}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !812, file: !719, line: 445, baseType: !732, size: 256)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !812, file: !719, line: 449, baseType: !441, size: 64, offset: 256)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !812, file: !719, line: 453, baseType: !716, size: 64, offset: 320)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !729, file: !719, line: 746, baseType: !818, size: 320)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !719, line: 459, size: 320, elements: !819)
!819 = !{!820, !821}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !818, file: !719, line: 461, baseType: !732, size: 256)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !818, file: !719, line: 464, baseType: !441, size: 64, offset: 256)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !729, file: !719, line: 747, baseType: !823, size: 768)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !719, line: 469, size: 768, elements: !824)
!824 = !{!825, !826, !827, !828, !829}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !823, file: !719, line: 471, baseType: !732, size: 256)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !823, file: !719, line: 474, baseType: !7, size: 32, offset: 256)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !823, file: !719, line: 475, baseType: !7, size: 32, offset: 288)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !823, file: !719, line: 478, baseType: !441, size: 64, offset: 320)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !823, file: !719, line: 481, baseType: !830, size: 384, offset: 384)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !831, size: 384, elements: !523)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !14, line: 1917, size: 384, elements: !832)
!832 = !{!833, !834, !835}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !831, file: !14, line: 1920, baseType: !769, size: 256)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !831, file: !14, line: 1921, baseType: !441, size: 64, offset: 256)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !831, file: !14, line: 1922, baseType: !549, size: 32, offset: 320)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !729, file: !719, line: 748, baseType: !837, size: 320)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !719, line: 487, size: 320, elements: !838)
!838 = !{!839, !840}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !837, file: !719, line: 490, baseType: !732, size: 256)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !837, file: !719, line: 494, baseType: !420, size: 32, offset: 256)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !729, file: !719, line: 749, baseType: !842, size: 384)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !719, line: 500, size: 384, elements: !843)
!843 = !{!844, !845, !846}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !842, file: !719, line: 502, baseType: !732, size: 256)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !842, file: !719, line: 506, baseType: !716, size: 64, offset: 256)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !842, file: !719, line: 510, baseType: !716, size: 64, offset: 320)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !729, file: !719, line: 750, baseType: !848, size: 320)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !719, line: 529, size: 320, elements: !849)
!849 = !{!850, !851}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !848, file: !719, line: 531, baseType: !732, size: 256)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !848, file: !719, line: 540, baseType: !716, size: 64, offset: 256)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !729, file: !719, line: 751, baseType: !853, size: 704)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !719, line: 546, size: 704, elements: !854)
!854 = !{!855, !856, !857, !858, !859, !860, !861}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !853, file: !719, line: 549, baseType: !783, size: 512)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !853, file: !719, line: 553, baseType: !425, size: 64, offset: 512)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !853, file: !719, line: 557, baseType: !419, size: 8, offset: 576)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !853, file: !719, line: 558, baseType: !419, size: 8, offset: 584)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !853, file: !719, line: 559, baseType: !419, size: 8, offset: 592)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !853, file: !719, line: 560, baseType: !419, size: 8, offset: 600)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !853, file: !719, line: 566, baseType: !781, size: 64, offset: 640)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !729, file: !719, line: 752, baseType: !863, size: 384)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !719, line: 571, size: 384, elements: !864)
!864 = !{!865, !866}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !863, file: !719, line: 573, baseType: !794, size: 320)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !863, file: !719, line: 577, baseType: !441, size: 64, offset: 320)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !729, file: !719, line: 753, baseType: !868, size: 576)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !719, line: 600, size: 576, elements: !869)
!869 = !{!870, !871, !872, !873, !882}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !868, file: !719, line: 602, baseType: !794, size: 320)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !868, file: !719, line: 605, baseType: !441, size: 64, offset: 320)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !868, file: !719, line: 609, baseType: !434, size: 64, offset: 384)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !868, file: !719, line: 612, baseType: !874, size: 64, offset: 448)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !719, line: 581, size: 320, elements: !876)
!876 = !{!877, !878, !879, !880, !881}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !875, file: !719, line: 583, baseType: !13, size: 32)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !875, file: !719, line: 586, baseType: !441, size: 64, offset: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !875, file: !719, line: 589, baseType: !441, size: 64, offset: 128)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !875, file: !719, line: 592, baseType: !441, size: 64, offset: 192)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !875, file: !719, line: 595, baseType: !441, size: 64, offset: 256)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !868, file: !719, line: 616, baseType: !716, size: 64, offset: 512)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !729, file: !719, line: 754, baseType: !884, size: 512)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !719, line: 622, size: 512, elements: !885)
!885 = !{!886, !887, !888, !889}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !884, file: !719, line: 624, baseType: !794, size: 320)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !884, file: !719, line: 628, baseType: !441, size: 64, offset: 320)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !884, file: !719, line: 632, baseType: !441, size: 64, offset: 384)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !884, file: !719, line: 636, baseType: !441, size: 64, offset: 448)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !729, file: !719, line: 755, baseType: !891, size: 704)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !719, line: 642, size: 704, elements: !892)
!892 = !{!893, !894, !895, !896}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !891, file: !719, line: 644, baseType: !884, size: 512)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !891, file: !719, line: 648, baseType: !441, size: 64, offset: 512)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !891, file: !719, line: 652, baseType: !441, size: 64, offset: 576)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !891, file: !719, line: 653, baseType: !441, size: 64, offset: 640)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !729, file: !719, line: 756, baseType: !898, size: 448)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !719, line: 663, size: 448, elements: !899)
!899 = !{!900, !901, !902}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !898, file: !719, line: 665, baseType: !794, size: 320)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !898, file: !719, line: 668, baseType: !441, size: 64, offset: 320)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !898, file: !719, line: 673, baseType: !441, size: 64, offset: 384)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !729, file: !719, line: 757, baseType: !904, size: 384)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !719, line: 694, size: 384, elements: !905)
!905 = !{!906, !907}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !904, file: !719, line: 696, baseType: !794, size: 320)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !904, file: !719, line: 699, baseType: !441, size: 64, offset: 320)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !729, file: !719, line: 758, baseType: !909, size: 384)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !719, line: 681, size: 384, elements: !910)
!910 = !{!911, !912, !913}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !909, file: !719, line: 683, baseType: !732, size: 256)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !909, file: !719, line: 686, baseType: !441, size: 64, offset: 256)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !909, file: !719, line: 689, baseType: !441, size: 64, offset: 320)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !729, file: !719, line: 759, baseType: !915, size: 384)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !719, line: 707, size: 384, elements: !916)
!916 = !{!917, !918, !919}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !915, file: !719, line: 709, baseType: !732, size: 256)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !915, file: !719, line: 712, baseType: !441, size: 64, offset: 256)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !915, file: !719, line: 712, baseType: !441, size: 64, offset: 320)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !729, file: !719, line: 760, baseType: !921, size: 320)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !719, line: 718, size: 320, elements: !922)
!922 = !{!923, !924}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !921, file: !719, line: 720, baseType: !732, size: 256)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !921, file: !719, line: 723, baseType: !441, size: 64, offset: 256)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !724, file: !719, line: 138, baseType: !723, size: 64, offset: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !724, file: !719, line: 139, baseType: !723, size: 64, offset: 128)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !718, file: !719, line: 146, baseType: !722, size: 64, offset: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !718, file: !719, line: 152, baseType: !716, size: 64, offset: 128)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !713, file: !209, line: 130, baseType: !599, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !708, file: !209, line: 134, baseType: !424, size: 64, offset: 192)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !708, file: !209, line: 137, baseType: !441, size: 64, offset: 256)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !708, file: !209, line: 138, baseType: !549, size: 32, offset: 320)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !708, file: !209, line: 142, baseType: !7, size: 32, offset: 352)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !708, file: !209, line: 144, baseType: !420, size: 32, offset: 384)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !708, file: !209, line: 145, baseType: !420, size: 32, offset: 416)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !708, file: !209, line: 146, baseType: !937, size: 64, offset: 448)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !209, line: 119, baseType: !496)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !691, file: !209, line: 220, baseType: !694, size: 64, offset: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !691, file: !209, line: 223, baseType: !424, size: 64, offset: 128)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !691, file: !209, line: 226, baseType: !941, size: 64, offset: 192)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !209, line: 185, flags: DIFlagFwdDecl)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !691, file: !209, line: 229, baseType: !944, size: 128, offset: 256)
!944 = !DICompositeType(tag: DW_TAG_array_type, baseType: !945, size: 128, elements: !947)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !209, line: 229, flags: DIFlagFwdDecl)
!947 = !{!948}
!948 = !DISubrange(count: 2)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !691, file: !209, line: 232, baseType: !690, size: 64, offset: 384)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !691, file: !209, line: 233, baseType: !690, size: 64, offset: 448)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !691, file: !209, line: 238, baseType: !952, size: 64, offset: 512)
!952 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !209, line: 235, size: 64, elements: !953)
!953 = !{!954, !960}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !952, file: !209, line: 236, baseType: !955, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !209, line: 273, size: 128, elements: !957)
!957 = !{!958, !959}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !956, file: !209, line: 275, baseType: !716, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !956, file: !209, line: 278, baseType: !716, size: 64, offset: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !952, file: !209, line: 237, baseType: !961, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !209, line: 259, size: 320, elements: !963)
!963 = !{!964, !965, !966, !967, !968}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !962, file: !209, line: 261, baseType: !599, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !962, file: !209, line: 262, baseType: !599, size: 64, offset: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !962, file: !209, line: 266, baseType: !599, size: 64, offset: 128)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !962, file: !209, line: 267, baseType: !599, size: 64, offset: 192)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !962, file: !209, line: 270, baseType: !420, size: 32, offset: 256)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !691, file: !209, line: 241, baseType: !937, size: 64, offset: 576)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !691, file: !209, line: 244, baseType: !420, size: 32, offset: 640)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !691, file: !209, line: 247, baseType: !420, size: 32, offset: 672)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !691, file: !209, line: 250, baseType: !420, size: 32, offset: 704)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !691, file: !209, line: 253, baseType: !420, size: 32, offset: 736)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !691, file: !209, line: 256, baseType: !420, size: 32, offset: 768)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !686, file: !209, line: 378, baseType: !689, size: 64, offset: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !686, file: !209, line: 381, baseType: !977, size: 64, offset: 128)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !209, line: 282, baseType: !979)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !209, line: 282, size: 128, elements: !980)
!980 = !{!981}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !979, file: !209, line: 282, baseType: !982, size: 128)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !209, line: 281, baseType: !983)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !209, line: 281, size: 128, elements: !984)
!984 = !{!985, !986, !987}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !983, file: !209, line: 281, baseType: !7, size: 32)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !983, file: !209, line: 281, baseType: !7, size: 32, offset: 32)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !983, file: !209, line: 281, baseType: !988, size: 64, offset: 64)
!988 = !DICompositeType(tag: DW_TAG_array_type, baseType: !689, size: 64, elements: !523)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !686, file: !209, line: 384, baseType: !420, size: 32, offset: 192)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !686, file: !209, line: 387, baseType: !420, size: 32, offset: 224)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !686, file: !209, line: 390, baseType: !420, size: 32, offset: 256)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !686, file: !209, line: 394, baseType: !977, size: 64, offset: 320)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !686, file: !209, line: 396, baseType: !208, size: 32, offset: 384)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !686, file: !209, line: 399, baseType: !995, size: 64, offset: 416)
!995 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 64, elements: !947)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !686, file: !209, line: 402, baseType: !997, size: 64, offset: 480)
!997 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !947)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !686, file: !209, line: 406, baseType: !420, size: 32, offset: 544)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !686, file: !209, line: 409, baseType: !420, size: 32, offset: 576)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !678, file: !679, line: 470, baseType: !717, size: 64, offset: 128)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !678, file: !679, line: 473, baseType: !1002, size: 64, offset: 192)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !679, line: 166, flags: DIFlagFwdDecl)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !678, file: !679, line: 476, baseType: !1005, size: 64, offset: 256)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !679, line: 476, flags: DIFlagFwdDecl)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !678, file: !679, line: 479, baseType: !1008, size: 64, offset: 320)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1009, line: 144, baseType: !1010)
!1009 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1009, line: 100, size: 896, elements: !1012)
!1012 = !{!1013, !1021, !1026, !1031, !1033, !1034, !1035, !1036, !1037, !1038, !1043, !1045, !1046, !1051, !1056}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1011, file: !1009, line: 102, baseType: !1014, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1009, line: 52, baseType: !1015)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!1018, !1019}
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1009, line: 47, baseType: !7)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1011, file: !1009, line: 105, baseType: !1022, size: 64, offset: 64)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1009, line: 59, baseType: !1023)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!420, !1019, !1019}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1011, file: !1009, line: 108, baseType: !1027, size: 64, offset: 128)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1009, line: 63, baseType: !1028)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{null, !424}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1011, file: !1009, line: 111, baseType: !1032, size: 64, offset: 192)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1011, file: !1009, line: 114, baseType: !434, size: 64, offset: 256)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1011, file: !1009, line: 117, baseType: !434, size: 64, offset: 320)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1011, file: !1009, line: 120, baseType: !434, size: 64, offset: 384)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1011, file: !1009, line: 124, baseType: !7, size: 32, offset: 448)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1011, file: !1009, line: 128, baseType: !7, size: 32, offset: 480)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1011, file: !1009, line: 131, baseType: !1039, size: 64, offset: 512)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1009, line: 75, baseType: !1040)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!424, !434, !434}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1011, file: !1009, line: 132, baseType: !1044, size: 64, offset: 576)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1009, line: 78, baseType: !1028)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1011, file: !1009, line: 135, baseType: !424, size: 64, offset: 640)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1011, file: !1009, line: 136, baseType: !1047, size: 64, offset: 704)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1009, line: 82, baseType: !1048)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!424, !424, !434, !434}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1011, file: !1009, line: 137, baseType: !1052, size: 64, offset: 768)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1009, line: 83, baseType: !1053)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{null, !424, !424}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1011, file: !1009, line: 141, baseType: !7, size: 32, offset: 832)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !678, file: !679, line: 484, baseType: !441, size: 64, offset: 384)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !678, file: !679, line: 488, baseType: !441, size: 64, offset: 448)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !678, file: !679, line: 493, baseType: !441, size: 64, offset: 512)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !678, file: !679, line: 496, baseType: !441, size: 64, offset: 576)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !678, file: !679, line: 501, baseType: !1062, size: 64, offset: 640)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !220, line: 2355, size: 576, elements: !1064)
!1064 = !{!1065, !1068, !1069, !1070, !1071, !1075, !1076, !1081, !1082, !1083, !1084, !1085, !1086}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1063, file: !220, line: 2356, baseType: !1066, size: 64)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !220, line: 2356, flags: DIFlagFwdDecl)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1063, file: !220, line: 2357, baseType: !425, size: 64, offset: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1063, file: !220, line: 2358, baseType: !420, size: 32, offset: 128)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1063, file: !220, line: 2359, baseType: !420, size: 32, offset: 160)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1063, file: !220, line: 2360, baseType: !1072, size: 128, offset: 192)
!1072 = !DICompositeType(tag: DW_TAG_array_type, baseType: !420, size: 128, elements: !1073)
!1073 = !{!1074}
!1074 = !DISubrange(count: 4)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1063, file: !220, line: 2364, baseType: !420, size: 32, offset: 320)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1063, file: !220, line: 2367, baseType: !1077, size: 128, offset: 384)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !220, line: 2349, size: 128, elements: !1078)
!1078 = !{!1079, !1080}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1077, file: !220, line: 2351, baseType: !599, size: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1077, file: !220, line: 2352, baseType: !496, size: 64, offset: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1063, file: !220, line: 2371, baseType: !219, size: 32, offset: 512)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1063, file: !220, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1063, file: !220, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1063, file: !220, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1063, file: !220, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1063, file: !220, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !678, file: !679, line: 504, baseType: !1088, size: 64, offset: 704)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !679, line: 504, flags: DIFlagFwdDecl)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !678, file: !679, line: 507, baseType: !1008, size: 64, offset: 768)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !678, file: !679, line: 510, baseType: !420, size: 32, offset: 832)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !678, file: !679, line: 513, baseType: !420, size: 32, offset: 864)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !678, file: !679, line: 516, baseType: !549, size: 32, offset: 896)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !678, file: !679, line: 519, baseType: !549, size: 32, offset: 928)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !678, file: !679, line: 522, baseType: !7, size: 32, offset: 960)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !678, file: !679, line: 523, baseType: !7, size: 32, offset: 992)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !678, file: !679, line: 528, baseType: !425, size: 64, offset: 1024)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !678, file: !679, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !678, file: !679, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !678, file: !679, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !678, file: !679, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !678, file: !679, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !678, file: !679, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !678, file: !679, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !678, file: !679, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !678, file: !679, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !678, file: !679, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !678, file: !679, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !678, file: !679, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !678, file: !679, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !678, file: !679, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !678, file: !679, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !678, file: !679, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !673, file: !14, line: 3254, baseType: !441, size: 64, offset: 1536)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !673, file: !14, line: 3257, baseType: !441, size: 64, offset: 1600)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !673, file: !14, line: 3258, baseType: !441, size: 64, offset: 1664)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !673, file: !14, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !673, file: !14, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !673, file: !14, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !673, file: !14, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !673, file: !14, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !673, file: !14, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !673, file: !14, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !673, file: !14, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !673, file: !14, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !673, file: !14, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !673, file: !14, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !673, file: !14, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !673, file: !14, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !673, file: !14, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !673, file: !14, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !673, file: !14, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !673, file: !14, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !673, file: !14, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !444, file: !14, line: 3394, baseType: !1136, size: 1344)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !14, line: 2279, size: 1344, elements: !1137)
!1137 = !{!1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1163, !1164, !1165, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1136, file: !14, line: 2280, baseType: !480, size: 192)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1136, file: !14, line: 2281, baseType: !441, size: 64, offset: 192)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1136, file: !14, line: 2282, baseType: !441, size: 64, offset: 256)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1136, file: !14, line: 2283, baseType: !441, size: 64, offset: 320)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1136, file: !14, line: 2284, baseType: !441, size: 64, offset: 384)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1136, file: !14, line: 2285, baseType: !7, size: 32, offset: 448)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1136, file: !14, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1136, file: !14, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1136, file: !14, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1136, file: !14, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1136, file: !14, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1136, file: !14, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1136, file: !14, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1136, file: !14, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1136, file: !14, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1136, file: !14, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1136, file: !14, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1136, file: !14, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1136, file: !14, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1136, file: !14, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1136, file: !14, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1136, file: !14, line: 2305, baseType: !7, size: 32, offset: 512)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1136, file: !14, line: 2306, baseType: !1161, size: 32, offset: 544)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1162, line: 31, baseType: !420)
!1162 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1136, file: !14, line: 2307, baseType: !441, size: 64, offset: 576)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1136, file: !14, line: 2308, baseType: !441, size: 64, offset: 640)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1136, file: !14, line: 2314, baseType: !1166, size: 64, offset: 704)
!1166 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !14, line: 2309, size: 64, elements: !1167)
!1167 = !{!1168, !1169, !1170}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1166, file: !14, line: 2310, baseType: !420, size: 32)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1166, file: !14, line: 2311, baseType: !425, size: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1166, file: !14, line: 2312, baseType: !1171, size: 64)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !14, line: 2277, flags: DIFlagFwdDecl)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1136, file: !14, line: 2315, baseType: !441, size: 64, offset: 768)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1136, file: !14, line: 2316, baseType: !441, size: 64, offset: 832)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1136, file: !14, line: 2317, baseType: !441, size: 64, offset: 896)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1136, file: !14, line: 2318, baseType: !441, size: 64, offset: 960)
