; ModuleID = 'c-lex.bc'
source_filename = "c-lex.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.cpp_reader = type opaque
%struct.splay_tree_s = type { %struct.splay_tree_node_s*, i32 (i64, i64)*, void (i64)*, void (i64)*, i8* (i32, i8*)*, void (i8*, i8*)*, i8* }
%struct.splay_tree_node_s = type { i64, i64, %struct.splay_tree_node_s*, %struct.splay_tree_node_s* }

!466 = !DIEnumerator(name: "itk_unsigned_long_long", value: 10, isUnsigned: true)
!467 = !DIEnumerator(name: "itk_none", value: 11, isUnsigned: true)
!468 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_lang", file: !6, line: 158, baseType: !7, size: 32, elements: !469)
!469 = !{!470, !471, !472, !473, !474, !475, !476, !477, !478, !479}
!470 = !DIEnumerator(name: "CLK_GNUC89", value: 0, isUnsigned: true)
!471 = !DIEnumerator(name: "CLK_GNUC99", value: 1, isUnsigned: true)
!472 = !DIEnumerator(name: "CLK_STDC89", value: 2, isUnsigned: true)
!473 = !DIEnumerator(name: "CLK_STDC94", value: 3, isUnsigned: true)
!474 = !DIEnumerator(name: "CLK_STDC99", value: 4, isUnsigned: true)
!475 = !DIEnumerator(name: "CLK_GNUCXX", value: 5, isUnsigned: true)
!476 = !DIEnumerator(name: "CLK_CXX98", value: 6, isUnsigned: true)
!477 = !DIEnumerator(name: "CLK_GNUCXX0X", value: 7, isUnsigned: true)
!478 = !DIEnumerator(name: "CLK_CXX0X", value: 8, isUnsigned: true)
!479 = !DIEnumerator(name: "CLK_ASM", value: 9, isUnsigned: true)
!480 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cpp_normalize_level", file: !6, line: 265, baseType: !7, size: 32, elements: !481)
!481 = !{!482, !483, !484, !485}
!482 = !DIEnumerator(name: "normalized_KC", value: 0, isUnsigned: true)
!483 = !DIEnumerator(name: "normalized_C", value: 1, isUnsigned: true)
!484 = !DIEnumerator(name: "normalized_identifier_C", value: 2, isUnsigned: true)
!485 = !DIEnumerator(name: "normalized_none", value: 3, isUnsigned: true)
!486 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cpp_deps_style", file: !6, line: 262, baseType: !7, size: 32, elements: !487)
!487 = !{!488, !489, !490}
!488 = !DIEnumerator(name: "DEPS_NONE", value: 0, isUnsigned: true)
!489 = !DIEnumerator(name: "DEPS_USER", value: 1, isUnsigned: true)
!490 = !DIEnumerator(name: "DEPS_SYSTEM", value: 2, isUnsigned: true)
!491 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mode_class", file: !492, line: 36, baseType: !7, size: 32, elements: !493)
!492 = !DIFile(filename: "./machmode.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!493 = !{!494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512}
!494 = !DIEnumerator(name: "MODE_RANDOM", value: 0, isUnsigned: true)
!495 = !DIEnumerator(name: "MODE_CC", value: 1, isUnsigned: true)
!496 = !DIEnumerator(name: "MODE_INT", value: 2, isUnsigned: true)
!497 = !DIEnumerator(name: "MODE_PARTIAL_INT", value: 3, isUnsigned: true)
!498 = !DIEnumerator(name: "MODE_FRACT", value: 4, isUnsigned: true)
!499 = !DIEnumerator(name: "MODE_UFRACT", value: 5, isUnsigned: true)
!500 = !DIEnumerator(name: "MODE_ACCUM", value: 6, isUnsigned: true)
!501 = !DIEnumerator(name: "MODE_UACCUM", value: 7, isUnsigned: true)
!502 = !DIEnumerator(name: "MODE_FLOAT", value: 8, isUnsigned: true)
!503 = !DIEnumerator(name: "MODE_DECIMAL_FLOAT", value: 9, isUnsigned: true)
!504 = !DIEnumerator(name: "MODE_COMPLEX_INT", value: 10, isUnsigned: true)
!505 = !DIEnumerator(name: "MODE_COMPLEX_FLOAT", value: 11, isUnsigned: true)
!506 = !DIEnumerator(name: "MODE_VECTOR_INT", value: 12, isUnsigned: true)
!507 = !DIEnumerator(name: "MODE_VECTOR_FRACT", value: 13, isUnsigned: true)
!508 = !DIEnumerator(name: "MODE_VECTOR_UFRACT", value: 14, isUnsigned: true)
!509 = !DIEnumerator(name: "MODE_VECTOR_ACCUM", value: 15, isUnsigned: true)
!510 = !DIEnumerator(name: "MODE_VECTOR_UACCUM", value: 16, isUnsigned: true)
!511 = !DIEnumerator(name: "MODE_VECTOR_FLOAT", value: 17, isUnsigned: true)
!512 = !DIEnumerator(name: "MAX_MODE_CLASS", value: 18, isUnsigned: true)
!513 = !{!514, !515, !516, !517, !520, !521, !523, !531, !528, !536, !535, !544, !545, !547, !518, !1343, !1345, !662, !530, !454, !260, !491, !99, !1346, !1349, !1352, !1358, !1360}
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!516 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !519)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "splay_tree_compare_fn", file: !524, line: 70, baseType: !525)
!524 = !DIFile(filename: "./include/splay-tree.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{!516, !528, !528}
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "splay_tree_key", file: !524, line: 62, baseType: !529)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "libi_uhostptr_t", file: !524, line: 41, baseType: !530)
!530 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "splay_tree_delete_value_fn", file: !524, line: 78, baseType: !532)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{null, !535}
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "splay_tree_value", file: !524, line: 63, baseType: !529)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "c_fileinfo", file: !538, line: 1008, size: 64, elements: !539)
!538 = !DIFile(filename: "./c-common.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!539 = !{!540, !541, !543}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !537, file: !538, line: 1010, baseType: !516, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "interface_only", scope: !537, file: !538, line: 1018, baseType: !542, size: 16, offset: 32)
!542 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "interface_unknown", scope: !537, file: !538, line: 1019, baseType: !542, size: 16, offset: 48)
!544 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !546, line: 44, baseType: !7)
!546 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !548, line: 56, baseType: !549)
!548 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !228, line: 3371, size: 1792, elements: !551)
!551 = !{!552, !585, !591, !603, !622, !633, !638, !647, !653, !666, !676, !714, !867, !895, !903, !904, !909, !918, !924, !929, !933, !937, !966, !1013, !1019, !1026, !1033, !1059, !1084, !1101, !1113, !1135, !1153, !1325}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !550, file: !228, line: 3372, baseType: !553, size: 64)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !228, line: 360, size: 64, elements: !554)
!554 = !{!555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !553, file: !228, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !553, file: !228, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !553, file: !228, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !553, file: !228, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !553, file: !228, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !553, file: !228, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !553, file: !228, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !553, file: !228, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !553, file: !228, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !553, file: !228, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !553, file: !228, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !553, file: !228, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !553, file: !228, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !553, file: !228, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !553, file: !228, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !553, file: !228, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !553, file: !228, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !553, file: !228, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !553, file: !228, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !553, file: !228, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !553, file: !228, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !553, file: !228, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !553, file: !228, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !553, file: !228, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !553, file: !228, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !553, file: !228, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !553, file: !228, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !553, file: !228, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !553, file: !228, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !553, file: !228, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !550, file: !228, line: 3373, baseType: !586, size: 192)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !228, line: 402, size: 192, elements: !587)
!587 = !{!588, !589, !590}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !586, file: !228, line: 403, baseType: !553, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !586, file: !228, line: 404, baseType: !547, size: 64, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !586, file: !228, line: 405, baseType: !547, size: 64, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !550, file: !228, line: 3374, baseType: !592, size: 320)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !228, line: 1384, size: 320, elements: !593)
!593 = !{!594, !595}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !592, file: !228, line: 1385, baseType: !586, size: 192)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !592, file: !228, line: 1386, baseType: !596, size: 128, offset: 192)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !597, line: 58, baseType: !598)
!597 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !597, line: 54, size: 128, elements: !599)
!599 = !{!600, !601}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !598, file: !597, line: 56, baseType: !530, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !598, file: !597, line: 57, baseType: !602, size: 64, offset: 64)
!602 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !550, file: !228, line: 3375, baseType: !604, size: 256)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !228, line: 1397, size: 256, elements: !605)
!605 = !{!606, !607}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !604, file: !228, line: 1398, baseType: !586, size: 192)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !604, file: !228, line: 1399, baseType: !608, size: 64, offset: 192)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !610, line: 52, size: 256, elements: !611)
!610 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!611 = !{!612, !613, !614, !615, !616, !617, !618}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !609, file: !610, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !609, file: !610, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !609, file: !610, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !609, file: !610, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !609, file: !610, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !609, file: !610, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !609, file: !610, line: 62, baseType: !619, size: 192, offset: 64)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !530, size: 192, elements: !620)
!620 = !{!621}
!621 = !DISubrange(count: 3)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !550, file: !228, line: 3376, baseType: !623, size: 256)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !228, line: 1408, size: 256, elements: !624)
!624 = !{!625, !626}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !623, file: !228, line: 1409, baseType: !586, size: 192)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !623, file: !228, line: 1410, baseType: !627, size: 64, offset: 192)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !629, line: 27, size: 192, elements: !630)
!629 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!630 = !{!631, !632}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !628, file: !629, line: 29, baseType: !596, size: 128)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !628, file: !629, line: 30, baseType: !99, size: 32, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !550, file: !228, line: 3377, baseType: !634, size: 256)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !228, line: 1437, size: 256, elements: !635)
!635 = !{!636, !637}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !634, file: !228, line: 1438, baseType: !586, size: 192)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !634, file: !228, line: 1439, baseType: !547, size: 64, offset: 192)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !550, file: !228, line: 3378, baseType: !639, size: 256)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !228, line: 1418, size: 256, elements: !640)
!640 = !{!641, !642, !643}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !639, file: !228, line: 1419, baseType: !586, size: 192)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !639, file: !228, line: 1420, baseType: !516, size: 32, offset: 192)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !639, file: !228, line: 1421, baseType: !644, size: 8, offset: 224)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !519, size: 8, elements: !645)
!645 = !{!646}
!646 = !DISubrange(count: 1)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !550, file: !228, line: 3379, baseType: !648, size: 320)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !228, line: 1428, size: 320, elements: !649)
!649 = !{!650, !651, !652}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !648, file: !228, line: 1429, baseType: !586, size: 192)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !648, file: !228, line: 1430, baseType: !547, size: 64, offset: 192)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !648, file: !228, line: 1431, baseType: !547, size: 64, offset: 256)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !550, file: !228, line: 3380, baseType: !654, size: 320)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !228, line: 1460, size: 320, elements: !655)
!655 = !{!656, !657}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !654, file: !228, line: 1461, baseType: !586, size: 192)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !654, file: !228, line: 1462, baseType: !658, size: 128, offset: 192)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !659, line: 31, size: 128, elements: !660)
!659 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!660 = !{!661, !664, !665}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !658, file: !659, line: 32, baseType: !662, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !515)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !658, file: !659, line: 33, baseType: !7, size: 32, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !658, file: !659, line: 34, baseType: !7, size: 32, offset: 96)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !550, file: !228, line: 3381, baseType: !667, size: 384)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !228, line: 2507, size: 384, elements: !668)
!668 = !{!669, !670, !673, !674, !675}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !667, file: !228, line: 2508, baseType: !586, size: 192)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !667, file: !228, line: 2509, baseType: !671, size: 32, offset: 192)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !672, line: 58, baseType: !545)
!672 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!673 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !667, file: !228, line: 2510, baseType: !7, size: 32, offset: 224)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !667, file: !228, line: 2511, baseType: !547, size: 64, offset: 256)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !667, file: !228, line: 2512, baseType: !547, size: 64, offset: 320)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !550, file: !228, line: 3382, baseType: !677, size: 896)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !228, line: 2652, size: 896, elements: !678)
!678 = !{!679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !677, file: !228, line: 2653, baseType: !667, size: 384)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !677, file: !228, line: 2654, baseType: !547, size: 64, offset: 384)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !677, file: !228, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !677, file: !228, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !677, file: !228, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !677, file: !228, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !677, file: !228, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !677, file: !228, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !677, file: !228, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !677, file: !228, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !677, file: !228, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !677, file: !228, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !677, file: !228, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !677, file: !228, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !677, file: !228, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !677, file: !228, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !677, file: !228, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !677, file: !228, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !677, file: !228, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !677, file: !228, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !677, file: !228, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !677, file: !228, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !677, file: !228, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !677, file: !228, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !677, file: !228, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !677, file: !228, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !677, file: !228, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !677, file: !228, line: 2703, baseType: !7, size: 32, offset: 512)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !677, file: !228, line: 2705, baseType: !547, size: 64, offset: 576)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !677, file: !228, line: 2706, baseType: !547, size: 64, offset: 640)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !677, file: !228, line: 2707, baseType: !547, size: 64, offset: 704)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !677, file: !228, line: 2708, baseType: !547, size: 64, offset: 768)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !677, file: !228, line: 2711, baseType: !712, size: 64, offset: 832)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !228, line: 2711, flags: DIFlagFwdDecl)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !550, file: !228, line: 3383, baseType: !715, size: 960)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !228, line: 2756, size: 960, elements: !716)
!716 = !{!717, !718}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !715, file: !228, line: 2757, baseType: !677, size: 896)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !715, file: !228, line: 2758, baseType: !719, size: 64, offset: 896)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !548, line: 50, baseType: !720)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !722, line: 240, size: 384, elements: !723)
!722 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!723 = !{!724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !721, file: !722, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !721, file: !722, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !721, file: !722, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !721, file: !722, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !721, file: !722, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !721, file: !722, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !721, file: !722, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !721, file: !722, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !721, file: !722, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !721, file: !722, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !721, file: !722, line: 321, baseType: !735, size: 320, offset: 64)
!735 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !722, line: 315, size: 320, elements: !736)
!736 = !{!737, !800, !802, !865, !866}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !735, file: !722, line: 316, baseType: !738, size: 64)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !739, size: 64, elements: !645)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !722, line: 183, baseType: !740)
!740 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !722, line: 166, size: 64, elements: !741)
!741 = !{!742, !743, !744, !745, !746, !754, !755, !767, !770, !773, !774, !777, !790, !797}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !740, file: !722, line: 168, baseType: !516, size: 32)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !740, file: !722, line: 169, baseType: !7, size: 32)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !740, file: !722, line: 170, baseType: !521, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !740, file: !722, line: 171, baseType: !719, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !740, file: !722, line: 172, baseType: !747, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !548, line: 53, baseType: !748)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !722, line: 359, size: 128, elements: !750)
!750 = !{!751, !752}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !749, file: !722, line: 360, baseType: !516, size: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !749, file: !722, line: 361, baseType: !753, size: 64, offset: 64)
!753 = !DICompositeType(tag: DW_TAG_array_type, baseType: !719, size: 64, elements: !645)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !740, file: !722, line: 173, baseType: !99, size: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !740, file: !722, line: 174, baseType: !756, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !722, line: 133, baseType: !757)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !722, line: 115, size: 32, elements: !758)
!758 = !{!759, !760, !761, !762, !763, !764, !765, !766}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !757, file: !722, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !757, file: !722, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !757, file: !722, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !757, file: !722, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !757, file: !722, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !757, file: !722, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !757, file: !722, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !757, file: !722, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !740, file: !722, line: 175, baseType: !768, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !722, line: 175, flags: DIFlagFwdDecl)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !740, file: !722, line: 176, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !548, line: 46, flags: DIFlagFwdDecl)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !740, file: !722, line: 177, baseType: !547, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !740, file: !722, line: 178, baseType: !775, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !548, line: 110, flags: DIFlagFwdDecl)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !740, file: !722, line: 179, baseType: !778, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !722, line: 150, baseType: !780)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !722, line: 142, size: 320, elements: !781)
!781 = !{!782, !783, !784, !785, !788, !789}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !780, file: !722, line: 144, baseType: !547, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !780, file: !722, line: 145, baseType: !719, size: 64, offset: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !780, file: !722, line: 146, baseType: !719, size: 64, offset: 128)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !780, file: !722, line: 147, baseType: !786, size: 32, offset: 192)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !787, line: 31, baseType: !516)
!787 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!788 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !780, file: !722, line: 148, baseType: !7, size: 32, offset: 224)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !780, file: !722, line: 149, baseType: !515, size: 8, offset: 256)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !740, file: !722, line: 180, baseType: !791, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !722, line: 162, baseType: !793)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !722, line: 159, size: 128, elements: !794)
!794 = !{!795, !796}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !793, file: !722, line: 160, baseType: !547, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !793, file: !722, line: 161, baseType: !602, size: 64, offset: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !740, file: !722, line: 181, baseType: !798, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !722, line: 181, flags: DIFlagFwdDecl)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !735, file: !722, line: 317, baseType: !801, size: 64)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 64, elements: !645)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !735, file: !722, line: 318, baseType: !803, size: 320)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !722, line: 188, size: 320, elements: !804)
!804 = !{!805, !807, !864}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !803, file: !722, line: 190, baseType: !806, size: 192)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !739, size: 192, elements: !620)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !803, file: !722, line: 193, baseType: !808, size: 64, offset: 192)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !722, line: 206, size: 320, elements: !810)
!810 = !{!811, !849, !850, !851, !863}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !809, file: !722, line: 208, baseType: !812, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !548, line: 62, baseType: !814)
!814 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !815, line: 538, size: 256, elements: !816)
!815 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!816 = !{!817, !821, !827, !840}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !814, file: !815, line: 539, baseType: !818, size: 32)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !815, line: 482, size: 32, elements: !819)
!819 = !{!820}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !818, file: !815, line: 484, baseType: !7, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !814, file: !815, line: 540, baseType: !822, size: 192)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !815, line: 488, size: 192, elements: !823)
!823 = !{!824, !825, !826}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !822, file: !815, line: 489, baseType: !818, size: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !822, file: !815, line: 492, baseType: !521, size: 64, offset: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !822, file: !815, line: 496, baseType: !547, size: 64, offset: 128)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !814, file: !815, line: 541, baseType: !828, size: 256)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !815, line: 504, size: 256, elements: !829)
!829 = !{!830, !831, !838, !839}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !828, file: !815, line: 505, baseType: !818, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !828, file: !815, line: 509, baseType: !832, size: 64, offset: 64)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !815, line: 501, baseType: !833)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DISubroutineType(types: !835)
!835 = !{null, !836}
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !828, file: !815, line: 510, baseType: !836, size: 64, offset: 128)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !828, file: !815, line: 513, baseType: !812, size: 64, offset: 192)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !814, file: !815, line: 542, baseType: !841, size: 128)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !815, line: 530, size: 128, elements: !842)
!842 = !{!843, !844}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !841, file: !815, line: 531, baseType: !818, size: 32)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !841, file: !815, line: 534, baseType: !845, size: 64, offset: 64)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !815, line: 525, baseType: !846)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{!515, !547, !521, !530, !530}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !809, file: !722, line: 211, baseType: !7, size: 32, offset: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !809, file: !722, line: 214, baseType: !602, size: 64, offset: 128)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !809, file: !722, line: 224, baseType: !852, size: 64, offset: 192)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !722, line: 202, baseType: !854)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !722, line: 202, size: 128, elements: !855)
!855 = !{!856}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !854, file: !722, line: 202, baseType: !857, size: 128)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !722, line: 200, baseType: !858)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !722, line: 200, size: 128, elements: !859)
!859 = !{!860, !861, !862}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !858, file: !722, line: 200, baseType: !7, size: 32)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !858, file: !722, line: 200, baseType: !7, size: 32, offset: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !858, file: !722, line: 200, baseType: !753, size: 64, offset: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !809, file: !722, line: 234, baseType: !852, size: 64, offset: 256)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !803, file: !722, line: 197, baseType: !602, size: 64, offset: 256)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !735, file: !722, line: 319, baseType: !609, size: 256)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !735, file: !722, line: 320, baseType: !628, size: 192)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !550, file: !228, line: 3384, baseType: !868, size: 1472)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !228, line: 3114, size: 1472, elements: !869)
!869 = !{!870, !891, !892, !893, !894}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !868, file: !228, line: 3115, baseType: !871, size: 1216)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !228, line: 2984, size: 1216, elements: !872)
!872 = !{!873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !871, file: !228, line: 2985, baseType: !715, size: 960)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !871, file: !228, line: 2986, baseType: !547, size: 64, offset: 960)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !871, file: !228, line: 2987, baseType: !547, size: 64, offset: 1024)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !871, file: !228, line: 2988, baseType: !547, size: 64, offset: 1088)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !871, file: !228, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !871, file: !228, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !871, file: !228, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !871, file: !228, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !871, file: !228, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !871, file: !228, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !871, file: !228, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !871, file: !228, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !871, file: !228, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !871, file: !228, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !871, file: !228, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !871, file: !228, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !871, file: !228, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !871, file: !228, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !868, file: !228, line: 3117, baseType: !547, size: 64, offset: 1216)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !868, file: !228, line: 3119, baseType: !547, size: 64, offset: 1280)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !868, file: !228, line: 3121, baseType: !547, size: 64, offset: 1344)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !868, file: !228, line: 3123, baseType: !547, size: 64, offset: 1408)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !550, file: !228, line: 3385, baseType: !896, size: 1088)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !228, line: 2874, size: 1088, elements: !897)
!897 = !{!898, !899, !900}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !896, file: !228, line: 2875, baseType: !715, size: 960)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !896, file: !228, line: 2876, baseType: !719, size: 64, offset: 960)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !896, file: !228, line: 2877, baseType: !901, size: 64, offset: 1024)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !228, line: 2856, flags: DIFlagFwdDecl)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !550, file: !228, line: 3386, baseType: !871, size: 1216)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !550, file: !228, line: 3387, baseType: !905, size: 1280)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !228, line: 3093, size: 1280, elements: !906)
!906 = !{!907, !908}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !905, file: !228, line: 3094, baseType: !871, size: 1216)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !905, file: !228, line: 3095, baseType: !901, size: 64, offset: 1216)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !550, file: !228, line: 3388, baseType: !910, size: 1216)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !228, line: 2824, size: 1216, elements: !911)
!911 = !{!912, !913, !914, !915, !916, !917}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !910, file: !228, line: 2825, baseType: !677, size: 896)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !910, file: !228, line: 2827, baseType: !547, size: 64, offset: 896)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !910, file: !228, line: 2828, baseType: !547, size: 64, offset: 960)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !910, file: !228, line: 2829, baseType: !547, size: 64, offset: 1024)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !910, file: !228, line: 2830, baseType: !547, size: 64, offset: 1088)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !910, file: !228, line: 2831, baseType: !547, size: 64, offset: 1152)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !550, file: !228, line: 3389, baseType: !919, size: 1024)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !228, line: 2850, size: 1024, elements: !920)
!920 = !{!921, !922, !923}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !919, file: !228, line: 2851, baseType: !715, size: 960)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !919, file: !228, line: 2852, baseType: !516, size: 32, offset: 960)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !919, file: !228, line: 2853, baseType: !516, size: 32, offset: 992)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !550, file: !228, line: 3390, baseType: !925, size: 1024)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !228, line: 2857, size: 1024, elements: !926)
!926 = !{!927, !928}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !925, file: !228, line: 2858, baseType: !715, size: 960)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !925, file: !228, line: 2859, baseType: !901, size: 64, offset: 960)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !550, file: !228, line: 3391, baseType: !930, size: 960)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !228, line: 2862, size: 960, elements: !931)
!931 = !{!932}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !930, file: !228, line: 2863, baseType: !715, size: 960)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !550, file: !228, line: 3392, baseType: !934, size: 1472)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !228, line: 3304, size: 1472, elements: !935)
!935 = !{!936}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !934, file: !228, line: 3305, baseType: !868, size: 1472)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !550, file: !228, line: 3393, baseType: !938, size: 1792)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !228, line: 3248, size: 1792, elements: !939)
!939 = !{!940, !941, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !938, file: !228, line: 3249, baseType: !868, size: 1472)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !938, file: !228, line: 3251, baseType: !942, size: 64, offset: 1472)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !944, line: 41, flags: DIFlagFwdDecl)
!944 = !DIFile(filename: "./statistics.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!945 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !938, file: !228, line: 3254, baseType: !547, size: 64, offset: 1536)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !938, file: !228, line: 3257, baseType: !547, size: 64, offset: 1600)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !938, file: !228, line: 3258, baseType: !547, size: 64, offset: 1664)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !938, file: !228, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !938, file: !228, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !938, file: !228, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !938, file: !228, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !938, file: !228, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !938, file: !228, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !938, file: !228, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !938, file: !228, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !938, file: !228, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !938, file: !228, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !938, file: !228, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !938, file: !228, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !938, file: !228, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !938, file: !228, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !938, file: !228, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !938, file: !228, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !938, file: !228, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !938, file: !228, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !550, file: !228, line: 3394, baseType: !967, size: 1344)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !228, line: 2279, size: 1344, elements: !968)
!968 = !{!969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !967, file: !228, line: 2280, baseType: !586, size: 192)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !967, file: !228, line: 2281, baseType: !547, size: 64, offset: 192)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !967, file: !228, line: 2282, baseType: !547, size: 64, offset: 256)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !967, file: !228, line: 2283, baseType: !547, size: 64, offset: 320)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !967, file: !228, line: 2284, baseType: !547, size: 64, offset: 384)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !967, file: !228, line: 2285, baseType: !7, size: 32, offset: 448)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !967, file: !228, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !967, file: !228, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !967, file: !228, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !967, file: !228, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !967, file: !228, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !967, file: !228, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !967, file: !228, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !967, file: !228, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !967, file: !228, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !967, file: !228, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !967, file: !228, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !967, file: !228, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !967, file: !228, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !967, file: !228, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !967, file: !228, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !967, file: !228, line: 2305, baseType: !7, size: 32, offset: 512)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !967, file: !228, line: 2306, baseType: !786, size: 32, offset: 544)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !967, file: !228, line: 2307, baseType: !547, size: 64, offset: 576)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !967, file: !228, line: 2308, baseType: !547, size: 64, offset: 640)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !967, file: !228, line: 2314, baseType: !995, size: 64, offset: 704)
!995 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !228, line: 2309, size: 64, elements: !996)
!996 = !{!997, !998, !999}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !995, file: !228, line: 2310, baseType: !516, size: 32)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !995, file: !228, line: 2311, baseType: !521, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !995, file: !228, line: 2312, baseType: !1000, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !228, line: 2277, flags: DIFlagFwdDecl)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !967, file: !228, line: 2315, baseType: !547, size: 64, offset: 768)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !967, file: !228, line: 2316, baseType: !547, size: 64, offset: 832)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !967, file: !228, line: 2317, baseType: !547, size: 64, offset: 896)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !967, file: !228, line: 2318, baseType: !547, size: 64, offset: 960)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !967, file: !228, line: 2319, baseType: !547, size: 64, offset: 1024)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !967, file: !228, line: 2320, baseType: !547, size: 64, offset: 1088)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !967, file: !228, line: 2321, baseType: !547, size: 64, offset: 1152)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !967, file: !228, line: 2322, baseType: !547, size: 64, offset: 1216)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !967, file: !228, line: 2324, baseType: !1011, size: 64, offset: 1280)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !228, line: 2324, flags: DIFlagFwdDecl)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !550, file: !228, line: 3395, baseType: !1014, size: 320)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !228, line: 1469, size: 320, elements: !1015)
!1015 = !{!1016, !1017, !1018}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1014, file: !228, line: 1470, baseType: !586, size: 192)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1014, file: !228, line: 1471, baseType: !547, size: 64, offset: 192)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1014, file: !228, line: 1472, baseType: !547, size: 64, offset: 256)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !550, file: !228, line: 3396, baseType: !1020, size: 320)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !228, line: 1482, size: 320, elements: !1021)
!1021 = !{!1022, !1023, !1024}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1020, file: !228, line: 1483, baseType: !586, size: 192)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1020, file: !228, line: 1484, baseType: !516, size: 32, offset: 192)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1020, file: !228, line: 1485, baseType: !1025, size: 64, offset: 256)
!1025 = !DICompositeType(tag: DW_TAG_array_type, baseType: !547, size: 64, elements: !645)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !550, file: !228, line: 3397, baseType: !1027, size: 384)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !228, line: 1829, size: 384, elements: !1028)
!1028 = !{!1029, !1030, !1031, !1032}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1027, file: !228, line: 1830, baseType: !586, size: 192)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1027, file: !228, line: 1831, baseType: !671, size: 32, offset: 192)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1027, file: !228, line: 1832, baseType: !547, size: 64, offset: 256)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1027, file: !228, line: 1835, baseType: !1025, size: 64, offset: 320)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !550, file: !228, line: 3398, baseType: !1034, size: 704)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !228, line: 1898, size: 704, elements: !1035)
!1035 = !{!1036, !1037, !1038, !1042, !1043, !1046}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1034, file: !228, line: 1899, baseType: !586, size: 192)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1034, file: !228, line: 1902, baseType: !547, size: 64, offset: 192)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1034, file: !228, line: 1905, baseType: !1039, size: 64, offset: 256)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !548, line: 58, baseType: !1040)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !548, line: 57, flags: DIFlagFwdDecl)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1034, file: !228, line: 1908, baseType: !7, size: 32, offset: 320)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1034, file: !228, line: 1911, baseType: !1044, size: 64, offset: 384)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !228, line: 1876, flags: DIFlagFwdDecl)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1034, file: !228, line: 1914, baseType: !1047, size: 256, offset: 448)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !228, line: 1883, size: 256, elements: !1048)
!1048 = !{!1049, !1051, !1052, !1057}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1047, file: !228, line: 1884, baseType: !1050, size: 64)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1047, file: !228, line: 1885, baseType: !1050, size: 64, offset: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1047, file: !228, line: 1891, baseType: !1053, size: 64, offset: 128)
!1053 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1047, file: !228, line: 1891, size: 64, elements: !1054)
!1054 = !{!1055, !1056}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1053, file: !228, line: 1891, baseType: !1039, size: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1053, file: !228, line: 1891, baseType: !547, size: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1047, file: !228, line: 1892, baseType: !1058, size: 64, offset: 192)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !550, file: !228, line: 3399, baseType: !1060, size: 704)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !228, line: 2008, size: 704, elements: !1061)
!1061 = !{!1062, !1063, !1064, !1065, !1066, !1067, !1079, !1080, !1081, !1082, !1083}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1060, file: !228, line: 2009, baseType: !586, size: 192)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1060, file: !228, line: 2011, baseType: !7, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !1060, file: !228, line: 2012, baseType: !7, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1060, file: !228, line: 2014, baseType: !671, size: 32, offset: 224)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1060, file: !228, line: 2016, baseType: !547, size: 64, offset: 256)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !1060, file: !228, line: 2017, baseType: !1068, size: 64, offset: 320)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !228, line: 183, baseType: !1070)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !228, line: 183, size: 128, elements: !1071)
!1071 = !{!1072}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1070, file: !228, line: 183, baseType: !1073, size: 128)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !228, line: 182, baseType: !1074)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !228, line: 182, size: 128, elements: !1075)
!1075 = !{!1076, !1077, !1078}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1074, file: !228, line: 182, baseType: !7, size: 32)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1074, file: !228, line: 182, baseType: !7, size: 32, offset: 32)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1074, file: !228, line: 182, baseType: !1025, size: 64, offset: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !1060, file: !228, line: 2019, baseType: !547, size: 64, offset: 384)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !1060, file: !228, line: 2020, baseType: !547, size: 64, offset: 448)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1060, file: !228, line: 2021, baseType: !547, size: 64, offset: 512)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !1060, file: !228, line: 2022, baseType: !547, size: 64, offset: 576)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !1060, file: !228, line: 2023, baseType: !547, size: 64, offset: 640)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !550, file: !228, line: 3400, baseType: !1085, size: 832)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !228, line: 2430, size: 832, elements: !1086)
!1086 = !{!1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1085, file: !228, line: 2431, baseType: !586, size: 192)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1085, file: !228, line: 2433, baseType: !547, size: 64, offset: 192)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !1085, file: !228, line: 2434, baseType: !547, size: 64, offset: 256)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !1085, file: !228, line: 2435, baseType: !547, size: 64, offset: 320)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !1085, file: !228, line: 2436, baseType: !547, size: 64, offset: 384)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "base_accesses", scope: !1085, file: !228, line: 2437, baseType: !1068, size: 64, offset: 448)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "inheritance", scope: !1085, file: !228, line: 2438, baseType: !547, size: 64, offset: 512)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_subvtt", scope: !1085, file: !228, line: 2440, baseType: !547, size: 64, offset: 576)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_vptr", scope: !1085, file: !228, line: 2441, baseType: !547, size: 64, offset: 640)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "base_binfos", scope: !1085, file: !228, line: 2443, baseType: !1097, size: 128, offset: 704)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_none", file: !228, line: 182, baseType: !1098)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_none", file: !228, line: 182, size: 128, elements: !1099)
!1099 = !{!1100}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1098, file: !228, line: 182, baseType: !1073, size: 128)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "stmt_list", scope: !550, file: !228, line: 3401, baseType: !1102, size: 320)
!1102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list", file: !228, line: 3327, size: 320, elements: !1103)
!1103 = !{!1104, !1105, !1112}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1102, file: !228, line: 3329, baseType: !586, size: 192)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1102, file: !228, line: 3330, baseType: !1106, size: 64, offset: 192)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list_node", file: !228, line: 3320, size: 192, elements: !1108)
!1108 = !{!1109, !1110, !1111}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1107, file: !228, line: 3322, baseType: !1106, size: 64)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1107, file: !228, line: 3323, baseType: !1106, size: 64, offset: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1107, file: !228, line: 3324, baseType: !547, size: 64, offset: 128)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1102, file: !228, line: 3331, baseType: !1106, size: 64, offset: 256)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "constructor", scope: !550, file: !228, line: 3402, baseType: !1114, size: 256)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_constructor", file: !228, line: 1540, size: 256, elements: !1115)
!1115 = !{!1116, !1117}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1114, file: !228, line: 1541, baseType: !586, size: 192)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !1114, file: !228, line: 1542, baseType: !1118, size: 64, offset: 192)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64)
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_gc", file: !228, line: 1538, baseType: !1120)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_gc", file: !228, line: 1538, size: 192, elements: !1121)
!1121 = !{!1122}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1120, file: !228, line: 1538, baseType: !1123, size: 192)
!1123 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_base", file: !228, line: 1537, baseType: !1124)
!1124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_base", file: !228, line: 1537, size: 192, elements: !1125)
!1125 = !{!1126, !1127, !1128}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1124, file: !228, line: 1537, baseType: !7, size: 32)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1124, file: !228, line: 1537, baseType: !7, size: 32, offset: 32)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1124, file: !228, line: 1537, baseType: !1129, size: 128, offset: 64)
!1129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1130, size: 128, elements: !645)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "constructor_elt", file: !228, line: 1535, baseType: !1131)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "constructor_elt_d", file: !228, line: 1532, size: 128, elements: !1132)
!1132 = !{!1133, !1134}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1131, file: !228, line: 1533, baseType: !547, size: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1131, file: !228, line: 1534, baseType: !547, size: 64, offset: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "omp_clause", scope: !550, file: !228, line: 3403, baseType: !1136, size: 512)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_omp_clause", file: !228, line: 1938, size: 512, elements: !1137)
!1137 = !{!1138, !1139, !1140, !1141, !1147, !1151, !1152}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1136, file: !228, line: 1939, baseType: !586, size: 192)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1136, file: !228, line: 1940, baseType: !671, size: 32, offset: 192)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1136, file: !228, line: 1941, baseType: !227, size: 32, offset: 224)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !1136, file: !228, line: 1946, baseType: !1142, size: 32, offset: 256)
!1142 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "omp_clause_subcode", file: !228, line: 1942, size: 32, elements: !1143)
!1143 = !{!1144, !1145, !1146}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "default_kind", scope: !1142, file: !228, line: 1943, baseType: !246, size: 32)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "schedule_kind", scope: !1142, file: !228, line: 1944, baseType: !253, size: 32)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "reduction_code", scope: !1142, file: !228, line: 1945, baseType: !260, size: 32)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reduction_init", scope: !1136, file: !228, line: 1950, baseType: !1148, size: 64, offset: 320)
!1148 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !548, line: 66, baseType: !1149)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64)
!1150 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !548, line: 65, flags: DIFlagFwdDecl)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reduction_merge", scope: !1136, file: !228, line: 1951, baseType: !1148, size: 64, offset: 384)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1136, file: !228, line: 1953, baseType: !1025, size: 64, offset: 448)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "optimization", scope: !550, file: !228, line: 3404, baseType: !1154, size: 1664)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_optimization_option", file: !228, line: 3337, size: 1664, elements: !1155)
!1155 = !{!1156, !1157}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1154, file: !228, line: 3338, baseType: !586, size: 192)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !1154, file: !228, line: 3341, baseType: !1158, size: 1472, offset: 192)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cl_optimization", file: !1159, line: 410, size: 1472, elements: !1160)
!1159 = !DIFile(filename: "./options.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1160 = !{!1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "align_functions", scope: !1158, file: !1159, line: 412, baseType: !516, size: 32)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "align_jumps", scope: !1158, file: !1159, line: 413, baseType: !516, size: 32, offset: 32)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "align_labels", scope: !1158, file: !1159, line: 414, baseType: !516, size: 32, offset: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "align_loops", scope: !1158, file: !1159, line: 415, baseType: !516, size: 32, offset: 96)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_stalled_insns", scope: !1158, file: !1159, line: 416, baseType: !516, size: 32, offset: 128)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_stalled_insns_dep", scope: !1158, file: !1159, line: 417, baseType: !516, size: 32, offset: 160)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "optimize", scope: !1158, file: !1159, line: 418, baseType: !515, size: 8, offset: 192)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_size", scope: !1158, file: !1159, line: 419, baseType: !515, size: 8, offset: 200)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "flag_argument_noalias", scope: !1158, file: !1159, line: 420, baseType: !1170, size: 8, offset: 208)
!1170 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "flag_asynchronous_unwind_tables", scope: !1158, file: !1159, line: 421, baseType: !1170, size: 8, offset: 216)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_on_count_reg", scope: !1158, file: !1159, line: 422, baseType: !1170, size: 8, offset: 224)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_probabilities", scope: !1158, file: !1159, line: 423, baseType: !1170, size: 8, offset: 232)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_target_load_optimize", scope: !1158, file: !1159, line: 424, baseType: !1170, size: 8, offset: 240)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_target_load_optimize2", scope: !1158, file: !1159, line: 425, baseType: !1170, size: 8, offset: 248)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "flag_btr_bb_exclusive", scope: !1158, file: !1159, line: 426, baseType: !1170, size: 8, offset: 256)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "flag_caller_saves", scope: !1158, file: !1159, line: 427, baseType: !1170, size: 8, offset: 264)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "flag_no_common", scope: !1158, file: !1159, line: 428, baseType: !1170, size: 8, offset: 272)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "flag_conserve_stack", scope: !1158, file: !1159, line: 429, baseType: !1170, size: 8, offset: 280)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cprop_registers", scope: !1158, file: !1159, line: 430, baseType: !1170, size: 8, offset: 288)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "flag_crossjumping", scope: !1158, file: !1159, line: 431, baseType: !1170, size: 8, offset: 296)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cse_follow_jumps", scope: !1158, file: !1159, line: 432, baseType: !1170, size: 8, offset: 304)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cx_fortran_rules", scope: !1158, file: !1159, line: 433, baseType: !1170, size: 8, offset: 312)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cx_limited_range", scope: !1158, file: !1159, line: 434, baseType: !1170, size: 8, offset: 320)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "flag_data_sections", scope: !1158, file: !1159, line: 435, baseType: !1170, size: 8, offset: 328)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "flag_dce", scope: !1158, file: !1159, line: 436, baseType: !1170, size: 8, offset: 336)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "flag_defer_pop", scope: !1158, file: !1159, line: 437, baseType: !1170, size: 8, offset: 344)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "flag_delayed_branch", scope: !1158, file: !1159, line: 438, baseType: !1170, size: 8, offset: 352)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "flag_delete_null_pointer_checks", scope: !1158, file: !1159, line: 439, baseType: !1170, size: 8, offset: 360)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "flag_dse", scope: !1158, file: !1159, line: 440, baseType: !1170, size: 8, offset: 368)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "flag_early_inlining", scope: !1158, file: !1159, line: 441, baseType: !1170, size: 8, offset: 376)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "flag_exceptions", scope: !1158, file: !1159, line: 442, baseType: !1170, size: 8, offset: 384)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "flag_expensive_optimizations", scope: !1158, file: !1159, line: 443, baseType: !1170, size: 8, offset: 392)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "flag_finite_math_only", scope: !1158, file: !1159, line: 444, baseType: !1170, size: 8, offset: 400)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "flag_float_store", scope: !1158, file: !1159, line: 445, baseType: !1170, size: 8, offset: 408)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "flag_forward_propagate", scope: !1158, file: !1159, line: 446, baseType: !1170, size: 8, offset: 416)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse", scope: !1158, file: !1159, line: 447, baseType: !1170, size: 8, offset: 424)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_after_reload", scope: !1158, file: !1159, line: 448, baseType: !1170, size: 8, offset: 432)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_las", scope: !1158, file: !1159, line: 449, baseType: !1170, size: 8, offset: 440)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_lm", scope: !1158, file: !1159, line: 450, baseType: !1170, size: 8, offset: 448)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_sm", scope: !1158, file: !1159, line: 451, baseType: !1170, size: 8, offset: 456)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "flag_graphite_identity", scope: !1158, file: !1159, line: 452, baseType: !1170, size: 8, offset: 464)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "flag_guess_branch_prob", scope: !1158, file: !1159, line: 453, baseType: !1170, size: 8, offset: 472)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "flag_if_conversion", scope: !1158, file: !1159, line: 454, baseType: !1170, size: 8, offset: 480)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "flag_if_conversion2", scope: !1158, file: !1159, line: 455, baseType: !1170, size: 8, offset: 488)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_functions", scope: !1158, file: !1159, line: 456, baseType: !1170, size: 8, offset: 496)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_functions_called_once", scope: !1158, file: !1159, line: 457, baseType: !1170, size: 8, offset: 504)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_small_functions", scope: !1158, file: !1159, line: 458, baseType: !1170, size: 8, offset: 512)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_cp", scope: !1158, file: !1159, line: 459, baseType: !1170, size: 8, offset: 520)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_cp_clone", scope: !1158, file: !1159, line: 460, baseType: !1170, size: 8, offset: 528)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_matrix_reorg", scope: !1158, file: !1159, line: 461, baseType: !1170, size: 8, offset: 536)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_pta", scope: !1158, file: !1159, line: 462, baseType: !1170, size: 8, offset: 544)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_pure_const", scope: !1158, file: !1159, line: 463, baseType: !1170, size: 8, offset: 552)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_reference", scope: !1158, file: !1159, line: 464, baseType: !1170, size: 8, offset: 560)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_sra", scope: !1158, file: !1159, line: 465, baseType: !1170, size: 8, offset: 568)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_type_escape", scope: !1158, file: !1159, line: 466, baseType: !1170, size: 8, offset: 576)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ivopts", scope: !1158, file: !1159, line: 467, baseType: !1170, size: 8, offset: 584)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "flag_jump_tables", scope: !1158, file: !1159, line: 468, baseType: !1170, size: 8, offset: 592)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_block", scope: !1158, file: !1159, line: 469, baseType: !1170, size: 8, offset: 600)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_interchange", scope: !1158, file: !1159, line: 470, baseType: !1170, size: 8, offset: 608)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_parallelize_all", scope: !1158, file: !1159, line: 471, baseType: !1170, size: 8, offset: 616)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_strip_mine", scope: !1158, file: !1159, line: 472, baseType: !1170, size: 8, offset: 624)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "flag_lto_report", scope: !1158, file: !1159, line: 473, baseType: !1170, size: 8, offset: 632)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ltrans", scope: !1158, file: !1159, line: 474, baseType: !1170, size: 8, offset: 640)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "flag_errno_math", scope: !1158, file: !1159, line: 475, baseType: !1170, size: 8, offset: 648)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "flag_merge_constants", scope: !1158, file: !1159, line: 476, baseType: !1170, size: 8, offset: 656)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "flag_modulo_sched", scope: !1158, file: !1159, line: 477, baseType: !1170, size: 8, offset: 664)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "flag_move_loop_invariants", scope: !1158, file: !1159, line: 478, baseType: !1170, size: 8, offset: 672)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "flag_non_call_exceptions", scope: !1158, file: !1159, line: 479, baseType: !1170, size: 8, offset: 680)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "flag_omit_frame_pointer", scope: !1158, file: !1159, line: 480, baseType: !1170, size: 8, offset: 688)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "flag_regmove", scope: !1158, file: !1159, line: 481, baseType: !1170, size: 8, offset: 696)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "flag_optimize_sibling_calls", scope: !1158, file: !1159, line: 482, baseType: !1170, size: 8, offset: 704)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "flag_pack_struct", scope: !1158, file: !1159, line: 483, baseType: !1170, size: 8, offset: 712)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "flag_peel_loops", scope: !1158, file: !1159, line: 484, baseType: !1170, size: 8, offset: 720)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "flag_no_peephole", scope: !1158, file: !1159, line: 485, baseType: !1170, size: 8, offset: 728)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "flag_peephole2", scope: !1158, file: !1159, line: 486, baseType: !1170, size: 8, offset: 736)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "flag_predictive_commoning", scope: !1158, file: !1159, line: 487, baseType: !1170, size: 8, offset: 744)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "flag_prefetch_loop_arrays", scope: !1158, file: !1159, line: 488, baseType: !1170, size: 8, offset: 752)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "flag_pcc_struct_return", scope: !1158, file: !1159, line: 489, baseType: !1170, size: 8, offset: 760)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "flag_rename_registers", scope: !1158, file: !1159, line: 490, baseType: !1170, size: 8, offset: 768)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "flag_reorder_blocks", scope: !1158, file: !1159, line: 491, baseType: !1170, size: 8, offset: 776)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "flag_reorder_blocks_and_partition", scope: !1158, file: !1159, line: 492, baseType: !1170, size: 8, offset: 784)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "flag_reorder_functions", scope: !1158, file: !1159, line: 493, baseType: !1170, size: 8, offset: 792)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "flag_rerun_cse_after_loop", scope: !1158, file: !1159, line: 494, baseType: !1170, size: 8, offset: 800)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "flag_resched_modulo_sched", scope: !1158, file: !1159, line: 495, baseType: !1170, size: 8, offset: 808)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "flag_rounding_math", scope: !1158, file: !1159, line: 496, baseType: !1170, size: 8, offset: 816)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_critical_path_heuristic", scope: !1158, file: !1159, line: 497, baseType: !1170, size: 8, offset: 824)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_dep_count_heuristic", scope: !1158, file: !1159, line: 498, baseType: !1170, size: 8, offset: 832)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_group_heuristic", scope: !1158, file: !1159, line: 499, baseType: !1170, size: 8, offset: 840)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_interblock", scope: !1158, file: !1159, line: 500, baseType: !1170, size: 8, offset: 848)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_last_insn_heuristic", scope: !1158, file: !1159, line: 501, baseType: !1170, size: 8, offset: 856)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_pressure", scope: !1158, file: !1159, line: 502, baseType: !1170, size: 8, offset: 864)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_rank_heuristic", scope: !1158, file: !1159, line: 503, baseType: !1170, size: 8, offset: 872)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_speculative", scope: !1158, file: !1159, line: 504, baseType: !1170, size: 8, offset: 880)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_spec_insn_heuristic", scope: !1158, file: !1159, line: 505, baseType: !1170, size: 8, offset: 888)
