; ModuleID = 'c-objc-common.bc'
source_filename = "c-objc-common.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }
%struct.tree_decl_minimal = type { %struct.tree_common, i32, i32, %union.tree_node*, %union.tree_node* }
%struct.tree_common = type { %struct.tree_base, %union.tree_node*, %union.tree_node* }

!365 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_NONE", value: 2, isUnsigned: true)
!366 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_PRIVATE", value: 3, isUnsigned: true)
!367 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_FIRSTPRIVATE", value: 4, isUnsigned: true)
!368 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "omp_clause_schedule_kind", file: !133, line: 1805, baseType: !5, size: 32, elements: !369)
!369 = !{!370, !371, !372, !373, !374}
!370 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_STATIC", value: 0, isUnsigned: true)
!371 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_DYNAMIC", value: 1, isUnsigned: true)
!372 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_GUIDED", value: 2, isUnsigned: true)
!373 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_AUTO", value: 3, isUnsigned: true)
!374 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_RUNTIME", value: 4, isUnsigned: true)
!375 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !376, line: 104, baseType: !5, size: 32, elements: !377)
!376 = !DIFile(filename: "./pretty-print.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!377 = !{!378, !379, !380}
!378 = !DIEnumerator(name: "pp_none", value: 0, isUnsigned: true)
!379 = !DIEnumerator(name: "pp_before", value: 1, isUnsigned: true)
!380 = !DIEnumerator(name: "pp_after", value: 2, isUnsigned: true)
!381 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !376, line: 46, baseType: !5, size: 32, elements: !382)
!382 = !{!383, !384, !385}
!383 = !DIEnumerator(name: "DIAGNOSTICS_SHOW_PREFIX_ONCE", value: 0, isUnsigned: true)
!384 = !DIEnumerator(name: "DIAGNOSTICS_SHOW_PREFIX_NEVER", value: 1, isUnsigned: true)
!385 = !DIEnumerator(name: "DIAGNOSTICS_SHOW_PREFIX_EVERY_LINE", value: 2, isUnsigned: true)
!386 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !387, line: 29, baseType: !5, size: 32, elements: !388)
!387 = !DIFile(filename: "./diagnostic.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!388 = !{!389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401}
!389 = !DIEnumerator(name: "DK_UNSPECIFIED", value: 0, isUnsigned: true)
!390 = !DIEnumerator(name: "DK_IGNORED", value: 1, isUnsigned: true)
!391 = !DIEnumerator(name: "DK_FATAL", value: 2, isUnsigned: true)
!392 = !DIEnumerator(name: "DK_ICE", value: 3, isUnsigned: true)
!393 = !DIEnumerator(name: "DK_ERROR", value: 4, isUnsigned: true)
!394 = !DIEnumerator(name: "DK_SORRY", value: 5, isUnsigned: true)
!395 = !DIEnumerator(name: "DK_WARNING", value: 6, isUnsigned: true)
!396 = !DIEnumerator(name: "DK_ANACHRONISM", value: 7, isUnsigned: true)
!397 = !DIEnumerator(name: "DK_NOTE", value: 8, isUnsigned: true)
!398 = !DIEnumerator(name: "DK_DEBUG", value: 9, isUnsigned: true)
!399 = !DIEnumerator(name: "DK_PEDWARN", value: 10, isUnsigned: true)
!400 = !DIEnumerator(name: "DK_PERMERROR", value: 11, isUnsigned: true)
!401 = !DIEnumerator(name: "DK_LAST_DIAGNOSTIC_KIND", value: 12, isUnsigned: true)
!402 = !{!403, !404, !405, !406, !409, !410, !132, !412, !552}
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!405 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !408)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "c_pretty_printer", file: !414, line: 38, baseType: !415)
!414 = !DIFile(filename: "./c-pretty-print.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "c_pretty_print_info", file: !414, line: 54, size: 2112, elements: !416)
!416 = !{!417, !1773, !1775, !1777, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !415, file: !414, line: 56, baseType: !418, size: 448)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "pretty_printer", file: !376, line: 134, baseType: !419)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pretty_print_info", file: !376, line: 158, size: 448, elements: !420)
!420 = !{!421, !535, !536, !538, !539, !540, !547, !1770, !1771, !1772}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !419, file: !376, line: 161, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "output_buffer", file: !376, line: 99, baseType: !424)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !376, line: 74, size: 2688, elements: !425)
!425 = !{!426, !459, !460, !462, !471, !530, !531}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "formatted_obstack", scope: !424, file: !376, line: 77, baseType: !427, size: 704)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !428, line: 164, size: 704, elements: !429)
!428 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!429 = !{!430, !432, !442, !443, !444, !445, !446, !447, !451, !455, !456, !457, !458}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !427, file: !428, line: 166, baseType: !431, size: 64)
!431 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !427, file: !428, line: 167, baseType: !433, size: 64, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !428, line: 157, size: 192, elements: !435)
!435 = !{!436, !437, !438}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !434, file: !428, line: 159, baseType: !407, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !434, file: !428, line: 160, baseType: !433, size: 64, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !434, file: !428, line: 161, baseType: !439, size: 32, offset: 128)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !408, size: 32, elements: !440)
!440 = !{!441}
!441 = !DISubrange(count: 4)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !427, file: !428, line: 168, baseType: !407, size: 64, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !427, file: !428, line: 169, baseType: !407, size: 64, offset: 192)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !427, file: !428, line: 170, baseType: !407, size: 64, offset: 256)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !427, file: !428, line: 171, baseType: !431, size: 64, offset: 320)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !427, file: !428, line: 172, baseType: !405, size: 32, offset: 384)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !427, file: !428, line: 176, baseType: !448, size: 64, offset: 448)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DISubroutineType(types: !450)
!450 = !{!433, !409, !431}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !427, file: !428, line: 177, baseType: !452, size: 64, offset: 512)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DISubroutineType(types: !454)
!454 = !{null, !409, !433}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !427, file: !428, line: 178, baseType: !409, size: 64, offset: 576)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !427, file: !428, line: 179, baseType: !5, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !427, file: !428, line: 180, baseType: !5, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !427, file: !428, line: 184, baseType: !5, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_obstack", scope: !424, file: !376, line: 81, baseType: !427, size: 704, offset: 704)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !424, file: !376, line: 85, baseType: !461, size: 64, offset: 1408)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "cur_chunk_array", scope: !424, file: !376, line: 88, baseType: !463, size: 64, offset: 1472)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chunk_info", file: !376, line: 58, size: 3904, elements: !465)
!465 = !{!466, !467}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !464, file: !376, line: 61, baseType: !463, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !464, file: !376, line: 69, baseType: !468, size: 3840, offset: 64)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 3840, elements: !469)
!469 = !{!470}
!470 = !DISubrange(count: 60)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !424, file: !376, line: 91, baseType: !472, size: 64, offset: 1536)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !474, line: 7, baseType: !475)
!474 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !476, line: 49, size: 1728, elements: !477)
!476 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!477 = !{!478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !493, !495, !496, !497, !500, !502, !504, !508, !511, !513, !516, !519, !520, !521, !525, !526}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !475, file: !476, line: 51, baseType: !405, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !475, file: !476, line: 54, baseType: !407, size: 64, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !475, file: !476, line: 55, baseType: !407, size: 64, offset: 128)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !475, file: !476, line: 56, baseType: !407, size: 64, offset: 192)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !475, file: !476, line: 57, baseType: !407, size: 64, offset: 256)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !475, file: !476, line: 58, baseType: !407, size: 64, offset: 320)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !475, file: !476, line: 59, baseType: !407, size: 64, offset: 384)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !475, file: !476, line: 60, baseType: !407, size: 64, offset: 448)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !475, file: !476, line: 61, baseType: !407, size: 64, offset: 512)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !475, file: !476, line: 64, baseType: !407, size: 64, offset: 576)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !475, file: !476, line: 65, baseType: !407, size: 64, offset: 640)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !475, file: !476, line: 66, baseType: !407, size: 64, offset: 704)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !475, file: !476, line: 68, baseType: !491, size: 64, offset: 768)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !476, line: 36, flags: DIFlagFwdDecl)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !475, file: !476, line: 70, baseType: !494, size: 64, offset: 832)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !475, file: !476, line: 72, baseType: !405, size: 32, offset: 896)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !475, file: !476, line: 73, baseType: !405, size: 32, offset: 928)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !475, file: !476, line: 74, baseType: !498, size: 64, offset: 960)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !499, line: 152, baseType: !431)
!499 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!500 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !475, file: !476, line: 77, baseType: !501, size: 16, offset: 1024)
!501 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !475, file: !476, line: 78, baseType: !503, size: 8, offset: 1040)
!503 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !475, file: !476, line: 79, baseType: !505, size: 8, offset: 1048)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !408, size: 8, elements: !506)
!506 = !{!507}
!507 = !DISubrange(count: 1)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !475, file: !476, line: 81, baseType: !509, size: 64, offset: 1088)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !476, line: 43, baseType: null)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !475, file: !476, line: 89, baseType: !512, size: 64, offset: 1152)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !499, line: 153, baseType: !431)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !475, file: !476, line: 91, baseType: !514, size: 64, offset: 1216)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !476, line: 37, flags: DIFlagFwdDecl)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !475, file: !476, line: 92, baseType: !517, size: 64, offset: 1280)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !476, line: 38, flags: DIFlagFwdDecl)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !475, file: !476, line: 93, baseType: !494, size: 64, offset: 1344)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !475, file: !476, line: 94, baseType: !409, size: 64, offset: 1408)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !475, file: !476, line: 95, baseType: !522, size: 64, offset: 1472)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !523, line: 46, baseType: !524)
!523 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!524 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !475, file: !476, line: 96, baseType: !405, size: 32, offset: 1536)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !475, file: !476, line: 98, baseType: !527, size: 160, offset: 1568)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !408, size: 160, elements: !528)
!528 = !{!529}
!529 = !DISubrange(count: 20)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "line_length", scope: !424, file: !376, line: 94, baseType: !405, size: 32, offset: 1600)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "digit_buffer", scope: !424, file: !376, line: 98, baseType: !532, size: 1024, offset: 1632)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !408, size: 1024, elements: !533)
!533 = !{!534}
!534 = !DISubrange(count: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !419, file: !376, line: 164, baseType: !410, size: 64, offset: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !419, file: !376, line: 167, baseType: !537, size: 32, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "pp_padding", file: !376, line: 107, baseType: !375)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "maximum_length", scope: !419, file: !376, line: 171, baseType: !405, size: 32, offset: 160)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "indent_skip", scope: !419, file: !376, line: 174, baseType: !405, size: 32, offset: 192)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "wrapping", scope: !419, file: !376, line: 177, baseType: !541, size: 64, offset: 224)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "pp_wrapping_mode_t", file: !376, line: 119, baseType: !542)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !376, line: 111, size: 64, elements: !543)
!543 = !{!544, !546}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "rule", scope: !542, file: !376, line: 114, baseType: !545, size: 32)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "diagnostic_prefixing_rule_t", file: !376, line: 51, baseType: !381)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "line_cutoff", scope: !542, file: !376, line: 118, baseType: !405, size: 32, offset: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "format_decoder", scope: !419, file: !376, line: 187, baseType: !548, size: 64, offset: 320)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "printer_fn", file: !376, line: 135, baseType: !549)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{!404, !552, !553, !410, !405, !404, !404, !404}
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "text_info", file: !376, line: 39, baseType: !555)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !376, line: 32, size: 320, elements: !556)
!556 = !{!557, !558, !572, !573, !579}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "format_spec", scope: !555, file: !376, line: 34, baseType: !410, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "args_ptr", scope: !555, file: !376, line: 35, baseType: !559, size: 64, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !561, line: 52, baseType: !562)
!561 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !563, line: 32, baseType: !564)
!563 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stdarg.h", directory: "")
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 173, baseType: !565)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 192, elements: !506)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, elements: !567)
!567 = !{!568, !569, !570, !571}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !566, file: !1, baseType: !5, size: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !566, file: !1, baseType: !5, size: 32, offset: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !566, file: !1, baseType: !409, size: 64, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !566, file: !1, baseType: !409, size: 64, offset: 128)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "err_no", scope: !555, file: !376, line: 36, baseType: !405, size: 32, offset: 128)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !555, file: !376, line: 37, baseType: !574, size: 64, offset: 192)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !576, line: 58, baseType: !577)
!576 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !578, line: 44, baseType: !5)
!578 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!579 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !555, file: !376, line: 38, baseType: !580, size: 64, offset: 256)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !582, line: 56, baseType: !583)
!582 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !133, line: 3371, size: 1792, elements: !585)
!585 = !{!586, !619, !625, !636, !655, !666, !671, !677, !683, !696, !704, !742, !1167, !1195, !1203, !1204, !1209, !1218, !1224, !1229, !1233, !1237, !1413, !1460, !1466, !1472, !1479, !1490, !1515, !1532, !1544, !1566, !1581, !1752}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !584, file: !133, line: 3372, baseType: !587, size: 64)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !133, line: 360, size: 64, elements: !588)
!588 = !{!589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !587, file: !133, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !587, file: !133, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !587, file: !133, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !587, file: !133, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !587, file: !133, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !587, file: !133, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !587, file: !133, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !587, file: !133, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !587, file: !133, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !587, file: !133, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !587, file: !133, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !587, file: !133, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !587, file: !133, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !587, file: !133, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !587, file: !133, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !587, file: !133, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !587, file: !133, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !587, file: !133, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !587, file: !133, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !587, file: !133, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !587, file: !133, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !587, file: !133, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !587, file: !133, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !587, file: !133, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !587, file: !133, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !587, file: !133, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !587, file: !133, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !587, file: !133, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !587, file: !133, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !587, file: !133, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !584, file: !133, line: 3373, baseType: !620, size: 192)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !133, line: 402, size: 192, elements: !621)
!621 = !{!622, !623, !624}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !620, file: !133, line: 403, baseType: !587, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !620, file: !133, line: 404, baseType: !581, size: 64, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !620, file: !133, line: 405, baseType: !581, size: 64, offset: 128)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !584, file: !133, line: 3374, baseType: !626, size: 320)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !133, line: 1384, size: 320, elements: !627)
!627 = !{!628, !629}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !626, file: !133, line: 1385, baseType: !620, size: 192)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !626, file: !133, line: 1386, baseType: !630, size: 128, offset: 192)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !631, line: 58, baseType: !632)
!631 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !631, line: 54, size: 128, elements: !633)
!633 = !{!634, !635}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !632, file: !631, line: 56, baseType: !524, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !632, file: !631, line: 57, baseType: !431, size: 64, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !584, file: !133, line: 3375, baseType: !637, size: 256)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !133, line: 1397, size: 256, elements: !638)
!638 = !{!639, !640}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !637, file: !133, line: 1398, baseType: !620, size: 192)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !637, file: !133, line: 1399, baseType: !641, size: 64, offset: 192)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !643, line: 52, size: 256, elements: !644)
!643 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!644 = !{!645, !646, !647, !648, !649, !650, !651}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !642, file: !643, line: 56, baseType: !5, size: 2, flags: DIFlagBitField, extraData: i64 0)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !642, file: !643, line: 57, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !642, file: !643, line: 58, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !642, file: !643, line: 59, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !642, file: !643, line: 60, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !642, file: !643, line: 61, baseType: !5, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !642, file: !643, line: 62, baseType: !652, size: 192, offset: 64)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !524, size: 192, elements: !653)
!653 = !{!654}
!654 = !DISubrange(count: 3)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !584, file: !133, line: 3376, baseType: !656, size: 256)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !133, line: 1408, size: 256, elements: !657)
!657 = !{!658, !659}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !656, file: !133, line: 1409, baseType: !620, size: 192)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !656, file: !133, line: 1410, baseType: !660, size: 64, offset: 192)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !662, line: 27, size: 192, elements: !663)
!662 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!663 = !{!664, !665}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !661, file: !662, line: 29, baseType: !630, size: 128)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !661, file: !662, line: 30, baseType: !3, size: 32, offset: 128)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !584, file: !133, line: 3377, baseType: !667, size: 256)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !133, line: 1437, size: 256, elements: !668)
!668 = !{!669, !670}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !667, file: !133, line: 1438, baseType: !620, size: 192)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !667, file: !133, line: 1439, baseType: !581, size: 64, offset: 192)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !584, file: !133, line: 3378, baseType: !672, size: 256)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !133, line: 1418, size: 256, elements: !673)
!673 = !{!674, !675, !676}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !672, file: !133, line: 1419, baseType: !620, size: 192)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !672, file: !133, line: 1420, baseType: !405, size: 32, offset: 192)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !672, file: !133, line: 1421, baseType: !505, size: 8, offset: 224)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !584, file: !133, line: 3379, baseType: !678, size: 320)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !133, line: 1428, size: 320, elements: !679)
!679 = !{!680, !681, !682}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !678, file: !133, line: 1429, baseType: !620, size: 192)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !678, file: !133, line: 1430, baseType: !581, size: 64, offset: 192)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !678, file: !133, line: 1431, baseType: !581, size: 64, offset: 256)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !584, file: !133, line: 3380, baseType: !684, size: 320)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !133, line: 1460, size: 320, elements: !685)
!685 = !{!686, !687}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !684, file: !133, line: 1461, baseType: !620, size: 192)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !684, file: !133, line: 1462, baseType: !688, size: 128, offset: 192)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !689, line: 31, size: 128, elements: !690)
!689 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!690 = !{!691, !694, !695}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !688, file: !689, line: 32, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !404)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !688, file: !689, line: 33, baseType: !5, size: 32, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !688, file: !689, line: 34, baseType: !5, size: 32, offset: 96)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !584, file: !133, line: 3381, baseType: !697, size: 384)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !133, line: 2507, size: 384, elements: !698)
!698 = !{!699, !700, !701, !702, !703}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !697, file: !133, line: 2508, baseType: !620, size: 192)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !697, file: !133, line: 2509, baseType: !575, size: 32, offset: 192)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !697, file: !133, line: 2510, baseType: !5, size: 32, offset: 224)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !697, file: !133, line: 2511, baseType: !581, size: 64, offset: 256)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !697, file: !133, line: 2512, baseType: !581, size: 64, offset: 320)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !584, file: !133, line: 3382, baseType: !705, size: 896)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !133, line: 2652, size: 896, elements: !706)
!706 = !{!707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !705, file: !133, line: 2653, baseType: !697, size: 384)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !705, file: !133, line: 2654, baseType: !581, size: 64, offset: 384)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !705, file: !133, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !705, file: !133, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !705, file: !133, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !705, file: !133, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !705, file: !133, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !705, file: !133, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !705, file: !133, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !705, file: !133, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !705, file: !133, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !705, file: !133, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !705, file: !133, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !705, file: !133, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !705, file: !133, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !705, file: !133, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !705, file: !133, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !705, file: !133, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !705, file: !133, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !705, file: !133, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !705, file: !133, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !705, file: !133, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !705, file: !133, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !705, file: !133, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !705, file: !133, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !705, file: !133, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !705, file: !133, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !705, file: !133, line: 2703, baseType: !5, size: 32, offset: 512)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !705, file: !133, line: 2705, baseType: !581, size: 64, offset: 576)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !705, file: !133, line: 2706, baseType: !581, size: 64, offset: 640)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !705, file: !133, line: 2707, baseType: !581, size: 64, offset: 704)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !705, file: !133, line: 2708, baseType: !581, size: 64, offset: 768)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !705, file: !133, line: 2711, baseType: !740, size: 64, offset: 832)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !133, line: 2711, flags: DIFlagFwdDecl)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !584, file: !133, line: 3383, baseType: !743, size: 960)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !133, line: 2756, size: 960, elements: !744)
!744 = !{!745, !746}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !743, file: !133, line: 2757, baseType: !705, size: 896)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !743, file: !133, line: 2758, baseType: !747, size: 64, offset: 896)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !582, line: 50, baseType: !748)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !750, line: 240, size: 384, elements: !751)
!750 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!751 = !{!752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !749, file: !750, line: 242, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !749, file: !750, line: 245, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !749, file: !750, line: 252, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !749, file: !750, line: 257, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !749, file: !750, line: 265, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !749, file: !750, line: 277, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !749, file: !750, line: 291, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !749, file: !750, line: 298, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !749, file: !750, line: 305, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !749, file: !750, line: 310, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !749, file: !750, line: 321, baseType: !763, size: 320, offset: 64)
!763 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !750, line: 315, size: 320, elements: !764)
!764 = !{!765, !1134, !1136, !1165, !1166}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !763, file: !750, line: 316, baseType: !766, size: 64)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !767, size: 64, elements: !506)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !750, line: 183, baseType: !768)
!768 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !750, line: 166, size: 64, elements: !769)
!769 = !{!770, !771, !772, !773, !774, !782, !783, !795, !798, !827, !828, !1111, !1124, !1131}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !768, file: !750, line: 168, baseType: !405, size: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !768, file: !750, line: 169, baseType: !5, size: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !768, file: !750, line: 170, baseType: !410, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !768, file: !750, line: 171, baseType: !747, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !768, file: !750, line: 172, baseType: !775, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !582, line: 53, baseType: !776)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !750, line: 359, size: 128, elements: !778)
!778 = !{!779, !780}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !777, file: !750, line: 360, baseType: !405, size: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !777, file: !750, line: 361, baseType: !781, size: 64, offset: 64)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !747, size: 64, elements: !506)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !768, file: !750, line: 173, baseType: !3, size: 32)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !768, file: !750, line: 174, baseType: !784, size: 32)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !750, line: 133, baseType: !785)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !750, line: 115, size: 32, elements: !786)
!786 = !{!787, !788, !789, !790, !791, !792, !793, !794}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !785, file: !750, line: 118, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !785, file: !750, line: 120, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !785, file: !750, line: 121, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !785, file: !750, line: 123, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !785, file: !750, line: 125, baseType: !5, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !785, file: !750, line: 127, baseType: !5, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !785, file: !750, line: 130, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !785, file: !750, line: 132, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !768, file: !750, line: 175, baseType: !796, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !750, line: 175, flags: DIFlagFwdDecl)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !768, file: !750, line: 176, baseType: !799, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !801, line: 75, size: 256, elements: !802)
!801 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!802 = !{!803, !817, !818, !819}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !800, file: !801, line: 76, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !801, line: 68, baseType: !806)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !801, line: 63, size: 320, elements: !807)
!807 = !{!808, !810, !811, !812}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !806, file: !801, line: 64, baseType: !809, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !806, file: !801, line: 65, baseType: !809, size: 64, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !806, file: !801, line: 66, baseType: !5, size: 32, offset: 128)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !806, file: !801, line: 67, baseType: !813, size: 128, offset: 192)
!813 = !DICompositeType(tag: DW_TAG_array_type, baseType: !814, size: 128, elements: !815)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !801, line: 29, baseType: !524)
!815 = !{!816}
!816 = !DISubrange(count: 2)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !800, file: !801, line: 77, baseType: !804, size: 64, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !800, file: !801, line: 78, baseType: !5, size: 32, offset: 128)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !800, file: !801, line: 79, baseType: !820, size: 64, offset: 192)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !801, line: 49, baseType: !822)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !801, line: 45, size: 832, elements: !823)
!823 = !{!824, !825, !826}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !822, file: !801, line: 46, baseType: !809, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !822, file: !801, line: 47, baseType: !799, size: 64, offset: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !822, file: !801, line: 48, baseType: !427, size: 704, offset: 128)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !768, file: !750, line: 177, baseType: !581, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !768, file: !750, line: 178, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !328, line: 217, size: 832, elements: !831)
!831 = !{!832, !1076, !1077, !1078, !1081, !1085, !1086, !1087, !1105, !1106, !1107, !1108, !1109, !1110}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !830, file: !328, line: 219, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !328, line: 151, baseType: !835)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !328, line: 151, size: 128, elements: !836)
!836 = !{!837}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !835, file: !328, line: 151, baseType: !838, size: 128)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !328, line: 150, baseType: !839)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !328, line: 150, size: 128, elements: !840)
!840 = !{!841, !842, !843}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !839, file: !328, line: 150, baseType: !5, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !839, file: !328, line: 150, baseType: !5, size: 32, offset: 32)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !839, file: !328, line: 150, baseType: !844, size: 64, offset: 64)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !845, size: 64, elements: !506)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !582, line: 108, baseType: !846)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !328, line: 122, size: 512, elements: !848)
!848 = !{!849, !850, !851, !1068, !1069, !1070, !1071, !1072, !1073, !1074}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !847, file: !328, line: 124, baseType: !829, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !847, file: !328, line: 125, baseType: !829, size: 64, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !847, file: !328, line: 131, baseType: !852, size: 64, offset: 128)
!852 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !328, line: 128, size: 64, elements: !853)
!853 = !{!854, !1067}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !852, file: !328, line: 129, baseType: !855, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !582, line: 66, baseType: !856)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !858, line: 143, size: 192, elements: !859)
!858 = !DIFile(filename: "./gimple.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!859 = !{!860, !1065, !1066}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !857, file: !858, line: 145, baseType: !861, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !582, line: 69, baseType: !862)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !858, line: 136, size: 192, elements: !864)
!864 = !{!865, !1063, !1064}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !863, file: !858, line: 137, baseType: !866, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !582, line: 58, baseType: !867)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !858, line: 737, size: 768, elements: !869)
!869 = !{!870, !887, !920, !926, !931, !936, !943, !949, !955, !960, !974, !979, !985, !990, !1000, !1005, !1021, !1028, !1035, !1041, !1046, !1052, !1058}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !868, file: !858, line: 738, baseType: !871, size: 256)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !858, line: 271, size: 256, elements: !872)
!872 = !{!873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !871, file: !858, line: 274, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !871, file: !858, line: 277, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !871, file: !858, line: 281, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !871, file: !858, line: 284, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !871, file: !858, line: 291, baseType: !5, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !871, file: !858, line: 295, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !871, file: !858, line: 298, baseType: !5, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !871, file: !858, line: 301, baseType: !5, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !871, file: !858, line: 307, baseType: !5, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !871, file: !858, line: 312, baseType: !5, size: 32, offset: 32)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !871, file: !858, line: 316, baseType: !575, size: 32, offset: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !871, file: !858, line: 319, baseType: !5, size: 32, offset: 96)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !871, file: !858, line: 323, baseType: !829, size: 64, offset: 128)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !871, file: !858, line: 327, baseType: !581, size: 64, offset: 192)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !868, file: !858, line: 739, baseType: !888, size: 448)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !858, line: 350, size: 448, elements: !889)
!889 = !{!890, !918}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !888, file: !858, line: 353, baseType: !891, size: 384)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !858, line: 333, size: 384, elements: !892)
!892 = !{!893, !894, !901}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !891, file: !858, line: 336, baseType: !871, size: 256)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !891, file: !858, line: 343, baseType: !895, size: 64, offset: 256)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !897, line: 37, size: 128, elements: !898)
!897 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!898 = !{!899, !900}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !896, file: !897, line: 39, baseType: !895, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !896, file: !897, line: 40, baseType: !580, size: 64, offset: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !891, file: !858, line: 344, baseType: !902, size: 64, offset: 320)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !897, line: 45, size: 320, elements: !904)
!904 = !{!905, !906}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !903, file: !897, line: 47, baseType: !902, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !903, file: !897, line: 48, baseType: !907, size: 256, offset: 64)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !133, line: 1883, size: 256, elements: !908)
!908 = !{!909, !911, !912, !917}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !907, file: !133, line: 1884, baseType: !910, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !907, file: !133, line: 1885, baseType: !910, size: 64, offset: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !907, file: !133, line: 1891, baseType: !913, size: 64, offset: 128)
!913 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !907, file: !133, line: 1891, size: 64, elements: !914)
!914 = !{!915, !916}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !913, file: !133, line: 1891, baseType: !866, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !913, file: !133, line: 1891, baseType: !581, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !907, file: !133, line: 1892, baseType: !580, size: 64, offset: 192)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !888, file: !858, line: 359, baseType: !919, size: 64, offset: 384)
!919 = !DICompositeType(tag: DW_TAG_array_type, baseType: !581, size: 64, elements: !506)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !868, file: !858, line: 740, baseType: !921, size: 512)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !858, line: 365, size: 512, elements: !922)
!922 = !{!923, !924, !925}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !921, file: !858, line: 368, baseType: !891, size: 384)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !921, file: !858, line: 373, baseType: !581, size: 64, offset: 384)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !921, file: !858, line: 374, baseType: !581, size: 64, offset: 448)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !868, file: !858, line: 741, baseType: !927, size: 576)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !858, line: 380, size: 576, elements: !928)
!928 = !{!929, !930}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !927, file: !858, line: 383, baseType: !921, size: 512)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !927, file: !858, line: 389, baseType: !919, size: 64, offset: 512)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !868, file: !858, line: 742, baseType: !932, size: 320)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !858, line: 395, size: 320, elements: !933)
!933 = !{!934, !935}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !932, file: !858, line: 397, baseType: !871, size: 256)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !932, file: !858, line: 400, baseType: !855, size: 64, offset: 256)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !868, file: !858, line: 743, baseType: !937, size: 448)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !858, line: 406, size: 448, elements: !938)
!938 = !{!939, !940, !941, !942}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !937, file: !858, line: 408, baseType: !871, size: 256)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !937, file: !858, line: 412, baseType: !581, size: 64, offset: 256)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !937, file: !858, line: 420, baseType: !581, size: 64, offset: 320)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !937, file: !858, line: 423, baseType: !855, size: 64, offset: 384)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !868, file: !858, line: 744, baseType: !944, size: 384)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !858, line: 429, size: 384, elements: !945)
!945 = !{!946, !947, !948}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !944, file: !858, line: 431, baseType: !871, size: 256)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !944, file: !858, line: 434, baseType: !581, size: 64, offset: 256)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !944, file: !858, line: 437, baseType: !855, size: 64, offset: 320)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !868, file: !858, line: 745, baseType: !950, size: 384)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !858, line: 443, size: 384, elements: !951)
!951 = !{!952, !953, !954}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !950, file: !858, line: 445, baseType: !871, size: 256)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !950, file: !858, line: 449, baseType: !581, size: 64, offset: 256)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !950, file: !858, line: 453, baseType: !855, size: 64, offset: 320)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !868, file: !858, line: 746, baseType: !956, size: 320)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !858, line: 459, size: 320, elements: !957)
!957 = !{!958, !959}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !956, file: !858, line: 461, baseType: !871, size: 256)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !956, file: !858, line: 464, baseType: !581, size: 64, offset: 256)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !868, file: !858, line: 747, baseType: !961, size: 768)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !858, line: 469, size: 768, elements: !962)
!962 = !{!963, !964, !965, !966, !967}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !961, file: !858, line: 471, baseType: !871, size: 256)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !961, file: !858, line: 474, baseType: !5, size: 32, offset: 256)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !961, file: !858, line: 475, baseType: !5, size: 32, offset: 288)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !961, file: !858, line: 478, baseType: !581, size: 64, offset: 320)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !961, file: !858, line: 481, baseType: !968, size: 384, offset: 384)
!968 = !DICompositeType(tag: DW_TAG_array_type, baseType: !969, size: 384, elements: !506)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !133, line: 1917, size: 384, elements: !970)
!970 = !{!971, !972, !973}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !969, file: !133, line: 1920, baseType: !907, size: 256)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !969, file: !133, line: 1921, baseType: !581, size: 64, offset: 256)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !969, file: !133, line: 1922, baseType: !575, size: 32, offset: 320)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !868, file: !858, line: 748, baseType: !975, size: 320)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !858, line: 487, size: 320, elements: !976)
!976 = !{!977, !978}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !975, file: !858, line: 490, baseType: !871, size: 256)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !975, file: !858, line: 494, baseType: !405, size: 32, offset: 256)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !868, file: !858, line: 749, baseType: !980, size: 384)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !858, line: 500, size: 384, elements: !981)
!981 = !{!982, !983, !984}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !980, file: !858, line: 502, baseType: !871, size: 256)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !980, file: !858, line: 506, baseType: !855, size: 64, offset: 256)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !980, file: !858, line: 510, baseType: !855, size: 64, offset: 320)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !868, file: !858, line: 750, baseType: !986, size: 320)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !858, line: 529, size: 320, elements: !987)
!987 = !{!988, !989}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !986, file: !858, line: 531, baseType: !871, size: 256)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !986, file: !858, line: 540, baseType: !855, size: 64, offset: 256)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !868, file: !858, line: 751, baseType: !991, size: 704)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !858, line: 546, size: 704, elements: !992)
!992 = !{!993, !994, !995, !996, !997, !998, !999}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !991, file: !858, line: 549, baseType: !921, size: 512)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !991, file: !858, line: 553, baseType: !410, size: 64, offset: 512)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !991, file: !858, line: 557, baseType: !404, size: 8, offset: 576)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !991, file: !858, line: 558, baseType: !404, size: 8, offset: 584)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !991, file: !858, line: 559, baseType: !404, size: 8, offset: 592)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !991, file: !858, line: 560, baseType: !404, size: 8, offset: 600)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !991, file: !858, line: 566, baseType: !919, size: 64, offset: 640)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !868, file: !858, line: 752, baseType: !1001, size: 384)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !858, line: 571, size: 384, elements: !1002)
!1002 = !{!1003, !1004}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1001, file: !858, line: 573, baseType: !932, size: 320)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1001, file: !858, line: 577, baseType: !581, size: 64, offset: 320)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !868, file: !858, line: 753, baseType: !1006, size: 576)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !858, line: 600, size: 576, elements: !1007)
!1007 = !{!1008, !1009, !1010, !1011, !1020}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1006, file: !858, line: 602, baseType: !932, size: 320)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1006, file: !858, line: 605, baseType: !581, size: 64, offset: 320)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1006, file: !858, line: 609, baseType: !522, size: 64, offset: 384)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1006, file: !858, line: 612, baseType: !1012, size: 64, offset: 448)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !858, line: 581, size: 320, elements: !1014)
!1014 = !{!1015, !1016, !1017, !1018, !1019}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1013, file: !858, line: 583, baseType: !132, size: 32)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1013, file: !858, line: 586, baseType: !581, size: 64, offset: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1013, file: !858, line: 589, baseType: !581, size: 64, offset: 128)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1013, file: !858, line: 592, baseType: !581, size: 64, offset: 192)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1013, file: !858, line: 595, baseType: !581, size: 64, offset: 256)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1006, file: !858, line: 616, baseType: !855, size: 64, offset: 512)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !868, file: !858, line: 754, baseType: !1022, size: 512)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !858, line: 622, size: 512, elements: !1023)
!1023 = !{!1024, !1025, !1026, !1027}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1022, file: !858, line: 624, baseType: !932, size: 320)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1022, file: !858, line: 628, baseType: !581, size: 64, offset: 320)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1022, file: !858, line: 632, baseType: !581, size: 64, offset: 384)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1022, file: !858, line: 636, baseType: !581, size: 64, offset: 448)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !868, file: !858, line: 755, baseType: !1029, size: 704)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !858, line: 642, size: 704, elements: !1030)
!1030 = !{!1031, !1032, !1033, !1034}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1029, file: !858, line: 644, baseType: !1022, size: 512)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1029, file: !858, line: 648, baseType: !581, size: 64, offset: 512)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1029, file: !858, line: 652, baseType: !581, size: 64, offset: 576)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1029, file: !858, line: 653, baseType: !581, size: 64, offset: 640)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !868, file: !858, line: 756, baseType: !1036, size: 448)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !858, line: 663, size: 448, elements: !1037)
!1037 = !{!1038, !1039, !1040}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1036, file: !858, line: 665, baseType: !932, size: 320)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1036, file: !858, line: 668, baseType: !581, size: 64, offset: 320)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1036, file: !858, line: 673, baseType: !581, size: 64, offset: 384)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !868, file: !858, line: 757, baseType: !1042, size: 384)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !858, line: 694, size: 384, elements: !1043)
!1043 = !{!1044, !1045}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1042, file: !858, line: 696, baseType: !932, size: 320)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1042, file: !858, line: 699, baseType: !581, size: 64, offset: 320)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !868, file: !858, line: 758, baseType: !1047, size: 384)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !858, line: 681, size: 384, elements: !1048)
!1048 = !{!1049, !1050, !1051}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1047, file: !858, line: 683, baseType: !871, size: 256)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1047, file: !858, line: 686, baseType: !581, size: 64, offset: 256)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1047, file: !858, line: 689, baseType: !581, size: 64, offset: 320)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !868, file: !858, line: 759, baseType: !1053, size: 384)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !858, line: 707, size: 384, elements: !1054)
!1054 = !{!1055, !1056, !1057}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1053, file: !858, line: 709, baseType: !871, size: 256)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1053, file: !858, line: 712, baseType: !581, size: 64, offset: 256)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1053, file: !858, line: 712, baseType: !581, size: 64, offset: 320)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !868, file: !858, line: 760, baseType: !1059, size: 320)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !858, line: 718, size: 320, elements: !1060)
!1060 = !{!1061, !1062}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1059, file: !858, line: 720, baseType: !871, size: 256)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1059, file: !858, line: 723, baseType: !581, size: 64, offset: 256)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !863, file: !858, line: 138, baseType: !862, size: 64, offset: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !863, file: !858, line: 139, baseType: !862, size: 64, offset: 128)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !857, file: !858, line: 146, baseType: !861, size: 64, offset: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !857, file: !858, line: 152, baseType: !855, size: 64, offset: 128)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !852, file: !328, line: 130, baseType: !747, size: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !847, file: !328, line: 134, baseType: !409, size: 64, offset: 192)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !847, file: !328, line: 137, baseType: !581, size: 64, offset: 256)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !847, file: !328, line: 138, baseType: !575, size: 32, offset: 320)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !847, file: !328, line: 142, baseType: !5, size: 32, offset: 352)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !847, file: !328, line: 144, baseType: !405, size: 32, offset: 384)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !847, file: !328, line: 145, baseType: !405, size: 32, offset: 416)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !847, file: !328, line: 146, baseType: !1075, size: 64, offset: 448)
!1075 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !328, line: 119, baseType: !431)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !830, file: !328, line: 220, baseType: !833, size: 64, offset: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !830, file: !328, line: 223, baseType: !409, size: 64, offset: 128)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !830, file: !328, line: 226, baseType: !1079, size: 64, offset: 192)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64)
!1080 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !328, line: 185, flags: DIFlagFwdDecl)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !830, file: !328, line: 229, baseType: !1082, size: 128, offset: 256)
!1082 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1083, size: 128, elements: !815)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64)
!1084 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !328, line: 229, flags: DIFlagFwdDecl)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !830, file: !328, line: 232, baseType: !829, size: 64, offset: 384)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !830, file: !328, line: 233, baseType: !829, size: 64, offset: 448)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !830, file: !328, line: 238, baseType: !1088, size: 64, offset: 512)
!1088 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !328, line: 235, size: 64, elements: !1089)
!1089 = !{!1090, !1096}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1088, file: !328, line: 236, baseType: !1091, size: 64)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !328, line: 273, size: 128, elements: !1093)
!1093 = !{!1094, !1095}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1092, file: !328, line: 275, baseType: !855, size: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1092, file: !328, line: 278, baseType: !855, size: 64, offset: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1088, file: !328, line: 237, baseType: !1097, size: 64)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !328, line: 259, size: 320, elements: !1099)
!1099 = !{!1100, !1101, !1102, !1103, !1104}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1098, file: !328, line: 261, baseType: !747, size: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1098, file: !328, line: 262, baseType: !747, size: 64, offset: 64)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1098, file: !328, line: 266, baseType: !747, size: 64, offset: 128)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1098, file: !328, line: 267, baseType: !747, size: 64, offset: 192)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1098, file: !328, line: 270, baseType: !405, size: 32, offset: 256)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !830, file: !328, line: 241, baseType: !1075, size: 64, offset: 576)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !830, file: !328, line: 244, baseType: !405, size: 32, offset: 640)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !830, file: !328, line: 247, baseType: !405, size: 32, offset: 672)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !830, file: !328, line: 250, baseType: !405, size: 32, offset: 704)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !830, file: !328, line: 253, baseType: !405, size: 32, offset: 736)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !830, file: !328, line: 256, baseType: !405, size: 32, offset: 768)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !768, file: !750, line: 179, baseType: !1112, size: 64)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !750, line: 150, baseType: !1114)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !750, line: 142, size: 320, elements: !1115)
!1115 = !{!1116, !1117, !1118, !1119, !1122, !1123}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1114, file: !750, line: 144, baseType: !581, size: 64)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1114, file: !750, line: 145, baseType: !747, size: 64, offset: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1114, file: !750, line: 146, baseType: !747, size: 64, offset: 128)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1114, file: !750, line: 147, baseType: !1120, size: 32, offset: 192)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1121, line: 31, baseType: !405)
!1121 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1114, file: !750, line: 148, baseType: !5, size: 32, offset: 224)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1114, file: !750, line: 149, baseType: !404, size: 8, offset: 256)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !768, file: !750, line: 180, baseType: !1125, size: 64)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !750, line: 162, baseType: !1127)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !750, line: 159, size: 128, elements: !1128)
!1128 = !{!1129, !1130}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1127, file: !750, line: 160, baseType: !581, size: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1127, file: !750, line: 161, baseType: !431, size: 64, offset: 64)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !768, file: !750, line: 181, baseType: !1132, size: 64)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64)
!1133 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !750, line: 181, flags: DIFlagFwdDecl)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !763, file: !750, line: 317, baseType: !1135, size: 64)
!1135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 64, elements: !506)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !763, file: !750, line: 318, baseType: !1137, size: 320)
!1137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !750, line: 188, size: 320, elements: !1138)
!1138 = !{!1139, !1141, !1164}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1137, file: !750, line: 190, baseType: !1140, size: 192)
!1140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !767, size: 192, elements: !653)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1137, file: !750, line: 193, baseType: !1142, size: 64, offset: 192)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64)
!1143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !750, line: 206, size: 320, elements: !1144)
!1144 = !{!1145, !1149, !1150, !1151, !1163}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1143, file: !750, line: 208, baseType: !1146, size: 64)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64)
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !582, line: 62, baseType: !1148)
!1148 = !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !582, line: 61, flags: DIFlagFwdDecl)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1143, file: !750, line: 211, baseType: !5, size: 32, offset: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1143, file: !750, line: 214, baseType: !431, size: 64, offset: 128)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1143, file: !750, line: 224, baseType: !1152, size: 64, offset: 192)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !750, line: 202, baseType: !1154)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !750, line: 202, size: 128, elements: !1155)
!1155 = !{!1156}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1154, file: !750, line: 202, baseType: !1157, size: 128)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !750, line: 200, baseType: !1158)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !750, line: 200, size: 128, elements: !1159)
!1159 = !{!1160, !1161, !1162}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1158, file: !750, line: 200, baseType: !5, size: 32)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1158, file: !750, line: 200, baseType: !5, size: 32, offset: 32)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1158, file: !750, line: 200, baseType: !781, size: 64, offset: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1143, file: !750, line: 234, baseType: !1152, size: 64, offset: 256)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1137, file: !750, line: 197, baseType: !431, size: 64, offset: 256)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !763, file: !750, line: 319, baseType: !642, size: 256)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !763, file: !750, line: 320, baseType: !661, size: 192)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !584, file: !133, line: 3384, baseType: !1168, size: 1472)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !133, line: 3114, size: 1472, elements: !1169)
!1169 = !{!1170, !1191, !1192, !1193, !1194}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1168, file: !133, line: 3115, baseType: !1171, size: 1216)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !133, line: 2984, size: 1216, elements: !1172)
!1172 = !{!1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1171, file: !133, line: 2985, baseType: !743, size: 960)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1171, file: !133, line: 2986, baseType: !581, size: 64, offset: 960)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1171, file: !133, line: 2987, baseType: !581, size: 64, offset: 1024)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1171, file: !133, line: 2988, baseType: !581, size: 64, offset: 1088)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1171, file: !133, line: 2991, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1171, file: !133, line: 2992, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1171, file: !133, line: 2993, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1171, file: !133, line: 2994, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1171, file: !133, line: 2995, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1171, file: !133, line: 2996, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1171, file: !133, line: 2998, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1171, file: !133, line: 3000, baseType: !5, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1171, file: !133, line: 3002, baseType: !5, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1171, file: !133, line: 3003, baseType: !5, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1171, file: !133, line: 3004, baseType: !5, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1171, file: !133, line: 3005, baseType: !5, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1171, file: !133, line: 3007, baseType: !5, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1171, file: !133, line: 3010, baseType: !5, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1168, file: !133, line: 3117, baseType: !581, size: 64, offset: 1216)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1168, file: !133, line: 3119, baseType: !581, size: 64, offset: 1280)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1168, file: !133, line: 3121, baseType: !581, size: 64, offset: 1344)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1168, file: !133, line: 3123, baseType: !581, size: 64, offset: 1408)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !584, file: !133, line: 3385, baseType: !1196, size: 1088)
!1196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !133, line: 2874, size: 1088, elements: !1197)
!1197 = !{!1198, !1199, !1200}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1196, file: !133, line: 2875, baseType: !743, size: 960)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1196, file: !133, line: 2876, baseType: !747, size: 64, offset: 960)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1196, file: !133, line: 2877, baseType: !1201, size: 64, offset: 1024)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64)
!1202 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !133, line: 2856, flags: DIFlagFwdDecl)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !584, file: !133, line: 3386, baseType: !1171, size: 1216)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !584, file: !133, line: 3387, baseType: !1205, size: 1280)
!1205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !133, line: 3093, size: 1280, elements: !1206)
!1206 = !{!1207, !1208}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1205, file: !133, line: 3094, baseType: !1171, size: 1216)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1205, file: !133, line: 3095, baseType: !1201, size: 64, offset: 1216)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !584, file: !133, line: 3388, baseType: !1210, size: 1216)
