; ModuleID = 'c-omp.bc'
source_filename = "c-omp.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }
%struct.tree_decl_minimal = type { %struct.tree_common, i32, i32, %union.tree_node*, %union.tree_node* }
%struct.tree_common = type { %struct.tree_base, %union.tree_node*, %union.tree_node* }
%struct.tree_base = type { i64 }

!199 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "profile_status_d", file: !200, line: 363, baseType: !5, size: 32, elements: !201)
!200 = !DIFile(filename: "./basic-block.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!201 = !{!202, !203, !204}
!202 = !DIEnumerator(name: "PROFILE_ABSENT", value: 0, isUnsigned: true)
!203 = !DIEnumerator(name: "PROFILE_GUESSED", value: 1, isUnsigned: true)
!204 = !DIEnumerator(name: "PROFILE_READ", value: 2, isUnsigned: true)
!205 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dom_state", file: !200, line: 355, baseType: !5, size: 32, elements: !206)
!206 = !{!207, !208, !209}
!207 = !DIEnumerator(name: "DOM_NONE", value: 0, isUnsigned: true)
!208 = !DIEnumerator(name: "DOM_NO_FAST_QUERY", value: 1, isUnsigned: true)
!209 = !DIEnumerator(name: "DOM_OK", value: 2, isUnsigned: true)
!210 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "calling_abi", file: !211, line: 474, baseType: !5, size: 32, elements: !212)
!211 = !DIFile(filename: "./config/i386/i386.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!212 = !{!213, !214}
!213 = !DIEnumerator(name: "SYSV_ABI", value: 0, isUnsigned: true)
!214 = !DIEnumerator(name: "MS_ABI", value: 1, isUnsigned: true)
!215 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "omp_clause_code", file: !4, line: 280, baseType: !5, size: 32, elements: !216)
!216 = !{!217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232}
!217 = !DIEnumerator(name: "OMP_CLAUSE_ERROR", value: 0, isUnsigned: true)
!218 = !DIEnumerator(name: "OMP_CLAUSE_PRIVATE", value: 1, isUnsigned: true)
!219 = !DIEnumerator(name: "OMP_CLAUSE_SHARED", value: 2, isUnsigned: true)
!220 = !DIEnumerator(name: "OMP_CLAUSE_FIRSTPRIVATE", value: 3, isUnsigned: true)
!221 = !DIEnumerator(name: "OMP_CLAUSE_LASTPRIVATE", value: 4, isUnsigned: true)
!222 = !DIEnumerator(name: "OMP_CLAUSE_REDUCTION", value: 5, isUnsigned: true)
!223 = !DIEnumerator(name: "OMP_CLAUSE_COPYIN", value: 6, isUnsigned: true)
!224 = !DIEnumerator(name: "OMP_CLAUSE_COPYPRIVATE", value: 7, isUnsigned: true)
!225 = !DIEnumerator(name: "OMP_CLAUSE_IF", value: 8, isUnsigned: true)
!226 = !DIEnumerator(name: "OMP_CLAUSE_NUM_THREADS", value: 9, isUnsigned: true)
!227 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE", value: 10, isUnsigned: true)
!228 = !DIEnumerator(name: "OMP_CLAUSE_NOWAIT", value: 11, isUnsigned: true)
!229 = !DIEnumerator(name: "OMP_CLAUSE_ORDERED", value: 12, isUnsigned: true)
!230 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT", value: 13, isUnsigned: true)
!231 = !DIEnumerator(name: "OMP_CLAUSE_COLLAPSE", value: 14, isUnsigned: true)
!232 = !DIEnumerator(name: "OMP_CLAUSE_UNTIED", value: 15, isUnsigned: true)
!233 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "omp_clause_default_kind", file: !4, line: 1817, baseType: !5, size: 32, elements: !234)
!234 = !{!235, !236, !237, !238, !239}
!235 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_UNSPECIFIED", value: 0, isUnsigned: true)
!236 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_SHARED", value: 1, isUnsigned: true)
!237 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_NONE", value: 2, isUnsigned: true)
!238 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_PRIVATE", value: 3, isUnsigned: true)
!239 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_FIRSTPRIVATE", value: 4, isUnsigned: true)
!240 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "omp_clause_schedule_kind", file: !4, line: 1805, baseType: !5, size: 32, elements: !241)
!241 = !{!242, !243, !244, !245, !246}
!242 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_STATIC", value: 0, isUnsigned: true)
!243 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_DYNAMIC", value: 1, isUnsigned: true)
!244 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_GUIDED", value: 2, isUnsigned: true)
!245 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_AUTO", value: 3, isUnsigned: true)
!246 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_RUNTIME", value: 4, isUnsigned: true)
!247 = !{!248, !249, !250, !251, !254, !255, !3, !257, !368}
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!250 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !253)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !258, line: 56, baseType: !259)
!258 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !4, line: 3371, size: 1792, elements: !261)
!261 = !{!262, !295, !301, !314, !321, !328, !333, !342, !348, !361, !373, !411, !419, !447, !455, !456, !461, !470, !476, !481, !485, !489, !954, !1003, !1009, !1015, !1022, !1033, !1058, !1075, !1087, !1109, !1124, !1296}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !260, file: !4, line: 3372, baseType: !263, size: 64)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !4, line: 360, size: 64, elements: !264)
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !263, file: !4, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !263, file: !4, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !263, file: !4, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !263, file: !4, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !263, file: !4, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !263, file: !4, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !263, file: !4, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !263, file: !4, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !263, file: !4, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !263, file: !4, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !263, file: !4, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !263, file: !4, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !263, file: !4, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !263, file: !4, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !263, file: !4, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !263, file: !4, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !263, file: !4, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !263, file: !4, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !263, file: !4, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !263, file: !4, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !263, file: !4, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !263, file: !4, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !263, file: !4, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !263, file: !4, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !263, file: !4, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !263, file: !4, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !263, file: !4, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !263, file: !4, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !263, file: !4, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !263, file: !4, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !260, file: !4, line: 3373, baseType: !296, size: 192)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !4, line: 402, size: 192, elements: !297)
!297 = !{!298, !299, !300}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !296, file: !4, line: 403, baseType: !263, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !296, file: !4, line: 404, baseType: !257, size: 64, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !296, file: !4, line: 405, baseType: !257, size: 64, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !260, file: !4, line: 3374, baseType: !302, size: 320)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !4, line: 1384, size: 320, elements: !303)
!303 = !{!304, !305}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !302, file: !4, line: 1385, baseType: !296, size: 192)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !302, file: !4, line: 1386, baseType: !306, size: 128, offset: 192)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !307, line: 58, baseType: !308)
!307 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !307, line: 54, size: 128, elements: !309)
!309 = !{!310, !312}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !308, file: !307, line: 56, baseType: !311, size: 64)
!311 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !308, file: !307, line: 57, baseType: !313, size: 64, offset: 64)
!313 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !260, file: !4, line: 3375, baseType: !315, size: 256)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !4, line: 1397, size: 256, elements: !316)
!316 = !{!317, !318}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !315, file: !4, line: 1398, baseType: !296, size: 192)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !315, file: !4, line: 1399, baseType: !319, size: 64, offset: 192)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !4, line: 1392, flags: DIFlagFwdDecl)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !260, file: !4, line: 3376, baseType: !322, size: 256)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !4, line: 1408, size: 256, elements: !323)
!323 = !{!324, !325}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !322, file: !4, line: 1409, baseType: !296, size: 192)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !322, file: !4, line: 1410, baseType: !326, size: 64, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !4, line: 1403, flags: DIFlagFwdDecl)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !260, file: !4, line: 3377, baseType: !329, size: 256)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !4, line: 1437, size: 256, elements: !330)
!330 = !{!331, !332}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !329, file: !4, line: 1438, baseType: !296, size: 192)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !329, file: !4, line: 1439, baseType: !257, size: 64, offset: 192)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !260, file: !4, line: 3378, baseType: !334, size: 256)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !4, line: 1418, size: 256, elements: !335)
!335 = !{!336, !337, !338}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !334, file: !4, line: 1419, baseType: !296, size: 192)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !334, file: !4, line: 1420, baseType: !250, size: 32, offset: 192)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !334, file: !4, line: 1421, baseType: !339, size: 8, offset: 224)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 8, elements: !340)
!340 = !{!341}
!341 = !DISubrange(count: 1)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !260, file: !4, line: 3379, baseType: !343, size: 320)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !4, line: 1428, size: 320, elements: !344)
!344 = !{!345, !346, !347}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !343, file: !4, line: 1429, baseType: !296, size: 192)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !343, file: !4, line: 1430, baseType: !257, size: 64, offset: 192)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !343, file: !4, line: 1431, baseType: !257, size: 64, offset: 256)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !260, file: !4, line: 3380, baseType: !349, size: 320)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !4, line: 1460, size: 320, elements: !350)
!350 = !{!351, !352}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !349, file: !4, line: 1461, baseType: !296, size: 192)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !349, file: !4, line: 1462, baseType: !353, size: 128, offset: 192)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !354, line: 31, size: 128, elements: !355)
!354 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!355 = !{!356, !359, !360}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !353, file: !354, line: 32, baseType: !357, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !249)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !353, file: !354, line: 33, baseType: !5, size: 32, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !353, file: !354, line: 34, baseType: !5, size: 32, offset: 96)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !260, file: !4, line: 3381, baseType: !362, size: 384)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !4, line: 2507, size: 384, elements: !363)
!363 = !{!364, !365, !370, !371, !372}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !362, file: !4, line: 2508, baseType: !296, size: 192)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !362, file: !4, line: 2509, baseType: !366, size: 32, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !367, line: 58, baseType: !368)
!367 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !369, line: 44, baseType: !5)
!369 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!370 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !362, file: !4, line: 2510, baseType: !5, size: 32, offset: 224)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !362, file: !4, line: 2511, baseType: !257, size: 64, offset: 256)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !362, file: !4, line: 2512, baseType: !257, size: 64, offset: 320)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !260, file: !4, line: 3382, baseType: !374, size: 896)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !4, line: 2652, size: 896, elements: !375)
!375 = !{!376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !374, file: !4, line: 2653, baseType: !362, size: 384)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !374, file: !4, line: 2654, baseType: !257, size: 64, offset: 384)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !374, file: !4, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !374, file: !4, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !374, file: !4, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !374, file: !4, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !374, file: !4, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !374, file: !4, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !374, file: !4, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !374, file: !4, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !374, file: !4, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !374, file: !4, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !374, file: !4, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !374, file: !4, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !374, file: !4, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !374, file: !4, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !374, file: !4, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !374, file: !4, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !374, file: !4, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !374, file: !4, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !374, file: !4, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !374, file: !4, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !374, file: !4, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !374, file: !4, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !374, file: !4, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !374, file: !4, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !374, file: !4, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !374, file: !4, line: 2703, baseType: !5, size: 32, offset: 512)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !374, file: !4, line: 2705, baseType: !257, size: 64, offset: 576)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !374, file: !4, line: 2706, baseType: !257, size: 64, offset: 640)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !374, file: !4, line: 2707, baseType: !257, size: 64, offset: 704)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !374, file: !4, line: 2708, baseType: !257, size: 64, offset: 768)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !374, file: !4, line: 2711, baseType: !409, size: 64, offset: 832)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !4, line: 2711, flags: DIFlagFwdDecl)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !260, file: !4, line: 3383, baseType: !412, size: 960)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !4, line: 2756, size: 960, elements: !413)
!413 = !{!414, !415}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !412, file: !4, line: 2757, baseType: !374, size: 896)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !412, file: !4, line: 2758, baseType: !416, size: 64, offset: 896)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !258, line: 50, baseType: !417)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !258, line: 49, flags: DIFlagFwdDecl)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !260, file: !4, line: 3384, baseType: !420, size: 1472)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !4, line: 3114, size: 1472, elements: !421)
!421 = !{!422, !443, !444, !445, !446}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !420, file: !4, line: 3115, baseType: !423, size: 1216)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !4, line: 2984, size: 1216, elements: !424)
!424 = !{!425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !423, file: !4, line: 2985, baseType: !412, size: 960)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !423, file: !4, line: 2986, baseType: !257, size: 64, offset: 960)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !423, file: !4, line: 2987, baseType: !257, size: 64, offset: 1024)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !423, file: !4, line: 2988, baseType: !257, size: 64, offset: 1088)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !423, file: !4, line: 2991, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !423, file: !4, line: 2992, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !423, file: !4, line: 2993, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !423, file: !4, line: 2994, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !423, file: !4, line: 2995, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !423, file: !4, line: 2996, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !423, file: !4, line: 2998, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !423, file: !4, line: 3000, baseType: !5, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !423, file: !4, line: 3002, baseType: !5, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !423, file: !4, line: 3003, baseType: !5, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !423, file: !4, line: 3004, baseType: !5, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !423, file: !4, line: 3005, baseType: !5, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !423, file: !4, line: 3007, baseType: !5, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !423, file: !4, line: 3010, baseType: !5, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !420, file: !4, line: 3117, baseType: !257, size: 64, offset: 1216)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !420, file: !4, line: 3119, baseType: !257, size: 64, offset: 1280)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !420, file: !4, line: 3121, baseType: !257, size: 64, offset: 1344)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !420, file: !4, line: 3123, baseType: !257, size: 64, offset: 1408)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !260, file: !4, line: 3385, baseType: !448, size: 1088)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !4, line: 2874, size: 1088, elements: !449)
!449 = !{!450, !451, !452}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !448, file: !4, line: 2875, baseType: !412, size: 960)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !448, file: !4, line: 2876, baseType: !416, size: 64, offset: 960)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !448, file: !4, line: 2877, baseType: !453, size: 64, offset: 1024)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !4, line: 2856, flags: DIFlagFwdDecl)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !260, file: !4, line: 3386, baseType: !423, size: 1216)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !260, file: !4, line: 3387, baseType: !457, size: 1280)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !4, line: 3093, size: 1280, elements: !458)
!458 = !{!459, !460}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !457, file: !4, line: 3094, baseType: !423, size: 1216)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !457, file: !4, line: 3095, baseType: !453, size: 64, offset: 1216)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !260, file: !4, line: 3388, baseType: !462, size: 1216)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !4, line: 2824, size: 1216, elements: !463)
!463 = !{!464, !465, !466, !467, !468, !469}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !462, file: !4, line: 2825, baseType: !374, size: 896)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !462, file: !4, line: 2827, baseType: !257, size: 64, offset: 896)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !462, file: !4, line: 2828, baseType: !257, size: 64, offset: 960)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !462, file: !4, line: 2829, baseType: !257, size: 64, offset: 1024)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !462, file: !4, line: 2830, baseType: !257, size: 64, offset: 1088)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !462, file: !4, line: 2831, baseType: !257, size: 64, offset: 1152)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !260, file: !4, line: 3389, baseType: !471, size: 1024)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !4, line: 2850, size: 1024, elements: !472)
!472 = !{!473, !474, !475}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !471, file: !4, line: 2851, baseType: !412, size: 960)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !471, file: !4, line: 2852, baseType: !250, size: 32, offset: 960)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !471, file: !4, line: 2853, baseType: !250, size: 32, offset: 992)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !260, file: !4, line: 3390, baseType: !477, size: 1024)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !4, line: 2857, size: 1024, elements: !478)
!478 = !{!479, !480}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !477, file: !4, line: 2858, baseType: !412, size: 960)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !477, file: !4, line: 2859, baseType: !453, size: 64, offset: 960)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !260, file: !4, line: 3391, baseType: !482, size: 960)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !4, line: 2862, size: 960, elements: !483)
!483 = !{!484}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !482, file: !4, line: 2863, baseType: !412, size: 960)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !260, file: !4, line: 3392, baseType: !486, size: 1472)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !4, line: 3304, size: 1472, elements: !487)
!487 = !{!488}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !486, file: !4, line: 3305, baseType: !420, size: 1472)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !260, file: !4, line: 3393, baseType: !490, size: 1792)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !4, line: 3248, size: 1792, elements: !491)
!491 = !{!492, !493, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !490, file: !4, line: 3249, baseType: !420, size: 1472)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !490, file: !4, line: 3251, baseType: !494, size: 64, offset: 1472)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !496, line: 463, size: 1152, elements: !497)
!496 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!497 = !{!498, !501, !819, !820, !823, !826, !876, !877, !878, !879, !880, !906, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !495, file: !496, line: 464, baseType: !499, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !496, line: 464, flags: DIFlagFwdDecl)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !495, file: !496, line: 467, baseType: !502, size: 64, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !200, line: 374, size: 640, elements: !504)
!504 = !{!505, !794, !795, !808, !809, !810, !811, !812, !813, !815, !817, !818}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !503, file: !200, line: 377, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !258, line: 111, baseType: !507)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !200, line: 217, size: 832, elements: !509)
!509 = !{!510, !757, !758, !759, !762, !768, !769, !770, !788, !789, !790, !791, !792, !793}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !508, file: !200, line: 219, baseType: !511, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !200, line: 151, baseType: !513)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !200, line: 151, size: 128, elements: !514)
!514 = !{!515}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !513, file: !200, line: 151, baseType: !516, size: 128)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !200, line: 150, baseType: !517)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !200, line: 150, size: 128, elements: !518)
!518 = !{!519, !520, !521}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !517, file: !200, line: 150, baseType: !5, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !517, file: !200, line: 150, baseType: !5, size: 32, offset: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !517, file: !200, line: 150, baseType: !522, size: 64, offset: 64)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !523, size: 64, elements: !340)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !258, line: 108, baseType: !524)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !200, line: 122, size: 512, elements: !526)
!526 = !{!527, !528, !529, !749, !750, !751, !752, !753, !754, !755}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !525, file: !200, line: 124, baseType: !507, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !525, file: !200, line: 125, baseType: !507, size: 64, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !525, file: !200, line: 131, baseType: !530, size: 64, offset: 128)
!530 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !200, line: 128, size: 64, elements: !531)
!531 = !{!532, !748}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !530, file: !200, line: 129, baseType: !533, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !258, line: 66, baseType: !534)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !536, line: 143, size: 192, elements: !537)
!536 = !DIFile(filename: "./gimple.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!537 = !{!538, !746, !747}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !535, file: !536, line: 145, baseType: !539, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !258, line: 69, baseType: !540)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !536, line: 136, size: 192, elements: !542)
!542 = !{!543, !744, !745}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !541, file: !536, line: 137, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !258, line: 58, baseType: !545)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !536, line: 737, size: 768, elements: !547)
!547 = !{!548, !565, !599, !605, !610, !615, !622, !628, !634, !639, !653, !658, !664, !669, !679, !684, !702, !709, !716, !722, !727, !733, !739}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !546, file: !536, line: 738, baseType: !549, size: 256)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !536, line: 271, size: 256, elements: !550)
!550 = !{!551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !549, file: !536, line: 274, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !549, file: !536, line: 277, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !549, file: !536, line: 281, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !549, file: !536, line: 284, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !549, file: !536, line: 291, baseType: !5, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !549, file: !536, line: 295, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !549, file: !536, line: 298, baseType: !5, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !549, file: !536, line: 301, baseType: !5, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !549, file: !536, line: 307, baseType: !5, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !549, file: !536, line: 312, baseType: !5, size: 32, offset: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !549, file: !536, line: 316, baseType: !366, size: 32, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !549, file: !536, line: 319, baseType: !5, size: 32, offset: 96)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !549, file: !536, line: 323, baseType: !507, size: 64, offset: 128)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !549, file: !536, line: 327, baseType: !257, size: 64, offset: 192)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !546, file: !536, line: 739, baseType: !566, size: 448)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !536, line: 350, size: 448, elements: !567)
!567 = !{!568, !597}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !566, file: !536, line: 353, baseType: !569, size: 384)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !536, line: 333, size: 384, elements: !570)
!570 = !{!571, !572, !580}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !569, file: !536, line: 336, baseType: !549, size: 256)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !569, file: !536, line: 343, baseType: !573, size: 64, offset: 256)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !575, line: 37, size: 128, elements: !576)
!575 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!576 = !{!577, !578}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !574, file: !575, line: 39, baseType: !573, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !574, file: !575, line: 40, baseType: !579, size: 64, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !569, file: !536, line: 344, baseType: !581, size: 64, offset: 320)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !575, line: 45, size: 320, elements: !583)
!583 = !{!584, !585}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !582, file: !575, line: 47, baseType: !581, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !582, file: !575, line: 48, baseType: !586, size: 256, offset: 64)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !4, line: 1883, size: 256, elements: !587)
!587 = !{!588, !590, !591, !596}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !586, file: !4, line: 1884, baseType: !589, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !586, file: !4, line: 1885, baseType: !589, size: 64, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !586, file: !4, line: 1891, baseType: !592, size: 64, offset: 128)
!592 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !586, file: !4, line: 1891, size: 64, elements: !593)
!593 = !{!594, !595}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !592, file: !4, line: 1891, baseType: !544, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !592, file: !4, line: 1891, baseType: !257, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !586, file: !4, line: 1892, baseType: !579, size: 64, offset: 192)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !566, file: !536, line: 359, baseType: !598, size: 64, offset: 384)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 64, elements: !340)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !546, file: !536, line: 740, baseType: !600, size: 512)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !536, line: 365, size: 512, elements: !601)
!601 = !{!602, !603, !604}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !600, file: !536, line: 368, baseType: !569, size: 384)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !600, file: !536, line: 373, baseType: !257, size: 64, offset: 384)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !600, file: !536, line: 374, baseType: !257, size: 64, offset: 448)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !546, file: !536, line: 741, baseType: !606, size: 576)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !536, line: 380, size: 576, elements: !607)
!607 = !{!608, !609}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !606, file: !536, line: 383, baseType: !600, size: 512)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !606, file: !536, line: 389, baseType: !598, size: 64, offset: 512)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !546, file: !536, line: 742, baseType: !611, size: 320)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !536, line: 395, size: 320, elements: !612)
!612 = !{!613, !614}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !611, file: !536, line: 397, baseType: !549, size: 256)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !611, file: !536, line: 400, baseType: !533, size: 64, offset: 256)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !546, file: !536, line: 743, baseType: !616, size: 448)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !536, line: 406, size: 448, elements: !617)
!617 = !{!618, !619, !620, !621}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !616, file: !536, line: 408, baseType: !549, size: 256)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !616, file: !536, line: 412, baseType: !257, size: 64, offset: 256)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !616, file: !536, line: 420, baseType: !257, size: 64, offset: 320)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !616, file: !536, line: 423, baseType: !533, size: 64, offset: 384)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !546, file: !536, line: 744, baseType: !623, size: 384)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !536, line: 429, size: 384, elements: !624)
!624 = !{!625, !626, !627}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !623, file: !536, line: 431, baseType: !549, size: 256)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !623, file: !536, line: 434, baseType: !257, size: 64, offset: 256)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !623, file: !536, line: 437, baseType: !533, size: 64, offset: 320)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !546, file: !536, line: 745, baseType: !629, size: 384)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !536, line: 443, size: 384, elements: !630)
!630 = !{!631, !632, !633}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !629, file: !536, line: 445, baseType: !549, size: 256)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !629, file: !536, line: 449, baseType: !257, size: 64, offset: 256)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !629, file: !536, line: 453, baseType: !533, size: 64, offset: 320)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !546, file: !536, line: 746, baseType: !635, size: 320)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !536, line: 459, size: 320, elements: !636)
!636 = !{!637, !638}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !635, file: !536, line: 461, baseType: !549, size: 256)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !635, file: !536, line: 464, baseType: !257, size: 64, offset: 256)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !546, file: !536, line: 747, baseType: !640, size: 768)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !536, line: 469, size: 768, elements: !641)
!641 = !{!642, !643, !644, !645, !646}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !640, file: !536, line: 471, baseType: !549, size: 256)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !640, file: !536, line: 474, baseType: !5, size: 32, offset: 256)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !640, file: !536, line: 475, baseType: !5, size: 32, offset: 288)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !640, file: !536, line: 478, baseType: !257, size: 64, offset: 320)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !640, file: !536, line: 481, baseType: !647, size: 384, offset: 384)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !648, size: 384, elements: !340)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !4, line: 1917, size: 384, elements: !649)
!649 = !{!650, !651, !652}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !648, file: !4, line: 1920, baseType: !586, size: 256)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !648, file: !4, line: 1921, baseType: !257, size: 64, offset: 256)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !648, file: !4, line: 1922, baseType: !366, size: 32, offset: 320)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !546, file: !536, line: 748, baseType: !654, size: 320)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !536, line: 487, size: 320, elements: !655)
!655 = !{!656, !657}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !654, file: !536, line: 490, baseType: !549, size: 256)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !654, file: !536, line: 494, baseType: !250, size: 32, offset: 256)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !546, file: !536, line: 749, baseType: !659, size: 384)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !536, line: 500, size: 384, elements: !660)
!660 = !{!661, !662, !663}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !659, file: !536, line: 502, baseType: !549, size: 256)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !659, file: !536, line: 506, baseType: !533, size: 64, offset: 256)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !659, file: !536, line: 510, baseType: !533, size: 64, offset: 320)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !546, file: !536, line: 750, baseType: !665, size: 320)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !536, line: 529, size: 320, elements: !666)
!666 = !{!667, !668}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !665, file: !536, line: 531, baseType: !549, size: 256)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !665, file: !536, line: 540, baseType: !533, size: 64, offset: 256)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !546, file: !536, line: 751, baseType: !670, size: 704)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !536, line: 546, size: 704, elements: !671)
!671 = !{!672, !673, !674, !675, !676, !677, !678}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !670, file: !536, line: 549, baseType: !600, size: 512)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !670, file: !536, line: 553, baseType: !255, size: 64, offset: 512)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !670, file: !536, line: 557, baseType: !249, size: 8, offset: 576)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !670, file: !536, line: 558, baseType: !249, size: 8, offset: 584)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !670, file: !536, line: 559, baseType: !249, size: 8, offset: 592)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !670, file: !536, line: 560, baseType: !249, size: 8, offset: 600)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !670, file: !536, line: 566, baseType: !598, size: 64, offset: 640)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !546, file: !536, line: 752, baseType: !680, size: 384)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !536, line: 571, size: 384, elements: !681)
!681 = !{!682, !683}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !680, file: !536, line: 573, baseType: !611, size: 320)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !680, file: !536, line: 577, baseType: !257, size: 64, offset: 320)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !546, file: !536, line: 753, baseType: !685, size: 576)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !536, line: 600, size: 576, elements: !686)
!686 = !{!687, !688, !689, !692, !701}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !685, file: !536, line: 602, baseType: !611, size: 320)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !685, file: !536, line: 605, baseType: !257, size: 64, offset: 320)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !685, file: !536, line: 609, baseType: !690, size: 64, offset: 384)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !691, line: 46, baseType: !311)
!691 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!692 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !685, file: !536, line: 612, baseType: !693, size: 64, offset: 448)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !536, line: 581, size: 320, elements: !695)
!695 = !{!696, !697, !698, !699, !700}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !694, file: !536, line: 583, baseType: !3, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !694, file: !536, line: 586, baseType: !257, size: 64, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !694, file: !536, line: 589, baseType: !257, size: 64, offset: 128)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !694, file: !536, line: 592, baseType: !257, size: 64, offset: 192)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !694, file: !536, line: 595, baseType: !257, size: 64, offset: 256)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !685, file: !536, line: 616, baseType: !533, size: 64, offset: 512)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !546, file: !536, line: 754, baseType: !703, size: 512)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !536, line: 622, size: 512, elements: !704)
!704 = !{!705, !706, !707, !708}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !703, file: !536, line: 624, baseType: !611, size: 320)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !703, file: !536, line: 628, baseType: !257, size: 64, offset: 320)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !703, file: !536, line: 632, baseType: !257, size: 64, offset: 384)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !703, file: !536, line: 636, baseType: !257, size: 64, offset: 448)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !546, file: !536, line: 755, baseType: !710, size: 704)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !536, line: 642, size: 704, elements: !711)
!711 = !{!712, !713, !714, !715}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !710, file: !536, line: 644, baseType: !703, size: 512)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !710, file: !536, line: 648, baseType: !257, size: 64, offset: 512)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !710, file: !536, line: 652, baseType: !257, size: 64, offset: 576)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !710, file: !536, line: 653, baseType: !257, size: 64, offset: 640)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !546, file: !536, line: 756, baseType: !717, size: 448)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !536, line: 663, size: 448, elements: !718)
!718 = !{!719, !720, !721}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !717, file: !536, line: 665, baseType: !611, size: 320)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !717, file: !536, line: 668, baseType: !257, size: 64, offset: 320)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !717, file: !536, line: 673, baseType: !257, size: 64, offset: 384)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !546, file: !536, line: 757, baseType: !723, size: 384)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !536, line: 694, size: 384, elements: !724)
!724 = !{!725, !726}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !723, file: !536, line: 696, baseType: !611, size: 320)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !723, file: !536, line: 699, baseType: !257, size: 64, offset: 320)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !546, file: !536, line: 758, baseType: !728, size: 384)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !536, line: 681, size: 384, elements: !729)
!729 = !{!730, !731, !732}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !728, file: !536, line: 683, baseType: !549, size: 256)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !728, file: !536, line: 686, baseType: !257, size: 64, offset: 256)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !728, file: !536, line: 689, baseType: !257, size: 64, offset: 320)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !546, file: !536, line: 759, baseType: !734, size: 384)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !536, line: 707, size: 384, elements: !735)
!735 = !{!736, !737, !738}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !734, file: !536, line: 709, baseType: !549, size: 256)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !734, file: !536, line: 712, baseType: !257, size: 64, offset: 256)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !734, file: !536, line: 712, baseType: !257, size: 64, offset: 320)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !546, file: !536, line: 760, baseType: !740, size: 320)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !536, line: 718, size: 320, elements: !741)
!741 = !{!742, !743}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !740, file: !536, line: 720, baseType: !549, size: 256)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !740, file: !536, line: 723, baseType: !257, size: 64, offset: 256)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !541, file: !536, line: 138, baseType: !540, size: 64, offset: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !541, file: !536, line: 139, baseType: !540, size: 64, offset: 128)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !535, file: !536, line: 146, baseType: !539, size: 64, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !535, file: !536, line: 152, baseType: !533, size: 64, offset: 128)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !530, file: !200, line: 130, baseType: !416, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !525, file: !200, line: 134, baseType: !254, size: 64, offset: 192)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !525, file: !200, line: 137, baseType: !257, size: 64, offset: 256)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !525, file: !200, line: 138, baseType: !366, size: 32, offset: 320)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !525, file: !200, line: 142, baseType: !5, size: 32, offset: 352)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !525, file: !200, line: 144, baseType: !250, size: 32, offset: 384)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !525, file: !200, line: 145, baseType: !250, size: 32, offset: 416)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !525, file: !200, line: 146, baseType: !756, size: 64, offset: 448)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !200, line: 119, baseType: !313)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !508, file: !200, line: 220, baseType: !511, size: 64, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !508, file: !200, line: 223, baseType: !254, size: 64, offset: 128)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !508, file: !200, line: 226, baseType: !760, size: 64, offset: 192)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !200, line: 185, flags: DIFlagFwdDecl)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !508, file: !200, line: 229, baseType: !763, size: 128, offset: 256)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !764, size: 128, elements: !766)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !200, line: 229, flags: DIFlagFwdDecl)
!766 = !{!767}
!767 = !DISubrange(count: 2)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !508, file: !200, line: 232, baseType: !507, size: 64, offset: 384)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !508, file: !200, line: 233, baseType: !507, size: 64, offset: 448)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !508, file: !200, line: 238, baseType: !771, size: 64, offset: 512)
!771 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !200, line: 235, size: 64, elements: !772)
!772 = !{!773, !779}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !771, file: !200, line: 236, baseType: !774, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !200, line: 273, size: 128, elements: !776)
!776 = !{!777, !778}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !775, file: !200, line: 275, baseType: !533, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !775, file: !200, line: 278, baseType: !533, size: 64, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !771, file: !200, line: 237, baseType: !780, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !200, line: 259, size: 320, elements: !782)
!782 = !{!783, !784, !785, !786, !787}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !781, file: !200, line: 261, baseType: !416, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !781, file: !200, line: 262, baseType: !416, size: 64, offset: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !781, file: !200, line: 266, baseType: !416, size: 64, offset: 128)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !781, file: !200, line: 267, baseType: !416, size: 64, offset: 192)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !781, file: !200, line: 270, baseType: !250, size: 32, offset: 256)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !508, file: !200, line: 241, baseType: !756, size: 64, offset: 576)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !508, file: !200, line: 244, baseType: !250, size: 32, offset: 640)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !508, file: !200, line: 247, baseType: !250, size: 32, offset: 672)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !508, file: !200, line: 250, baseType: !250, size: 32, offset: 704)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !508, file: !200, line: 253, baseType: !250, size: 32, offset: 736)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !508, file: !200, line: 256, baseType: !250, size: 32, offset: 768)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !503, file: !200, line: 378, baseType: !506, size: 64, offset: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !503, file: !200, line: 381, baseType: !796, size: 64, offset: 128)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !200, line: 282, baseType: !798)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !200, line: 282, size: 128, elements: !799)
!799 = !{!800}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !798, file: !200, line: 282, baseType: !801, size: 128)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !200, line: 281, baseType: !802)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !200, line: 281, size: 128, elements: !803)
!803 = !{!804, !805, !806}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !802, file: !200, line: 281, baseType: !5, size: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !802, file: !200, line: 281, baseType: !5, size: 32, offset: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !802, file: !200, line: 281, baseType: !807, size: 64, offset: 64)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !506, size: 64, elements: !340)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !503, file: !200, line: 384, baseType: !250, size: 32, offset: 192)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !503, file: !200, line: 387, baseType: !250, size: 32, offset: 224)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !503, file: !200, line: 390, baseType: !250, size: 32, offset: 256)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !503, file: !200, line: 394, baseType: !796, size: 64, offset: 320)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !503, file: !200, line: 396, baseType: !199, size: 32, offset: 384)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !503, file: !200, line: 399, baseType: !814, size: 64, offset: 416)
!814 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 64, elements: !766)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !503, file: !200, line: 402, baseType: !816, size: 64, offset: 480)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !766)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !503, file: !200, line: 406, baseType: !250, size: 32, offset: 544)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !503, file: !200, line: 409, baseType: !250, size: 32, offset: 576)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !495, file: !496, line: 470, baseType: !534, size: 64, offset: 128)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !495, file: !496, line: 473, baseType: !821, size: 64, offset: 192)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !496, line: 166, flags: DIFlagFwdDecl)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !495, file: !496, line: 476, baseType: !824, size: 64, offset: 256)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !496, line: 476, flags: DIFlagFwdDecl)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !495, file: !496, line: 479, baseType: !827, size: 64, offset: 320)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !828, line: 144, baseType: !829)
!828 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !828, line: 100, size: 896, elements: !831)
!831 = !{!832, !840, !845, !850, !852, !853, !854, !855, !856, !857, !862, !864, !865, !870, !875}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !830, file: !828, line: 102, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !828, line: 52, baseType: !834)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DISubroutineType(types: !836)
!836 = !{!837, !838}
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !828, line: 47, baseType: !5)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !830, file: !828, line: 105, baseType: !841, size: 64, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !828, line: 59, baseType: !842)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!250, !838, !838}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !830, file: !828, line: 108, baseType: !846, size: 64, offset: 128)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !828, line: 63, baseType: !847)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DISubroutineType(types: !849)
!849 = !{null, !254}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !830, file: !828, line: 111, baseType: !851, size: 64, offset: 192)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !830, file: !828, line: 114, baseType: !690, size: 64, offset: 256)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !830, file: !828, line: 117, baseType: !690, size: 64, offset: 320)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !830, file: !828, line: 120, baseType: !690, size: 64, offset: 384)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !830, file: !828, line: 124, baseType: !5, size: 32, offset: 448)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !830, file: !828, line: 128, baseType: !5, size: 32, offset: 480)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !830, file: !828, line: 131, baseType: !858, size: 64, offset: 512)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !828, line: 75, baseType: !859)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{!254, !690, !690}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !830, file: !828, line: 132, baseType: !863, size: 64, offset: 576)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !828, line: 78, baseType: !847)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !830, file: !828, line: 135, baseType: !254, size: 64, offset: 640)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !830, file: !828, line: 136, baseType: !866, size: 64, offset: 704)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !828, line: 82, baseType: !867)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DISubroutineType(types: !869)
!869 = !{!254, !254, !690, !690}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !830, file: !828, line: 137, baseType: !871, size: 64, offset: 768)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !828, line: 83, baseType: !872)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DISubroutineType(types: !874)
!874 = !{null, !254, !254}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !830, file: !828, line: 141, baseType: !5, size: 32, offset: 832)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !495, file: !496, line: 484, baseType: !257, size: 64, offset: 384)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !495, file: !496, line: 488, baseType: !257, size: 64, offset: 448)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !495, file: !496, line: 493, baseType: !257, size: 64, offset: 512)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !495, file: !496, line: 496, baseType: !257, size: 64, offset: 576)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !495, file: !496, line: 501, baseType: !881, size: 64, offset: 640)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !211, line: 2355, size: 576, elements: !883)
!883 = !{!884, !887, !888, !889, !890, !894, !895, !900, !901, !902, !903, !904, !905}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !882, file: !211, line: 2356, baseType: !885, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !211, line: 2356, flags: DIFlagFwdDecl)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !882, file: !211, line: 2357, baseType: !255, size: 64, offset: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !882, file: !211, line: 2358, baseType: !250, size: 32, offset: 128)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !882, file: !211, line: 2359, baseType: !250, size: 32, offset: 160)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !882, file: !211, line: 2360, baseType: !891, size: 128, offset: 192)
!891 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 128, elements: !892)
!892 = !{!893}
!893 = !DISubrange(count: 4)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !882, file: !211, line: 2364, baseType: !250, size: 32, offset: 320)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !882, file: !211, line: 2367, baseType: !896, size: 128, offset: 384)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !211, line: 2349, size: 128, elements: !897)
!897 = !{!898, !899}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !896, file: !211, line: 2351, baseType: !416, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !896, file: !211, line: 2352, baseType: !313, size: 64, offset: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !882, file: !211, line: 2371, baseType: !210, size: 32, offset: 512)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !882, file: !211, line: 2374, baseType: !5, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !882, file: !211, line: 2377, baseType: !5, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !882, file: !211, line: 2381, baseType: !5, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !882, file: !211, line: 2392, baseType: !5, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !882, file: !211, line: 2396, baseType: !5, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !495, file: !496, line: 504, baseType: !907, size: 64, offset: 704)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !496, line: 504, flags: DIFlagFwdDecl)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !495, file: !496, line: 507, baseType: !827, size: 64, offset: 768)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !495, file: !496, line: 510, baseType: !250, size: 32, offset: 832)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !495, file: !496, line: 513, baseType: !250, size: 32, offset: 864)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !495, file: !496, line: 516, baseType: !366, size: 32, offset: 896)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !495, file: !496, line: 519, baseType: !366, size: 32, offset: 928)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !495, file: !496, line: 522, baseType: !5, size: 32, offset: 960)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !495, file: !496, line: 523, baseType: !5, size: 32, offset: 992)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !495, file: !496, line: 528, baseType: !255, size: 64, offset: 1024)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !495, file: !496, line: 535, baseType: !5, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !495, file: !496, line: 539, baseType: !5, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !495, file: !496, line: 543, baseType: !5, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !495, file: !496, line: 546, baseType: !5, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !495, file: !496, line: 550, baseType: !5, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !495, file: !496, line: 554, baseType: !5, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !495, file: !496, line: 559, baseType: !5, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !495, file: !496, line: 562, baseType: !5, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !495, file: !496, line: 571, baseType: !5, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !495, file: !496, line: 573, baseType: !5, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !495, file: !496, line: 574, baseType: !5, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !495, file: !496, line: 581, baseType: !5, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !495, file: !496, line: 585, baseType: !5, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !495, file: !496, line: 588, baseType: !5, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !495, file: !496, line: 592, baseType: !5, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !495, file: !496, line: 598, baseType: !5, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !490, file: !4, line: 3254, baseType: !257, size: 64, offset: 1536)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !490, file: !4, line: 3257, baseType: !257, size: 64, offset: 1600)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !490, file: !4, line: 3258, baseType: !257, size: 64, offset: 1664)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !490, file: !4, line: 3264, baseType: !5, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !490, file: !4, line: 3265, baseType: !5, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !490, file: !4, line: 3267, baseType: !5, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !490, file: !4, line: 3268, baseType: !5, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !490, file: !4, line: 3269, baseType: !5, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !490, file: !4, line: 3271, baseType: !5, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !490, file: !4, line: 3272, baseType: !5, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !490, file: !4, line: 3273, baseType: !5, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !490, file: !4, line: 3274, baseType: !5, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !490, file: !4, line: 3275, baseType: !5, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !490, file: !4, line: 3276, baseType: !5, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !490, file: !4, line: 3277, baseType: !5, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !490, file: !4, line: 3279, baseType: !5, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !490, file: !4, line: 3280, baseType: !5, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !490, file: !4, line: 3281, baseType: !5, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !490, file: !4, line: 3282, baseType: !5, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !490, file: !4, line: 3283, baseType: !5, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !490, file: !4, line: 3284, baseType: !5, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !260, file: !4, line: 3394, baseType: !955, size: 1344)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !4, line: 2279, size: 1344, elements: !956)
!956 = !{!957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !982, !983, !984, !992, !993, !994, !995, !996, !997, !998, !999, !1000}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !955, file: !4, line: 2280, baseType: !296, size: 192)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !955, file: !4, line: 2281, baseType: !257, size: 64, offset: 192)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !955, file: !4, line: 2282, baseType: !257, size: 64, offset: 256)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !955, file: !4, line: 2283, baseType: !257, size: 64, offset: 320)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !955, file: !4, line: 2284, baseType: !257, size: 64, offset: 384)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !955, file: !4, line: 2285, baseType: !5, size: 32, offset: 448)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !955, file: !4, line: 2287, baseType: !5, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !955, file: !4, line: 2288, baseType: !5, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !955, file: !4, line: 2289, baseType: !5, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !955, file: !4, line: 2290, baseType: !5, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !955, file: !4, line: 2291, baseType: !5, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !955, file: !4, line: 2292, baseType: !5, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !955, file: !4, line: 2294, baseType: !5, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !955, file: !4, line: 2296, baseType: !5, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !955, file: !4, line: 2297, baseType: !5, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !955, file: !4, line: 2298, baseType: !5, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !955, file: !4, line: 2299, baseType: !5, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !955, file: !4, line: 2300, baseType: !5, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !955, file: !4, line: 2301, baseType: !5, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !955, file: !4, line: 2302, baseType: !5, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !955, file: !4, line: 2303, baseType: !5, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !955, file: !4, line: 2305, baseType: !5, size: 32, offset: 512)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !955, file: !4, line: 2306, baseType: !980, size: 32, offset: 544)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !981, line: 31, baseType: !250)
!981 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!982 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !955, file: !4, line: 2307, baseType: !257, size: 64, offset: 576)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !955, file: !4, line: 2308, baseType: !257, size: 64, offset: 640)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !955, file: !4, line: 2314, baseType: !985, size: 64, offset: 704)
!985 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !4, line: 2309, size: 64, elements: !986)
!986 = !{!987, !988, !989}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !985, file: !4, line: 2310, baseType: !250, size: 32)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !985, file: !4, line: 2311, baseType: !255, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !985, file: !4, line: 2312, baseType: !990, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !4, line: 2277, flags: DIFlagFwdDecl)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !955, file: !4, line: 2315, baseType: !257, size: 64, offset: 768)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !955, file: !4, line: 2316, baseType: !257, size: 64, offset: 832)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !955, file: !4, line: 2317, baseType: !257, size: 64, offset: 896)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !955, file: !4, line: 2318, baseType: !257, size: 64, offset: 960)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !955, file: !4, line: 2319, baseType: !257, size: 64, offset: 1024)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !955, file: !4, line: 2320, baseType: !257, size: 64, offset: 1088)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !955, file: !4, line: 2321, baseType: !257, size: 64, offset: 1152)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !955, file: !4, line: 2322, baseType: !257, size: 64, offset: 1216)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !955, file: !4, line: 2324, baseType: !1001, size: 64, offset: 1280)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !4, line: 2324, flags: DIFlagFwdDecl)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !260, file: !4, line: 3395, baseType: !1004, size: 320)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !4, line: 1469, size: 320, elements: !1005)
!1005 = !{!1006, !1007, !1008}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1004, file: !4, line: 1470, baseType: !296, size: 192)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1004, file: !4, line: 1471, baseType: !257, size: 64, offset: 192)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1004, file: !4, line: 1472, baseType: !257, size: 64, offset: 256)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !260, file: !4, line: 3396, baseType: !1010, size: 320)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !4, line: 1482, size: 320, elements: !1011)
!1011 = !{!1012, !1013, !1014}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1010, file: !4, line: 1483, baseType: !296, size: 192)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1010, file: !4, line: 1484, baseType: !250, size: 32, offset: 192)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1010, file: !4, line: 1485, baseType: !598, size: 64, offset: 256)
