; ModuleID = 'c-opts.bc'
source_filename = "c-opts.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.diagnostic_context = type { %struct.pretty_print_info*, [12 x i32], i8, i8, [870 x i32], i8, i8, void (%struct.diagnostic_context*, %struct.diagnostic_info*)*, void (%struct.diagnostic_context*, %struct.diagnostic_info*)*, void (i8*, [1 x %struct.__va_list_tag]*)*, %union.tree_node*, %struct.line_map*, i32, i8 }
%struct.pretty_print_info = type { %struct.output_buffer*, i8*, i32, i32, i32, %struct.pp_wrapping_mode_t, i8 (%struct.pretty_print_info*, %struct.text_info*, i8*, i32, i8, i8, i8)*, i8, i8, i8 }
%struct.output_buffer = type { %struct.obstack, %struct.obstack, %struct.obstack*, %struct.chunk_info*, %struct._IO_FILE*, i32, [128 x i8] }
%struct.obstack = type { i64, %struct._obstack_chunk*, i8*, i8*, i8*, i64, i32, %struct._obstack_chunk* (i8*, i64)*, void (i8*, %struct._obstack_chunk*)*, i8*, i8 }
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [4 x i8] }
%struct.chunk_info = type { %struct.chunk_info*, [60 x i8*] }

!863 = !DIEnumerator(name: "OPT_pedantic", value: 834, isUnsigned: true)
!864 = !DIEnumerator(name: "OPT_pedantic_errors", value: 835, isUnsigned: true)
!865 = !DIEnumerator(name: "OPT_pie", value: 836, isUnsigned: true)
!866 = !DIEnumerator(name: "OPT_print_objc_runtime_info", value: 837, isUnsigned: true)
!867 = !DIEnumerator(name: "OPT_print_pch_checksum", value: 838, isUnsigned: true)
!868 = !DIEnumerator(name: "OPT_quiet", value: 839, isUnsigned: true)
!869 = !DIEnumerator(name: "OPT_remap", value: 840, isUnsigned: true)
!870 = !DIEnumerator(name: "OPT_shared", value: 841, isUnsigned: true)
!871 = !DIEnumerator(name: "OPT_static_libgfortran", value: 842, isUnsigned: true)
!872 = !DIEnumerator(name: "OPT_std_c__0x", value: 843, isUnsigned: true)
!873 = !DIEnumerator(name: "OPT_std_c__98", value: 844, isUnsigned: true)
!874 = !DIEnumerator(name: "OPT_std_c89", value: 845, isUnsigned: true)
!875 = !DIEnumerator(name: "OPT_std_c90", value: 846, isUnsigned: true)
!876 = !DIEnumerator(name: "OPT_std_c99", value: 847, isUnsigned: true)
!877 = !DIEnumerator(name: "OPT_std_c9x", value: 848, isUnsigned: true)
!878 = !DIEnumerator(name: "OPT_std_f2003", value: 849, isUnsigned: true)
!879 = !DIEnumerator(name: "OPT_std_f2008", value: 850, isUnsigned: true)
!880 = !DIEnumerator(name: "OPT_std_f95", value: 851, isUnsigned: true)
!881 = !DIEnumerator(name: "OPT_std_gnu", value: 852, isUnsigned: true)
!882 = !DIEnumerator(name: "OPT_std_gnu__0x", value: 853, isUnsigned: true)
!883 = !DIEnumerator(name: "OPT_std_gnu__98", value: 854, isUnsigned: true)
!884 = !DIEnumerator(name: "OPT_std_gnu89", value: 855, isUnsigned: true)
!885 = !DIEnumerator(name: "OPT_std_gnu90", value: 856, isUnsigned: true)
!886 = !DIEnumerator(name: "OPT_std_gnu99", value: 857, isUnsigned: true)
!887 = !DIEnumerator(name: "OPT_std_gnu9x", value: 858, isUnsigned: true)
!888 = !DIEnumerator(name: "OPT_std_iso9899_1990", value: 859, isUnsigned: true)
!889 = !DIEnumerator(name: "OPT_std_iso9899_199409", value: 860, isUnsigned: true)
!890 = !DIEnumerator(name: "OPT_std_iso9899_1999", value: 861, isUnsigned: true)
!891 = !DIEnumerator(name: "OPT_std_iso9899_199x", value: 862, isUnsigned: true)
!892 = !DIEnumerator(name: "OPT_std_legacy", value: 863, isUnsigned: true)
!893 = !DIEnumerator(name: "OPT_traditional_cpp", value: 864, isUnsigned: true)
!894 = !DIEnumerator(name: "OPT_trigraphs", value: 865, isUnsigned: true)
!895 = !DIEnumerator(name: "OPT_undef", value: 866, isUnsigned: true)
!896 = !DIEnumerator(name: "OPT_v", value: 867, isUnsigned: true)
!897 = !DIEnumerator(name: "OPT_version", value: 868, isUnsigned: true)
!898 = !DIEnumerator(name: "OPT_w", value: 869, isUnsigned: true)
!899 = !DIEnumerator(name: "N_OPTS", value: 870, isUnsigned: true)
!900 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cl_var_type", file: !901, line: 25, baseType: !6, size: 32, elements: !902)
!901 = !DIFile(filename: "./opts.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!902 = !{!903, !904, !905, !906, !907}
!903 = !DIEnumerator(name: "CLVC_BOOLEAN", value: 0, isUnsigned: true)
!904 = !DIEnumerator(name: "CLVC_EQUAL", value: 1, isUnsigned: true)
!905 = !DIEnumerator(name: "CLVC_BIT_CLEAR", value: 2, isUnsigned: true)
!906 = !DIEnumerator(name: "CLVC_BIT_SET", value: 3, isUnsigned: true)
!907 = !DIEnumerator(name: "CLVC_STRING", value: 4, isUnsigned: true)
!908 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_lang", file: !14, line: 158, baseType: !6, size: 32, elements: !909)
!909 = !{!910, !911, !912, !913, !914, !915, !916, !917, !918, !919}
!910 = !DIEnumerator(name: "CLK_GNUC89", value: 0, isUnsigned: true)
!911 = !DIEnumerator(name: "CLK_GNUC99", value: 1, isUnsigned: true)
!912 = !DIEnumerator(name: "CLK_STDC89", value: 2, isUnsigned: true)
!913 = !DIEnumerator(name: "CLK_STDC94", value: 3, isUnsigned: true)
!914 = !DIEnumerator(name: "CLK_STDC99", value: 4, isUnsigned: true)
!915 = !DIEnumerator(name: "CLK_GNUCXX", value: 5, isUnsigned: true)
!916 = !DIEnumerator(name: "CLK_CXX98", value: 6, isUnsigned: true)
!917 = !DIEnumerator(name: "CLK_GNUCXX0X", value: 7, isUnsigned: true)
!918 = !DIEnumerator(name: "CLK_CXX0X", value: 8, isUnsigned: true)
!919 = !DIEnumerator(name: "CLK_ASM", value: 9, isUnsigned: true)
!920 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cpp_normalize_level", file: !14, line: 265, baseType: !6, size: 32, elements: !921)
!921 = !{!922, !923, !924, !925}
!922 = !DIEnumerator(name: "normalized_KC", value: 0, isUnsigned: true)
!923 = !DIEnumerator(name: "normalized_C", value: 1, isUnsigned: true)
!924 = !DIEnumerator(name: "normalized_identifier_C", value: 2, isUnsigned: true)
!925 = !DIEnumerator(name: "normalized_none", value: 3, isUnsigned: true)
!926 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cpp_deps_style", file: !14, line: 262, baseType: !6, size: 32, elements: !927)
!927 = !{!928, !929, !930}
!928 = !DIEnumerator(name: "DEPS_NONE", value: 0, isUnsigned: true)
!929 = !DIEnumerator(name: "DEPS_USER", value: 1, isUnsigned: true)
!930 = !DIEnumerator(name: "DEPS_SYSTEM", value: 2, isUnsigned: true)
!931 = !{!932, !933, !934, !935, !937, !8, !938, !26, !7, !943, !936}
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!934 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "deferred_opt", file: !3, line: 131, size: 128, elements: !940)
!940 = !{!941, !942}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !939, file: !3, line: 133, baseType: !26, size: 32)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !939, file: !3, line: 134, baseType: !8, size: 64, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !944, line: 44, baseType: !6)
!944 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!945 = !{!0, !946, !1015, !1017, !1019, !1077, !1079, !1081, !1083, !1085, !1087, !1089, !1091, !1093, !1095, !1097, !1099, !1101, !1103, !1105}
!946 = !DIGlobalVariableExpression(var: !947, expr: !DIExpression())
!947 = distinct !DIGlobalVariable(name: "cpp_opts", scope: !11, file: !3, line: 58, type: !948, isLocal: false, isDefinition: true)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_options", file: !14, line: 33, baseType: !950)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_options", file: !14, line: 279, size: 1024, elements: !951)
!951 = !{!952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !1003, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "tabstop", scope: !950, file: !14, line: 282, baseType: !6, size: 32)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "lang", scope: !950, file: !14, line: 285, baseType: !908, size: 32, offset: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "cplusplus", scope: !950, file: !14, line: 288, baseType: !933, size: 8, offset: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "cplusplus_comments", scope: !950, file: !14, line: 291, baseType: !933, size: 8, offset: 72)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "objc", scope: !950, file: !14, line: 296, baseType: !933, size: 8, offset: 80)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "discard_comments", scope: !950, file: !14, line: 299, baseType: !933, size: 8, offset: 88)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "discard_comments_in_macro_exp", scope: !950, file: !14, line: 303, baseType: !933, size: 8, offset: 96)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "trigraphs", scope: !950, file: !14, line: 306, baseType: !933, size: 8, offset: 104)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "digraphs", scope: !950, file: !14, line: 309, baseType: !933, size: 8, offset: 112)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "extended_numbers", scope: !950, file: !14, line: 312, baseType: !933, size: 8, offset: 120)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "uliterals", scope: !950, file: !14, line: 315, baseType: !933, size: 8, offset: 128)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "print_include_names", scope: !950, file: !14, line: 318, baseType: !933, size: 8, offset: 136)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "warn_deprecated", scope: !950, file: !14, line: 321, baseType: !933, size: 8, offset: 144)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "warn_comments", scope: !950, file: !14, line: 324, baseType: !933, size: 8, offset: 152)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "warn_missing_include_dirs", scope: !950, file: !14, line: 328, baseType: !933, size: 8, offset: 160)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "warn_trigraphs", scope: !950, file: !14, line: 331, baseType: !933, size: 8, offset: 168)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "warn_multichar", scope: !950, file: !14, line: 334, baseType: !933, size: 8, offset: 176)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "warn_traditional", scope: !950, file: !14, line: 338, baseType: !933, size: 8, offset: 184)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "warn_long_long", scope: !950, file: !14, line: 341, baseType: !933, size: 8, offset: 192)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "warn_endif_labels", scope: !950, file: !14, line: 344, baseType: !933, size: 8, offset: 200)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "warn_num_sign_change", scope: !950, file: !14, line: 348, baseType: !933, size: 8, offset: 208)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "warn_variadic_macros", scope: !950, file: !14, line: 352, baseType: !933, size: 8, offset: 216)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "warn_builtin_macro_redefined", scope: !950, file: !14, line: 356, baseType: !933, size: 8, offset: 224)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !950, file: !14, line: 360, baseType: !933, size: 8, offset: 232)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "dollars_in_ident", scope: !950, file: !14, line: 363, baseType: !933, size: 8, offset: 240)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "extended_identifiers", scope: !950, file: !14, line: 366, baseType: !933, size: 8, offset: 248)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "warn_dollars", scope: !950, file: !14, line: 370, baseType: !933, size: 8, offset: 256)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "warn_undef", scope: !950, file: !14, line: 373, baseType: !933, size: 8, offset: 264)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "warn_unused_macros", scope: !950, file: !14, line: 376, baseType: !933, size: 8, offset: 272)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "c99", scope: !950, file: !14, line: 379, baseType: !933, size: 8, offset: 280)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "std", scope: !950, file: !14, line: 382, baseType: !933, size: 8, offset: 288)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "pedantic", scope: !950, file: !14, line: 385, baseType: !933, size: 8, offset: 296)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "preprocessed", scope: !950, file: !14, line: 389, baseType: !933, size: 8, offset: 304)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "show_column", scope: !950, file: !14, line: 392, baseType: !933, size: 8, offset: 312)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "operator_names", scope: !950, file: !14, line: 395, baseType: !933, size: 8, offset: 320)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "warn_cxx_operator_names", scope: !950, file: !14, line: 398, baseType: !933, size: 8, offset: 328)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "traditional", scope: !950, file: !14, line: 401, baseType: !933, size: 8, offset: 336)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "narrow_charset", scope: !950, file: !14, line: 404, baseType: !8, size: 64, offset: 384)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "wide_charset", scope: !950, file: !14, line: 407, baseType: !8, size: 64, offset: 448)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "input_charset", scope: !950, file: !14, line: 410, baseType: !8, size: 64, offset: 512)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "warn_normalize", scope: !950, file: !14, line: 414, baseType: !920, size: 32, offset: 576)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "warn_invalid_pch", scope: !950, file: !14, line: 417, baseType: !933, size: 8, offset: 608)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "restore_pch_deps", scope: !950, file: !14, line: 420, baseType: !933, size: 8, offset: 616)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "deps", scope: !950, file: !14, line: 441, baseType: !996, size: 64, offset: 640)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !950, file: !14, line: 423, size: 64, elements: !997)
!997 = !{!998, !999, !1000, !1001, !1002}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !996, file: !14, line: 426, baseType: !926, size: 32)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "missing_files", scope: !996, file: !14, line: 429, baseType: !933, size: 8, offset: 32)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "phony_targets", scope: !996, file: !14, line: 433, baseType: !933, size: 8, offset: 40)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_main_file", scope: !996, file: !14, line: 436, baseType: !933, size: 8, offset: 48)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "need_preprocessor_output", scope: !996, file: !14, line: 440, baseType: !933, size: 8, offset: 56)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !950, file: !14, line: 447, baseType: !1004, size: 64, offset: 704)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1005, line: 46, baseType: !1006)
!1005 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1006 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "char_precision", scope: !950, file: !14, line: 447, baseType: !1004, size: 64, offset: 768)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "int_precision", scope: !950, file: !14, line: 447, baseType: !1004, size: 64, offset: 832)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "wchar_precision", scope: !950, file: !14, line: 447, baseType: !1004, size: 64, offset: 896)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_char", scope: !950, file: !14, line: 450, baseType: !933, size: 8, offset: 960)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_wchar", scope: !950, file: !14, line: 450, baseType: !933, size: 8, offset: 968)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_big_endian", scope: !950, file: !14, line: 454, baseType: !933, size: 8, offset: 976)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "stdc_0_in_system_headers", scope: !950, file: !14, line: 457, baseType: !933, size: 8, offset: 984)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "directives_only", scope: !950, file: !14, line: 460, baseType: !933, size: 8, offset: 992)
!1015 = !DIGlobalVariableExpression(var: !1016, expr: !DIExpression())
!1016 = distinct !DIGlobalVariable(name: "this_input_filename", scope: !11, file: !3, line: 61, type: !8, isLocal: true, isDefinition: true)
!1017 = !DIGlobalVariableExpression(var: !1018, expr: !DIExpression())
!1018 = distinct !DIGlobalVariable(name: "out_fname", scope: !11, file: !3, line: 64, type: !8, isLocal: true, isDefinition: true)
!1019 = !DIGlobalVariableExpression(var: !1020, expr: !DIExpression())
!1020 = distinct !DIGlobalVariable(name: "out_stream", scope: !11, file: !3, line: 65, type: !1021, isLocal: true, isDefinition: true)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1023, line: 7, baseType: !1024)
!1023 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1025, line: 49, size: 1728, elements: !1026)
!1025 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!1026 = !{!1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1042, !1044, !1045, !1046, !1050, !1052, !1054, !1058, !1061, !1063, !1066, !1069, !1070, !1071, !1072, !1073}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1024, file: !1025, line: 51, baseType: !934, size: 32)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1024, file: !1025, line: 54, baseType: !936, size: 64, offset: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1024, file: !1025, line: 55, baseType: !936, size: 64, offset: 128)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1024, file: !1025, line: 56, baseType: !936, size: 64, offset: 192)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1024, file: !1025, line: 57, baseType: !936, size: 64, offset: 256)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1024, file: !1025, line: 58, baseType: !936, size: 64, offset: 320)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1024, file: !1025, line: 59, baseType: !936, size: 64, offset: 384)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1024, file: !1025, line: 60, baseType: !936, size: 64, offset: 448)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1024, file: !1025, line: 61, baseType: !936, size: 64, offset: 512)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1024, file: !1025, line: 64, baseType: !936, size: 64, offset: 576)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1024, file: !1025, line: 65, baseType: !936, size: 64, offset: 640)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1024, file: !1025, line: 66, baseType: !936, size: 64, offset: 704)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1024, file: !1025, line: 68, baseType: !1040, size: 64, offset: 768)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1025, line: 36, flags: DIFlagFwdDecl)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1024, file: !1025, line: 70, baseType: !1043, size: 64, offset: 832)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1024, file: !1025, line: 72, baseType: !934, size: 32, offset: 896)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1024, file: !1025, line: 73, baseType: !934, size: 32, offset: 928)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1024, file: !1025, line: 74, baseType: !1047, size: 64, offset: 960)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !1048, line: 152, baseType: !1049)
!1048 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!1049 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1024, file: !1025, line: 77, baseType: !1051, size: 16, offset: 1024)
!1051 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1024, file: !1025, line: 78, baseType: !1053, size: 8, offset: 1040)
!1053 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1024, file: !1025, line: 79, baseType: !1055, size: 8, offset: 1048)
!1055 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 8, elements: !1056)
!1056 = !{!1057}
!1057 = !DISubrange(count: 1)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1024, file: !1025, line: 81, baseType: !1059, size: 64, offset: 1088)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1025, line: 43, baseType: null)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1024, file: !1025, line: 89, baseType: !1062, size: 64, offset: 1152)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !1048, line: 153, baseType: !1049)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1024, file: !1025, line: 91, baseType: !1064, size: 64, offset: 1216)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !1025, line: 37, flags: DIFlagFwdDecl)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1024, file: !1025, line: 92, baseType: !1067, size: 64, offset: 1280)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !1025, line: 38, flags: DIFlagFwdDecl)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1024, file: !1025, line: 93, baseType: !1043, size: 64, offset: 1344)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1024, file: !1025, line: 94, baseType: !937, size: 64, offset: 1408)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1024, file: !1025, line: 95, baseType: !1004, size: 64, offset: 1472)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1024, file: !1025, line: 96, baseType: !934, size: 32, offset: 1536)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1024, file: !1025, line: 98, baseType: !1074, size: 160, offset: 1568)
!1074 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 160, elements: !1075)
!1075 = !{!1076}
!1076 = !DISubrange(count: 20)
!1077 = !DIGlobalVariableExpression(var: !1078, expr: !DIExpression())
!1078 = distinct !DIGlobalVariable(name: "deps_append", scope: !11, file: !3, line: 68, type: !933, isLocal: true, isDefinition: true)
!1079 = !DIGlobalVariableExpression(var: !1080, expr: !DIExpression())
!1080 = distinct !DIGlobalVariable(name: "deps_seen", scope: !11, file: !3, line: 71, type: !933, isLocal: true, isDefinition: true)
!1081 = !DIGlobalVariableExpression(var: !1082, expr: !DIExpression())
!1082 = distinct !DIGlobalVariable(name: "verbose", scope: !11, file: !3, line: 74, type: !933, isLocal: true, isDefinition: true)
!1083 = !DIGlobalVariableExpression(var: !1084, expr: !DIExpression())
!1084 = distinct !DIGlobalVariable(name: "deps_file", scope: !11, file: !3, line: 77, type: !8, isLocal: true, isDefinition: true)
!1085 = !DIGlobalVariableExpression(var: !1086, expr: !DIExpression())
!1086 = distinct !DIGlobalVariable(name: "iprefix", scope: !11, file: !3, line: 80, type: !8, isLocal: true, isDefinition: true)
!1087 = !DIGlobalVariableExpression(var: !1088, expr: !DIExpression())
!1088 = distinct !DIGlobalVariable(name: "imultilib", scope: !11, file: !3, line: 83, type: !8, isLocal: true, isDefinition: true)
!1089 = !DIGlobalVariableExpression(var: !1090, expr: !DIExpression())
!1090 = distinct !DIGlobalVariable(name: "quote_chain_split", scope: !11, file: !3, line: 95, type: !933, isLocal: true, isDefinition: true)
!1091 = !DIGlobalVariableExpression(var: !1092, expr: !DIExpression())
!1092 = distinct !DIGlobalVariable(name: "warn_unused_macros", scope: !11, file: !3, line: 98, type: !933, isLocal: true, isDefinition: true)
!1093 = !DIGlobalVariableExpression(var: !1094, expr: !DIExpression())
!1094 = distinct !DIGlobalVariable(name: "deferred_opts", scope: !11, file: !3, line: 135, type: !938, isLocal: true, isDefinition: true)
!1095 = !DIGlobalVariableExpression(var: !1096, expr: !DIExpression())
!1096 = distinct !DIGlobalVariable(name: "deferred_count", scope: !11, file: !3, line: 104, type: !1004, isLocal: true, isDefinition: true)
!1097 = !DIGlobalVariableExpression(var: !1098, expr: !DIExpression())
!1098 = distinct !DIGlobalVariable(name: "warn_variadic_macros", scope: !11, file: !3, line: 101, type: !933, isLocal: true, isDefinition: true)
!1099 = !DIGlobalVariableExpression(var: !1100, expr: !DIExpression())
!1100 = distinct !DIGlobalVariable(name: "sysroot", scope: !11, file: !3, line: 86, type: !8, isLocal: true, isDefinition: true)
!1101 = !DIGlobalVariableExpression(var: !1102, expr: !DIExpression())
!1102 = distinct !DIGlobalVariable(name: "std_inc", scope: !11, file: !3, line: 89, type: !933, isLocal: true, isDefinition: true)
!1103 = !DIGlobalVariableExpression(var: !1104, expr: !DIExpression())
!1104 = distinct !DIGlobalVariable(name: "std_cxx_inc", scope: !11, file: !3, line: 92, type: !933, isLocal: true, isDefinition: true)
!1105 = !DIGlobalVariableExpression(var: !1106, expr: !DIExpression())
!1106 = distinct !DIGlobalVariable(name: "include_cursor", scope: !11, file: !3, line: 107, type: !1004, isLocal: true, isDefinition: true)
!1107 = !{!1108, !1109, !1110, !1111, !1112}
!1108 = !DILocalVariable(name: "argc", arg: 1, scope: !2, file: !3, line: 201, type: !6)
!1109 = !DILocalVariable(name: "argv", arg: 2, scope: !2, file: !3, line: 201, type: !7)
!1110 = !DILocalVariable(name: "i", scope: !2, file: !3, line: 204, type: !6)
!1111 = !DILocalVariable(name: "result", scope: !2, file: !3, line: 204, type: !6)
!1112 = !DILocalVariable(name: "cb", scope: !2, file: !3, line: 205, type: !1113)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_callbacks", file: !14, line: 472, size: 1088, elements: !1115)
!1115 = !{!1116, !1182, !1198, !1202, !1207, !1211, !1212, !1219, !1223, !1227, !1231, !1260, !1264, !1281, !1282, !1283, !1287}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "line_change", scope: !1114, file: !14, line: 475, baseType: !1117, size: 64)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{null, !1120, !1124, !934}
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_reader", file: !14, line: 31, baseType: !1122)
!1122 = !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_reader", file: !1123, line: 91, flags: DIFlagFwdDecl)
!1123 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64)
!1125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1126)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_token", file: !14, line: 34, baseType: !1127)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_token", file: !14, line: 212, size: 192, elements: !1128)
!1128 = !{!1129, !1130, !1131, !1132}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "src_loc", scope: !1127, file: !14, line: 213, baseType: !943, size: 32)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1127, file: !14, line: 214, baseType: !6, size: 8, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1127, file: !14, line: 215, baseType: !1051, size: 16, offset: 48)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1127, file: !14, line: 237, baseType: !1133, size: 128, offset: 64)
!1133 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cpp_token_u", file: !14, line: 217, size: 128, elements: !1134)
!1134 = !{!1135, !1169, !1171, !1176, !1180, !1181}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1133, file: !14, line: 220, baseType: !1136, size: 64)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_identifier", file: !14, line: 201, size: 64, elements: !1137)
!1137 = !{!1138}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1136, file: !14, line: 207, baseType: !1139, size: 64)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_hashnode", file: !14, line: 36, baseType: !1141)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_hashnode", file: !14, line: 644, size: 256, elements: !1142)
!1142 = !{!1143, !1152, !1153, !1154, !1155, !1156, !1157}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !1141, file: !14, line: 645, baseType: !1144, size: 128)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1145, line: 31, size: 128, elements: !1146)
!1145 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1146 = !{!1147, !1150, !1151}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1144, file: !1145, line: 32, baseType: !1148, size: 64)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !933)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1144, file: !1145, line: 33, baseType: !6, size: 32, offset: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1144, file: !1145, line: 34, baseType: !6, size: 32, offset: 96)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "is_directive", scope: !1141, file: !14, line: 646, baseType: !6, size: 1, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "directive_index", scope: !1141, file: !14, line: 647, baseType: !6, size: 7, offset: 129, flags: DIFlagBitField, extraData: i64 128)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "rid_code", scope: !1141, file: !14, line: 650, baseType: !933, size: 8, offset: 136)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1141, file: !14, line: 651, baseType: !6, size: 6, offset: 144, flags: DIFlagBitField, extraData: i64 144)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1141, file: !14, line: 652, baseType: !6, size: 10, offset: 150, flags: DIFlagBitField, extraData: i64 144)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1141, file: !14, line: 654, baseType: !1158, size: 64, offset: 192)
!1158 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_cpp_hashnode_value", file: !14, line: 633, size: 64, elements: !1159)
!1159 = !{!1160, !1164, !1167, !1168}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !1158, file: !14, line: 635, baseType: !1161, size: 64)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_macro", file: !14, line: 37, baseType: !1163)
!1163 = !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_macro", file: !14, line: 37, flags: DIFlagFwdDecl)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "answers", scope: !1158, file: !14, line: 637, baseType: !1165, size: 64)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64)
!1166 = !DICompositeType(tag: DW_TAG_structure_type, name: "answer", file: !14, line: 41, flags: DIFlagFwdDecl)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "builtin", scope: !1158, file: !14, line: 639, baseType: !13, size: 32)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "arg_index", scope: !1158, file: !14, line: 641, baseType: !1051, size: 16)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1133, file: !14, line: 223, baseType: !1170, size: 64)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1133, file: !14, line: 226, baseType: !1172, size: 128)
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_string", file: !14, line: 162, size: 128, elements: !1173)
!1173 = !{!1174, !1175}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1172, file: !14, line: 163, baseType: !6, size: 32)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1172, file: !14, line: 164, baseType: !1148, size: 64, offset: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "macro_arg", scope: !1133, file: !14, line: 229, baseType: !1177, size: 32)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_macro_arg", file: !14, line: 195, size: 32, elements: !1178)
!1178 = !{!1179}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "arg_no", scope: !1177, file: !14, line: 197, baseType: !6, size: 32)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "token_no", scope: !1133, file: !14, line: 233, baseType: !6, size: 32)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "pragma", scope: !1133, file: !14, line: 236, baseType: !6, size: 32)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "file_change", scope: !1114, file: !14, line: 481, baseType: !1183, size: 64, offset: 64)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64)
!1184 = !DISubroutineType(types: !1185)
!1185 = !{null, !1120, !1186}
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64)
!1187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1188)
!1188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line_map", file: !944, line: 61, size: 192, elements: !1189)
!1189 = !{!1190, !1191, !1193, !1194, !1195, !1196, !1197}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "to_file", scope: !1188, file: !944, line: 62, baseType: !8, size: 64)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "to_line", scope: !1188, file: !944, line: 63, baseType: !1192, size: 32, offset: 64)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "linenum_type", file: !944, line: 39, baseType: !6)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "start_location", scope: !1188, file: !944, line: 64, baseType: !943, size: 32, offset: 96)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "included_from", scope: !1188, file: !944, line: 65, baseType: !934, size: 32, offset: 128)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !1188, file: !944, line: 66, baseType: !6, size: 8, offset: 160, flags: DIFlagBitField, extraData: i64 160)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !1188, file: !944, line: 68, baseType: !933, size: 8, offset: 168)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "column_bits", scope: !1188, file: !944, line: 70, baseType: !6, size: 8, offset: 176, flags: DIFlagBitField, extraData: i64 176)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "dir_change", scope: !1114, file: !14, line: 483, baseType: !1199, size: 64, offset: 128)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64)
!1200 = !DISubroutineType(types: !1201)
!1201 = !{null, !1120, !8}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "include", scope: !1114, file: !14, line: 484, baseType: !1203, size: 64, offset: 192)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64)
!1204 = !DISubroutineType(types: !1205)
!1205 = !{null, !1120, !6, !1148, !8, !934, !1206}
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "define", scope: !1114, file: !14, line: 486, baseType: !1208, size: 64, offset: 256)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64)
!1209 = !DISubroutineType(types: !1210)
!1210 = !{null, !1120, !6, !1139}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "undef", scope: !1114, file: !14, line: 487, baseType: !1208, size: 64, offset: 320)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !1114, file: !14, line: 488, baseType: !1213, size: 64, offset: 384)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64)
!1214 = !DISubroutineType(types: !1215)
!1215 = !{null, !1120, !6, !1216}
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1217 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1218)
!1218 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_string", file: !14, line: 35, baseType: !1172)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "def_pragma", scope: !1114, file: !14, line: 489, baseType: !1220, size: 64, offset: 448)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1221 = !DISubroutineType(types: !1222)
!1222 = !{null, !1120, !6}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "valid_pch", scope: !1114, file: !14, line: 490, baseType: !1224, size: 64, offset: 512)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64)
!1225 = !DISubroutineType(types: !1226)
!1226 = !{!934, !1120, !8, !934}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "read_pch", scope: !1114, file: !14, line: 491, baseType: !1228, size: 64, offset: 576)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64)
!1229 = !DISubroutineType(types: !1230)
!1230 = !{null, !1120, !8, !934, !8}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "missing_header", scope: !1114, file: !14, line: 492, baseType: !1232, size: 64, offset: 640)
!1232 = !DIDerivedType(tag: DW_TAG_typedef, name: "missing_header_cb", file: !14, line: 469, baseType: !1233)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64)
!1234 = !DISubroutineType(types: !1235)
!1235 = !{!8, !1120, !8, !1236}
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_dir", file: !14, line: 39, baseType: !1239)
!1239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_dir", file: !14, line: 523, size: 512, elements: !1240)
!1240 = !{!1241, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1253, !1257}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1239, file: !14, line: 526, baseType: !1242, size: 64)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1239, file: !14, line: 529, baseType: !936, size: 64, offset: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1239, file: !14, line: 530, baseType: !6, size: 32, offset: 128)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !1239, file: !14, line: 534, baseType: !933, size: 8, offset: 160)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "user_supplied_p", scope: !1239, file: !14, line: 537, baseType: !933, size: 8, offset: 168)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "canonical_name", scope: !1239, file: !14, line: 541, baseType: !936, size: 64, offset: 192)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "name_map", scope: !1239, file: !14, line: 545, baseType: !7, size: 64, offset: 256)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "construct", scope: !1239, file: !14, line: 551, baseType: !1250, size: 64, offset: 320)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64)
!1251 = !DISubroutineType(types: !1252)
!1252 = !{!936, !8, !1237}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !1239, file: !14, line: 555, baseType: !1254, size: 64, offset: 384)
!1254 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !1255, line: 47, baseType: !1256)
!1255 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!1256 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !1048, line: 148, baseType: !1006)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1239, file: !14, line: 556, baseType: !1258, size: 64, offset: 448)
!1258 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !1255, line: 59, baseType: !1259)
!1259 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !1048, line: 145, baseType: !1006)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "macro_to_expand", scope: !1114, file: !14, line: 496, baseType: !1261, size: 64, offset: 704)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64)
!1262 = !DISubroutineType(types: !1263)
!1263 = !{!1139, !1120, !1124}
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1114, file: !14, line: 500, baseType: !1265, size: 64, offset: 768)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64)
!1266 = !DISubroutineType(types: !1267)
!1267 = !{!933, !1120, !934, !943, !6, !8, !1268}
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64)
!1269 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !1270, line: 52, baseType: !1271)
!1270 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!1271 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !1272, line: 32, baseType: !1273)
!1272 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stdarg.h", directory: "")
!1273 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 205, baseType: !1274)
!1274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1275, size: 192, elements: !1056)
!1275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, size: 192, elements: !1276)
!1276 = !{!1277, !1278, !1279, !1280}
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !1275, file: !3, baseType: !6, size: 32)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !1275, file: !3, baseType: !6, size: 32, offset: 32)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !1275, file: !3, baseType: !937, size: 64, offset: 64)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !1275, file: !3, baseType: !937, size: 64, offset: 128)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "used_define", scope: !1114, file: !14, line: 506, baseType: !1208, size: 64, offset: 832)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "used_undef", scope: !1114, file: !14, line: 507, baseType: !1208, size: 64, offset: 896)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "before_define", scope: !1114, file: !14, line: 510, baseType: !1284, size: 64, offset: 960)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64)
!1285 = !DISubroutineType(types: !1286)
!1286 = !{null, !1120}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1114, file: !14, line: 513, baseType: !1288, size: 64, offset: 1024)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64)
!1289 = !DISubroutineType(types: !1290)
!1290 = !{null, !1120, !943, !1139}
!1291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1292, size: 128, elements: !1293)
!1292 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!1293 = !{!1294}
!1294 = !DISubrange(count: 4)
!1295 = !DIGlobalVariableExpression(var: !1090, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1296 = !DIGlobalVariableExpression(var: !1080, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1297 = !DIGlobalVariableExpression(var: !1102, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!1298 = !DIGlobalVariableExpression(var: !1104, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!1299 = !DIGlobalVariableExpression(var: !1082, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1300 = !DIGlobalVariableExpression(var: !1078, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1301 = !{i32 2, !"Dwarf Version", i32 4}
!1302 = !{i32 2, !"Debug Info Version", i32 3}
!1303 = !{i32 1, !"wchar_size", i32 4}
!1304 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!1305 = distinct !DISubprogram(name: "vprintf", scope: !1306, file: !1306, line: 39, type: !1307, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !1311)
!1306 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!1307 = !DISubroutineType(types: !1308)
!1308 = !{!934, !1309, !1310}
!1309 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !8)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64)
!1311 = !{!1312, !1313}
!1312 = !DILocalVariable(name: "__fmt", arg: 1, scope: !1305, file: !1306, line: 39, type: !1309)
!1313 = !DILocalVariable(name: "__arg", arg: 2, scope: !1305, file: !1306, line: 39, type: !1310)
!1314 = !DILocation(line: 0, scope: !1305)
!1315 = !DILocation(line: 41, column: 20, scope: !1305)
!1316 = !DILocation(line: 41, column: 10, scope: !1305)
!1317 = !DILocation(line: 41, column: 3, scope: !1305)
!1318 = distinct !DISubprogram(name: "getchar", scope: !1306, file: !1306, line: 47, type: !1319, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !1321)
!1319 = !DISubroutineType(types: !1320)
!1320 = !{!934}
!1321 = !{}
!1322 = !DILocation(line: 49, column: 16, scope: !1318)
!1323 = !DILocation(line: 49, column: 10, scope: !1318)
!1324 = !DILocation(line: 49, column: 3, scope: !1318)
!1325 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !1306, file: !1306, line: 56, type: !1326, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !1328)
!1326 = !DISubroutineType(types: !1327)
!1327 = !{!934, !1021}
!1328 = !{!1329}
!1329 = !DILocalVariable(name: "__fp", arg: 1, scope: !1325, file: !1306, line: 56, type: !1021)
!1330 = !DILocation(line: 0, scope: !1325)
!1331 = !DILocation(line: 58, column: 10, scope: !1325)
!1332 = !DILocation(line: 58, column: 3, scope: !1325)
!1333 = distinct !DISubprogram(name: "getc_unlocked", scope: !1306, file: !1306, line: 66, type: !1326, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !1334)
!1334 = !{!1335}
!1335 = !DILocalVariable(name: "__fp", arg: 1, scope: !1333, file: !1306, line: 66, type: !1021)
!1336 = !DILocation(line: 0, scope: !1333)
!1337 = !DILocation(line: 68, column: 10, scope: !1333)
!1338 = !DILocation(line: 68, column: 3, scope: !1333)
!1339 = distinct !DISubprogram(name: "getchar_unlocked", scope: !1306, file: !1306, line: 73, type: !1319, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !1321)
!1340 = !DILocation(line: 75, column: 10, scope: !1339)
!1341 = !DILocation(line: 75, column: 3, scope: !1339)
!1342 = distinct !DISubprogram(name: "putchar", scope: !1306, file: !1306, line: 82, type: !1343, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !1345)
!1343 = !DISubroutineType(types: !1344)
!1344 = !{!934, !934}
!1345 = !{!1346}
!1346 = !DILocalVariable(name: "__c", arg: 1, scope: !1342, file: !1306, line: 82, type: !934)
!1347 = !DILocation(line: 0, scope: !1342)
!1348 = !DILocation(line: 84, column: 21, scope: !1342)
!1349 = !DILocation(line: 84, column: 10, scope: !1342)
!1350 = !DILocation(line: 84, column: 3, scope: !1342)
!1351 = distinct !DISubprogram(name: "fputc_unlocked", scope: !1306, file: !1306, line: 91, type: !1352, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !1354)
!1352 = !DISubroutineType(types: !1353)
!1353 = !{!934, !934, !1021}
!1354 = !{!1355, !1356}
!1355 = !DILocalVariable(name: "__c", arg: 1, scope: !1351, file: !1306, line: 91, type: !934)
!1356 = !DILocalVariable(name: "__stream", arg: 2, scope: !1351, file: !1306, line: 91, type: !1021)
!1357 = !DILocation(line: 0, scope: !1351)
!1358 = !DILocation(line: 93, column: 10, scope: !1351)
!1359 = !DILocation(line: 93, column: 3, scope: !1351)
!1360 = distinct !DISubprogram(name: "putc_unlocked", scope: !1306, file: !1306, line: 101, type: !1352, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !1361)
!1361 = !{!1362, !1363}
!1362 = !DILocalVariable(name: "__c", arg: 1, scope: !1360, file: !1306, line: 101, type: !934)
!1363 = !DILocalVariable(name: "__stream", arg: 2, scope: !1360, file: !1306, line: 101, type: !1021)
!1364 = !DILocation(line: 0, scope: !1360)
!1365 = !DILocation(line: 103, column: 10, scope: !1360)
!1366 = !DILocation(line: 103, column: 3, scope: !1360)
!1367 = distinct !DISubprogram(name: "putchar_unlocked", scope: !1306, file: !1306, line: 108, type: !1343, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !1368)
!1368 = !{!1369}
!1369 = !DILocalVariable(name: "__c", arg: 1, scope: !1367, file: !1306, line: 108, type: !934)
!1370 = !DILocation(line: 0, scope: !1367)
!1371 = !DILocation(line: 110, column: 10, scope: !1367)
!1372 = !DILocation(line: 110, column: 3, scope: !1367)
!1373 = distinct !DISubprogram(name: "getline", scope: !1306, file: !1306, line: 118, type: !1374, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !1378)
!1374 = !DISubroutineType(types: !1375)
!1375 = !{!1376, !935, !1377, !1021}
!1376 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !1048, line: 193, baseType: !1049)
!1377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1378 = !{!1379, !1380, !1381}
!1379 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !1373, file: !1306, line: 118, type: !935)
!1380 = !DILocalVariable(name: "__n", arg: 2, scope: !1373, file: !1306, line: 118, type: !1377)
!1381 = !DILocalVariable(name: "__stream", arg: 3, scope: !1373, file: !1306, line: 118, type: !1021)
!1382 = !DILocation(line: 0, scope: !1373)
!1383 = !DILocation(line: 120, column: 10, scope: !1373)
!1384 = !DILocation(line: 120, column: 3, scope: !1373)
!1385 = distinct !DISubprogram(name: "feof_unlocked", scope: !1306, file: !1306, line: 128, type: !1326, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !1386)
!1386 = !{!1387}
!1387 = !DILocalVariable(name: "__stream", arg: 1, scope: !1385, file: !1306, line: 128, type: !1021)
!1388 = !DILocation(line: 0, scope: !1385)
!1389 = !DILocation(line: 130, column: 10, scope: !1385)
!1390 = !DILocation(line: 130, column: 3, scope: !1385)
!1391 = distinct !DISubprogram(name: "ferror_unlocked", scope: !1306, file: !1306, line: 135, type: !1326, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !1392)
!1392 = !{!1393}
!1393 = !DILocalVariable(name: "__stream", arg: 1, scope: !1391, file: !1306, line: 135, type: !1021)
!1394 = !DILocation(line: 0, scope: !1391)
!1395 = !DILocation(line: 137, column: 10, scope: !1391)
!1396 = !DILocation(line: 137, column: 3, scope: !1391)
!1397 = distinct !DISubprogram(name: "tolower", scope: !1398, file: !1398, line: 207, type: !1343, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !1399)
!1398 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!1399 = !{!1400}
!1400 = !DILocalVariable(name: "__c", arg: 1, scope: !1397, file: !1398, line: 207, type: !934)
!1401 = !DILocation(line: 0, scope: !1397)
!1402 = !DILocation(line: 209, column: 22, scope: !1397)
!1403 = !DILocation(line: 209, column: 39, scope: !1397)
!1404 = !DILocation(line: 209, column: 38, scope: !1397)
!1405 = !DILocation(line: 209, column: 37, scope: !1397)
!1406 = !DILocation(line: 209, column: 10, scope: !1397)
!1407 = !DILocation(line: 209, column: 3, scope: !1397)
!1408 = distinct !DISubprogram(name: "toupper", scope: !1398, file: !1398, line: 213, type: !1343, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !1409)
!1409 = !{!1410}
!1410 = !DILocalVariable(name: "__c", arg: 1, scope: !1408, file: !1398, line: 213, type: !934)
!1411 = !DILocation(line: 0, scope: !1408)
!1412 = !DILocation(line: 215, column: 22, scope: !1408)
!1413 = !DILocation(line: 215, column: 39, scope: !1408)
!1414 = !DILocation(line: 215, column: 38, scope: !1408)
!1415 = !DILocation(line: 215, column: 37, scope: !1408)
!1416 = !DILocation(line: 215, column: 10, scope: !1408)
!1417 = !DILocation(line: 215, column: 3, scope: !1408)
!1418 = distinct !DISubprogram(name: "atoi", scope: !1419, file: !1419, line: 361, type: !1420, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !1422)
!1419 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!1420 = !DISubroutineType(types: !1421)
!1421 = !{!934, !8}
!1422 = !{!1423}
!1423 = !DILocalVariable(name: "__nptr", arg: 1, scope: !1418, file: !1419, line: 361, type: !8)
!1424 = !DILocation(line: 0, scope: !1418)
!1425 = !DILocation(line: 363, column: 16, scope: !1418)
!1426 = !DILocation(line: 363, column: 10, scope: !1418)
!1427 = !DILocation(line: 363, column: 3, scope: !1418)
!1428 = distinct !DISubprogram(name: "atol", scope: !1419, file: !1419, line: 366, type: !1429, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !1431)
!1429 = !DISubroutineType(types: !1430)
!1430 = !{!1049, !8}
!1431 = !{!1432}
!1432 = !DILocalVariable(name: "__nptr", arg: 1, scope: !1428, file: !1419, line: 366, type: !8)
!1433 = !DILocation(line: 0, scope: !1428)
!1434 = !DILocation(line: 368, column: 10, scope: !1428)
!1435 = !DILocation(line: 368, column: 3, scope: !1428)
!1436 = distinct !DISubprogram(name: "atoll", scope: !1419, file: !1419, line: 373, type: !1437, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !1440)
!1437 = !DISubroutineType(types: !1438)
!1438 = !{!1439, !8}
!1439 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!1440 = !{!1441}
!1441 = !DILocalVariable(name: "__nptr", arg: 1, scope: !1436, file: !1419, line: 373, type: !8)
!1442 = !DILocation(line: 0, scope: !1436)
!1443 = !DILocation(line: 375, column: 10, scope: !1436)
!1444 = !DILocation(line: 375, column: 3, scope: !1436)
!1445 = distinct !DISubprogram(name: "bsearch", scope: !1446, file: !1446, line: 20, type: !1447, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !1455)
!1446 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!1447 = !DISubroutineType(types: !1448)
!1448 = !{!937, !1449, !1449, !1004, !1004, !1451}
!1449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1450, size: 64)
!1450 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1451 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !1419, line: 808, baseType: !1452)
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1453, size: 64)
!1453 = !DISubroutineType(types: !1454)
!1454 = !{!934, !1449, !1449}
!1455 = !{!1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465}
!1456 = !DILocalVariable(name: "__key", arg: 1, scope: !1445, file: !1446, line: 20, type: !1449)
!1457 = !DILocalVariable(name: "__base", arg: 2, scope: !1445, file: !1446, line: 20, type: !1449)
!1458 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !1445, file: !1446, line: 20, type: !1004)
!1459 = !DILocalVariable(name: "__size", arg: 4, scope: !1445, file: !1446, line: 20, type: !1004)
!1460 = !DILocalVariable(name: "__compar", arg: 5, scope: !1445, file: !1446, line: 21, type: !1451)
!1461 = !DILocalVariable(name: "__l", scope: !1445, file: !1446, line: 23, type: !1004)
!1462 = !DILocalVariable(name: "__u", scope: !1445, file: !1446, line: 23, type: !1004)
!1463 = !DILocalVariable(name: "__idx", scope: !1445, file: !1446, line: 23, type: !1004)
!1464 = !DILocalVariable(name: "__p", scope: !1445, file: !1446, line: 24, type: !1449)
!1465 = !DILocalVariable(name: "__comparison", scope: !1445, file: !1446, line: 25, type: !934)
!1466 = !DILocation(line: 0, scope: !1445)
!1467 = !DILocation(line: 29, column: 3, scope: !1445)
!1468 = !DILocation(line: 27, column: 7, scope: !1445)
!1469 = !DILocation(line: 29, column: 14, scope: !1445)
!1470 = !DILocation(line: 31, column: 20, scope: !1471)
!1471 = distinct !DILexicalBlock(scope: !1445, file: !1446, line: 30, column: 5)
!1472 = !DILocation(line: 31, column: 27, scope: !1471)
!1473 = !DILocation(line: 32, column: 56, scope: !1471)
!1474 = !DILocation(line: 32, column: 47, scope: !1471)
!1475 = !DILocation(line: 33, column: 22, scope: !1471)
!1476 = !DILocation(line: 34, column: 24, scope: !1477)
!1477 = distinct !DILexicalBlock(scope: !1471, file: !1446, line: 34, column: 11)
!1478 = !DILocation(line: 34, column: 11, scope: !1471)
!1479 = !DILocation(line: 36, column: 29, scope: !1480)
!1480 = distinct !DILexicalBlock(scope: !1477, file: !1446, line: 36, column: 16)
!1481 = !DILocation(line: 36, column: 16, scope: !1477)
!1482 = !DILocation(line: 37, column: 14, scope: !1480)
!1483 = distinct !{!1483, !1467, !1484}
!1484 = !DILocation(line: 40, column: 5, scope: !1445)
!1485 = !DILocation(line: 43, column: 1, scope: !1445)
!1486 = distinct !DISubprogram(name: "atof", scope: !1487, file: !1487, line: 25, type: !1488, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !1491)
!1487 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!1488 = !DISubroutineType(types: !1489)
!1489 = !{!1490, !8}
!1490 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!1491 = !{!1492}
!1492 = !DILocalVariable(name: "__nptr", arg: 1, scope: !1486, file: !1487, line: 25, type: !8)
!1493 = !DILocation(line: 0, scope: !1486)
!1494 = !DILocation(line: 27, column: 10, scope: !1486)
!1495 = !DILocation(line: 27, column: 3, scope: !1486)
!1496 = distinct !DISubprogram(name: "strtoimax", scope: !1497, file: !1497, line: 324, type: !1498, scopeLine: 326, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !1504)
!1497 = !DIFile(filename: "/usr/include/inttypes.h", directory: "")
!1498 = !DISubroutineType(types: !1499)
!1499 = !{!1500, !1309, !1503, !934}
!1500 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !1501, line: 101, baseType: !1502)
!1501 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!1502 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !1048, line: 72, baseType: !1049)
!1503 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !935)
!1504 = !{!1505, !1506, !1507}
!1505 = !DILocalVariable(name: "nptr", arg: 1, scope: !1496, file: !1497, line: 324, type: !1309)
!1506 = !DILocalVariable(name: "endptr", arg: 2, scope: !1496, file: !1497, line: 324, type: !1503)
!1507 = !DILocalVariable(name: "base", arg: 3, scope: !1496, file: !1497, line: 324, type: !934)
!1508 = !DILocation(line: 0, scope: !1496)
!1509 = !DILocation(line: 327, column: 10, scope: !1496)
!1510 = !DILocation(line: 327, column: 3, scope: !1496)
!1511 = distinct !DISubprogram(name: "strtoumax", scope: !1497, file: !1497, line: 336, type: !1512, scopeLine: 338, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !1516)
!1512 = !DISubroutineType(types: !1513)
!1513 = !{!1514, !1309, !1503, !934}
!1514 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !1501, line: 102, baseType: !1515)
!1515 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !1048, line: 73, baseType: !1006)
!1516 = !{!1517, !1518, !1519}
!1517 = !DILocalVariable(name: "nptr", arg: 1, scope: !1511, file: !1497, line: 336, type: !1309)
!1518 = !DILocalVariable(name: "endptr", arg: 2, scope: !1511, file: !1497, line: 336, type: !1503)
!1519 = !DILocalVariable(name: "base", arg: 3, scope: !1511, file: !1497, line: 336, type: !934)
!1520 = !DILocation(line: 0, scope: !1511)
!1521 = !DILocation(line: 339, column: 10, scope: !1511)
!1522 = !DILocation(line: 339, column: 3, scope: !1511)
!1523 = distinct !DISubprogram(name: "wcstoimax", scope: !1497, file: !1497, line: 348, type: !1524, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !1533)
!1524 = !DISubroutineType(types: !1525)
!1525 = !{!1500, !1526, !1530, !934}
!1526 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1527)
!1527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1528, size: 64)
!1528 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1529)
!1529 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gwchar_t", file: !1497, line: 34, baseType: !934)
!1530 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1531)
!1531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1532, size: 64)
!1532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1529, size: 64)
!1533 = !{!1534, !1535, !1536}
!1534 = !DILocalVariable(name: "nptr", arg: 1, scope: !1523, file: !1497, line: 348, type: !1526)
!1535 = !DILocalVariable(name: "endptr", arg: 2, scope: !1523, file: !1497, line: 348, type: !1530)
!1536 = !DILocalVariable(name: "base", arg: 3, scope: !1523, file: !1497, line: 348, type: !934)
!1537 = !DILocation(line: 0, scope: !1523)
!1538 = !DILocation(line: 351, column: 10, scope: !1523)
!1539 = !DILocation(line: 351, column: 3, scope: !1523)
!1540 = distinct !DISubprogram(name: "wcstoumax", scope: !1497, file: !1497, line: 362, type: !1541, scopeLine: 364, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !1543)
!1541 = !DISubroutineType(types: !1542)
!1542 = !{!1514, !1526, !1530, !934}
!1543 = !{!1544, !1545, !1546}
!1544 = !DILocalVariable(name: "nptr", arg: 1, scope: !1540, file: !1497, line: 362, type: !1526)
!1545 = !DILocalVariable(name: "endptr", arg: 2, scope: !1540, file: !1497, line: 362, type: !1530)
!1546 = !DILocalVariable(name: "base", arg: 3, scope: !1540, file: !1497, line: 362, type: !934)
!1547 = !DILocation(line: 0, scope: !1540)
!1548 = !DILocation(line: 365, column: 10, scope: !1540)
!1549 = !DILocation(line: 365, column: 3, scope: !1540)
!1550 = distinct !DISubprogram(name: "stat", scope: !1551, file: !1551, line: 453, type: !1552, scopeLine: 454, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !1589)
!1551 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "")
!1552 = !DISubroutineType(types: !1553)
!1553 = !{!934, !8, !1554}
!1554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1555, size: 64)
!1555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1556, line: 46, size: 1152, elements: !1557)
!1556 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!1557 = !{!1558, !1559, !1560, !1562, !1564, !1566, !1568, !1569, !1570, !1571, !1573, !1575, !1583, !1584, !1585}
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1555, file: !1556, line: 48, baseType: !1259, size: 64)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1555, file: !1556, line: 53, baseType: !1256, size: 64, offset: 64)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1555, file: !1556, line: 61, baseType: !1561, size: 64, offset: 128)
!1561 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !1048, line: 151, baseType: !1006)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1555, file: !1556, line: 62, baseType: !1563, size: 32, offset: 192)
!1563 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !1048, line: 150, baseType: !6)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1555, file: !1556, line: 64, baseType: !1565, size: 32, offset: 224)
!1565 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !1048, line: 146, baseType: !6)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1555, file: !1556, line: 65, baseType: !1567, size: 32, offset: 256)
!1567 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !1048, line: 147, baseType: !6)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1555, file: !1556, line: 67, baseType: !934, size: 32, offset: 288)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1555, file: !1556, line: 69, baseType: !1259, size: 64, offset: 320)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1555, file: !1556, line: 74, baseType: !1047, size: 64, offset: 384)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1555, file: !1556, line: 78, baseType: !1572, size: 64, offset: 448)
!1572 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !1048, line: 174, baseType: !1049)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1555, file: !1556, line: 80, baseType: !1574, size: 64, offset: 512)
!1574 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !1048, line: 179, baseType: !1049)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1555, file: !1556, line: 91, baseType: !1576, size: 128, offset: 576)
!1576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1577, line: 10, size: 128, elements: !1578)
!1577 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!1578 = !{!1579, !1581}
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1576, file: !1577, line: 12, baseType: !1580, size: 64)
!1580 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !1048, line: 160, baseType: !1049)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1576, file: !1577, line: 16, baseType: !1582, size: 64, offset: 64)
!1582 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !1048, line: 196, baseType: !1049)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1555, file: !1556, line: 92, baseType: !1576, size: 128, offset: 704)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1555, file: !1556, line: 93, baseType: !1576, size: 128, offset: 832)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1555, file: !1556, line: 106, baseType: !1586, size: 192, offset: 960)
!1586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1582, size: 192, elements: !1587)
!1587 = !{!1588}
!1588 = !DISubrange(count: 3)
!1589 = !{!1590, !1591}
!1590 = !DILocalVariable(name: "__path", arg: 1, scope: !1550, file: !1551, line: 453, type: !8)
!1591 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !1550, file: !1551, line: 453, type: !1554)
!1592 = !DILocation(line: 0, scope: !1550)
!1593 = !DILocation(line: 455, column: 10, scope: !1550)
!1594 = !DILocation(line: 455, column: 3, scope: !1550)
!1595 = distinct !DISubprogram(name: "lstat", scope: !1551, file: !1551, line: 460, type: !1552, scopeLine: 461, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !1596)
!1596 = !{!1597, !1598}
!1597 = !DILocalVariable(name: "__path", arg: 1, scope: !1595, file: !1551, line: 460, type: !8)
!1598 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !1595, file: !1551, line: 460, type: !1554)
!1599 = !DILocation(line: 0, scope: !1595)
!1600 = !DILocation(line: 462, column: 10, scope: !1595)
!1601 = !DILocation(line: 462, column: 3, scope: !1595)
!1602 = distinct !DISubprogram(name: "fstat", scope: !1551, file: !1551, line: 467, type: !1603, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !1605)
!1603 = !DISubroutineType(types: !1604)
!1604 = !{!934, !934, !1554}
!1605 = !{!1606, !1607}
!1606 = !DILocalVariable(name: "__fd", arg: 1, scope: !1602, file: !1551, line: 467, type: !934)
!1607 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !1602, file: !1551, line: 467, type: !1554)
!1608 = !DILocation(line: 0, scope: !1602)
!1609 = !DILocation(line: 469, column: 10, scope: !1602)
!1610 = !DILocation(line: 469, column: 3, scope: !1602)
!1611 = distinct !DISubprogram(name: "fstatat", scope: !1551, file: !1551, line: 474, type: !1612, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !1614)
!1612 = !DISubroutineType(types: !1613)
!1613 = !{!934, !934, !8, !1554, !934}
!1614 = !{!1615, !1616, !1617, !1618}
!1615 = !DILocalVariable(name: "__fd", arg: 1, scope: !1611, file: !1551, line: 474, type: !934)
!1616 = !DILocalVariable(name: "__filename", arg: 2, scope: !1611, file: !1551, line: 474, type: !8)
!1617 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !1611, file: !1551, line: 474, type: !1554)
!1618 = !DILocalVariable(name: "__flag", arg: 4, scope: !1611, file: !1551, line: 474, type: !934)
!1619 = !DILocation(line: 0, scope: !1611)
!1620 = !DILocation(line: 477, column: 10, scope: !1611)
!1621 = !DILocation(line: 477, column: 3, scope: !1611)
!1622 = distinct !DISubprogram(name: "mknod", scope: !1551, file: !1551, line: 483, type: !1623, scopeLine: 484, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !1625)
!1623 = !DISubroutineType(types: !1624)
!1624 = !{!934, !8, !1563, !1259}
!1625 = !{!1626, !1627, !1628}
!1626 = !DILocalVariable(name: "__path", arg: 1, scope: !1622, file: !1551, line: 483, type: !8)
!1627 = !DILocalVariable(name: "__mode", arg: 2, scope: !1622, file: !1551, line: 483, type: !1563)
!1628 = !DILocalVariable(name: "__dev", arg: 3, scope: !1622, file: !1551, line: 483, type: !1259)
!1629 = !DILocation(line: 0, scope: !1622)
!1630 = !DILocation(line: 485, column: 10, scope: !1622)
!1631 = !DILocation(line: 485, column: 3, scope: !1622)
!1632 = distinct !DISubprogram(name: "mknodat", scope: !1551, file: !1551, line: 491, type: !1633, scopeLine: 493, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !1635)
!1633 = !DISubroutineType(types: !1634)
!1634 = !{!934, !934, !8, !1563, !1259}
!1635 = !{!1636, !1637, !1638, !1639}
!1636 = !DILocalVariable(name: "__fd", arg: 1, scope: !1632, file: !1551, line: 491, type: !934)
!1637 = !DILocalVariable(name: "__path", arg: 2, scope: !1632, file: !1551, line: 491, type: !8)
!1638 = !DILocalVariable(name: "__mode", arg: 3, scope: !1632, file: !1551, line: 491, type: !1563)
!1639 = !DILocalVariable(name: "__dev", arg: 4, scope: !1632, file: !1551, line: 491, type: !1259)
!1640 = !DILocation(line: 0, scope: !1632)
!1641 = !DILocation(line: 494, column: 10, scope: !1632)
!1642 = !DILocation(line: 494, column: 3, scope: !1632)
!1643 = distinct !DISubprogram(name: "stat64", scope: !1551, file: !1551, line: 502, type: !1644, scopeLine: 503, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !1666)
!1644 = !DISubroutineType(types: !1645)
!1645 = !{!934, !8, !1646}
!1646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1647, size: 64)
!1647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !1556, line: 119, size: 1152, elements: !1648)
!1648 = !{!1649, !1650, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1662, !1663, !1664, !1665}
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1647, file: !1556, line: 121, baseType: !1259, size: 64)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1647, file: !1556, line: 123, baseType: !1651, size: 64, offset: 64)
!1651 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !1048, line: 149, baseType: !1006)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1647, file: !1556, line: 124, baseType: !1561, size: 64, offset: 128)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1647, file: !1556, line: 125, baseType: !1563, size: 32, offset: 192)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1647, file: !1556, line: 132, baseType: !1565, size: 32, offset: 224)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1647, file: !1556, line: 133, baseType: !1567, size: 32, offset: 256)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1647, file: !1556, line: 135, baseType: !934, size: 32, offset: 288)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1647, file: !1556, line: 136, baseType: !1259, size: 64, offset: 320)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1647, file: !1556, line: 137, baseType: !1047, size: 64, offset: 384)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1647, file: !1556, line: 143, baseType: !1572, size: 64, offset: 448)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1647, file: !1556, line: 144, baseType: !1661, size: 64, offset: 512)
!1661 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !1048, line: 180, baseType: !1049)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1647, file: !1556, line: 152, baseType: !1576, size: 128, offset: 576)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1647, file: !1556, line: 153, baseType: !1576, size: 128, offset: 704)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1647, file: !1556, line: 154, baseType: !1576, size: 128, offset: 832)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1647, file: !1556, line: 164, baseType: !1586, size: 192, offset: 960)
!1666 = !{!1667, !1668}
!1667 = !DILocalVariable(name: "__path", arg: 1, scope: !1643, file: !1551, line: 502, type: !8)
!1668 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !1643, file: !1551, line: 502, type: !1646)
!1669 = !DILocation(line: 0, scope: !1643)
!1670 = !DILocation(line: 504, column: 10, scope: !1643)
!1671 = !DILocation(line: 504, column: 3, scope: !1643)
!1672 = distinct !DISubprogram(name: "lstat64", scope: !1551, file: !1551, line: 509, type: !1644, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !1673)
!1673 = !{!1674, !1675}
!1674 = !DILocalVariable(name: "__path", arg: 1, scope: !1672, file: !1551, line: 509, type: !8)
!1675 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !1672, file: !1551, line: 509, type: !1646)
!1676 = !DILocation(line: 0, scope: !1672)
!1677 = !DILocation(line: 511, column: 10, scope: !1672)
!1678 = !DILocation(line: 511, column: 3, scope: !1672)
!1679 = distinct !DISubprogram(name: "fstat64", scope: !1551, file: !1551, line: 516, type: !1680, scopeLine: 517, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !1682)
!1680 = !DISubroutineType(types: !1681)
!1681 = !{!934, !934, !1646}
!1682 = !{!1683, !1684}
!1683 = !DILocalVariable(name: "__fd", arg: 1, scope: !1679, file: !1551, line: 516, type: !934)
!1684 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !1679, file: !1551, line: 516, type: !1646)
!1685 = !DILocation(line: 0, scope: !1679)
!1686 = !DILocation(line: 518, column: 10, scope: !1679)
!1687 = !DILocation(line: 518, column: 3, scope: !1679)
!1688 = distinct !DISubprogram(name: "fstatat64", scope: !1551, file: !1551, line: 523, type: !1689, scopeLine: 525, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !1691)
!1689 = !DISubroutineType(types: !1690)
!1690 = !{!934, !934, !8, !1646, !934}
!1691 = !{!1692, !1693, !1694, !1695}
!1692 = !DILocalVariable(name: "__fd", arg: 1, scope: !1688, file: !1551, line: 523, type: !934)
!1693 = !DILocalVariable(name: "__filename", arg: 2, scope: !1688, file: !1551, line: 523, type: !8)
!1694 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !1688, file: !1551, line: 523, type: !1646)
!1695 = !DILocalVariable(name: "__flag", arg: 4, scope: !1688, file: !1551, line: 523, type: !934)
!1696 = !DILocation(line: 0, scope: !1688)
!1697 = !DILocation(line: 526, column: 10, scope: !1688)
!1698 = !DILocation(line: 526, column: 3, scope: !1688)
!1699 = distinct !DISubprogram(name: "c_common_missing_argument", scope: !3, file: !3, line: 142, type: !1700, scopeLine: 143, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !1702)
!1700 = !DISubroutineType(types: !1701)
!1701 = !{!933, !8, !1004}
!1702 = !{!1703, !1704}
!1703 = !DILocalVariable(name: "opt", arg: 1, scope: !1699, file: !3, line: 142, type: !8)
!1704 = !DILocalVariable(name: "code", arg: 2, scope: !1699, file: !3, line: 142, type: !1004)
!1705 = !DILocation(line: 0, scope: !1699)
!1706 = !DILocation(line: 144, column: 3, scope: !1699)
!1707 = !DILocation(line: 151, column: 7, scope: !1708)
!1708 = distinct !DILexicalBlock(scope: !1699, file: !3, line: 145, column: 5)
!1709 = !DILocation(line: 152, column: 7, scope: !1708)
!1710 = !DILocation(line: 155, column: 7, scope: !1708)
!1711 = !DILocation(line: 156, column: 7, scope: !1708)
!1712 = !DILocation(line: 160, column: 7, scope: !1708)
!1713 = !DILocation(line: 161, column: 7, scope: !1708)
!1714 = !DILocation(line: 169, column: 7, scope: !1708)
!1715 = !DILocation(line: 170, column: 7, scope: !1708)
!1716 = !DILocation(line: 178, column: 7, scope: !1708)
!1717 = !DILocation(line: 179, column: 7, scope: !1708)
!1718 = !DILocation(line: 183, column: 7, scope: !1708)
!1719 = !DILocation(line: 184, column: 7, scope: !1708)
!1720 = !DILocation(line: 188, column: 1, scope: !1699)
!1721 = !DILocation(line: 0, scope: !2)
!1722 = !DILocation(line: 209, column: 7, scope: !1723)
!1723 = distinct !DILexicalBlock(scope: !2, file: !3, line: 209, column: 7)
!1724 = !DILocation(line: 209, column: 7, scope: !2)
!1725 = !DILocation(line: 213, column: 7, scope: !1726)
!1726 = distinct !DILexicalBlock(scope: !1723, file: !3, line: 210, column: 5)
!1727 = !DILocation(line: 213, column: 42, scope: !1726)
!1728 = !DILocation(line: 216, column: 7, scope: !1726)
!1729 = !DILocation(line: 216, column: 45, scope: !1726)
!1730 = !DILocation(line: 217, column: 5, scope: !1726)
!1731 = !DILocation(line: 219, column: 33, scope: !2)
!1732 = !DILocation(line: 220, column: 5, scope: !2)
!1733 = !DILocation(line: 220, column: 17, scope: !2)
!1734 = !DILocation(line: 219, column: 14, scope: !2)
!1735 = !DILocation(line: 219, column: 12, scope: !2)
!1736 = !DILocation(line: 221, column: 8, scope: !2)
!1737 = !DILocation(line: 222, column: 7, scope: !2)
!1738 = !DILocation(line: 222, column: 13, scope: !2)
!1739 = !DILocation(line: 224, column: 31, scope: !2)
!1740 = !DILocation(line: 224, column: 14, scope: !2)
!1741 = !DILocation(line: 224, column: 12, scope: !2)
!1742 = !DILocation(line: 225, column: 13, scope: !2)
!1743 = !DILocation(line: 225, column: 30, scope: !2)
!1744 = !DILocation(line: 226, column: 20, scope: !2)
!1745 = !DILocation(line: 226, column: 13, scope: !2)
!1746 = !DILocation(line: 226, column: 18, scope: !2)
!1747 = !DILocation(line: 230, column: 13, scope: !2)
!1748 = !DILocation(line: 230, column: 26, scope: !2)
!1749 = !DILocation(line: 232, column: 21, scope: !2)
!1750 = !DILocation(line: 232, column: 19, scope: !2)
!1751 = !DILocation(line: 233, column: 22, scope: !2)
!1752 = !DILocation(line: 234, column: 22, scope: !2)
!1753 = !DILocation(line: 235, column: 27, scope: !2)
!1754 = !DILocation(line: 238, column: 23, scope: !2)
!1755 = !DILocation(line: 240, column: 19, scope: !2)
!1756 = !DILocation(line: 240, column: 17, scope: !2)
!1757 = !DILocation(line: 242, column: 23, scope: !2)
!1758 = !DILocation(line: 242, column: 12, scope: !2)
!1759 = !DILocation(line: 244, column: 18, scope: !1760)
!1760 = distinct !DILexicalBlock(scope: !2, file: !3, line: 244, column: 7)
!1761 = !DILocation(line: 244, column: 7, scope: !2)
!1762 = !DILocation(line: 248, column: 7, scope: !1763)
!1763 = distinct !DILexicalBlock(scope: !1764, file: !3, line: 248, column: 7)
!1764 = distinct !DILexicalBlock(scope: !1760, file: !3, line: 245, column: 5)
!1765 = !DILocation(line: 0, scope: !1763)
!1766 = !DILocation(line: 248, column: 21, scope: !1767)
!1767 = distinct !DILexicalBlock(scope: !1763, file: !3, line: 248, column: 7)
!1768 = !DILocation(line: 249, column: 16, scope: !1769)
!1769 = distinct !DILexicalBlock(scope: !1767, file: !3, line: 249, column: 6)
!1770 = !DILocation(line: 249, column: 8, scope: !1769)
!1771 = !DILocation(line: 249, column: 6, scope: !1767)
!1772 = !DILocation(line: 251, column: 13, scope: !1773)
!1773 = distinct !DILexicalBlock(scope: !1769, file: !3, line: 250, column: 4)
!1774 = !DILocation(line: 252, column: 6, scope: !1773)
!1775 = !DILocation(line: 248, column: 30, scope: !1767)
!1776 = !DILocation(line: 248, column: 7, scope: !1767)
!1777 = distinct !{!1777, !1762, !1778}
!1778 = !DILocation(line: 253, column: 4, scope: !1763)
!1779 = !DILocation(line: 256, column: 3, scope: !2)
!1780 = distinct !DISubprogram(name: "c_common_handle_option", scope: !3, file: !3, line: 264, type: !1781, scopeLine: 265, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !1783)
!1781 = !DISubroutineType(types: !1782)
!1782 = !{!934, !1004, !8, !934}
!1783 = !{!1784, !1785, !1786, !1787, !1801, !1802, !1803}
!1784 = !DILocalVariable(name: "scode", arg: 1, scope: !1780, file: !3, line: 264, type: !1004)
!1785 = !DILocalVariable(name: "arg", arg: 2, scope: !1780, file: !3, line: 264, type: !8)
!1786 = !DILocalVariable(name: "value", arg: 3, scope: !1780, file: !3, line: 264, type: !934)
!1787 = !DILocalVariable(name: "option", scope: !1780, file: !3, line: 266, type: !1788)
!1788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1789, size: 64)
!1789 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1790)
!1790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cl_option", file: !901, line: 43, size: 384, elements: !1791)
!1791 = !{!1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800}
!1792 = !DIDerivedType(tag: DW_TAG_member, name: "opt_text", scope: !1790, file: !901, line: 45, baseType: !8, size: 64)
!1793 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1790, file: !901, line: 46, baseType: !8, size: 64, offset: 64)
!1794 = !DIDerivedType(tag: DW_TAG_member, name: "back_chain", scope: !1790, file: !901, line: 47, baseType: !1051, size: 16, offset: 128)
!1795 = !DIDerivedType(tag: DW_TAG_member, name: "opt_len", scope: !1790, file: !901, line: 48, baseType: !933, size: 8, offset: 144)
!1796 = !DIDerivedType(tag: DW_TAG_member, name: "neg_index", scope: !1790, file: !901, line: 49, baseType: !934, size: 32, offset: 160)
!1797 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1790, file: !901, line: 50, baseType: !6, size: 32, offset: 192)
!1798 = !DIDerivedType(tag: DW_TAG_member, name: "flag_var", scope: !1790, file: !901, line: 51, baseType: !937, size: 64, offset: 256)
!1799 = !DIDerivedType(tag: DW_TAG_member, name: "var_type", scope: !1790, file: !901, line: 52, baseType: !900, size: 32, offset: 320)
!1800 = !DIDerivedType(tag: DW_TAG_member, name: "var_value", scope: !1790, file: !901, line: 53, baseType: !934, size: 32, offset: 352)
!1801 = !DILocalVariable(name: "code", scope: !1780, file: !3, line: 267, type: !26)
!1802 = !DILocalVariable(name: "result", scope: !1780, file: !3, line: 268, type: !934)
!1803 = !DILocalVariable(name: "preprocessing_asm_p", scope: !1780, file: !3, line: 272, type: !933)
!1804 = !DILocation(line: 0, scope: !1780)
!1805 = !DILocation(line: 267, column: 24, scope: !1780)
!1806 = !DILocation(line: 272, column: 48, scope: !1780)
!1807 = !DILocation(line: 272, column: 31, scope: !1780)
!1808 = !DILocation(line: 272, column: 59, scope: !1780)
!1809 = !DILocation(line: 272, column: 64, scope: !1780)
!1810 = !DILocation(line: 274, column: 3, scope: !1780)
!1811 = !DILocation(line: 277, column: 11, scope: !1812)
!1812 = distinct !DILexicalBlock(scope: !1813, file: !3, line: 277, column: 11)
!1813 = distinct !DILexicalBlock(scope: !1780, file: !3, line: 275, column: 5)
!1814 = !DILocation(line: 277, column: 28, scope: !1812)
!1815 = !DILocation(line: 277, column: 34, scope: !1812)
!1816 = !DILocation(line: 277, column: 11, scope: !1813)
!1817 = !DILocation(line: 279, column: 17, scope: !1818)
!1818 = distinct !DILexicalBlock(scope: !1819, file: !3, line: 279, column: 8)
!1819 = distinct !DILexicalBlock(scope: !1812, file: !3, line: 278, column: 2)
!1820 = !DILocation(line: 279, column: 23, scope: !1818)
!1821 = !DILocation(line: 280, column: 8, scope: !1818)
!1822 = !DILocation(line: 280, column: 22, scope: !1818)
!1823 = !DILocation(line: 280, column: 13, scope: !1818)
!1824 = !DILocation(line: 279, column: 8, scope: !1819)
!1825 = !DILocation(line: 288, column: 16, scope: !1813)
!1826 = !DILocation(line: 289, column: 7, scope: !1813)
!1827 = !DILocation(line: 292, column: 7, scope: !1813)
!1828 = !DILocation(line: 293, column: 7, scope: !1813)
!1829 = !DILocation(line: 296, column: 7, scope: !1813)
!1830 = !DILocation(line: 296, column: 17, scope: !1813)
!1831 = !DILocation(line: 296, column: 34, scope: !1813)
!1832 = !DILocation(line: 297, column: 7, scope: !1813)
!1833 = !DILocation(line: 300, column: 7, scope: !1813)
!1834 = !DILocation(line: 300, column: 17, scope: !1813)
!1835 = !DILocation(line: 300, column: 34, scope: !1813)
!1836 = !DILocation(line: 301, column: 17, scope: !1813)
!1837 = !DILocation(line: 301, column: 47, scope: !1813)
!1838 = !DILocation(line: 302, column: 7, scope: !1813)
!1839 = !DILocation(line: 305, column: 7, scope: !1813)
!1840 = !DILocation(line: 306, column: 7, scope: !1813)
!1841 = !DILocation(line: 309, column: 28, scope: !1813)
!1842 = !DILocation(line: 310, column: 7, scope: !1813)
!1843 = !DILocation(line: 313, column: 7, scope: !1813)
!1844 = !DILocation(line: 313, column: 17, scope: !1813)
!1845 = !DILocation(line: 313, column: 37, scope: !1813)
!1846 = !DILocation(line: 314, column: 7, scope: !1813)
!1847 = !DILocation(line: 321, column: 11, scope: !1848)
!1848 = distinct !DILexicalBlock(scope: !1813, file: !3, line: 321, column: 11)
!1849 = !DILocation(line: 321, column: 11, scope: !1813)
!1850 = !DILocation(line: 322, column: 12, scope: !1848)
!1851 = !DILocation(line: 322, column: 2, scope: !1848)
!1852 = !DILocation(line: 325, column: 8, scope: !1853)
!1853 = distinct !DILexicalBlock(scope: !1854, file: !3, line: 325, column: 8)
!1854 = distinct !DILexicalBlock(scope: !1848, file: !3, line: 324, column: 2)
!1855 = !DILocation(line: 325, column: 8, scope: !1854)
!1856 = !DILocation(line: 326, column: 6, scope: !1853)
!1857 = !DILocation(line: 327, column: 22, scope: !1854)
!1858 = !DILocation(line: 328, column: 4, scope: !1854)
!1859 = !DILocation(line: 329, column: 12, scope: !1854)
!1860 = !DILocation(line: 329, column: 4, scope: !1854)
!1861 = !DILocation(line: 339, column: 36, scope: !1813)
!1862 = !DILocation(line: 339, column: 31, scope: !1813)
!1863 = !DILocation(line: 339, column: 7, scope: !1813)
!1864 = !DILocation(line: 339, column: 22, scope: !1813)
