; ModuleID = 'c-parser.bc'
source_filename = "c-parser.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }
%struct.tree_decl_minimal = type { %struct.tree_common, i32, i32, %union.tree_node*, %union.tree_node* }
%struct.tree_common = type { %struct.tree_base, %union.tree_node*, %union.tree_node* }
%struct.tree_base = type { i64 }

!659 = !DIEnumerator(name: "PRAGMA_OMP_SINGLE", value: 13, isUnsigned: true)
!660 = !DIEnumerator(name: "PRAGMA_OMP_TASK", value: 14, isUnsigned: true)
!661 = !DIEnumerator(name: "PRAGMA_OMP_TASKWAIT", value: 15, isUnsigned: true)
!662 = !DIEnumerator(name: "PRAGMA_OMP_THREADPRIVATE", value: 16, isUnsigned: true)
!663 = !DIEnumerator(name: "PRAGMA_GCC_PCH_PREPROCESS", value: 17, isUnsigned: true)
!664 = !DIEnumerator(name: "PRAGMA_FIRST_EXTERNAL", value: 18, isUnsigned: true)
!665 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_typespec_keyword", file: !666, line: 192, baseType: !7, size: 32, elements: !667)
!666 = !DIFile(filename: "./c-tree.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!667 = !{!668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679}
!668 = !DIEnumerator(name: "cts_none", value: 0, isUnsigned: true)
!669 = !DIEnumerator(name: "cts_void", value: 1, isUnsigned: true)
!670 = !DIEnumerator(name: "cts_bool", value: 2, isUnsigned: true)
!671 = !DIEnumerator(name: "cts_char", value: 3, isUnsigned: true)
!672 = !DIEnumerator(name: "cts_int", value: 4, isUnsigned: true)
!673 = !DIEnumerator(name: "cts_float", value: 5, isUnsigned: true)
!674 = !DIEnumerator(name: "cts_double", value: 6, isUnsigned: true)
!675 = !DIEnumerator(name: "cts_dfloat32", value: 7, isUnsigned: true)
!676 = !DIEnumerator(name: "cts_dfloat64", value: 8, isUnsigned: true)
!677 = !DIEnumerator(name: "cts_dfloat128", value: 9, isUnsigned: true)
!678 = !DIEnumerator(name: "cts_fract", value: 10, isUnsigned: true)
!679 = !DIEnumerator(name: "cts_accum", value: 11, isUnsigned: true)
!680 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_storage_class", file: !666, line: 180, baseType: !7, size: 32, elements: !681)
!681 = !{!682, !683, !684, !685, !686, !687}
!682 = !DIEnumerator(name: "csc_none", value: 0, isUnsigned: true)
!683 = !DIEnumerator(name: "csc_auto", value: 1, isUnsigned: true)
!684 = !DIEnumerator(name: "csc_extern", value: 2, isUnsigned: true)
!685 = !DIEnumerator(name: "csc_register", value: 3, isUnsigned: true)
!686 = !DIEnumerator(name: "csc_static", value: 4, isUnsigned: true)
!687 = !DIEnumerator(name: "csc_typedef", value: 5, isUnsigned: true)
!688 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_declarator_kind", file: !666, line: 285, baseType: !7, size: 32, elements: !689)
!689 = !{!690, !691, !692, !693, !694}
!690 = !DIEnumerator(name: "cdk_id", value: 0, isUnsigned: true)
!691 = !DIEnumerator(name: "cdk_function", value: 1, isUnsigned: true)
!692 = !DIEnumerator(name: "cdk_array", value: 2, isUnsigned: true)
!693 = !DIEnumerator(name: "cdk_pointer", value: 3, isUnsigned: true)
!694 = !DIEnumerator(name: "cdk_attrs", value: 4, isUnsigned: true)
!695 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_typespec_kind", file: !666, line: 137, baseType: !7, size: 32, elements: !696)
!696 = !{!697, !698, !699, !700, !701, !702, !703}
!697 = !DIEnumerator(name: "ctsk_resword", value: 0, isUnsigned: true)
!698 = !DIEnumerator(name: "ctsk_tagref", value: 1, isUnsigned: true)
!699 = !DIEnumerator(name: "ctsk_tagfirstref", value: 2, isUnsigned: true)
!700 = !DIEnumerator(name: "ctsk_tagdef", value: 3, isUnsigned: true)
!701 = !DIEnumerator(name: "ctsk_typedef", value: 4, isUnsigned: true)
!702 = !DIEnumerator(name: "ctsk_objc", value: 5, isUnsigned: true)
!703 = !DIEnumerator(name: "ctsk_typeof", value: 6, isUnsigned: true)
!704 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_id_kind", file: !3, line: 132, baseType: !7, size: 32, elements: !705)
!705 = !{!706, !707, !708, !709, !710}
!706 = !DIEnumerator(name: "C_ID_ID", value: 0, isUnsigned: true)
!707 = !DIEnumerator(name: "C_ID_TYPENAME", value: 1, isUnsigned: true)
!708 = !DIEnumerator(name: "C_ID_CLASSNAME", value: 2, isUnsigned: true)
!709 = !DIEnumerator(name: "C_ID_ADDRSPACE", value: 3, isUnsigned: true)
!710 = !DIEnumerator(name: "C_ID_NONE", value: 4, isUnsigned: true)
!711 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "prec", scope: !712, file: !3, line: 4803, baseType: !7, size: 32, elements: !1939)
!712 = distinct !DISubprogram(name: "c_parser_binary_expression", scope: !3, file: !3, line: 4778, type: !713, scopeLine: 4779, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1920)
!713 = !DISubroutineType(types: !714)
!714 = !{!715, !1896, !1919}
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "c_expr", file: !666, line: 116, size: 192, elements: !716)
!716 = !{!717, !1894, !1895}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !715, file: !666, line: 119, baseType: !718, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !719, line: 56, baseType: !720)
!719 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !158, line: 3371, size: 1792, elements: !722)
!722 = !{!723, !756, !762, !775, !794, !805, !810, !821, !827, !841, !853, !891, !1176, !1204, !1212, !1213, !1218, !1227, !1233, !1238, !1242, !1246, !1532, !1579, !1585, !1591, !1598, !1624, !1638, !1655, !1667, !1689, !1704, !1876}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !721, file: !158, line: 3372, baseType: !724, size: 64)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !158, line: 360, size: 64, elements: !725)
!725 = !{!726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !724, file: !158, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !724, file: !158, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !724, file: !158, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !724, file: !158, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !724, file: !158, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !724, file: !158, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !724, file: !158, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !724, file: !158, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !724, file: !158, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !724, file: !158, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !724, file: !158, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !724, file: !158, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !724, file: !158, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !724, file: !158, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !724, file: !158, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !724, file: !158, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !724, file: !158, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !724, file: !158, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !724, file: !158, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !724, file: !158, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !724, file: !158, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !724, file: !158, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !724, file: !158, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !724, file: !158, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !724, file: !158, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !724, file: !158, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !724, file: !158, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !724, file: !158, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !724, file: !158, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !724, file: !158, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !721, file: !158, line: 3373, baseType: !757, size: 192)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !158, line: 402, size: 192, elements: !758)
!758 = !{!759, !760, !761}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !757, file: !158, line: 403, baseType: !724, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !757, file: !158, line: 404, baseType: !718, size: 64, offset: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !757, file: !158, line: 405, baseType: !718, size: 64, offset: 128)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !721, file: !158, line: 3374, baseType: !763, size: 320)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !158, line: 1384, size: 320, elements: !764)
!764 = !{!765, !766}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !763, file: !158, line: 1385, baseType: !757, size: 192)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !763, file: !158, line: 1386, baseType: !767, size: 128, offset: 192)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !768, line: 58, baseType: !769)
!768 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !768, line: 54, size: 128, elements: !770)
!770 = !{!771, !773}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !769, file: !768, line: 56, baseType: !772, size: 64)
!772 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !769, file: !768, line: 57, baseType: !774, size: 64, offset: 64)
!774 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !721, file: !158, line: 3375, baseType: !776, size: 256)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !158, line: 1397, size: 256, elements: !777)
!777 = !{!778, !779}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !776, file: !158, line: 1398, baseType: !757, size: 192)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !776, file: !158, line: 1399, baseType: !780, size: 64, offset: 192)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !782, line: 52, size: 256, elements: !783)
!782 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!783 = !{!784, !785, !786, !787, !788, !789, !790}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !781, file: !782, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !781, file: !782, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !781, file: !782, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !781, file: !782, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !781, file: !782, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !781, file: !782, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !781, file: !782, line: 62, baseType: !791, size: 192, offset: 64)
!791 = !DICompositeType(tag: DW_TAG_array_type, baseType: !772, size: 192, elements: !792)
!792 = !{!793}
!793 = !DISubrange(count: 3)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !721, file: !158, line: 3376, baseType: !795, size: 256)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !158, line: 1408, size: 256, elements: !796)
!796 = !{!797, !798}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !795, file: !158, line: 1409, baseType: !757, size: 192)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !795, file: !158, line: 1410, baseType: !799, size: 64, offset: 192)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !801, line: 27, size: 192, elements: !802)
!801 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!802 = !{!803, !804}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !800, file: !801, line: 29, baseType: !767, size: 128)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !800, file: !801, line: 30, baseType: !5, size: 32, offset: 128)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !721, file: !158, line: 3377, baseType: !806, size: 256)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !158, line: 1437, size: 256, elements: !807)
!807 = !{!808, !809}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !806, file: !158, line: 1438, baseType: !757, size: 192)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !806, file: !158, line: 1439, baseType: !718, size: 64, offset: 192)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !721, file: !158, line: 3378, baseType: !811, size: 256)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !158, line: 1418, size: 256, elements: !812)
!812 = !{!813, !814, !816}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !811, file: !158, line: 1419, baseType: !757, size: 192)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !811, file: !158, line: 1420, baseType: !815, size: 32, offset: 192)
!815 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !811, file: !158, line: 1421, baseType: !817, size: 8, offset: 224)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !818, size: 8, elements: !819)
!818 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!819 = !{!820}
!820 = !DISubrange(count: 1)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !721, file: !158, line: 3379, baseType: !822, size: 320)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !158, line: 1428, size: 320, elements: !823)
!823 = !{!824, !825, !826}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !822, file: !158, line: 1429, baseType: !757, size: 192)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !822, file: !158, line: 1430, baseType: !718, size: 64, offset: 192)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !822, file: !158, line: 1431, baseType: !718, size: 64, offset: 256)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !721, file: !158, line: 3380, baseType: !828, size: 320)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !158, line: 1460, size: 320, elements: !829)
!829 = !{!830, !831}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !828, file: !158, line: 1461, baseType: !757, size: 192)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !828, file: !158, line: 1462, baseType: !832, size: 128, offset: 192)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !833, line: 31, size: 128, elements: !834)
!833 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!834 = !{!835, !839, !840}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !832, file: !833, line: 32, baseType: !836, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !838)
!838 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !832, file: !833, line: 33, baseType: !7, size: 32, offset: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !832, file: !833, line: 34, baseType: !7, size: 32, offset: 96)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !721, file: !158, line: 3381, baseType: !842, size: 384)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !158, line: 2507, size: 384, elements: !843)
!843 = !{!844, !845, !850, !851, !852}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !842, file: !158, line: 2508, baseType: !757, size: 192)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !842, file: !158, line: 2509, baseType: !846, size: 32, offset: 192)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !847, line: 58, baseType: !848)
!847 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !849, line: 44, baseType: !7)
!849 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!850 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !842, file: !158, line: 2510, baseType: !7, size: 32, offset: 224)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !842, file: !158, line: 2511, baseType: !718, size: 64, offset: 256)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !842, file: !158, line: 2512, baseType: !718, size: 64, offset: 320)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !721, file: !158, line: 3382, baseType: !854, size: 896)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !158, line: 2652, size: 896, elements: !855)
!855 = !{!856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !854, file: !158, line: 2653, baseType: !842, size: 384)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !854, file: !158, line: 2654, baseType: !718, size: 64, offset: 384)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !854, file: !158, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !854, file: !158, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !854, file: !158, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !854, file: !158, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !854, file: !158, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !854, file: !158, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !854, file: !158, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !854, file: !158, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !854, file: !158, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !854, file: !158, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !854, file: !158, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !854, file: !158, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !854, file: !158, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !854, file: !158, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !854, file: !158, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !854, file: !158, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !854, file: !158, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !854, file: !158, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !854, file: !158, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !854, file: !158, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !854, file: !158, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !854, file: !158, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !854, file: !158, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !854, file: !158, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !854, file: !158, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !854, file: !158, line: 2703, baseType: !7, size: 32, offset: 512)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !854, file: !158, line: 2705, baseType: !718, size: 64, offset: 576)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !854, file: !158, line: 2706, baseType: !718, size: 64, offset: 640)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !854, file: !158, line: 2707, baseType: !718, size: 64, offset: 704)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !854, file: !158, line: 2708, baseType: !718, size: 64, offset: 768)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !854, file: !158, line: 2711, baseType: !889, size: 64, offset: 832)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !158, line: 2711, flags: DIFlagFwdDecl)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !721, file: !158, line: 3383, baseType: !892, size: 960)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !158, line: 2756, size: 960, elements: !893)
!893 = !{!894, !895}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !892, file: !158, line: 2757, baseType: !854, size: 896)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !892, file: !158, line: 2758, baseType: !896, size: 64, offset: 896)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !719, line: 50, baseType: !897)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !899, line: 240, size: 384, elements: !900)
!899 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!900 = !{!901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !898, file: !899, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !898, file: !899, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !898, file: !899, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !898, file: !899, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !898, file: !899, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !898, file: !899, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !898, file: !899, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !898, file: !899, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !898, file: !899, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !898, file: !899, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !898, file: !899, line: 321, baseType: !912, size: 320, offset: 64)
!912 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !899, line: 315, size: 320, elements: !913)
!913 = !{!914, !1109, !1111, !1174, !1175}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !912, file: !899, line: 316, baseType: !915, size: 64)
!915 = !DICompositeType(tag: DW_TAG_array_type, baseType: !916, size: 64, elements: !819)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !899, line: 183, baseType: !917)
!917 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !899, line: 166, size: 64, elements: !918)
!918 = !{!919, !920, !921, !924, !925, !933, !934, !946, !949, !1011, !1012, !1086, !1099, !1106}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !917, file: !899, line: 168, baseType: !815, size: 32)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !917, file: !899, line: 169, baseType: !7, size: 32)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !917, file: !899, line: 170, baseType: !922, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !818)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !917, file: !899, line: 171, baseType: !896, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !917, file: !899, line: 172, baseType: !926, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !719, line: 53, baseType: !927)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !899, line: 359, size: 128, elements: !929)
!929 = !{!930, !931}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !928, file: !899, line: 360, baseType: !815, size: 32)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !928, file: !899, line: 361, baseType: !932, size: 64, offset: 64)
!932 = !DICompositeType(tag: DW_TAG_array_type, baseType: !896, size: 64, elements: !819)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !917, file: !899, line: 173, baseType: !5, size: 32)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !917, file: !899, line: 174, baseType: !935, size: 32)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !899, line: 133, baseType: !936)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !899, line: 115, size: 32, elements: !937)
!937 = !{!938, !939, !940, !941, !942, !943, !944, !945}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !936, file: !899, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !936, file: !899, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !936, file: !899, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !936, file: !899, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !936, file: !899, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !936, file: !899, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !936, file: !899, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !936, file: !899, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !917, file: !899, line: 175, baseType: !947, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !899, line: 175, flags: DIFlagFwdDecl)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !917, file: !899, line: 176, baseType: !950, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !952, line: 75, size: 256, elements: !953)
!952 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!953 = !{!954, !968, !969, !970}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !951, file: !952, line: 76, baseType: !955, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !952, line: 68, baseType: !957)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !952, line: 63, size: 320, elements: !958)
!958 = !{!959, !961, !962, !963}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !957, file: !952, line: 64, baseType: !960, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !957, file: !952, line: 65, baseType: !960, size: 64, offset: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !957, file: !952, line: 66, baseType: !7, size: 32, offset: 128)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !957, file: !952, line: 67, baseType: !964, size: 128, offset: 192)
!964 = !DICompositeType(tag: DW_TAG_array_type, baseType: !965, size: 128, elements: !966)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !952, line: 29, baseType: !772)
!966 = !{!967}
!967 = !DISubrange(count: 2)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !951, file: !952, line: 77, baseType: !955, size: 64, offset: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !951, file: !952, line: 78, baseType: !7, size: 32, offset: 128)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !951, file: !952, line: 79, baseType: !971, size: 64, offset: 192)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !952, line: 49, baseType: !973)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !952, line: 45, size: 832, elements: !974)
!974 = !{!975, !976, !977}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !973, file: !952, line: 46, baseType: !960, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !973, file: !952, line: 47, baseType: !950, size: 64, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !973, file: !952, line: 48, baseType: !978, size: 704, offset: 128)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !979, line: 164, size: 704, elements: !980)
!979 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!980 = !{!981, !982, !993, !994, !995, !996, !997, !998, !1003, !1007, !1008, !1009, !1010}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !978, file: !979, line: 166, baseType: !774, size: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !978, file: !979, line: 167, baseType: !983, size: 64, offset: 64)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !979, line: 157, size: 192, elements: !985)
!985 = !{!986, !988, !989}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !984, file: !979, line: 159, baseType: !987, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !984, file: !979, line: 160, baseType: !983, size: 64, offset: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !984, file: !979, line: 161, baseType: !990, size: 32, offset: 128)
!990 = !DICompositeType(tag: DW_TAG_array_type, baseType: !818, size: 32, elements: !991)
!991 = !{!992}
!992 = !DISubrange(count: 4)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !978, file: !979, line: 168, baseType: !987, size: 64, offset: 128)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !978, file: !979, line: 169, baseType: !987, size: 64, offset: 192)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !978, file: !979, line: 170, baseType: !987, size: 64, offset: 256)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !978, file: !979, line: 171, baseType: !774, size: 64, offset: 320)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !978, file: !979, line: 172, baseType: !815, size: 32, offset: 384)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !978, file: !979, line: 176, baseType: !999, size: 64, offset: 448)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!983, !1002, !774}
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !978, file: !979, line: 177, baseType: !1004, size: 64, offset: 512)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{null, !1002, !983}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !978, file: !979, line: 178, baseType: !1002, size: 64, offset: 576)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !978, file: !979, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !978, file: !979, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !978, file: !979, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !917, file: !899, line: 177, baseType: !718, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !917, file: !899, line: 178, baseType: !1013, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !142, line: 217, size: 832, elements: !1015)
!1015 = !{!1016, !1051, !1052, !1053, !1056, !1060, !1061, !1062, !1080, !1081, !1082, !1083, !1084, !1085}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1014, file: !142, line: 219, baseType: !1017, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !142, line: 151, baseType: !1019)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !142, line: 151, size: 128, elements: !1020)
!1020 = !{!1021}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1019, file: !142, line: 151, baseType: !1022, size: 128)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !142, line: 150, baseType: !1023)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !142, line: 150, size: 128, elements: !1024)
!1024 = !{!1025, !1026, !1027}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1023, file: !142, line: 150, baseType: !7, size: 32)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1023, file: !142, line: 150, baseType: !7, size: 32, offset: 32)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1023, file: !142, line: 150, baseType: !1028, size: 64, offset: 64)
!1028 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1029, size: 64, elements: !819)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !719, line: 108, baseType: !1030)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !142, line: 122, size: 512, elements: !1032)
!1032 = !{!1033, !1034, !1035, !1043, !1044, !1045, !1046, !1047, !1048, !1049}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1031, file: !142, line: 124, baseType: !1013, size: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1031, file: !142, line: 125, baseType: !1013, size: 64, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1031, file: !142, line: 131, baseType: !1036, size: 64, offset: 128)
!1036 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !142, line: 128, size: 64, elements: !1037)
!1037 = !{!1038, !1042}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1036, file: !142, line: 129, baseType: !1039, size: 64)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !719, line: 66, baseType: !1040)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !719, line: 65, flags: DIFlagFwdDecl)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1036, file: !142, line: 130, baseType: !896, size: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1031, file: !142, line: 134, baseType: !1002, size: 64, offset: 192)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1031, file: !142, line: 137, baseType: !718, size: 64, offset: 256)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1031, file: !142, line: 138, baseType: !846, size: 32, offset: 320)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1031, file: !142, line: 142, baseType: !7, size: 32, offset: 352)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1031, file: !142, line: 144, baseType: !815, size: 32, offset: 384)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1031, file: !142, line: 145, baseType: !815, size: 32, offset: 416)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1031, file: !142, line: 146, baseType: !1050, size: 64, offset: 448)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !142, line: 119, baseType: !774)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1014, file: !142, line: 220, baseType: !1017, size: 64, offset: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1014, file: !142, line: 223, baseType: !1002, size: 64, offset: 128)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1014, file: !142, line: 226, baseType: !1054, size: 64, offset: 192)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !142, line: 185, flags: DIFlagFwdDecl)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1014, file: !142, line: 229, baseType: !1057, size: 128, offset: 256)
!1057 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1058, size: 128, elements: !966)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !142, line: 229, flags: DIFlagFwdDecl)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1014, file: !142, line: 232, baseType: !1013, size: 64, offset: 384)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1014, file: !142, line: 233, baseType: !1013, size: 64, offset: 448)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1014, file: !142, line: 238, baseType: !1063, size: 64, offset: 512)
!1063 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !142, line: 235, size: 64, elements: !1064)
!1064 = !{!1065, !1071}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1063, file: !142, line: 236, baseType: !1066, size: 64)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !142, line: 273, size: 128, elements: !1068)
!1068 = !{!1069, !1070}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1067, file: !142, line: 275, baseType: !1039, size: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1067, file: !142, line: 278, baseType: !1039, size: 64, offset: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1063, file: !142, line: 237, baseType: !1072, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !142, line: 259, size: 320, elements: !1074)
!1074 = !{!1075, !1076, !1077, !1078, !1079}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1073, file: !142, line: 261, baseType: !896, size: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1073, file: !142, line: 262, baseType: !896, size: 64, offset: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1073, file: !142, line: 266, baseType: !896, size: 64, offset: 128)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1073, file: !142, line: 267, baseType: !896, size: 64, offset: 192)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1073, file: !142, line: 270, baseType: !815, size: 32, offset: 256)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1014, file: !142, line: 241, baseType: !1050, size: 64, offset: 576)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1014, file: !142, line: 244, baseType: !815, size: 32, offset: 640)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1014, file: !142, line: 247, baseType: !815, size: 32, offset: 672)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1014, file: !142, line: 250, baseType: !815, size: 32, offset: 704)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1014, file: !142, line: 253, baseType: !815, size: 32, offset: 736)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1014, file: !142, line: 256, baseType: !815, size: 32, offset: 768)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !917, file: !899, line: 179, baseType: !1087, size: 64)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !899, line: 150, baseType: !1089)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !899, line: 142, size: 320, elements: !1090)
!1090 = !{!1091, !1092, !1093, !1094, !1097, !1098}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1089, file: !899, line: 144, baseType: !718, size: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1089, file: !899, line: 145, baseType: !896, size: 64, offset: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1089, file: !899, line: 146, baseType: !896, size: 64, offset: 128)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1089, file: !899, line: 147, baseType: !1095, size: 32, offset: 192)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1096, line: 31, baseType: !815)
!1096 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1089, file: !899, line: 148, baseType: !7, size: 32, offset: 224)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1089, file: !899, line: 149, baseType: !838, size: 8, offset: 256)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !917, file: !899, line: 180, baseType: !1100, size: 64)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64)
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !899, line: 162, baseType: !1102)
!1102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !899, line: 159, size: 128, elements: !1103)
!1103 = !{!1104, !1105}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1102, file: !899, line: 160, baseType: !718, size: 64)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1102, file: !899, line: 161, baseType: !774, size: 64, offset: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !917, file: !899, line: 181, baseType: !1107, size: 64)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !899, line: 181, flags: DIFlagFwdDecl)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !912, file: !899, line: 317, baseType: !1110, size: 64)
!1110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !774, size: 64, elements: !819)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !912, file: !899, line: 318, baseType: !1112, size: 320)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !899, line: 188, size: 320, elements: !1113)
!1113 = !{!1114, !1116, !1173}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1112, file: !899, line: 190, baseType: !1115, size: 192)
!1115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !916, size: 192, elements: !792)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1112, file: !899, line: 193, baseType: !1117, size: 64, offset: 192)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !899, line: 206, size: 320, elements: !1119)
!1119 = !{!1120, !1158, !1159, !1160, !1172}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1118, file: !899, line: 208, baseType: !1121, size: 64)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !719, line: 62, baseType: !1123)
!1123 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1124, line: 538, size: 256, elements: !1125)
!1124 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1125 = !{!1126, !1130, !1136, !1149}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1123, file: !1124, line: 539, baseType: !1127, size: 32)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1124, line: 482, size: 32, elements: !1128)
!1128 = !{!1129}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1127, file: !1124, line: 484, baseType: !7, size: 32)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1123, file: !1124, line: 540, baseType: !1131, size: 192)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1124, line: 488, size: 192, elements: !1132)
!1132 = !{!1133, !1134, !1135}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1131, file: !1124, line: 489, baseType: !1127, size: 32)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1131, file: !1124, line: 492, baseType: !922, size: 64, offset: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1131, file: !1124, line: 496, baseType: !718, size: 64, offset: 128)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1123, file: !1124, line: 541, baseType: !1137, size: 256)
!1137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1124, line: 504, size: 256, elements: !1138)
!1138 = !{!1139, !1140, !1147, !1148}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1137, file: !1124, line: 505, baseType: !1127, size: 32)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1137, file: !1124, line: 509, baseType: !1141, size: 64, offset: 64)
!1141 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1124, line: 501, baseType: !1142)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64)
!1143 = !DISubroutineType(types: !1144)
!1144 = !{null, !1145}
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1137, file: !1124, line: 510, baseType: !1145, size: 64, offset: 128)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1137, file: !1124, line: 513, baseType: !1121, size: 64, offset: 192)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1123, file: !1124, line: 542, baseType: !1150, size: 128)
!1150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1124, line: 530, size: 128, elements: !1151)
!1151 = !{!1152, !1153}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1150, file: !1124, line: 531, baseType: !1127, size: 32)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1150, file: !1124, line: 534, baseType: !1154, size: 64, offset: 64)
!1154 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1124, line: 525, baseType: !1155)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1156 = !DISubroutineType(types: !1157)
!1157 = !{!838, !718, !922, !772, !772}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1118, file: !899, line: 211, baseType: !7, size: 32, offset: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1118, file: !899, line: 214, baseType: !774, size: 64, offset: 128)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1118, file: !899, line: 224, baseType: !1161, size: 64, offset: 192)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !899, line: 202, baseType: !1163)
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !899, line: 202, size: 128, elements: !1164)
!1164 = !{!1165}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1163, file: !899, line: 202, baseType: !1166, size: 128)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !899, line: 200, baseType: !1167)
!1167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !899, line: 200, size: 128, elements: !1168)
!1168 = !{!1169, !1170, !1171}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1167, file: !899, line: 200, baseType: !7, size: 32)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1167, file: !899, line: 200, baseType: !7, size: 32, offset: 32)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1167, file: !899, line: 200, baseType: !932, size: 64, offset: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1118, file: !899, line: 234, baseType: !1161, size: 64, offset: 256)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1112, file: !899, line: 197, baseType: !774, size: 64, offset: 256)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !912, file: !899, line: 319, baseType: !781, size: 256)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !912, file: !899, line: 320, baseType: !800, size: 192)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !721, file: !158, line: 3384, baseType: !1177, size: 1472)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !158, line: 3114, size: 1472, elements: !1178)
!1178 = !{!1179, !1200, !1201, !1202, !1203}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1177, file: !158, line: 3115, baseType: !1180, size: 1216)
!1180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !158, line: 2984, size: 1216, elements: !1181)
!1181 = !{!1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1180, file: !158, line: 2985, baseType: !892, size: 960)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1180, file: !158, line: 2986, baseType: !718, size: 64, offset: 960)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1180, file: !158, line: 2987, baseType: !718, size: 64, offset: 1024)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1180, file: !158, line: 2988, baseType: !718, size: 64, offset: 1088)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1180, file: !158, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1180, file: !158, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1180, file: !158, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1180, file: !158, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1180, file: !158, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1180, file: !158, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1180, file: !158, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1180, file: !158, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1180, file: !158, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1180, file: !158, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1180, file: !158, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1180, file: !158, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1180, file: !158, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1180, file: !158, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1177, file: !158, line: 3117, baseType: !718, size: 64, offset: 1216)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1177, file: !158, line: 3119, baseType: !718, size: 64, offset: 1280)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1177, file: !158, line: 3121, baseType: !718, size: 64, offset: 1344)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1177, file: !158, line: 3123, baseType: !718, size: 64, offset: 1408)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !721, file: !158, line: 3385, baseType: !1205, size: 1088)
!1205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !158, line: 2874, size: 1088, elements: !1206)
!1206 = !{!1207, !1208, !1209}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1205, file: !158, line: 2875, baseType: !892, size: 960)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1205, file: !158, line: 2876, baseType: !896, size: 64, offset: 960)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1205, file: !158, line: 2877, baseType: !1210, size: 64, offset: 1024)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64)
!1211 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !158, line: 2856, flags: DIFlagFwdDecl)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !721, file: !158, line: 3386, baseType: !1180, size: 1216)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !721, file: !158, line: 3387, baseType: !1214, size: 1280)
!1214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !158, line: 3093, size: 1280, elements: !1215)
!1215 = !{!1216, !1217}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1214, file: !158, line: 3094, baseType: !1180, size: 1216)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1214, file: !158, line: 3095, baseType: !1210, size: 64, offset: 1216)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !721, file: !158, line: 3388, baseType: !1219, size: 1216)
!1219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !158, line: 2824, size: 1216, elements: !1220)
!1220 = !{!1221, !1222, !1223, !1224, !1225, !1226}
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1219, file: !158, line: 2825, baseType: !854, size: 896)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1219, file: !158, line: 2827, baseType: !718, size: 64, offset: 896)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1219, file: !158, line: 2828, baseType: !718, size: 64, offset: 960)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1219, file: !158, line: 2829, baseType: !718, size: 64, offset: 1024)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1219, file: !158, line: 2830, baseType: !718, size: 64, offset: 1088)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1219, file: !158, line: 2831, baseType: !718, size: 64, offset: 1152)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !721, file: !158, line: 3389, baseType: !1228, size: 1024)
!1228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !158, line: 2850, size: 1024, elements: !1229)
!1229 = !{!1230, !1231, !1232}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1228, file: !158, line: 2851, baseType: !892, size: 960)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1228, file: !158, line: 2852, baseType: !815, size: 32, offset: 960)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1228, file: !158, line: 2853, baseType: !815, size: 32, offset: 992)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !721, file: !158, line: 3390, baseType: !1234, size: 1024)
!1234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !158, line: 2857, size: 1024, elements: !1235)
!1235 = !{!1236, !1237}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1234, file: !158, line: 2858, baseType: !892, size: 960)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1234, file: !158, line: 2859, baseType: !1210, size: 64, offset: 960)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !721, file: !158, line: 3391, baseType: !1239, size: 960)
!1239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !158, line: 2862, size: 960, elements: !1240)
!1240 = !{!1241}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1239, file: !158, line: 2863, baseType: !892, size: 960)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !721, file: !158, line: 3392, baseType: !1243, size: 1472)
!1243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !158, line: 3304, size: 1472, elements: !1244)
!1244 = !{!1245}
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1243, file: !158, line: 3305, baseType: !1177, size: 1472)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !721, file: !158, line: 3393, baseType: !1247, size: 1792)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !158, line: 3248, size: 1792, elements: !1248)
!1248 = !{!1249, !1250, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1247, file: !158, line: 3249, baseType: !1177, size: 1472)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1247, file: !158, line: 3251, baseType: !1251, size: 64, offset: 1472)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1253, line: 463, size: 1152, elements: !1254)
!1253 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1254 = !{!1255, !1417, !1448, !1449, !1452, !1455, !1456, !1457, !1458, !1459, !1460, !1484, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1252, file: !1253, line: 464, baseType: !1256, size: 64)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64)
!1257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !135, line: 194, size: 384, elements: !1258)
!1258 = !{!1259, !1308, !1321, !1335, !1385, !1398}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !1257, file: !135, line: 197, baseType: !1260, size: 64)
!1260 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !135, line: 182, baseType: !1261)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64)
!1262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !135, line: 116, size: 704, elements: !1263)
!1263 = !{!1264, !1265, !1266, !1267, !1268, !1269, !1296, !1305, !1306, !1307}
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !1262, file: !135, line: 119, baseType: !1261, size: 64)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1262, file: !135, line: 122, baseType: !1261, size: 64, offset: 64)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !1262, file: !135, line: 123, baseType: !1261, size: 64, offset: 128)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1262, file: !135, line: 126, baseType: !815, size: 32, offset: 192)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1262, file: !135, line: 129, baseType: !134, size: 32, offset: 224)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1262, file: !135, line: 165, baseType: !1270, size: 192, offset: 256)
!1270 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !135, line: 132, size: 192, elements: !1271)
!1271 = !{!1272, !1285, !1291}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !1270, file: !135, line: 137, baseType: !1273, size: 128)
!1273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !135, line: 133, size: 128, elements: !1274)
!1274 = !{!1275, !1284}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !1273, file: !135, line: 135, baseType: !1276, size: 64)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64)
!1277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !135, line: 93, size: 320, elements: !1278)
!1278 = !{!1279, !1280, !1281, !1282, !1283}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !1277, file: !135, line: 96, baseType: !1276, size: 64)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !1277, file: !135, line: 97, baseType: !1276, size: 64, offset: 64)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1277, file: !135, line: 101, baseType: !718, size: 64, offset: 128)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !1277, file: !135, line: 106, baseType: !718, size: 64, offset: 192)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1277, file: !135, line: 111, baseType: !718, size: 64, offset: 256)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !1273, file: !135, line: 136, baseType: !1276, size: 64, offset: 64)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !1270, file: !135, line: 151, baseType: !1286, size: 192)
!1286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !135, line: 139, size: 192, elements: !1287)
!1287 = !{!1288, !1289, !1290}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1286, file: !135, line: 141, baseType: !718, size: 64)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1286, file: !135, line: 145, baseType: !718, size: 64, offset: 64)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1286, file: !135, line: 150, baseType: !815, size: 32, offset: 128)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !1270, file: !135, line: 164, baseType: !1292, size: 128)
!1292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !135, line: 153, size: 128, elements: !1293)
!1293 = !{!1294, !1295}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !1292, file: !135, line: 161, baseType: !718, size: 64)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !1292, file: !135, line: 163, baseType: !846, size: 32, offset: 64)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !1262, file: !135, line: 168, baseType: !1297, size: 64, offset: 448)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64)
!1298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !135, line: 67, size: 320, elements: !1299)
!1299 = !{!1300, !1301, !1302, !1303, !1304}
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !1298, file: !135, line: 70, baseType: !1297, size: 64)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1298, file: !135, line: 73, baseType: !1261, size: 64, offset: 64)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !1298, file: !135, line: 78, baseType: !718, size: 64, offset: 128)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !1298, file: !135, line: 85, baseType: !896, size: 64, offset: 192)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1298, file: !135, line: 88, baseType: !815, size: 32, offset: 256)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !1262, file: !135, line: 173, baseType: !896, size: 64, offset: 512)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !1262, file: !135, line: 173, baseType: !896, size: 64, offset: 576)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !1262, file: !135, line: 177, baseType: !838, size: 8, offset: 640)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !1257, file: !135, line: 200, baseType: !1309, size: 64, offset: 64)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64)
!1310 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !135, line: 185, baseType: !1311)
!1311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !135, line: 185, size: 128, elements: !1312)
!1312 = !{!1313}
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1311, file: !135, line: 185, baseType: !1314, size: 128)
!1314 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !135, line: 184, baseType: !1315)
!1315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !135, line: 184, size: 128, elements: !1316)
!1316 = !{!1317, !1318, !1319}
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1315, file: !135, line: 184, baseType: !7, size: 32)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1315, file: !135, line: 184, baseType: !7, size: 32, offset: 32)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1315, file: !135, line: 184, baseType: !1320, size: 64, offset: 64)
!1320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1260, size: 64, elements: !819)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !1257, file: !135, line: 203, baseType: !1322, size: 64, offset: 128)
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64)
!1323 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, baseType: !1324)
!1324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, size: 128, elements: !1325)
!1325 = !{!1326}
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1324, file: !135, line: 189, baseType: !1327, size: 128)
!1327 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !135, line: 188, baseType: !1328)
!1328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !135, line: 188, size: 128, elements: !1329)
!1329 = !{!1330, !1331, !1332}
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1328, file: !135, line: 188, baseType: !7, size: 32)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1328, file: !135, line: 188, baseType: !7, size: 32, offset: 32)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1328, file: !135, line: 188, baseType: !1333, size: 64, offset: 64)
!1333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1334, size: 64, elements: !819)
!1334 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !135, line: 180, baseType: !1297)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !1257, file: !135, line: 207, baseType: !1336, size: 64, offset: 192)
!1336 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1337, line: 144, baseType: !1338)
!1337 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64)
!1339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1337, line: 100, size: 896, elements: !1340)
!1340 = !{!1341, !1347, !1352, !1357, !1359, !1362, !1363, !1364, !1365, !1366, !1371, !1373, !1374, !1379, !1384}
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1339, file: !1337, line: 102, baseType: !1342, size: 64)
!1342 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1337, line: 52, baseType: !1343)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64)
!1344 = !DISubroutineType(types: !1345)
!1345 = !{!1346, !1145}
!1346 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1337, line: 47, baseType: !7)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1339, file: !1337, line: 105, baseType: !1348, size: 64, offset: 64)
!1348 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1337, line: 59, baseType: !1349)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64)
!1350 = !DISubroutineType(types: !1351)
!1351 = !{!815, !1145, !1145}
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1339, file: !1337, line: 108, baseType: !1353, size: 64, offset: 128)
!1353 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1337, line: 63, baseType: !1354)
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1355, size: 64)
!1355 = !DISubroutineType(types: !1356)
!1356 = !{null, !1002}
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1339, file: !1337, line: 111, baseType: !1358, size: 64, offset: 192)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1339, file: !1337, line: 114, baseType: !1360, size: 64, offset: 256)
!1360 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1361, line: 46, baseType: !772)
!1361 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1339, file: !1337, line: 117, baseType: !1360, size: 64, offset: 320)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1339, file: !1337, line: 120, baseType: !1360, size: 64, offset: 384)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1339, file: !1337, line: 124, baseType: !7, size: 32, offset: 448)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1339, file: !1337, line: 128, baseType: !7, size: 32, offset: 480)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1339, file: !1337, line: 131, baseType: !1367, size: 64, offset: 512)
!1367 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1337, line: 75, baseType: !1368)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64)
!1369 = !DISubroutineType(types: !1370)
!1370 = !{!1002, !1360, !1360}
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1339, file: !1337, line: 132, baseType: !1372, size: 64, offset: 576)
!1372 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1337, line: 78, baseType: !1354)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1339, file: !1337, line: 135, baseType: !1002, size: 64, offset: 640)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1339, file: !1337, line: 136, baseType: !1375, size: 64, offset: 704)
!1375 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1337, line: 82, baseType: !1376)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64)
!1377 = !DISubroutineType(types: !1378)
!1378 = !{!1002, !1002, !1360, !1360}
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1339, file: !1337, line: 137, baseType: !1380, size: 64, offset: 768)
!1380 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1337, line: 83, baseType: !1381)
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1382, size: 64)
!1382 = !DISubroutineType(types: !1383)
!1383 = !{null, !1002, !1002}
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1339, file: !1337, line: 141, baseType: !7, size: 32, offset: 832)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !1257, file: !135, line: 211, baseType: !1386, size: 64, offset: 256)
!1386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1387, size: 64)
!1387 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !158, line: 183, baseType: !1388)
!1388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !158, line: 183, size: 128, elements: !1389)
!1389 = !{!1390}
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1388, file: !158, line: 183, baseType: !1391, size: 128)
!1391 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !158, line: 182, baseType: !1392)
!1392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !158, line: 182, size: 128, elements: !1393)
!1393 = !{!1394, !1395, !1396}
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1392, file: !158, line: 182, baseType: !7, size: 32)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1392, file: !158, line: 182, baseType: !7, size: 32, offset: 32)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1392, file: !158, line: 182, baseType: !1397, size: 64, offset: 64)
!1397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !718, size: 64, elements: !819)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !1257, file: !135, line: 220, baseType: !1399, size: 64, offset: 320)
!1399 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !135, line: 217, size: 64, elements: !1400)
!1400 = !{!1401, !1402}
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !1399, file: !135, line: 218, baseType: !1386, size: 64)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !1399, file: !135, line: 219, baseType: !1403, size: 64)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64)
!1404 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !1405, line: 29, baseType: !1406)
!1405 = !DIFile(filename: "./vecprim.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !1405, line: 29, size: 96, elements: !1407)
!1407 = !{!1408}
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1406, file: !1405, line: 29, baseType: !1409, size: 96)
!1409 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !1405, line: 27, baseType: !1410)
!1410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !1405, line: 27, size: 96, elements: !1411)
!1411 = !{!1412, !1413, !1414}
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1410, file: !1405, line: 27, baseType: !7, size: 32)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1410, file: !1405, line: 27, baseType: !7, size: 32, offset: 32)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1410, file: !1405, line: 27, baseType: !1415, size: 8, offset: 64)
!1415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1416, size: 8, elements: !819)
!1416 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !1405, line: 26, baseType: !838)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1252, file: !1253, line: 467, baseType: !1418, size: 64, offset: 64)
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64)
!1419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !142, line: 374, size: 640, elements: !1420)
!1420 = !{!1421, !1423, !1424, !1437, !1438, !1439, !1440, !1441, !1442, !1444, !1446, !1447}
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1419, file: !142, line: 377, baseType: !1422, size: 64)
!1422 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !719, line: 111, baseType: !1013)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1419, file: !142, line: 378, baseType: !1422, size: 64, offset: 64)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1419, file: !142, line: 381, baseType: !1425, size: 64, offset: 128)
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1426, size: 64)
!1426 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !142, line: 282, baseType: !1427)
!1427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !142, line: 282, size: 128, elements: !1428)
!1428 = !{!1429}
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1427, file: !142, line: 282, baseType: !1430, size: 128)
!1430 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !142, line: 281, baseType: !1431)
!1431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !142, line: 281, size: 128, elements: !1432)
!1432 = !{!1433, !1434, !1435}
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1431, file: !142, line: 281, baseType: !7, size: 32)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1431, file: !142, line: 281, baseType: !7, size: 32, offset: 32)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1431, file: !142, line: 281, baseType: !1436, size: 64, offset: 64)
!1436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1422, size: 64, elements: !819)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1419, file: !142, line: 384, baseType: !815, size: 32, offset: 192)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1419, file: !142, line: 387, baseType: !815, size: 32, offset: 224)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1419, file: !142, line: 390, baseType: !815, size: 32, offset: 256)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1419, file: !142, line: 394, baseType: !1425, size: 64, offset: 320)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1419, file: !142, line: 396, baseType: !141, size: 32, offset: 384)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1419, file: !142, line: 399, baseType: !1443, size: 64, offset: 416)
!1443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 64, elements: !966)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1419, file: !142, line: 402, baseType: !1445, size: 64, offset: 480)
!1445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !966)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1419, file: !142, line: 406, baseType: !815, size: 32, offset: 544)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1419, file: !142, line: 409, baseType: !815, size: 32, offset: 576)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1252, file: !1253, line: 470, baseType: !1040, size: 64, offset: 128)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1252, file: !1253, line: 473, baseType: !1450, size: 64, offset: 192)
!1450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1451, size: 64)
!1451 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1253, line: 166, flags: DIFlagFwdDecl)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1252, file: !1253, line: 476, baseType: !1453, size: 64, offset: 256)
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1454, size: 64)
!1454 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1253, line: 476, flags: DIFlagFwdDecl)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1252, file: !1253, line: 479, baseType: !1336, size: 64, offset: 320)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1252, file: !1253, line: 484, baseType: !718, size: 64, offset: 384)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1252, file: !1253, line: 488, baseType: !718, size: 64, offset: 448)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1252, file: !1253, line: 493, baseType: !718, size: 64, offset: 512)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1252, file: !1253, line: 496, baseType: !718, size: 64, offset: 576)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1252, file: !1253, line: 501, baseType: !1461, size: 64, offset: 640)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64)
!1462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !153, line: 2355, size: 576, elements: !1463)
!1463 = !{!1464, !1467, !1468, !1469, !1470, !1472, !1473, !1478, !1479, !1480, !1481, !1482, !1483}
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1462, file: !153, line: 2356, baseType: !1465, size: 64)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64)
!1466 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !153, line: 2356, flags: DIFlagFwdDecl)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1462, file: !153, line: 2357, baseType: !922, size: 64, offset: 64)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1462, file: !153, line: 2358, baseType: !815, size: 32, offset: 128)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1462, file: !153, line: 2359, baseType: !815, size: 32, offset: 160)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1462, file: !153, line: 2360, baseType: !1471, size: 128, offset: 192)
!1471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !815, size: 128, elements: !991)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1462, file: !153, line: 2364, baseType: !815, size: 32, offset: 320)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1462, file: !153, line: 2367, baseType: !1474, size: 128, offset: 384)
!1474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !153, line: 2349, size: 128, elements: !1475)
!1475 = !{!1476, !1477}
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1474, file: !153, line: 2351, baseType: !896, size: 64)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1474, file: !153, line: 2352, baseType: !774, size: 64, offset: 64)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1462, file: !153, line: 2371, baseType: !152, size: 32, offset: 512)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1462, file: !153, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1462, file: !153, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1462, file: !153, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1462, file: !153, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1462, file: !153, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1252, file: !1253, line: 504, baseType: !1485, size: 64, offset: 704)
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1486, size: 64)
!1486 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1253, line: 504, flags: DIFlagFwdDecl)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1252, file: !1253, line: 507, baseType: !1336, size: 64, offset: 768)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1252, file: !1253, line: 510, baseType: !815, size: 32, offset: 832)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1252, file: !1253, line: 513, baseType: !815, size: 32, offset: 864)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1252, file: !1253, line: 516, baseType: !846, size: 32, offset: 896)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1252, file: !1253, line: 519, baseType: !846, size: 32, offset: 928)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1252, file: !1253, line: 522, baseType: !7, size: 32, offset: 960)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1252, file: !1253, line: 523, baseType: !7, size: 32, offset: 992)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1252, file: !1253, line: 528, baseType: !922, size: 64, offset: 1024)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1252, file: !1253, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1252, file: !1253, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1252, file: !1253, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1252, file: !1253, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1252, file: !1253, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1252, file: !1253, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1252, file: !1253, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1252, file: !1253, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1252, file: !1253, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
