; ModuleID = 'c-pch.bc'
source_filename = "c-pch.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "partial_pch", scope: !2, file: !3, line: 116, type: !109, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "pch_init", scope: !3, file: !3, line: 111, type: !4, scopeLine: 112, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !117)
!3 = !DIFile(filename: "c-pch.c", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!4 = !DISubroutineType(types: !5)
!5 = !{null}
!6 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !7, retainedTypes: !8, globals: !21, nameTableKind: None)
!7 = !{}
!8 = !{!9, !10, !11, !12, !15, !16, !13, !18}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!11 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !19, line: 46, baseType: !20)
!19 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!20 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!21 = !{!0, !22, !80, !82, !85, !90, !99, !107, !112}
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(name: "pch_outfile", scope: !6, file: !3, line: 80, type: !24, isLocal: true, isDefinition: true)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !26, line: 7, baseType: !27)
!26 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !28, line: 49, size: 1728, elements: !29)
!28 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!29 = !{!30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !45, !47, !48, !49, !53, !55, !57, !61, !64, !66, !69, !72, !73, !74, !75, !76}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !27, file: !28, line: 51, baseType: !11, size: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !27, file: !28, line: 54, baseType: !13, size: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !27, file: !28, line: 55, baseType: !13, size: 64, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !27, file: !28, line: 56, baseType: !13, size: 64, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !27, file: !28, line: 57, baseType: !13, size: 64, offset: 256)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !27, file: !28, line: 58, baseType: !13, size: 64, offset: 320)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !27, file: !28, line: 59, baseType: !13, size: 64, offset: 384)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !27, file: !28, line: 60, baseType: !13, size: 64, offset: 448)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !27, file: !28, line: 61, baseType: !13, size: 64, offset: 512)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !27, file: !28, line: 64, baseType: !13, size: 64, offset: 576)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !27, file: !28, line: 65, baseType: !13, size: 64, offset: 640)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !27, file: !28, line: 66, baseType: !13, size: 64, offset: 704)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !27, file: !28, line: 68, baseType: !43, size: 64, offset: 768)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !28, line: 36, flags: DIFlagFwdDecl)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !27, file: !28, line: 70, baseType: !46, size: 64, offset: 832)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !27, file: !28, line: 72, baseType: !11, size: 32, offset: 896)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !27, file: !28, line: 73, baseType: !11, size: 32, offset: 928)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !27, file: !28, line: 74, baseType: !50, size: 64, offset: 960)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !51, line: 152, baseType: !52)
!51 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!52 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !27, file: !28, line: 77, baseType: !54, size: 16, offset: 1024)
!54 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !27, file: !28, line: 78, baseType: !56, size: 8, offset: 1040)
!56 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !27, file: !28, line: 79, baseType: !58, size: 8, offset: 1048)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8, elements: !59)
!59 = !{!60}
!60 = !DISubrange(count: 1)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !27, file: !28, line: 81, baseType: !62, size: 64, offset: 1088)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !28, line: 43, baseType: null)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !27, file: !28, line: 89, baseType: !65, size: 64, offset: 1152)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !51, line: 153, baseType: !52)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !27, file: !28, line: 91, baseType: !67, size: 64, offset: 1216)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !28, line: 37, flags: DIFlagFwdDecl)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !27, file: !28, line: 92, baseType: !70, size: 64, offset: 1280)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !28, line: 38, flags: DIFlagFwdDecl)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !27, file: !28, line: 93, baseType: !46, size: 64, offset: 1344)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !27, file: !28, line: 94, baseType: !15, size: 64, offset: 1408)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !27, file: !28, line: 95, baseType: !18, size: 64, offset: 1472)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !27, file: !28, line: 96, baseType: !11, size: 32, offset: 1536)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !27, file: !28, line: 98, baseType: !77, size: 160, offset: 1568)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 160, elements: !78)
!78 = !{!79}
!79 = !DISubrange(count: 20)
!80 = !DIGlobalVariableExpression(var: !81, expr: !DIExpression())
!81 = distinct !DIGlobalVariable(name: "asm_file_startpos", scope: !6, file: !3, line: 83, type: !52, isLocal: true, isDefinition: true)
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(name: "lang_post_pch_load", scope: !6, file: !3, line: 359, type: !84, isLocal: false, isDefinition: true)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(name: "no_checksum", scope: !6, file: !3, line: 57, type: !87, isLocal: true, isDefinition: true)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 128, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 16)
!90 = !DIGlobalVariableExpression(var: !91, expr: !DIExpression())
!91 = distinct !DIGlobalVariable(name: "pch_matching", scope: !6, file: !3, line: 47, type: !92, isLocal: true, isDefinition: true)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 128, elements: !59)
!93 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !94)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "c_pch_matching", file: !3, line: 43, size: 128, elements: !95)
!95 = !{!96, !98}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "flag_var", scope: !94, file: !3, line: 45, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "flag_name", scope: !94, file: !3, line: 46, baseType: !16, size: 64, offset: 64)
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(name: "result", scope: !101, file: !3, line: 95, type: !104, isLocal: true, isDefinition: true)
!101 = distinct !DISubprogram(name: "get_ident", scope: !3, file: !3, line: 93, type: !102, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !7)
!102 = !DISubroutineType(types: !103)
!103 = !{!16}
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 64, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 8)
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(name: "templ", scope: !101, file: !3, line: 96, type: !109, isLocal: true, isDefinition: true)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 72, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 9)
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "c_language_chars", scope: !101, file: !3, line: 97, type: !114, isLocal: true, isDefinition: true)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 40, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 5)
!117 = !{!118, !119, !127, !128}
!118 = !DILocalVariable(name: "f", scope: !2, file: !3, line: 113, type: !24)
!119 = !DILocalVariable(name: "v", scope: !2, file: !3, line: 114, type: !120)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "c_pch_validity", file: !3, line: 64, size: 192, elements: !121)
!121 = !{!122, !123, !125, !126}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "debug_info_type", scope: !120, file: !3, line: 66, baseType: !10, size: 8)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !120, file: !3, line: 67, baseType: !124, size: 8, offset: 8)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 8, elements: !59)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "pch_init", scope: !120, file: !3, line: 68, baseType: !84, size: 64, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "target_data_length", scope: !120, file: !3, line: 69, baseType: !18, size: 64, offset: 128)
!127 = !DILocalVariable(name: "target_validity", scope: !2, file: !3, line: 115, type: !15)
!128 = !DILocalVariable(name: "i", scope: !129, file: !3, line: 140, type: !18)
!129 = distinct !DILexicalBlock(scope: !2, file: !3, line: 139, column: 3)
!130 = !{i32 2, !"Dwarf Version", i32 4}
!131 = !{i32 2, !"Debug Info Version", i32 3}
!132 = !{i32 1, !"wchar_size", i32 4}
!133 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!134 = distinct !DISubprogram(name: "vprintf", scope: !135, file: !135, line: 39, type: !136, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !147)
!135 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!136 = !DISubroutineType(types: !137)
!137 = !{!11, !138, !139}
!138 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !16)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, size: 192, elements: !141)
!141 = !{!142, !144, !145, !146}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !140, file: !3, baseType: !143, size: 32)
!143 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !140, file: !3, baseType: !143, size: 32, offset: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !140, file: !3, baseType: !15, size: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !140, file: !3, baseType: !15, size: 64, offset: 128)
!147 = !{!148, !149}
!148 = !DILocalVariable(name: "__fmt", arg: 1, scope: !134, file: !135, line: 39, type: !138)
!149 = !DILocalVariable(name: "__arg", arg: 2, scope: !134, file: !135, line: 39, type: !139)
!150 = !DILocation(line: 0, scope: !134)
!151 = !DILocation(line: 41, column: 20, scope: !134)
!152 = !DILocation(line: 41, column: 10, scope: !134)
!153 = !DILocation(line: 41, column: 3, scope: !134)
!154 = distinct !DISubprogram(name: "getchar", scope: !135, file: !135, line: 47, type: !155, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !7)
!155 = !DISubroutineType(types: !156)
!156 = !{!11}
!157 = !DILocation(line: 49, column: 16, scope: !154)
!158 = !DILocation(line: 49, column: 10, scope: !154)
!159 = !DILocation(line: 49, column: 3, scope: !154)
!160 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !135, file: !135, line: 56, type: !161, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !163)
!161 = !DISubroutineType(types: !162)
!162 = !{!11, !24}
!163 = !{!164}
!164 = !DILocalVariable(name: "__fp", arg: 1, scope: !160, file: !135, line: 56, type: !24)
!165 = !DILocation(line: 0, scope: !160)
!166 = !DILocation(line: 58, column: 10, scope: !160)
!167 = !DILocation(line: 58, column: 3, scope: !160)
!168 = distinct !DISubprogram(name: "getc_unlocked", scope: !135, file: !135, line: 66, type: !161, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !169)
!169 = !{!170}
!170 = !DILocalVariable(name: "__fp", arg: 1, scope: !168, file: !135, line: 66, type: !24)
!171 = !DILocation(line: 0, scope: !168)
!172 = !DILocation(line: 68, column: 10, scope: !168)
!173 = !DILocation(line: 68, column: 3, scope: !168)
!174 = distinct !DISubprogram(name: "getchar_unlocked", scope: !135, file: !135, line: 73, type: !155, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !7)
!175 = !DILocation(line: 75, column: 10, scope: !174)
!176 = !DILocation(line: 75, column: 3, scope: !174)
!177 = distinct !DISubprogram(name: "putchar", scope: !135, file: !135, line: 82, type: !178, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !180)
!178 = !DISubroutineType(types: !179)
!179 = !{!11, !11}
!180 = !{!181}
!181 = !DILocalVariable(name: "__c", arg: 1, scope: !177, file: !135, line: 82, type: !11)
!182 = !DILocation(line: 0, scope: !177)
!183 = !DILocation(line: 84, column: 21, scope: !177)
!184 = !DILocation(line: 84, column: 10, scope: !177)
!185 = !DILocation(line: 84, column: 3, scope: !177)
!186 = distinct !DISubprogram(name: "fputc_unlocked", scope: !135, file: !135, line: 91, type: !187, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !189)
!187 = !DISubroutineType(types: !188)
!188 = !{!11, !11, !24}
!189 = !{!190, !191}
!190 = !DILocalVariable(name: "__c", arg: 1, scope: !186, file: !135, line: 91, type: !11)
!191 = !DILocalVariable(name: "__stream", arg: 2, scope: !186, file: !135, line: 91, type: !24)
!192 = !DILocation(line: 0, scope: !186)
!193 = !DILocation(line: 93, column: 10, scope: !186)
!194 = !DILocation(line: 93, column: 3, scope: !186)
!195 = distinct !DISubprogram(name: "putc_unlocked", scope: !135, file: !135, line: 101, type: !187, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !196)
!196 = !{!197, !198}
!197 = !DILocalVariable(name: "__c", arg: 1, scope: !195, file: !135, line: 101, type: !11)
!198 = !DILocalVariable(name: "__stream", arg: 2, scope: !195, file: !135, line: 101, type: !24)
!199 = !DILocation(line: 0, scope: !195)
!200 = !DILocation(line: 103, column: 10, scope: !195)
!201 = !DILocation(line: 103, column: 3, scope: !195)
!202 = distinct !DISubprogram(name: "putchar_unlocked", scope: !135, file: !135, line: 108, type: !178, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !203)
!203 = !{!204}
!204 = !DILocalVariable(name: "__c", arg: 1, scope: !202, file: !135, line: 108, type: !11)
!205 = !DILocation(line: 0, scope: !202)
!206 = !DILocation(line: 110, column: 10, scope: !202)
!207 = !DILocation(line: 110, column: 3, scope: !202)
!208 = distinct !DISubprogram(name: "getline", scope: !135, file: !135, line: 118, type: !209, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !213)
!209 = !DISubroutineType(types: !210)
!210 = !{!211, !12, !212, !24}
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !51, line: 193, baseType: !52)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!213 = !{!214, !215, !216}
!214 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !208, file: !135, line: 118, type: !12)
!215 = !DILocalVariable(name: "__n", arg: 2, scope: !208, file: !135, line: 118, type: !212)
!216 = !DILocalVariable(name: "__stream", arg: 3, scope: !208, file: !135, line: 118, type: !24)
!217 = !DILocation(line: 0, scope: !208)
!218 = !DILocation(line: 120, column: 10, scope: !208)
!219 = !DILocation(line: 120, column: 3, scope: !208)
!220 = distinct !DISubprogram(name: "feof_unlocked", scope: !135, file: !135, line: 128, type: !161, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !221)
!221 = !{!222}
!222 = !DILocalVariable(name: "__stream", arg: 1, scope: !220, file: !135, line: 128, type: !24)
!223 = !DILocation(line: 0, scope: !220)
!224 = !DILocation(line: 130, column: 10, scope: !220)
!225 = !DILocation(line: 130, column: 3, scope: !220)
!226 = distinct !DISubprogram(name: "ferror_unlocked", scope: !135, file: !135, line: 135, type: !161, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !227)
!227 = !{!228}
!228 = !DILocalVariable(name: "__stream", arg: 1, scope: !226, file: !135, line: 135, type: !24)
!229 = !DILocation(line: 0, scope: !226)
!230 = !DILocation(line: 137, column: 10, scope: !226)
!231 = !DILocation(line: 137, column: 3, scope: !226)
!232 = distinct !DISubprogram(name: "tolower", scope: !233, file: !233, line: 207, type: !178, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !234)
!233 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!234 = !{!235}
!235 = !DILocalVariable(name: "__c", arg: 1, scope: !232, file: !233, line: 207, type: !11)
!236 = !DILocation(line: 0, scope: !232)
!237 = !DILocation(line: 209, column: 22, scope: !232)
!238 = !DILocation(line: 209, column: 39, scope: !232)
!239 = !DILocation(line: 209, column: 38, scope: !232)
!240 = !DILocation(line: 209, column: 37, scope: !232)
!241 = !DILocation(line: 209, column: 10, scope: !232)
!242 = !DILocation(line: 209, column: 3, scope: !232)
!243 = distinct !DISubprogram(name: "toupper", scope: !233, file: !233, line: 213, type: !178, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !244)
!244 = !{!245}
!245 = !DILocalVariable(name: "__c", arg: 1, scope: !243, file: !233, line: 213, type: !11)
!246 = !DILocation(line: 0, scope: !243)
!247 = !DILocation(line: 215, column: 22, scope: !243)
!248 = !DILocation(line: 215, column: 39, scope: !243)
!249 = !DILocation(line: 215, column: 38, scope: !243)
!250 = !DILocation(line: 215, column: 37, scope: !243)
!251 = !DILocation(line: 215, column: 10, scope: !243)
!252 = !DILocation(line: 215, column: 3, scope: !243)
!253 = distinct !DISubprogram(name: "atoi", scope: !254, file: !254, line: 361, type: !255, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !257)
!254 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!255 = !DISubroutineType(types: !256)
!256 = !{!11, !16}
!257 = !{!258}
!258 = !DILocalVariable(name: "__nptr", arg: 1, scope: !253, file: !254, line: 361, type: !16)
!259 = !DILocation(line: 0, scope: !253)
!260 = !DILocation(line: 363, column: 16, scope: !253)
!261 = !DILocation(line: 363, column: 10, scope: !253)
!262 = !DILocation(line: 363, column: 3, scope: !253)
!263 = distinct !DISubprogram(name: "atol", scope: !254, file: !254, line: 366, type: !264, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !266)
!264 = !DISubroutineType(types: !265)
!265 = !{!52, !16}
!266 = !{!267}
!267 = !DILocalVariable(name: "__nptr", arg: 1, scope: !263, file: !254, line: 366, type: !16)
!268 = !DILocation(line: 0, scope: !263)
!269 = !DILocation(line: 368, column: 10, scope: !263)
!270 = !DILocation(line: 368, column: 3, scope: !263)
!271 = distinct !DISubprogram(name: "atoll", scope: !254, file: !254, line: 373, type: !272, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !275)
!272 = !DISubroutineType(types: !273)
!273 = !{!274, !16}
!274 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!275 = !{!276}
!276 = !DILocalVariable(name: "__nptr", arg: 1, scope: !271, file: !254, line: 373, type: !16)
!277 = !DILocation(line: 0, scope: !271)
!278 = !DILocation(line: 375, column: 10, scope: !271)
!279 = !DILocation(line: 375, column: 3, scope: !271)
!280 = distinct !DISubprogram(name: "bsearch", scope: !281, file: !281, line: 20, type: !282, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !290)
!281 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!282 = !DISubroutineType(types: !283)
!283 = !{!15, !284, !284, !18, !18, !286}
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !254, line: 808, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{!11, !284, !284}
!290 = !{!291, !292, !293, !294, !295, !296, !297, !298, !299, !300}
!291 = !DILocalVariable(name: "__key", arg: 1, scope: !280, file: !281, line: 20, type: !284)
!292 = !DILocalVariable(name: "__base", arg: 2, scope: !280, file: !281, line: 20, type: !284)
!293 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !280, file: !281, line: 20, type: !18)
!294 = !DILocalVariable(name: "__size", arg: 4, scope: !280, file: !281, line: 20, type: !18)
!295 = !DILocalVariable(name: "__compar", arg: 5, scope: !280, file: !281, line: 21, type: !286)
!296 = !DILocalVariable(name: "__l", scope: !280, file: !281, line: 23, type: !18)
!297 = !DILocalVariable(name: "__u", scope: !280, file: !281, line: 23, type: !18)
!298 = !DILocalVariable(name: "__idx", scope: !280, file: !281, line: 23, type: !18)
!299 = !DILocalVariable(name: "__p", scope: !280, file: !281, line: 24, type: !284)
!300 = !DILocalVariable(name: "__comparison", scope: !280, file: !281, line: 25, type: !11)
!301 = !DILocation(line: 0, scope: !280)
!302 = !DILocation(line: 29, column: 3, scope: !280)
!303 = !DILocation(line: 27, column: 7, scope: !280)
!304 = !DILocation(line: 29, column: 14, scope: !280)
!305 = !DILocation(line: 31, column: 20, scope: !306)
!306 = distinct !DILexicalBlock(scope: !280, file: !281, line: 30, column: 5)
!307 = !DILocation(line: 31, column: 27, scope: !306)
!308 = !DILocation(line: 32, column: 56, scope: !306)
!309 = !DILocation(line: 32, column: 47, scope: !306)
!310 = !DILocation(line: 33, column: 22, scope: !306)
!311 = !DILocation(line: 34, column: 24, scope: !312)
!312 = distinct !DILexicalBlock(scope: !306, file: !281, line: 34, column: 11)
!313 = !DILocation(line: 34, column: 11, scope: !306)
!314 = !DILocation(line: 36, column: 29, scope: !315)
!315 = distinct !DILexicalBlock(scope: !312, file: !281, line: 36, column: 16)
!316 = !DILocation(line: 36, column: 16, scope: !312)
!317 = !DILocation(line: 37, column: 14, scope: !315)
!318 = distinct !{!318, !302, !319}
!319 = !DILocation(line: 40, column: 5, scope: !280)
!320 = !DILocation(line: 43, column: 1, scope: !280)
!321 = distinct !DISubprogram(name: "atof", scope: !322, file: !322, line: 25, type: !323, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !326)
!322 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!323 = !DISubroutineType(types: !324)
!324 = !{!325, !16}
!325 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!326 = !{!327}
!327 = !DILocalVariable(name: "__nptr", arg: 1, scope: !321, file: !322, line: 25, type: !16)
!328 = !DILocation(line: 0, scope: !321)
!329 = !DILocation(line: 27, column: 10, scope: !321)
!330 = !DILocation(line: 27, column: 3, scope: !321)
!331 = distinct !DISubprogram(name: "strtoimax", scope: !332, file: !332, line: 324, type: !333, scopeLine: 326, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !339)
!332 = !DIFile(filename: "/usr/include/inttypes.h", directory: "")
!333 = !DISubroutineType(types: !334)
!334 = !{!335, !138, !338, !11}
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !336, line: 101, baseType: !337)
!336 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !51, line: 72, baseType: !52)
!338 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !12)
!339 = !{!340, !341, !342}
!340 = !DILocalVariable(name: "nptr", arg: 1, scope: !331, file: !332, line: 324, type: !138)
!341 = !DILocalVariable(name: "endptr", arg: 2, scope: !331, file: !332, line: 324, type: !338)
!342 = !DILocalVariable(name: "base", arg: 3, scope: !331, file: !332, line: 324, type: !11)
!343 = !DILocation(line: 0, scope: !331)
!344 = !DILocation(line: 327, column: 10, scope: !331)
!345 = !DILocation(line: 327, column: 3, scope: !331)
!346 = distinct !DISubprogram(name: "strtoumax", scope: !332, file: !332, line: 336, type: !347, scopeLine: 338, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !351)
!347 = !DISubroutineType(types: !348)
!348 = !{!349, !138, !338, !11}
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !336, line: 102, baseType: !350)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !51, line: 73, baseType: !20)
!351 = !{!352, !353, !354}
!352 = !DILocalVariable(name: "nptr", arg: 1, scope: !346, file: !332, line: 336, type: !138)
!353 = !DILocalVariable(name: "endptr", arg: 2, scope: !346, file: !332, line: 336, type: !338)
!354 = !DILocalVariable(name: "base", arg: 3, scope: !346, file: !332, line: 336, type: !11)
!355 = !DILocation(line: 0, scope: !346)
!356 = !DILocation(line: 339, column: 10, scope: !346)
!357 = !DILocation(line: 339, column: 3, scope: !346)
!358 = distinct !DISubprogram(name: "wcstoimax", scope: !332, file: !332, line: 348, type: !359, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !368)
!359 = !DISubroutineType(types: !360)
!360 = !{!335, !361, !365, !11}
!361 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gwchar_t", file: !332, line: 34, baseType: !11)
!365 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !366)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!368 = !{!369, !370, !371}
!369 = !DILocalVariable(name: "nptr", arg: 1, scope: !358, file: !332, line: 348, type: !361)
!370 = !DILocalVariable(name: "endptr", arg: 2, scope: !358, file: !332, line: 348, type: !365)
!371 = !DILocalVariable(name: "base", arg: 3, scope: !358, file: !332, line: 348, type: !11)
!372 = !DILocation(line: 0, scope: !358)
!373 = !DILocation(line: 351, column: 10, scope: !358)
!374 = !DILocation(line: 351, column: 3, scope: !358)
!375 = distinct !DISubprogram(name: "wcstoumax", scope: !332, file: !332, line: 362, type: !376, scopeLine: 364, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !378)
!376 = !DISubroutineType(types: !377)
!377 = !{!349, !361, !365, !11}
!378 = !{!379, !380, !381}
!379 = !DILocalVariable(name: "nptr", arg: 1, scope: !375, file: !332, line: 362, type: !361)
!380 = !DILocalVariable(name: "endptr", arg: 2, scope: !375, file: !332, line: 362, type: !365)
!381 = !DILocalVariable(name: "base", arg: 3, scope: !375, file: !332, line: 362, type: !11)
!382 = !DILocation(line: 0, scope: !375)
!383 = !DILocation(line: 365, column: 10, scope: !375)
!384 = !DILocation(line: 365, column: 3, scope: !375)
!385 = distinct !DISubprogram(name: "stat", scope: !386, file: !386, line: 453, type: !387, scopeLine: 454, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !426)
!386 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "")
!387 = !DISubroutineType(types: !388)
!388 = !{!11, !16, !389}
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !391, line: 46, size: 1152, elements: !392)
!391 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!392 = !{!393, !395, !397, !399, !401, !403, !405, !406, !407, !408, !410, !412, !420, !421, !422}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !390, file: !391, line: 48, baseType: !394, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !51, line: 145, baseType: !20)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !390, file: !391, line: 53, baseType: !396, size: 64, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !51, line: 148, baseType: !20)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !390, file: !391, line: 61, baseType: !398, size: 64, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !51, line: 151, baseType: !20)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !390, file: !391, line: 62, baseType: !400, size: 32, offset: 192)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !51, line: 150, baseType: !143)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !390, file: !391, line: 64, baseType: !402, size: 32, offset: 224)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !51, line: 146, baseType: !143)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !390, file: !391, line: 65, baseType: !404, size: 32, offset: 256)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !51, line: 147, baseType: !143)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !390, file: !391, line: 67, baseType: !11, size: 32, offset: 288)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !390, file: !391, line: 69, baseType: !394, size: 64, offset: 320)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !390, file: !391, line: 74, baseType: !50, size: 64, offset: 384)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !390, file: !391, line: 78, baseType: !409, size: 64, offset: 448)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !51, line: 174, baseType: !52)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !390, file: !391, line: 80, baseType: !411, size: 64, offset: 512)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !51, line: 179, baseType: !52)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !390, file: !391, line: 91, baseType: !413, size: 128, offset: 576)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !414, line: 10, size: 128, elements: !415)
!414 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!415 = !{!416, !418}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !413, file: !414, line: 12, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !51, line: 160, baseType: !52)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !413, file: !414, line: 16, baseType: !419, size: 64, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !51, line: 196, baseType: !52)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !390, file: !391, line: 92, baseType: !413, size: 128, offset: 704)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !390, file: !391, line: 93, baseType: !413, size: 128, offset: 832)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !390, file: !391, line: 106, baseType: !423, size: 192, offset: 960)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !419, size: 192, elements: !424)
!424 = !{!425}
!425 = !DISubrange(count: 3)
!426 = !{!427, !428}
!427 = !DILocalVariable(name: "__path", arg: 1, scope: !385, file: !386, line: 453, type: !16)
!428 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !385, file: !386, line: 453, type: !389)
!429 = !DILocation(line: 0, scope: !385)
!430 = !DILocation(line: 455, column: 10, scope: !385)
!431 = !DILocation(line: 455, column: 3, scope: !385)
!432 = distinct !DISubprogram(name: "lstat", scope: !386, file: !386, line: 460, type: !387, scopeLine: 461, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !433)
!433 = !{!434, !435}
!434 = !DILocalVariable(name: "__path", arg: 1, scope: !432, file: !386, line: 460, type: !16)
!435 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !432, file: !386, line: 460, type: !389)
!436 = !DILocation(line: 0, scope: !432)
!437 = !DILocation(line: 462, column: 10, scope: !432)
!438 = !DILocation(line: 462, column: 3, scope: !432)
!439 = distinct !DISubprogram(name: "fstat", scope: !386, file: !386, line: 467, type: !440, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !442)
!440 = !DISubroutineType(types: !441)
!441 = !{!11, !11, !389}
!442 = !{!443, !444}
!443 = !DILocalVariable(name: "__fd", arg: 1, scope: !439, file: !386, line: 467, type: !11)
!444 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !439, file: !386, line: 467, type: !389)
!445 = !DILocation(line: 0, scope: !439)
!446 = !DILocation(line: 469, column: 10, scope: !439)
!447 = !DILocation(line: 469, column: 3, scope: !439)
!448 = distinct !DISubprogram(name: "fstatat", scope: !386, file: !386, line: 474, type: !449, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !451)
!449 = !DISubroutineType(types: !450)
!450 = !{!11, !11, !16, !389, !11}
!451 = !{!452, !453, !454, !455}
!452 = !DILocalVariable(name: "__fd", arg: 1, scope: !448, file: !386, line: 474, type: !11)
!453 = !DILocalVariable(name: "__filename", arg: 2, scope: !448, file: !386, line: 474, type: !16)
!454 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !448, file: !386, line: 474, type: !389)
!455 = !DILocalVariable(name: "__flag", arg: 4, scope: !448, file: !386, line: 474, type: !11)
!456 = !DILocation(line: 0, scope: !448)
!457 = !DILocation(line: 477, column: 10, scope: !448)
!458 = !DILocation(line: 477, column: 3, scope: !448)
!459 = distinct !DISubprogram(name: "mknod", scope: !386, file: !386, line: 483, type: !460, scopeLine: 484, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !462)
!460 = !DISubroutineType(types: !461)
!461 = !{!11, !16, !400, !394}
!462 = !{!463, !464, !465}
!463 = !DILocalVariable(name: "__path", arg: 1, scope: !459, file: !386, line: 483, type: !16)
!464 = !DILocalVariable(name: "__mode", arg: 2, scope: !459, file: !386, line: 483, type: !400)
!465 = !DILocalVariable(name: "__dev", arg: 3, scope: !459, file: !386, line: 483, type: !394)
!466 = !DILocation(line: 0, scope: !459)
!467 = !DILocation(line: 485, column: 10, scope: !459)
!468 = !DILocation(line: 485, column: 3, scope: !459)
!469 = distinct !DISubprogram(name: "mknodat", scope: !386, file: !386, line: 491, type: !470, scopeLine: 493, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !472)
!470 = !DISubroutineType(types: !471)
!471 = !{!11, !11, !16, !400, !394}
!472 = !{!473, !474, !475, !476}
!473 = !DILocalVariable(name: "__fd", arg: 1, scope: !469, file: !386, line: 491, type: !11)
!474 = !DILocalVariable(name: "__path", arg: 2, scope: !469, file: !386, line: 491, type: !16)
!475 = !DILocalVariable(name: "__mode", arg: 3, scope: !469, file: !386, line: 491, type: !400)
!476 = !DILocalVariable(name: "__dev", arg: 4, scope: !469, file: !386, line: 491, type: !394)
!477 = !DILocation(line: 0, scope: !469)
!478 = !DILocation(line: 494, column: 10, scope: !469)
!479 = !DILocation(line: 494, column: 3, scope: !469)
!480 = distinct !DISubprogram(name: "stat64", scope: !386, file: !386, line: 502, type: !481, scopeLine: 503, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !503)
!481 = !DISubroutineType(types: !482)
!482 = !{!11, !16, !483}
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !391, line: 119, size: 1152, elements: !485)
!485 = !{!486, !487, !489, !490, !491, !492, !493, !494, !495, !496, !497, !499, !500, !501, !502}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !484, file: !391, line: 121, baseType: !394, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !484, file: !391, line: 123, baseType: !488, size: 64, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !51, line: 149, baseType: !20)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !484, file: !391, line: 124, baseType: !398, size: 64, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !484, file: !391, line: 125, baseType: !400, size: 32, offset: 192)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !484, file: !391, line: 132, baseType: !402, size: 32, offset: 224)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !484, file: !391, line: 133, baseType: !404, size: 32, offset: 256)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !484, file: !391, line: 135, baseType: !11, size: 32, offset: 288)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !484, file: !391, line: 136, baseType: !394, size: 64, offset: 320)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !484, file: !391, line: 137, baseType: !50, size: 64, offset: 384)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !484, file: !391, line: 143, baseType: !409, size: 64, offset: 448)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !484, file: !391, line: 144, baseType: !498, size: 64, offset: 512)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !51, line: 180, baseType: !52)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !484, file: !391, line: 152, baseType: !413, size: 128, offset: 576)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !484, file: !391, line: 153, baseType: !413, size: 128, offset: 704)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !484, file: !391, line: 154, baseType: !413, size: 128, offset: 832)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !484, file: !391, line: 164, baseType: !423, size: 192, offset: 960)
!503 = !{!504, !505}
!504 = !DILocalVariable(name: "__path", arg: 1, scope: !480, file: !386, line: 502, type: !16)
!505 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !480, file: !386, line: 502, type: !483)
!506 = !DILocation(line: 0, scope: !480)
!507 = !DILocation(line: 504, column: 10, scope: !480)
!508 = !DILocation(line: 504, column: 3, scope: !480)
!509 = distinct !DISubprogram(name: "lstat64", scope: !386, file: !386, line: 509, type: !481, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !510)
!510 = !{!511, !512}
!511 = !DILocalVariable(name: "__path", arg: 1, scope: !509, file: !386, line: 509, type: !16)
!512 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !509, file: !386, line: 509, type: !483)
!513 = !DILocation(line: 0, scope: !509)
!514 = !DILocation(line: 511, column: 10, scope: !509)
!515 = !DILocation(line: 511, column: 3, scope: !509)
!516 = distinct !DISubprogram(name: "fstat64", scope: !386, file: !386, line: 516, type: !517, scopeLine: 517, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !519)
!517 = !DISubroutineType(types: !518)
!518 = !{!11, !11, !483}
!519 = !{!520, !521}
!520 = !DILocalVariable(name: "__fd", arg: 1, scope: !516, file: !386, line: 516, type: !11)
!521 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !516, file: !386, line: 516, type: !483)
!522 = !DILocation(line: 0, scope: !516)
!523 = !DILocation(line: 518, column: 10, scope: !516)
!524 = !DILocation(line: 518, column: 3, scope: !516)
!525 = distinct !DISubprogram(name: "fstatat64", scope: !386, file: !386, line: 523, type: !526, scopeLine: 525, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !528)
!526 = !DISubroutineType(types: !527)
!527 = !{!11, !11, !16, !483, !11}
!528 = !{!529, !530, !531, !532}
!529 = !DILocalVariable(name: "__fd", arg: 1, scope: !525, file: !386, line: 523, type: !11)
!530 = !DILocalVariable(name: "__filename", arg: 2, scope: !525, file: !386, line: 523, type: !16)
!531 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !525, file: !386, line: 523, type: !483)
!532 = !DILocalVariable(name: "__flag", arg: 4, scope: !525, file: !386, line: 523, type: !11)
!533 = !DILocation(line: 0, scope: !525)
!534 = !DILocation(line: 526, column: 10, scope: !525)
!535 = !DILocation(line: 526, column: 3, scope: !525)
!536 = !DILocation(line: 114, column: 3, scope: !2)
!537 = !DILocation(line: 119, column: 7, scope: !538)
!538 = distinct !DILexicalBlock(scope: !2, file: !3, line: 119, column: 7)
!539 = !DILocation(line: 119, column: 7, scope: !2)
!540 = !DILocation(line: 121, column: 16, scope: !541)
!541 = distinct !DILexicalBlock(scope: !538, file: !3, line: 120, column: 5)
!542 = !DILocation(line: 121, column: 7, scope: !541)
!543 = !DILocation(line: 122, column: 36, scope: !541)
!544 = !DILocation(line: 122, column: 7, scope: !541)
!545 = !DILocation(line: 123, column: 20, scope: !541)
!546 = !DILocation(line: 123, column: 7, scope: !541)
!547 = !DILocation(line: 124, column: 5, scope: !541)
!548 = !DILocation(line: 127, column: 8, scope: !549)
!549 = distinct !DILexicalBlock(scope: !2, file: !3, line: 127, column: 7)
!550 = !DILocation(line: 127, column: 7, scope: !2)
!551 = !DILocation(line: 130, column: 7, scope: !2)
!552 = !DILocation(line: 0, scope: !2)
!553 = !DILocation(line: 131, column: 9, scope: !554)
!554 = distinct !DILexicalBlock(scope: !2, file: !3, line: 131, column: 7)
!555 = !DILocation(line: 131, column: 7, scope: !2)
!556 = !DILocation(line: 132, column: 61, scope: !554)
!557 = !DILocation(line: 132, column: 5, scope: !554)
!558 = !DILocation(line: 133, column: 15, scope: !2)
!559 = !DILocation(line: 135, column: 3, scope: !2)
!560 = !DILocation(line: 137, column: 3, scope: !2)
!561 = !DILocation(line: 138, column: 23, scope: !2)
!562 = !DILocation(line: 138, column: 21, scope: !2)
!563 = !DILocation(line: 0, scope: !129)
!564 = !DILocation(line: 141, column: 10, scope: !565)
!565 = distinct !DILexicalBlock(scope: !129, file: !3, line: 141, column: 5)
!566 = !DILocation(line: 141, column: 5, scope: !565)
!567 = !DILocation(line: 143, column: 15, scope: !568)
!568 = distinct !DILexicalBlock(scope: !569, file: !3, line: 142, column: 7)
!569 = distinct !DILexicalBlock(scope: !565, file: !3, line: 141, column: 5)
!570 = !DILocation(line: 143, column: 2, scope: !568)
!571 = !DILocation(line: 143, column: 13, scope: !568)
!572 = !DILocation(line: 144, column: 2, scope: !568)
!573 = !DILocation(line: 141, column: 5, scope: !569)
!574 = distinct !{!574, !566, !575}
!575 = !DILocation(line: 145, column: 7, scope: !565)
!576 = !DILocation(line: 147, column: 5, scope: !2)
!577 = !DILocation(line: 147, column: 14, scope: !2)
!578 = !DILocation(line: 148, column: 29, scope: !2)
!579 = !DILocation(line: 148, column: 50, scope: !2)
!580 = !DILocation(line: 148, column: 21, scope: !2)
!581 = !DILocation(line: 150, column: 7, scope: !582)
!582 = distinct !DILexicalBlock(scope: !2, file: !3, line: 150, column: 7)
!583 = !DILocation(line: 150, column: 48, scope: !582)
!584 = !DILocation(line: 151, column: 7, scope: !582)
!585 = !DILocation(line: 151, column: 10, scope: !582)
!586 = !DILocation(line: 151, column: 49, scope: !582)
!587 = !DILocation(line: 152, column: 7, scope: !582)
!588 = !DILocation(line: 152, column: 10, scope: !582)
!589 = !DILocation(line: 152, column: 40, scope: !582)
!590 = !DILocation(line: 153, column: 7, scope: !582)
!591 = !DILocation(line: 153, column: 37, scope: !582)
!592 = !DILocation(line: 153, column: 10, scope: !582)
!593 = !DILocation(line: 153, column: 63, scope: !582)
!594 = !DILocation(line: 150, column: 7, scope: !2)
!595 = !DILocation(line: 154, column: 44, scope: !582)
!596 = !DILocation(line: 154, column: 5, scope: !582)
!597 = !DILocation(line: 158, column: 7, scope: !598)
!598 = distinct !DILexicalBlock(scope: !2, file: !3, line: 158, column: 7)
!599 = !DILocation(line: 158, column: 21, scope: !598)
!600 = !DILocation(line: 159, column: 7, scope: !598)
!601 = !DILocation(line: 159, column: 10, scope: !598)
!602 = !DILocation(line: 159, column: 38, scope: !598)
!603 = !DILocation(line: 158, column: 7, scope: !2)
!604 = !DILocation(line: 160, column: 52, scope: !598)
!605 = !DILocation(line: 160, column: 5, scope: !598)
!606 = !DILocation(line: 162, column: 30, scope: !2)
!607 = !DILocation(line: 162, column: 23, scope: !2)
!608 = !DILocation(line: 162, column: 21, scope: !2)
!609 = !DILocation(line: 165, column: 5, scope: !2)
!610 = !DILocation(line: 165, column: 18, scope: !2)
!611 = !DILocation(line: 165, column: 3, scope: !2)
!612 = !DILocation(line: 167, column: 19, scope: !2)
!613 = !DILocation(line: 167, column: 3, scope: !2)
!614 = !DILocation(line: 168, column: 1, scope: !2)
!615 = distinct !DISubprogram(name: "c_common_print_pch_checksum", scope: !3, file: !3, line: 491, type: !616, scopeLine: 492, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !618)
!616 = !DISubroutineType(types: !617)
!617 = !{null, !24}
!618 = !{!619, !620}
!619 = !DILocalVariable(name: "f", arg: 1, scope: !615, file: !3, line: 491, type: !24)
!620 = !DILocalVariable(name: "i", scope: !615, file: !3, line: 493, type: !11)
!621 = !DILocation(line: 0, scope: !615)
!622 = !DILocation(line: 494, column: 3, scope: !615)
!623 = !DILocation(line: 495, column: 8, scope: !624)
!624 = distinct !DILexicalBlock(scope: !615, file: !3, line: 495, column: 3)
!625 = !DILocation(line: 0, scope: !624)
!626 = !DILocation(line: 495, column: 17, scope: !627)
!627 = distinct !DILexicalBlock(scope: !624, file: !3, line: 495, column: 3)
!628 = !DILocation(line: 495, column: 3, scope: !624)
!629 = !DILocation(line: 496, column: 25, scope: !627)
!630 = !DILocation(line: 496, column: 5, scope: !627)
!631 = !DILocation(line: 495, column: 24, scope: !627)
!632 = !DILocation(line: 495, column: 3, scope: !627)
!633 = distinct !{!633, !628, !634}
!634 = !DILocation(line: 496, column: 47, scope: !624)
!635 = !DILocation(line: 497, column: 3, scope: !615)
!636 = !DILocation(line: 498, column: 1, scope: !615)
!637 = distinct !DISubprogram(name: "c_common_write_pch", scope: !3, file: !3, line: 174, type: !4, scopeLine: 175, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !638)
!638 = !{!639, !640, !641, !642, !646}
!639 = !DILocalVariable(name: "buf", scope: !637, file: !3, line: 176, type: !13)
!640 = !DILocalVariable(name: "asm_file_end", scope: !637, file: !3, line: 177, type: !52)
!641 = !DILocalVariable(name: "written", scope: !637, file: !3, line: 178, type: !52)
!642 = !DILocalVariable(name: "h", scope: !637, file: !3, line: 179, type: !643)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "c_pch_header", file: !3, line: 72, size: 64, elements: !644)
!644 = !{!645}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "asm_size", scope: !643, file: !3, line: 74, baseType: !20, size: 64)
!646 = !DILocalVariable(name: "size", scope: !647, file: !3, line: 198, type: !52)
!647 = distinct !DILexicalBlock(scope: !648, file: !3, line: 197, column: 5)
!648 = distinct !DILexicalBlock(scope: !649, file: !3, line: 196, column: 3)
!649 = distinct !DILexicalBlock(scope: !637, file: !3, line: 196, column: 3)
!650 = !DILocation(line: 179, column: 3, scope: !637)
!651 = !DILocation(line: 181, column: 5, scope: !637)
!652 = !DILocation(line: 181, column: 18, scope: !637)
!653 = !DILocation(line: 181, column: 3, scope: !637)
!654 = !DILocation(line: 183, column: 23, scope: !637)
!655 = !DILocation(line: 183, column: 33, scope: !637)
!656 = !DILocation(line: 183, column: 3, scope: !637)
!657 = !DILocation(line: 185, column: 25, scope: !637)
!658 = !DILocation(line: 185, column: 18, scope: !637)
!659 = !DILocation(line: 0, scope: !637)
!660 = !DILocation(line: 186, column: 31, scope: !637)
!661 = !DILocation(line: 186, column: 29, scope: !637)
!662 = !DILocation(line: 186, column: 5, scope: !637)
!663 = !DILocation(line: 186, column: 14, scope: !637)
!664 = !DILocation(line: 188, column: 34, scope: !665)
!665 = distinct !DILexicalBlock(scope: !637, file: !3, line: 188, column: 7)
!666 = !DILocation(line: 188, column: 7, scope: !665)
!667 = !DILocation(line: 188, column: 47, scope: !665)
!668 = !DILocation(line: 188, column: 7, scope: !637)
!669 = !DILocation(line: 189, column: 41, scope: !665)
!670 = !DILocation(line: 189, column: 5, scope: !665)
!671 = !DILocation(line: 191, column: 9, scope: !637)
!672 = !DILocation(line: 193, column: 14, scope: !673)
!673 = distinct !DILexicalBlock(scope: !637, file: !3, line: 193, column: 7)
!674 = !DILocation(line: 193, column: 28, scope: !673)
!675 = !DILocation(line: 193, column: 7, scope: !673)
!676 = !DILocation(line: 193, column: 57, scope: !673)
!677 = !DILocation(line: 193, column: 7, scope: !637)
!678 = !DILocation(line: 194, column: 43, scope: !673)
!679 = !DILocation(line: 194, column: 5, scope: !673)
!680 = !DILocation(line: 196, column: 18, scope: !649)
!681 = !DILocation(line: 196, column: 8, scope: !649)
!682 = !DILocation(line: 0, scope: !649)
!683 = !DILocation(line: 196, column: 45, scope: !648)
!684 = !DILocation(line: 196, column: 3, scope: !649)
!685 = !DILocation(line: 198, column: 32, scope: !647)
!686 = !DILocation(line: 0, scope: !647)
!687 = !DILocation(line: 199, column: 11, scope: !647)
!688 = !DILocation(line: 201, column: 32, scope: !689)
!689 = distinct !DILexicalBlock(scope: !647, file: !3, line: 201, column: 11)
!690 = !DILocation(line: 201, column: 11, scope: !689)
!691 = !DILocation(line: 201, column: 46, scope: !689)
!692 = !DILocation(line: 201, column: 11, scope: !647)
!693 = !DILocation(line: 202, column: 37, scope: !689)
!694 = !DILocation(line: 202, column: 2, scope: !689)
!695 = !DILocation(line: 203, column: 33, scope: !696)
!696 = distinct !DILexicalBlock(scope: !647, file: !3, line: 203, column: 11)
!697 = !DILocation(line: 203, column: 11, scope: !696)
!698 = !DILocation(line: 203, column: 46, scope: !696)
!699 = !DILocation(line: 203, column: 11, scope: !647)
!700 = !DILocation(line: 204, column: 38, scope: !696)
!701 = !DILocation(line: 204, column: 2, scope: !696)
!702 = !DILocation(line: 205, column: 15, scope: !647)
!703 = !DILocation(line: 196, column: 3, scope: !648)
!704 = distinct !{!704, !684, !705}
!705 = !DILocation(line: 206, column: 5, scope: !649)
!706 = !DILocation(line: 207, column: 3, scope: !637)
!707 = !DILocation(line: 210, column: 14, scope: !708)
!708 = distinct !DILexicalBlock(scope: !637, file: !3, line: 210, column: 7)
!709 = !DILocation(line: 210, column: 7, scope: !708)
!710 = !DILocation(line: 210, column: 41, scope: !708)
!711 = !DILocation(line: 210, column: 7, scope: !637)
!712 = !DILocation(line: 211, column: 43, scope: !708)
!713 = !DILocation(line: 211, column: 5, scope: !708)
!714 = !DILocation(line: 213, column: 16, scope: !637)
!715 = !DILocation(line: 213, column: 3, scope: !637)
!716 = !DILocation(line: 214, column: 24, scope: !637)
!717 = !DILocation(line: 214, column: 34, scope: !637)
!718 = !DILocation(line: 214, column: 3, scope: !637)
!719 = !DILocation(line: 216, column: 14, scope: !720)
!720 = distinct !DILexicalBlock(scope: !637, file: !3, line: 216, column: 7)
!721 = !DILocation(line: 216, column: 7, scope: !720)
!722 = !DILocation(line: 216, column: 40, scope: !720)
!723 = !DILocation(line: 217, column: 7, scope: !720)
!724 = !DILocation(line: 217, column: 18, scope: !720)
!725 = !DILocation(line: 217, column: 49, scope: !720)
!726 = !DILocation(line: 217, column: 10, scope: !720)
!727 = !DILocation(line: 217, column: 62, scope: !720)
!728 = !DILocation(line: 216, column: 7, scope: !637)
!729 = !DILocation(line: 218, column: 41, scope: !720)
!730 = !DILocation(line: 218, column: 5, scope: !720)
!731 = !DILocation(line: 220, column: 11, scope: !637)
!732 = !DILocation(line: 220, column: 3, scope: !637)
!733 = !DILocation(line: 221, column: 1, scope: !637)
!734 = !DILocation(line: 99, column: 3, scope: !101)
!735 = !DILocation(line: 100, column: 32, scope: !101)
!736 = !DILocation(line: 100, column: 15, scope: !101)
!737 = !DILocation(line: 100, column: 13, scope: !101)
!738 = !DILocation(line: 102, column: 3, scope: !101)
!739 = distinct !DISubprogram(name: "c_common_valid_pch", scope: !3, file: !3, line: 229, type: !740, scopeLine: 230, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !747)
!740 = !DISubroutineType(types: !741)
!741 = !{!11, !742, !16, !11}
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_reader", file: !744, line: 31, baseType: !745)
!744 = !DIFile(filename: "./cpplib.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!745 = !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_reader", file: !746, line: 91, flags: DIFlagFwdDecl)
!746 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!747 = !{!748, !749, !750, !751, !752, !753, !757, !758, !759, !761, !763}
!748 = !DILocalVariable(name: "pfile", arg: 1, scope: !739, file: !3, line: 229, type: !742)
!749 = !DILocalVariable(name: "name", arg: 2, scope: !739, file: !3, line: 229, type: !16)
!750 = !DILocalVariable(name: "fd", arg: 3, scope: !739, file: !3, line: 229, type: !11)
!751 = !DILocalVariable(name: "sizeread", scope: !739, file: !3, line: 231, type: !11)
!752 = !DILocalVariable(name: "result", scope: !739, file: !3, line: 232, type: !11)
!753 = !DILocalVariable(name: "ident", scope: !739, file: !3, line: 233, type: !754)
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 192, elements: !755)
!755 = !{!756}
!756 = !DISubrange(count: 24)
!757 = !DILocalVariable(name: "pch_ident", scope: !739, file: !3, line: 234, type: !16)
!758 = !DILocalVariable(name: "v", scope: !739, file: !3, line: 235, type: !120)
!759 = !DILocalVariable(name: "i", scope: !760, file: !3, line: 303, type: !18)
!760 = distinct !DILexicalBlock(scope: !739, file: !3, line: 302, column: 3)
!761 = !DILocalVariable(name: "this_file_data", scope: !762, file: !3, line: 331, type: !15)
!762 = distinct !DILexicalBlock(scope: !739, file: !3, line: 330, column: 3)
!763 = !DILocalVariable(name: "msg", scope: !762, file: !3, line: 332, type: !16)
!764 = !DILocation(line: 0, scope: !739)
!765 = !DILocation(line: 233, column: 3, scope: !739)
!766 = !DILocation(line: 233, column: 8, scope: !739)
!767 = !DILocation(line: 235, column: 3, scope: !739)
!768 = !DILocation(line: 240, column: 3, scope: !739)
!769 = !DILocation(line: 242, column: 14, scope: !739)
!770 = !DILocation(line: 243, column: 7, scope: !739)
!771 = !DILocation(line: 244, column: 5, scope: !772)
!772 = distinct !DILexicalBlock(scope: !739, file: !3, line: 243, column: 7)
!773 = !DILocation(line: 247, column: 11, scope: !774)
!774 = distinct !DILexicalBlock(scope: !775, file: !3, line: 247, column: 11)
!775 = distinct !DILexicalBlock(scope: !776, file: !3, line: 246, column: 5)
!776 = distinct !DILexicalBlock(scope: !772, file: !3, line: 245, column: 12)
!777 = !DILocation(line: 247, column: 36, scope: !774)
!778 = !DILocation(line: 247, column: 11, scope: !775)
!779 = !DILocation(line: 248, column: 2, scope: !774)
!780 = !DILocation(line: 253, column: 15, scope: !739)
!781 = !DILocation(line: 254, column: 7, scope: !782)
!782 = distinct !DILexicalBlock(scope: !739, file: !3, line: 254, column: 7)
!783 = !DILocation(line: 254, column: 47, scope: !782)
!784 = !DILocation(line: 254, column: 7, scope: !739)
!785 = !DILocation(line: 256, column: 11, scope: !786)
!786 = distinct !DILexicalBlock(scope: !787, file: !3, line: 256, column: 11)
!787 = distinct !DILexicalBlock(scope: !782, file: !3, line: 255, column: 5)
!788 = !DILocation(line: 256, column: 36, scope: !786)
!789 = !DILocation(line: 256, column: 11, scope: !787)
!790 = !DILocation(line: 258, column: 8, scope: !791)
!791 = distinct !DILexicalBlock(scope: !792, file: !3, line: 258, column: 8)
!792 = distinct !DILexicalBlock(scope: !786, file: !3, line: 257, column: 2)
!793 = !DILocation(line: 258, column: 37, scope: !791)
!794 = !DILocation(line: 258, column: 8, scope: !792)
!795 = !DILocation(line: 261, column: 6, scope: !791)
!796 = !DILocation(line: 263, column: 13, scope: !797)
!797 = distinct !DILexicalBlock(scope: !791, file: !3, line: 263, column: 13)
!798 = !DILocation(line: 263, column: 42, scope: !797)
!799 = !DILocation(line: 263, column: 13, scope: !791)
!800 = !DILocation(line: 266, column: 21, scope: !797)
!801 = !DILocation(line: 265, column: 6, scope: !797)
!802 = !DILocation(line: 269, column: 6, scope: !797)
!803 = !DILocation(line: 273, column: 21, scope: !804)
!804 = distinct !DILexicalBlock(scope: !739, file: !3, line: 273, column: 7)
!805 = !DILocation(line: 273, column: 7, scope: !804)
!806 = !DILocation(line: 273, column: 62, scope: !804)
!807 = !DILocation(line: 273, column: 7, scope: !739)
!808 = !DILocation(line: 275, column: 11, scope: !809)
!809 = distinct !DILexicalBlock(scope: !810, file: !3, line: 275, column: 11)
!810 = distinct !DILexicalBlock(scope: !804, file: !3, line: 274, column: 5)
!811 = !DILocation(line: 275, column: 36, scope: !809)
!812 = !DILocation(line: 275, column: 11, scope: !810)
!813 = !DILocation(line: 276, column: 2, scope: !809)
!814 = !DILocation(line: 284, column: 7, scope: !815)
!815 = distinct !DILexicalBlock(scope: !739, file: !3, line: 284, column: 7)
!816 = !DILocation(line: 284, column: 33, scope: !815)
!817 = !DILocation(line: 284, column: 7, scope: !739)
!818 = !DILocation(line: 285, column: 5, scope: !815)
!819 = !DILocation(line: 290, column: 9, scope: !820)
!820 = distinct !DILexicalBlock(scope: !739, file: !3, line: 290, column: 7)
!821 = !DILocation(line: 290, column: 7, scope: !820)
!822 = !DILocation(line: 290, column: 28, scope: !820)
!823 = !DILocation(line: 290, column: 25, scope: !820)
!824 = !DILocation(line: 291, column: 24, scope: !820)
!825 = !DILocation(line: 291, column: 7, scope: !820)
!826 = !DILocation(line: 0, scope: !827)
!827 = distinct !DILexicalBlock(scope: !828, file: !3, line: 305, column: 11)
!828 = distinct !DILexicalBlock(scope: !829, file: !3, line: 304, column: 5)
!829 = distinct !DILexicalBlock(scope: !760, file: !3, line: 304, column: 5)
!830 = !DILocation(line: 304, column: 5, scope: !829)
!831 = !DILocation(line: 293, column: 11, scope: !832)
!832 = distinct !DILexicalBlock(scope: !833, file: !3, line: 293, column: 11)
!833 = distinct !DILexicalBlock(scope: !820, file: !3, line: 292, column: 5)
!834 = !DILocation(line: 293, column: 36, scope: !832)
!835 = !DILocation(line: 293, column: 11, scope: !833)
!836 = !DILocation(line: 296, column: 25, scope: !832)
!837 = !DILocation(line: 296, column: 6, scope: !832)
!838 = !DILocation(line: 297, column: 23, scope: !832)
!839 = !DILocation(line: 297, column: 6, scope: !832)
!840 = !DILocation(line: 294, column: 2, scope: !832)
!841 = !DILocation(line: 305, column: 40, scope: !827)
!842 = !DILocation(line: 305, column: 37, scope: !827)
!843 = !DILocation(line: 305, column: 11, scope: !828)
!844 = !DILocation(line: 307, column: 8, scope: !845)
!845 = distinct !DILexicalBlock(scope: !846, file: !3, line: 307, column: 8)
!846 = distinct !DILexicalBlock(scope: !827, file: !3, line: 306, column: 2)
!847 = !DILocation(line: 307, column: 33, scope: !845)
!848 = !DILocation(line: 307, column: 8, scope: !846)
!849 = !DILocation(line: 308, column: 6, scope: !845)
!850 = !DILocation(line: 0, scope: !760)
!851 = !DILocation(line: 304, column: 5, scope: !828)
!852 = distinct !{!852, !830, !853}
!853 = !DILocation(line: 312, column: 2, scope: !829)
!854 = !DILocation(line: 321, column: 9, scope: !855)
!855 = distinct !DILexicalBlock(scope: !739, file: !3, line: 321, column: 7)
!856 = !DILocation(line: 321, column: 18, scope: !855)
!857 = !DILocation(line: 321, column: 7, scope: !739)
!858 = !DILocation(line: 323, column: 11, scope: !859)
!859 = distinct !DILexicalBlock(scope: !860, file: !3, line: 323, column: 11)
!860 = distinct !DILexicalBlock(scope: !855, file: !3, line: 322, column: 5)
!861 = !DILocation(line: 323, column: 36, scope: !859)
!862 = !DILocation(line: 323, column: 11, scope: !860)
!863 = !DILocation(line: 324, column: 2, scope: !859)
!864 = !DILocation(line: 331, column: 39, scope: !762)
!865 = !DILocation(line: 331, column: 28, scope: !762)
!866 = !DILocation(line: 0, scope: !762)
!867 = !DILocation(line: 334, column: 46, scope: !868)
!868 = distinct !DILexicalBlock(scope: !762, file: !3, line: 334, column: 9)
!869 = !DILocation(line: 334, column: 18, scope: !868)
!870 = !DILocation(line: 335, column: 7, scope: !868)
!871 = !DILocation(line: 335, column: 2, scope: !868)
!872 = !DILocation(line: 334, column: 9, scope: !762)
!873 = !DILocation(line: 336, column: 7, scope: !868)
!874 = !DILocation(line: 337, column: 50, scope: !762)
!875 = !DILocation(line: 337, column: 19, scope: !762)
!876 = !DILocation(line: 337, column: 11, scope: !762)
!877 = !DILocation(line: 338, column: 5, scope: !762)
!878 = !DILocation(line: 339, column: 13, scope: !879)
!879 = distinct !DILexicalBlock(scope: !762, file: !3, line: 339, column: 9)
!880 = !DILocation(line: 339, column: 9, scope: !762)
!881 = !DILocation(line: 341, column: 6, scope: !882)
!882 = distinct !DILexicalBlock(scope: !883, file: !3, line: 341, column: 6)
!883 = distinct !DILexicalBlock(scope: !879, file: !3, line: 340, column: 7)
!884 = !DILocation(line: 341, column: 31, scope: !882)
!885 = !DILocation(line: 341, column: 6, scope: !883)
!886 = !DILocation(line: 342, column: 4, scope: !882)
!887 = !DILocation(line: 350, column: 12, scope: !739)
!888 = !DILocation(line: 351, column: 14, scope: !889)
!889 = distinct !DILexicalBlock(scope: !739, file: !3, line: 351, column: 7)
!890 = !DILocation(line: 351, column: 7, scope: !739)
!891 = !DILocation(line: 354, column: 19, scope: !889)
!892 = !DILocation(line: 354, column: 5, scope: !889)
!893 = !DILocation(line: 355, column: 1, scope: !739)
!894 = distinct !DISubprogram(name: "c_common_read_pch", scope: !3, file: !3, line: 365, type: !895, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !897)
!895 = !DISubroutineType(types: !896)
!896 = !{null, !742, !16, !11, !16}
!897 = !{!898, !899, !900, !901, !902, !903, !904, !907, !916, !917, !920, !921}
!898 = !DILocalVariable(name: "pfile", arg: 1, scope: !894, file: !3, line: 365, type: !742)
!899 = !DILocalVariable(name: "name", arg: 2, scope: !894, file: !3, line: 365, type: !16)
!900 = !DILocalVariable(name: "fd", arg: 3, scope: !894, file: !3, line: 366, type: !11)
!901 = !DILocalVariable(name: "orig_name", arg: 4, scope: !894, file: !3, line: 366, type: !16)
!902 = !DILocalVariable(name: "f", scope: !894, file: !3, line: 368, type: !24)
!903 = !DILocalVariable(name: "h", scope: !894, file: !3, line: 369, type: !643)
!904 = !DILocalVariable(name: "smd", scope: !894, file: !3, line: 370, type: !905)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DICompositeType(tag: DW_TAG_structure_type, name: "save_macro_data", file: !744, line: 937, flags: DIFlagFwdDecl)
!907 = !DILocalVariable(name: "saved_loc", scope: !894, file: !3, line: 371, type: !908)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "expanded_location", file: !909, line: 52, baseType: !910)
!909 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !909, line: 40, size: 192, elements: !911)
!911 = !{!912, !913, !914, !915}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !910, file: !909, line: 43, baseType: !16, size: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !910, file: !909, line: 46, baseType: !11, size: 32, offset: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !910, file: !909, line: 48, baseType: !11, size: 32, offset: 96)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !910, file: !909, line: 51, baseType: !10, size: 8, offset: 128)
!916 = !DILocalVariable(name: "saved_trace_includes", scope: !894, file: !3, line: 372, type: !10)
!917 = !DILocalVariable(name: "written", scope: !918, file: !3, line: 393, type: !20)
!918 = distinct !DILexicalBlock(scope: !919, file: !3, line: 392, column: 5)
!919 = distinct !DILexicalBlock(scope: !894, file: !3, line: 391, column: 7)
!920 = !DILocalVariable(name: "buf", scope: !918, file: !3, line: 394, type: !13)
!921 = !DILocalVariable(name: "size", scope: !922, file: !3, line: 398, type: !52)
!922 = distinct !DILexicalBlock(scope: !923, file: !3, line: 397, column: 2)
!923 = distinct !DILexicalBlock(scope: !924, file: !3, line: 396, column: 7)
!924 = distinct !DILexicalBlock(scope: !918, file: !3, line: 396, column: 7)
!925 = !DILocation(line: 0, scope: !894)
!926 = !DILocation(line: 369, column: 3, scope: !894)
!927 = !DILocation(line: 370, column: 3, scope: !894)
!928 = !DILocation(line: 371, column: 3, scope: !894)
!929 = !DILocation(line: 374, column: 7, scope: !894)
!930 = !DILocation(line: 375, column: 9, scope: !931)
!931 = distinct !DILexicalBlock(scope: !894, file: !3, line: 375, column: 7)
!932 = !DILocation(line: 375, column: 7, scope: !894)
!933 = !DILocation(line: 377, column: 7, scope: !934)
!934 = distinct !DILexicalBlock(scope: !931, file: !3, line: 376, column: 5)
!935 = !DILocation(line: 378, column: 7, scope: !934)
!936 = !DILocation(line: 379, column: 7, scope: !934)
!937 = !DILocation(line: 382, column: 22, scope: !894)
!938 = !DILocation(line: 382, column: 3, scope: !894)
!939 = !DILocation(line: 382, column: 33, scope: !894)
!940 = !DILocation(line: 382, column: 43, scope: !894)
!941 = !DILocation(line: 384, column: 7, scope: !942)
!942 = distinct !DILexicalBlock(scope: !894, file: !3, line: 384, column: 7)
!943 = !DILocation(line: 384, column: 36, scope: !942)
!944 = !DILocation(line: 384, column: 7, scope: !894)
!945 = !DILocation(line: 386, column: 7, scope: !946)
!946 = distinct !DILexicalBlock(scope: !942, file: !3, line: 385, column: 5)
!947 = !DILocation(line: 387, column: 7, scope: !946)
!948 = !DILocation(line: 388, column: 7, scope: !946)
!949 = !DILocation(line: 391, column: 8, scope: !919)
!950 = !DILocation(line: 391, column: 7, scope: !894)
!951 = !DILocation(line: 394, column: 20, scope: !918)
!952 = !DILocation(line: 0, scope: !918)
!953 = !DILocation(line: 0, scope: !923)
!954 = !DILocation(line: 396, column: 12, scope: !924)
!955 = !DILocation(line: 0, scope: !924)
!956 = !DILocation(line: 396, column: 37, scope: !923)
!957 = !DILocation(line: 396, column: 33, scope: !923)
!958 = !DILocation(line: 396, column: 7, scope: !924)
!959 = !DILocation(line: 398, column: 27, scope: !922)
!960 = !DILocation(line: 0, scope: !922)
!961 = !DILocation(line: 399, column: 8, scope: !922)
!962 = !DILocation(line: 401, column: 8, scope: !963)
!963 = distinct !DILexicalBlock(scope: !922, file: !3, line: 401, column: 8)
!964 = !DILocation(line: 401, column: 32, scope: !963)
!965 = !DILocation(line: 402, column: 8, scope: !963)
!966 = !DILocation(line: 402, column: 33, scope: !963)
!967 = !DILocation(line: 402, column: 11, scope: !963)
!968 = !DILocation(line: 402, column: 47, scope: !963)
!969 = !DILocation(line: 401, column: 8, scope: !922)
!970 = !DILocation(line: 403, column: 6, scope: !963)
!971 = !DILocation(line: 404, column: 12, scope: !922)
!972 = !DILocation(line: 396, column: 7, scope: !923)
!973 = distinct !{!973, !958, !974}
!974 = !DILocation(line: 405, column: 2, scope: !924)
!975 = !DILocation(line: 406, column: 7, scope: !918)
!976 = !DILocation(line: 407, column: 5, scope: !918)
!977 = !DILocation(line: 412, column: 23, scope: !978)
!978 = distinct !DILexicalBlock(scope: !979, file: !3, line: 412, column: 11)
!979 = distinct !DILexicalBlock(scope: !919, file: !3, line: 409, column: 5)
!980 = !DILocation(line: 412, column: 11, scope: !978)
