; ModuleID = 'c-ppoutput.bc'
source_filename = "c-ppoutput.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.anon.3 = type { %struct._IO_FILE*, %struct.cpp_token*, %struct.cpp_token*, i32, i8, i8 }
%struct.cpp_token = type { i32, i8, i16, %union.cpp_token_u }
%union.cpp_token_u = type { %struct.cpp_string }
%struct.cpp_string = type { i32, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "print", scope: !2, file: !3, line: 44, type: !66, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !42, globals: !61, nameTableKind: None)
!3 = !DIFile(filename: "c-ppoutput.c", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!4 = !{!5, !19, !31, !37}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cpp_builtin_type", file: !6, line: 593, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./cpplib.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!9 = !DIEnumerator(name: "BT_SPECLINE", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "BT_DATE", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "BT_FILE", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "BT_BASE_FILE", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "BT_INCLUDE_LEVEL", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "BT_TIME", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "BT_STDC", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "BT_PRAGMA", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "BT_TIMESTAMP", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "BT_COUNTER", value: 9, isUnsigned: true)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_lang", file: !6, line: 158, baseType: !7, size: 32, elements: !20)
!20 = !{!21, !22, !23, !24, !25, !26, !27, !28, !29, !30}
!21 = !DIEnumerator(name: "CLK_GNUC89", value: 0, isUnsigned: true)
!22 = !DIEnumerator(name: "CLK_GNUC99", value: 1, isUnsigned: true)
!23 = !DIEnumerator(name: "CLK_STDC89", value: 2, isUnsigned: true)
!24 = !DIEnumerator(name: "CLK_STDC94", value: 3, isUnsigned: true)
!25 = !DIEnumerator(name: "CLK_STDC99", value: 4, isUnsigned: true)
!26 = !DIEnumerator(name: "CLK_GNUCXX", value: 5, isUnsigned: true)
!27 = !DIEnumerator(name: "CLK_CXX98", value: 6, isUnsigned: true)
!28 = !DIEnumerator(name: "CLK_GNUCXX0X", value: 7, isUnsigned: true)
!29 = !DIEnumerator(name: "CLK_CXX0X", value: 8, isUnsigned: true)
!30 = !DIEnumerator(name: "CLK_ASM", value: 9, isUnsigned: true)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cpp_normalize_level", file: !6, line: 265, baseType: !7, size: 32, elements: !32)
!32 = !{!33, !34, !35, !36}
!33 = !DIEnumerator(name: "normalized_KC", value: 0, isUnsigned: true)
!34 = !DIEnumerator(name: "normalized_C", value: 1, isUnsigned: true)
!35 = !DIEnumerator(name: "normalized_identifier_C", value: 2, isUnsigned: true)
!36 = !DIEnumerator(name: "normalized_none", value: 3, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cpp_deps_style", file: !6, line: 262, baseType: !7, size: 32, elements: !38)
!38 = !{!39, !40, !41}
!39 = !DIEnumerator(name: "DEPS_NONE", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "DEPS_USER", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "DEPS_SYSTEM", value: 2, isUnsigned: true)
!42 = !{!43, !44, !45, !46, !49, !50, !52, !54}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!45 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "macro_queue", file: !3, line: 54, baseType: !56)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "macro_queue", file: !3, line: 48, size: 128, elements: !57)
!57 = !{!58, !60}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !56, file: !3, line: 50, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !56, file: !3, line: 51, baseType: !47, size: 64, offset: 64)
!61 = !{!0, !62, !64}
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(name: "define_queue", scope: !2, file: !3, line: 55, type: !54, isLocal: true, isDefinition: true)
!64 = !DIGlobalVariableExpression(var: !65, expr: !DIExpression())
!65 = distinct !DIGlobalVariable(name: "undef_queue", scope: !2, file: !3, line: 55, type: !54, isLocal: true, isDefinition: true)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 36, size: 256, elements: !67)
!67 = !{!68, !128, !210, !211, !212, !213}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "outf", scope: !66, file: !3, line: 38, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !71, line: 7, baseType: !72)
!71 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !73, line: 49, size: 1728, elements: !74)
!73 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!74 = !{!75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !90, !92, !93, !94, !98, !100, !102, !106, !109, !111, !114, !117, !118, !119, !123, !124}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !72, file: !73, line: 51, baseType: !45, size: 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !72, file: !73, line: 54, baseType: !47, size: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !72, file: !73, line: 55, baseType: !47, size: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !72, file: !73, line: 56, baseType: !47, size: 64, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !72, file: !73, line: 57, baseType: !47, size: 64, offset: 256)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !72, file: !73, line: 58, baseType: !47, size: 64, offset: 320)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !72, file: !73, line: 59, baseType: !47, size: 64, offset: 384)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !72, file: !73, line: 60, baseType: !47, size: 64, offset: 448)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !72, file: !73, line: 61, baseType: !47, size: 64, offset: 512)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !72, file: !73, line: 64, baseType: !47, size: 64, offset: 576)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !72, file: !73, line: 65, baseType: !47, size: 64, offset: 640)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !72, file: !73, line: 66, baseType: !47, size: 64, offset: 704)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !72, file: !73, line: 68, baseType: !88, size: 64, offset: 768)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !73, line: 36, flags: DIFlagFwdDecl)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !72, file: !73, line: 70, baseType: !91, size: 64, offset: 832)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !72, file: !73, line: 72, baseType: !45, size: 32, offset: 896)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !72, file: !73, line: 73, baseType: !45, size: 32, offset: 928)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !72, file: !73, line: 74, baseType: !95, size: 64, offset: 960)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !96, line: 152, baseType: !97)
!96 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!97 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !72, file: !73, line: 77, baseType: !99, size: 16, offset: 1024)
!99 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !72, file: !73, line: 78, baseType: !101, size: 8, offset: 1040)
!101 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !72, file: !73, line: 79, baseType: !103, size: 8, offset: 1048)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 8, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 1)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !72, file: !73, line: 81, baseType: !107, size: 64, offset: 1088)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !73, line: 43, baseType: null)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !72, file: !73, line: 89, baseType: !110, size: 64, offset: 1152)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !96, line: 153, baseType: !97)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !72, file: !73, line: 91, baseType: !112, size: 64, offset: 1216)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !73, line: 37, flags: DIFlagFwdDecl)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !72, file: !73, line: 92, baseType: !115, size: 64, offset: 1280)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !73, line: 38, flags: DIFlagFwdDecl)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !72, file: !73, line: 93, baseType: !91, size: 64, offset: 1344)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !72, file: !73, line: 94, baseType: !49, size: 64, offset: 1408)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !72, file: !73, line: 95, baseType: !120, size: 64, offset: 1472)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !121, line: 46, baseType: !122)
!121 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!122 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !72, file: !73, line: 96, baseType: !45, size: 32, offset: 1536)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !72, file: !73, line: 98, baseType: !125, size: 160, offset: 1568)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 160, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 20)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !66, file: !3, line: 39, baseType: !129, size: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_token", file: !6, line: 34, baseType: !132)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_token", file: !6, line: 212, size: 192, elements: !133)
!133 = !{!134, !137, !138, !139}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "src_loc", scope: !132, file: !6, line: 213, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !136, line: 44, baseType: !7)
!136 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!137 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !132, file: !6, line: 214, baseType: !7, size: 8, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !132, file: !6, line: 215, baseType: !99, size: 16, offset: 48)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !132, file: !6, line: 237, baseType: !140, size: 128, offset: 64)
!140 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cpp_token_u", file: !6, line: 217, size: 128, elements: !141)
!141 = !{!142, !198, !199, !204, !208, !209}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !140, file: !6, line: 220, baseType: !143, size: 64)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_identifier", file: !6, line: 201, size: 64, elements: !144)
!144 = !{!145}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !143, file: !6, line: 207, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_hashnode", file: !6, line: 36, baseType: !148)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_hashnode", file: !6, line: 644, size: 256, elements: !149)
!149 = !{!150, !157, !158, !159, !160, !161, !162}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !148, file: !6, line: 645, baseType: !151, size: 128)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !152, line: 31, size: 128, elements: !153)
!152 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!153 = !{!154, !155, !156}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !151, file: !152, line: 32, baseType: !52, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !151, file: !152, line: 33, baseType: !7, size: 32, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !151, file: !152, line: 34, baseType: !7, size: 32, offset: 96)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "is_directive", scope: !148, file: !6, line: 646, baseType: !7, size: 1, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "directive_index", scope: !148, file: !6, line: 647, baseType: !7, size: 7, offset: 129, flags: DIFlagBitField, extraData: i64 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "rid_code", scope: !148, file: !6, line: 650, baseType: !44, size: 8, offset: 136)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !148, file: !6, line: 651, baseType: !7, size: 6, offset: 144, flags: DIFlagBitField, extraData: i64 144)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !148, file: !6, line: 652, baseType: !7, size: 10, offset: 150, flags: DIFlagBitField, extraData: i64 144)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !148, file: !6, line: 654, baseType: !163, size: 64, offset: 192)
!163 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_cpp_hashnode_value", file: !6, line: 633, size: 64, elements: !164)
!164 = !{!165, !188, !196, !197}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !163, file: !6, line: 635, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_macro", file: !6, line: 37, baseType: !168)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_macro", file: !169, line: 36, size: 256, elements: !170)
!169 = !DIFile(filename: "./cpp-id-data.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!170 = !{!171, !173, !179, !180, !181, !182, !183, !184, !185, !186, !187}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !168, file: !169, line: 42, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !168, file: !169, line: 51, baseType: !174, size: 64, offset: 64)
!174 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cpp_macro_u", file: !169, line: 47, size: 64, elements: !175)
!175 = !{!176, !178}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "tokens", scope: !174, file: !169, line: 49, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !174, file: !169, line: 50, baseType: !52, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !168, file: !169, line: 54, baseType: !135, size: 32, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !168, file: !169, line: 57, baseType: !7, size: 32, offset: 160)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "paramc", scope: !168, file: !169, line: 60, baseType: !99, size: 16, offset: 192)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "fun_like", scope: !168, file: !169, line: 63, baseType: !7, size: 1, offset: 208, flags: DIFlagBitField, extraData: i64 208)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "variadic", scope: !168, file: !169, line: 66, baseType: !7, size: 1, offset: 209, flags: DIFlagBitField, extraData: i64 208)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "syshdr", scope: !168, file: !169, line: 69, baseType: !7, size: 1, offset: 210, flags: DIFlagBitField, extraData: i64 208)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !168, file: !169, line: 72, baseType: !7, size: 1, offset: 211, flags: DIFlagBitField, extraData: i64 208)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "traditional", scope: !168, file: !169, line: 75, baseType: !7, size: 1, offset: 212, flags: DIFlagBitField, extraData: i64 208)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "extra_tokens", scope: !168, file: !169, line: 80, baseType: !7, size: 1, offset: 213, flags: DIFlagBitField, extraData: i64 208)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "answers", scope: !163, file: !6, line: 637, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "answer", file: !169, line: 28, size: 320, elements: !191)
!191 = !{!192, !193, !194}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !190, file: !169, line: 29, baseType: !189, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !190, file: !169, line: 30, baseType: !7, size: 32, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !190, file: !169, line: 31, baseType: !195, size: 192, offset: 128)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 192, elements: !104)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "builtin", scope: !163, file: !6, line: 639, baseType: !5, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "arg_index", scope: !163, file: !6, line: 641, baseType: !99, size: 16)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !140, file: !6, line: 223, baseType: !177, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !140, file: !6, line: 226, baseType: !200, size: 128)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_string", file: !6, line: 162, size: 128, elements: !201)
!201 = !{!202, !203}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !200, file: !6, line: 163, baseType: !7, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !200, file: !6, line: 164, baseType: !52, size: 64, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "macro_arg", scope: !140, file: !6, line: 229, baseType: !205, size: 32)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_macro_arg", file: !6, line: 195, size: 32, elements: !206)
!206 = !{!207}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "arg_no", scope: !205, file: !6, line: 197, baseType: !7, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "token_no", scope: !140, file: !6, line: 233, baseType: !7, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "pragma", scope: !140, file: !6, line: 236, baseType: !7, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !66, file: !3, line: 40, baseType: !129, size: 64, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "src_line", scope: !66, file: !3, line: 41, baseType: !45, size: 32, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "printed", scope: !66, file: !3, line: 42, baseType: !44, size: 8, offset: 224)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "first_time", scope: !66, file: !3, line: 43, baseType: !44, size: 8, offset: 232)
!214 = !{i32 2, !"Dwarf Version", i32 4}
!215 = !{i32 2, !"Debug Info Version", i32 3}
!216 = !{i32 1, !"wchar_size", i32 4}
!217 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!218 = distinct !DISubprogram(name: "vprintf", scope: !219, file: !219, line: 39, type: !220, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !230)
!219 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!220 = !DISubroutineType(types: !221)
!221 = !{!45, !222, !223}
!222 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !50)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, size: 192, elements: !225)
!225 = !{!226, !227, !228, !229}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !224, file: !3, baseType: !7, size: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !224, file: !3, baseType: !7, size: 32, offset: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !224, file: !3, baseType: !49, size: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !224, file: !3, baseType: !49, size: 64, offset: 128)
!230 = !{!231, !232}
!231 = !DILocalVariable(name: "__fmt", arg: 1, scope: !218, file: !219, line: 39, type: !222)
!232 = !DILocalVariable(name: "__arg", arg: 2, scope: !218, file: !219, line: 39, type: !223)
!233 = !DILocation(line: 0, scope: !218)
!234 = !DILocation(line: 41, column: 20, scope: !218)
!235 = !DILocation(line: 41, column: 10, scope: !218)
!236 = !DILocation(line: 41, column: 3, scope: !218)
!237 = distinct !DISubprogram(name: "getchar", scope: !219, file: !219, line: 47, type: !238, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !240)
!238 = !DISubroutineType(types: !239)
!239 = !{!45}
!240 = !{}
!241 = !DILocation(line: 49, column: 16, scope: !237)
!242 = !DILocation(line: 49, column: 10, scope: !237)
!243 = !DILocation(line: 49, column: 3, scope: !237)
!244 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !219, file: !219, line: 56, type: !245, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !247)
!245 = !DISubroutineType(types: !246)
!246 = !{!45, !69}
!247 = !{!248}
!248 = !DILocalVariable(name: "__fp", arg: 1, scope: !244, file: !219, line: 56, type: !69)
!249 = !DILocation(line: 0, scope: !244)
!250 = !DILocation(line: 58, column: 10, scope: !244)
!251 = !DILocation(line: 58, column: 3, scope: !244)
!252 = distinct !DISubprogram(name: "getc_unlocked", scope: !219, file: !219, line: 66, type: !245, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !253)
!253 = !{!254}
!254 = !DILocalVariable(name: "__fp", arg: 1, scope: !252, file: !219, line: 66, type: !69)
!255 = !DILocation(line: 0, scope: !252)
!256 = !DILocation(line: 68, column: 10, scope: !252)
!257 = !DILocation(line: 68, column: 3, scope: !252)
!258 = distinct !DISubprogram(name: "getchar_unlocked", scope: !219, file: !219, line: 73, type: !238, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !240)
!259 = !DILocation(line: 75, column: 10, scope: !258)
!260 = !DILocation(line: 75, column: 3, scope: !258)
!261 = distinct !DISubprogram(name: "putchar", scope: !219, file: !219, line: 82, type: !262, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !264)
!262 = !DISubroutineType(types: !263)
!263 = !{!45, !45}
!264 = !{!265}
!265 = !DILocalVariable(name: "__c", arg: 1, scope: !261, file: !219, line: 82, type: !45)
!266 = !DILocation(line: 0, scope: !261)
!267 = !DILocation(line: 84, column: 21, scope: !261)
!268 = !DILocation(line: 84, column: 10, scope: !261)
!269 = !DILocation(line: 84, column: 3, scope: !261)
!270 = distinct !DISubprogram(name: "fputc_unlocked", scope: !219, file: !219, line: 91, type: !271, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !273)
!271 = !DISubroutineType(types: !272)
!272 = !{!45, !45, !69}
!273 = !{!274, !275}
!274 = !DILocalVariable(name: "__c", arg: 1, scope: !270, file: !219, line: 91, type: !45)
!275 = !DILocalVariable(name: "__stream", arg: 2, scope: !270, file: !219, line: 91, type: !69)
!276 = !DILocation(line: 0, scope: !270)
!277 = !DILocation(line: 93, column: 10, scope: !270)
!278 = !DILocation(line: 93, column: 3, scope: !270)
!279 = distinct !DISubprogram(name: "putc_unlocked", scope: !219, file: !219, line: 101, type: !271, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !280)
!280 = !{!281, !282}
!281 = !DILocalVariable(name: "__c", arg: 1, scope: !279, file: !219, line: 101, type: !45)
!282 = !DILocalVariable(name: "__stream", arg: 2, scope: !279, file: !219, line: 101, type: !69)
!283 = !DILocation(line: 0, scope: !279)
!284 = !DILocation(line: 103, column: 10, scope: !279)
!285 = !DILocation(line: 103, column: 3, scope: !279)
!286 = distinct !DISubprogram(name: "putchar_unlocked", scope: !219, file: !219, line: 108, type: !262, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !287)
!287 = !{!288}
!288 = !DILocalVariable(name: "__c", arg: 1, scope: !286, file: !219, line: 108, type: !45)
!289 = !DILocation(line: 0, scope: !286)
!290 = !DILocation(line: 110, column: 10, scope: !286)
!291 = !DILocation(line: 110, column: 3, scope: !286)
!292 = distinct !DISubprogram(name: "getline", scope: !219, file: !219, line: 118, type: !293, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !297)
!293 = !DISubroutineType(types: !294)
!294 = !{!295, !46, !296, !69}
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !96, line: 193, baseType: !97)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!297 = !{!298, !299, !300}
!298 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !292, file: !219, line: 118, type: !46)
!299 = !DILocalVariable(name: "__n", arg: 2, scope: !292, file: !219, line: 118, type: !296)
!300 = !DILocalVariable(name: "__stream", arg: 3, scope: !292, file: !219, line: 118, type: !69)
!301 = !DILocation(line: 0, scope: !292)
!302 = !DILocation(line: 120, column: 10, scope: !292)
!303 = !DILocation(line: 120, column: 3, scope: !292)
!304 = distinct !DISubprogram(name: "feof_unlocked", scope: !219, file: !219, line: 128, type: !245, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !305)
!305 = !{!306}
!306 = !DILocalVariable(name: "__stream", arg: 1, scope: !304, file: !219, line: 128, type: !69)
!307 = !DILocation(line: 0, scope: !304)
!308 = !DILocation(line: 130, column: 10, scope: !304)
!309 = !DILocation(line: 130, column: 3, scope: !304)
!310 = distinct !DISubprogram(name: "ferror_unlocked", scope: !219, file: !219, line: 135, type: !245, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !311)
!311 = !{!312}
!312 = !DILocalVariable(name: "__stream", arg: 1, scope: !310, file: !219, line: 135, type: !69)
!313 = !DILocation(line: 0, scope: !310)
!314 = !DILocation(line: 137, column: 10, scope: !310)
!315 = !DILocation(line: 137, column: 3, scope: !310)
!316 = distinct !DISubprogram(name: "tolower", scope: !317, file: !317, line: 207, type: !262, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !318)
!317 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!318 = !{!319}
!319 = !DILocalVariable(name: "__c", arg: 1, scope: !316, file: !317, line: 207, type: !45)
!320 = !DILocation(line: 0, scope: !316)
!321 = !DILocation(line: 209, column: 22, scope: !316)
!322 = !DILocation(line: 209, column: 39, scope: !316)
!323 = !DILocation(line: 209, column: 38, scope: !316)
!324 = !DILocation(line: 209, column: 37, scope: !316)
!325 = !DILocation(line: 209, column: 10, scope: !316)
!326 = !DILocation(line: 209, column: 3, scope: !316)
!327 = distinct !DISubprogram(name: "toupper", scope: !317, file: !317, line: 213, type: !262, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !328)
!328 = !{!329}
!329 = !DILocalVariable(name: "__c", arg: 1, scope: !327, file: !317, line: 213, type: !45)
!330 = !DILocation(line: 0, scope: !327)
!331 = !DILocation(line: 215, column: 22, scope: !327)
!332 = !DILocation(line: 215, column: 39, scope: !327)
!333 = !DILocation(line: 215, column: 38, scope: !327)
!334 = !DILocation(line: 215, column: 37, scope: !327)
!335 = !DILocation(line: 215, column: 10, scope: !327)
!336 = !DILocation(line: 215, column: 3, scope: !327)
!337 = distinct !DISubprogram(name: "atoi", scope: !338, file: !338, line: 361, type: !339, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !341)
!338 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!339 = !DISubroutineType(types: !340)
!340 = !{!45, !50}
!341 = !{!342}
!342 = !DILocalVariable(name: "__nptr", arg: 1, scope: !337, file: !338, line: 361, type: !50)
!343 = !DILocation(line: 0, scope: !337)
!344 = !DILocation(line: 363, column: 16, scope: !337)
!345 = !DILocation(line: 363, column: 10, scope: !337)
!346 = !DILocation(line: 363, column: 3, scope: !337)
!347 = distinct !DISubprogram(name: "atol", scope: !338, file: !338, line: 366, type: !348, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !350)
!348 = !DISubroutineType(types: !349)
!349 = !{!97, !50}
!350 = !{!351}
!351 = !DILocalVariable(name: "__nptr", arg: 1, scope: !347, file: !338, line: 366, type: !50)
!352 = !DILocation(line: 0, scope: !347)
!353 = !DILocation(line: 368, column: 10, scope: !347)
!354 = !DILocation(line: 368, column: 3, scope: !347)
!355 = distinct !DISubprogram(name: "atoll", scope: !338, file: !338, line: 373, type: !356, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !359)
!356 = !DISubroutineType(types: !357)
!357 = !{!358, !50}
!358 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!359 = !{!360}
!360 = !DILocalVariable(name: "__nptr", arg: 1, scope: !355, file: !338, line: 373, type: !50)
!361 = !DILocation(line: 0, scope: !355)
!362 = !DILocation(line: 375, column: 10, scope: !355)
!363 = !DILocation(line: 375, column: 3, scope: !355)
!364 = distinct !DISubprogram(name: "bsearch", scope: !365, file: !365, line: 20, type: !366, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !374)
!365 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!366 = !DISubroutineType(types: !367)
!367 = !{!49, !368, !368, !120, !120, !370}
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !338, line: 808, baseType: !371)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{!45, !368, !368}
!374 = !{!375, !376, !377, !378, !379, !380, !381, !382, !383, !384}
!375 = !DILocalVariable(name: "__key", arg: 1, scope: !364, file: !365, line: 20, type: !368)
!376 = !DILocalVariable(name: "__base", arg: 2, scope: !364, file: !365, line: 20, type: !368)
!377 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !364, file: !365, line: 20, type: !120)
!378 = !DILocalVariable(name: "__size", arg: 4, scope: !364, file: !365, line: 20, type: !120)
!379 = !DILocalVariable(name: "__compar", arg: 5, scope: !364, file: !365, line: 21, type: !370)
!380 = !DILocalVariable(name: "__l", scope: !364, file: !365, line: 23, type: !120)
!381 = !DILocalVariable(name: "__u", scope: !364, file: !365, line: 23, type: !120)
!382 = !DILocalVariable(name: "__idx", scope: !364, file: !365, line: 23, type: !120)
!383 = !DILocalVariable(name: "__p", scope: !364, file: !365, line: 24, type: !368)
!384 = !DILocalVariable(name: "__comparison", scope: !364, file: !365, line: 25, type: !45)
!385 = !DILocation(line: 0, scope: !364)
!386 = !DILocation(line: 29, column: 3, scope: !364)
!387 = !DILocation(line: 27, column: 7, scope: !364)
!388 = !DILocation(line: 29, column: 14, scope: !364)
!389 = !DILocation(line: 31, column: 20, scope: !390)
!390 = distinct !DILexicalBlock(scope: !364, file: !365, line: 30, column: 5)
!391 = !DILocation(line: 31, column: 27, scope: !390)
!392 = !DILocation(line: 32, column: 56, scope: !390)
!393 = !DILocation(line: 32, column: 47, scope: !390)
!394 = !DILocation(line: 33, column: 22, scope: !390)
!395 = !DILocation(line: 34, column: 24, scope: !396)
!396 = distinct !DILexicalBlock(scope: !390, file: !365, line: 34, column: 11)
!397 = !DILocation(line: 34, column: 11, scope: !390)
!398 = !DILocation(line: 36, column: 29, scope: !399)
!399 = distinct !DILexicalBlock(scope: !396, file: !365, line: 36, column: 16)
!400 = !DILocation(line: 36, column: 16, scope: !396)
!401 = !DILocation(line: 37, column: 14, scope: !399)
!402 = distinct !{!402, !386, !403}
!403 = !DILocation(line: 40, column: 5, scope: !364)
!404 = !DILocation(line: 43, column: 1, scope: !364)
!405 = distinct !DISubprogram(name: "atof", scope: !406, file: !406, line: 25, type: !407, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !410)
!406 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!407 = !DISubroutineType(types: !408)
!408 = !{!409, !50}
!409 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!410 = !{!411}
!411 = !DILocalVariable(name: "__nptr", arg: 1, scope: !405, file: !406, line: 25, type: !50)
!412 = !DILocation(line: 0, scope: !405)
!413 = !DILocation(line: 27, column: 10, scope: !405)
!414 = !DILocation(line: 27, column: 3, scope: !405)
!415 = distinct !DISubprogram(name: "strtoimax", scope: !416, file: !416, line: 324, type: !417, scopeLine: 326, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !423)
!416 = !DIFile(filename: "/usr/include/inttypes.h", directory: "")
!417 = !DISubroutineType(types: !418)
!418 = !{!419, !222, !422, !45}
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !420, line: 101, baseType: !421)
!420 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !96, line: 72, baseType: !97)
!422 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !46)
!423 = !{!424, !425, !426}
!424 = !DILocalVariable(name: "nptr", arg: 1, scope: !415, file: !416, line: 324, type: !222)
!425 = !DILocalVariable(name: "endptr", arg: 2, scope: !415, file: !416, line: 324, type: !422)
!426 = !DILocalVariable(name: "base", arg: 3, scope: !415, file: !416, line: 324, type: !45)
!427 = !DILocation(line: 0, scope: !415)
!428 = !DILocation(line: 327, column: 10, scope: !415)
!429 = !DILocation(line: 327, column: 3, scope: !415)
!430 = distinct !DISubprogram(name: "strtoumax", scope: !416, file: !416, line: 336, type: !431, scopeLine: 338, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !435)
!431 = !DISubroutineType(types: !432)
!432 = !{!433, !222, !422, !45}
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !420, line: 102, baseType: !434)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !96, line: 73, baseType: !122)
!435 = !{!436, !437, !438}
!436 = !DILocalVariable(name: "nptr", arg: 1, scope: !430, file: !416, line: 336, type: !222)
!437 = !DILocalVariable(name: "endptr", arg: 2, scope: !430, file: !416, line: 336, type: !422)
!438 = !DILocalVariable(name: "base", arg: 3, scope: !430, file: !416, line: 336, type: !45)
!439 = !DILocation(line: 0, scope: !430)
!440 = !DILocation(line: 339, column: 10, scope: !430)
!441 = !DILocation(line: 339, column: 3, scope: !430)
!442 = distinct !DISubprogram(name: "wcstoimax", scope: !416, file: !416, line: 348, type: !443, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !452)
!443 = !DISubroutineType(types: !444)
!444 = !{!419, !445, !449, !45}
!445 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !446)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !448)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gwchar_t", file: !416, line: 34, baseType: !45)
!449 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !450)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!452 = !{!453, !454, !455}
!453 = !DILocalVariable(name: "nptr", arg: 1, scope: !442, file: !416, line: 348, type: !445)
!454 = !DILocalVariable(name: "endptr", arg: 2, scope: !442, file: !416, line: 348, type: !449)
!455 = !DILocalVariable(name: "base", arg: 3, scope: !442, file: !416, line: 348, type: !45)
!456 = !DILocation(line: 0, scope: !442)
!457 = !DILocation(line: 351, column: 10, scope: !442)
!458 = !DILocation(line: 351, column: 3, scope: !442)
!459 = distinct !DISubprogram(name: "wcstoumax", scope: !416, file: !416, line: 362, type: !460, scopeLine: 364, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !462)
!460 = !DISubroutineType(types: !461)
!461 = !{!433, !445, !449, !45}
!462 = !{!463, !464, !465}
!463 = !DILocalVariable(name: "nptr", arg: 1, scope: !459, file: !416, line: 362, type: !445)
!464 = !DILocalVariable(name: "endptr", arg: 2, scope: !459, file: !416, line: 362, type: !449)
!465 = !DILocalVariable(name: "base", arg: 3, scope: !459, file: !416, line: 362, type: !45)
!466 = !DILocation(line: 0, scope: !459)
!467 = !DILocation(line: 365, column: 10, scope: !459)
!468 = !DILocation(line: 365, column: 3, scope: !459)
!469 = distinct !DISubprogram(name: "stat", scope: !470, file: !470, line: 453, type: !471, scopeLine: 454, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !510)
!470 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "")
!471 = !DISubroutineType(types: !472)
!472 = !{!45, !50, !473}
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !475, line: 46, size: 1152, elements: !476)
!475 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!476 = !{!477, !479, !481, !483, !485, !487, !489, !490, !491, !492, !494, !496, !504, !505, !506}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !474, file: !475, line: 48, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !96, line: 145, baseType: !122)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !474, file: !475, line: 53, baseType: !480, size: 64, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !96, line: 148, baseType: !122)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !474, file: !475, line: 61, baseType: !482, size: 64, offset: 128)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !96, line: 151, baseType: !122)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !474, file: !475, line: 62, baseType: !484, size: 32, offset: 192)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !96, line: 150, baseType: !7)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !474, file: !475, line: 64, baseType: !486, size: 32, offset: 224)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !96, line: 146, baseType: !7)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !474, file: !475, line: 65, baseType: !488, size: 32, offset: 256)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !96, line: 147, baseType: !7)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !474, file: !475, line: 67, baseType: !45, size: 32, offset: 288)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !474, file: !475, line: 69, baseType: !478, size: 64, offset: 320)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !474, file: !475, line: 74, baseType: !95, size: 64, offset: 384)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !474, file: !475, line: 78, baseType: !493, size: 64, offset: 448)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !96, line: 174, baseType: !97)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !474, file: !475, line: 80, baseType: !495, size: 64, offset: 512)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !96, line: 179, baseType: !97)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !474, file: !475, line: 91, baseType: !497, size: 128, offset: 576)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !498, line: 10, size: 128, elements: !499)
!498 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!499 = !{!500, !502}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !497, file: !498, line: 12, baseType: !501, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !96, line: 160, baseType: !97)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !497, file: !498, line: 16, baseType: !503, size: 64, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !96, line: 196, baseType: !97)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !474, file: !475, line: 92, baseType: !497, size: 128, offset: 704)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !474, file: !475, line: 93, baseType: !497, size: 128, offset: 832)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !474, file: !475, line: 106, baseType: !507, size: 192, offset: 960)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !503, size: 192, elements: !508)
!508 = !{!509}
!509 = !DISubrange(count: 3)
!510 = !{!511, !512}
!511 = !DILocalVariable(name: "__path", arg: 1, scope: !469, file: !470, line: 453, type: !50)
!512 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !469, file: !470, line: 453, type: !473)
!513 = !DILocation(line: 0, scope: !469)
!514 = !DILocation(line: 455, column: 10, scope: !469)
!515 = !DILocation(line: 455, column: 3, scope: !469)
!516 = distinct !DISubprogram(name: "lstat", scope: !470, file: !470, line: 460, type: !471, scopeLine: 461, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !517)
!517 = !{!518, !519}
!518 = !DILocalVariable(name: "__path", arg: 1, scope: !516, file: !470, line: 460, type: !50)
!519 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !516, file: !470, line: 460, type: !473)
!520 = !DILocation(line: 0, scope: !516)
!521 = !DILocation(line: 462, column: 10, scope: !516)
!522 = !DILocation(line: 462, column: 3, scope: !516)
!523 = distinct !DISubprogram(name: "fstat", scope: !470, file: !470, line: 467, type: !524, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !526)
!524 = !DISubroutineType(types: !525)
!525 = !{!45, !45, !473}
!526 = !{!527, !528}
!527 = !DILocalVariable(name: "__fd", arg: 1, scope: !523, file: !470, line: 467, type: !45)
!528 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !523, file: !470, line: 467, type: !473)
!529 = !DILocation(line: 0, scope: !523)
!530 = !DILocation(line: 469, column: 10, scope: !523)
!531 = !DILocation(line: 469, column: 3, scope: !523)
!532 = distinct !DISubprogram(name: "fstatat", scope: !470, file: !470, line: 474, type: !533, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !535)
!533 = !DISubroutineType(types: !534)
!534 = !{!45, !45, !50, !473, !45}
!535 = !{!536, !537, !538, !539}
!536 = !DILocalVariable(name: "__fd", arg: 1, scope: !532, file: !470, line: 474, type: !45)
!537 = !DILocalVariable(name: "__filename", arg: 2, scope: !532, file: !470, line: 474, type: !50)
!538 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !532, file: !470, line: 474, type: !473)
!539 = !DILocalVariable(name: "__flag", arg: 4, scope: !532, file: !470, line: 474, type: !45)
!540 = !DILocation(line: 0, scope: !532)
!541 = !DILocation(line: 477, column: 10, scope: !532)
!542 = !DILocation(line: 477, column: 3, scope: !532)
!543 = distinct !DISubprogram(name: "mknod", scope: !470, file: !470, line: 483, type: !544, scopeLine: 484, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !546)
!544 = !DISubroutineType(types: !545)
!545 = !{!45, !50, !484, !478}
!546 = !{!547, !548, !549}
!547 = !DILocalVariable(name: "__path", arg: 1, scope: !543, file: !470, line: 483, type: !50)
!548 = !DILocalVariable(name: "__mode", arg: 2, scope: !543, file: !470, line: 483, type: !484)
!549 = !DILocalVariable(name: "__dev", arg: 3, scope: !543, file: !470, line: 483, type: !478)
!550 = !DILocation(line: 0, scope: !543)
!551 = !DILocation(line: 485, column: 10, scope: !543)
!552 = !DILocation(line: 485, column: 3, scope: !543)
!553 = distinct !DISubprogram(name: "mknodat", scope: !470, file: !470, line: 491, type: !554, scopeLine: 493, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !556)
!554 = !DISubroutineType(types: !555)
!555 = !{!45, !45, !50, !484, !478}
!556 = !{!557, !558, !559, !560}
!557 = !DILocalVariable(name: "__fd", arg: 1, scope: !553, file: !470, line: 491, type: !45)
!558 = !DILocalVariable(name: "__path", arg: 2, scope: !553, file: !470, line: 491, type: !50)
!559 = !DILocalVariable(name: "__mode", arg: 3, scope: !553, file: !470, line: 491, type: !484)
!560 = !DILocalVariable(name: "__dev", arg: 4, scope: !553, file: !470, line: 491, type: !478)
!561 = !DILocation(line: 0, scope: !553)
!562 = !DILocation(line: 494, column: 10, scope: !553)
!563 = !DILocation(line: 494, column: 3, scope: !553)
!564 = distinct !DISubprogram(name: "stat64", scope: !470, file: !470, line: 502, type: !565, scopeLine: 503, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !587)
!565 = !DISubroutineType(types: !566)
!566 = !{!45, !50, !567}
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !475, line: 119, size: 1152, elements: !569)
!569 = !{!570, !571, !573, !574, !575, !576, !577, !578, !579, !580, !581, !583, !584, !585, !586}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !568, file: !475, line: 121, baseType: !478, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !568, file: !475, line: 123, baseType: !572, size: 64, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !96, line: 149, baseType: !122)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !568, file: !475, line: 124, baseType: !482, size: 64, offset: 128)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !568, file: !475, line: 125, baseType: !484, size: 32, offset: 192)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !568, file: !475, line: 132, baseType: !486, size: 32, offset: 224)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !568, file: !475, line: 133, baseType: !488, size: 32, offset: 256)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !568, file: !475, line: 135, baseType: !45, size: 32, offset: 288)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !568, file: !475, line: 136, baseType: !478, size: 64, offset: 320)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !568, file: !475, line: 137, baseType: !95, size: 64, offset: 384)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !568, file: !475, line: 143, baseType: !493, size: 64, offset: 448)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !568, file: !475, line: 144, baseType: !582, size: 64, offset: 512)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !96, line: 180, baseType: !97)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !568, file: !475, line: 152, baseType: !497, size: 128, offset: 576)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !568, file: !475, line: 153, baseType: !497, size: 128, offset: 704)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !568, file: !475, line: 154, baseType: !497, size: 128, offset: 832)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !568, file: !475, line: 164, baseType: !507, size: 192, offset: 960)
!587 = !{!588, !589}
!588 = !DILocalVariable(name: "__path", arg: 1, scope: !564, file: !470, line: 502, type: !50)
!589 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !564, file: !470, line: 502, type: !567)
!590 = !DILocation(line: 0, scope: !564)
!591 = !DILocation(line: 504, column: 10, scope: !564)
!592 = !DILocation(line: 504, column: 3, scope: !564)
!593 = distinct !DISubprogram(name: "lstat64", scope: !470, file: !470, line: 509, type: !565, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !594)
!594 = !{!595, !596}
!595 = !DILocalVariable(name: "__path", arg: 1, scope: !593, file: !470, line: 509, type: !50)
!596 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !593, file: !470, line: 509, type: !567)
!597 = !DILocation(line: 0, scope: !593)
!598 = !DILocation(line: 511, column: 10, scope: !593)
!599 = !DILocation(line: 511, column: 3, scope: !593)
!600 = distinct !DISubprogram(name: "fstat64", scope: !470, file: !470, line: 516, type: !601, scopeLine: 517, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !603)
!601 = !DISubroutineType(types: !602)
!602 = !{!45, !45, !567}
!603 = !{!604, !605}
!604 = !DILocalVariable(name: "__fd", arg: 1, scope: !600, file: !470, line: 516, type: !45)
!605 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !600, file: !470, line: 516, type: !567)
!606 = !DILocation(line: 0, scope: !600)
!607 = !DILocation(line: 518, column: 10, scope: !600)
!608 = !DILocation(line: 518, column: 3, scope: !600)
!609 = distinct !DISubprogram(name: "fstatat64", scope: !470, file: !470, line: 523, type: !610, scopeLine: 525, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !612)
!610 = !DISubroutineType(types: !611)
!611 = !{!45, !45, !50, !567, !45}
!612 = !{!613, !614, !615, !616}
!613 = !DILocalVariable(name: "__fd", arg: 1, scope: !609, file: !470, line: 523, type: !45)
!614 = !DILocalVariable(name: "__filename", arg: 2, scope: !609, file: !470, line: 523, type: !50)
!615 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !609, file: !470, line: 523, type: !567)
!616 = !DILocalVariable(name: "__flag", arg: 4, scope: !609, file: !470, line: 523, type: !45)
!617 = !DILocation(line: 0, scope: !609)
!618 = !DILocation(line: 526, column: 10, scope: !609)
!619 = !DILocation(line: 526, column: 3, scope: !609)
!620 = distinct !DISubprogram(name: "preprocess_file", scope: !3, file: !3, line: 87, type: !621, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1130)
!621 = !DISubroutineType(types: !622)
!622 = !{null, !623}
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_reader", file: !6, line: 31, baseType: !625)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_reader", file: !626, line: 322, size: 10112, elements: !627)
!626 = !DIFile(filename: "./internal.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!627 = !{!628, !698, !699, !716, !746, !747, !757, !758, !759, !787, !789, !793, !794, !795, !796, !797, !798, !799, !800, !801, !845, !846, !849, !850, !882, !883, !884, !887, !888, !889, !890, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !916, !917, !918, !921, !995, !1021, !1024, !1025, !1088, !1095, !1096, !1103, !1104, !1105, !1106, !1109, !1110, !1123}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !625, file: !626, line: 325, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_buffer", file: !6, line: 32, baseType: !631)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_buffer", file: !626, line: 249, size: 1472, elements: !632)
!632 = !{!633, !634, !635, !636, !637, !638, !645, !646, !647, !648, !650, !653, !654, !657, !658, !659, !660, !661, !662, !685}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !631, file: !626, line: 251, baseType: !52, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "line_base", scope: !631, file: !626, line: 252, baseType: !52, size: 64, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "next_line", scope: !631, file: !626, line: 253, baseType: !52, size: 64, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !631, file: !626, line: 255, baseType: !52, size: 64, offset: 192)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit", scope: !631, file: !626, line: 256, baseType: !52, size: 64, offset: 256)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "notes", scope: !631, file: !626, line: 258, baseType: !639, size: 64, offset: 320)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cpp_line_note", file: !626, line: 235, baseType: !641)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_line_note", file: !626, line: 236, size: 128, elements: !642)
!642 = !{!643, !644}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !641, file: !626, line: 239, baseType: !52, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !641, file: !626, line: 245, baseType: !7, size: 32, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "cur_note", scope: !631, file: !626, line: 259, baseType: !7, size: 32, offset: 384)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "notes_used", scope: !631, file: !626, line: 260, baseType: !7, size: 32, offset: 416)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "notes_cap", scope: !631, file: !626, line: 261, baseType: !7, size: 32, offset: 448)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !631, file: !626, line: 263, baseType: !649, size: 64, offset: 512)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !631, file: !626, line: 267, baseType: !651, size: 64, offset: 576)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_file", file: !6, line: 42, flags: DIFlagFwdDecl)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !631, file: !626, line: 271, baseType: !52, size: 64, offset: 640)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "if_stack", scope: !631, file: !626, line: 275, baseType: !655, size: 64, offset: 704)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DICompositeType(tag: DW_TAG_structure_type, name: "if_stack", file: !626, line: 275, flags: DIFlagFwdDecl)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "need_line", scope: !631, file: !626, line: 278, baseType: !44, size: 8, offset: 768)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "warned_cplusplus_comments", scope: !631, file: !626, line: 284, baseType: !7, size: 1, offset: 776, flags: DIFlagBitField, extraData: i64 776)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "from_stage3", scope: !631, file: !626, line: 289, baseType: !7, size: 1, offset: 777, flags: DIFlagBitField, extraData: i64 776)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "return_at_eof", scope: !631, file: !626, line: 294, baseType: !7, size: 1, offset: 778, flags: DIFlagBitField, extraData: i64 776)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !631, file: !626, line: 298, baseType: !44, size: 8, offset: 784)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !631, file: !626, line: 302, baseType: !663, size: 512, offset: 832)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_dir", file: !6, line: 523, size: 512, elements: !664)
!664 = !{!665, !667, !668, !669, !670, !671, !672, !674, !680, !683}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !663, file: !6, line: 526, baseType: !666, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !663, file: !6, line: 529, baseType: !47, size: 64, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !663, file: !6, line: 530, baseType: !7, size: 32, offset: 128)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !663, file: !6, line: 534, baseType: !44, size: 8, offset: 160)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "user_supplied_p", scope: !663, file: !6, line: 537, baseType: !44, size: 8, offset: 168)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "canonical_name", scope: !663, file: !6, line: 541, baseType: !47, size: 64, offset: 192)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "name_map", scope: !663, file: !6, line: 545, baseType: !673, size: 64, offset: 256)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "construct", scope: !663, file: !6, line: 551, baseType: !675, size: 64, offset: 320)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DISubroutineType(types: !677)
!677 = !{!47, !50, !678}
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_dir", file: !6, line: 39, baseType: !663)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !663, file: !6, line: 555, baseType: !681, size: 64, offset: 384)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !682, line: 47, baseType: !480)
!682 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!683 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !663, file: !6, line: 556, baseType: !684, size: 64, offset: 448)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !682, line: 59, baseType: !478)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "input_cset_desc", scope: !631, file: !626, line: 306, baseType: !686, size: 128, offset: 1344)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cset_converter", file: !626, line: 47, size: 128, elements: !687)
!687 = !{!688, !696, !697}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !686, file: !626, line: 49, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "convert_f", file: !626, line: 45, baseType: !690)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DISubroutineType(types: !692)
!692 = !{!44, !693, !52, !120, !694}
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "iconv_t", file: !626, line: 33, baseType: !45)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_strbuf", file: !626, line: 43, flags: DIFlagFwdDecl)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "cd", scope: !686, file: !626, line: 50, baseType: !693, size: 32, offset: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !686, file: !626, line: 51, baseType: !45, size: 32, offset: 96)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "overlaid_buffer", scope: !625, file: !626, line: 328, baseType: !629, size: 64, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !625, file: !626, line: 331, baseType: !700, size: 160, offset: 128)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lexer_state", file: !626, line: 177, size: 160, elements: !701)
!701 = !{!702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "in_directive", scope: !700, file: !626, line: 180, baseType: !44, size: 8)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "directive_wants_padding", scope: !700, file: !626, line: 185, baseType: !44, size: 8, offset: 8)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "skipping", scope: !700, file: !626, line: 188, baseType: !44, size: 8, offset: 16)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "angled_headers", scope: !700, file: !626, line: 191, baseType: !44, size: 8, offset: 24)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "in_expression", scope: !700, file: !626, line: 194, baseType: !44, size: 8, offset: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "save_comments", scope: !700, file: !626, line: 198, baseType: !44, size: 8, offset: 40)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "va_args_ok", scope: !700, file: !626, line: 201, baseType: !44, size: 8, offset: 48)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "poisoned_ok", scope: !700, file: !626, line: 204, baseType: !44, size: 8, offset: 56)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "prevent_expansion", scope: !700, file: !626, line: 207, baseType: !44, size: 8, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "parsing_args", scope: !700, file: !626, line: 210, baseType: !44, size: 8, offset: 72)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "discarding_output", scope: !700, file: !626, line: 214, baseType: !44, size: 8, offset: 80)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "skip_eval", scope: !700, file: !626, line: 217, baseType: !7, size: 32, offset: 96)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "in_deferred_pragma", scope: !700, file: !626, line: 220, baseType: !44, size: 8, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "pragma_allow_expansion", scope: !700, file: !626, line: 223, baseType: !44, size: 8, offset: 136)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "line_table", scope: !625, file: !626, line: 334, baseType: !717, size: 64, offset: 320)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line_maps", file: !136, line: 74, size: 448, elements: !719)
!719 = !{!720, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "maps", scope: !718, file: !136, line: 75, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line_map", file: !136, line: 61, size: 192, elements: !723)
!723 = !{!724, !725, !727, !728, !729, !730, !731}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "to_file", scope: !722, file: !136, line: 62, baseType: !50, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "to_line", scope: !722, file: !136, line: 63, baseType: !726, size: 32, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "linenum_type", file: !136, line: 39, baseType: !7)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "start_location", scope: !722, file: !136, line: 64, baseType: !135, size: 32, offset: 96)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "included_from", scope: !722, file: !136, line: 65, baseType: !45, size: 32, offset: 128)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !722, file: !136, line: 66, baseType: !7, size: 8, offset: 160, flags: DIFlagBitField, extraData: i64 160)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !722, file: !136, line: 68, baseType: !44, size: 8, offset: 168)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "column_bits", scope: !722, file: !136, line: 70, baseType: !7, size: 8, offset: 176, flags: DIFlagBitField, extraData: i64 176)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !718, file: !136, line: 76, baseType: !7, size: 32, offset: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !718, file: !136, line: 77, baseType: !7, size: 32, offset: 96)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !718, file: !136, line: 79, baseType: !7, size: 32, offset: 128)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "last_listed", scope: !718, file: !136, line: 84, baseType: !45, size: 32, offset: 160)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !718, file: !136, line: 87, baseType: !7, size: 32, offset: 192)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "trace_includes", scope: !718, file: !136, line: 90, baseType: !44, size: 8, offset: 224)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "highest_location", scope: !718, file: !136, line: 93, baseType: !135, size: 32, offset: 256)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "highest_line", scope: !718, file: !136, line: 96, baseType: !135, size: 32, offset: 288)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "max_column_hint", scope: !718, file: !136, line: 100, baseType: !7, size: 32, offset: 320)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "reallocator", scope: !718, file: !136, line: 104, baseType: !742, size: 64, offset: 384)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "line_map_realloc", file: !136, line: 47, baseType: !743)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{!49, !49, !120}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "directive_line", scope: !625, file: !626, line: 337, baseType: !135, size: 32, offset: 384)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "a_buff", scope: !625, file: !626, line: 340, baseType: !748, size: 64, offset: 448)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cpp_buff", file: !626, line: 99, baseType: !750)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_buff", file: !626, line: 100, size: 256, elements: !751)
!751 = !{!752, !754, !755, !756}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !750, file: !626, line: 102, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !750, file: !626, line: 103, baseType: !43, size: 64, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !750, file: !626, line: 103, baseType: !43, size: 64, offset: 128)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !750, file: !626, line: 103, baseType: !43, size: 64, offset: 192)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "u_buff", scope: !625, file: !626, line: 341, baseType: !748, size: 64, offset: 512)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "free_buffs", scope: !625, file: !626, line: 342, baseType: !748, size: 64, offset: 576)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "base_context", scope: !625, file: !626, line: 345, baseType: !760, size: 448, offset: 640)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_context", file: !626, line: 142, size: 448, elements: !761)
!761 = !{!762, !765, !766, !784, !785, !786}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !760, file: !626, line: 145, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_context", file: !626, line: 141, baseType: !760)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !760, file: !626, line: 145, baseType: !763, size: 64, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !760, file: !626, line: 164, baseType: !767, size: 128, offset: 128)
!767 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !760, file: !626, line: 147, size: 128, elements: !768)
!768 = !{!769, !779}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "iso", scope: !767, file: !626, line: 156, baseType: !770, size: 128)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !767, file: !626, line: 152, size: 128, elements: !771)
!771 = !{!772, !778}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !770, file: !626, line: 154, baseType: !773, size: 64)
!773 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "utoken", file: !626, line: 121, size: 64, elements: !774)
!774 = !{!775, !776}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !773, file: !626, line: 123, baseType: !129, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "ptoken", scope: !773, file: !626, line: 124, baseType: !777, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !770, file: !626, line: 155, baseType: !773, size: 64, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "trad", scope: !767, file: !626, line: 163, baseType: !780, size: 128)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !767, file: !626, line: 159, size: 128, elements: !781)
!781 = !{!782, !783}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !780, file: !626, line: 161, baseType: !52, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit", scope: !780, file: !626, line: 162, baseType: !52, size: 64, offset: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !760, file: !626, line: 168, baseType: !748, size: 64, offset: 256)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !760, file: !626, line: 171, baseType: !146, size: 64, offset: 320)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "direct_p", scope: !760, file: !626, line: 174, baseType: !44, size: 8, offset: 384)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !625, file: !626, line: 346, baseType: !788, size: 64, offset: 1088)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "directive", scope: !625, file: !626, line: 349, baseType: !790, size: 64, offset: 1152)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !792)
!792 = !DICompositeType(tag: DW_TAG_structure_type, name: "directive", file: !626, line: 40, flags: DIFlagFwdDecl)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "directive_result", scope: !625, file: !626, line: 352, baseType: !131, size: 192, offset: 1216)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "invocation_location", scope: !625, file: !626, line: 356, baseType: !135, size: 32, offset: 1408)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "set_invocation_location", scope: !625, file: !626, line: 360, baseType: !44, size: 8, offset: 1440)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "quote_include", scope: !625, file: !626, line: 363, baseType: !666, size: 64, offset: 1472)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "bracket_include", scope: !625, file: !626, line: 364, baseType: !666, size: 64, offset: 1536)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "no_search_path", scope: !625, file: !626, line: 365, baseType: !663, size: 512, offset: 1600)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "all_files", scope: !625, file: !626, line: 368, baseType: !651, size: 64, offset: 2112)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "main_file", scope: !625, file: !626, line: 370, baseType: !651, size: 64, offset: 2176)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "file_hash", scope: !625, file: !626, line: 373, baseType: !802, size: 64, offset: 2240)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !804, line: 100, size: 896, elements: !805)
!804 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!805 = !{!806, !812, !814, !819, !821, !822, !823, !824, !825, !826, !831, !833, !834, !839, !844}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !803, file: !804, line: 102, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !804, line: 52, baseType: !808)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DISubroutineType(types: !810)
!810 = !{!811, !368}
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !804, line: 47, baseType: !7)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !803, file: !804, line: 105, baseType: !813, size: 64, offset: 64)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !804, line: 59, baseType: !371)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !803, file: !804, line: 108, baseType: !815, size: 64, offset: 128)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !804, line: 63, baseType: !816)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DISubroutineType(types: !818)
!818 = !{null, !49}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !803, file: !804, line: 111, baseType: !820, size: 64, offset: 192)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !803, file: !804, line: 114, baseType: !120, size: 64, offset: 256)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !803, file: !804, line: 117, baseType: !120, size: 64, offset: 320)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !803, file: !804, line: 120, baseType: !120, size: 64, offset: 384)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !803, file: !804, line: 124, baseType: !7, size: 32, offset: 448)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !803, file: !804, line: 128, baseType: !7, size: 32, offset: 480)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !803, file: !804, line: 131, baseType: !827, size: 64, offset: 512)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !804, line: 75, baseType: !828)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DISubroutineType(types: !830)
!830 = !{!49, !120, !120}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !803, file: !804, line: 132, baseType: !832, size: 64, offset: 576)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !804, line: 78, baseType: !816)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !803, file: !804, line: 135, baseType: !49, size: 64, offset: 640)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !803, file: !804, line: 136, baseType: !835, size: 64, offset: 704)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !804, line: 82, baseType: !836)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DISubroutineType(types: !838)
!838 = !{!49, !49, !120, !120}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !803, file: !804, line: 137, baseType: !840, size: 64, offset: 768)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !804, line: 83, baseType: !841)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DISubroutineType(types: !843)
!843 = !{null, !49, !49}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !803, file: !804, line: 141, baseType: !7, size: 32, offset: 832)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "dir_hash", scope: !625, file: !626, line: 374, baseType: !802, size: 64, offset: 2304)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "file_hash_entries", scope: !625, file: !626, line: 375, baseType: !847, size: 64, offset: 2368)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DICompositeType(tag: DW_TAG_structure_type, name: "file_hash_entry_pool", file: !626, line: 375, flags: DIFlagFwdDecl)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "nonexistent_file_hash", scope: !625, file: !626, line: 378, baseType: !802, size: 64, offset: 2432)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "nonexistent_file_ob", scope: !625, file: !626, line: 379, baseType: !851, size: 704, offset: 2496)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !852, line: 164, size: 704, elements: !853)
!852 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!853 = !{!854, !855, !865, !866, !867, !868, !869, !870, !874, !878, !879, !880, !881}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !851, file: !852, line: 166, baseType: !97, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !851, file: !852, line: 167, baseType: !856, size: 64, offset: 64)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !852, line: 157, size: 192, elements: !858)
!858 = !{!859, !860, !861}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !857, file: !852, line: 159, baseType: !47, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !857, file: !852, line: 160, baseType: !856, size: 64, offset: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !857, file: !852, line: 161, baseType: !862, size: 32, offset: 128)
!862 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 32, elements: !863)
!863 = !{!864}
!864 = !DISubrange(count: 4)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !851, file: !852, line: 168, baseType: !47, size: 64, offset: 128)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !851, file: !852, line: 169, baseType: !47, size: 64, offset: 192)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !851, file: !852, line: 170, baseType: !47, size: 64, offset: 256)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !851, file: !852, line: 171, baseType: !97, size: 64, offset: 320)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !851, file: !852, line: 172, baseType: !45, size: 32, offset: 384)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !851, file: !852, line: 176, baseType: !871, size: 64, offset: 448)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DISubroutineType(types: !873)
!873 = !{!856, !49, !97}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !851, file: !852, line: 177, baseType: !875, size: 64, offset: 512)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DISubroutineType(types: !877)
!877 = !{null, !49, !856}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !851, file: !852, line: 178, baseType: !49, size: 64, offset: 576)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !851, file: !852, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !851, file: !852, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !851, file: !852, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "quote_ignores_source_dir", scope: !625, file: !626, line: 383, baseType: !44, size: 8, offset: 3200)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "seen_once_only", scope: !625, file: !626, line: 387, baseType: !44, size: 8, offset: 3208)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "mi_cmacro", scope: !625, file: !626, line: 390, baseType: !885, size: 64, offset: 3264)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !147)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "mi_ind_cmacro", scope: !625, file: !626, line: 391, baseType: !885, size: 64, offset: 3328)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "mi_valid", scope: !625, file: !626, line: 392, baseType: !44, size: 8, offset: 3392)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "cur_token", scope: !625, file: !626, line: 395, baseType: !177, size: 64, offset: 3456)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "base_run", scope: !625, file: !626, line: 396, baseType: !891, size: 256, offset: 3520)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "tokenrun", file: !626, line: 128, baseType: !892)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tokenrun", file: !626, line: 129, size: 256, elements: !893)
!893 = !{!894, !896, !897, !898}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !892, file: !626, line: 131, baseType: !895, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !892, file: !626, line: 131, baseType: !895, size: 64, offset: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !892, file: !626, line: 132, baseType: !177, size: 64, offset: 128)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !892, file: !626, line: 132, baseType: !177, size: 64, offset: 192)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "cur_run", scope: !625, file: !626, line: 396, baseType: !895, size: 64, offset: 3776)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "lookaheads", scope: !625, file: !626, line: 397, baseType: !7, size: 32, offset: 3840)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "keep_tokens", scope: !625, file: !626, line: 400, baseType: !7, size: 32, offset: 3872)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "macro_buffer", scope: !625, file: !626, line: 403, baseType: !43, size: 64, offset: 3904)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "macro_buffer_len", scope: !625, file: !626, line: 404, baseType: !7, size: 32, offset: 3968)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "narrow_cset_desc", scope: !625, file: !626, line: 408, baseType: !686, size: 128, offset: 4032)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_cset_desc", scope: !625, file: !626, line: 412, baseType: !686, size: 128, offset: 4160)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "char16_cset_desc", scope: !625, file: !626, line: 416, baseType: !686, size: 128, offset: 4288)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "char32_cset_desc", scope: !625, file: !626, line: 420, baseType: !686, size: 128, offset: 4416)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "wide_cset_desc", scope: !625, file: !626, line: 424, baseType: !686, size: 128, offset: 4544)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !625, file: !626, line: 427, baseType: !52, size: 64, offset: 4672)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !625, file: !626, line: 428, baseType: !52, size: 64, offset: 4736)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "avoid_paste", scope: !625, file: !626, line: 431, baseType: !131, size: 192, offset: 4800)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !625, file: !626, line: 432, baseType: !131, size: 192, offset: 4992)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "deps", scope: !625, file: !626, line: 435, baseType: !914, size: 64, offset: 5184)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DICompositeType(tag: DW_TAG_structure_type, name: "deps", file: !6, line: 685, flags: DIFlagFwdDecl)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "hash_ob", scope: !625, file: !626, line: 439, baseType: !851, size: 704, offset: 5248)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_ob", scope: !625, file: !626, line: 443, baseType: !851, size: 704, offset: 5952)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "pragmas", scope: !625, file: !626, line: 447, baseType: !919, size: 64, offset: 6656)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DICompositeType(tag: DW_TAG_structure_type, name: "pragma_entry", file: !626, line: 447, flags: DIFlagFwdDecl)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !625, file: !626, line: 450, baseType: !922, size: 1088, offset: 6720)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_callbacks", file: !6, line: 472, size: 1088, elements: !923)
!923 = !{!924, !928, !934, !938, !942, !946, !947, !954, !958, !962, !966, !972, !976, !987, !988, !989, !991}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "line_change", scope: !922, file: !6, line: 475, baseType: !925, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{null, !623, !129, !45}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "file_change", scope: !922, file: !6, line: 481, baseType: !929, size: 64, offset: 64)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DISubroutineType(types: !931)
!931 = !{null, !623, !932}
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !722)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "dir_change", scope: !922, file: !6, line: 483, baseType: !935, size: 64, offset: 128)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DISubroutineType(types: !937)
!937 = !{null, !623, !50}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "include", scope: !922, file: !6, line: 484, baseType: !939, size: 64, offset: 192)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DISubroutineType(types: !941)
!941 = !{null, !623, !7, !52, !50, !45, !777}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "define", scope: !922, file: !6, line: 486, baseType: !943, size: 64, offset: 256)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DISubroutineType(types: !945)
!945 = !{null, !623, !7, !146}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "undef", scope: !922, file: !6, line: 487, baseType: !943, size: 64, offset: 320)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !922, file: !6, line: 488, baseType: !948, size: 64, offset: 384)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DISubroutineType(types: !950)
!950 = !{null, !623, !7, !951}
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !953)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_string", file: !6, line: 35, baseType: !200)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "def_pragma", scope: !922, file: !6, line: 489, baseType: !955, size: 64, offset: 448)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DISubroutineType(types: !957)
!957 = !{null, !623, !7}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "valid_pch", scope: !922, file: !6, line: 490, baseType: !959, size: 64, offset: 512)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DISubroutineType(types: !961)
!961 = !{!45, !623, !50, !45}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "read_pch", scope: !922, file: !6, line: 491, baseType: !963, size: 64, offset: 576)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DISubroutineType(types: !965)
!965 = !{null, !623, !50, !45, !50}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "missing_header", scope: !922, file: !6, line: 492, baseType: !967, size: 64, offset: 640)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "missing_header_cb", file: !6, line: 469, baseType: !968)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DISubroutineType(types: !970)
!970 = !{!50, !623, !50, !971}
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "macro_to_expand", scope: !922, file: !6, line: 496, baseType: !973, size: 64, offset: 704)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{!146, !623, !129}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !922, file: !6, line: 500, baseType: !977, size: 64, offset: 768)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DISubroutineType(types: !979)
!979 = !{!44, !623, !45, !135, !7, !50, !980}
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !982, line: 52, baseType: !983)
!982 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !984, line: 32, baseType: !985)
!984 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stdarg.h", directory: "")
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 527, baseType: !986)
!986 = !DICompositeType(tag: DW_TAG_array_type, baseType: !224, size: 192, elements: !104)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "used_define", scope: !922, file: !6, line: 506, baseType: !943, size: 64, offset: 832)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "used_undef", scope: !922, file: !6, line: 507, baseType: !943, size: 64, offset: 896)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "before_define", scope: !922, file: !6, line: 510, baseType: !990, size: 64, offset: 960)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !922, file: !6, line: 513, baseType: !992, size: 64, offset: 1024)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DISubroutineType(types: !994)
!994 = !{null, !623, !135, !146}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "hash_table", scope: !625, file: !626, line: 453, baseType: !996, size: 64, offset: 7808)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht", file: !152, line: 46, size: 1152, elements: !998)
!998 = !{!999, !1000, !1004, !1010, !1014, !1015, !1016, !1018, !1019, !1020}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !997, file: !152, line: 49, baseType: !851, size: 704)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !997, file: !152, line: 51, baseType: !1001, size: 64, offset: 704)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashnode", file: !152, line: 41, baseType: !1003)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_node", scope: !997, file: !152, line: 53, baseType: !1005, size: 64, offset: 768)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!1002, !1008}
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_table", file: !152, line: 40, baseType: !997)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_subobject", scope: !997, file: !152, line: 56, baseType: !1011, size: 64, offset: 832)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!49, !120}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "nslots", scope: !997, file: !152, line: 58, baseType: !7, size: 32, offset: 896)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "nelements", scope: !997, file: !152, line: 59, baseType: !7, size: 32, offset: 928)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "pfile", scope: !997, file: !152, line: 62, baseType: !1017, size: 64, offset: 960)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !997, file: !152, line: 65, baseType: !7, size: 32, offset: 1024)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !997, file: !152, line: 66, baseType: !7, size: 32, offset: 1056)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "entries_owned", scope: !997, file: !152, line: 69, baseType: !44, size: 8, offset: 1088)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "op_stack", scope: !625, file: !626, line: 456, baseType: !1022, size: 64, offset: 7872)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DICompositeType(tag: DW_TAG_structure_type, name: "op", file: !626, line: 42, flags: DIFlagFwdDecl)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "op_limit", scope: !625, file: !626, line: 456, baseType: !1022, size: 64, offset: 7936)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !625, file: !626, line: 459, baseType: !1026, size: 1024, offset: 8000)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_options", file: !6, line: 279, size: 1024, elements: !1027)
!1027 = !{!1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "tabstop", scope: !1026, file: !6, line: 282, baseType: !7, size: 32)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "lang", scope: !1026, file: !6, line: 285, baseType: !19, size: 32, offset: 32)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "cplusplus", scope: !1026, file: !6, line: 288, baseType: !44, size: 8, offset: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "cplusplus_comments", scope: !1026, file: !6, line: 291, baseType: !44, size: 8, offset: 72)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "objc", scope: !1026, file: !6, line: 296, baseType: !44, size: 8, offset: 80)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "discard_comments", scope: !1026, file: !6, line: 299, baseType: !44, size: 8, offset: 88)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "discard_comments_in_macro_exp", scope: !1026, file: !6, line: 303, baseType: !44, size: 8, offset: 96)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "trigraphs", scope: !1026, file: !6, line: 306, baseType: !44, size: 8, offset: 104)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "digraphs", scope: !1026, file: !6, line: 309, baseType: !44, size: 8, offset: 112)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "extended_numbers", scope: !1026, file: !6, line: 312, baseType: !44, size: 8, offset: 120)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "uliterals", scope: !1026, file: !6, line: 315, baseType: !44, size: 8, offset: 128)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "print_include_names", scope: !1026, file: !6, line: 318, baseType: !44, size: 8, offset: 136)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "warn_deprecated", scope: !1026, file: !6, line: 321, baseType: !44, size: 8, offset: 144)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "warn_comments", scope: !1026, file: !6, line: 324, baseType: !44, size: 8, offset: 152)
