; ModuleID = 'c-semantics.bc'
source_filename = "c-semantics.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }
%struct.tree_decl_minimal = type { %struct.tree_common, i32, i32, %union.tree_node*, %union.tree_node* }
%struct.tree_common = type { %struct.tree_base, %union.tree_node*, %union.tree_node* }
%struct.tree_base = type { i64 }

!334 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "profile_status_d", file: !335, line: 363, baseType: !5, size: 32, elements: !336)
!335 = !DIFile(filename: "./basic-block.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!336 = !{!337, !338, !339}
!337 = !DIEnumerator(name: "PROFILE_ABSENT", value: 0, isUnsigned: true)
!338 = !DIEnumerator(name: "PROFILE_GUESSED", value: 1, isUnsigned: true)
!339 = !DIEnumerator(name: "PROFILE_READ", value: 2, isUnsigned: true)
!340 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dom_state", file: !335, line: 355, baseType: !5, size: 32, elements: !341)
!341 = !{!342, !343, !344}
!342 = !DIEnumerator(name: "DOM_NONE", value: 0, isUnsigned: true)
!343 = !DIEnumerator(name: "DOM_NO_FAST_QUERY", value: 1, isUnsigned: true)
!344 = !DIEnumerator(name: "DOM_OK", value: 2, isUnsigned: true)
!345 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "calling_abi", file: !346, line: 474, baseType: !5, size: 32, elements: !347)
!346 = !DIFile(filename: "./config/i386/i386.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!347 = !{!348, !349}
!348 = !DIEnumerator(name: "SYSV_ABI", value: 0, isUnsigned: true)
!349 = !DIEnumerator(name: "MS_ABI", value: 1, isUnsigned: true)
!350 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "omp_clause_code", file: !133, line: 280, baseType: !5, size: 32, elements: !351)
!351 = !{!352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367}
!352 = !DIEnumerator(name: "OMP_CLAUSE_ERROR", value: 0, isUnsigned: true)
!353 = !DIEnumerator(name: "OMP_CLAUSE_PRIVATE", value: 1, isUnsigned: true)
!354 = !DIEnumerator(name: "OMP_CLAUSE_SHARED", value: 2, isUnsigned: true)
!355 = !DIEnumerator(name: "OMP_CLAUSE_FIRSTPRIVATE", value: 3, isUnsigned: true)
!356 = !DIEnumerator(name: "OMP_CLAUSE_LASTPRIVATE", value: 4, isUnsigned: true)
!357 = !DIEnumerator(name: "OMP_CLAUSE_REDUCTION", value: 5, isUnsigned: true)
!358 = !DIEnumerator(name: "OMP_CLAUSE_COPYIN", value: 6, isUnsigned: true)
!359 = !DIEnumerator(name: "OMP_CLAUSE_COPYPRIVATE", value: 7, isUnsigned: true)
!360 = !DIEnumerator(name: "OMP_CLAUSE_IF", value: 8, isUnsigned: true)
!361 = !DIEnumerator(name: "OMP_CLAUSE_NUM_THREADS", value: 9, isUnsigned: true)
!362 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE", value: 10, isUnsigned: true)
!363 = !DIEnumerator(name: "OMP_CLAUSE_NOWAIT", value: 11, isUnsigned: true)
!364 = !DIEnumerator(name: "OMP_CLAUSE_ORDERED", value: 12, isUnsigned: true)
!365 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT", value: 13, isUnsigned: true)
!366 = !DIEnumerator(name: "OMP_CLAUSE_COLLAPSE", value: 14, isUnsigned: true)
!367 = !DIEnumerator(name: "OMP_CLAUSE_UNTIED", value: 15, isUnsigned: true)
!368 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "omp_clause_default_kind", file: !133, line: 1817, baseType: !5, size: 32, elements: !369)
!369 = !{!370, !371, !372, !373, !374}
!370 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_UNSPECIFIED", value: 0, isUnsigned: true)
!371 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_SHARED", value: 1, isUnsigned: true)
!372 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_NONE", value: 2, isUnsigned: true)
!373 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_PRIVATE", value: 3, isUnsigned: true)
!374 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_FIRSTPRIVATE", value: 4, isUnsigned: true)
!375 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "omp_clause_schedule_kind", file: !133, line: 1805, baseType: !5, size: 32, elements: !376)
!376 = !{!377, !378, !379, !380, !381}
!377 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_STATIC", value: 0, isUnsigned: true)
!378 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_DYNAMIC", value: 1, isUnsigned: true)
!379 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_GUIDED", value: 2, isUnsigned: true)
!380 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_AUTO", value: 3, isUnsigned: true)
!381 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_RUNTIME", value: 4, isUnsigned: true)
!382 = !{!383, !384, !385, !386, !389, !390, !392, !132}
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!385 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !388)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !393, line: 56, baseType: !394)
!393 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !133, line: 3371, size: 1792, elements: !396)
!396 = !{!397, !430, !436, !449, !468, !479, !484, !493, !499, !512, !524, !562, !1055, !1083, !1091, !1092, !1097, !1106, !1112, !1117, !1121, !1125, !1408, !1455, !1461, !1467, !1474, !1485, !1499, !1516, !1528, !1550, !1565, !1737}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !395, file: !133, line: 3372, baseType: !398, size: 64)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !133, line: 360, size: 64, elements: !399)
!399 = !{!400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !398, file: !133, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !398, file: !133, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !398, file: !133, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !398, file: !133, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !398, file: !133, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !398, file: !133, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !398, file: !133, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !398, file: !133, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !398, file: !133, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !398, file: !133, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !398, file: !133, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !398, file: !133, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !398, file: !133, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !398, file: !133, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !398, file: !133, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !398, file: !133, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !398, file: !133, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !398, file: !133, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !398, file: !133, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !398, file: !133, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !398, file: !133, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !398, file: !133, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !398, file: !133, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !398, file: !133, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !398, file: !133, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !398, file: !133, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !398, file: !133, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !398, file: !133, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !398, file: !133, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !398, file: !133, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !395, file: !133, line: 3373, baseType: !431, size: 192)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !133, line: 402, size: 192, elements: !432)
!432 = !{!433, !434, !435}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !431, file: !133, line: 403, baseType: !398, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !431, file: !133, line: 404, baseType: !392, size: 64, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !431, file: !133, line: 405, baseType: !392, size: 64, offset: 128)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !395, file: !133, line: 3374, baseType: !437, size: 320)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !133, line: 1384, size: 320, elements: !438)
!438 = !{!439, !440}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !437, file: !133, line: 1385, baseType: !431, size: 192)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !437, file: !133, line: 1386, baseType: !441, size: 128, offset: 192)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !442, line: 58, baseType: !443)
!442 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !442, line: 54, size: 128, elements: !444)
!444 = !{!445, !447}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !443, file: !442, line: 56, baseType: !446, size: 64)
!446 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !443, file: !442, line: 57, baseType: !448, size: 64, offset: 64)
!448 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !395, file: !133, line: 3375, baseType: !450, size: 256)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !133, line: 1397, size: 256, elements: !451)
!451 = !{!452, !453}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !450, file: !133, line: 1398, baseType: !431, size: 192)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !450, file: !133, line: 1399, baseType: !454, size: 64, offset: 192)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !456, line: 52, size: 256, elements: !457)
!456 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!457 = !{!458, !459, !460, !461, !462, !463, !464}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !455, file: !456, line: 56, baseType: !5, size: 2, flags: DIFlagBitField, extraData: i64 0)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !455, file: !456, line: 57, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !455, file: !456, line: 58, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !455, file: !456, line: 59, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !455, file: !456, line: 60, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !455, file: !456, line: 61, baseType: !5, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !455, file: !456, line: 62, baseType: !465, size: 192, offset: 64)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 192, elements: !466)
!466 = !{!467}
!467 = !DISubrange(count: 3)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !395, file: !133, line: 3376, baseType: !469, size: 256)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !133, line: 1408, size: 256, elements: !470)
!470 = !{!471, !472}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !469, file: !133, line: 1409, baseType: !431, size: 192)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !469, file: !133, line: 1410, baseType: !473, size: 64, offset: 192)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !475, line: 27, size: 192, elements: !476)
!475 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!476 = !{!477, !478}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !474, file: !475, line: 29, baseType: !441, size: 128)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !474, file: !475, line: 30, baseType: !3, size: 32, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !395, file: !133, line: 3377, baseType: !480, size: 256)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !133, line: 1437, size: 256, elements: !481)
!481 = !{!482, !483}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !480, file: !133, line: 1438, baseType: !431, size: 192)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !480, file: !133, line: 1439, baseType: !392, size: 64, offset: 192)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !395, file: !133, line: 3378, baseType: !485, size: 256)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !133, line: 1418, size: 256, elements: !486)
!486 = !{!487, !488, !489}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !485, file: !133, line: 1419, baseType: !431, size: 192)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !485, file: !133, line: 1420, baseType: !385, size: 32, offset: 192)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !485, file: !133, line: 1421, baseType: !490, size: 8, offset: 224)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 8, elements: !491)
!491 = !{!492}
!492 = !DISubrange(count: 1)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !395, file: !133, line: 3379, baseType: !494, size: 320)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !133, line: 1428, size: 320, elements: !495)
!495 = !{!496, !497, !498}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !494, file: !133, line: 1429, baseType: !431, size: 192)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !494, file: !133, line: 1430, baseType: !392, size: 64, offset: 192)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !494, file: !133, line: 1431, baseType: !392, size: 64, offset: 256)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !395, file: !133, line: 3380, baseType: !500, size: 320)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !133, line: 1460, size: 320, elements: !501)
!501 = !{!502, !503}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !500, file: !133, line: 1461, baseType: !431, size: 192)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !500, file: !133, line: 1462, baseType: !504, size: 128, offset: 192)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !505, line: 31, size: 128, elements: !506)
!505 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!506 = !{!507, !510, !511}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !504, file: !505, line: 32, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !384)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !504, file: !505, line: 33, baseType: !5, size: 32, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !504, file: !505, line: 34, baseType: !5, size: 32, offset: 96)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !395, file: !133, line: 3381, baseType: !513, size: 384)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !133, line: 2507, size: 384, elements: !514)
!514 = !{!515, !516, !521, !522, !523}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !513, file: !133, line: 2508, baseType: !431, size: 192)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !513, file: !133, line: 2509, baseType: !517, size: 32, offset: 192)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !518, line: 58, baseType: !519)
!518 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !520, line: 44, baseType: !5)
!520 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!521 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !513, file: !133, line: 2510, baseType: !5, size: 32, offset: 224)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !513, file: !133, line: 2511, baseType: !392, size: 64, offset: 256)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !513, file: !133, line: 2512, baseType: !392, size: 64, offset: 320)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !395, file: !133, line: 3382, baseType: !525, size: 896)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !133, line: 2652, size: 896, elements: !526)
!526 = !{!527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !525, file: !133, line: 2653, baseType: !513, size: 384)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !525, file: !133, line: 2654, baseType: !392, size: 64, offset: 384)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !525, file: !133, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !525, file: !133, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !525, file: !133, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !525, file: !133, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !525, file: !133, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !525, file: !133, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !525, file: !133, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !525, file: !133, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !525, file: !133, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !525, file: !133, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !525, file: !133, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !525, file: !133, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !525, file: !133, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !525, file: !133, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !525, file: !133, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !525, file: !133, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !525, file: !133, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !525, file: !133, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !525, file: !133, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !525, file: !133, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !525, file: !133, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !525, file: !133, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !525, file: !133, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !525, file: !133, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !525, file: !133, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !525, file: !133, line: 2703, baseType: !5, size: 32, offset: 512)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !525, file: !133, line: 2705, baseType: !392, size: 64, offset: 576)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !525, file: !133, line: 2706, baseType: !392, size: 64, offset: 640)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !525, file: !133, line: 2707, baseType: !392, size: 64, offset: 704)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !525, file: !133, line: 2708, baseType: !392, size: 64, offset: 768)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !525, file: !133, line: 2711, baseType: !560, size: 64, offset: 832)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !133, line: 2711, flags: DIFlagFwdDecl)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !395, file: !133, line: 3383, baseType: !563, size: 960)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !133, line: 2756, size: 960, elements: !564)
!564 = !{!565, !566}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !563, file: !133, line: 2757, baseType: !525, size: 896)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !563, file: !133, line: 2758, baseType: !567, size: 64, offset: 896)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !393, line: 50, baseType: !568)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !570, line: 240, size: 384, elements: !571)
!570 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!571 = !{!572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !569, file: !570, line: 242, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !569, file: !570, line: 245, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !569, file: !570, line: 252, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !569, file: !570, line: 257, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !569, file: !570, line: 265, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !569, file: !570, line: 277, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !569, file: !570, line: 291, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !569, file: !570, line: 298, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !569, file: !570, line: 305, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !569, file: !570, line: 310, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !569, file: !570, line: 321, baseType: !583, size: 320, offset: 64)
!583 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !570, line: 315, size: 320, elements: !584)
!584 = !{!585, !988, !990, !1053, !1054}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !583, file: !570, line: 316, baseType: !586, size: 64)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !587, size: 64, elements: !491)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !570, line: 183, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !570, line: 166, size: 64, elements: !589)
!589 = !{!590, !591, !592, !593, !594, !602, !603, !615, !618, !678, !679, !965, !978, !985}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !588, file: !570, line: 168, baseType: !385, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !588, file: !570, line: 169, baseType: !5, size: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !588, file: !570, line: 170, baseType: !390, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !588, file: !570, line: 171, baseType: !567, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !588, file: !570, line: 172, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !393, line: 53, baseType: !596)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !570, line: 359, size: 128, elements: !598)
!598 = !{!599, !600}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !597, file: !570, line: 360, baseType: !385, size: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !597, file: !570, line: 361, baseType: !601, size: 64, offset: 64)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 64, elements: !491)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !588, file: !570, line: 173, baseType: !3, size: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !588, file: !570, line: 174, baseType: !604, size: 32)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !570, line: 133, baseType: !605)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !570, line: 115, size: 32, elements: !606)
!606 = !{!607, !608, !609, !610, !611, !612, !613, !614}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !605, file: !570, line: 118, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !605, file: !570, line: 120, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !605, file: !570, line: 121, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !605, file: !570, line: 123, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !605, file: !570, line: 125, baseType: !5, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !605, file: !570, line: 127, baseType: !5, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !605, file: !570, line: 130, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !605, file: !570, line: 132, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !588, file: !570, line: 175, baseType: !616, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !570, line: 175, flags: DIFlagFwdDecl)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !588, file: !570, line: 176, baseType: !619, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !621, line: 75, size: 256, elements: !622)
!621 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!622 = !{!623, !637, !638, !639}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !620, file: !621, line: 76, baseType: !624, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !621, line: 68, baseType: !626)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !621, line: 63, size: 320, elements: !627)
!627 = !{!628, !630, !631, !632}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !626, file: !621, line: 64, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !626, file: !621, line: 65, baseType: !629, size: 64, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !626, file: !621, line: 66, baseType: !5, size: 32, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !626, file: !621, line: 67, baseType: !633, size: 128, offset: 192)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !634, size: 128, elements: !635)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !621, line: 29, baseType: !446)
!635 = !{!636}
!636 = !DISubrange(count: 2)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !620, file: !621, line: 77, baseType: !624, size: 64, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !620, file: !621, line: 78, baseType: !5, size: 32, offset: 128)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !620, file: !621, line: 79, baseType: !640, size: 64, offset: 192)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !621, line: 49, baseType: !642)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !621, line: 45, size: 832, elements: !643)
!643 = !{!644, !645, !646}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !642, file: !621, line: 46, baseType: !629, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !642, file: !621, line: 47, baseType: !619, size: 64, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !642, file: !621, line: 48, baseType: !647, size: 704, offset: 128)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !648, line: 164, size: 704, elements: !649)
!648 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!649 = !{!650, !651, !661, !662, !663, !664, !665, !666, !670, !674, !675, !676, !677}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !647, file: !648, line: 166, baseType: !448, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !647, file: !648, line: 167, baseType: !652, size: 64, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !648, line: 157, size: 192, elements: !654)
!654 = !{!655, !656, !657}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !653, file: !648, line: 159, baseType: !387, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !653, file: !648, line: 160, baseType: !652, size: 64, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !653, file: !648, line: 161, baseType: !658, size: 32, offset: 128)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 32, elements: !659)
!659 = !{!660}
!660 = !DISubrange(count: 4)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !647, file: !648, line: 168, baseType: !387, size: 64, offset: 128)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !647, file: !648, line: 169, baseType: !387, size: 64, offset: 192)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !647, file: !648, line: 170, baseType: !387, size: 64, offset: 256)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !647, file: !648, line: 171, baseType: !448, size: 64, offset: 320)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !647, file: !648, line: 172, baseType: !385, size: 32, offset: 384)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !647, file: !648, line: 176, baseType: !667, size: 64, offset: 448)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DISubroutineType(types: !669)
!669 = !{!652, !389, !448}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !647, file: !648, line: 177, baseType: !671, size: 64, offset: 512)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DISubroutineType(types: !673)
!673 = !{null, !389, !652}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !647, file: !648, line: 178, baseType: !389, size: 64, offset: 576)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !647, file: !648, line: 179, baseType: !5, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !647, file: !648, line: 180, baseType: !5, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !647, file: !648, line: 184, baseType: !5, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !588, file: !570, line: 177, baseType: !392, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !588, file: !570, line: 178, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !335, line: 217, size: 832, elements: !682)
!682 = !{!683, !930, !931, !932, !935, !939, !940, !941, !959, !960, !961, !962, !963, !964}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !681, file: !335, line: 219, baseType: !684, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !335, line: 151, baseType: !686)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !335, line: 151, size: 128, elements: !687)
!687 = !{!688}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !686, file: !335, line: 151, baseType: !689, size: 128)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !335, line: 150, baseType: !690)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !335, line: 150, size: 128, elements: !691)
!691 = !{!692, !693, !694}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !690, file: !335, line: 150, baseType: !5, size: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !690, file: !335, line: 150, baseType: !5, size: 32, offset: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !690, file: !335, line: 150, baseType: !695, size: 64, offset: 64)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !696, size: 64, elements: !491)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !393, line: 108, baseType: !697)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !335, line: 122, size: 512, elements: !699)
!699 = !{!700, !701, !702, !922, !923, !924, !925, !926, !927, !928}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !698, file: !335, line: 124, baseType: !680, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !698, file: !335, line: 125, baseType: !680, size: 64, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !698, file: !335, line: 131, baseType: !703, size: 64, offset: 128)
!703 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !335, line: 128, size: 64, elements: !704)
!704 = !{!705, !921}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !703, file: !335, line: 129, baseType: !706, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !393, line: 66, baseType: !707)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !709, line: 143, size: 192, elements: !710)
!709 = !DIFile(filename: "./gimple.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!710 = !{!711, !919, !920}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !708, file: !709, line: 145, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !393, line: 69, baseType: !713)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !709, line: 136, size: 192, elements: !715)
!715 = !{!716, !917, !918}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !714, file: !709, line: 137, baseType: !717, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !393, line: 58, baseType: !718)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !709, line: 737, size: 768, elements: !720)
!720 = !{!721, !738, !772, !778, !783, !788, !795, !801, !807, !812, !826, !831, !837, !842, !852, !857, !875, !882, !889, !895, !900, !906, !912}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !719, file: !709, line: 738, baseType: !722, size: 256)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !709, line: 271, size: 256, elements: !723)
!723 = !{!724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !722, file: !709, line: 274, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !722, file: !709, line: 277, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !722, file: !709, line: 281, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !722, file: !709, line: 284, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !722, file: !709, line: 291, baseType: !5, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !722, file: !709, line: 295, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !722, file: !709, line: 298, baseType: !5, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !722, file: !709, line: 301, baseType: !5, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !722, file: !709, line: 307, baseType: !5, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !722, file: !709, line: 312, baseType: !5, size: 32, offset: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !722, file: !709, line: 316, baseType: !517, size: 32, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !722, file: !709, line: 319, baseType: !5, size: 32, offset: 96)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !722, file: !709, line: 323, baseType: !680, size: 64, offset: 128)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !722, file: !709, line: 327, baseType: !392, size: 64, offset: 192)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !719, file: !709, line: 739, baseType: !739, size: 448)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !709, line: 350, size: 448, elements: !740)
!740 = !{!741, !770}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !739, file: !709, line: 353, baseType: !742, size: 384)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !709, line: 333, size: 384, elements: !743)
!743 = !{!744, !745, !753}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !742, file: !709, line: 336, baseType: !722, size: 256)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !742, file: !709, line: 343, baseType: !746, size: 64, offset: 256)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !748, line: 37, size: 128, elements: !749)
!748 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!749 = !{!750, !751}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !747, file: !748, line: 39, baseType: !746, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !747, file: !748, line: 40, baseType: !752, size: 64, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !742, file: !709, line: 344, baseType: !754, size: 64, offset: 320)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !748, line: 45, size: 320, elements: !756)
!756 = !{!757, !758}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !755, file: !748, line: 47, baseType: !754, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !755, file: !748, line: 48, baseType: !759, size: 256, offset: 64)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !133, line: 1883, size: 256, elements: !760)
!760 = !{!761, !763, !764, !769}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !759, file: !133, line: 1884, baseType: !762, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !759, file: !133, line: 1885, baseType: !762, size: 64, offset: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !759, file: !133, line: 1891, baseType: !765, size: 64, offset: 128)
!765 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !759, file: !133, line: 1891, size: 64, elements: !766)
!766 = !{!767, !768}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !765, file: !133, line: 1891, baseType: !717, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !765, file: !133, line: 1891, baseType: !392, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !759, file: !133, line: 1892, baseType: !752, size: 64, offset: 192)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !739, file: !709, line: 359, baseType: !771, size: 64, offset: 384)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !392, size: 64, elements: !491)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !719, file: !709, line: 740, baseType: !773, size: 512)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !709, line: 365, size: 512, elements: !774)
!774 = !{!775, !776, !777}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !773, file: !709, line: 368, baseType: !742, size: 384)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !773, file: !709, line: 373, baseType: !392, size: 64, offset: 384)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !773, file: !709, line: 374, baseType: !392, size: 64, offset: 448)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !719, file: !709, line: 741, baseType: !779, size: 576)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !709, line: 380, size: 576, elements: !780)
!780 = !{!781, !782}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !779, file: !709, line: 383, baseType: !773, size: 512)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !779, file: !709, line: 389, baseType: !771, size: 64, offset: 512)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !719, file: !709, line: 742, baseType: !784, size: 320)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !709, line: 395, size: 320, elements: !785)
!785 = !{!786, !787}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !784, file: !709, line: 397, baseType: !722, size: 256)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !784, file: !709, line: 400, baseType: !706, size: 64, offset: 256)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !719, file: !709, line: 743, baseType: !789, size: 448)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !709, line: 406, size: 448, elements: !790)
!790 = !{!791, !792, !793, !794}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !789, file: !709, line: 408, baseType: !722, size: 256)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !789, file: !709, line: 412, baseType: !392, size: 64, offset: 256)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !789, file: !709, line: 420, baseType: !392, size: 64, offset: 320)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !789, file: !709, line: 423, baseType: !706, size: 64, offset: 384)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !719, file: !709, line: 744, baseType: !796, size: 384)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !709, line: 429, size: 384, elements: !797)
!797 = !{!798, !799, !800}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !796, file: !709, line: 431, baseType: !722, size: 256)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !796, file: !709, line: 434, baseType: !392, size: 64, offset: 256)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !796, file: !709, line: 437, baseType: !706, size: 64, offset: 320)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !719, file: !709, line: 745, baseType: !802, size: 384)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !709, line: 443, size: 384, elements: !803)
!803 = !{!804, !805, !806}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !802, file: !709, line: 445, baseType: !722, size: 256)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !802, file: !709, line: 449, baseType: !392, size: 64, offset: 256)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !802, file: !709, line: 453, baseType: !706, size: 64, offset: 320)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !719, file: !709, line: 746, baseType: !808, size: 320)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !709, line: 459, size: 320, elements: !809)
!809 = !{!810, !811}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !808, file: !709, line: 461, baseType: !722, size: 256)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !808, file: !709, line: 464, baseType: !392, size: 64, offset: 256)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !719, file: !709, line: 747, baseType: !813, size: 768)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !709, line: 469, size: 768, elements: !814)
!814 = !{!815, !816, !817, !818, !819}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !813, file: !709, line: 471, baseType: !722, size: 256)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !813, file: !709, line: 474, baseType: !5, size: 32, offset: 256)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !813, file: !709, line: 475, baseType: !5, size: 32, offset: 288)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !813, file: !709, line: 478, baseType: !392, size: 64, offset: 320)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !813, file: !709, line: 481, baseType: !820, size: 384, offset: 384)
!820 = !DICompositeType(tag: DW_TAG_array_type, baseType: !821, size: 384, elements: !491)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !133, line: 1917, size: 384, elements: !822)
!822 = !{!823, !824, !825}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !821, file: !133, line: 1920, baseType: !759, size: 256)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !821, file: !133, line: 1921, baseType: !392, size: 64, offset: 256)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !821, file: !133, line: 1922, baseType: !517, size: 32, offset: 320)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !719, file: !709, line: 748, baseType: !827, size: 320)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !709, line: 487, size: 320, elements: !828)
!828 = !{!829, !830}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !827, file: !709, line: 490, baseType: !722, size: 256)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !827, file: !709, line: 494, baseType: !385, size: 32, offset: 256)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !719, file: !709, line: 749, baseType: !832, size: 384)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !709, line: 500, size: 384, elements: !833)
!833 = !{!834, !835, !836}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !832, file: !709, line: 502, baseType: !722, size: 256)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !832, file: !709, line: 506, baseType: !706, size: 64, offset: 256)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !832, file: !709, line: 510, baseType: !706, size: 64, offset: 320)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !719, file: !709, line: 750, baseType: !838, size: 320)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !709, line: 529, size: 320, elements: !839)
!839 = !{!840, !841}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !838, file: !709, line: 531, baseType: !722, size: 256)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !838, file: !709, line: 540, baseType: !706, size: 64, offset: 256)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !719, file: !709, line: 751, baseType: !843, size: 704)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !709, line: 546, size: 704, elements: !844)
!844 = !{!845, !846, !847, !848, !849, !850, !851}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !843, file: !709, line: 549, baseType: !773, size: 512)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !843, file: !709, line: 553, baseType: !390, size: 64, offset: 512)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !843, file: !709, line: 557, baseType: !384, size: 8, offset: 576)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !843, file: !709, line: 558, baseType: !384, size: 8, offset: 584)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !843, file: !709, line: 559, baseType: !384, size: 8, offset: 592)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !843, file: !709, line: 560, baseType: !384, size: 8, offset: 600)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !843, file: !709, line: 566, baseType: !771, size: 64, offset: 640)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !719, file: !709, line: 752, baseType: !853, size: 384)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !709, line: 571, size: 384, elements: !854)
!854 = !{!855, !856}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !853, file: !709, line: 573, baseType: !784, size: 320)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !853, file: !709, line: 577, baseType: !392, size: 64, offset: 320)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !719, file: !709, line: 753, baseType: !858, size: 576)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !709, line: 600, size: 576, elements: !859)
!859 = !{!860, !861, !862, !865, !874}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !858, file: !709, line: 602, baseType: !784, size: 320)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !858, file: !709, line: 605, baseType: !392, size: 64, offset: 320)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !858, file: !709, line: 609, baseType: !863, size: 64, offset: 384)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !864, line: 46, baseType: !446)
!864 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!865 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !858, file: !709, line: 612, baseType: !866, size: 64, offset: 448)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !709, line: 581, size: 320, elements: !868)
!868 = !{!869, !870, !871, !872, !873}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !867, file: !709, line: 583, baseType: !132, size: 32)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !867, file: !709, line: 586, baseType: !392, size: 64, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !867, file: !709, line: 589, baseType: !392, size: 64, offset: 128)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !867, file: !709, line: 592, baseType: !392, size: 64, offset: 192)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !867, file: !709, line: 595, baseType: !392, size: 64, offset: 256)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !858, file: !709, line: 616, baseType: !706, size: 64, offset: 512)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !719, file: !709, line: 754, baseType: !876, size: 512)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !709, line: 622, size: 512, elements: !877)
!877 = !{!878, !879, !880, !881}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !876, file: !709, line: 624, baseType: !784, size: 320)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !876, file: !709, line: 628, baseType: !392, size: 64, offset: 320)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !876, file: !709, line: 632, baseType: !392, size: 64, offset: 384)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !876, file: !709, line: 636, baseType: !392, size: 64, offset: 448)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !719, file: !709, line: 755, baseType: !883, size: 704)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !709, line: 642, size: 704, elements: !884)
!884 = !{!885, !886, !887, !888}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !883, file: !709, line: 644, baseType: !876, size: 512)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !883, file: !709, line: 648, baseType: !392, size: 64, offset: 512)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !883, file: !709, line: 652, baseType: !392, size: 64, offset: 576)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !883, file: !709, line: 653, baseType: !392, size: 64, offset: 640)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !719, file: !709, line: 756, baseType: !890, size: 448)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !709, line: 663, size: 448, elements: !891)
!891 = !{!892, !893, !894}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !890, file: !709, line: 665, baseType: !784, size: 320)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !890, file: !709, line: 668, baseType: !392, size: 64, offset: 320)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !890, file: !709, line: 673, baseType: !392, size: 64, offset: 384)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !719, file: !709, line: 757, baseType: !896, size: 384)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !709, line: 694, size: 384, elements: !897)
!897 = !{!898, !899}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !896, file: !709, line: 696, baseType: !784, size: 320)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !896, file: !709, line: 699, baseType: !392, size: 64, offset: 320)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !719, file: !709, line: 758, baseType: !901, size: 384)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !709, line: 681, size: 384, elements: !902)
!902 = !{!903, !904, !905}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !901, file: !709, line: 683, baseType: !722, size: 256)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !901, file: !709, line: 686, baseType: !392, size: 64, offset: 256)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !901, file: !709, line: 689, baseType: !392, size: 64, offset: 320)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !719, file: !709, line: 759, baseType: !907, size: 384)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !709, line: 707, size: 384, elements: !908)
!908 = !{!909, !910, !911}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !907, file: !709, line: 709, baseType: !722, size: 256)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !907, file: !709, line: 712, baseType: !392, size: 64, offset: 256)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !907, file: !709, line: 712, baseType: !392, size: 64, offset: 320)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !719, file: !709, line: 760, baseType: !913, size: 320)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !709, line: 718, size: 320, elements: !914)
!914 = !{!915, !916}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !913, file: !709, line: 720, baseType: !722, size: 256)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !913, file: !709, line: 723, baseType: !392, size: 64, offset: 256)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !714, file: !709, line: 138, baseType: !713, size: 64, offset: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !714, file: !709, line: 139, baseType: !713, size: 64, offset: 128)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !708, file: !709, line: 146, baseType: !712, size: 64, offset: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !708, file: !709, line: 152, baseType: !706, size: 64, offset: 128)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !703, file: !335, line: 130, baseType: !567, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !698, file: !335, line: 134, baseType: !389, size: 64, offset: 192)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !698, file: !335, line: 137, baseType: !392, size: 64, offset: 256)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !698, file: !335, line: 138, baseType: !517, size: 32, offset: 320)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !698, file: !335, line: 142, baseType: !5, size: 32, offset: 352)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !698, file: !335, line: 144, baseType: !385, size: 32, offset: 384)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !698, file: !335, line: 145, baseType: !385, size: 32, offset: 416)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !698, file: !335, line: 146, baseType: !929, size: 64, offset: 448)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !335, line: 119, baseType: !448)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !681, file: !335, line: 220, baseType: !684, size: 64, offset: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !681, file: !335, line: 223, baseType: !389, size: 64, offset: 128)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !681, file: !335, line: 226, baseType: !933, size: 64, offset: 192)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !335, line: 185, flags: DIFlagFwdDecl)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !681, file: !335, line: 229, baseType: !936, size: 128, offset: 256)
!936 = !DICompositeType(tag: DW_TAG_array_type, baseType: !937, size: 128, elements: !635)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !335, line: 229, flags: DIFlagFwdDecl)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !681, file: !335, line: 232, baseType: !680, size: 64, offset: 384)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !681, file: !335, line: 233, baseType: !680, size: 64, offset: 448)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !681, file: !335, line: 238, baseType: !942, size: 64, offset: 512)
!942 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !335, line: 235, size: 64, elements: !943)
!943 = !{!944, !950}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !942, file: !335, line: 236, baseType: !945, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !335, line: 273, size: 128, elements: !947)
!947 = !{!948, !949}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !946, file: !335, line: 275, baseType: !706, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !946, file: !335, line: 278, baseType: !706, size: 64, offset: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !942, file: !335, line: 237, baseType: !951, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !335, line: 259, size: 320, elements: !953)
!953 = !{!954, !955, !956, !957, !958}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !952, file: !335, line: 261, baseType: !567, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !952, file: !335, line: 262, baseType: !567, size: 64, offset: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !952, file: !335, line: 266, baseType: !567, size: 64, offset: 128)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !952, file: !335, line: 267, baseType: !567, size: 64, offset: 192)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !952, file: !335, line: 270, baseType: !385, size: 32, offset: 256)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !681, file: !335, line: 241, baseType: !929, size: 64, offset: 576)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !681, file: !335, line: 244, baseType: !385, size: 32, offset: 640)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !681, file: !335, line: 247, baseType: !385, size: 32, offset: 672)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !681, file: !335, line: 250, baseType: !385, size: 32, offset: 704)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !681, file: !335, line: 253, baseType: !385, size: 32, offset: 736)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !681, file: !335, line: 256, baseType: !385, size: 32, offset: 768)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !588, file: !570, line: 179, baseType: !966, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !570, line: 150, baseType: !968)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !570, line: 142, size: 320, elements: !969)
!969 = !{!970, !971, !972, !973, !976, !977}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !968, file: !570, line: 144, baseType: !392, size: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !968, file: !570, line: 145, baseType: !567, size: 64, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !968, file: !570, line: 146, baseType: !567, size: 64, offset: 128)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !968, file: !570, line: 147, baseType: !974, size: 32, offset: 192)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !975, line: 31, baseType: !385)
!975 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!976 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !968, file: !570, line: 148, baseType: !5, size: 32, offset: 224)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !968, file: !570, line: 149, baseType: !384, size: 8, offset: 256)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !588, file: !570, line: 180, baseType: !979, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !570, line: 162, baseType: !981)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !570, line: 159, size: 128, elements: !982)
!982 = !{!983, !984}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !981, file: !570, line: 160, baseType: !392, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !981, file: !570, line: 161, baseType: !448, size: 64, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !588, file: !570, line: 181, baseType: !986, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !570, line: 181, flags: DIFlagFwdDecl)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !583, file: !570, line: 317, baseType: !989, size: 64)
!989 = !DICompositeType(tag: DW_TAG_array_type, baseType: !448, size: 64, elements: !491)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !583, file: !570, line: 318, baseType: !991, size: 320)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !570, line: 188, size: 320, elements: !992)
!992 = !{!993, !995, !1052}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !991, file: !570, line: 190, baseType: !994, size: 192)
!994 = !DICompositeType(tag: DW_TAG_array_type, baseType: !587, size: 192, elements: !466)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !991, file: !570, line: 193, baseType: !996, size: 64, offset: 192)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !570, line: 206, size: 320, elements: !998)
!998 = !{!999, !1037, !1038, !1039, !1051}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !997, file: !570, line: 208, baseType: !1000, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !393, line: 62, baseType: !1002)
!1002 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1003, line: 538, size: 256, elements: !1004)
!1003 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1004 = !{!1005, !1009, !1015, !1028}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1002, file: !1003, line: 539, baseType: !1006, size: 32)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1003, line: 482, size: 32, elements: !1007)
!1007 = !{!1008}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1006, file: !1003, line: 484, baseType: !5, size: 32)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1002, file: !1003, line: 540, baseType: !1010, size: 192)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1003, line: 488, size: 192, elements: !1011)
!1011 = !{!1012, !1013, !1014}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1010, file: !1003, line: 489, baseType: !1006, size: 32)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1010, file: !1003, line: 492, baseType: !390, size: 64, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1010, file: !1003, line: 496, baseType: !392, size: 64, offset: 128)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1002, file: !1003, line: 541, baseType: !1016, size: 256)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1003, line: 504, size: 256, elements: !1017)
!1017 = !{!1018, !1019, !1026, !1027}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1016, file: !1003, line: 505, baseType: !1006, size: 32)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1016, file: !1003, line: 509, baseType: !1020, size: 64, offset: 64)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1003, line: 501, baseType: !1021)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{null, !1024}
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1016, file: !1003, line: 510, baseType: !1024, size: 64, offset: 128)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1016, file: !1003, line: 513, baseType: !1000, size: 64, offset: 192)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1002, file: !1003, line: 542, baseType: !1029, size: 128)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1003, line: 530, size: 128, elements: !1030)
!1030 = !{!1031, !1032}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1029, file: !1003, line: 531, baseType: !1006, size: 32)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1029, file: !1003, line: 534, baseType: !1033, size: 64, offset: 64)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1003, line: 525, baseType: !1034)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!384, !392, !390, !446, !446}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !997, file: !570, line: 211, baseType: !5, size: 32, offset: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !997, file: !570, line: 214, baseType: !448, size: 64, offset: 128)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !997, file: !570, line: 224, baseType: !1040, size: 64, offset: 192)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !570, line: 202, baseType: !1042)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !570, line: 202, size: 128, elements: !1043)
!1043 = !{!1044}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1042, file: !570, line: 202, baseType: !1045, size: 128)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !570, line: 200, baseType: !1046)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !570, line: 200, size: 128, elements: !1047)
!1047 = !{!1048, !1049, !1050}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1046, file: !570, line: 200, baseType: !5, size: 32)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1046, file: !570, line: 200, baseType: !5, size: 32, offset: 32)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1046, file: !570, line: 200, baseType: !601, size: 64, offset: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !997, file: !570, line: 234, baseType: !1040, size: 64, offset: 256)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !991, file: !570, line: 197, baseType: !448, size: 64, offset: 256)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !583, file: !570, line: 319, baseType: !455, size: 256)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !583, file: !570, line: 320, baseType: !474, size: 192)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !395, file: !133, line: 3384, baseType: !1056, size: 1472)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !133, line: 3114, size: 1472, elements: !1057)
!1057 = !{!1058, !1079, !1080, !1081, !1082}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1056, file: !133, line: 3115, baseType: !1059, size: 1216)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !133, line: 2984, size: 1216, elements: !1060)
!1060 = !{!1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1059, file: !133, line: 2985, baseType: !563, size: 960)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1059, file: !133, line: 2986, baseType: !392, size: 64, offset: 960)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1059, file: !133, line: 2987, baseType: !392, size: 64, offset: 1024)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1059, file: !133, line: 2988, baseType: !392, size: 64, offset: 1088)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1059, file: !133, line: 2991, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1059, file: !133, line: 2992, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1059, file: !133, line: 2993, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1059, file: !133, line: 2994, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1059, file: !133, line: 2995, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1059, file: !133, line: 2996, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1059, file: !133, line: 2998, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1059, file: !133, line: 3000, baseType: !5, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1059, file: !133, line: 3002, baseType: !5, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1059, file: !133, line: 3003, baseType: !5, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1059, file: !133, line: 3004, baseType: !5, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1059, file: !133, line: 3005, baseType: !5, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1059, file: !133, line: 3007, baseType: !5, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1059, file: !133, line: 3010, baseType: !5, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1056, file: !133, line: 3117, baseType: !392, size: 64, offset: 1216)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1056, file: !133, line: 3119, baseType: !392, size: 64, offset: 1280)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1056, file: !133, line: 3121, baseType: !392, size: 64, offset: 1344)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1056, file: !133, line: 3123, baseType: !392, size: 64, offset: 1408)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !395, file: !133, line: 3385, baseType: !1084, size: 1088)
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !133, line: 2874, size: 1088, elements: !1085)
!1085 = !{!1086, !1087, !1088}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1084, file: !133, line: 2875, baseType: !563, size: 960)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1084, file: !133, line: 2876, baseType: !567, size: 64, offset: 960)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1084, file: !133, line: 2877, baseType: !1089, size: 64, offset: 1024)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !133, line: 2856, flags: DIFlagFwdDecl)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !395, file: !133, line: 3386, baseType: !1059, size: 1216)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !395, file: !133, line: 3387, baseType: !1093, size: 1280)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !133, line: 3093, size: 1280, elements: !1094)
!1094 = !{!1095, !1096}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1093, file: !133, line: 3094, baseType: !1059, size: 1216)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1093, file: !133, line: 3095, baseType: !1089, size: 64, offset: 1216)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !395, file: !133, line: 3388, baseType: !1098, size: 1216)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !133, line: 2824, size: 1216, elements: !1099)
!1099 = !{!1100, !1101, !1102, !1103, !1104, !1105}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1098, file: !133, line: 2825, baseType: !525, size: 896)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1098, file: !133, line: 2827, baseType: !392, size: 64, offset: 896)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1098, file: !133, line: 2828, baseType: !392, size: 64, offset: 960)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1098, file: !133, line: 2829, baseType: !392, size: 64, offset: 1024)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1098, file: !133, line: 2830, baseType: !392, size: 64, offset: 1088)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1098, file: !133, line: 2831, baseType: !392, size: 64, offset: 1152)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !395, file: !133, line: 3389, baseType: !1107, size: 1024)
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !133, line: 2850, size: 1024, elements: !1108)
!1108 = !{!1109, !1110, !1111}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1107, file: !133, line: 2851, baseType: !563, size: 960)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1107, file: !133, line: 2852, baseType: !385, size: 32, offset: 960)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1107, file: !133, line: 2853, baseType: !385, size: 32, offset: 992)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !395, file: !133, line: 3390, baseType: !1113, size: 1024)
!1113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !133, line: 2857, size: 1024, elements: !1114)
!1114 = !{!1115, !1116}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1113, file: !133, line: 2858, baseType: !563, size: 960)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1113, file: !133, line: 2859, baseType: !1089, size: 64, offset: 960)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !395, file: !133, line: 3391, baseType: !1118, size: 960)
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !133, line: 2862, size: 960, elements: !1119)
!1119 = !{!1120}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1118, file: !133, line: 2863, baseType: !563, size: 960)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !395, file: !133, line: 3392, baseType: !1122, size: 1472)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !133, line: 3304, size: 1472, elements: !1123)
!1123 = !{!1124}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1122, file: !133, line: 3305, baseType: !1056, size: 1472)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !395, file: !133, line: 3393, baseType: !1126, size: 1792)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !133, line: 3248, size: 1792, elements: !1127)
!1127 = !{!1128, !1129, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1126, file: !133, line: 3249, baseType: !1056, size: 1472)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1126, file: !133, line: 3251, baseType: !1130, size: 64, offset: 1472)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1132, line: 463, size: 1152, elements: !1133)
!1132 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1133 = !{!1134, !1293, !1324, !1325, !1328, !1331, !1332, !1333, !1334, !1335, !1336, !1360, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1131, file: !1132, line: 464, baseType: !1135, size: 64)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !328, line: 194, size: 384, elements: !1137)
!1137 = !{!1138, !1187, !1200, !1214, !1262, !1274}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !1136, file: !328, line: 197, baseType: !1139, size: 64)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !328, line: 182, baseType: !1140)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !328, line: 116, size: 704, elements: !1142)
!1142 = !{!1143, !1144, !1145, !1146, !1147, !1148, !1175, !1184, !1185, !1186}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !1141, file: !328, line: 119, baseType: !1140, size: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1141, file: !328, line: 122, baseType: !1140, size: 64, offset: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !1141, file: !328, line: 123, baseType: !1140, size: 64, offset: 128)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1141, file: !328, line: 126, baseType: !385, size: 32, offset: 192)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1141, file: !328, line: 129, baseType: !327, size: 32, offset: 224)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1141, file: !328, line: 165, baseType: !1149, size: 192, offset: 256)
!1149 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !328, line: 132, size: 192, elements: !1150)
!1150 = !{!1151, !1164, !1170}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !1149, file: !328, line: 137, baseType: !1152, size: 128)
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !328, line: 133, size: 128, elements: !1153)
!1153 = !{!1154, !1163}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !1152, file: !328, line: 135, baseType: !1155, size: 64)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !328, line: 93, size: 320, elements: !1157)
!1157 = !{!1158, !1159, !1160, !1161, !1162}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !1156, file: !328, line: 96, baseType: !1155, size: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !1156, file: !328, line: 97, baseType: !1155, size: 64, offset: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1156, file: !328, line: 101, baseType: !392, size: 64, offset: 128)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !1156, file: !328, line: 106, baseType: !392, size: 64, offset: 192)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1156, file: !328, line: 111, baseType: !392, size: 64, offset: 256)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !1152, file: !328, line: 136, baseType: !1155, size: 64, offset: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !1149, file: !328, line: 151, baseType: !1165, size: 192)
!1165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !328, line: 139, size: 192, elements: !1166)
!1166 = !{!1167, !1168, !1169}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1165, file: !328, line: 141, baseType: !392, size: 64)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1165, file: !328, line: 145, baseType: !392, size: 64, offset: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1165, file: !328, line: 150, baseType: !385, size: 32, offset: 128)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !1149, file: !328, line: 164, baseType: !1171, size: 128)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !328, line: 153, size: 128, elements: !1172)
!1172 = !{!1173, !1174}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !1171, file: !328, line: 161, baseType: !392, size: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !1171, file: !328, line: 163, baseType: !517, size: 32, offset: 64)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !1141, file: !328, line: 168, baseType: !1176, size: 64, offset: 448)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !328, line: 67, size: 320, elements: !1178)
!1178 = !{!1179, !1180, !1181, !1182, !1183}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !1177, file: !328, line: 70, baseType: !1176, size: 64)
