; ModuleID = 'c-typeck.bc'
source_filename = "c-typeck.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }
%struct.tree_decl_minimal = type { %struct.tree_common, i32, i32, %union.tree_node*, %union.tree_node* }
%struct.tree_common = type { %struct.tree_base, %union.tree_node*, %union.tree_node* }
%struct.tree_base = type { i64 }

!400 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_storage_class", file: !386, line: 180, baseType: !7, size: 32, elements: !401)
!401 = !{!402, !403, !404, !405, !406, !407}
!402 = !DIEnumerator(name: "csc_none", value: 0, isUnsigned: true)
!403 = !DIEnumerator(name: "csc_auto", value: 1, isUnsigned: true)
!404 = !DIEnumerator(name: "csc_extern", value: 2, isUnsigned: true)
!405 = !DIEnumerator(name: "csc_register", value: 3, isUnsigned: true)
!406 = !DIEnumerator(name: "csc_static", value: 4, isUnsigned: true)
!407 = !DIEnumerator(name: "csc_typedef", value: 5, isUnsigned: true)
!408 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_declarator_kind", file: !386, line: 285, baseType: !7, size: 32, elements: !409)
!409 = !{!410, !411, !412, !413, !414}
!410 = !DIEnumerator(name: "cdk_id", value: 0, isUnsigned: true)
!411 = !DIEnumerator(name: "cdk_function", value: 1, isUnsigned: true)
!412 = !DIEnumerator(name: "cdk_array", value: 2, isUnsigned: true)
!413 = !DIEnumerator(name: "cdk_pointer", value: 3, isUnsigned: true)
!414 = !DIEnumerator(name: "cdk_attrs", value: 4, isUnsigned: true)
!415 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mode_class", file: !416, line: 36, baseType: !7, size: 32, elements: !417)
!416 = !DIFile(filename: "./machmode.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!417 = !{!418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436}
!418 = !DIEnumerator(name: "MODE_RANDOM", value: 0, isUnsigned: true)
!419 = !DIEnumerator(name: "MODE_CC", value: 1, isUnsigned: true)
!420 = !DIEnumerator(name: "MODE_INT", value: 2, isUnsigned: true)
!421 = !DIEnumerator(name: "MODE_PARTIAL_INT", value: 3, isUnsigned: true)
!422 = !DIEnumerator(name: "MODE_FRACT", value: 4, isUnsigned: true)
!423 = !DIEnumerator(name: "MODE_UFRACT", value: 5, isUnsigned: true)
!424 = !DIEnumerator(name: "MODE_ACCUM", value: 6, isUnsigned: true)
!425 = !DIEnumerator(name: "MODE_UACCUM", value: 7, isUnsigned: true)
!426 = !DIEnumerator(name: "MODE_FLOAT", value: 8, isUnsigned: true)
!427 = !DIEnumerator(name: "MODE_DECIMAL_FLOAT", value: 9, isUnsigned: true)
!428 = !DIEnumerator(name: "MODE_COMPLEX_INT", value: 10, isUnsigned: true)
!429 = !DIEnumerator(name: "MODE_COMPLEX_FLOAT", value: 11, isUnsigned: true)
!430 = !DIEnumerator(name: "MODE_VECTOR_INT", value: 12, isUnsigned: true)
!431 = !DIEnumerator(name: "MODE_VECTOR_FRACT", value: 13, isUnsigned: true)
!432 = !DIEnumerator(name: "MODE_VECTOR_UFRACT", value: 14, isUnsigned: true)
!433 = !DIEnumerator(name: "MODE_VECTOR_ACCUM", value: 15, isUnsigned: true)
!434 = !DIEnumerator(name: "MODE_VECTOR_UACCUM", value: 16, isUnsigned: true)
!435 = !DIEnumerator(name: "MODE_VECTOR_FLOAT", value: 17, isUnsigned: true)
!436 = !DIEnumerator(name: "MAX_MODE_CLASS", value: 18, isUnsigned: true)
!437 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "lvalue_use", file: !378, line: 1034, baseType: !7, size: 32, elements: !438)
!438 = !{!439, !440, !441, !442, !443}
!439 = !DIEnumerator(name: "lv_assign", value: 0, isUnsigned: true)
!440 = !DIEnumerator(name: "lv_increment", value: 1, isUnsigned: true)
!441 = !DIEnumerator(name: "lv_decrement", value: 2, isUnsigned: true)
!442 = !DIEnumerator(name: "lv_addressof", value: 3, isUnsigned: true)
!443 = !DIEnumerator(name: "lv_asm", value: 4, isUnsigned: true)
!444 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "impl_conv", file: !3, line: 51, baseType: !7, size: 32, elements: !445)
!445 = !{!446, !447, !448, !449}
!446 = !DIEnumerator(name: "ic_argpass", value: 0, isUnsigned: true)
!447 = !DIEnumerator(name: "ic_assign", value: 1, isUnsigned: true)
!448 = !DIEnumerator(name: "ic_init", value: 2, isUnsigned: true)
!449 = !DIEnumerator(name: "ic_return", value: 3, isUnsigned: true)
!450 = !{!451, !452, !453, !454, !457, !458, !460, !134, !587, !415, !455, !1877, !1883, !514, !1950, !462, !1951, !1409, !1953, !1957, !1963, !1315, !1936, !1915, !1896, !516, !1655, !7}
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!453 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !456)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !461, line: 56, baseType: !462)
!461 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !135, line: 3371, size: 1792, elements: !464)
!464 = !{!465, !498, !504, !517, !536, !547, !552, !561, !567, !580, !592, !633, !1126, !1154, !1171, !1172, !1177, !1186, !1192, !1197, !1201, !1205, !1518, !1575, !1581, !1587, !1594, !1607, !1621, !1638, !1650, !1672, !1687, !1859}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !463, file: !135, line: 3372, baseType: !466, size: 64)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !135, line: 360, size: 64, elements: !467)
!467 = !{!468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !466, file: !135, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !466, file: !135, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !466, file: !135, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !466, file: !135, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !466, file: !135, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !466, file: !135, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !466, file: !135, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !466, file: !135, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !466, file: !135, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !466, file: !135, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !466, file: !135, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !466, file: !135, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !466, file: !135, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !466, file: !135, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !466, file: !135, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !466, file: !135, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !466, file: !135, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !466, file: !135, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !466, file: !135, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !466, file: !135, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !466, file: !135, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !466, file: !135, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !466, file: !135, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !466, file: !135, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !466, file: !135, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !466, file: !135, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !466, file: !135, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !466, file: !135, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !466, file: !135, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !466, file: !135, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !463, file: !135, line: 3373, baseType: !499, size: 192)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !135, line: 402, size: 192, elements: !500)
!500 = !{!501, !502, !503}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !499, file: !135, line: 403, baseType: !466, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !499, file: !135, line: 404, baseType: !460, size: 64, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !499, file: !135, line: 405, baseType: !460, size: 64, offset: 128)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !463, file: !135, line: 3374, baseType: !505, size: 320)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !135, line: 1384, size: 320, elements: !506)
!506 = !{!507, !508}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !505, file: !135, line: 1385, baseType: !499, size: 192)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !505, file: !135, line: 1386, baseType: !509, size: 128, offset: 192)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !510, line: 58, baseType: !511)
!510 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !510, line: 54, size: 128, elements: !512)
!512 = !{!513, !515}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !511, file: !510, line: 56, baseType: !514, size: 64)
!514 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !511, file: !510, line: 57, baseType: !516, size: 64, offset: 64)
!516 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !463, file: !135, line: 3375, baseType: !518, size: 256)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !135, line: 1397, size: 256, elements: !519)
!519 = !{!520, !521}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !518, file: !135, line: 1398, baseType: !499, size: 192)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !518, file: !135, line: 1399, baseType: !522, size: 64, offset: 192)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !524, line: 52, size: 256, elements: !525)
!524 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!525 = !{!526, !527, !528, !529, !530, !531, !532}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !523, file: !524, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !523, file: !524, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !523, file: !524, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !523, file: !524, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !523, file: !524, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !523, file: !524, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !523, file: !524, line: 62, baseType: !533, size: 192, offset: 64)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, size: 192, elements: !534)
!534 = !{!535}
!535 = !DISubrange(count: 3)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !463, file: !135, line: 3376, baseType: !537, size: 256)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !135, line: 1408, size: 256, elements: !538)
!538 = !{!539, !540}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !537, file: !135, line: 1409, baseType: !499, size: 192)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !537, file: !135, line: 1410, baseType: !541, size: 64, offset: 192)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !543, line: 27, size: 192, elements: !544)
!543 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!544 = !{!545, !546}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !542, file: !543, line: 29, baseType: !509, size: 128)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !542, file: !543, line: 30, baseType: !5, size: 32, offset: 128)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !463, file: !135, line: 3377, baseType: !548, size: 256)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !135, line: 1437, size: 256, elements: !549)
!549 = !{!550, !551}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !548, file: !135, line: 1438, baseType: !499, size: 192)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !548, file: !135, line: 1439, baseType: !460, size: 64, offset: 192)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !463, file: !135, line: 3378, baseType: !553, size: 256)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !135, line: 1418, size: 256, elements: !554)
!554 = !{!555, !556, !557}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !553, file: !135, line: 1419, baseType: !499, size: 192)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !553, file: !135, line: 1420, baseType: !453, size: 32, offset: 192)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !553, file: !135, line: 1421, baseType: !558, size: 8, offset: 224)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !456, size: 8, elements: !559)
!559 = !{!560}
!560 = !DISubrange(count: 1)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !463, file: !135, line: 3379, baseType: !562, size: 320)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !135, line: 1428, size: 320, elements: !563)
!563 = !{!564, !565, !566}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !562, file: !135, line: 1429, baseType: !499, size: 192)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !562, file: !135, line: 1430, baseType: !460, size: 64, offset: 192)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !562, file: !135, line: 1431, baseType: !460, size: 64, offset: 256)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !463, file: !135, line: 3380, baseType: !568, size: 320)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !135, line: 1460, size: 320, elements: !569)
!569 = !{!570, !571}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !568, file: !135, line: 1461, baseType: !499, size: 192)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !568, file: !135, line: 1462, baseType: !572, size: 128, offset: 192)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !573, line: 31, size: 128, elements: !574)
!573 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!574 = !{!575, !578, !579}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !572, file: !573, line: 32, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !452)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !572, file: !573, line: 33, baseType: !7, size: 32, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !572, file: !573, line: 34, baseType: !7, size: 32, offset: 96)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !463, file: !135, line: 3381, baseType: !581, size: 384)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !135, line: 2507, size: 384, elements: !582)
!582 = !{!583, !584, !589, !590, !591}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !581, file: !135, line: 2508, baseType: !499, size: 192)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !581, file: !135, line: 2509, baseType: !585, size: 32, offset: 192)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !586, line: 58, baseType: !587)
!586 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !588, line: 44, baseType: !7)
!588 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!589 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !581, file: !135, line: 2510, baseType: !7, size: 32, offset: 224)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !581, file: !135, line: 2511, baseType: !460, size: 64, offset: 256)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !581, file: !135, line: 2512, baseType: !460, size: 64, offset: 320)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !463, file: !135, line: 3382, baseType: !593, size: 896)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !135, line: 2652, size: 896, elements: !594)
!594 = !{!595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !593, file: !135, line: 2653, baseType: !581, size: 384)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !593, file: !135, line: 2654, baseType: !460, size: 64, offset: 384)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !593, file: !135, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !593, file: !135, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !593, file: !135, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !593, file: !135, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !593, file: !135, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !593, file: !135, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !593, file: !135, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !593, file: !135, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !593, file: !135, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !593, file: !135, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !593, file: !135, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !593, file: !135, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !593, file: !135, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !593, file: !135, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !593, file: !135, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !593, file: !135, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !593, file: !135, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !593, file: !135, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !593, file: !135, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !593, file: !135, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !593, file: !135, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !593, file: !135, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !593, file: !135, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !593, file: !135, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !593, file: !135, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !593, file: !135, line: 2703, baseType: !7, size: 32, offset: 512)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !593, file: !135, line: 2705, baseType: !460, size: 64, offset: 576)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !593, file: !135, line: 2706, baseType: !460, size: 64, offset: 640)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !593, file: !135, line: 2707, baseType: !460, size: 64, offset: 704)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !593, file: !135, line: 2708, baseType: !460, size: 64, offset: 768)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !593, file: !135, line: 2711, baseType: !628, size: 64, offset: 832)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !630, line: 39, size: 8, elements: !631)
!630 = !DIFile(filename: "./c-lang.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!631 = !{!632}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !629, file: !630, line: 40, baseType: !456, size: 8)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !463, file: !135, line: 3383, baseType: !634, size: 960)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !135, line: 2756, size: 960, elements: !635)
!635 = !{!636, !637}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !634, file: !135, line: 2757, baseType: !593, size: 896)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !634, file: !135, line: 2758, baseType: !638, size: 64, offset: 896)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !461, line: 50, baseType: !639)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !641, line: 240, size: 384, elements: !642)
!641 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!642 = !{!643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !640, file: !641, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !640, file: !641, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !640, file: !641, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !640, file: !641, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !640, file: !641, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !640, file: !641, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !640, file: !641, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !640, file: !641, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !640, file: !641, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !640, file: !641, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !640, file: !641, line: 321, baseType: !654, size: 320, offset: 64)
!654 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !641, line: 315, size: 320, elements: !655)
!655 = !{!656, !1059, !1061, !1124, !1125}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !654, file: !641, line: 316, baseType: !657, size: 64)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !658, size: 64, elements: !559)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !641, line: 183, baseType: !659)
!659 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !641, line: 166, size: 64, elements: !660)
!660 = !{!661, !662, !663, !664, !665, !673, !674, !686, !689, !749, !750, !1036, !1049, !1056}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !659, file: !641, line: 168, baseType: !453, size: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !659, file: !641, line: 169, baseType: !7, size: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !659, file: !641, line: 170, baseType: !458, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !659, file: !641, line: 171, baseType: !638, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !659, file: !641, line: 172, baseType: !666, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !461, line: 53, baseType: !667)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !641, line: 359, size: 128, elements: !669)
!669 = !{!670, !671}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !668, file: !641, line: 360, baseType: !453, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !668, file: !641, line: 361, baseType: !672, size: 64, offset: 64)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !638, size: 64, elements: !559)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !659, file: !641, line: 173, baseType: !5, size: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !659, file: !641, line: 174, baseType: !675, size: 32)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !641, line: 133, baseType: !676)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !641, line: 115, size: 32, elements: !677)
!677 = !{!678, !679, !680, !681, !682, !683, !684, !685}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !676, file: !641, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !676, file: !641, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !676, file: !641, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !676, file: !641, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !676, file: !641, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !676, file: !641, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !676, file: !641, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !676, file: !641, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !659, file: !641, line: 175, baseType: !687, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !641, line: 175, flags: DIFlagFwdDecl)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !659, file: !641, line: 176, baseType: !690, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !692, line: 75, size: 256, elements: !693)
!692 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!693 = !{!694, !708, !709, !710}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !691, file: !692, line: 76, baseType: !695, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !692, line: 68, baseType: !697)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !692, line: 63, size: 320, elements: !698)
!698 = !{!699, !701, !702, !703}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !697, file: !692, line: 64, baseType: !700, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !697, file: !692, line: 65, baseType: !700, size: 64, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !697, file: !692, line: 66, baseType: !7, size: 32, offset: 128)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !697, file: !692, line: 67, baseType: !704, size: 128, offset: 192)
!704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !705, size: 128, elements: !706)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !692, line: 29, baseType: !514)
!706 = !{!707}
!707 = !DISubrange(count: 2)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !691, file: !692, line: 77, baseType: !695, size: 64, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !691, file: !692, line: 78, baseType: !7, size: 32, offset: 128)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !691, file: !692, line: 79, baseType: !711, size: 64, offset: 192)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !692, line: 49, baseType: !713)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !692, line: 45, size: 832, elements: !714)
!714 = !{!715, !716, !717}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !713, file: !692, line: 46, baseType: !700, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !713, file: !692, line: 47, baseType: !690, size: 64, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !713, file: !692, line: 48, baseType: !718, size: 704, offset: 128)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !719, line: 164, size: 704, elements: !720)
!719 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!720 = !{!721, !722, !732, !733, !734, !735, !736, !737, !741, !745, !746, !747, !748}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !718, file: !719, line: 166, baseType: !516, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !718, file: !719, line: 167, baseType: !723, size: 64, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !719, line: 157, size: 192, elements: !725)
!725 = !{!726, !727, !728}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !724, file: !719, line: 159, baseType: !455, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !724, file: !719, line: 160, baseType: !723, size: 64, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !724, file: !719, line: 161, baseType: !729, size: 32, offset: 128)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !456, size: 32, elements: !730)
!730 = !{!731}
!731 = !DISubrange(count: 4)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !718, file: !719, line: 168, baseType: !455, size: 64, offset: 128)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !718, file: !719, line: 169, baseType: !455, size: 64, offset: 192)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !718, file: !719, line: 170, baseType: !455, size: 64, offset: 256)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !718, file: !719, line: 171, baseType: !516, size: 64, offset: 320)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !718, file: !719, line: 172, baseType: !453, size: 32, offset: 384)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !718, file: !719, line: 176, baseType: !738, size: 64, offset: 448)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{!723, !457, !516}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !718, file: !719, line: 177, baseType: !742, size: 64, offset: 512)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DISubroutineType(types: !744)
!744 = !{null, !457, !723}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !718, file: !719, line: 178, baseType: !457, size: 64, offset: 576)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !718, file: !719, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !718, file: !719, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !718, file: !719, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !659, file: !641, line: 177, baseType: !460, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !659, file: !641, line: 178, baseType: !751, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !330, line: 217, size: 832, elements: !753)
!753 = !{!754, !1001, !1002, !1003, !1006, !1010, !1011, !1012, !1030, !1031, !1032, !1033, !1034, !1035}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !752, file: !330, line: 219, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !330, line: 151, baseType: !757)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !330, line: 151, size: 128, elements: !758)
!758 = !{!759}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !757, file: !330, line: 151, baseType: !760, size: 128)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !330, line: 150, baseType: !761)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !330, line: 150, size: 128, elements: !762)
!762 = !{!763, !764, !765}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !761, file: !330, line: 150, baseType: !7, size: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !761, file: !330, line: 150, baseType: !7, size: 32, offset: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !761, file: !330, line: 150, baseType: !766, size: 64, offset: 64)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !767, size: 64, elements: !559)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !461, line: 108, baseType: !768)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !330, line: 122, size: 512, elements: !770)
!770 = !{!771, !772, !773, !993, !994, !995, !996, !997, !998, !999}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !769, file: !330, line: 124, baseType: !751, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !769, file: !330, line: 125, baseType: !751, size: 64, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !769, file: !330, line: 131, baseType: !774, size: 64, offset: 128)
!774 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !330, line: 128, size: 64, elements: !775)
!775 = !{!776, !992}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !774, file: !330, line: 129, baseType: !777, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !461, line: 66, baseType: !778)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !780, line: 143, size: 192, elements: !781)
!780 = !DIFile(filename: "./gimple.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!781 = !{!782, !990, !991}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !779, file: !780, line: 145, baseType: !783, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !461, line: 69, baseType: !784)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !780, line: 136, size: 192, elements: !786)
!786 = !{!787, !988, !989}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !785, file: !780, line: 137, baseType: !788, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !461, line: 58, baseType: !789)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !780, line: 737, size: 768, elements: !791)
!791 = !{!792, !809, !843, !849, !854, !859, !866, !872, !878, !883, !897, !902, !908, !913, !923, !928, !946, !953, !960, !966, !971, !977, !983}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !790, file: !780, line: 738, baseType: !793, size: 256)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !780, line: 271, size: 256, elements: !794)
!794 = !{!795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !793, file: !780, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !793, file: !780, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !793, file: !780, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !793, file: !780, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !793, file: !780, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !793, file: !780, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !793, file: !780, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !793, file: !780, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !793, file: !780, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !793, file: !780, line: 312, baseType: !7, size: 32, offset: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !793, file: !780, line: 316, baseType: !585, size: 32, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !793, file: !780, line: 319, baseType: !7, size: 32, offset: 96)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !793, file: !780, line: 323, baseType: !751, size: 64, offset: 128)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !793, file: !780, line: 327, baseType: !460, size: 64, offset: 192)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !790, file: !780, line: 739, baseType: !810, size: 448)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !780, line: 350, size: 448, elements: !811)
!811 = !{!812, !841}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !810, file: !780, line: 353, baseType: !813, size: 384)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !780, line: 333, size: 384, elements: !814)
!814 = !{!815, !816, !824}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !813, file: !780, line: 336, baseType: !793, size: 256)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !813, file: !780, line: 343, baseType: !817, size: 64, offset: 256)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !819, line: 37, size: 128, elements: !820)
!819 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!820 = !{!821, !822}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !818, file: !819, line: 39, baseType: !817, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !818, file: !819, line: 40, baseType: !823, size: 64, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !813, file: !780, line: 344, baseType: !825, size: 64, offset: 320)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !819, line: 45, size: 320, elements: !827)
!827 = !{!828, !829}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !826, file: !819, line: 47, baseType: !825, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !826, file: !819, line: 48, baseType: !830, size: 256, offset: 64)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !135, line: 1883, size: 256, elements: !831)
!831 = !{!832, !834, !835, !840}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !830, file: !135, line: 1884, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !830, file: !135, line: 1885, baseType: !833, size: 64, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !830, file: !135, line: 1891, baseType: !836, size: 64, offset: 128)
!836 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !830, file: !135, line: 1891, size: 64, elements: !837)
!837 = !{!838, !839}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !836, file: !135, line: 1891, baseType: !788, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !836, file: !135, line: 1891, baseType: !460, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !830, file: !135, line: 1892, baseType: !823, size: 64, offset: 192)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !810, file: !780, line: 359, baseType: !842, size: 64, offset: 384)
!842 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 64, elements: !559)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !790, file: !780, line: 740, baseType: !844, size: 512)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !780, line: 365, size: 512, elements: !845)
!845 = !{!846, !847, !848}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !844, file: !780, line: 368, baseType: !813, size: 384)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !844, file: !780, line: 373, baseType: !460, size: 64, offset: 384)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !844, file: !780, line: 374, baseType: !460, size: 64, offset: 448)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !790, file: !780, line: 741, baseType: !850, size: 576)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !780, line: 380, size: 576, elements: !851)
!851 = !{!852, !853}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !850, file: !780, line: 383, baseType: !844, size: 512)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !850, file: !780, line: 389, baseType: !842, size: 64, offset: 512)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !790, file: !780, line: 742, baseType: !855, size: 320)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !780, line: 395, size: 320, elements: !856)
!856 = !{!857, !858}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !855, file: !780, line: 397, baseType: !793, size: 256)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !855, file: !780, line: 400, baseType: !777, size: 64, offset: 256)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !790, file: !780, line: 743, baseType: !860, size: 448)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !780, line: 406, size: 448, elements: !861)
!861 = !{!862, !863, !864, !865}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !860, file: !780, line: 408, baseType: !793, size: 256)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !860, file: !780, line: 412, baseType: !460, size: 64, offset: 256)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !860, file: !780, line: 420, baseType: !460, size: 64, offset: 320)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !860, file: !780, line: 423, baseType: !777, size: 64, offset: 384)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !790, file: !780, line: 744, baseType: !867, size: 384)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !780, line: 429, size: 384, elements: !868)
!868 = !{!869, !870, !871}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !867, file: !780, line: 431, baseType: !793, size: 256)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !867, file: !780, line: 434, baseType: !460, size: 64, offset: 256)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !867, file: !780, line: 437, baseType: !777, size: 64, offset: 320)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !790, file: !780, line: 745, baseType: !873, size: 384)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !780, line: 443, size: 384, elements: !874)
!874 = !{!875, !876, !877}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !873, file: !780, line: 445, baseType: !793, size: 256)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !873, file: !780, line: 449, baseType: !460, size: 64, offset: 256)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !873, file: !780, line: 453, baseType: !777, size: 64, offset: 320)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !790, file: !780, line: 746, baseType: !879, size: 320)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !780, line: 459, size: 320, elements: !880)
!880 = !{!881, !882}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !879, file: !780, line: 461, baseType: !793, size: 256)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !879, file: !780, line: 464, baseType: !460, size: 64, offset: 256)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !790, file: !780, line: 747, baseType: !884, size: 768)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !780, line: 469, size: 768, elements: !885)
!885 = !{!886, !887, !888, !889, !890}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !884, file: !780, line: 471, baseType: !793, size: 256)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !884, file: !780, line: 474, baseType: !7, size: 32, offset: 256)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !884, file: !780, line: 475, baseType: !7, size: 32, offset: 288)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !884, file: !780, line: 478, baseType: !460, size: 64, offset: 320)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !884, file: !780, line: 481, baseType: !891, size: 384, offset: 384)
!891 = !DICompositeType(tag: DW_TAG_array_type, baseType: !892, size: 384, elements: !559)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !135, line: 1917, size: 384, elements: !893)
!893 = !{!894, !895, !896}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !892, file: !135, line: 1920, baseType: !830, size: 256)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !892, file: !135, line: 1921, baseType: !460, size: 64, offset: 256)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !892, file: !135, line: 1922, baseType: !585, size: 32, offset: 320)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !790, file: !780, line: 748, baseType: !898, size: 320)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !780, line: 487, size: 320, elements: !899)
!899 = !{!900, !901}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !898, file: !780, line: 490, baseType: !793, size: 256)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !898, file: !780, line: 494, baseType: !453, size: 32, offset: 256)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !790, file: !780, line: 749, baseType: !903, size: 384)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !780, line: 500, size: 384, elements: !904)
!904 = !{!905, !906, !907}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !903, file: !780, line: 502, baseType: !793, size: 256)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !903, file: !780, line: 506, baseType: !777, size: 64, offset: 256)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !903, file: !780, line: 510, baseType: !777, size: 64, offset: 320)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !790, file: !780, line: 750, baseType: !909, size: 320)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !780, line: 529, size: 320, elements: !910)
!910 = !{!911, !912}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !909, file: !780, line: 531, baseType: !793, size: 256)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !909, file: !780, line: 540, baseType: !777, size: 64, offset: 256)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !790, file: !780, line: 751, baseType: !914, size: 704)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !780, line: 546, size: 704, elements: !915)
!915 = !{!916, !917, !918, !919, !920, !921, !922}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !914, file: !780, line: 549, baseType: !844, size: 512)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !914, file: !780, line: 553, baseType: !458, size: 64, offset: 512)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !914, file: !780, line: 557, baseType: !452, size: 8, offset: 576)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !914, file: !780, line: 558, baseType: !452, size: 8, offset: 584)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !914, file: !780, line: 559, baseType: !452, size: 8, offset: 592)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !914, file: !780, line: 560, baseType: !452, size: 8, offset: 600)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !914, file: !780, line: 566, baseType: !842, size: 64, offset: 640)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !790, file: !780, line: 752, baseType: !924, size: 384)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !780, line: 571, size: 384, elements: !925)
!925 = !{!926, !927}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !924, file: !780, line: 573, baseType: !855, size: 320)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !924, file: !780, line: 577, baseType: !460, size: 64, offset: 320)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !790, file: !780, line: 753, baseType: !929, size: 576)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !780, line: 600, size: 576, elements: !930)
!930 = !{!931, !932, !933, !936, !945}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !929, file: !780, line: 602, baseType: !855, size: 320)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !929, file: !780, line: 605, baseType: !460, size: 64, offset: 320)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !929, file: !780, line: 609, baseType: !934, size: 64, offset: 384)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !935, line: 46, baseType: !514)
!935 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!936 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !929, file: !780, line: 612, baseType: !937, size: 64, offset: 448)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !780, line: 581, size: 320, elements: !939)
!939 = !{!940, !941, !942, !943, !944}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !938, file: !780, line: 583, baseType: !134, size: 32)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !938, file: !780, line: 586, baseType: !460, size: 64, offset: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !938, file: !780, line: 589, baseType: !460, size: 64, offset: 128)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !938, file: !780, line: 592, baseType: !460, size: 64, offset: 192)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !938, file: !780, line: 595, baseType: !460, size: 64, offset: 256)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !929, file: !780, line: 616, baseType: !777, size: 64, offset: 512)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !790, file: !780, line: 754, baseType: !947, size: 512)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !780, line: 622, size: 512, elements: !948)
!948 = !{!949, !950, !951, !952}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !947, file: !780, line: 624, baseType: !855, size: 320)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !947, file: !780, line: 628, baseType: !460, size: 64, offset: 320)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !947, file: !780, line: 632, baseType: !460, size: 64, offset: 384)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !947, file: !780, line: 636, baseType: !460, size: 64, offset: 448)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !790, file: !780, line: 755, baseType: !954, size: 704)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !780, line: 642, size: 704, elements: !955)
!955 = !{!956, !957, !958, !959}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !954, file: !780, line: 644, baseType: !947, size: 512)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !954, file: !780, line: 648, baseType: !460, size: 64, offset: 512)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !954, file: !780, line: 652, baseType: !460, size: 64, offset: 576)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !954, file: !780, line: 653, baseType: !460, size: 64, offset: 640)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !790, file: !780, line: 756, baseType: !961, size: 448)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !780, line: 663, size: 448, elements: !962)
!962 = !{!963, !964, !965}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !961, file: !780, line: 665, baseType: !855, size: 320)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !961, file: !780, line: 668, baseType: !460, size: 64, offset: 320)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !961, file: !780, line: 673, baseType: !460, size: 64, offset: 384)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !790, file: !780, line: 757, baseType: !967, size: 384)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !780, line: 694, size: 384, elements: !968)
!968 = !{!969, !970}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !967, file: !780, line: 696, baseType: !855, size: 320)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !967, file: !780, line: 699, baseType: !460, size: 64, offset: 320)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !790, file: !780, line: 758, baseType: !972, size: 384)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !780, line: 681, size: 384, elements: !973)
!973 = !{!974, !975, !976}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !972, file: !780, line: 683, baseType: !793, size: 256)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !972, file: !780, line: 686, baseType: !460, size: 64, offset: 256)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !972, file: !780, line: 689, baseType: !460, size: 64, offset: 320)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !790, file: !780, line: 759, baseType: !978, size: 384)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !780, line: 707, size: 384, elements: !979)
!979 = !{!980, !981, !982}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !978, file: !780, line: 709, baseType: !793, size: 256)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !978, file: !780, line: 712, baseType: !460, size: 64, offset: 256)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !978, file: !780, line: 712, baseType: !460, size: 64, offset: 320)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !790, file: !780, line: 760, baseType: !984, size: 320)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !780, line: 718, size: 320, elements: !985)
!985 = !{!986, !987}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !984, file: !780, line: 720, baseType: !793, size: 256)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !984, file: !780, line: 723, baseType: !460, size: 64, offset: 256)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !785, file: !780, line: 138, baseType: !784, size: 64, offset: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !785, file: !780, line: 139, baseType: !784, size: 64, offset: 128)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !779, file: !780, line: 146, baseType: !783, size: 64, offset: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !779, file: !780, line: 152, baseType: !777, size: 64, offset: 128)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !774, file: !330, line: 130, baseType: !638, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !769, file: !330, line: 134, baseType: !457, size: 64, offset: 192)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !769, file: !330, line: 137, baseType: !460, size: 64, offset: 256)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !769, file: !330, line: 138, baseType: !585, size: 32, offset: 320)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !769, file: !330, line: 142, baseType: !7, size: 32, offset: 352)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !769, file: !330, line: 144, baseType: !453, size: 32, offset: 384)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !769, file: !330, line: 145, baseType: !453, size: 32, offset: 416)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !769, file: !330, line: 146, baseType: !1000, size: 64, offset: 448)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !330, line: 119, baseType: !516)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !752, file: !330, line: 220, baseType: !755, size: 64, offset: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !752, file: !330, line: 223, baseType: !457, size: 64, offset: 128)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !752, file: !330, line: 226, baseType: !1004, size: 64, offset: 192)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !330, line: 185, flags: DIFlagFwdDecl)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !752, file: !330, line: 229, baseType: !1007, size: 128, offset: 256)
!1007 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1008, size: 128, elements: !706)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !330, line: 229, flags: DIFlagFwdDecl)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !752, file: !330, line: 232, baseType: !751, size: 64, offset: 384)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !752, file: !330, line: 233, baseType: !751, size: 64, offset: 448)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !752, file: !330, line: 238, baseType: !1013, size: 64, offset: 512)
!1013 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !330, line: 235, size: 64, elements: !1014)
!1014 = !{!1015, !1021}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1013, file: !330, line: 236, baseType: !1016, size: 64)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !330, line: 273, size: 128, elements: !1018)
!1018 = !{!1019, !1020}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1017, file: !330, line: 275, baseType: !777, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1017, file: !330, line: 278, baseType: !777, size: 64, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1013, file: !330, line: 237, baseType: !1022, size: 64)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !330, line: 259, size: 320, elements: !1024)
!1024 = !{!1025, !1026, !1027, !1028, !1029}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1023, file: !330, line: 261, baseType: !638, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1023, file: !330, line: 262, baseType: !638, size: 64, offset: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1023, file: !330, line: 266, baseType: !638, size: 64, offset: 128)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1023, file: !330, line: 267, baseType: !638, size: 64, offset: 192)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1023, file: !330, line: 270, baseType: !453, size: 32, offset: 256)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !752, file: !330, line: 241, baseType: !1000, size: 64, offset: 576)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !752, file: !330, line: 244, baseType: !453, size: 32, offset: 640)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !752, file: !330, line: 247, baseType: !453, size: 32, offset: 672)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !752, file: !330, line: 250, baseType: !453, size: 32, offset: 704)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !752, file: !330, line: 253, baseType: !453, size: 32, offset: 736)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !752, file: !330, line: 256, baseType: !453, size: 32, offset: 768)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !659, file: !641, line: 179, baseType: !1037, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !641, line: 150, baseType: !1039)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !641, line: 142, size: 320, elements: !1040)
!1040 = !{!1041, !1042, !1043, !1044, !1047, !1048}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1039, file: !641, line: 144, baseType: !460, size: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1039, file: !641, line: 145, baseType: !638, size: 64, offset: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1039, file: !641, line: 146, baseType: !638, size: 64, offset: 128)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1039, file: !641, line: 147, baseType: !1045, size: 32, offset: 192)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1046, line: 31, baseType: !453)
!1046 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1039, file: !641, line: 148, baseType: !7, size: 32, offset: 224)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1039, file: !641, line: 149, baseType: !452, size: 8, offset: 256)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !659, file: !641, line: 180, baseType: !1050, size: 64)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !641, line: 162, baseType: !1052)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !641, line: 159, size: 128, elements: !1053)
!1053 = !{!1054, !1055}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1052, file: !641, line: 160, baseType: !460, size: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1052, file: !641, line: 161, baseType: !516, size: 64, offset: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !659, file: !641, line: 181, baseType: !1057, size: 64)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1058 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !641, line: 181, flags: DIFlagFwdDecl)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !654, file: !641, line: 317, baseType: !1060, size: 64)
!1060 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 64, elements: !559)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !654, file: !641, line: 318, baseType: !1062, size: 320)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !641, line: 188, size: 320, elements: !1063)
!1063 = !{!1064, !1066, !1123}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1062, file: !641, line: 190, baseType: !1065, size: 192)
!1065 = !DICompositeType(tag: DW_TAG_array_type, baseType: !658, size: 192, elements: !534)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1062, file: !641, line: 193, baseType: !1067, size: 64, offset: 192)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !641, line: 206, size: 320, elements: !1069)
!1069 = !{!1070, !1108, !1109, !1110, !1122}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1068, file: !641, line: 208, baseType: !1071, size: 64)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !461, line: 62, baseType: !1073)
!1073 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1074, line: 538, size: 256, elements: !1075)
!1074 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1075 = !{!1076, !1080, !1086, !1099}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1073, file: !1074, line: 539, baseType: !1077, size: 32)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1074, line: 482, size: 32, elements: !1078)
!1078 = !{!1079}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1077, file: !1074, line: 484, baseType: !7, size: 32)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1073, file: !1074, line: 540, baseType: !1081, size: 192)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1074, line: 488, size: 192, elements: !1082)
!1082 = !{!1083, !1084, !1085}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1081, file: !1074, line: 489, baseType: !1077, size: 32)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1081, file: !1074, line: 492, baseType: !458, size: 64, offset: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1081, file: !1074, line: 496, baseType: !460, size: 64, offset: 128)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1073, file: !1074, line: 541, baseType: !1087, size: 256)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1074, line: 504, size: 256, elements: !1088)
!1088 = !{!1089, !1090, !1097, !1098}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1087, file: !1074, line: 505, baseType: !1077, size: 32)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1087, file: !1074, line: 509, baseType: !1091, size: 64, offset: 64)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1074, line: 501, baseType: !1092)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{null, !1095}
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1096 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1087, file: !1074, line: 510, baseType: !1095, size: 64, offset: 128)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1087, file: !1074, line: 513, baseType: !1071, size: 64, offset: 192)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1073, file: !1074, line: 542, baseType: !1100, size: 128)
!1100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1074, line: 530, size: 128, elements: !1101)
!1101 = !{!1102, !1103}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1100, file: !1074, line: 531, baseType: !1077, size: 32)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1100, file: !1074, line: 534, baseType: !1104, size: 64, offset: 64)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1074, line: 525, baseType: !1105)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64)
!1106 = !DISubroutineType(types: !1107)
!1107 = !{!452, !460, !458, !514, !514}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1068, file: !641, line: 211, baseType: !7, size: 32, offset: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1068, file: !641, line: 214, baseType: !516, size: 64, offset: 128)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1068, file: !641, line: 224, baseType: !1111, size: 64, offset: 192)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !641, line: 202, baseType: !1113)
!1113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !641, line: 202, size: 128, elements: !1114)
!1114 = !{!1115}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1113, file: !641, line: 202, baseType: !1116, size: 128)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !641, line: 200, baseType: !1117)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !641, line: 200, size: 128, elements: !1118)
!1118 = !{!1119, !1120, !1121}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1117, file: !641, line: 200, baseType: !7, size: 32)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1117, file: !641, line: 200, baseType: !7, size: 32, offset: 32)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1117, file: !641, line: 200, baseType: !672, size: 64, offset: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1068, file: !641, line: 234, baseType: !1111, size: 64, offset: 256)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1062, file: !641, line: 197, baseType: !516, size: 64, offset: 256)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !654, file: !641, line: 319, baseType: !523, size: 256)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !654, file: !641, line: 320, baseType: !542, size: 192)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !463, file: !135, line: 3384, baseType: !1127, size: 1472)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !135, line: 3114, size: 1472, elements: !1128)
!1128 = !{!1129, !1150, !1151, !1152, !1153}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1127, file: !135, line: 3115, baseType: !1130, size: 1216)
!1130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !135, line: 2984, size: 1216, elements: !1131)
!1131 = !{!1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1130, file: !135, line: 2985, baseType: !634, size: 960)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1130, file: !135, line: 2986, baseType: !460, size: 64, offset: 960)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1130, file: !135, line: 2987, baseType: !460, size: 64, offset: 1024)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1130, file: !135, line: 2988, baseType: !460, size: 64, offset: 1088)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1130, file: !135, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1130, file: !135, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1130, file: !135, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1130, file: !135, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1130, file: !135, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1130, file: !135, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1130, file: !135, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1130, file: !135, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1130, file: !135, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1130, file: !135, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1130, file: !135, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1130, file: !135, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1130, file: !135, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1130, file: !135, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1127, file: !135, line: 3117, baseType: !460, size: 64, offset: 1216)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1127, file: !135, line: 3119, baseType: !460, size: 64, offset: 1280)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1127, file: !135, line: 3121, baseType: !460, size: 64, offset: 1344)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1127, file: !135, line: 3123, baseType: !460, size: 64, offset: 1408)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !463, file: !135, line: 3385, baseType: !1155, size: 1088)
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !135, line: 2874, size: 1088, elements: !1156)
!1156 = !{!1157, !1158, !1159}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1155, file: !135, line: 2875, baseType: !634, size: 960)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1155, file: !135, line: 2876, baseType: !638, size: 64, offset: 960)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1155, file: !135, line: 2877, baseType: !1160, size: 64, offset: 1024)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1162, line: 172, size: 128, elements: !1163)
!1162 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1163 = !{!1164, !1165, !1166, !1167, !1168, !1169, !1170}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1161, file: !1162, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1161, file: !1162, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1161, file: !1162, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1161, file: !1162, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1161, file: !1162, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1161, file: !1162, line: 195, baseType: !7, size: 32, offset: 32)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1161, file: !1162, line: 199, baseType: !460, size: 64, offset: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !463, file: !135, line: 3386, baseType: !1130, size: 1216)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !463, file: !135, line: 3387, baseType: !1173, size: 1280)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !135, line: 3093, size: 1280, elements: !1174)
!1174 = !{!1175, !1176}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1173, file: !135, line: 3094, baseType: !1130, size: 1216)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1173, file: !135, line: 3095, baseType: !1160, size: 64, offset: 1216)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !463, file: !135, line: 3388, baseType: !1178, size: 1216)
!1178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !135, line: 2824, size: 1216, elements: !1179)
!1179 = !{!1180, !1181, !1182, !1183, !1184, !1185}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1178, file: !135, line: 2825, baseType: !593, size: 896)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1178, file: !135, line: 2827, baseType: !460, size: 64, offset: 896)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1178, file: !135, line: 2828, baseType: !460, size: 64, offset: 960)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1178, file: !135, line: 2829, baseType: !460, size: 64, offset: 1024)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1178, file: !135, line: 2830, baseType: !460, size: 64, offset: 1088)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1178, file: !135, line: 2831, baseType: !460, size: 64, offset: 1152)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !463, file: !135, line: 3389, baseType: !1187, size: 1024)
!1187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !135, line: 2850, size: 1024, elements: !1188)
!1188 = !{!1189, !1190, !1191}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1187, file: !135, line: 2851, baseType: !634, size: 960)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1187, file: !135, line: 2852, baseType: !453, size: 32, offset: 960)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1187, file: !135, line: 2853, baseType: !453, size: 32, offset: 992)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !463, file: !135, line: 3390, baseType: !1193, size: 1024)
!1193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !135, line: 2857, size: 1024, elements: !1194)
!1194 = !{!1195, !1196}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1193, file: !135, line: 2858, baseType: !634, size: 960)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1193, file: !135, line: 2859, baseType: !1160, size: 64, offset: 960)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !463, file: !135, line: 3391, baseType: !1198, size: 960)
!1198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !135, line: 2862, size: 960, elements: !1199)
!1199 = !{!1200}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1198, file: !135, line: 2863, baseType: !634, size: 960)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !463, file: !135, line: 3392, baseType: !1202, size: 1472)
!1202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !135, line: 3304, size: 1472, elements: !1203)
!1203 = !{!1204}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1202, file: !135, line: 3305, baseType: !1127, size: 1472)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !463, file: !135, line: 3393, baseType: !1206, size: 1792)
!1206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !135, line: 3248, size: 1792, elements: !1207)
!1207 = !{!1208, !1209, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517}
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1206, file: !135, line: 3249, baseType: !1127, size: 1472)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1206, file: !135, line: 3251, baseType: !1210, size: 64, offset: 1472)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64)
!1211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1212, line: 463, size: 1152, elements: !1213)
!1212 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1213 = !{!1214, !1217, !1248, !1249, !1362, !1365, !1366, !1367, !1368, !1369, !1370, !1394, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1211, file: !1212, line: 464, baseType: !1215, size: 64)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64)
!1216 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1212, line: 464, flags: DIFlagFwdDecl)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1211, file: !1212, line: 467, baseType: !1218, size: 64, offset: 64)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64)
!1219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !330, line: 374, size: 640, elements: !1220)
!1220 = !{!1221, !1223, !1224, !1237, !1238, !1239, !1240, !1241, !1242, !1244, !1246, !1247}
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1219, file: !330, line: 377, baseType: !1222, size: 64)
!1222 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !461, line: 111, baseType: !751)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1219, file: !330, line: 378, baseType: !1222, size: 64, offset: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1219, file: !330, line: 381, baseType: !1225, size: 64, offset: 128)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64)
!1226 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !330, line: 282, baseType: !1227)
!1227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !330, line: 282, size: 128, elements: !1228)
!1228 = !{!1229}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1227, file: !330, line: 282, baseType: !1230, size: 128)
!1230 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !330, line: 281, baseType: !1231)
!1231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !330, line: 281, size: 128, elements: !1232)
!1232 = !{!1233, !1234, !1235}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1231, file: !330, line: 281, baseType: !7, size: 32)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1231, file: !330, line: 281, baseType: !7, size: 32, offset: 32)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1231, file: !330, line: 281, baseType: !1236, size: 64, offset: 64)
!1236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1222, size: 64, elements: !559)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1219, file: !330, line: 384, baseType: !453, size: 32, offset: 192)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1219, file: !330, line: 387, baseType: !453, size: 32, offset: 224)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1219, file: !330, line: 390, baseType: !453, size: 32, offset: 256)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1219, file: !330, line: 394, baseType: !1225, size: 64, offset: 320)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1219, file: !330, line: 396, baseType: !329, size: 32, offset: 384)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1219, file: !330, line: 399, baseType: !1243, size: 64, offset: 416)
