; ModuleID = 'caller-save.bc'
source_filename = "caller-save.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.rtx_def = type { i32, %union.u }
%union.u = type { %struct.block_symbol }
%struct.block_symbol = type { [3 x %union.rtunion_def], %struct.object_block*, i64 }
%union.rtunion_def = type { i8* }
%struct.object_block = type { %union.section*, i32, i64, %struct.VEC_rtx_gc*, %struct.VEC_rtx_gc* }
%union.section = type { %struct.unnamed_section }
%struct.unnamed_section = type { %struct.section_common, void (i8*)*, i8*, %union.section* }
%struct.section_common = type { i32 }
%struct.VEC_rtx_gc = type { %struct.VEC_rtx_base }
%struct.VEC_rtx_base = type { i32, i32, [1 x %struct.rtx_def*] }
%struct.reg_info_t = type { i32, i32, i32, i32, i32, i32, i32 }
%struct.insn_chain = type { %struct.insn_chain*, %struct.insn_chain*, %struct.insn_chain*, %struct.rtx_def*, i32, i8, %struct.bitmap_head_def, %struct.bitmap_head_def, %struct.reload*, i32, i64 }

!492 = !DIEnumerator(name: "SQRT", value: 112, isUnsigned: true)
!493 = !DIEnumerator(name: "BSWAP", value: 113, isUnsigned: true)
!494 = !DIEnumerator(name: "FFS", value: 114, isUnsigned: true)
!495 = !DIEnumerator(name: "CLZ", value: 115, isUnsigned: true)
!496 = !DIEnumerator(name: "CTZ", value: 116, isUnsigned: true)
!497 = !DIEnumerator(name: "POPCOUNT", value: 117, isUnsigned: true)
!498 = !DIEnumerator(name: "PARITY", value: 118, isUnsigned: true)
!499 = !DIEnumerator(name: "SIGN_EXTRACT", value: 119, isUnsigned: true)
!500 = !DIEnumerator(name: "ZERO_EXTRACT", value: 120, isUnsigned: true)
!501 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!502 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!503 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!504 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!505 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!506 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!507 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!508 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!509 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!510 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!511 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!512 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!513 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!514 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!515 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!516 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!517 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!518 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!519 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!520 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "reg_class", file: !146, line: 1188, baseType: !7, size: 32, elements: !521)
!521 = !{!522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549}
!522 = !DIEnumerator(name: "NO_REGS", value: 0, isUnsigned: true)
!523 = !DIEnumerator(name: "AREG", value: 1, isUnsigned: true)
!524 = !DIEnumerator(name: "DREG", value: 2, isUnsigned: true)
!525 = !DIEnumerator(name: "CREG", value: 3, isUnsigned: true)
!526 = !DIEnumerator(name: "BREG", value: 4, isUnsigned: true)
!527 = !DIEnumerator(name: "SIREG", value: 5, isUnsigned: true)
!528 = !DIEnumerator(name: "DIREG", value: 6, isUnsigned: true)
!529 = !DIEnumerator(name: "AD_REGS", value: 7, isUnsigned: true)
!530 = !DIEnumerator(name: "CLOBBERED_REGS", value: 8, isUnsigned: true)
!531 = !DIEnumerator(name: "Q_REGS", value: 9, isUnsigned: true)
!532 = !DIEnumerator(name: "NON_Q_REGS", value: 10, isUnsigned: true)
!533 = !DIEnumerator(name: "INDEX_REGS", value: 11, isUnsigned: true)
!534 = !DIEnumerator(name: "LEGACY_REGS", value: 12, isUnsigned: true)
!535 = !DIEnumerator(name: "GENERAL_REGS", value: 13, isUnsigned: true)
!536 = !DIEnumerator(name: "FP_TOP_REG", value: 14, isUnsigned: true)
!537 = !DIEnumerator(name: "FP_SECOND_REG", value: 15, isUnsigned: true)
!538 = !DIEnumerator(name: "FLOAT_REGS", value: 16, isUnsigned: true)
!539 = !DIEnumerator(name: "SSE_FIRST_REG", value: 17, isUnsigned: true)
!540 = !DIEnumerator(name: "SSE_REGS", value: 18, isUnsigned: true)
!541 = !DIEnumerator(name: "MMX_REGS", value: 19, isUnsigned: true)
!542 = !DIEnumerator(name: "FP_TOP_SSE_REGS", value: 20, isUnsigned: true)
!543 = !DIEnumerator(name: "FP_SECOND_SSE_REGS", value: 21, isUnsigned: true)
!544 = !DIEnumerator(name: "FLOAT_SSE_REGS", value: 22, isUnsigned: true)
!545 = !DIEnumerator(name: "FLOAT_INT_REGS", value: 23, isUnsigned: true)
!546 = !DIEnumerator(name: "INT_SSE_REGS", value: 24, isUnsigned: true)
!547 = !DIEnumerator(name: "FLOAT_INT_SSE_REGS", value: 25, isUnsigned: true)
!548 = !DIEnumerator(name: "ALL_REGS", value: 26, isUnsigned: true)
!549 = !DIEnumerator(name: "LIM_REG_CLASSES", value: 27, isUnsigned: true)
!550 = !{!551, !552, !553, !554, !557, !558, !560, !5, !377, !563, !555, !1632, !1633, !1642, !1644, !1645, !7, !1646}
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!553 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !556)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "HARD_REG_ELT_TYPE", file: !561, line: 42, baseType: !562)
!561 = !DIFile(filename: "./hard-reg-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!562 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !564, line: 50, baseType: !565)
!564 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !378, line: 240, size: 384, elements: !567)
!567 = !{!568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !566, file: !378, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !566, file: !378, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !566, file: !378, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !566, file: !378, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !566, file: !378, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !566, file: !378, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !566, file: !378, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !566, file: !378, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !566, file: !378, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !566, file: !378, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !566, file: !378, line: 321, baseType: !579, size: 320, offset: 64)
!579 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !378, line: 315, size: 320, elements: !580)
!580 = !{!581, !1567, !1569, !1630, !1631}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !579, file: !378, line: 316, baseType: !582, size: 64)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !583, size: 64, elements: !598)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !378, line: 183, baseType: !584)
!584 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !378, line: 166, size: 64, elements: !585)
!585 = !{!586, !587, !588, !589, !590, !600, !601, !613, !616, !677, !1545, !1546, !1557, !1564}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !584, file: !378, line: 168, baseType: !553, size: 32)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !584, file: !378, line: 169, baseType: !7, size: 32)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !584, file: !378, line: 170, baseType: !558, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !584, file: !378, line: 171, baseType: !563, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !584, file: !378, line: 172, baseType: !591, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !564, line: 53, baseType: !592)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !378, line: 359, size: 128, elements: !594)
!594 = !{!595, !596}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !593, file: !378, line: 360, baseType: !553, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !593, file: !378, line: 361, baseType: !597, size: 64, offset: 64)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !563, size: 64, elements: !598)
!598 = !{!599}
!599 = !DISubrange(count: 1)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !584, file: !378, line: 173, baseType: !5, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !584, file: !378, line: 174, baseType: !602, size: 32)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !378, line: 133, baseType: !603)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !378, line: 115, size: 32, elements: !604)
!604 = !{!605, !606, !607, !608, !609, !610, !611, !612}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !603, file: !378, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !603, file: !378, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !603, file: !378, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !603, file: !378, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !603, file: !378, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !603, file: !378, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !603, file: !378, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !603, file: !378, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !584, file: !378, line: 175, baseType: !614, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !378, line: 175, flags: DIFlagFwdDecl)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !584, file: !378, line: 176, baseType: !617, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !619, line: 75, size: 256, elements: !620)
!619 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!620 = !{!621, !635, !636, !637}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !618, file: !619, line: 76, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !619, line: 68, baseType: !624)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !619, line: 63, size: 320, elements: !625)
!625 = !{!626, !628, !629, !630}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !624, file: !619, line: 64, baseType: !627, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !624, file: !619, line: 65, baseType: !627, size: 64, offset: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !624, file: !619, line: 66, baseType: !7, size: 32, offset: 128)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !624, file: !619, line: 67, baseType: !631, size: 128, offset: 192)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !632, size: 128, elements: !633)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !619, line: 29, baseType: !562)
!633 = !{!634}
!634 = !DISubrange(count: 2)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !618, file: !619, line: 77, baseType: !622, size: 64, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !618, file: !619, line: 78, baseType: !7, size: 32, offset: 128)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !618, file: !619, line: 79, baseType: !638, size: 64, offset: 192)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !619, line: 49, baseType: !640)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !619, line: 45, size: 832, elements: !641)
!641 = !{!642, !643, !644}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !640, file: !619, line: 46, baseType: !627, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !640, file: !619, line: 47, baseType: !617, size: 64, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !640, file: !619, line: 48, baseType: !645, size: 704, offset: 128)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !646, line: 164, size: 704, elements: !647)
!646 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!647 = !{!648, !650, !660, !661, !662, !663, !664, !665, !669, !673, !674, !675, !676}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !645, file: !646, line: 166, baseType: !649, size: 64)
!649 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !645, file: !646, line: 167, baseType: !651, size: 64, offset: 64)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !646, line: 157, size: 192, elements: !653)
!653 = !{!654, !655, !656}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !652, file: !646, line: 159, baseType: !555, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !652, file: !646, line: 160, baseType: !651, size: 64, offset: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !652, file: !646, line: 161, baseType: !657, size: 32, offset: 128)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !556, size: 32, elements: !658)
!658 = !{!659}
!659 = !DISubrange(count: 4)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !645, file: !646, line: 168, baseType: !555, size: 64, offset: 128)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !645, file: !646, line: 169, baseType: !555, size: 64, offset: 192)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !645, file: !646, line: 170, baseType: !555, size: 64, offset: 256)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !645, file: !646, line: 171, baseType: !649, size: 64, offset: 320)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !645, file: !646, line: 172, baseType: !553, size: 32, offset: 384)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !645, file: !646, line: 176, baseType: !666, size: 64, offset: 448)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DISubroutineType(types: !668)
!668 = !{!651, !557, !649}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !645, file: !646, line: 177, baseType: !670, size: 64, offset: 512)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{null, !557, !651}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !645, file: !646, line: 178, baseType: !557, size: 64, offset: 576)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !645, file: !646, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !645, file: !646, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !645, file: !646, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !584, file: !378, line: 177, baseType: !678, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !564, line: 56, baseType: !679)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !151, line: 3371, size: 1792, elements: !681)
!681 = !{!682, !715, !721, !732, !751, !762, !767, !774, !780, !793, !805, !843, !848, !876, !884, !885, !890, !899, !905, !910, !914, !918, !1169, !1218, !1224, !1231, !1238, !1264, !1289, !1306, !1318, !1340, !1355, !1527}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !680, file: !151, line: 3372, baseType: !683, size: 64)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !151, line: 360, size: 64, elements: !684)
!684 = !{!685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !683, file: !151, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !683, file: !151, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !683, file: !151, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !683, file: !151, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !683, file: !151, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !683, file: !151, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !683, file: !151, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !683, file: !151, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !683, file: !151, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !683, file: !151, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !683, file: !151, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !683, file: !151, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !683, file: !151, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !683, file: !151, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !683, file: !151, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !683, file: !151, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !683, file: !151, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !683, file: !151, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !683, file: !151, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !683, file: !151, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !683, file: !151, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !683, file: !151, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !683, file: !151, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !683, file: !151, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !683, file: !151, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !683, file: !151, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !683, file: !151, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !683, file: !151, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !683, file: !151, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !683, file: !151, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !680, file: !151, line: 3373, baseType: !716, size: 192)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !151, line: 402, size: 192, elements: !717)
!717 = !{!718, !719, !720}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !716, file: !151, line: 403, baseType: !683, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !716, file: !151, line: 404, baseType: !678, size: 64, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !716, file: !151, line: 405, baseType: !678, size: 64, offset: 128)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !680, file: !151, line: 3374, baseType: !722, size: 320)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !151, line: 1384, size: 320, elements: !723)
!723 = !{!724, !725}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !722, file: !151, line: 1385, baseType: !716, size: 192)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !722, file: !151, line: 1386, baseType: !726, size: 128, offset: 192)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !727, line: 58, baseType: !728)
!727 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !727, line: 54, size: 128, elements: !729)
!729 = !{!730, !731}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !728, file: !727, line: 56, baseType: !562, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !728, file: !727, line: 57, baseType: !649, size: 64, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !680, file: !151, line: 3375, baseType: !733, size: 256)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !151, line: 1397, size: 256, elements: !734)
!734 = !{!735, !736}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !733, file: !151, line: 1398, baseType: !716, size: 192)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !733, file: !151, line: 1399, baseType: !737, size: 64, offset: 192)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !739, line: 52, size: 256, elements: !740)
!739 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!740 = !{!741, !742, !743, !744, !745, !746, !747}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !738, file: !739, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !738, file: !739, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !738, file: !739, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !738, file: !739, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !738, file: !739, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !738, file: !739, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !738, file: !739, line: 62, baseType: !748, size: 192, offset: 64)
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !562, size: 192, elements: !749)
!749 = !{!750}
!750 = !DISubrange(count: 3)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !680, file: !151, line: 3376, baseType: !752, size: 256)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !151, line: 1408, size: 256, elements: !753)
!753 = !{!754, !755}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !752, file: !151, line: 1409, baseType: !716, size: 192)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !752, file: !151, line: 1410, baseType: !756, size: 64, offset: 192)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !758, line: 27, size: 192, elements: !759)
!758 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!759 = !{!760, !761}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !757, file: !758, line: 29, baseType: !726, size: 128)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !757, file: !758, line: 30, baseType: !5, size: 32, offset: 128)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !680, file: !151, line: 3377, baseType: !763, size: 256)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !151, line: 1437, size: 256, elements: !764)
!764 = !{!765, !766}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !763, file: !151, line: 1438, baseType: !716, size: 192)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !763, file: !151, line: 1439, baseType: !678, size: 64, offset: 192)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !680, file: !151, line: 3378, baseType: !768, size: 256)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !151, line: 1418, size: 256, elements: !769)
!769 = !{!770, !771, !772}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !768, file: !151, line: 1419, baseType: !716, size: 192)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !768, file: !151, line: 1420, baseType: !553, size: 32, offset: 192)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !768, file: !151, line: 1421, baseType: !773, size: 8, offset: 224)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !556, size: 8, elements: !598)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !680, file: !151, line: 3379, baseType: !775, size: 320)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !151, line: 1428, size: 320, elements: !776)
!776 = !{!777, !778, !779}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !775, file: !151, line: 1429, baseType: !716, size: 192)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !775, file: !151, line: 1430, baseType: !678, size: 64, offset: 192)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !775, file: !151, line: 1431, baseType: !678, size: 64, offset: 256)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !680, file: !151, line: 3380, baseType: !781, size: 320)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !151, line: 1460, size: 320, elements: !782)
!782 = !{!783, !784}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !781, file: !151, line: 1461, baseType: !716, size: 192)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !781, file: !151, line: 1462, baseType: !785, size: 128, offset: 192)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !786, line: 31, size: 128, elements: !787)
!786 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!787 = !{!788, !791, !792}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !785, file: !786, line: 32, baseType: !789, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !552)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !785, file: !786, line: 33, baseType: !7, size: 32, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !785, file: !786, line: 34, baseType: !7, size: 32, offset: 96)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !680, file: !151, line: 3381, baseType: !794, size: 384)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !151, line: 2507, size: 384, elements: !795)
!795 = !{!796, !797, !802, !803, !804}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !794, file: !151, line: 2508, baseType: !716, size: 192)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !794, file: !151, line: 2509, baseType: !798, size: 32, offset: 192)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !799, line: 58, baseType: !800)
!799 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !801, line: 44, baseType: !7)
!801 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!802 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !794, file: !151, line: 2510, baseType: !7, size: 32, offset: 224)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !794, file: !151, line: 2511, baseType: !678, size: 64, offset: 256)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !794, file: !151, line: 2512, baseType: !678, size: 64, offset: 320)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !680, file: !151, line: 3382, baseType: !806, size: 896)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !151, line: 2652, size: 896, elements: !807)
!807 = !{!808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !806, file: !151, line: 2653, baseType: !794, size: 384)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !806, file: !151, line: 2654, baseType: !678, size: 64, offset: 384)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !806, file: !151, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !806, file: !151, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !806, file: !151, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !806, file: !151, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !806, file: !151, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !806, file: !151, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !806, file: !151, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !806, file: !151, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !806, file: !151, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !806, file: !151, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !806, file: !151, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !806, file: !151, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !806, file: !151, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !806, file: !151, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !806, file: !151, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !806, file: !151, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !806, file: !151, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !806, file: !151, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !806, file: !151, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !806, file: !151, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !806, file: !151, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !806, file: !151, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !806, file: !151, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !806, file: !151, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !806, file: !151, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !806, file: !151, line: 2703, baseType: !7, size: 32, offset: 512)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !806, file: !151, line: 2705, baseType: !678, size: 64, offset: 576)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !806, file: !151, line: 2706, baseType: !678, size: 64, offset: 640)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !806, file: !151, line: 2707, baseType: !678, size: 64, offset: 704)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !806, file: !151, line: 2708, baseType: !678, size: 64, offset: 768)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !806, file: !151, line: 2711, baseType: !841, size: 64, offset: 832)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !151, line: 2711, flags: DIFlagFwdDecl)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !680, file: !151, line: 3383, baseType: !844, size: 960)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !151, line: 2756, size: 960, elements: !845)
!845 = !{!846, !847}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !844, file: !151, line: 2757, baseType: !806, size: 896)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !844, file: !151, line: 2758, baseType: !563, size: 64, offset: 896)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !680, file: !151, line: 3384, baseType: !849, size: 1472)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !151, line: 3114, size: 1472, elements: !850)
!850 = !{!851, !872, !873, !874, !875}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !849, file: !151, line: 3115, baseType: !852, size: 1216)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !151, line: 2984, size: 1216, elements: !853)
!853 = !{!854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !852, file: !151, line: 2985, baseType: !844, size: 960)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !852, file: !151, line: 2986, baseType: !678, size: 64, offset: 960)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !852, file: !151, line: 2987, baseType: !678, size: 64, offset: 1024)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !852, file: !151, line: 2988, baseType: !678, size: 64, offset: 1088)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !852, file: !151, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !852, file: !151, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !852, file: !151, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !852, file: !151, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !852, file: !151, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !852, file: !151, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !852, file: !151, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !852, file: !151, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !852, file: !151, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !852, file: !151, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !852, file: !151, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !852, file: !151, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !852, file: !151, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !852, file: !151, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !849, file: !151, line: 3117, baseType: !678, size: 64, offset: 1216)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !849, file: !151, line: 3119, baseType: !678, size: 64, offset: 1280)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !849, file: !151, line: 3121, baseType: !678, size: 64, offset: 1344)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !849, file: !151, line: 3123, baseType: !678, size: 64, offset: 1408)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !680, file: !151, line: 3385, baseType: !877, size: 1088)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !151, line: 2874, size: 1088, elements: !878)
!878 = !{!879, !880, !881}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !877, file: !151, line: 2875, baseType: !844, size: 960)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !877, file: !151, line: 2876, baseType: !563, size: 64, offset: 960)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !877, file: !151, line: 2877, baseType: !882, size: 64, offset: 1024)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !151, line: 2856, flags: DIFlagFwdDecl)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !680, file: !151, line: 3386, baseType: !852, size: 1216)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !680, file: !151, line: 3387, baseType: !886, size: 1280)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !151, line: 3093, size: 1280, elements: !887)
!887 = !{!888, !889}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !886, file: !151, line: 3094, baseType: !852, size: 1216)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !886, file: !151, line: 3095, baseType: !882, size: 64, offset: 1216)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !680, file: !151, line: 3388, baseType: !891, size: 1216)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !151, line: 2824, size: 1216, elements: !892)
!892 = !{!893, !894, !895, !896, !897, !898}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !891, file: !151, line: 2825, baseType: !806, size: 896)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !891, file: !151, line: 2827, baseType: !678, size: 64, offset: 896)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !891, file: !151, line: 2828, baseType: !678, size: 64, offset: 960)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !891, file: !151, line: 2829, baseType: !678, size: 64, offset: 1024)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !891, file: !151, line: 2830, baseType: !678, size: 64, offset: 1088)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !891, file: !151, line: 2831, baseType: !678, size: 64, offset: 1152)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !680, file: !151, line: 3389, baseType: !900, size: 1024)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !151, line: 2850, size: 1024, elements: !901)
!901 = !{!902, !903, !904}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !900, file: !151, line: 2851, baseType: !844, size: 960)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !900, file: !151, line: 2852, baseType: !553, size: 32, offset: 960)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !900, file: !151, line: 2853, baseType: !553, size: 32, offset: 992)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !680, file: !151, line: 3390, baseType: !906, size: 1024)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !151, line: 2857, size: 1024, elements: !907)
!907 = !{!908, !909}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !906, file: !151, line: 2858, baseType: !844, size: 960)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !906, file: !151, line: 2859, baseType: !882, size: 64, offset: 960)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !680, file: !151, line: 3391, baseType: !911, size: 960)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !151, line: 2862, size: 960, elements: !912)
!912 = !{!913}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !911, file: !151, line: 2863, baseType: !844, size: 960)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !680, file: !151, line: 3392, baseType: !915, size: 1472)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !151, line: 3304, size: 1472, elements: !916)
!916 = !{!917}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !915, file: !151, line: 3305, baseType: !849, size: 1472)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !680, file: !151, line: 3393, baseType: !919, size: 1792)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !151, line: 3248, size: 1792, elements: !920)
!920 = !{!921, !922, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !919, file: !151, line: 3249, baseType: !849, size: 1472)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !919, file: !151, line: 3251, baseType: !923, size: 64, offset: 1472)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !925, line: 463, size: 1152, elements: !926)
!925 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!926 = !{!927, !930, !1034, !1035, !1038, !1041, !1093, !1094, !1095, !1096, !1097, !1121, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !924, file: !925, line: 464, baseType: !928, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !925, line: 464, flags: DIFlagFwdDecl)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !924, file: !925, line: 467, baseType: !931, size: 64, offset: 64)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !135, line: 374, size: 640, elements: !933)
!933 = !{!934, !1009, !1010, !1023, !1024, !1025, !1026, !1027, !1028, !1030, !1032, !1033}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !932, file: !135, line: 377, baseType: !935, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !564, line: 111, baseType: !936)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !135, line: 217, size: 832, elements: !938)
!938 = !{!939, !974, !975, !976, !979, !983, !984, !985, !1003, !1004, !1005, !1006, !1007, !1008}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !937, file: !135, line: 219, baseType: !940, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !135, line: 151, baseType: !942)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !135, line: 151, size: 128, elements: !943)
!943 = !{!944}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !942, file: !135, line: 151, baseType: !945, size: 128)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !135, line: 150, baseType: !946)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !135, line: 150, size: 128, elements: !947)
!947 = !{!948, !949, !950}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !946, file: !135, line: 150, baseType: !7, size: 32)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !946, file: !135, line: 150, baseType: !7, size: 32, offset: 32)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !946, file: !135, line: 150, baseType: !951, size: 64, offset: 64)
!951 = !DICompositeType(tag: DW_TAG_array_type, baseType: !952, size: 64, elements: !598)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !564, line: 108, baseType: !953)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !135, line: 122, size: 512, elements: !955)
!955 = !{!956, !957, !958, !966, !967, !968, !969, !970, !971, !972}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !954, file: !135, line: 124, baseType: !936, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !954, file: !135, line: 125, baseType: !936, size: 64, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !954, file: !135, line: 131, baseType: !959, size: 64, offset: 128)
!959 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !135, line: 128, size: 64, elements: !960)
!960 = !{!961, !965}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !959, file: !135, line: 129, baseType: !962, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !564, line: 66, baseType: !963)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !564, line: 65, flags: DIFlagFwdDecl)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !959, file: !135, line: 130, baseType: !563, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !954, file: !135, line: 134, baseType: !557, size: 64, offset: 192)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !954, file: !135, line: 137, baseType: !678, size: 64, offset: 256)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !954, file: !135, line: 138, baseType: !798, size: 32, offset: 320)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !954, file: !135, line: 142, baseType: !7, size: 32, offset: 352)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !954, file: !135, line: 144, baseType: !553, size: 32, offset: 384)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !954, file: !135, line: 145, baseType: !553, size: 32, offset: 416)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !954, file: !135, line: 146, baseType: !973, size: 64, offset: 448)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !135, line: 119, baseType: !649)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !937, file: !135, line: 220, baseType: !940, size: 64, offset: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !937, file: !135, line: 223, baseType: !557, size: 64, offset: 128)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !937, file: !135, line: 226, baseType: !977, size: 64, offset: 192)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !135, line: 185, flags: DIFlagFwdDecl)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !937, file: !135, line: 229, baseType: !980, size: 128, offset: 256)
!980 = !DICompositeType(tag: DW_TAG_array_type, baseType: !981, size: 128, elements: !633)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !135, line: 229, flags: DIFlagFwdDecl)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !937, file: !135, line: 232, baseType: !936, size: 64, offset: 384)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !937, file: !135, line: 233, baseType: !936, size: 64, offset: 448)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !937, file: !135, line: 238, baseType: !986, size: 64, offset: 512)
!986 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !135, line: 235, size: 64, elements: !987)
!987 = !{!988, !994}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !986, file: !135, line: 236, baseType: !989, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !135, line: 273, size: 128, elements: !991)
!991 = !{!992, !993}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !990, file: !135, line: 275, baseType: !962, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !990, file: !135, line: 278, baseType: !962, size: 64, offset: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !986, file: !135, line: 237, baseType: !995, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !135, line: 259, size: 320, elements: !997)
!997 = !{!998, !999, !1000, !1001, !1002}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !996, file: !135, line: 261, baseType: !563, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !996, file: !135, line: 262, baseType: !563, size: 64, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !996, file: !135, line: 266, baseType: !563, size: 64, offset: 128)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !996, file: !135, line: 267, baseType: !563, size: 64, offset: 192)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !996, file: !135, line: 270, baseType: !553, size: 32, offset: 256)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !937, file: !135, line: 241, baseType: !973, size: 64, offset: 576)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !937, file: !135, line: 244, baseType: !553, size: 32, offset: 640)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !937, file: !135, line: 247, baseType: !553, size: 32, offset: 672)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !937, file: !135, line: 250, baseType: !553, size: 32, offset: 704)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !937, file: !135, line: 253, baseType: !553, size: 32, offset: 736)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !937, file: !135, line: 256, baseType: !553, size: 32, offset: 768)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !932, file: !135, line: 378, baseType: !935, size: 64, offset: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !932, file: !135, line: 381, baseType: !1011, size: 64, offset: 128)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !135, line: 282, baseType: !1013)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !135, line: 282, size: 128, elements: !1014)
!1014 = !{!1015}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1013, file: !135, line: 282, baseType: !1016, size: 128)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !135, line: 281, baseType: !1017)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !135, line: 281, size: 128, elements: !1018)
!1018 = !{!1019, !1020, !1021}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1017, file: !135, line: 281, baseType: !7, size: 32)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1017, file: !135, line: 281, baseType: !7, size: 32, offset: 32)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1017, file: !135, line: 281, baseType: !1022, size: 64, offset: 64)
!1022 = !DICompositeType(tag: DW_TAG_array_type, baseType: !935, size: 64, elements: !598)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !932, file: !135, line: 384, baseType: !553, size: 32, offset: 192)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !932, file: !135, line: 387, baseType: !553, size: 32, offset: 224)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !932, file: !135, line: 390, baseType: !553, size: 32, offset: 256)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !932, file: !135, line: 394, baseType: !1011, size: 64, offset: 320)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !932, file: !135, line: 396, baseType: !134, size: 32, offset: 384)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !932, file: !135, line: 399, baseType: !1029, size: 64, offset: 416)
!1029 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 64, elements: !633)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !932, file: !135, line: 402, baseType: !1031, size: 64, offset: 480)
!1031 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !633)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !932, file: !135, line: 406, baseType: !553, size: 32, offset: 544)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !932, file: !135, line: 409, baseType: !553, size: 32, offset: 576)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !924, file: !925, line: 470, baseType: !963, size: 64, offset: 128)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !924, file: !925, line: 473, baseType: !1036, size: 64, offset: 192)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !925, line: 166, flags: DIFlagFwdDecl)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !924, file: !925, line: 476, baseType: !1039, size: 64, offset: 256)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !925, line: 476, flags: DIFlagFwdDecl)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !924, file: !925, line: 479, baseType: !1042, size: 64, offset: 320)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1043, line: 144, baseType: !1044)
!1043 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1043, line: 100, size: 896, elements: !1046)
!1046 = !{!1047, !1055, !1060, !1065, !1067, !1070, !1071, !1072, !1073, !1074, !1079, !1081, !1082, !1087, !1092}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1045, file: !1043, line: 102, baseType: !1048, size: 64)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1043, line: 52, baseType: !1049)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!1052, !1053}
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1043, line: 47, baseType: !7)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1045, file: !1043, line: 105, baseType: !1056, size: 64, offset: 64)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1043, line: 59, baseType: !1057)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!553, !1053, !1053}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1045, file: !1043, line: 108, baseType: !1061, size: 64, offset: 128)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1043, line: 63, baseType: !1062)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{null, !557}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1045, file: !1043, line: 111, baseType: !1066, size: 64, offset: 192)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1045, file: !1043, line: 114, baseType: !1068, size: 64, offset: 256)
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1069, line: 46, baseType: !562)
!1069 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1045, file: !1043, line: 117, baseType: !1068, size: 64, offset: 320)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1045, file: !1043, line: 120, baseType: !1068, size: 64, offset: 384)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1045, file: !1043, line: 124, baseType: !7, size: 32, offset: 448)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1045, file: !1043, line: 128, baseType: !7, size: 32, offset: 480)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1045, file: !1043, line: 131, baseType: !1075, size: 64, offset: 512)
!1075 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1043, line: 75, baseType: !1076)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!557, !1068, !1068}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1045, file: !1043, line: 132, baseType: !1080, size: 64, offset: 576)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1043, line: 78, baseType: !1062)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1045, file: !1043, line: 135, baseType: !557, size: 64, offset: 640)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1045, file: !1043, line: 136, baseType: !1083, size: 64, offset: 704)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1043, line: 82, baseType: !1084)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{!557, !557, !1068, !1068}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1045, file: !1043, line: 137, baseType: !1088, size: 64, offset: 768)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1043, line: 83, baseType: !1089)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{null, !557, !557}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1045, file: !1043, line: 141, baseType: !7, size: 32, offset: 832)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !924, file: !925, line: 484, baseType: !678, size: 64, offset: 384)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !924, file: !925, line: 488, baseType: !678, size: 64, offset: 448)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !924, file: !925, line: 493, baseType: !678, size: 64, offset: 512)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !924, file: !925, line: 496, baseType: !678, size: 64, offset: 576)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !924, file: !925, line: 501, baseType: !1098, size: 64, offset: 640)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !146, line: 2355, size: 576, elements: !1100)
!1100 = !{!1101, !1104, !1105, !1106, !1107, !1109, !1110, !1115, !1116, !1117, !1118, !1119, !1120}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1099, file: !146, line: 2356, baseType: !1102, size: 64)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !146, line: 2356, flags: DIFlagFwdDecl)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1099, file: !146, line: 2357, baseType: !558, size: 64, offset: 64)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1099, file: !146, line: 2358, baseType: !553, size: 32, offset: 128)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1099, file: !146, line: 2359, baseType: !553, size: 32, offset: 160)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1099, file: !146, line: 2360, baseType: !1108, size: 128, offset: 192)
!1108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 128, elements: !658)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1099, file: !146, line: 2364, baseType: !553, size: 32, offset: 320)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1099, file: !146, line: 2367, baseType: !1111, size: 128, offset: 384)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !146, line: 2349, size: 128, elements: !1112)
!1112 = !{!1113, !1114}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1111, file: !146, line: 2351, baseType: !563, size: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1111, file: !146, line: 2352, baseType: !649, size: 64, offset: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1099, file: !146, line: 2371, baseType: !145, size: 32, offset: 512)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1099, file: !146, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1099, file: !146, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1099, file: !146, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1099, file: !146, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1099, file: !146, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !924, file: !925, line: 504, baseType: !1122, size: 64, offset: 704)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !925, line: 504, flags: DIFlagFwdDecl)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !924, file: !925, line: 507, baseType: !1042, size: 64, offset: 768)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !924, file: !925, line: 510, baseType: !553, size: 32, offset: 832)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !924, file: !925, line: 513, baseType: !553, size: 32, offset: 864)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !924, file: !925, line: 516, baseType: !798, size: 32, offset: 896)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !924, file: !925, line: 519, baseType: !798, size: 32, offset: 928)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !924, file: !925, line: 522, baseType: !7, size: 32, offset: 960)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !924, file: !925, line: 523, baseType: !7, size: 32, offset: 992)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !924, file: !925, line: 528, baseType: !558, size: 64, offset: 1024)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !924, file: !925, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !924, file: !925, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !924, file: !925, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !924, file: !925, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !924, file: !925, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !924, file: !925, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !924, file: !925, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !924, file: !925, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !924, file: !925, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !924, file: !925, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !924, file: !925, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !924, file: !925, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !924, file: !925, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !924, file: !925, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !924, file: !925, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !924, file: !925, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !919, file: !151, line: 3254, baseType: !678, size: 64, offset: 1536)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !919, file: !151, line: 3257, baseType: !678, size: 64, offset: 1600)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !919, file: !151, line: 3258, baseType: !678, size: 64, offset: 1664)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !919, file: !151, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !919, file: !151, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !919, file: !151, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !919, file: !151, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !919, file: !151, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !919, file: !151, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !919, file: !151, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !919, file: !151, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !919, file: !151, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !919, file: !151, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !919, file: !151, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !919, file: !151, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !919, file: !151, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !919, file: !151, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !919, file: !151, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !919, file: !151, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !919, file: !151, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !919, file: !151, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !680, file: !151, line: 3394, baseType: !1170, size: 1344)
!1170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !151, line: 2279, size: 1344, elements: !1171)
!1171 = !{!1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1197, !1198, !1199, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1170, file: !151, line: 2280, baseType: !716, size: 192)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1170, file: !151, line: 2281, baseType: !678, size: 64, offset: 192)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1170, file: !151, line: 2282, baseType: !678, size: 64, offset: 256)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1170, file: !151, line: 2283, baseType: !678, size: 64, offset: 320)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1170, file: !151, line: 2284, baseType: !678, size: 64, offset: 384)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1170, file: !151, line: 2285, baseType: !7, size: 32, offset: 448)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1170, file: !151, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1170, file: !151, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1170, file: !151, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1170, file: !151, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1170, file: !151, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1170, file: !151, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1170, file: !151, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1170, file: !151, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1170, file: !151, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1170, file: !151, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1170, file: !151, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1170, file: !151, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1170, file: !151, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1170, file: !151, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1170, file: !151, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1170, file: !151, line: 2305, baseType: !7, size: 32, offset: 512)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1170, file: !151, line: 2306, baseType: !1195, size: 32, offset: 544)
!1195 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1196, line: 31, baseType: !553)
!1196 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1170, file: !151, line: 2307, baseType: !678, size: 64, offset: 576)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1170, file: !151, line: 2308, baseType: !678, size: 64, offset: 640)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1170, file: !151, line: 2314, baseType: !1200, size: 64, offset: 704)
!1200 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !151, line: 2309, size: 64, elements: !1201)
!1201 = !{!1202, !1203, !1204}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1200, file: !151, line: 2310, baseType: !553, size: 32)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1200, file: !151, line: 2311, baseType: !558, size: 64)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1200, file: !151, line: 2312, baseType: !1205, size: 64)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64)
!1206 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !151, line: 2277, flags: DIFlagFwdDecl)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1170, file: !151, line: 2315, baseType: !678, size: 64, offset: 768)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1170, file: !151, line: 2316, baseType: !678, size: 64, offset: 832)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1170, file: !151, line: 2317, baseType: !678, size: 64, offset: 896)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1170, file: !151, line: 2318, baseType: !678, size: 64, offset: 960)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1170, file: !151, line: 2319, baseType: !678, size: 64, offset: 1024)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1170, file: !151, line: 2320, baseType: !678, size: 64, offset: 1088)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1170, file: !151, line: 2321, baseType: !678, size: 64, offset: 1152)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1170, file: !151, line: 2322, baseType: !678, size: 64, offset: 1216)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1170, file: !151, line: 2324, baseType: !1216, size: 64, offset: 1280)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1217 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !151, line: 2324, flags: DIFlagFwdDecl)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !680, file: !151, line: 3395, baseType: !1219, size: 320)
!1219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !151, line: 1469, size: 320, elements: !1220)
!1220 = !{!1221, !1222, !1223}
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1219, file: !151, line: 1470, baseType: !716, size: 192)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1219, file: !151, line: 1471, baseType: !678, size: 64, offset: 192)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1219, file: !151, line: 1472, baseType: !678, size: 64, offset: 256)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !680, file: !151, line: 3396, baseType: !1225, size: 320)
!1225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !151, line: 1482, size: 320, elements: !1226)
!1226 = !{!1227, !1228, !1229}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1225, file: !151, line: 1483, baseType: !716, size: 192)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1225, file: !151, line: 1484, baseType: !553, size: 32, offset: 192)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1225, file: !151, line: 1485, baseType: !1230, size: 64, offset: 256)
!1230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !678, size: 64, elements: !598)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !680, file: !151, line: 3397, baseType: !1232, size: 384)
!1232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !151, line: 1829, size: 384, elements: !1233)
!1233 = !{!1234, !1235, !1236, !1237}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1232, file: !151, line: 1830, baseType: !716, size: 192)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1232, file: !151, line: 1831, baseType: !798, size: 32, offset: 192)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1232, file: !151, line: 1832, baseType: !678, size: 64, offset: 256)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1232, file: !151, line: 1835, baseType: !1230, size: 64, offset: 320)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !680, file: !151, line: 3398, baseType: !1239, size: 704)
!1239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !151, line: 1898, size: 704, elements: !1240)
!1240 = !{!1241, !1242, !1243, !1247, !1248, !1251}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1239, file: !151, line: 1899, baseType: !716, size: 192)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1239, file: !151, line: 1902, baseType: !678, size: 64, offset: 192)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1239, file: !151, line: 1905, baseType: !1244, size: 64, offset: 256)
!1244 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !564, line: 58, baseType: !1245)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64)
!1246 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !564, line: 57, flags: DIFlagFwdDecl)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1239, file: !151, line: 1908, baseType: !7, size: 32, offset: 320)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1239, file: !151, line: 1911, baseType: !1249, size: 64, offset: 384)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64)
!1250 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !151, line: 1876, flags: DIFlagFwdDecl)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1239, file: !151, line: 1914, baseType: !1252, size: 256, offset: 448)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !151, line: 1883, size: 256, elements: !1253)
!1253 = !{!1254, !1256, !1257, !1262}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1252, file: !151, line: 1884, baseType: !1255, size: 64)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1252, file: !151, line: 1885, baseType: !1255, size: 64, offset: 64)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1252, file: !151, line: 1891, baseType: !1258, size: 64, offset: 128)
!1258 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1252, file: !151, line: 1891, size: 64, elements: !1259)
!1259 = !{!1260, !1261}
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1258, file: !151, line: 1891, baseType: !1244, size: 64)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1258, file: !151, line: 1891, baseType: !678, size: 64)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1252, file: !151, line: 1892, baseType: !1263, size: 64, offset: 192)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !680, file: !151, line: 3399, baseType: !1265, size: 704)
!1265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !151, line: 2008, size: 704, elements: !1266)
!1266 = !{!1267, !1268, !1269, !1270, !1271, !1272, !1284, !1285, !1286, !1287, !1288}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1265, file: !151, line: 2009, baseType: !716, size: 192)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1265, file: !151, line: 2011, baseType: !7, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !1265, file: !151, line: 2012, baseType: !7, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1265, file: !151, line: 2014, baseType: !798, size: 32, offset: 224)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1265, file: !151, line: 2016, baseType: !678, size: 64, offset: 256)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !1265, file: !151, line: 2017, baseType: !1273, size: 64, offset: 320)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64)
!1274 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !151, line: 183, baseType: !1275)
!1275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !151, line: 183, size: 128, elements: !1276)
!1276 = !{!1277}
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1275, file: !151, line: 183, baseType: !1278, size: 128)
!1278 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !151, line: 182, baseType: !1279)
!1279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !151, line: 182, size: 128, elements: !1280)
!1280 = !{!1281, !1282, !1283}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1279, file: !151, line: 182, baseType: !7, size: 32)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1279, file: !151, line: 182, baseType: !7, size: 32, offset: 32)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1279, file: !151, line: 182, baseType: !1230, size: 64, offset: 64)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !1265, file: !151, line: 2019, baseType: !678, size: 64, offset: 384)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !1265, file: !151, line: 2020, baseType: !678, size: 64, offset: 448)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1265, file: !151, line: 2021, baseType: !678, size: 64, offset: 512)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !1265, file: !151, line: 2022, baseType: !678, size: 64, offset: 576)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !1265, file: !151, line: 2023, baseType: !678, size: 64, offset: 640)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !680, file: !151, line: 3400, baseType: !1290, size: 832)
!1290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !151, line: 2430, size: 832, elements: !1291)
!1291 = !{!1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1290, file: !151, line: 2431, baseType: !716, size: 192)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1290, file: !151, line: 2433, baseType: !678, size: 64, offset: 192)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !1290, file: !151, line: 2434, baseType: !678, size: 64, offset: 256)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !1290, file: !151, line: 2435, baseType: !678, size: 64, offset: 320)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !1290, file: !151, line: 2436, baseType: !678, size: 64, offset: 384)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "base_accesses", scope: !1290, file: !151, line: 2437, baseType: !1273, size: 64, offset: 448)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "inheritance", scope: !1290, file: !151, line: 2438, baseType: !678, size: 64, offset: 512)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_subvtt", scope: !1290, file: !151, line: 2440, baseType: !678, size: 64, offset: 576)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_vptr", scope: !1290, file: !151, line: 2441, baseType: !678, size: 64, offset: 640)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "base_binfos", scope: !1290, file: !151, line: 2443, baseType: !1302, size: 128, offset: 704)
