; ModuleID = 'calls.bc'
source_filename = "calls.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "currently_expanding_call", scope: !2, file: !3, line: 1912, type: !32, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "expand_call", scope: !3, file: !3, line: 1909, type: !4, scopeLine: 1910, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1818, retainedNodes: !2277)
!3 = !DIFile(filename: "calls.c", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !258, !6, !32}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !7, line: 50, baseType: !8)
!7 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !10, line: 240, size: 384, elements: !11)
!10 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!11 = !{!12, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !9, file: !10, line: 242, baseType: !13, size: 16, flags: DIFlagBitField, extraData: i64 0)
!13 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !9, file: !10, line: 245, baseType: !13, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !9, file: !10, line: 252, baseType: !13, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !9, file: !10, line: 257, baseType: !13, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !9, file: !10, line: 265, baseType: !13, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !9, file: !10, line: 277, baseType: !13, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !9, file: !10, line: 291, baseType: !13, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !9, file: !10, line: 298, baseType: !13, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !9, file: !10, line: 305, baseType: !13, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !9, file: !10, line: 310, baseType: !13, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !9, file: !10, line: 321, baseType: !24, size: 320, offset: 64)
!24 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !10, line: 315, size: 320, elements: !25)
!25 = !{!26, !1753, !1755, !1816, !1817}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !24, file: !10, line: 316, baseType: !27, size: 64)
!27 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 64, elements: !47)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !10, line: 183, baseType: !29)
!29 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !10, line: 166, size: 64, elements: !30)
!30 = !{!31, !33, !34, !38, !39, !49, !178, !190, !193, !257, !1731, !1732, !1743, !1750}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !29, file: !10, line: 168, baseType: !32, size: 32)
!32 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !29, file: !10, line: 169, baseType: !13, size: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !29, file: !10, line: 170, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!37 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !29, file: !10, line: 171, baseType: !6, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !29, file: !10, line: 172, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !7, line: 53, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !10, line: 359, size: 128, elements: !43)
!43 = !{!44, !45}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !42, file: !10, line: 360, baseType: !32, size: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !42, file: !10, line: 361, baseType: !46, size: 64, offset: 64)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 64, elements: !47)
!47 = !{!48}
!48 = !DISubrange(count: 1)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !29, file: !10, line: 173, baseType: !50, size: 32)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "machine_mode", file: !51, line: 7, baseType: !13, size: 32, elements: !52)
!51 = !DIFile(filename: "./insn-modes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!52 = !{!53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177}
!53 = !DIEnumerator(name: "VOIDmode", value: 0, isUnsigned: true)
!54 = !DIEnumerator(name: "BLKmode", value: 1, isUnsigned: true)
!55 = !DIEnumerator(name: "CCmode", value: 2, isUnsigned: true)
!56 = !DIEnumerator(name: "CCGCmode", value: 3, isUnsigned: true)
!57 = !DIEnumerator(name: "CCGOCmode", value: 4, isUnsigned: true)
!58 = !DIEnumerator(name: "CCNOmode", value: 5, isUnsigned: true)
!59 = !DIEnumerator(name: "CCAmode", value: 6, isUnsigned: true)
!60 = !DIEnumerator(name: "CCCmode", value: 7, isUnsigned: true)
!61 = !DIEnumerator(name: "CCOmode", value: 8, isUnsigned: true)
!62 = !DIEnumerator(name: "CCSmode", value: 9, isUnsigned: true)
!63 = !DIEnumerator(name: "CCZmode", value: 10, isUnsigned: true)
!64 = !DIEnumerator(name: "CCFPmode", value: 11, isUnsigned: true)
!65 = !DIEnumerator(name: "CCFPUmode", value: 12, isUnsigned: true)
!66 = !DIEnumerator(name: "BImode", value: 13, isUnsigned: true)
!67 = !DIEnumerator(name: "QImode", value: 14, isUnsigned: true)
!68 = !DIEnumerator(name: "HImode", value: 15, isUnsigned: true)
!69 = !DIEnumerator(name: "SImode", value: 16, isUnsigned: true)
!70 = !DIEnumerator(name: "DImode", value: 17, isUnsigned: true)
!71 = !DIEnumerator(name: "TImode", value: 18, isUnsigned: true)
!72 = !DIEnumerator(name: "OImode", value: 19, isUnsigned: true)
!73 = !DIEnumerator(name: "QQmode", value: 20, isUnsigned: true)
!74 = !DIEnumerator(name: "HQmode", value: 21, isUnsigned: true)
!75 = !DIEnumerator(name: "SQmode", value: 22, isUnsigned: true)
!76 = !DIEnumerator(name: "DQmode", value: 23, isUnsigned: true)
!77 = !DIEnumerator(name: "TQmode", value: 24, isUnsigned: true)
!78 = !DIEnumerator(name: "UQQmode", value: 25, isUnsigned: true)
!79 = !DIEnumerator(name: "UHQmode", value: 26, isUnsigned: true)
!80 = !DIEnumerator(name: "USQmode", value: 27, isUnsigned: true)
!81 = !DIEnumerator(name: "UDQmode", value: 28, isUnsigned: true)
!82 = !DIEnumerator(name: "UTQmode", value: 29, isUnsigned: true)
!83 = !DIEnumerator(name: "HAmode", value: 30, isUnsigned: true)
!84 = !DIEnumerator(name: "SAmode", value: 31, isUnsigned: true)
!85 = !DIEnumerator(name: "DAmode", value: 32, isUnsigned: true)
!86 = !DIEnumerator(name: "TAmode", value: 33, isUnsigned: true)
!87 = !DIEnumerator(name: "UHAmode", value: 34, isUnsigned: true)
!88 = !DIEnumerator(name: "USAmode", value: 35, isUnsigned: true)
!89 = !DIEnumerator(name: "UDAmode", value: 36, isUnsigned: true)
!90 = !DIEnumerator(name: "UTAmode", value: 37, isUnsigned: true)
!91 = !DIEnumerator(name: "SFmode", value: 38, isUnsigned: true)
!92 = !DIEnumerator(name: "DFmode", value: 39, isUnsigned: true)
!93 = !DIEnumerator(name: "XFmode", value: 40, isUnsigned: true)
!94 = !DIEnumerator(name: "TFmode", value: 41, isUnsigned: true)
!95 = !DIEnumerator(name: "SDmode", value: 42, isUnsigned: true)
!96 = !DIEnumerator(name: "DDmode", value: 43, isUnsigned: true)
!97 = !DIEnumerator(name: "TDmode", value: 44, isUnsigned: true)
!98 = !DIEnumerator(name: "CQImode", value: 45, isUnsigned: true)
!99 = !DIEnumerator(name: "CHImode", value: 46, isUnsigned: true)
!100 = !DIEnumerator(name: "CSImode", value: 47, isUnsigned: true)
!101 = !DIEnumerator(name: "CDImode", value: 48, isUnsigned: true)
!102 = !DIEnumerator(name: "CTImode", value: 49, isUnsigned: true)
!103 = !DIEnumerator(name: "COImode", value: 50, isUnsigned: true)
!104 = !DIEnumerator(name: "SCmode", value: 51, isUnsigned: true)
!105 = !DIEnumerator(name: "DCmode", value: 52, isUnsigned: true)
!106 = !DIEnumerator(name: "XCmode", value: 53, isUnsigned: true)
!107 = !DIEnumerator(name: "TCmode", value: 54, isUnsigned: true)
!108 = !DIEnumerator(name: "V2QImode", value: 55, isUnsigned: true)
!109 = !DIEnumerator(name: "V4QImode", value: 56, isUnsigned: true)
!110 = !DIEnumerator(name: "V2HImode", value: 57, isUnsigned: true)
!111 = !DIEnumerator(name: "V1SImode", value: 58, isUnsigned: true)
!112 = !DIEnumerator(name: "V8QImode", value: 59, isUnsigned: true)
!113 = !DIEnumerator(name: "V4HImode", value: 60, isUnsigned: true)
!114 = !DIEnumerator(name: "V2SImode", value: 61, isUnsigned: true)
!115 = !DIEnumerator(name: "V1DImode", value: 62, isUnsigned: true)
!116 = !DIEnumerator(name: "V16QImode", value: 63, isUnsigned: true)
!117 = !DIEnumerator(name: "V8HImode", value: 64, isUnsigned: true)
!118 = !DIEnumerator(name: "V4SImode", value: 65, isUnsigned: true)
!119 = !DIEnumerator(name: "V2DImode", value: 66, isUnsigned: true)
!120 = !DIEnumerator(name: "V1TImode", value: 67, isUnsigned: true)
!121 = !DIEnumerator(name: "V32QImode", value: 68, isUnsigned: true)
!122 = !DIEnumerator(name: "V16HImode", value: 69, isUnsigned: true)
!123 = !DIEnumerator(name: "V8SImode", value: 70, isUnsigned: true)
!124 = !DIEnumerator(name: "V4DImode", value: 71, isUnsigned: true)
!125 = !DIEnumerator(name: "V2TImode", value: 72, isUnsigned: true)
!126 = !DIEnumerator(name: "V64QImode", value: 73, isUnsigned: true)
!127 = !DIEnumerator(name: "V32HImode", value: 74, isUnsigned: true)
!128 = !DIEnumerator(name: "V16SImode", value: 75, isUnsigned: true)
!129 = !DIEnumerator(name: "V8DImode", value: 76, isUnsigned: true)
!130 = !DIEnumerator(name: "V4TImode", value: 77, isUnsigned: true)
!131 = !DIEnumerator(name: "V2SFmode", value: 78, isUnsigned: true)
!132 = !DIEnumerator(name: "V4SFmode", value: 79, isUnsigned: true)
!133 = !DIEnumerator(name: "V2DFmode", value: 80, isUnsigned: true)
!134 = !DIEnumerator(name: "V8SFmode", value: 81, isUnsigned: true)
!135 = !DIEnumerator(name: "V4DFmode", value: 82, isUnsigned: true)
!136 = !DIEnumerator(name: "V2TFmode", value: 83, isUnsigned: true)
!137 = !DIEnumerator(name: "V16SFmode", value: 84, isUnsigned: true)
!138 = !DIEnumerator(name: "V8DFmode", value: 85, isUnsigned: true)
!139 = !DIEnumerator(name: "V4TFmode", value: 86, isUnsigned: true)
!140 = !DIEnumerator(name: "MAX_MACHINE_MODE", value: 87, isUnsigned: true)
!141 = !DIEnumerator(name: "MIN_MODE_RANDOM", value: 0, isUnsigned: true)
!142 = !DIEnumerator(name: "MAX_MODE_RANDOM", value: 1, isUnsigned: true)
!143 = !DIEnumerator(name: "MIN_MODE_CC", value: 2, isUnsigned: true)
!144 = !DIEnumerator(name: "MAX_MODE_CC", value: 12, isUnsigned: true)
!145 = !DIEnumerator(name: "MIN_MODE_INT", value: 14, isUnsigned: true)
!146 = !DIEnumerator(name: "MAX_MODE_INT", value: 19, isUnsigned: true)
!147 = !DIEnumerator(name: "MIN_MODE_PARTIAL_INT", value: 0, isUnsigned: true)
!148 = !DIEnumerator(name: "MAX_MODE_PARTIAL_INT", value: 0, isUnsigned: true)
!149 = !DIEnumerator(name: "MIN_MODE_FRACT", value: 20, isUnsigned: true)
!150 = !DIEnumerator(name: "MAX_MODE_FRACT", value: 24, isUnsigned: true)
!151 = !DIEnumerator(name: "MIN_MODE_UFRACT", value: 25, isUnsigned: true)
!152 = !DIEnumerator(name: "MAX_MODE_UFRACT", value: 29, isUnsigned: true)
!153 = !DIEnumerator(name: "MIN_MODE_ACCUM", value: 30, isUnsigned: true)
!154 = !DIEnumerator(name: "MAX_MODE_ACCUM", value: 33, isUnsigned: true)
!155 = !DIEnumerator(name: "MIN_MODE_UACCUM", value: 34, isUnsigned: true)
!156 = !DIEnumerator(name: "MAX_MODE_UACCUM", value: 37, isUnsigned: true)
!157 = !DIEnumerator(name: "MIN_MODE_FLOAT", value: 38, isUnsigned: true)
!158 = !DIEnumerator(name: "MAX_MODE_FLOAT", value: 41, isUnsigned: true)
!159 = !DIEnumerator(name: "MIN_MODE_DECIMAL_FLOAT", value: 42, isUnsigned: true)
!160 = !DIEnumerator(name: "MAX_MODE_DECIMAL_FLOAT", value: 44, isUnsigned: true)
!161 = !DIEnumerator(name: "MIN_MODE_COMPLEX_INT", value: 45, isUnsigned: true)
!162 = !DIEnumerator(name: "MAX_MODE_COMPLEX_INT", value: 50, isUnsigned: true)
!163 = !DIEnumerator(name: "MIN_MODE_COMPLEX_FLOAT", value: 51, isUnsigned: true)
!164 = !DIEnumerator(name: "MAX_MODE_COMPLEX_FLOAT", value: 54, isUnsigned: true)
!165 = !DIEnumerator(name: "MIN_MODE_VECTOR_INT", value: 55, isUnsigned: true)
!166 = !DIEnumerator(name: "MAX_MODE_VECTOR_INT", value: 77, isUnsigned: true)
!167 = !DIEnumerator(name: "MIN_MODE_VECTOR_FRACT", value: 0, isUnsigned: true)
!168 = !DIEnumerator(name: "MAX_MODE_VECTOR_FRACT", value: 0, isUnsigned: true)
!169 = !DIEnumerator(name: "MIN_MODE_VECTOR_UFRACT", value: 0, isUnsigned: true)
!170 = !DIEnumerator(name: "MAX_MODE_VECTOR_UFRACT", value: 0, isUnsigned: true)
!171 = !DIEnumerator(name: "MIN_MODE_VECTOR_ACCUM", value: 0, isUnsigned: true)
!172 = !DIEnumerator(name: "MAX_MODE_VECTOR_ACCUM", value: 0, isUnsigned: true)
!173 = !DIEnumerator(name: "MIN_MODE_VECTOR_UACCUM", value: 0, isUnsigned: true)
!174 = !DIEnumerator(name: "MAX_MODE_VECTOR_UACCUM", value: 0, isUnsigned: true)
!175 = !DIEnumerator(name: "MIN_MODE_VECTOR_FLOAT", value: 78, isUnsigned: true)
!176 = !DIEnumerator(name: "MAX_MODE_VECTOR_FLOAT", value: 86, isUnsigned: true)
!177 = !DIEnumerator(name: "NUM_MACHINE_MODES", value: 87, isUnsigned: true)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !29, file: !10, line: 174, baseType: !179, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !10, line: 133, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !10, line: 115, size: 32, elements: !181)
!181 = !{!182, !183, !184, !185, !186, !187, !188, !189}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !180, file: !10, line: 118, baseType: !13, size: 8, flags: DIFlagBitField, extraData: i64 0)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !180, file: !10, line: 120, baseType: !13, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !180, file: !10, line: 121, baseType: !13, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !180, file: !10, line: 123, baseType: !13, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !180, file: !10, line: 125, baseType: !13, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !180, file: !10, line: 127, baseType: !13, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !180, file: !10, line: 130, baseType: !13, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !180, file: !10, line: 132, baseType: !13, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !29, file: !10, line: 175, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !10, line: 175, flags: DIFlagFwdDecl)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !29, file: !10, line: 176, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !196, line: 75, size: 256, elements: !197)
!196 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!197 = !{!198, !213, !214, !215}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !195, file: !196, line: 76, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !196, line: 68, baseType: !201)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !196, line: 63, size: 320, elements: !202)
!202 = !{!203, !205, !206, !207}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !201, file: !196, line: 64, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !201, file: !196, line: 65, baseType: !204, size: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !201, file: !196, line: 66, baseType: !13, size: 32, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !201, file: !196, line: 67, baseType: !208, size: 128, offset: 192)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 128, elements: !211)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !196, line: 29, baseType: !210)
!210 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!211 = !{!212}
!212 = !DISubrange(count: 2)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !195, file: !196, line: 77, baseType: !199, size: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !195, file: !196, line: 78, baseType: !13, size: 32, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !195, file: !196, line: 79, baseType: !216, size: 64, offset: 192)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !196, line: 49, baseType: !218)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !196, line: 45, size: 832, elements: !219)
!219 = !{!220, !221, !222}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !218, file: !196, line: 46, baseType: !204, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !218, file: !196, line: 47, baseType: !194, size: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !218, file: !196, line: 48, baseType: !223, size: 704, offset: 128)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !224, line: 164, size: 704, elements: !225)
!224 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!225 = !{!226, !228, !239, !240, !241, !242, !243, !244, !249, !253, !254, !255, !256}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !223, file: !224, line: 166, baseType: !227, size: 64)
!227 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !223, file: !224, line: 167, baseType: !229, size: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !224, line: 157, size: 192, elements: !231)
!231 = !{!232, !234, !235}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !230, file: !224, line: 159, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !230, file: !224, line: 160, baseType: !229, size: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !230, file: !224, line: 161, baseType: !236, size: 32, offset: 128)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 32, elements: !237)
!237 = !{!238}
!238 = !DISubrange(count: 4)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !223, file: !224, line: 168, baseType: !233, size: 64, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !223, file: !224, line: 169, baseType: !233, size: 64, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !223, file: !224, line: 170, baseType: !233, size: 64, offset: 256)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !223, file: !224, line: 171, baseType: !227, size: 64, offset: 320)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !223, file: !224, line: 172, baseType: !32, size: 32, offset: 384)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !223, file: !224, line: 176, baseType: !245, size: 64, offset: 448)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{!229, !248, !227}
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !223, file: !224, line: 177, baseType: !250, size: 64, offset: 512)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{null, !248, !229}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !223, file: !224, line: 178, baseType: !248, size: 64, offset: 576)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !223, file: !224, line: 179, baseType: !13, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !223, file: !224, line: 180, baseType: !13, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !223, file: !224, line: 184, baseType: !13, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !29, file: !10, line: 177, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !7, line: 56, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !261, line: 3371, size: 1792, elements: !262)
!261 = !DIFile(filename: "./tree.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!262 = !{!263, !296, !302, !313, !332, !343, !348, !355, !361, !375, !387, !425, !430, !458, !475, !476, !481, !490, !496, !501, !505, !509, !1348, !1397, !1403, !1409, !1416, !1429, !1443, !1460, !1472, !1494, !1541, !1713}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !260, file: !261, line: 3372, baseType: !264, size: 64)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !261, line: 360, size: 64, elements: !265)
!265 = !{!266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !264, file: !261, line: 361, baseType: !13, size: 16, flags: DIFlagBitField, extraData: i64 0)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !264, file: !261, line: 363, baseType: !13, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !264, file: !261, line: 364, baseType: !13, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !264, file: !261, line: 365, baseType: !13, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !264, file: !261, line: 366, baseType: !13, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !264, file: !261, line: 367, baseType: !13, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !264, file: !261, line: 368, baseType: !13, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !264, file: !261, line: 369, baseType: !13, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !264, file: !261, line: 370, baseType: !13, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !264, file: !261, line: 372, baseType: !13, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !264, file: !261, line: 373, baseType: !13, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !264, file: !261, line: 374, baseType: !13, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !264, file: !261, line: 375, baseType: !13, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !264, file: !261, line: 376, baseType: !13, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !264, file: !261, line: 377, baseType: !13, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !264, file: !261, line: 378, baseType: !13, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !264, file: !261, line: 379, baseType: !13, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !264, file: !261, line: 381, baseType: !13, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !264, file: !261, line: 382, baseType: !13, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !264, file: !261, line: 383, baseType: !13, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !264, file: !261, line: 384, baseType: !13, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !264, file: !261, line: 385, baseType: !13, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !264, file: !261, line: 386, baseType: !13, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !264, file: !261, line: 387, baseType: !13, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !264, file: !261, line: 388, baseType: !13, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !264, file: !261, line: 390, baseType: !13, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !264, file: !261, line: 391, baseType: !13, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !264, file: !261, line: 392, baseType: !13, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !264, file: !261, line: 394, baseType: !13, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !264, file: !261, line: 399, baseType: !13, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !260, file: !261, line: 3373, baseType: !297, size: 192)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !261, line: 402, size: 192, elements: !298)
!298 = !{!299, !300, !301}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !297, file: !261, line: 403, baseType: !264, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !297, file: !261, line: 404, baseType: !258, size: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !297, file: !261, line: 405, baseType: !258, size: 64, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !260, file: !261, line: 3374, baseType: !303, size: 320)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !261, line: 1384, size: 320, elements: !304)
!304 = !{!305, !306}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !303, file: !261, line: 1385, baseType: !297, size: 192)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !303, file: !261, line: 1386, baseType: !307, size: 128, offset: 192)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !308, line: 58, baseType: !309)
!308 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !308, line: 54, size: 128, elements: !310)
!310 = !{!311, !312}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !309, file: !308, line: 56, baseType: !210, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !309, file: !308, line: 57, baseType: !227, size: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !260, file: !261, line: 3375, baseType: !314, size: 256)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !261, line: 1397, size: 256, elements: !315)
!315 = !{!316, !317}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !314, file: !261, line: 1398, baseType: !297, size: 192)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !314, file: !261, line: 1399, baseType: !318, size: 64, offset: 192)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !320, line: 52, size: 256, elements: !321)
!320 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!321 = !{!322, !323, !324, !325, !326, !327, !328}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !319, file: !320, line: 56, baseType: !13, size: 2, flags: DIFlagBitField, extraData: i64 0)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !319, file: !320, line: 57, baseType: !13, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !319, file: !320, line: 58, baseType: !13, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !319, file: !320, line: 59, baseType: !13, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !319, file: !320, line: 60, baseType: !13, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !319, file: !320, line: 61, baseType: !13, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !319, file: !320, line: 62, baseType: !329, size: 192, offset: 64)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 192, elements: !330)
!330 = !{!331}
!331 = !DISubrange(count: 3)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !260, file: !261, line: 3376, baseType: !333, size: 256)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !261, line: 1408, size: 256, elements: !334)
!334 = !{!335, !336}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !333, file: !261, line: 1409, baseType: !297, size: 192)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !333, file: !261, line: 1410, baseType: !337, size: 64, offset: 192)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !339, line: 27, size: 192, elements: !340)
!339 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!340 = !{!341, !342}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !338, file: !339, line: 29, baseType: !307, size: 128)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !338, file: !339, line: 30, baseType: !50, size: 32, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !260, file: !261, line: 3377, baseType: !344, size: 256)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !261, line: 1437, size: 256, elements: !345)
!345 = !{!346, !347}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !344, file: !261, line: 1438, baseType: !297, size: 192)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !344, file: !261, line: 1439, baseType: !258, size: 64, offset: 192)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !260, file: !261, line: 3378, baseType: !349, size: 256)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !261, line: 1418, size: 256, elements: !350)
!350 = !{!351, !352, !353}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !349, file: !261, line: 1419, baseType: !297, size: 192)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !349, file: !261, line: 1420, baseType: !32, size: 32, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !349, file: !261, line: 1421, baseType: !354, size: 8, offset: 224)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 8, elements: !47)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !260, file: !261, line: 3379, baseType: !356, size: 320)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !261, line: 1428, size: 320, elements: !357)
!357 = !{!358, !359, !360}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !356, file: !261, line: 1429, baseType: !297, size: 192)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !356, file: !261, line: 1430, baseType: !258, size: 64, offset: 192)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !356, file: !261, line: 1431, baseType: !258, size: 64, offset: 256)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !260, file: !261, line: 3380, baseType: !362, size: 320)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !261, line: 1460, size: 320, elements: !363)
!363 = !{!364, !365}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !362, file: !261, line: 1461, baseType: !297, size: 192)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !362, file: !261, line: 1462, baseType: !366, size: 128, offset: 192)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !367, line: 31, size: 128, elements: !368)
!367 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!368 = !{!369, !373, !374}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !366, file: !367, line: 32, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !372)
!372 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !366, file: !367, line: 33, baseType: !13, size: 32, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !366, file: !367, line: 34, baseType: !13, size: 32, offset: 96)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !260, file: !261, line: 3381, baseType: !376, size: 384)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !261, line: 2507, size: 384, elements: !377)
!377 = !{!378, !379, !384, !385, !386}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !376, file: !261, line: 2508, baseType: !297, size: 192)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !376, file: !261, line: 2509, baseType: !380, size: 32, offset: 192)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !381, line: 58, baseType: !382)
!381 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !383, line: 44, baseType: !13)
!383 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!384 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !376, file: !261, line: 2510, baseType: !13, size: 32, offset: 224)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !376, file: !261, line: 2511, baseType: !258, size: 64, offset: 256)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !376, file: !261, line: 2512, baseType: !258, size: 64, offset: 320)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !260, file: !261, line: 3382, baseType: !388, size: 896)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !261, line: 2652, size: 896, elements: !389)
!389 = !{!390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !388, file: !261, line: 2653, baseType: !376, size: 384)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !388, file: !261, line: 2654, baseType: !258, size: 64, offset: 384)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !388, file: !261, line: 2656, baseType: !13, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !388, file: !261, line: 2658, baseType: !13, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !388, file: !261, line: 2659, baseType: !13, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !388, file: !261, line: 2660, baseType: !13, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !388, file: !261, line: 2661, baseType: !13, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !388, file: !261, line: 2662, baseType: !13, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !388, file: !261, line: 2663, baseType: !13, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !388, file: !261, line: 2664, baseType: !13, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !388, file: !261, line: 2666, baseType: !13, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !388, file: !261, line: 2667, baseType: !13, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !388, file: !261, line: 2668, baseType: !13, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !388, file: !261, line: 2669, baseType: !13, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !388, file: !261, line: 2670, baseType: !13, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !388, file: !261, line: 2671, baseType: !13, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !388, file: !261, line: 2672, baseType: !13, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !388, file: !261, line: 2673, baseType: !13, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !388, file: !261, line: 2674, baseType: !13, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !388, file: !261, line: 2678, baseType: !13, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !388, file: !261, line: 2682, baseType: !13, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !388, file: !261, line: 2685, baseType: !13, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !388, file: !261, line: 2688, baseType: !13, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !388, file: !261, line: 2690, baseType: !13, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !388, file: !261, line: 2692, baseType: !13, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !388, file: !261, line: 2695, baseType: !13, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !388, file: !261, line: 2698, baseType: !13, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !388, file: !261, line: 2703, baseType: !13, size: 32, offset: 512)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !388, file: !261, line: 2705, baseType: !258, size: 64, offset: 576)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !388, file: !261, line: 2706, baseType: !258, size: 64, offset: 640)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !388, file: !261, line: 2707, baseType: !258, size: 64, offset: 704)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !388, file: !261, line: 2708, baseType: !258, size: 64, offset: 768)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !388, file: !261, line: 2711, baseType: !423, size: 64, offset: 832)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !261, line: 2711, flags: DIFlagFwdDecl)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !260, file: !261, line: 3383, baseType: !426, size: 960)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !261, line: 2756, size: 960, elements: !427)
!427 = !{!428, !429}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !426, file: !261, line: 2757, baseType: !388, size: 896)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !426, file: !261, line: 2758, baseType: !6, size: 64, offset: 896)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !260, file: !261, line: 3384, baseType: !431, size: 1472)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !261, line: 3114, size: 1472, elements: !432)
!432 = !{!433, !454, !455, !456, !457}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !431, file: !261, line: 3115, baseType: !434, size: 1216)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !261, line: 2984, size: 1216, elements: !435)
!435 = !{!436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !434, file: !261, line: 2985, baseType: !426, size: 960)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !434, file: !261, line: 2986, baseType: !258, size: 64, offset: 960)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !434, file: !261, line: 2987, baseType: !258, size: 64, offset: 1024)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !434, file: !261, line: 2988, baseType: !258, size: 64, offset: 1088)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !434, file: !261, line: 2991, baseType: !13, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !434, file: !261, line: 2992, baseType: !13, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !434, file: !261, line: 2993, baseType: !13, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !434, file: !261, line: 2994, baseType: !13, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !434, file: !261, line: 2995, baseType: !13, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !434, file: !261, line: 2996, baseType: !13, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !434, file: !261, line: 2998, baseType: !13, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !434, file: !261, line: 3000, baseType: !13, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !434, file: !261, line: 3002, baseType: !13, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !434, file: !261, line: 3003, baseType: !13, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !434, file: !261, line: 3004, baseType: !13, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !434, file: !261, line: 3005, baseType: !13, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !434, file: !261, line: 3007, baseType: !13, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !434, file: !261, line: 3010, baseType: !13, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !431, file: !261, line: 3117, baseType: !258, size: 64, offset: 1216)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !431, file: !261, line: 3119, baseType: !258, size: 64, offset: 1280)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !431, file: !261, line: 3121, baseType: !258, size: 64, offset: 1344)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !431, file: !261, line: 3123, baseType: !258, size: 64, offset: 1408)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !260, file: !261, line: 3385, baseType: !459, size: 1088)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !261, line: 2874, size: 1088, elements: !460)
!460 = !{!461, !462, !463}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !459, file: !261, line: 2875, baseType: !426, size: 960)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !459, file: !261, line: 2876, baseType: !6, size: 64, offset: 960)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !459, file: !261, line: 2877, baseType: !464, size: 64, offset: 1024)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !466, line: 172, size: 128, elements: !467)
!466 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!467 = !{!468, !469, !470, !471, !472, !473, !474}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !465, file: !466, line: 174, baseType: !13, size: 1, flags: DIFlagBitField, extraData: i64 0)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !465, file: !466, line: 178, baseType: !13, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !465, file: !466, line: 183, baseType: !13, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !465, file: !466, line: 187, baseType: !13, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !465, file: !466, line: 192, baseType: !13, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !465, file: !466, line: 195, baseType: !13, size: 32, offset: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !465, file: !466, line: 199, baseType: !258, size: 64, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !260, file: !261, line: 3386, baseType: !434, size: 1216)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !260, file: !261, line: 3387, baseType: !477, size: 1280)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !261, line: 3093, size: 1280, elements: !478)
!478 = !{!479, !480}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !477, file: !261, line: 3094, baseType: !434, size: 1216)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !477, file: !261, line: 3095, baseType: !464, size: 64, offset: 1216)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !260, file: !261, line: 3388, baseType: !482, size: 1216)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !261, line: 2824, size: 1216, elements: !483)
!483 = !{!484, !485, !486, !487, !488, !489}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !482, file: !261, line: 2825, baseType: !388, size: 896)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !482, file: !261, line: 2827, baseType: !258, size: 64, offset: 896)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !482, file: !261, line: 2828, baseType: !258, size: 64, offset: 960)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !482, file: !261, line: 2829, baseType: !258, size: 64, offset: 1024)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !482, file: !261, line: 2830, baseType: !258, size: 64, offset: 1088)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !482, file: !261, line: 2831, baseType: !258, size: 64, offset: 1152)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !260, file: !261, line: 3389, baseType: !491, size: 1024)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !261, line: 2850, size: 1024, elements: !492)
!492 = !{!493, !494, !495}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !491, file: !261, line: 2851, baseType: !426, size: 960)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !491, file: !261, line: 2852, baseType: !32, size: 32, offset: 960)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !491, file: !261, line: 2853, baseType: !32, size: 32, offset: 992)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !260, file: !261, line: 3390, baseType: !497, size: 1024)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !261, line: 2857, size: 1024, elements: !498)
!498 = !{!499, !500}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !497, file: !261, line: 2858, baseType: !426, size: 960)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !497, file: !261, line: 2859, baseType: !464, size: 64, offset: 960)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !260, file: !261, line: 3391, baseType: !502, size: 960)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !261, line: 2862, size: 960, elements: !503)
!503 = !{!504}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !502, file: !261, line: 2863, baseType: !426, size: 960)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !260, file: !261, line: 3392, baseType: !506, size: 1472)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !261, line: 3304, size: 1472, elements: !507)
!507 = !{!508}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !506, file: !261, line: 3305, baseType: !431, size: 1472)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !260, file: !261, line: 3393, baseType: !510, size: 1792)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !261, line: 3248, size: 1792, elements: !511)
!511 = !{!512, !513, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !510, file: !261, line: 3249, baseType: !431, size: 1472)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !510, file: !261, line: 3251, baseType: !514, size: 64, offset: 1472)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !516, line: 463, size: 1152, elements: !517)
!516 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!517 = !{!518, !689, !1207, !1208, !1263, !1266, !1267, !1268, !1269, !1270, !1271, !1300, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !515, file: !516, line: 464, baseType: !519, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !521, line: 194, size: 384, elements: !522)
!521 = !DIFile(filename: "./except.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!522 = !{!523, !578, !591, !605, !657, !670}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !520, file: !521, line: 197, baseType: !524, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !521, line: 182, baseType: !525)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !521, line: 116, size: 704, elements: !527)
!527 = !{!528, !529, !530, !531, !532, !539, !566, !575, !576, !577}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !526, file: !521, line: 119, baseType: !525, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !526, file: !521, line: 122, baseType: !525, size: 64, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !526, file: !521, line: 123, baseType: !525, size: 64, offset: 128)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !526, file: !521, line: 126, baseType: !32, size: 32, offset: 192)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !526, file: !521, line: 129, baseType: !533, size: 32, offset: 224)
!533 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eh_region_type", file: !521, line: 30, baseType: !13, size: 32, elements: !534)
!534 = !{!535, !536, !537, !538}
!535 = !DIEnumerator(name: "ERT_CLEANUP", value: 0, isUnsigned: true)
!536 = !DIEnumerator(name: "ERT_TRY", value: 1, isUnsigned: true)
!537 = !DIEnumerator(name: "ERT_ALLOWED_EXCEPTIONS", value: 2, isUnsigned: true)
!538 = !DIEnumerator(name: "ERT_MUST_NOT_THROW", value: 3, isUnsigned: true)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !526, file: !521, line: 165, baseType: !540, size: 192, offset: 256)
!540 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !521, line: 132, size: 192, elements: !541)
!541 = !{!542, !555, !561}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !540, file: !521, line: 137, baseType: !543, size: 128)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !521, line: 133, size: 128, elements: !544)
!544 = !{!545, !554}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !543, file: !521, line: 135, baseType: !546, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !521, line: 93, size: 320, elements: !548)
!548 = !{!549, !550, !551, !552, !553}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !547, file: !521, line: 96, baseType: !546, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !547, file: !521, line: 97, baseType: !546, size: 64, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !547, file: !521, line: 101, baseType: !258, size: 64, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !547, file: !521, line: 106, baseType: !258, size: 64, offset: 192)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !547, file: !521, line: 111, baseType: !258, size: 64, offset: 256)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !543, file: !521, line: 136, baseType: !546, size: 64, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !540, file: !521, line: 151, baseType: !556, size: 192)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !521, line: 139, size: 192, elements: !557)
!557 = !{!558, !559, !560}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !556, file: !521, line: 141, baseType: !258, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !556, file: !521, line: 145, baseType: !258, size: 64, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !556, file: !521, line: 150, baseType: !32, size: 32, offset: 128)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !540, file: !521, line: 164, baseType: !562, size: 128)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !521, line: 153, size: 128, elements: !563)
!563 = !{!564, !565}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !562, file: !521, line: 161, baseType: !258, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !562, file: !521, line: 163, baseType: !380, size: 32, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !526, file: !521, line: 168, baseType: !567, size: 64, offset: 448)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !521, line: 67, size: 320, elements: !569)
!569 = !{!570, !571, !572, !573, !574}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !568, file: !521, line: 70, baseType: !567, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !568, file: !521, line: 73, baseType: !525, size: 64, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !568, file: !521, line: 78, baseType: !258, size: 64, offset: 128)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !568, file: !521, line: 85, baseType: !6, size: 64, offset: 192)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !568, file: !521, line: 88, baseType: !32, size: 32, offset: 256)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !526, file: !521, line: 173, baseType: !6, size: 64, offset: 512)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !526, file: !521, line: 173, baseType: !6, size: 64, offset: 576)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !526, file: !521, line: 177, baseType: !372, size: 8, offset: 640)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !520, file: !521, line: 200, baseType: !579, size: 64, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !521, line: 185, baseType: !581)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !521, line: 185, size: 128, elements: !582)
!582 = !{!583}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !581, file: !521, line: 185, baseType: !584, size: 128)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !521, line: 184, baseType: !585)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !521, line: 184, size: 128, elements: !586)
!586 = !{!587, !588, !589}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !585, file: !521, line: 184, baseType: !13, size: 32)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !585, file: !521, line: 184, baseType: !13, size: 32, offset: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !585, file: !521, line: 184, baseType: !590, size: 64, offset: 64)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !524, size: 64, elements: !47)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !520, file: !521, line: 203, baseType: !592, size: 64, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !521, line: 189, baseType: !594)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !521, line: 189, size: 128, elements: !595)
!595 = !{!596}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !594, file: !521, line: 189, baseType: !597, size: 128)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !521, line: 188, baseType: !598)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !521, line: 188, size: 128, elements: !599)
!599 = !{!600, !601, !602}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !598, file: !521, line: 188, baseType: !13, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !598, file: !521, line: 188, baseType: !13, size: 32, offset: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !598, file: !521, line: 188, baseType: !603, size: 64, offset: 64)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !604, size: 64, elements: !47)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !521, line: 180, baseType: !567)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !520, file: !521, line: 207, baseType: !606, size: 64, offset: 192)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !607, line: 144, baseType: !608)
!607 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !607, line: 100, size: 896, elements: !610)
!610 = !{!611, !619, !624, !629, !631, !634, !635, !636, !637, !638, !643, !645, !646, !651, !656}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !609, file: !607, line: 102, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !607, line: 52, baseType: !613)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{!616, !617}
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !607, line: 47, baseType: !13)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !609, file: !607, line: 105, baseType: !620, size: 64, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !607, line: 59, baseType: !621)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DISubroutineType(types: !623)
!623 = !{!32, !617, !617}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !609, file: !607, line: 108, baseType: !625, size: 64, offset: 128)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !607, line: 63, baseType: !626)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DISubroutineType(types: !628)
!628 = !{null, !248}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !609, file: !607, line: 111, baseType: !630, size: 64, offset: 192)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !609, file: !607, line: 114, baseType: !632, size: 64, offset: 256)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !633, line: 46, baseType: !210)
!633 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!634 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !609, file: !607, line: 117, baseType: !632, size: 64, offset: 320)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !609, file: !607, line: 120, baseType: !632, size: 64, offset: 384)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !609, file: !607, line: 124, baseType: !13, size: 32, offset: 448)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !609, file: !607, line: 128, baseType: !13, size: 32, offset: 480)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !609, file: !607, line: 131, baseType: !639, size: 64, offset: 512)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !607, line: 75, baseType: !640)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DISubroutineType(types: !642)
!642 = !{!248, !632, !632}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !609, file: !607, line: 132, baseType: !644, size: 64, offset: 576)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !607, line: 78, baseType: !626)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !609, file: !607, line: 135, baseType: !248, size: 64, offset: 640)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !609, file: !607, line: 136, baseType: !647, size: 64, offset: 704)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !607, line: 82, baseType: !648)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{!248, !248, !632, !632}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !609, file: !607, line: 137, baseType: !652, size: 64, offset: 768)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !607, line: 83, baseType: !653)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DISubroutineType(types: !655)
!655 = !{null, !248, !248}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !609, file: !607, line: 141, baseType: !13, size: 32, offset: 832)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !520, file: !521, line: 211, baseType: !658, size: 64, offset: 256)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !261, line: 183, baseType: !660)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !261, line: 183, size: 128, elements: !661)
!661 = !{!662}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !660, file: !261, line: 183, baseType: !663, size: 128)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !261, line: 182, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !261, line: 182, size: 128, elements: !665)
!665 = !{!666, !667, !668}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !664, file: !261, line: 182, baseType: !13, size: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !664, file: !261, line: 182, baseType: !13, size: 32, offset: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !664, file: !261, line: 182, baseType: !669, size: 64, offset: 64)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !258, size: 64, elements: !47)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !520, file: !521, line: 220, baseType: !671, size: 64, offset: 320)
!671 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !521, line: 217, size: 64, elements: !672)
!672 = !{!673, !674}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !671, file: !521, line: 218, baseType: !658, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !671, file: !521, line: 219, baseType: !675, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !677, line: 29, baseType: !678)
!677 = !DIFile(filename: "./vecprim.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !677, line: 29, size: 96, elements: !679)
!679 = !{!680}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !678, file: !677, line: 29, baseType: !681, size: 96)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !677, line: 27, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !677, line: 27, size: 96, elements: !683)
!683 = !{!684, !685, !686}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !682, file: !677, line: 27, baseType: !13, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !682, file: !677, line: 27, baseType: !13, size: 32, offset: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !682, file: !677, line: 27, baseType: !687, size: 8, offset: 64)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !688, size: 8, elements: !47)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !677, line: 26, baseType: !372)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !515, file: !516, line: 467, baseType: !690, size: 64, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !692, line: 374, size: 640, elements: !693)
!692 = !DIFile(filename: "./basic-block.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!693 = !{!694, !1172, !1173, !1186, !1187, !1188, !1189, !1190, !1196, !1203, !1205, !1206}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !691, file: !692, line: 377, baseType: !695, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !7, line: 111, baseType: !696)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !692, line: 217, size: 832, elements: !698)
!698 = !{!699, !1137, !1138, !1139, !1142, !1146, !1147, !1148, !1166, !1167, !1168, !1169, !1170, !1171}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !697, file: !692, line: 219, baseType: !700, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !692, line: 151, baseType: !702)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !692, line: 151, size: 128, elements: !703)
!703 = !{!704}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !702, file: !692, line: 151, baseType: !705, size: 128)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !692, line: 150, baseType: !706)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !692, line: 150, size: 128, elements: !707)
!707 = !{!708, !709, !710}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !706, file: !692, line: 150, baseType: !13, size: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !706, file: !692, line: 150, baseType: !13, size: 32, offset: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !706, file: !692, line: 150, baseType: !711, size: 64, offset: 64)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !712, size: 64, elements: !47)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !7, line: 108, baseType: !713)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !692, line: 122, size: 512, elements: !715)
!715 = !{!716, !717, !718, !1129, !1130, !1131, !1132, !1133, !1134, !1135}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !714, file: !692, line: 124, baseType: !696, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !714, file: !692, line: 125, baseType: !696, size: 64, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !714, file: !692, line: 131, baseType: !719, size: 64, offset: 128)
!719 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !692, line: 128, size: 64, elements: !720)
!720 = !{!721, !1128}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !719, file: !692, line: 129, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !7, line: 66, baseType: !723)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !725, line: 143, size: 192, elements: !726)
!725 = !DIFile(filename: "./gimple.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!726 = !{!727, !1126, !1127}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !724, file: !725, line: 145, baseType: !728, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !7, line: 69, baseType: !729)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !725, line: 136, size: 192, elements: !731)
!731 = !{!732, !1124, !1125}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !730, file: !725, line: 137, baseType: !733, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !7, line: 58, baseType: !734)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !725, line: 737, size: 768, elements: !736)
!736 = !{!737, !754, !787, !793, !798, !803, !810, !816, !822, !827, !841, !846, !852, !857, !867, !872, !1082, !1089, !1096, !1102, !1107, !1113, !1119}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !735, file: !725, line: 738, baseType: !738, size: 256)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !725, line: 271, size: 256, elements: !739)
!739 = !{!740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !738, file: !725, line: 274, baseType: !13, size: 8, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !738, file: !725, line: 277, baseType: !13, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !738, file: !725, line: 281, baseType: !13, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !738, file: !725, line: 284, baseType: !13, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !738, file: !725, line: 291, baseType: !13, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !738, file: !725, line: 295, baseType: !13, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !738, file: !725, line: 298, baseType: !13, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !738, file: !725, line: 301, baseType: !13, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !738, file: !725, line: 307, baseType: !13, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !738, file: !725, line: 312, baseType: !13, size: 32, offset: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !738, file: !725, line: 316, baseType: !380, size: 32, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !738, file: !725, line: 319, baseType: !13, size: 32, offset: 96)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !738, file: !725, line: 323, baseType: !696, size: 64, offset: 128)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !738, file: !725, line: 327, baseType: !258, size: 64, offset: 192)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !735, file: !725, line: 739, baseType: !755, size: 448)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !725, line: 350, size: 448, elements: !756)
!756 = !{!757, !786}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !755, file: !725, line: 353, baseType: !758, size: 384)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !725, line: 333, size: 384, elements: !759)
!759 = !{!760, !761, !769}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !758, file: !725, line: 336, baseType: !738, size: 256)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !758, file: !725, line: 343, baseType: !762, size: 64, offset: 256)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !764, line: 37, size: 128, elements: !765)
!764 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!765 = !{!766, !767}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !763, file: !764, line: 39, baseType: !762, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !763, file: !764, line: 40, baseType: !768, size: 64, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !758, file: !725, line: 344, baseType: !770, size: 64, offset: 320)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !764, line: 45, size: 320, elements: !772)
!772 = !{!773, !774}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !771, file: !764, line: 47, baseType: !770, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !771, file: !764, line: 48, baseType: !775, size: 256, offset: 64)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !261, line: 1883, size: 256, elements: !776)
!776 = !{!777, !779, !780, !785}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !775, file: !261, line: 1884, baseType: !778, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !775, file: !261, line: 1885, baseType: !778, size: 64, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !775, file: !261, line: 1891, baseType: !781, size: 64, offset: 128)
!781 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !775, file: !261, line: 1891, size: 64, elements: !782)
!782 = !{!783, !784}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !781, file: !261, line: 1891, baseType: !733, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !781, file: !261, line: 1891, baseType: !258, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !775, file: !261, line: 1892, baseType: !768, size: 64, offset: 192)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !755, file: !725, line: 359, baseType: !669, size: 64, offset: 384)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !735, file: !725, line: 740, baseType: !788, size: 512)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !725, line: 365, size: 512, elements: !789)
!789 = !{!790, !791, !792}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !788, file: !725, line: 368, baseType: !758, size: 384)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !788, file: !725, line: 373, baseType: !258, size: 64, offset: 384)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !788, file: !725, line: 374, baseType: !258, size: 64, offset: 448)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !735, file: !725, line: 741, baseType: !794, size: 576)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !725, line: 380, size: 576, elements: !795)
!795 = !{!796, !797}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !794, file: !725, line: 383, baseType: !788, size: 512)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !794, file: !725, line: 389, baseType: !669, size: 64, offset: 512)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !735, file: !725, line: 742, baseType: !799, size: 320)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !725, line: 395, size: 320, elements: !800)
!800 = !{!801, !802}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !799, file: !725, line: 397, baseType: !738, size: 256)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !799, file: !725, line: 400, baseType: !722, size: 64, offset: 256)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !735, file: !725, line: 743, baseType: !804, size: 448)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !725, line: 406, size: 448, elements: !805)
!805 = !{!806, !807, !808, !809}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !804, file: !725, line: 408, baseType: !738, size: 256)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !804, file: !725, line: 412, baseType: !258, size: 64, offset: 256)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !804, file: !725, line: 420, baseType: !258, size: 64, offset: 320)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !804, file: !725, line: 423, baseType: !722, size: 64, offset: 384)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !735, file: !725, line: 744, baseType: !811, size: 384)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !725, line: 429, size: 384, elements: !812)
!812 = !{!813, !814, !815}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !811, file: !725, line: 431, baseType: !738, size: 256)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !811, file: !725, line: 434, baseType: !258, size: 64, offset: 256)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !811, file: !725, line: 437, baseType: !722, size: 64, offset: 320)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !735, file: !725, line: 745, baseType: !817, size: 384)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !725, line: 443, size: 384, elements: !818)
!818 = !{!819, !820, !821}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !817, file: !725, line: 445, baseType: !738, size: 256)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !817, file: !725, line: 449, baseType: !258, size: 64, offset: 256)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !817, file: !725, line: 453, baseType: !722, size: 64, offset: 320)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !735, file: !725, line: 746, baseType: !823, size: 320)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !725, line: 459, size: 320, elements: !824)
!824 = !{!825, !826}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !823, file: !725, line: 461, baseType: !738, size: 256)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !823, file: !725, line: 464, baseType: !258, size: 64, offset: 256)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !735, file: !725, line: 747, baseType: !828, size: 768)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !725, line: 469, size: 768, elements: !829)
!829 = !{!830, !831, !832, !833, !834}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !828, file: !725, line: 471, baseType: !738, size: 256)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !828, file: !725, line: 474, baseType: !13, size: 32, offset: 256)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !828, file: !725, line: 475, baseType: !13, size: 32, offset: 288)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !828, file: !725, line: 478, baseType: !258, size: 64, offset: 320)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !828, file: !725, line: 481, baseType: !835, size: 384, offset: 384)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !836, size: 384, elements: !47)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !261, line: 1917, size: 384, elements: !837)
!837 = !{!838, !839, !840}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !836, file: !261, line: 1920, baseType: !775, size: 256)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !836, file: !261, line: 1921, baseType: !258, size: 64, offset: 256)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !836, file: !261, line: 1922, baseType: !380, size: 32, offset: 320)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !735, file: !725, line: 748, baseType: !842, size: 320)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !725, line: 487, size: 320, elements: !843)
!843 = !{!844, !845}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !842, file: !725, line: 490, baseType: !738, size: 256)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !842, file: !725, line: 494, baseType: !32, size: 32, offset: 256)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !735, file: !725, line: 749, baseType: !847, size: 384)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !725, line: 500, size: 384, elements: !848)
!848 = !{!849, !850, !851}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !847, file: !725, line: 502, baseType: !738, size: 256)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !847, file: !725, line: 506, baseType: !722, size: 64, offset: 256)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !847, file: !725, line: 510, baseType: !722, size: 64, offset: 320)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !735, file: !725, line: 750, baseType: !853, size: 320)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !725, line: 529, size: 320, elements: !854)
!854 = !{!855, !856}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !853, file: !725, line: 531, baseType: !738, size: 256)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !853, file: !725, line: 540, baseType: !722, size: 64, offset: 256)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !735, file: !725, line: 751, baseType: !858, size: 704)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !725, line: 546, size: 704, elements: !859)
!859 = !{!860, !861, !862, !863, !864, !865, !866}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !858, file: !725, line: 549, baseType: !788, size: 512)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !858, file: !725, line: 553, baseType: !35, size: 64, offset: 512)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !858, file: !725, line: 557, baseType: !372, size: 8, offset: 576)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !858, file: !725, line: 558, baseType: !372, size: 8, offset: 584)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !858, file: !725, line: 559, baseType: !372, size: 8, offset: 592)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !858, file: !725, line: 560, baseType: !372, size: 8, offset: 600)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !858, file: !725, line: 566, baseType: !669, size: 64, offset: 640)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !735, file: !725, line: 752, baseType: !868, size: 384)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !725, line: 571, size: 384, elements: !869)
!869 = !{!870, !871}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !868, file: !725, line: 573, baseType: !799, size: 320)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !868, file: !725, line: 577, baseType: !258, size: 64, offset: 320)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !735, file: !725, line: 753, baseType: !873, size: 576)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !725, line: 600, size: 576, elements: !874)
!874 = !{!875, !876, !877, !878, !1081}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !873, file: !725, line: 602, baseType: !799, size: 320)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !873, file: !725, line: 605, baseType: !258, size: 64, offset: 320)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !873, file: !725, line: 609, baseType: !632, size: 64, offset: 384)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !873, file: !725, line: 612, baseType: !879, size: 64, offset: 448)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !725, line: 581, size: 320, elements: !881)
!881 = !{!882, !1077, !1078, !1079, !1080}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !880, file: !725, line: 583, baseType: !883, size: 32)
!883 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tree_code", file: !261, line: 39, baseType: !13, size: 32, elements: !884)
!884 = !{!885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076}
!885 = !DIEnumerator(name: "ERROR_MARK", value: 0, isUnsigned: true)
!886 = !DIEnumerator(name: "IDENTIFIER_NODE", value: 1, isUnsigned: true)
!887 = !DIEnumerator(name: "TREE_LIST", value: 2, isUnsigned: true)
!888 = !DIEnumerator(name: "TREE_VEC", value: 3, isUnsigned: true)
