; ModuleID = 'cfgbuild.bc'
source_filename = "cfgbuild.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.rtx_def = type { i32, %union.u }
%union.u = type { %struct.block_symbol }
%struct.block_symbol = type { [3 x %union.rtunion_def], %struct.object_block*, i64 }
%union.rtunion_def = type { i8* }
%struct.object_block = type { %union.section*, i32, i64, %struct.VEC_rtx_gc*, %struct.VEC_rtx_gc* }
%union.section = type { %struct.unnamed_section }
%struct.unnamed_section = type { %struct.section_common, void (i8*)*, i8*, %union.section* }
%struct.section_common = type { i32 }
%struct.VEC_rtx_gc = type { %struct.VEC_rtx_base }
%struct.VEC_rtx_base = type { i32, i32, [1 x %struct.rtx_def*] }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }

!475 = !DIEnumerator(name: "UNORDERED", value: 90, isUnsigned: true)
!476 = !DIEnumerator(name: "ORDERED", value: 91, isUnsigned: true)
!477 = !DIEnumerator(name: "UNEQ", value: 92, isUnsigned: true)
!478 = !DIEnumerator(name: "UNGE", value: 93, isUnsigned: true)
!479 = !DIEnumerator(name: "UNGT", value: 94, isUnsigned: true)
!480 = !DIEnumerator(name: "UNLE", value: 95, isUnsigned: true)
!481 = !DIEnumerator(name: "UNLT", value: 96, isUnsigned: true)
!482 = !DIEnumerator(name: "LTGT", value: 97, isUnsigned: true)
!483 = !DIEnumerator(name: "SIGN_EXTEND", value: 98, isUnsigned: true)
!484 = !DIEnumerator(name: "ZERO_EXTEND", value: 99, isUnsigned: true)
!485 = !DIEnumerator(name: "TRUNCATE", value: 100, isUnsigned: true)
!486 = !DIEnumerator(name: "FLOAT_EXTEND", value: 101, isUnsigned: true)
!487 = !DIEnumerator(name: "FLOAT_TRUNCATE", value: 102, isUnsigned: true)
!488 = !DIEnumerator(name: "FLOAT", value: 103, isUnsigned: true)
!489 = !DIEnumerator(name: "FIX", value: 104, isUnsigned: true)
!490 = !DIEnumerator(name: "UNSIGNED_FLOAT", value: 105, isUnsigned: true)
!491 = !DIEnumerator(name: "UNSIGNED_FIX", value: 106, isUnsigned: true)
!492 = !DIEnumerator(name: "FRACT_CONVERT", value: 107, isUnsigned: true)
!493 = !DIEnumerator(name: "UNSIGNED_FRACT_CONVERT", value: 108, isUnsigned: true)
!494 = !DIEnumerator(name: "SAT_FRACT", value: 109, isUnsigned: true)
!495 = !DIEnumerator(name: "UNSIGNED_SAT_FRACT", value: 110, isUnsigned: true)
!496 = !DIEnumerator(name: "ABS", value: 111, isUnsigned: true)
!497 = !DIEnumerator(name: "SQRT", value: 112, isUnsigned: true)
!498 = !DIEnumerator(name: "BSWAP", value: 113, isUnsigned: true)
!499 = !DIEnumerator(name: "FFS", value: 114, isUnsigned: true)
!500 = !DIEnumerator(name: "CLZ", value: 115, isUnsigned: true)
!501 = !DIEnumerator(name: "CTZ", value: 116, isUnsigned: true)
!502 = !DIEnumerator(name: "POPCOUNT", value: 117, isUnsigned: true)
!503 = !DIEnumerator(name: "PARITY", value: 118, isUnsigned: true)
!504 = !DIEnumerator(name: "SIGN_EXTRACT", value: 119, isUnsigned: true)
!505 = !DIEnumerator(name: "ZERO_EXTRACT", value: 120, isUnsigned: true)
!506 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!507 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!508 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!509 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!510 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!511 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!512 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!513 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!514 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!515 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!516 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!517 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!518 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!519 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!520 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!521 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!522 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!523 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!524 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!525 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "state", file: !1, line: 181, baseType: !5, size: 32, elements: !526)
!526 = !{!527, !528, !529}
!527 = !DIEnumerator(name: "BLOCK_NEW", value: 0, isUnsigned: true)
!528 = !DIEnumerator(name: "BLOCK_ORIGINAL", value: 1, isUnsigned: true)
!529 = !DIEnumerator(name: "BLOCK_TO_SPLIT", value: 2, isUnsigned: true)
!530 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "label_kind", file: !383, line: 982, baseType: !5, size: 32, elements: !531)
!531 = !{!532, !533, !534, !535}
!532 = !DIEnumerator(name: "LABEL_NORMAL", value: 0, isUnsigned: true)
!533 = !DIEnumerator(name: "LABEL_STATIC_ENTRY", value: 1, isUnsigned: true)
!534 = !DIEnumerator(name: "LABEL_GLOBAL_ENTRY", value: 2, isUnsigned: true)
!535 = !DIEnumerator(name: "LABEL_WEAK_ENTRY", value: 3, isUnsigned: true)
!536 = !{!537, !538, !539, !540, !543, !544, !382, !546, !5, !525, !549, !530, !548}
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!539 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !542)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !547, line: 46, baseType: !548)
!547 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!548 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !550, line: 50, baseType: !551)
!550 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !383, line: 240, size: 384, elements: !553)
!553 = !{!554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !552, file: !383, line: 242, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !552, file: !383, line: 245, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !552, file: !383, line: 252, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !552, file: !383, line: 257, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !552, file: !383, line: 265, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !552, file: !383, line: 277, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !552, file: !383, line: 291, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !552, file: !383, line: 298, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !552, file: !383, line: 305, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !552, file: !383, line: 310, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !552, file: !383, line: 321, baseType: !565, size: 320, offset: 64)
!565 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !383, line: 315, size: 320, elements: !566)
!566 = !{!567, !1649, !1651, !1712, !1713}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !565, file: !383, line: 316, baseType: !568, size: 64)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 64, elements: !584)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !383, line: 183, baseType: !570)
!570 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !383, line: 166, size: 64, elements: !571)
!571 = !{!572, !573, !574, !575, !576, !586, !587, !599, !602, !663, !1627, !1628, !1639, !1646}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !570, file: !383, line: 168, baseType: !539, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !570, file: !383, line: 169, baseType: !5, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !570, file: !383, line: 170, baseType: !544, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !570, file: !383, line: 171, baseType: !549, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !570, file: !383, line: 172, baseType: !577, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !550, line: 53, baseType: !578)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !383, line: 359, size: 128, elements: !580)
!580 = !{!581, !582}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !579, file: !383, line: 360, baseType: !539, size: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !579, file: !383, line: 361, baseType: !583, size: 64, offset: 64)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !549, size: 64, elements: !584)
!584 = !{!585}
!585 = !DISubrange(count: 1)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !570, file: !383, line: 173, baseType: !3, size: 32)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !570, file: !383, line: 174, baseType: !588, size: 32)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !383, line: 133, baseType: !589)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !383, line: 115, size: 32, elements: !590)
!590 = !{!591, !592, !593, !594, !595, !596, !597, !598}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !589, file: !383, line: 118, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !589, file: !383, line: 120, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !589, file: !383, line: 121, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !589, file: !383, line: 123, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !589, file: !383, line: 125, baseType: !5, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !589, file: !383, line: 127, baseType: !5, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !589, file: !383, line: 130, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !589, file: !383, line: 132, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !570, file: !383, line: 175, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !383, line: 175, flags: DIFlagFwdDecl)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !570, file: !383, line: 176, baseType: !603, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !605, line: 75, size: 256, elements: !606)
!605 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!606 = !{!607, !621, !622, !623}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !604, file: !605, line: 76, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !605, line: 68, baseType: !610)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !605, line: 63, size: 320, elements: !611)
!611 = !{!612, !614, !615, !616}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !610, file: !605, line: 64, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !610, file: !605, line: 65, baseType: !613, size: 64, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !610, file: !605, line: 66, baseType: !5, size: 32, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !610, file: !605, line: 67, baseType: !617, size: 128, offset: 192)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !618, size: 128, elements: !619)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !605, line: 29, baseType: !548)
!619 = !{!620}
!620 = !DISubrange(count: 2)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !604, file: !605, line: 77, baseType: !608, size: 64, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !604, file: !605, line: 78, baseType: !5, size: 32, offset: 128)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !604, file: !605, line: 79, baseType: !624, size: 64, offset: 192)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !605, line: 49, baseType: !626)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !605, line: 45, size: 832, elements: !627)
!627 = !{!628, !629, !630}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !626, file: !605, line: 46, baseType: !613, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !626, file: !605, line: 47, baseType: !603, size: 64, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !626, file: !605, line: 48, baseType: !631, size: 704, offset: 128)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !632, line: 164, size: 704, elements: !633)
!632 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!633 = !{!634, !636, !646, !647, !648, !649, !650, !651, !655, !659, !660, !661, !662}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !631, file: !632, line: 166, baseType: !635, size: 64)
!635 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !631, file: !632, line: 167, baseType: !637, size: 64, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !632, line: 157, size: 192, elements: !639)
!639 = !{!640, !641, !642}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !638, file: !632, line: 159, baseType: !541, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !638, file: !632, line: 160, baseType: !637, size: 64, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !638, file: !632, line: 161, baseType: !643, size: 32, offset: 128)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !542, size: 32, elements: !644)
!644 = !{!645}
!645 = !DISubrange(count: 4)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !631, file: !632, line: 168, baseType: !541, size: 64, offset: 128)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !631, file: !632, line: 169, baseType: !541, size: 64, offset: 192)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !631, file: !632, line: 170, baseType: !541, size: 64, offset: 256)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !631, file: !632, line: 171, baseType: !635, size: 64, offset: 320)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !631, file: !632, line: 172, baseType: !539, size: 32, offset: 384)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !631, file: !632, line: 176, baseType: !652, size: 64, offset: 448)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{!637, !543, !635}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !631, file: !632, line: 177, baseType: !656, size: 64, offset: 512)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{null, !543, !637}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !631, file: !632, line: 178, baseType: !543, size: 64, offset: 576)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !631, file: !632, line: 179, baseType: !5, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !631, file: !632, line: 180, baseType: !5, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !631, file: !632, line: 184, baseType: !5, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !570, file: !383, line: 177, baseType: !664, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !550, line: 56, baseType: !665)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !156, line: 3371, size: 1792, elements: !667)
!667 = !{!668, !701, !707, !718, !737, !748, !753, !760, !766, !779, !791, !829, !834, !862, !870, !871, !876, !885, !891, !896, !900, !904, !1263, !1312, !1318, !1324, !1331, !1357, !1371, !1388, !1400, !1422, !1437, !1609}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !666, file: !156, line: 3372, baseType: !669, size: 64)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !156, line: 360, size: 64, elements: !670)
!670 = !{!671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !669, file: !156, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !669, file: !156, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !669, file: !156, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !669, file: !156, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !669, file: !156, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !669, file: !156, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !669, file: !156, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !669, file: !156, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !669, file: !156, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !669, file: !156, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !669, file: !156, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !669, file: !156, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !669, file: !156, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !669, file: !156, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !669, file: !156, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !669, file: !156, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !669, file: !156, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !669, file: !156, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !669, file: !156, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !669, file: !156, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !669, file: !156, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !669, file: !156, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !669, file: !156, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !669, file: !156, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !669, file: !156, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !669, file: !156, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !669, file: !156, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !669, file: !156, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !669, file: !156, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !669, file: !156, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !666, file: !156, line: 3373, baseType: !702, size: 192)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !156, line: 402, size: 192, elements: !703)
!703 = !{!704, !705, !706}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !702, file: !156, line: 403, baseType: !669, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !702, file: !156, line: 404, baseType: !664, size: 64, offset: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !702, file: !156, line: 405, baseType: !664, size: 64, offset: 128)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !666, file: !156, line: 3374, baseType: !708, size: 320)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !156, line: 1384, size: 320, elements: !709)
!709 = !{!710, !711}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !708, file: !156, line: 1385, baseType: !702, size: 192)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !708, file: !156, line: 1386, baseType: !712, size: 128, offset: 192)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !713, line: 58, baseType: !714)
!713 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !713, line: 54, size: 128, elements: !715)
!715 = !{!716, !717}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !714, file: !713, line: 56, baseType: !548, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !714, file: !713, line: 57, baseType: !635, size: 64, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !666, file: !156, line: 3375, baseType: !719, size: 256)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !156, line: 1397, size: 256, elements: !720)
!720 = !{!721, !722}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !719, file: !156, line: 1398, baseType: !702, size: 192)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !719, file: !156, line: 1399, baseType: !723, size: 64, offset: 192)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !725, line: 52, size: 256, elements: !726)
!725 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!726 = !{!727, !728, !729, !730, !731, !732, !733}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !724, file: !725, line: 56, baseType: !5, size: 2, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !724, file: !725, line: 57, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !724, file: !725, line: 58, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !724, file: !725, line: 59, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !724, file: !725, line: 60, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !724, file: !725, line: 61, baseType: !5, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !724, file: !725, line: 62, baseType: !734, size: 192, offset: 64)
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !548, size: 192, elements: !735)
!735 = !{!736}
!736 = !DISubrange(count: 3)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !666, file: !156, line: 3376, baseType: !738, size: 256)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !156, line: 1408, size: 256, elements: !739)
!739 = !{!740, !741}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !738, file: !156, line: 1409, baseType: !702, size: 192)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !738, file: !156, line: 1410, baseType: !742, size: 64, offset: 192)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !744, line: 27, size: 192, elements: !745)
!744 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!745 = !{!746, !747}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !743, file: !744, line: 29, baseType: !712, size: 128)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !743, file: !744, line: 30, baseType: !3, size: 32, offset: 128)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !666, file: !156, line: 3377, baseType: !749, size: 256)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !156, line: 1437, size: 256, elements: !750)
!750 = !{!751, !752}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !749, file: !156, line: 1438, baseType: !702, size: 192)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !749, file: !156, line: 1439, baseType: !664, size: 64, offset: 192)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !666, file: !156, line: 3378, baseType: !754, size: 256)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !156, line: 1418, size: 256, elements: !755)
!755 = !{!756, !757, !758}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !754, file: !156, line: 1419, baseType: !702, size: 192)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !754, file: !156, line: 1420, baseType: !539, size: 32, offset: 192)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !754, file: !156, line: 1421, baseType: !759, size: 8, offset: 224)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !542, size: 8, elements: !584)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !666, file: !156, line: 3379, baseType: !761, size: 320)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !156, line: 1428, size: 320, elements: !762)
!762 = !{!763, !764, !765}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !761, file: !156, line: 1429, baseType: !702, size: 192)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !761, file: !156, line: 1430, baseType: !664, size: 64, offset: 192)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !761, file: !156, line: 1431, baseType: !664, size: 64, offset: 256)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !666, file: !156, line: 3380, baseType: !767, size: 320)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !156, line: 1460, size: 320, elements: !768)
!768 = !{!769, !770}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !767, file: !156, line: 1461, baseType: !702, size: 192)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !767, file: !156, line: 1462, baseType: !771, size: 128, offset: 192)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !772, line: 31, size: 128, elements: !773)
!772 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!773 = !{!774, !777, !778}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !771, file: !772, line: 32, baseType: !775, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !538)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !771, file: !772, line: 33, baseType: !5, size: 32, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !771, file: !772, line: 34, baseType: !5, size: 32, offset: 96)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !666, file: !156, line: 3381, baseType: !780, size: 384)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !156, line: 2507, size: 384, elements: !781)
!781 = !{!782, !783, !788, !789, !790}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !780, file: !156, line: 2508, baseType: !702, size: 192)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !780, file: !156, line: 2509, baseType: !784, size: 32, offset: 192)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !785, line: 58, baseType: !786)
!785 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !787, line: 44, baseType: !5)
!787 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!788 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !780, file: !156, line: 2510, baseType: !5, size: 32, offset: 224)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !780, file: !156, line: 2511, baseType: !664, size: 64, offset: 256)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !780, file: !156, line: 2512, baseType: !664, size: 64, offset: 320)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !666, file: !156, line: 3382, baseType: !792, size: 896)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !156, line: 2652, size: 896, elements: !793)
!793 = !{!794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !792, file: !156, line: 2653, baseType: !780, size: 384)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !792, file: !156, line: 2654, baseType: !664, size: 64, offset: 384)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !792, file: !156, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !792, file: !156, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !792, file: !156, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !792, file: !156, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !792, file: !156, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !792, file: !156, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !792, file: !156, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !792, file: !156, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !792, file: !156, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !792, file: !156, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !792, file: !156, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !792, file: !156, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !792, file: !156, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !792, file: !156, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !792, file: !156, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !792, file: !156, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !792, file: !156, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !792, file: !156, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !792, file: !156, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !792, file: !156, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !792, file: !156, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !792, file: !156, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !792, file: !156, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !792, file: !156, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !792, file: !156, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !792, file: !156, line: 2703, baseType: !5, size: 32, offset: 512)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !792, file: !156, line: 2705, baseType: !664, size: 64, offset: 576)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !792, file: !156, line: 2706, baseType: !664, size: 64, offset: 640)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !792, file: !156, line: 2707, baseType: !664, size: 64, offset: 704)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !792, file: !156, line: 2708, baseType: !664, size: 64, offset: 768)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !792, file: !156, line: 2711, baseType: !827, size: 64, offset: 832)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !156, line: 2711, flags: DIFlagFwdDecl)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !666, file: !156, line: 3383, baseType: !830, size: 960)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !156, line: 2756, size: 960, elements: !831)
!831 = !{!832, !833}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !830, file: !156, line: 2757, baseType: !792, size: 896)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !830, file: !156, line: 2758, baseType: !549, size: 64, offset: 896)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !666, file: !156, line: 3384, baseType: !835, size: 1472)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !156, line: 3114, size: 1472, elements: !836)
!836 = !{!837, !858, !859, !860, !861}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !835, file: !156, line: 3115, baseType: !838, size: 1216)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !156, line: 2984, size: 1216, elements: !839)
!839 = !{!840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !838, file: !156, line: 2985, baseType: !830, size: 960)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !838, file: !156, line: 2986, baseType: !664, size: 64, offset: 960)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !838, file: !156, line: 2987, baseType: !664, size: 64, offset: 1024)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !838, file: !156, line: 2988, baseType: !664, size: 64, offset: 1088)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !838, file: !156, line: 2991, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !838, file: !156, line: 2992, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !838, file: !156, line: 2993, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !838, file: !156, line: 2994, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !838, file: !156, line: 2995, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !838, file: !156, line: 2996, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !838, file: !156, line: 2998, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !838, file: !156, line: 3000, baseType: !5, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !838, file: !156, line: 3002, baseType: !5, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !838, file: !156, line: 3003, baseType: !5, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !838, file: !156, line: 3004, baseType: !5, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !838, file: !156, line: 3005, baseType: !5, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !838, file: !156, line: 3007, baseType: !5, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !838, file: !156, line: 3010, baseType: !5, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !835, file: !156, line: 3117, baseType: !664, size: 64, offset: 1216)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !835, file: !156, line: 3119, baseType: !664, size: 64, offset: 1280)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !835, file: !156, line: 3121, baseType: !664, size: 64, offset: 1344)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !835, file: !156, line: 3123, baseType: !664, size: 64, offset: 1408)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !666, file: !156, line: 3385, baseType: !863, size: 1088)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !156, line: 2874, size: 1088, elements: !864)
!864 = !{!865, !866, !867}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !863, file: !156, line: 2875, baseType: !830, size: 960)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !863, file: !156, line: 2876, baseType: !549, size: 64, offset: 960)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !863, file: !156, line: 2877, baseType: !868, size: 64, offset: 1024)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !156, line: 2856, flags: DIFlagFwdDecl)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !666, file: !156, line: 3386, baseType: !838, size: 1216)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !666, file: !156, line: 3387, baseType: !872, size: 1280)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !156, line: 3093, size: 1280, elements: !873)
!873 = !{!874, !875}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !872, file: !156, line: 3094, baseType: !838, size: 1216)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !872, file: !156, line: 3095, baseType: !868, size: 64, offset: 1216)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !666, file: !156, line: 3388, baseType: !877, size: 1216)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !156, line: 2824, size: 1216, elements: !878)
!878 = !{!879, !880, !881, !882, !883, !884}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !877, file: !156, line: 2825, baseType: !792, size: 896)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !877, file: !156, line: 2827, baseType: !664, size: 64, offset: 896)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !877, file: !156, line: 2828, baseType: !664, size: 64, offset: 960)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !877, file: !156, line: 2829, baseType: !664, size: 64, offset: 1024)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !877, file: !156, line: 2830, baseType: !664, size: 64, offset: 1088)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !877, file: !156, line: 2831, baseType: !664, size: 64, offset: 1152)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !666, file: !156, line: 3389, baseType: !886, size: 1024)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !156, line: 2850, size: 1024, elements: !887)
!887 = !{!888, !889, !890}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !886, file: !156, line: 2851, baseType: !830, size: 960)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !886, file: !156, line: 2852, baseType: !539, size: 32, offset: 960)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !886, file: !156, line: 2853, baseType: !539, size: 32, offset: 992)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !666, file: !156, line: 3390, baseType: !892, size: 1024)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !156, line: 2857, size: 1024, elements: !893)
!893 = !{!894, !895}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !892, file: !156, line: 2858, baseType: !830, size: 960)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !892, file: !156, line: 2859, baseType: !868, size: 64, offset: 960)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !666, file: !156, line: 3391, baseType: !897, size: 960)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !156, line: 2862, size: 960, elements: !898)
!898 = !{!899}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !897, file: !156, line: 2863, baseType: !830, size: 960)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !666, file: !156, line: 3392, baseType: !901, size: 1472)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !156, line: 3304, size: 1472, elements: !902)
!902 = !{!903}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !901, file: !156, line: 3305, baseType: !835, size: 1472)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !666, file: !156, line: 3393, baseType: !905, size: 1792)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !156, line: 3248, size: 1792, elements: !906)
!906 = !{!907, !908, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !905, file: !156, line: 3249, baseType: !835, size: 1472)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !905, file: !156, line: 3251, baseType: !909, size: 64, offset: 1472)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !911, line: 463, size: 1152, elements: !912)
!911 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!912 = !{!913, !1075, !1179, !1180, !1183, !1186, !1187, !1188, !1189, !1190, !1191, !1215, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !910, file: !911, line: 464, baseType: !914, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !133, line: 194, size: 384, elements: !916)
!916 = !{!917, !966, !979, !993, !1043, !1056}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !915, file: !133, line: 197, baseType: !918, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !133, line: 182, baseType: !919)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !133, line: 116, size: 704, elements: !921)
!921 = !{!922, !923, !924, !925, !926, !927, !954, !963, !964, !965}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !920, file: !133, line: 119, baseType: !919, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !920, file: !133, line: 122, baseType: !919, size: 64, offset: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !920, file: !133, line: 123, baseType: !919, size: 64, offset: 128)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !920, file: !133, line: 126, baseType: !539, size: 32, offset: 192)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !920, file: !133, line: 129, baseType: !132, size: 32, offset: 224)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !920, file: !133, line: 165, baseType: !928, size: 192, offset: 256)
!928 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !133, line: 132, size: 192, elements: !929)
!929 = !{!930, !943, !949}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !928, file: !133, line: 137, baseType: !931, size: 128)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !133, line: 133, size: 128, elements: !932)
!932 = !{!933, !942}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !931, file: !133, line: 135, baseType: !934, size: 64)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !133, line: 93, size: 320, elements: !936)
!936 = !{!937, !938, !939, !940, !941}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !935, file: !133, line: 96, baseType: !934, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !935, file: !133, line: 97, baseType: !934, size: 64, offset: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !935, file: !133, line: 101, baseType: !664, size: 64, offset: 128)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !935, file: !133, line: 106, baseType: !664, size: 64, offset: 192)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !935, file: !133, line: 111, baseType: !664, size: 64, offset: 256)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !931, file: !133, line: 136, baseType: !934, size: 64, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !928, file: !133, line: 151, baseType: !944, size: 192)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !133, line: 139, size: 192, elements: !945)
!945 = !{!946, !947, !948}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !944, file: !133, line: 141, baseType: !664, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !944, file: !133, line: 145, baseType: !664, size: 64, offset: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !944, file: !133, line: 150, baseType: !539, size: 32, offset: 128)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !928, file: !133, line: 164, baseType: !950, size: 128)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !133, line: 153, size: 128, elements: !951)
!951 = !{!952, !953}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !950, file: !133, line: 161, baseType: !664, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !950, file: !133, line: 163, baseType: !784, size: 32, offset: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !920, file: !133, line: 168, baseType: !955, size: 64, offset: 448)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !133, line: 67, size: 320, elements: !957)
!957 = !{!958, !959, !960, !961, !962}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !956, file: !133, line: 70, baseType: !955, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !956, file: !133, line: 73, baseType: !919, size: 64, offset: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !956, file: !133, line: 78, baseType: !664, size: 64, offset: 128)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !956, file: !133, line: 85, baseType: !549, size: 64, offset: 192)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !956, file: !133, line: 88, baseType: !539, size: 32, offset: 256)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !920, file: !133, line: 173, baseType: !549, size: 64, offset: 512)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !920, file: !133, line: 173, baseType: !549, size: 64, offset: 576)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !920, file: !133, line: 177, baseType: !538, size: 8, offset: 640)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !915, file: !133, line: 200, baseType: !967, size: 64, offset: 64)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !133, line: 185, baseType: !969)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !133, line: 185, size: 128, elements: !970)
!970 = !{!971}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !969, file: !133, line: 185, baseType: !972, size: 128)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !133, line: 184, baseType: !973)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !133, line: 184, size: 128, elements: !974)
!974 = !{!975, !976, !977}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !973, file: !133, line: 184, baseType: !5, size: 32)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !973, file: !133, line: 184, baseType: !5, size: 32, offset: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !973, file: !133, line: 184, baseType: !978, size: 64, offset: 64)
!978 = !DICompositeType(tag: DW_TAG_array_type, baseType: !918, size: 64, elements: !584)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !915, file: !133, line: 203, baseType: !980, size: 64, offset: 128)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !133, line: 189, baseType: !982)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !133, line: 189, size: 128, elements: !983)
!983 = !{!984}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !982, file: !133, line: 189, baseType: !985, size: 128)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !133, line: 188, baseType: !986)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !133, line: 188, size: 128, elements: !987)
!987 = !{!988, !989, !990}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !986, file: !133, line: 188, baseType: !5, size: 32)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !986, file: !133, line: 188, baseType: !5, size: 32, offset: 32)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !986, file: !133, line: 188, baseType: !991, size: 64, offset: 64)
!991 = !DICompositeType(tag: DW_TAG_array_type, baseType: !992, size: 64, elements: !584)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !133, line: 180, baseType: !955)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !915, file: !133, line: 207, baseType: !994, size: 64, offset: 192)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !995, line: 144, baseType: !996)
!995 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !995, line: 100, size: 896, elements: !998)
!998 = !{!999, !1007, !1012, !1017, !1019, !1020, !1021, !1022, !1023, !1024, !1029, !1031, !1032, !1037, !1042}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !997, file: !995, line: 102, baseType: !1000, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !995, line: 52, baseType: !1001)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!1004, !1005}
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !995, line: 47, baseType: !5)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !997, file: !995, line: 105, baseType: !1008, size: 64, offset: 64)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !995, line: 59, baseType: !1009)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!539, !1005, !1005}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !997, file: !995, line: 108, baseType: !1013, size: 64, offset: 128)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !995, line: 63, baseType: !1014)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{null, !543}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !997, file: !995, line: 111, baseType: !1018, size: 64, offset: 192)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !997, file: !995, line: 114, baseType: !546, size: 64, offset: 256)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !997, file: !995, line: 117, baseType: !546, size: 64, offset: 320)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !997, file: !995, line: 120, baseType: !546, size: 64, offset: 384)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !997, file: !995, line: 124, baseType: !5, size: 32, offset: 448)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !997, file: !995, line: 128, baseType: !5, size: 32, offset: 480)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !997, file: !995, line: 131, baseType: !1025, size: 64, offset: 512)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !995, line: 75, baseType: !1026)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!543, !546, !546}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !997, file: !995, line: 132, baseType: !1030, size: 64, offset: 576)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !995, line: 78, baseType: !1014)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !997, file: !995, line: 135, baseType: !543, size: 64, offset: 640)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !997, file: !995, line: 136, baseType: !1033, size: 64, offset: 704)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !995, line: 82, baseType: !1034)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!543, !543, !546, !546}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !997, file: !995, line: 137, baseType: !1038, size: 64, offset: 768)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !995, line: 83, baseType: !1039)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{null, !543, !543}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !997, file: !995, line: 141, baseType: !5, size: 32, offset: 832)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !915, file: !133, line: 211, baseType: !1044, size: 64, offset: 256)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !156, line: 183, baseType: !1046)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !156, line: 183, size: 128, elements: !1047)
!1047 = !{!1048}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1046, file: !156, line: 183, baseType: !1049, size: 128)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !156, line: 182, baseType: !1050)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !156, line: 182, size: 128, elements: !1051)
!1051 = !{!1052, !1053, !1054}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1050, file: !156, line: 182, baseType: !5, size: 32)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1050, file: !156, line: 182, baseType: !5, size: 32, offset: 32)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1050, file: !156, line: 182, baseType: !1055, size: 64, offset: 64)
!1055 = !DICompositeType(tag: DW_TAG_array_type, baseType: !664, size: 64, elements: !584)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !915, file: !133, line: 220, baseType: !1057, size: 64, offset: 320)
!1057 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !133, line: 217, size: 64, elements: !1058)
!1058 = !{!1059, !1060}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !1057, file: !133, line: 218, baseType: !1044, size: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !1057, file: !133, line: 219, baseType: !1061, size: 64)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !1063, line: 29, baseType: !1064)
!1063 = !DIFile(filename: "./vecprim.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !1063, line: 29, size: 96, elements: !1065)
!1065 = !{!1066}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1064, file: !1063, line: 29, baseType: !1067, size: 96)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !1063, line: 27, baseType: !1068)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !1063, line: 27, size: 96, elements: !1069)
!1069 = !{!1070, !1071, !1072}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1068, file: !1063, line: 27, baseType: !5, size: 32)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1068, file: !1063, line: 27, baseType: !5, size: 32, offset: 32)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1068, file: !1063, line: 27, baseType: !1073, size: 8, offset: 64)
!1073 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1074, size: 8, elements: !584)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !1063, line: 26, baseType: !538)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !910, file: !911, line: 467, baseType: !1076, size: 64, offset: 64)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !140, line: 374, size: 640, elements: !1078)
!1078 = !{!1079, !1154, !1155, !1168, !1169, !1170, !1171, !1172, !1173, !1175, !1177, !1178}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1077, file: !140, line: 377, baseType: !1080, size: 64)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !550, line: 111, baseType: !1081)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !140, line: 217, size: 832, elements: !1083)
!1083 = !{!1084, !1119, !1120, !1121, !1124, !1128, !1129, !1130, !1148, !1149, !1150, !1151, !1152, !1153}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1082, file: !140, line: 219, baseType: !1085, size: 64)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !140, line: 151, baseType: !1087)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !140, line: 151, size: 128, elements: !1088)
!1088 = !{!1089}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1087, file: !140, line: 151, baseType: !1090, size: 128)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !140, line: 150, baseType: !1091)
!1091 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !140, line: 150, size: 128, elements: !1092)
!1092 = !{!1093, !1094, !1095}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1091, file: !140, line: 150, baseType: !5, size: 32)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1091, file: !140, line: 150, baseType: !5, size: 32, offset: 32)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1091, file: !140, line: 150, baseType: !1096, size: 64, offset: 64)
!1096 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1097, size: 64, elements: !584)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !550, line: 108, baseType: !1098)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !140, line: 122, size: 512, elements: !1100)
!1100 = !{!1101, !1102, !1103, !1111, !1112, !1113, !1114, !1115, !1116, !1117}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1099, file: !140, line: 124, baseType: !1081, size: 64)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1099, file: !140, line: 125, baseType: !1081, size: 64, offset: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1099, file: !140, line: 131, baseType: !1104, size: 64, offset: 128)
!1104 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !140, line: 128, size: 64, elements: !1105)
!1105 = !{!1106, !1110}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1104, file: !140, line: 129, baseType: !1107, size: 64)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !550, line: 66, baseType: !1108)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64)
!1109 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !550, line: 65, flags: DIFlagFwdDecl)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1104, file: !140, line: 130, baseType: !549, size: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1099, file: !140, line: 134, baseType: !543, size: 64, offset: 192)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1099, file: !140, line: 137, baseType: !664, size: 64, offset: 256)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1099, file: !140, line: 138, baseType: !784, size: 32, offset: 320)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1099, file: !140, line: 142, baseType: !5, size: 32, offset: 352)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1099, file: !140, line: 144, baseType: !539, size: 32, offset: 384)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1099, file: !140, line: 145, baseType: !539, size: 32, offset: 416)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1099, file: !140, line: 146, baseType: !1118, size: 64, offset: 448)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !140, line: 119, baseType: !635)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1082, file: !140, line: 220, baseType: !1085, size: 64, offset: 64)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1082, file: !140, line: 223, baseType: !543, size: 64, offset: 128)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1082, file: !140, line: 226, baseType: !1122, size: 64, offset: 192)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !140, line: 185, flags: DIFlagFwdDecl)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1082, file: !140, line: 229, baseType: !1125, size: 128, offset: 256)
!1125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1126, size: 128, elements: !619)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !140, line: 229, flags: DIFlagFwdDecl)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1082, file: !140, line: 232, baseType: !1081, size: 64, offset: 384)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1082, file: !140, line: 233, baseType: !1081, size: 64, offset: 448)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1082, file: !140, line: 238, baseType: !1131, size: 64, offset: 512)
!1131 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !140, line: 235, size: 64, elements: !1132)
!1132 = !{!1133, !1139}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1131, file: !140, line: 236, baseType: !1134, size: 64)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !140, line: 273, size: 128, elements: !1136)
!1136 = !{!1137, !1138}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1135, file: !140, line: 275, baseType: !1107, size: 64)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1135, file: !140, line: 278, baseType: !1107, size: 64, offset: 64)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1131, file: !140, line: 237, baseType: !1140, size: 64)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !140, line: 259, size: 320, elements: !1142)
!1142 = !{!1143, !1144, !1145, !1146, !1147}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1141, file: !140, line: 261, baseType: !549, size: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1141, file: !140, line: 262, baseType: !549, size: 64, offset: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1141, file: !140, line: 266, baseType: !549, size: 64, offset: 128)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1141, file: !140, line: 267, baseType: !549, size: 64, offset: 192)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1141, file: !140, line: 270, baseType: !539, size: 32, offset: 256)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1082, file: !140, line: 241, baseType: !1118, size: 64, offset: 576)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1082, file: !140, line: 244, baseType: !539, size: 32, offset: 640)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1082, file: !140, line: 247, baseType: !539, size: 32, offset: 672)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1082, file: !140, line: 250, baseType: !539, size: 32, offset: 704)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1082, file: !140, line: 253, baseType: !539, size: 32, offset: 736)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1082, file: !140, line: 256, baseType: !539, size: 32, offset: 768)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1077, file: !140, line: 378, baseType: !1080, size: 64, offset: 64)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1077, file: !140, line: 381, baseType: !1156, size: 64, offset: 128)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !140, line: 282, baseType: !1158)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !140, line: 282, size: 128, elements: !1159)
!1159 = !{!1160}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1158, file: !140, line: 282, baseType: !1161, size: 128)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !140, line: 281, baseType: !1162)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !140, line: 281, size: 128, elements: !1163)
!1163 = !{!1164, !1165, !1166}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1162, file: !140, line: 281, baseType: !5, size: 32)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1162, file: !140, line: 281, baseType: !5, size: 32, offset: 32)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1162, file: !140, line: 281, baseType: !1167, size: 64, offset: 64)
!1167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1080, size: 64, elements: !584)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1077, file: !140, line: 384, baseType: !539, size: 32, offset: 192)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1077, file: !140, line: 387, baseType: !539, size: 32, offset: 224)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1077, file: !140, line: 390, baseType: !539, size: 32, offset: 256)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1077, file: !140, line: 394, baseType: !1156, size: 64, offset: 320)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1077, file: !140, line: 396, baseType: !139, size: 32, offset: 384)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1077, file: !140, line: 399, baseType: !1174, size: 64, offset: 416)
!1174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 64, elements: !619)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1077, file: !140, line: 402, baseType: !1176, size: 64, offset: 480)
!1176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !619)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1077, file: !140, line: 406, baseType: !539, size: 32, offset: 544)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1077, file: !140, line: 409, baseType: !539, size: 32, offset: 576)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !910, file: !911, line: 470, baseType: !1108, size: 64, offset: 128)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !910, file: !911, line: 473, baseType: !1181, size: 64, offset: 192)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64)
!1182 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !911, line: 166, flags: DIFlagFwdDecl)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !910, file: !911, line: 476, baseType: !1184, size: 64, offset: 256)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !911, line: 476, flags: DIFlagFwdDecl)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !910, file: !911, line: 479, baseType: !994, size: 64, offset: 320)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !910, file: !911, line: 484, baseType: !664, size: 64, offset: 384)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !910, file: !911, line: 488, baseType: !664, size: 64, offset: 448)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !910, file: !911, line: 493, baseType: !664, size: 64, offset: 512)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !910, file: !911, line: 496, baseType: !664, size: 64, offset: 576)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !910, file: !911, line: 501, baseType: !1192, size: 64, offset: 640)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1193, size: 64)
!1193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !151, line: 2355, size: 576, elements: !1194)
!1194 = !{!1195, !1198, !1199, !1200, !1201, !1203, !1204, !1209, !1210, !1211, !1212, !1213, !1214}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1193, file: !151, line: 2356, baseType: !1196, size: 64)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64)
!1197 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !151, line: 2356, flags: DIFlagFwdDecl)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1193, file: !151, line: 2357, baseType: !544, size: 64, offset: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1193, file: !151, line: 2358, baseType: !539, size: 32, offset: 128)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1193, file: !151, line: 2359, baseType: !539, size: 32, offset: 160)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1193, file: !151, line: 2360, baseType: !1202, size: 128, offset: 192)
!1202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !539, size: 128, elements: !644)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1193, file: !151, line: 2364, baseType: !539, size: 32, offset: 320)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1193, file: !151, line: 2367, baseType: !1205, size: 128, offset: 384)
!1205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !151, line: 2349, size: 128, elements: !1206)
!1206 = !{!1207, !1208}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1205, file: !151, line: 2351, baseType: !549, size: 64)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1205, file: !151, line: 2352, baseType: !635, size: 64, offset: 64)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1193, file: !151, line: 2371, baseType: !150, size: 32, offset: 512)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1193, file: !151, line: 2374, baseType: !5, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1193, file: !151, line: 2377, baseType: !5, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1193, file: !151, line: 2381, baseType: !5, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1193, file: !151, line: 2392, baseType: !5, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1193, file: !151, line: 2396, baseType: !5, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !910, file: !911, line: 504, baseType: !1216, size: 64, offset: 704)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1217 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !911, line: 504, flags: DIFlagFwdDecl)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !910, file: !911, line: 507, baseType: !994, size: 64, offset: 768)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !910, file: !911, line: 510, baseType: !539, size: 32, offset: 832)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !910, file: !911, line: 513, baseType: !539, size: 32, offset: 864)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !910, file: !911, line: 516, baseType: !784, size: 32, offset: 896)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !910, file: !911, line: 519, baseType: !784, size: 32, offset: 928)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !910, file: !911, line: 522, baseType: !5, size: 32, offset: 960)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !910, file: !911, line: 523, baseType: !5, size: 32, offset: 992)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !910, file: !911, line: 528, baseType: !544, size: 64, offset: 1024)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !910, file: !911, line: 535, baseType: !5, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !910, file: !911, line: 539, baseType: !5, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !910, file: !911, line: 543, baseType: !5, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !910, file: !911, line: 546, baseType: !5, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !910, file: !911, line: 550, baseType: !5, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !910, file: !911, line: 554, baseType: !5, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !910, file: !911, line: 559, baseType: !5, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !910, file: !911, line: 562, baseType: !5, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !910, file: !911, line: 571, baseType: !5, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !910, file: !911, line: 573, baseType: !5, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !910, file: !911, line: 574, baseType: !5, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !910, file: !911, line: 581, baseType: !5, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !910, file: !911, line: 585, baseType: !5, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !910, file: !911, line: 588, baseType: !5, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !910, file: !911, line: 592, baseType: !5, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !910, file: !911, line: 598, baseType: !5, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !905, file: !156, line: 3254, baseType: !664, size: 64, offset: 1536)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !905, file: !156, line: 3257, baseType: !664, size: 64, offset: 1600)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !905, file: !156, line: 3258, baseType: !664, size: 64, offset: 1664)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !905, file: !156, line: 3264, baseType: !5, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !905, file: !156, line: 3265, baseType: !5, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !905, file: !156, line: 3267, baseType: !5, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !905, file: !156, line: 3268, baseType: !5, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !905, file: !156, line: 3269, baseType: !5, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !905, file: !156, line: 3271, baseType: !5, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !905, file: !156, line: 3272, baseType: !5, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !905, file: !156, line: 3273, baseType: !5, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !905, file: !156, line: 3274, baseType: !5, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !905, file: !156, line: 3275, baseType: !5, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !905, file: !156, line: 3276, baseType: !5, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !905, file: !156, line: 3277, baseType: !5, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !905, file: !156, line: 3279, baseType: !5, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !905, file: !156, line: 3280, baseType: !5, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !905, file: !156, line: 3281, baseType: !5, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !905, file: !156, line: 3282, baseType: !5, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !905, file: !156, line: 3283, baseType: !5, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !905, file: !156, line: 3284, baseType: !5, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !666, file: !156, line: 3394, baseType: !1264, size: 1344)
!1264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !156, line: 2279, size: 1344, elements: !1265)
!1265 = !{!1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1291, !1292, !1293, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1264, file: !156, line: 2280, baseType: !702, size: 192)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1264, file: !156, line: 2281, baseType: !664, size: 64, offset: 192)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1264, file: !156, line: 2282, baseType: !664, size: 64, offset: 256)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1264, file: !156, line: 2283, baseType: !664, size: 64, offset: 320)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1264, file: !156, line: 2284, baseType: !664, size: 64, offset: 384)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1264, file: !156, line: 2285, baseType: !5, size: 32, offset: 448)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1264, file: !156, line: 2287, baseType: !5, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1264, file: !156, line: 2288, baseType: !5, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1264, file: !156, line: 2289, baseType: !5, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1264, file: !156, line: 2290, baseType: !5, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1264, file: !156, line: 2291, baseType: !5, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1264, file: !156, line: 2292, baseType: !5, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1264, file: !156, line: 2294, baseType: !5, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1264, file: !156, line: 2296, baseType: !5, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1264, file: !156, line: 2297, baseType: !5, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1264, file: !156, line: 2298, baseType: !5, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1264, file: !156, line: 2299, baseType: !5, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1264, file: !156, line: 2300, baseType: !5, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1264, file: !156, line: 2301, baseType: !5, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1264, file: !156, line: 2302, baseType: !5, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1264, file: !156, line: 2303, baseType: !5, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1264, file: !156, line: 2305, baseType: !5, size: 32, offset: 512)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1264, file: !156, line: 2306, baseType: !1289, size: 32, offset: 544)
!1289 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1290, line: 31, baseType: !539)
!1290 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1264, file: !156, line: 2307, baseType: !664, size: 64, offset: 576)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1264, file: !156, line: 2308, baseType: !664, size: 64, offset: 640)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1264, file: !156, line: 2314, baseType: !1294, size: 64, offset: 704)
!1294 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !156, line: 2309, size: 64, elements: !1295)
!1295 = !{!1296, !1297, !1298}
