; ModuleID = 'cfgcleanup.bc'
source_filename = "cfgcleanup.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }

!691 = !DIEnumerator(name: "TV_IRA", value: 148, isUnsigned: true)
!692 = !DIEnumerator(name: "TV_RELOAD", value: 149, isUnsigned: true)
!693 = !DIEnumerator(name: "TV_RELOAD_CSE_REGS", value: 150, isUnsigned: true)
!694 = !DIEnumerator(name: "TV_SEQABSTR", value: 151, isUnsigned: true)
!695 = !DIEnumerator(name: "TV_GCSE_AFTER_RELOAD", value: 152, isUnsigned: true)
!696 = !DIEnumerator(name: "TV_THREAD_PROLOGUE_AND_EPILOGUE", value: 153, isUnsigned: true)
!697 = !DIEnumerator(name: "TV_IFCVT2", value: 154, isUnsigned: true)
!698 = !DIEnumerator(name: "TV_COMBINE_STACK_ADJUST", value: 155, isUnsigned: true)
!699 = !DIEnumerator(name: "TV_PEEPHOLE2", value: 156, isUnsigned: true)
!700 = !DIEnumerator(name: "TV_RENAME_REGISTERS", value: 157, isUnsigned: true)
!701 = !DIEnumerator(name: "TV_CPROP_REGISTERS", value: 158, isUnsigned: true)
!702 = !DIEnumerator(name: "TV_SCHED2", value: 159, isUnsigned: true)
!703 = !DIEnumerator(name: "TV_MACH_DEP", value: 160, isUnsigned: true)
!704 = !DIEnumerator(name: "TV_DBR_SCHED", value: 161, isUnsigned: true)
!705 = !DIEnumerator(name: "TV_REORDER_BLOCKS", value: 162, isUnsigned: true)
!706 = !DIEnumerator(name: "TV_SHORTEN_BRANCH", value: 163, isUnsigned: true)
!707 = !DIEnumerator(name: "TV_REG_STACK", value: 164, isUnsigned: true)
!708 = !DIEnumerator(name: "TV_FINAL", value: 165, isUnsigned: true)
!709 = !DIEnumerator(name: "TV_SYMOUT", value: 166, isUnsigned: true)
!710 = !DIEnumerator(name: "TV_VAR_TRACKING", value: 167, isUnsigned: true)
!711 = !DIEnumerator(name: "TV_TREE_IFCOMBINE", value: 168, isUnsigned: true)
!712 = !DIEnumerator(name: "TV_PLUGIN_INIT", value: 169, isUnsigned: true)
!713 = !DIEnumerator(name: "TV_PLUGIN_RUN", value: 170, isUnsigned: true)
!714 = !DIEnumerator(name: "TV_REST_OF_COMPILATION", value: 171, isUnsigned: true)
!715 = !DIEnumerator(name: "TIMEVAR_LAST", value: 172, isUnsigned: true)
!716 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "reg_note", file: !391, line: 836, baseType: !7, size: 32, elements: !717)
!717 = !{!718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749}
!718 = !DIEnumerator(name: "REG_DEP_TRUE", value: 0, isUnsigned: true)
!719 = !DIEnumerator(name: "REG_DEAD", value: 1, isUnsigned: true)
!720 = !DIEnumerator(name: "REG_INC", value: 2, isUnsigned: true)
!721 = !DIEnumerator(name: "REG_EQUIV", value: 3, isUnsigned: true)
!722 = !DIEnumerator(name: "REG_EQUAL", value: 4, isUnsigned: true)
!723 = !DIEnumerator(name: "REG_NONNEG", value: 5, isUnsigned: true)
!724 = !DIEnumerator(name: "REG_UNUSED", value: 6, isUnsigned: true)
!725 = !DIEnumerator(name: "REG_CC_SETTER", value: 7, isUnsigned: true)
!726 = !DIEnumerator(name: "REG_CC_USER", value: 8, isUnsigned: true)
!727 = !DIEnumerator(name: "REG_LABEL_TARGET", value: 9, isUnsigned: true)
!728 = !DIEnumerator(name: "REG_LABEL_OPERAND", value: 10, isUnsigned: true)
!729 = !DIEnumerator(name: "REG_DEP_OUTPUT", value: 11, isUnsigned: true)
!730 = !DIEnumerator(name: "REG_DEP_ANTI", value: 12, isUnsigned: true)
!731 = !DIEnumerator(name: "REG_BR_PROB", value: 13, isUnsigned: true)
!732 = !DIEnumerator(name: "REG_VALUE_PROFILE", value: 14, isUnsigned: true)
!733 = !DIEnumerator(name: "REG_NOALIAS", value: 15, isUnsigned: true)
!734 = !DIEnumerator(name: "REG_BR_PRED", value: 16, isUnsigned: true)
!735 = !DIEnumerator(name: "REG_FRAME_RELATED_EXPR", value: 17, isUnsigned: true)
!736 = !DIEnumerator(name: "REG_CFA_DEF_CFA", value: 18, isUnsigned: true)
!737 = !DIEnumerator(name: "REG_CFA_ADJUST_CFA", value: 19, isUnsigned: true)
!738 = !DIEnumerator(name: "REG_CFA_OFFSET", value: 20, isUnsigned: true)
!739 = !DIEnumerator(name: "REG_CFA_REGISTER", value: 21, isUnsigned: true)
!740 = !DIEnumerator(name: "REG_CFA_RESTORE", value: 22, isUnsigned: true)
!741 = !DIEnumerator(name: "REG_CFA_SET_VDRAP", value: 23, isUnsigned: true)
!742 = !DIEnumerator(name: "REG_EH_CONTEXT", value: 24, isUnsigned: true)
!743 = !DIEnumerator(name: "REG_EH_REGION", value: 25, isUnsigned: true)
!744 = !DIEnumerator(name: "REG_SAVE_NOTE", value: 26, isUnsigned: true)
!745 = !DIEnumerator(name: "REG_NORETURN", value: 27, isUnsigned: true)
!746 = !DIEnumerator(name: "REG_NON_LOCAL_GOTO", value: 28, isUnsigned: true)
!747 = !DIEnumerator(name: "REG_CROSSING_JUMP", value: 29, isUnsigned: true)
!748 = !DIEnumerator(name: "REG_SETJMP", value: 30, isUnsigned: true)
!749 = !DIEnumerator(name: "REG_NOTE_MAX", value: 31, isUnsigned: true)
!750 = !{!751, !752, !753, !754, !757, !758, !390, !760, !1909, !7, !1910, !5, !1911, !1912, !716, !851, !1914}
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!753 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !756)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !761, line: 50, baseType: !762)
!761 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !391, line: 240, size: 384, elements: !764)
!764 = !{!765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !763, file: !391, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !763, file: !391, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !763, file: !391, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !763, file: !391, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !763, file: !391, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !763, file: !391, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !763, file: !391, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !763, file: !391, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !763, file: !391, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !763, file: !391, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !763, file: !391, line: 321, baseType: !776, size: 320, offset: 64)
!776 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !391, line: 315, size: 320, elements: !777)
!777 = !{!778, !1844, !1846, !1907, !1908}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !776, file: !391, line: 316, baseType: !779, size: 64)
!779 = !DICompositeType(tag: DW_TAG_array_type, baseType: !780, size: 64, elements: !795)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !391, line: 183, baseType: !781)
!781 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !391, line: 166, size: 64, elements: !782)
!782 = !{!783, !784, !785, !786, !787, !797, !798, !810, !834, !896, !1822, !1823, !1834, !1841}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !781, file: !391, line: 168, baseType: !753, size: 32)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !781, file: !391, line: 169, baseType: !7, size: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !781, file: !391, line: 170, baseType: !758, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !781, file: !391, line: 171, baseType: !760, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !781, file: !391, line: 172, baseType: !788, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !761, line: 53, baseType: !789)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !391, line: 359, size: 128, elements: !791)
!791 = !{!792, !793}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !790, file: !391, line: 360, baseType: !753, size: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !790, file: !391, line: 361, baseType: !794, size: 64, offset: 64)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !760, size: 64, elements: !795)
!795 = !{!796}
!796 = !DISubrange(count: 1)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !781, file: !391, line: 173, baseType: !5, size: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !781, file: !391, line: 174, baseType: !799, size: 32)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !391, line: 133, baseType: !800)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !391, line: 115, size: 32, elements: !801)
!801 = !{!802, !803, !804, !805, !806, !807, !808, !809}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !800, file: !391, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !800, file: !391, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !800, file: !391, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !800, file: !391, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !800, file: !391, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !800, file: !391, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !800, file: !391, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !800, file: !391, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !781, file: !391, line: 175, baseType: !811, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !813, line: 23, size: 320, elements: !814)
!813 = !DIFile(filename: "./cselib.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!814 = !{!815, !816, !817, !818, !825, !833}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !812, file: !813, line: 25, baseType: !7, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !812, file: !813, line: 28, baseType: !753, size: 32, offset: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "val_rtx", scope: !812, file: !813, line: 31, baseType: !760, size: 64, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "locs", scope: !812, file: !813, line: 35, baseType: !819, size: 64, offset: 128)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "elt_loc_list", file: !813, line: 45, size: 192, elements: !821)
!821 = !{!822, !823, !824}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !820, file: !813, line: 47, baseType: !819, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !820, file: !813, line: 49, baseType: !760, size: 64, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "setting_insn", scope: !820, file: !813, line: 51, baseType: !760, size: 64, offset: 128)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "addr_list", scope: !812, file: !813, line: 39, baseType: !826, size: 64, offset: 192)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "elt_list", file: !813, line: 55, size: 128, elements: !828)
!828 = !{!829, !830}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !827, file: !813, line: 56, baseType: !826, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "elt", scope: !827, file: !813, line: 57, baseType: !831, size: 64, offset: 64)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "cselib_val", file: !813, line: 42, baseType: !812)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "next_containing_mem", scope: !812, file: !813, line: 41, baseType: !811, size: 64, offset: 256)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !781, file: !391, line: 176, baseType: !835, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !837, line: 75, size: 256, elements: !838)
!837 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!838 = !{!839, !854, !855, !856}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !836, file: !837, line: 76, baseType: !840, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !837, line: 68, baseType: !842)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !837, line: 63, size: 320, elements: !843)
!843 = !{!844, !846, !847, !848}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !842, file: !837, line: 64, baseType: !845, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !842, file: !837, line: 65, baseType: !845, size: 64, offset: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !842, file: !837, line: 66, baseType: !7, size: 32, offset: 128)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !842, file: !837, line: 67, baseType: !849, size: 128, offset: 192)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !850, size: 128, elements: !852)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !837, line: 29, baseType: !851)
!851 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!852 = !{!853}
!853 = !DISubrange(count: 2)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !836, file: !837, line: 77, baseType: !840, size: 64, offset: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !836, file: !837, line: 78, baseType: !7, size: 32, offset: 128)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !836, file: !837, line: 79, baseType: !857, size: 64, offset: 192)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !837, line: 49, baseType: !859)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !837, line: 45, size: 832, elements: !860)
!860 = !{!861, !862, !863}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !859, file: !837, line: 46, baseType: !845, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !859, file: !837, line: 47, baseType: !835, size: 64, offset: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !859, file: !837, line: 48, baseType: !864, size: 704, offset: 128)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !865, line: 164, size: 704, elements: !866)
!865 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!866 = !{!867, !869, !879, !880, !881, !882, !883, !884, !888, !892, !893, !894, !895}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !864, file: !865, line: 166, baseType: !868, size: 64)
!868 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !864, file: !865, line: 167, baseType: !870, size: 64, offset: 64)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !865, line: 157, size: 192, elements: !872)
!872 = !{!873, !874, !875}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !871, file: !865, line: 159, baseType: !755, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !871, file: !865, line: 160, baseType: !870, size: 64, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !871, file: !865, line: 161, baseType: !876, size: 32, offset: 128)
!876 = !DICompositeType(tag: DW_TAG_array_type, baseType: !756, size: 32, elements: !877)
!877 = !{!878}
!878 = !DISubrange(count: 4)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !864, file: !865, line: 168, baseType: !755, size: 64, offset: 128)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !864, file: !865, line: 169, baseType: !755, size: 64, offset: 192)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !864, file: !865, line: 170, baseType: !755, size: 64, offset: 256)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !864, file: !865, line: 171, baseType: !868, size: 64, offset: 320)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !864, file: !865, line: 172, baseType: !753, size: 32, offset: 384)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !864, file: !865, line: 176, baseType: !885, size: 64, offset: 448)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DISubroutineType(types: !887)
!887 = !{!870, !757, !868}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !864, file: !865, line: 177, baseType: !889, size: 64, offset: 512)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DISubroutineType(types: !891)
!891 = !{null, !757, !870}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !864, file: !865, line: 178, baseType: !757, size: 64, offset: 576)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !864, file: !865, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !864, file: !865, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !864, file: !865, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !781, file: !391, line: 177, baseType: !897, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !761, line: 56, baseType: !898)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !164, line: 3371, size: 1792, elements: !900)
!900 = !{!901, !934, !940, !951, !970, !981, !986, !993, !999, !1012, !1024, !1062, !1067, !1095, !1103, !1104, !1109, !1118, !1124, !1129, !1133, !1137, !1449, !1498, !1504, !1511, !1518, !1541, !1566, !1583, !1595, !1617, !1632, !1804}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !899, file: !164, line: 3372, baseType: !902, size: 64)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !164, line: 360, size: 64, elements: !903)
!903 = !{!904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !902, file: !164, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !902, file: !164, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !902, file: !164, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !902, file: !164, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !902, file: !164, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !902, file: !164, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !902, file: !164, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !902, file: !164, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !902, file: !164, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !902, file: !164, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !902, file: !164, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !902, file: !164, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !902, file: !164, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !902, file: !164, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !902, file: !164, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !902, file: !164, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !902, file: !164, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !902, file: !164, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !902, file: !164, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !902, file: !164, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !902, file: !164, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !902, file: !164, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !902, file: !164, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !902, file: !164, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !902, file: !164, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !902, file: !164, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !902, file: !164, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !902, file: !164, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !902, file: !164, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !902, file: !164, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !899, file: !164, line: 3373, baseType: !935, size: 192)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !164, line: 402, size: 192, elements: !936)
!936 = !{!937, !938, !939}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !935, file: !164, line: 403, baseType: !902, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !935, file: !164, line: 404, baseType: !897, size: 64, offset: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !935, file: !164, line: 405, baseType: !897, size: 64, offset: 128)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !899, file: !164, line: 3374, baseType: !941, size: 320)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !164, line: 1384, size: 320, elements: !942)
!942 = !{!943, !944}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !941, file: !164, line: 1385, baseType: !935, size: 192)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !941, file: !164, line: 1386, baseType: !945, size: 128, offset: 192)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !946, line: 58, baseType: !947)
!946 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !946, line: 54, size: 128, elements: !948)
!948 = !{!949, !950}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !947, file: !946, line: 56, baseType: !851, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !947, file: !946, line: 57, baseType: !868, size: 64, offset: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !899, file: !164, line: 3375, baseType: !952, size: 256)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !164, line: 1397, size: 256, elements: !953)
!953 = !{!954, !955}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !952, file: !164, line: 1398, baseType: !935, size: 192)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !952, file: !164, line: 1399, baseType: !956, size: 64, offset: 192)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !958, line: 52, size: 256, elements: !959)
!958 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!959 = !{!960, !961, !962, !963, !964, !965, !966}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !957, file: !958, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !957, file: !958, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !957, file: !958, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !957, file: !958, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !957, file: !958, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !957, file: !958, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !957, file: !958, line: 62, baseType: !967, size: 192, offset: 64)
!967 = !DICompositeType(tag: DW_TAG_array_type, baseType: !851, size: 192, elements: !968)
!968 = !{!969}
!969 = !DISubrange(count: 3)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !899, file: !164, line: 3376, baseType: !971, size: 256)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !164, line: 1408, size: 256, elements: !972)
!972 = !{!973, !974}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !971, file: !164, line: 1409, baseType: !935, size: 192)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !971, file: !164, line: 1410, baseType: !975, size: 64, offset: 192)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !977, line: 27, size: 192, elements: !978)
!977 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!978 = !{!979, !980}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !976, file: !977, line: 29, baseType: !945, size: 128)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !976, file: !977, line: 30, baseType: !5, size: 32, offset: 128)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !899, file: !164, line: 3377, baseType: !982, size: 256)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !164, line: 1437, size: 256, elements: !983)
!983 = !{!984, !985}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !982, file: !164, line: 1438, baseType: !935, size: 192)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !982, file: !164, line: 1439, baseType: !897, size: 64, offset: 192)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !899, file: !164, line: 3378, baseType: !987, size: 256)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !164, line: 1418, size: 256, elements: !988)
!988 = !{!989, !990, !991}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !987, file: !164, line: 1419, baseType: !935, size: 192)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !987, file: !164, line: 1420, baseType: !753, size: 32, offset: 192)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !987, file: !164, line: 1421, baseType: !992, size: 8, offset: 224)
!992 = !DICompositeType(tag: DW_TAG_array_type, baseType: !756, size: 8, elements: !795)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !899, file: !164, line: 3379, baseType: !994, size: 320)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !164, line: 1428, size: 320, elements: !995)
!995 = !{!996, !997, !998}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !994, file: !164, line: 1429, baseType: !935, size: 192)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !994, file: !164, line: 1430, baseType: !897, size: 64, offset: 192)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !994, file: !164, line: 1431, baseType: !897, size: 64, offset: 256)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !899, file: !164, line: 3380, baseType: !1000, size: 320)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !164, line: 1460, size: 320, elements: !1001)
!1001 = !{!1002, !1003}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1000, file: !164, line: 1461, baseType: !935, size: 192)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1000, file: !164, line: 1462, baseType: !1004, size: 128, offset: 192)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1005, line: 31, size: 128, elements: !1006)
!1005 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1006 = !{!1007, !1010, !1011}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1004, file: !1005, line: 32, baseType: !1008, size: 64)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !752)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1004, file: !1005, line: 33, baseType: !7, size: 32, offset: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1004, file: !1005, line: 34, baseType: !7, size: 32, offset: 96)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !899, file: !164, line: 3381, baseType: !1013, size: 384)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !164, line: 2507, size: 384, elements: !1014)
!1014 = !{!1015, !1016, !1021, !1022, !1023}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1013, file: !164, line: 2508, baseType: !935, size: 192)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1013, file: !164, line: 2509, baseType: !1017, size: 32, offset: 192)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1018, line: 58, baseType: !1019)
!1018 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1020, line: 44, baseType: !7)
!1020 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1013, file: !164, line: 2510, baseType: !7, size: 32, offset: 224)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1013, file: !164, line: 2511, baseType: !897, size: 64, offset: 256)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1013, file: !164, line: 2512, baseType: !897, size: 64, offset: 320)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !899, file: !164, line: 3382, baseType: !1025, size: 896)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !164, line: 2652, size: 896, elements: !1026)
!1026 = !{!1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1025, file: !164, line: 2653, baseType: !1013, size: 384)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1025, file: !164, line: 2654, baseType: !897, size: 64, offset: 384)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1025, file: !164, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1025, file: !164, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1025, file: !164, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1025, file: !164, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1025, file: !164, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1025, file: !164, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1025, file: !164, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1025, file: !164, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1025, file: !164, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1025, file: !164, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1025, file: !164, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1025, file: !164, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1025, file: !164, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1025, file: !164, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1025, file: !164, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1025, file: !164, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1025, file: !164, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1025, file: !164, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1025, file: !164, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1025, file: !164, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1025, file: !164, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1025, file: !164, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1025, file: !164, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1025, file: !164, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1025, file: !164, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1025, file: !164, line: 2703, baseType: !7, size: 32, offset: 512)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1025, file: !164, line: 2705, baseType: !897, size: 64, offset: 576)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1025, file: !164, line: 2706, baseType: !897, size: 64, offset: 640)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1025, file: !164, line: 2707, baseType: !897, size: 64, offset: 704)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1025, file: !164, line: 2708, baseType: !897, size: 64, offset: 768)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1025, file: !164, line: 2711, baseType: !1060, size: 64, offset: 832)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !164, line: 2711, flags: DIFlagFwdDecl)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !899, file: !164, line: 3383, baseType: !1063, size: 960)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !164, line: 2756, size: 960, elements: !1064)
!1064 = !{!1065, !1066}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1063, file: !164, line: 2757, baseType: !1025, size: 896)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1063, file: !164, line: 2758, baseType: !760, size: 64, offset: 896)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !899, file: !164, line: 3384, baseType: !1068, size: 1472)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !164, line: 3114, size: 1472, elements: !1069)
!1069 = !{!1070, !1091, !1092, !1093, !1094}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1068, file: !164, line: 3115, baseType: !1071, size: 1216)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !164, line: 2984, size: 1216, elements: !1072)
!1072 = !{!1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1071, file: !164, line: 2985, baseType: !1063, size: 960)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1071, file: !164, line: 2986, baseType: !897, size: 64, offset: 960)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1071, file: !164, line: 2987, baseType: !897, size: 64, offset: 1024)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1071, file: !164, line: 2988, baseType: !897, size: 64, offset: 1088)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1071, file: !164, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1071, file: !164, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1071, file: !164, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1071, file: !164, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1071, file: !164, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1071, file: !164, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1071, file: !164, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1071, file: !164, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1071, file: !164, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1071, file: !164, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1071, file: !164, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1071, file: !164, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1071, file: !164, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1071, file: !164, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1068, file: !164, line: 3117, baseType: !897, size: 64, offset: 1216)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1068, file: !164, line: 3119, baseType: !897, size: 64, offset: 1280)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1068, file: !164, line: 3121, baseType: !897, size: 64, offset: 1344)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1068, file: !164, line: 3123, baseType: !897, size: 64, offset: 1408)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !899, file: !164, line: 3385, baseType: !1096, size: 1088)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !164, line: 2874, size: 1088, elements: !1097)
!1097 = !{!1098, !1099, !1100}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1096, file: !164, line: 2875, baseType: !1063, size: 960)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1096, file: !164, line: 2876, baseType: !760, size: 64, offset: 960)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1096, file: !164, line: 2877, baseType: !1101, size: 64, offset: 1024)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1102 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !164, line: 2856, flags: DIFlagFwdDecl)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !899, file: !164, line: 3386, baseType: !1071, size: 1216)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !899, file: !164, line: 3387, baseType: !1105, size: 1280)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !164, line: 3093, size: 1280, elements: !1106)
!1106 = !{!1107, !1108}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1105, file: !164, line: 3094, baseType: !1071, size: 1216)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1105, file: !164, line: 3095, baseType: !1101, size: 64, offset: 1216)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !899, file: !164, line: 3388, baseType: !1110, size: 1216)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !164, line: 2824, size: 1216, elements: !1111)
!1111 = !{!1112, !1113, !1114, !1115, !1116, !1117}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1110, file: !164, line: 2825, baseType: !1025, size: 896)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1110, file: !164, line: 2827, baseType: !897, size: 64, offset: 896)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1110, file: !164, line: 2828, baseType: !897, size: 64, offset: 960)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1110, file: !164, line: 2829, baseType: !897, size: 64, offset: 1024)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1110, file: !164, line: 2830, baseType: !897, size: 64, offset: 1088)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1110, file: !164, line: 2831, baseType: !897, size: 64, offset: 1152)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !899, file: !164, line: 3389, baseType: !1119, size: 1024)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !164, line: 2850, size: 1024, elements: !1120)
!1120 = !{!1121, !1122, !1123}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1119, file: !164, line: 2851, baseType: !1063, size: 960)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1119, file: !164, line: 2852, baseType: !753, size: 32, offset: 960)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1119, file: !164, line: 2853, baseType: !753, size: 32, offset: 992)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !899, file: !164, line: 3390, baseType: !1125, size: 1024)
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !164, line: 2857, size: 1024, elements: !1126)
!1126 = !{!1127, !1128}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1125, file: !164, line: 2858, baseType: !1063, size: 960)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1125, file: !164, line: 2859, baseType: !1101, size: 64, offset: 960)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !899, file: !164, line: 3391, baseType: !1130, size: 960)
!1130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !164, line: 2862, size: 960, elements: !1131)
!1131 = !{!1132}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1130, file: !164, line: 2863, baseType: !1063, size: 960)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !899, file: !164, line: 3392, baseType: !1134, size: 1472)
!1134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !164, line: 3304, size: 1472, elements: !1135)
!1135 = !{!1136}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1134, file: !164, line: 3305, baseType: !1068, size: 1472)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !899, file: !164, line: 3393, baseType: !1138, size: 1792)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !164, line: 3248, size: 1792, elements: !1139)
!1139 = !{!1140, !1141, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1138, file: !164, line: 3249, baseType: !1068, size: 1472)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1138, file: !164, line: 3251, baseType: !1142, size: 64, offset: 1472)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64)
!1143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1144, line: 463, size: 1152, elements: !1145)
!1144 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1145 = !{!1146, !1149, !1309, !1310, !1313, !1372, !1373, !1374, !1375, !1376, !1377, !1401, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1143, file: !1144, line: 464, baseType: !1147, size: 64)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64)
!1148 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1144, line: 464, flags: DIFlagFwdDecl)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1143, file: !1144, line: 467, baseType: !1150, size: 64, offset: 64)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !135, line: 374, size: 640, elements: !1152)
!1152 = !{!1153, !1284, !1285, !1298, !1299, !1300, !1301, !1302, !1303, !1305, !1307, !1308}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1151, file: !135, line: 377, baseType: !1154, size: 64)
!1154 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !761, line: 111, baseType: !1155)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !135, line: 217, size: 832, elements: !1157)
!1157 = !{!1158, !1193, !1194, !1195, !1254, !1258, !1259, !1260, !1278, !1279, !1280, !1281, !1282, !1283}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1156, file: !135, line: 219, baseType: !1159, size: 64)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !135, line: 151, baseType: !1161)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !135, line: 151, size: 128, elements: !1162)
!1162 = !{!1163}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1161, file: !135, line: 151, baseType: !1164, size: 128)
!1164 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !135, line: 150, baseType: !1165)
!1165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !135, line: 150, size: 128, elements: !1166)
!1166 = !{!1167, !1168, !1169}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1165, file: !135, line: 150, baseType: !7, size: 32)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1165, file: !135, line: 150, baseType: !7, size: 32, offset: 32)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1165, file: !135, line: 150, baseType: !1170, size: 64, offset: 64)
!1170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1171, size: 64, elements: !795)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !761, line: 108, baseType: !1172)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !135, line: 122, size: 512, elements: !1174)
!1174 = !{!1175, !1176, !1177, !1185, !1186, !1187, !1188, !1189, !1190, !1191}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1173, file: !135, line: 124, baseType: !1155, size: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1173, file: !135, line: 125, baseType: !1155, size: 64, offset: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1173, file: !135, line: 131, baseType: !1178, size: 64, offset: 128)
!1178 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !135, line: 128, size: 64, elements: !1179)
!1179 = !{!1180, !1184}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1178, file: !135, line: 129, baseType: !1181, size: 64)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !761, line: 66, baseType: !1182)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64)
!1183 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !761, line: 65, flags: DIFlagFwdDecl)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1178, file: !135, line: 130, baseType: !760, size: 64)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1173, file: !135, line: 134, baseType: !757, size: 64, offset: 192)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1173, file: !135, line: 137, baseType: !897, size: 64, offset: 256)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1173, file: !135, line: 138, baseType: !1017, size: 32, offset: 320)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1173, file: !135, line: 142, baseType: !7, size: 32, offset: 352)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1173, file: !135, line: 144, baseType: !753, size: 32, offset: 384)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1173, file: !135, line: 145, baseType: !753, size: 32, offset: 416)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1173, file: !135, line: 146, baseType: !1192, size: 64, offset: 448)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !135, line: 119, baseType: !868)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1156, file: !135, line: 220, baseType: !1159, size: 64, offset: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1156, file: !135, line: 223, baseType: !757, size: 64, offset: 128)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1156, file: !135, line: 226, baseType: !1196, size: 64, offset: 192)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64)
!1197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !146, line: 100, size: 1216, elements: !1198)
!1198 = !{!1199, !1200, !1201, !1202, !1203, !1208, !1209, !1210, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1244, !1252, !1253}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1197, file: !146, line: 102, baseType: !753, size: 32)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1197, file: !146, line: 105, baseType: !7, size: 32, offset: 32)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1197, file: !146, line: 108, baseType: !1155, size: 64, offset: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1197, file: !146, line: 111, baseType: !1155, size: 64, offset: 128)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1197, file: !146, line: 114, baseType: !1204, size: 64, offset: 192)
!1204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !146, line: 41, size: 64, elements: !1205)
!1205 = !{!1206, !1207}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1204, file: !146, line: 42, baseType: !145, size: 32)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1204, file: !146, line: 43, baseType: !7, size: 32, offset: 32)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1197, file: !146, line: 117, baseType: !7, size: 32, offset: 256)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1197, file: !146, line: 120, baseType: !7, size: 32, offset: 288)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1197, file: !146, line: 123, baseType: !1211, size: 64, offset: 320)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !146, line: 87, baseType: !1213)
!1213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !146, line: 87, size: 128, elements: !1214)
!1214 = !{!1215}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1213, file: !146, line: 87, baseType: !1216, size: 128)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !146, line: 85, baseType: !1217)
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !146, line: 85, size: 128, elements: !1218)
!1218 = !{!1219, !1220, !1221}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1217, file: !146, line: 85, baseType: !7, size: 32)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1217, file: !146, line: 85, baseType: !7, size: 32, offset: 32)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1217, file: !146, line: 85, baseType: !1222, size: 64, offset: 64)
!1222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1223, size: 64, elements: !795)
!1223 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !146, line: 84, baseType: !1196)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1197, file: !146, line: 126, baseType: !1196, size: 64, offset: 384)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1197, file: !146, line: 129, baseType: !1196, size: 64, offset: 448)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1197, file: !146, line: 132, baseType: !757, size: 64, offset: 512)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1197, file: !146, line: 139, baseType: !897, size: 64, offset: 576)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1197, file: !146, line: 143, baseType: !945, size: 128, offset: 640)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1197, file: !146, line: 146, baseType: !945, size: 128, offset: 768)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1197, file: !146, line: 148, baseType: !752, size: 8, offset: 896)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1197, file: !146, line: 149, baseType: !752, size: 8, offset: 904)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1197, file: !146, line: 153, baseType: !154, size: 32, offset: 928)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1197, file: !146, line: 156, baseType: !1234, size: 64, offset: 960)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64)
!1235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !146, line: 48, size: 320, elements: !1236)
!1236 = !{!1237, !1241, !1242, !1243}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1235, file: !146, line: 50, baseType: !1238, size: 64)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !761, line: 58, baseType: !1239)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64)
!1240 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !761, line: 57, flags: DIFlagFwdDecl)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1235, file: !146, line: 59, baseType: !945, size: 128, offset: 64)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1235, file: !146, line: 64, baseType: !752, size: 8, offset: 192)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1235, file: !146, line: 67, baseType: !1234, size: 64, offset: 256)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1197, file: !146, line: 159, baseType: !1245, size: 64, offset: 1024)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64)
!1246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !146, line: 72, size: 256, elements: !1247)
!1247 = !{!1248, !1249, !1250, !1251}
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1246, file: !146, line: 74, baseType: !1172, size: 64)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1246, file: !146, line: 77, baseType: !1245, size: 64, offset: 64)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1246, file: !146, line: 78, baseType: !1245, size: 64, offset: 128)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1246, file: !146, line: 81, baseType: !1245, size: 64, offset: 192)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1197, file: !146, line: 162, baseType: !752, size: 8, offset: 1088)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1197, file: !146, line: 166, baseType: !897, size: 64, offset: 1152)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1156, file: !135, line: 229, baseType: !1255, size: 128, offset: 256)
!1255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1256, size: 128, elements: !852)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64)
!1257 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !135, line: 229, flags: DIFlagFwdDecl)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1156, file: !135, line: 232, baseType: !1155, size: 64, offset: 384)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1156, file: !135, line: 233, baseType: !1155, size: 64, offset: 448)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1156, file: !135, line: 238, baseType: !1261, size: 64, offset: 512)
!1261 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !135, line: 235, size: 64, elements: !1262)
!1262 = !{!1263, !1269}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1261, file: !135, line: 236, baseType: !1264, size: 64)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64)
!1265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !135, line: 273, size: 128, elements: !1266)
!1266 = !{!1267, !1268}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1265, file: !135, line: 275, baseType: !1181, size: 64)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1265, file: !135, line: 278, baseType: !1181, size: 64, offset: 64)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1261, file: !135, line: 237, baseType: !1270, size: 64)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64)
!1271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !135, line: 259, size: 320, elements: !1272)
!1272 = !{!1273, !1274, !1275, !1276, !1277}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1271, file: !135, line: 261, baseType: !760, size: 64)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1271, file: !135, line: 262, baseType: !760, size: 64, offset: 64)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1271, file: !135, line: 266, baseType: !760, size: 64, offset: 128)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1271, file: !135, line: 267, baseType: !760, size: 64, offset: 192)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1271, file: !135, line: 270, baseType: !753, size: 32, offset: 256)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1156, file: !135, line: 241, baseType: !1192, size: 64, offset: 576)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1156, file: !135, line: 244, baseType: !753, size: 32, offset: 640)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1156, file: !135, line: 247, baseType: !753, size: 32, offset: 672)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1156, file: !135, line: 250, baseType: !753, size: 32, offset: 704)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1156, file: !135, line: 253, baseType: !753, size: 32, offset: 736)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1156, file: !135, line: 256, baseType: !753, size: 32, offset: 768)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1151, file: !135, line: 378, baseType: !1154, size: 64, offset: 64)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1151, file: !135, line: 381, baseType: !1286, size: 64, offset: 128)
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64)
!1287 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !135, line: 282, baseType: !1288)
!1288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !135, line: 282, size: 128, elements: !1289)
!1289 = !{!1290}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1288, file: !135, line: 282, baseType: !1291, size: 128)
!1291 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !135, line: 281, baseType: !1292)
!1292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !135, line: 281, size: 128, elements: !1293)
!1293 = !{!1294, !1295, !1296}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1292, file: !135, line: 281, baseType: !7, size: 32)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1292, file: !135, line: 281, baseType: !7, size: 32, offset: 32)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1292, file: !135, line: 281, baseType: !1297, size: 64, offset: 64)
!1297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1154, size: 64, elements: !795)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1151, file: !135, line: 384, baseType: !753, size: 32, offset: 192)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1151, file: !135, line: 387, baseType: !753, size: 32, offset: 224)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1151, file: !135, line: 390, baseType: !753, size: 32, offset: 256)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1151, file: !135, line: 394, baseType: !1286, size: 64, offset: 320)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1151, file: !135, line: 396, baseType: !134, size: 32, offset: 384)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1151, file: !135, line: 399, baseType: !1304, size: 64, offset: 416)
!1304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 64, elements: !852)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1151, file: !135, line: 402, baseType: !1306, size: 64, offset: 480)
!1306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !852)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1151, file: !135, line: 406, baseType: !753, size: 32, offset: 544)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1151, file: !135, line: 409, baseType: !753, size: 32, offset: 576)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1143, file: !1144, line: 470, baseType: !1182, size: 64, offset: 128)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1143, file: !1144, line: 473, baseType: !1311, size: 64, offset: 192)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64)
!1312 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1144, line: 166, flags: DIFlagFwdDecl)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1143, file: !1144, line: 476, baseType: !1314, size: 64, offset: 256)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64)
!1315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !146, line: 187, size: 256, elements: !1316)
!1316 = !{!1317, !1318, !1319, !1371}
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1315, file: !146, line: 189, baseType: !753, size: 32)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !1315, file: !146, line: 192, baseType: !1211, size: 64, offset: 64)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1315, file: !146, line: 197, baseType: !1320, size: 64, offset: 128)
!1320 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1321, line: 144, baseType: !1322)
!1321 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64)
!1323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1321, line: 100, size: 896, elements: !1324)
!1324 = !{!1325, !1333, !1338, !1343, !1345, !1348, !1349, !1350, !1351, !1352, !1357, !1359, !1360, !1365, !1370}
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1323, file: !1321, line: 102, baseType: !1326, size: 64)
!1326 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1321, line: 52, baseType: !1327)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64)
!1328 = !DISubroutineType(types: !1329)
!1329 = !{!1330, !1331}
!1330 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1321, line: 47, baseType: !7)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64)
!1332 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1323, file: !1321, line: 105, baseType: !1334, size: 64, offset: 64)
!1334 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1321, line: 59, baseType: !1335)
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1336, size: 64)
!1336 = !DISubroutineType(types: !1337)
!1337 = !{!753, !1331, !1331}
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1323, file: !1321, line: 108, baseType: !1339, size: 64, offset: 128)
!1339 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1321, line: 63, baseType: !1340)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64)
!1341 = !DISubroutineType(types: !1342)
!1342 = !{null, !757}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1323, file: !1321, line: 111, baseType: !1344, size: 64, offset: 192)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1323, file: !1321, line: 114, baseType: !1346, size: 64, offset: 256)
!1346 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1347, line: 46, baseType: !851)
!1347 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1323, file: !1321, line: 117, baseType: !1346, size: 64, offset: 320)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1323, file: !1321, line: 120, baseType: !1346, size: 64, offset: 384)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1323, file: !1321, line: 124, baseType: !7, size: 32, offset: 448)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1323, file: !1321, line: 128, baseType: !7, size: 32, offset: 480)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1323, file: !1321, line: 131, baseType: !1353, size: 64, offset: 512)
!1353 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1321, line: 75, baseType: !1354)
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1355, size: 64)
!1355 = !DISubroutineType(types: !1356)
!1356 = !{!757, !1346, !1346}
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1323, file: !1321, line: 132, baseType: !1358, size: 64, offset: 576)
!1358 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1321, line: 78, baseType: !1340)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1323, file: !1321, line: 135, baseType: !757, size: 64, offset: 640)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1323, file: !1321, line: 136, baseType: !1361, size: 64, offset: 704)
!1361 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1321, line: 82, baseType: !1362)
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64)
!1363 = !DISubroutineType(types: !1364)
!1364 = !{!757, !757, !1346, !1346}
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1323, file: !1321, line: 137, baseType: !1366, size: 64, offset: 768)
!1366 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1321, line: 83, baseType: !1367)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64)
!1368 = !DISubroutineType(types: !1369)
!1369 = !{null, !757, !757}
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1323, file: !1321, line: 141, baseType: !7, size: 32, offset: 832)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !1315, file: !146, line: 200, baseType: !1196, size: 64, offset: 192)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1143, file: !1144, line: 479, baseType: !1320, size: 64, offset: 320)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1143, file: !1144, line: 484, baseType: !897, size: 64, offset: 384)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1143, file: !1144, line: 488, baseType: !897, size: 64, offset: 448)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1143, file: !1144, line: 493, baseType: !897, size: 64, offset: 512)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1143, file: !1144, line: 496, baseType: !897, size: 64, offset: 576)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1143, file: !1144, line: 501, baseType: !1378, size: 64, offset: 640)
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64)
!1379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !159, line: 2355, size: 576, elements: !1380)
!1380 = !{!1381, !1384, !1385, !1386, !1387, !1389, !1390, !1395, !1396, !1397, !1398, !1399, !1400}
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1379, file: !159, line: 2356, baseType: !1382, size: 64)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64)
!1383 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !159, line: 2356, flags: DIFlagFwdDecl)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1379, file: !159, line: 2357, baseType: !758, size: 64, offset: 64)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1379, file: !159, line: 2358, baseType: !753, size: 32, offset: 128)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1379, file: !159, line: 2359, baseType: !753, size: 32, offset: 160)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1379, file: !159, line: 2360, baseType: !1388, size: 128, offset: 192)
!1388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !753, size: 128, elements: !877)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1379, file: !159, line: 2364, baseType: !753, size: 32, offset: 320)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1379, file: !159, line: 2367, baseType: !1391, size: 128, offset: 384)
!1391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !159, line: 2349, size: 128, elements: !1392)
!1392 = !{!1393, !1394}
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1391, file: !159, line: 2351, baseType: !760, size: 64)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1391, file: !159, line: 2352, baseType: !868, size: 64, offset: 64)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1379, file: !159, line: 2371, baseType: !158, size: 32, offset: 512)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1379, file: !159, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1379, file: !159, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1379, file: !159, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1379, file: !159, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1379, file: !159, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1143, file: !1144, line: 504, baseType: !1402, size: 64, offset: 704)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64)
!1403 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1144, line: 504, flags: DIFlagFwdDecl)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1143, file: !1144, line: 507, baseType: !1320, size: 64, offset: 768)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1143, file: !1144, line: 510, baseType: !753, size: 32, offset: 832)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1143, file: !1144, line: 513, baseType: !753, size: 32, offset: 864)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1143, file: !1144, line: 516, baseType: !1017, size: 32, offset: 896)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1143, file: !1144, line: 519, baseType: !1017, size: 32, offset: 928)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1143, file: !1144, line: 522, baseType: !7, size: 32, offset: 960)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1143, file: !1144, line: 523, baseType: !7, size: 32, offset: 992)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1143, file: !1144, line: 528, baseType: !758, size: 64, offset: 1024)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1143, file: !1144, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1143, file: !1144, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1143, file: !1144, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1143, file: !1144, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1143, file: !1144, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1143, file: !1144, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1143, file: !1144, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1143, file: !1144, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1143, file: !1144, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1143, file: !1144, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1143, file: !1144, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1143, file: !1144, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1143, file: !1144, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1143, file: !1144, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1143, file: !1144, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1143, file: !1144, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1138, file: !164, line: 3254, baseType: !897, size: 64, offset: 1536)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1138, file: !164, line: 3257, baseType: !897, size: 64, offset: 1600)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1138, file: !164, line: 3258, baseType: !897, size: 64, offset: 1664)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1138, file: !164, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1138, file: !164, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1138, file: !164, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1138, file: !164, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1138, file: !164, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1138, file: !164, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1138, file: !164, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1138, file: !164, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1138, file: !164, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1138, file: !164, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1138, file: !164, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1138, file: !164, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1138, file: !164, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1138, file: !164, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1138, file: !164, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1138, file: !164, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1138, file: !164, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1138, file: !164, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !899, file: !164, line: 3394, baseType: !1450, size: 1344)
!1450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !164, line: 2279, size: 1344, elements: !1451)
!1451 = !{!1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1477, !1478, !1479, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495}
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1450, file: !164, line: 2280, baseType: !935, size: 192)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1450, file: !164, line: 2281, baseType: !897, size: 64, offset: 192)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1450, file: !164, line: 2282, baseType: !897, size: 64, offset: 256)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1450, file: !164, line: 2283, baseType: !897, size: 64, offset: 320)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1450, file: !164, line: 2284, baseType: !897, size: 64, offset: 384)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1450, file: !164, line: 2285, baseType: !7, size: 32, offset: 448)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1450, file: !164, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1450, file: !164, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1450, file: !164, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1450, file: !164, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1450, file: !164, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1450, file: !164, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1450, file: !164, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1450, file: !164, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1450, file: !164, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1450, file: !164, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1450, file: !164, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1450, file: !164, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1450, file: !164, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1450, file: !164, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1450, file: !164, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1450, file: !164, line: 2305, baseType: !7, size: 32, offset: 512)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1450, file: !164, line: 2306, baseType: !1475, size: 32, offset: 544)
!1475 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1476, line: 31, baseType: !753)
!1476 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1450, file: !164, line: 2307, baseType: !897, size: 64, offset: 576)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1450, file: !164, line: 2308, baseType: !897, size: 64, offset: 640)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1450, file: !164, line: 2314, baseType: !1480, size: 64, offset: 704)
!1480 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !164, line: 2309, size: 64, elements: !1481)
!1481 = !{!1482, !1483, !1484}
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1480, file: !164, line: 2310, baseType: !753, size: 32)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1480, file: !164, line: 2311, baseType: !758, size: 64)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1480, file: !164, line: 2312, baseType: !1485, size: 64)
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1486, size: 64)
!1486 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !164, line: 2277, flags: DIFlagFwdDecl)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1450, file: !164, line: 2315, baseType: !897, size: 64, offset: 768)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1450, file: !164, line: 2316, baseType: !897, size: 64, offset: 832)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1450, file: !164, line: 2317, baseType: !897, size: 64, offset: 896)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1450, file: !164, line: 2318, baseType: !897, size: 64, offset: 960)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1450, file: !164, line: 2319, baseType: !897, size: 64, offset: 1024)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1450, file: !164, line: 2320, baseType: !897, size: 64, offset: 1088)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1450, file: !164, line: 2321, baseType: !897, size: 64, offset: 1152)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1450, file: !164, line: 2322, baseType: !897, size: 64, offset: 1216)
