; ModuleID = 'cfgexpand.bc'
source_filename = "cfgexpand.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }
%struct.tree_decl_minimal = type { %struct.tree_common, i32, i32, %union.tree_node*, %union.tree_node* }
%struct.tree_common = type { %struct.tree_base, %union.tree_node*, %union.tree_node* }
%struct.tree_base = type { i64 }

!775 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!776 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!777 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!778 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!779 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!780 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!781 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ssa_op_iter_type", file: !782, line: 119, baseType: !7, size: 32, elements: !783)
!782 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!783 = !{!784, !785, !786, !787}
!784 = !DIEnumerator(name: "ssa_op_iter_none", value: 0, isUnsigned: true)
!785 = !DIEnumerator(name: "ssa_op_iter_tree", value: 1, isUnsigned: true)
!786 = !DIEnumerator(name: "ssa_op_iter_use", value: 2, isUnsigned: true)
!787 = !DIEnumerator(name: "ssa_op_iter_def", value: 3, isUnsigned: true)
!788 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "expand_modifier", file: !789, line: 52, baseType: !7, size: 32, elements: !790)
!789 = !DIFile(filename: "./expr.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!790 = !{!791, !792, !793, !794, !795, !796, !797}
!791 = !DIEnumerator(name: "EXPAND_NORMAL", value: 0, isUnsigned: true)
!792 = !DIEnumerator(name: "EXPAND_STACK_PARM", value: 1, isUnsigned: true)
!793 = !DIEnumerator(name: "EXPAND_SUM", value: 2, isUnsigned: true)
!794 = !DIEnumerator(name: "EXPAND_CONST_ADDRESS", value: 3, isUnsigned: true)
!795 = !DIEnumerator(name: "EXPAND_INITIALIZER", value: 4, isUnsigned: true)
!796 = !DIEnumerator(name: "EXPAND_WRITE", value: 5, isUnsigned: true)
!797 = !DIEnumerator(name: "EXPAND_MEMORY", value: 6, isUnsigned: true)
!798 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mode_class", file: !799, line: 36, baseType: !7, size: 32, elements: !800)
!799 = !DIFile(filename: "./machmode.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!800 = !{!801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819}
!801 = !DIEnumerator(name: "MODE_RANDOM", value: 0, isUnsigned: true)
!802 = !DIEnumerator(name: "MODE_CC", value: 1, isUnsigned: true)
!803 = !DIEnumerator(name: "MODE_INT", value: 2, isUnsigned: true)
!804 = !DIEnumerator(name: "MODE_PARTIAL_INT", value: 3, isUnsigned: true)
!805 = !DIEnumerator(name: "MODE_FRACT", value: 4, isUnsigned: true)
!806 = !DIEnumerator(name: "MODE_UFRACT", value: 5, isUnsigned: true)
!807 = !DIEnumerator(name: "MODE_ACCUM", value: 6, isUnsigned: true)
!808 = !DIEnumerator(name: "MODE_UACCUM", value: 7, isUnsigned: true)
!809 = !DIEnumerator(name: "MODE_FLOAT", value: 8, isUnsigned: true)
!810 = !DIEnumerator(name: "MODE_DECIMAL_FLOAT", value: 9, isUnsigned: true)
!811 = !DIEnumerator(name: "MODE_COMPLEX_INT", value: 10, isUnsigned: true)
!812 = !DIEnumerator(name: "MODE_COMPLEX_FLOAT", value: 11, isUnsigned: true)
!813 = !DIEnumerator(name: "MODE_VECTOR_INT", value: 12, isUnsigned: true)
!814 = !DIEnumerator(name: "MODE_VECTOR_FRACT", value: 13, isUnsigned: true)
!815 = !DIEnumerator(name: "MODE_VECTOR_UFRACT", value: 14, isUnsigned: true)
!816 = !DIEnumerator(name: "MODE_VECTOR_ACCUM", value: 15, isUnsigned: true)
!817 = !DIEnumerator(name: "MODE_VECTOR_UACCUM", value: 16, isUnsigned: true)
!818 = !DIEnumerator(name: "MODE_VECTOR_FLOAT", value: 17, isUnsigned: true)
!819 = !DIEnumerator(name: "MAX_MODE_CLASS", value: 18, isUnsigned: true)
!820 = !{!821, !822, !823, !824, !827, !828, !134, !830, !832, !384, !836, !2222, !1014, !1521, !825, !638, !2224, !833, !7, !1493, !2234, !900, !985, !2235, !2237, !835, !5, !2238, !2241, !798, !2242}
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!823 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !826)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !831, line: 44, baseType: !7)
!831 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !834, line: 46, baseType: !835)
!834 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!835 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !385, line: 737, size: 768, elements: !838)
!838 = !{!839, !2069, !2079, !2085, !2090, !2095, !2102, !2108, !2114, !2119, !2133, !2138, !2144, !2149, !2159, !2164, !2180, !2187, !2194, !2200, !2205, !2211, !2217}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !837, file: !385, line: 738, baseType: !840, size: 256)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !385, line: 271, size: 256, elements: !841)
!841 = !{!842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !855, !856, !2068}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !840, file: !385, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !840, file: !385, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !840, file: !385, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !840, file: !385, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !840, file: !385, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !840, file: !385, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !840, file: !385, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !840, file: !385, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !840, file: !385, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !840, file: !385, line: 312, baseType: !7, size: 32, offset: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !840, file: !385, line: 316, baseType: !853, size: 32, offset: 64)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !854, line: 58, baseType: !830)
!854 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!855 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !840, file: !385, line: 319, baseType: !7, size: 32, offset: 96)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !840, file: !385, line: 323, baseType: !857, size: 64, offset: 128)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !337, line: 217, size: 832, elements: !859)
!859 = !{!860, !2033, !2034, !2035, !2038, !2042, !2043, !2044, !2062, !2063, !2064, !2065, !2066, !2067}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !858, file: !337, line: 219, baseType: !861, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !337, line: 151, baseType: !863)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !337, line: 151, size: 128, elements: !864)
!864 = !{!865}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !863, file: !337, line: 151, baseType: !866, size: 128)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !337, line: 150, baseType: !867)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !337, line: 150, size: 128, elements: !868)
!868 = !{!869, !870, !871}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !867, file: !337, line: 150, baseType: !7, size: 32)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !867, file: !337, line: 150, baseType: !7, size: 32, offset: 32)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !867, file: !337, line: 150, baseType: !872, size: 64, offset: 64)
!872 = !DICompositeType(tag: DW_TAG_array_type, baseType: !873, size: 64, elements: !934)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !874, line: 108, baseType: !875)
!874 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !337, line: 122, size: 512, elements: !877)
!877 = !{!878, !879, !880, !2025, !2026, !2027, !2028, !2029, !2030, !2031}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !876, file: !337, line: 124, baseType: !857, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !876, file: !337, line: 125, baseType: !857, size: 64, offset: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !876, file: !337, line: 131, baseType: !881, size: 64, offset: 128)
!881 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !337, line: 128, size: 64, elements: !882)
!882 = !{!883, !899}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !881, file: !337, line: 129, baseType: !884, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !874, line: 66, baseType: !885)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !385, line: 143, size: 192, elements: !887)
!887 = !{!888, !897, !898}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !886, file: !385, line: 145, baseType: !889, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !874, line: 69, baseType: !890)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !385, line: 136, size: 192, elements: !892)
!892 = !{!893, !895, !896}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !891, file: !385, line: 137, baseType: !894, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !874, line: 58, baseType: !836)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !891, file: !385, line: 138, baseType: !890, size: 64, offset: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !891, file: !385, line: 139, baseType: !890, size: 64, offset: 128)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !886, file: !385, line: 146, baseType: !889, size: 64, offset: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !886, file: !385, line: 152, baseType: !884, size: 64, offset: 128)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !881, file: !337, line: 130, baseType: !900, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !874, line: 50, baseType: !901)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !639, line: 240, size: 384, elements: !903)
!903 = !{!904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !902, file: !639, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !902, file: !639, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !902, file: !639, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !902, file: !639, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !902, file: !639, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !902, file: !639, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !902, file: !639, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !902, file: !639, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !902, file: !639, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !902, file: !639, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !902, file: !639, line: 321, baseType: !915, size: 320, offset: 64)
!915 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !639, line: 315, size: 320, elements: !916)
!916 = !{!917, !1992, !1994, !2023, !2024}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !915, file: !639, line: 316, baseType: !918, size: 64)
!918 = !DICompositeType(tag: DW_TAG_array_type, baseType: !919, size: 64, elements: !934)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !639, line: 183, baseType: !920)
!920 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !639, line: 166, size: 64, elements: !921)
!921 = !{!922, !923, !924, !925, !926, !936, !937, !949, !952, !1013, !1970, !1971, !1982, !1989}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !920, file: !639, line: 168, baseType: !823, size: 32)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !920, file: !639, line: 169, baseType: !7, size: 32)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !920, file: !639, line: 170, baseType: !828, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !920, file: !639, line: 171, baseType: !900, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !920, file: !639, line: 172, baseType: !927, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !874, line: 53, baseType: !928)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !639, line: 359, size: 128, elements: !930)
!930 = !{!931, !932}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !929, file: !639, line: 360, baseType: !823, size: 32)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !929, file: !639, line: 361, baseType: !933, size: 64, offset: 64)
!933 = !DICompositeType(tag: DW_TAG_array_type, baseType: !900, size: 64, elements: !934)
!934 = !{!935}
!935 = !DISubrange(count: 1)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !920, file: !639, line: 173, baseType: !5, size: 32)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !920, file: !639, line: 174, baseType: !938, size: 32)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !639, line: 133, baseType: !939)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !639, line: 115, size: 32, elements: !940)
!940 = !{!941, !942, !943, !944, !945, !946, !947, !948}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !939, file: !639, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !939, file: !639, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !939, file: !639, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !939, file: !639, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !939, file: !639, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !939, file: !639, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !939, file: !639, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !939, file: !639, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !920, file: !639, line: 175, baseType: !950, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !639, line: 175, flags: DIFlagFwdDecl)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !920, file: !639, line: 176, baseType: !953, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !955, line: 75, size: 256, elements: !956)
!955 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!956 = !{!957, !971, !972, !973}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !954, file: !955, line: 76, baseType: !958, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !955, line: 68, baseType: !960)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !955, line: 63, size: 320, elements: !961)
!961 = !{!962, !964, !965, !966}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !960, file: !955, line: 64, baseType: !963, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !960, file: !955, line: 65, baseType: !963, size: 64, offset: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !960, file: !955, line: 66, baseType: !7, size: 32, offset: 128)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !960, file: !955, line: 67, baseType: !967, size: 128, offset: 192)
!967 = !DICompositeType(tag: DW_TAG_array_type, baseType: !968, size: 128, elements: !969)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !955, line: 29, baseType: !835)
!969 = !{!970}
!970 = !DISubrange(count: 2)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !954, file: !955, line: 77, baseType: !958, size: 64, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !954, file: !955, line: 78, baseType: !7, size: 32, offset: 128)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !954, file: !955, line: 79, baseType: !974, size: 64, offset: 192)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !955, line: 49, baseType: !976)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !955, line: 45, size: 832, elements: !977)
!977 = !{!978, !979, !980}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !976, file: !955, line: 46, baseType: !963, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !976, file: !955, line: 47, baseType: !953, size: 64, offset: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !976, file: !955, line: 48, baseType: !981, size: 704, offset: 128)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !982, line: 164, size: 704, elements: !983)
!982 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!983 = !{!984, !986, !996, !997, !998, !999, !1000, !1001, !1005, !1009, !1010, !1011, !1012}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !981, file: !982, line: 166, baseType: !985, size: 64)
!985 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !981, file: !982, line: 167, baseType: !987, size: 64, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !982, line: 157, size: 192, elements: !989)
!989 = !{!990, !991, !992}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !988, file: !982, line: 159, baseType: !825, size: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !988, file: !982, line: 160, baseType: !987, size: 64, offset: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !988, file: !982, line: 161, baseType: !993, size: 32, offset: 128)
!993 = !DICompositeType(tag: DW_TAG_array_type, baseType: !826, size: 32, elements: !994)
!994 = !{!995}
!995 = !DISubrange(count: 4)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !981, file: !982, line: 168, baseType: !825, size: 64, offset: 128)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !981, file: !982, line: 169, baseType: !825, size: 64, offset: 192)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !981, file: !982, line: 170, baseType: !825, size: 64, offset: 256)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !981, file: !982, line: 171, baseType: !985, size: 64, offset: 320)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !981, file: !982, line: 172, baseType: !823, size: 32, offset: 384)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !981, file: !982, line: 176, baseType: !1002, size: 64, offset: 448)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!987, !827, !985}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !981, file: !982, line: 177, baseType: !1006, size: 64, offset: 512)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{null, !827, !987}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !981, file: !982, line: 178, baseType: !827, size: 64, offset: 576)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !981, file: !982, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !981, file: !982, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !981, file: !982, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !920, file: !639, line: 177, baseType: !1014, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !874, line: 56, baseType: !1015)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !135, line: 3371, size: 1792, elements: !1017)
!1017 = !{!1018, !1051, !1057, !1068, !1087, !1098, !1103, !1110, !1116, !1129, !1137, !1175, !1180, !1208, !1225, !1226, !1231, !1240, !1246, !1251, !1255, !1259, !1619, !1668, !1674, !1680, !1687, !1700, !1714, !1731, !1743, !1765, !1780, !1952}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1016, file: !135, line: 3372, baseType: !1019, size: 64)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !135, line: 360, size: 64, elements: !1020)
!1020 = !{!1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1019, file: !135, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !1019, file: !135, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !1019, file: !135, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !1019, file: !135, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !1019, file: !135, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !1019, file: !135, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !1019, file: !135, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !1019, file: !135, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !1019, file: !135, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !1019, file: !135, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !1019, file: !135, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !1019, file: !135, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !1019, file: !135, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !1019, file: !135, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !1019, file: !135, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !1019, file: !135, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !1019, file: !135, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !1019, file: !135, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1019, file: !135, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1019, file: !135, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1019, file: !135, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1019, file: !135, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1019, file: !135, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1019, file: !135, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1019, file: !135, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1019, file: !135, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !1019, file: !135, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !1019, file: !135, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !1019, file: !135, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !1019, file: !135, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1016, file: !135, line: 3373, baseType: !1052, size: 192)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !135, line: 402, size: 192, elements: !1053)
!1053 = !{!1054, !1055, !1056}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1052, file: !135, line: 403, baseType: !1019, size: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !1052, file: !135, line: 404, baseType: !1014, size: 64, offset: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1052, file: !135, line: 405, baseType: !1014, size: 64, offset: 128)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1016, file: !135, line: 3374, baseType: !1058, size: 320)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !135, line: 1384, size: 320, elements: !1059)
!1059 = !{!1060, !1061}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1058, file: !135, line: 1385, baseType: !1052, size: 192)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1058, file: !135, line: 1386, baseType: !1062, size: 128, offset: 192)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !1063, line: 58, baseType: !1064)
!1063 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1063, line: 54, size: 128, elements: !1065)
!1065 = !{!1066, !1067}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !1064, file: !1063, line: 56, baseType: !835, size: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !1064, file: !1063, line: 57, baseType: !985, size: 64, offset: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !1016, file: !135, line: 3375, baseType: !1069, size: 256)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !135, line: 1397, size: 256, elements: !1070)
!1070 = !{!1071, !1072}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1069, file: !135, line: 1398, baseType: !1052, size: 192)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !1069, file: !135, line: 1399, baseType: !1073, size: 64, offset: 192)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !1075, line: 52, size: 256, elements: !1076)
!1075 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1076 = !{!1077, !1078, !1079, !1080, !1081, !1082, !1083}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !1074, file: !1075, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !1074, file: !1075, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !1074, file: !1075, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !1074, file: !1075, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1074, file: !1075, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !1074, file: !1075, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !1074, file: !1075, line: 62, baseType: !1084, size: 192, offset: 64)
!1084 = !DICompositeType(tag: DW_TAG_array_type, baseType: !835, size: 192, elements: !1085)
!1085 = !{!1086}
!1086 = !DISubrange(count: 3)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !1016, file: !135, line: 3376, baseType: !1088, size: 256)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !135, line: 1408, size: 256, elements: !1089)
!1089 = !{!1090, !1091}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1088, file: !135, line: 1409, baseType: !1052, size: 192)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !1088, file: !135, line: 1410, baseType: !1092, size: 64, offset: 192)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !1094, line: 27, size: 192, elements: !1095)
!1094 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1095 = !{!1096, !1097}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1093, file: !1094, line: 29, baseType: !1062, size: 128)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1093, file: !1094, line: 30, baseType: !5, size: 32, offset: 128)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !1016, file: !135, line: 3377, baseType: !1099, size: 256)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !135, line: 1437, size: 256, elements: !1100)
!1100 = !{!1101, !1102}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1099, file: !135, line: 1438, baseType: !1052, size: 192)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1099, file: !135, line: 1439, baseType: !1014, size: 64, offset: 192)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1016, file: !135, line: 3378, baseType: !1104, size: 256)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !135, line: 1418, size: 256, elements: !1105)
!1105 = !{!1106, !1107, !1108}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1104, file: !135, line: 1419, baseType: !1052, size: 192)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1104, file: !135, line: 1420, baseType: !823, size: 32, offset: 192)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1104, file: !135, line: 1421, baseType: !1109, size: 8, offset: 224)
!1109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !826, size: 8, elements: !934)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !1016, file: !135, line: 3379, baseType: !1111, size: 320)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !135, line: 1428, size: 320, elements: !1112)
!1112 = !{!1113, !1114, !1115}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1111, file: !135, line: 1429, baseType: !1052, size: 192)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !1111, file: !135, line: 1430, baseType: !1014, size: 64, offset: 192)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !1111, file: !135, line: 1431, baseType: !1014, size: 64, offset: 256)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !1016, file: !135, line: 3380, baseType: !1117, size: 320)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !135, line: 1460, size: 320, elements: !1118)
!1118 = !{!1119, !1120}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1117, file: !135, line: 1461, baseType: !1052, size: 192)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1117, file: !135, line: 1462, baseType: !1121, size: 128, offset: 192)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1122, line: 31, size: 128, elements: !1123)
!1122 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1123 = !{!1124, !1127, !1128}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1121, file: !1122, line: 32, baseType: !1125, size: 64)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !822)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1121, file: !1122, line: 33, baseType: !7, size: 32, offset: 64)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1121, file: !1122, line: 34, baseType: !7, size: 32, offset: 96)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !1016, file: !135, line: 3381, baseType: !1130, size: 384)
!1130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !135, line: 2507, size: 384, elements: !1131)
!1131 = !{!1132, !1133, !1134, !1135, !1136}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1130, file: !135, line: 2508, baseType: !1052, size: 192)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1130, file: !135, line: 2509, baseType: !853, size: 32, offset: 192)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1130, file: !135, line: 2510, baseType: !7, size: 32, offset: 224)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1130, file: !135, line: 2511, baseType: !1014, size: 64, offset: 256)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1130, file: !135, line: 2512, baseType: !1014, size: 64, offset: 320)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !1016, file: !135, line: 3382, baseType: !1138, size: 896)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !135, line: 2652, size: 896, elements: !1139)
!1139 = !{!1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1138, file: !135, line: 2653, baseType: !1130, size: 384)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1138, file: !135, line: 2654, baseType: !1014, size: 64, offset: 384)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1138, file: !135, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1138, file: !135, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1138, file: !135, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1138, file: !135, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1138, file: !135, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1138, file: !135, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1138, file: !135, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1138, file: !135, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1138, file: !135, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1138, file: !135, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1138, file: !135, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1138, file: !135, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1138, file: !135, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1138, file: !135, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1138, file: !135, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1138, file: !135, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1138, file: !135, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1138, file: !135, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1138, file: !135, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1138, file: !135, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1138, file: !135, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1138, file: !135, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1138, file: !135, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1138, file: !135, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1138, file: !135, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1138, file: !135, line: 2703, baseType: !7, size: 32, offset: 512)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1138, file: !135, line: 2705, baseType: !1014, size: 64, offset: 576)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1138, file: !135, line: 2706, baseType: !1014, size: 64, offset: 640)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1138, file: !135, line: 2707, baseType: !1014, size: 64, offset: 704)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1138, file: !135, line: 2708, baseType: !1014, size: 64, offset: 768)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1138, file: !135, line: 2711, baseType: !1173, size: 64, offset: 832)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64)
!1174 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !135, line: 2711, flags: DIFlagFwdDecl)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !1016, file: !135, line: 3383, baseType: !1176, size: 960)
!1176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !135, line: 2756, size: 960, elements: !1177)
!1177 = !{!1178, !1179}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1176, file: !135, line: 2757, baseType: !1138, size: 896)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1176, file: !135, line: 2758, baseType: !900, size: 64, offset: 896)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !1016, file: !135, line: 3384, baseType: !1181, size: 1472)
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !135, line: 3114, size: 1472, elements: !1182)
!1182 = !{!1183, !1204, !1205, !1206, !1207}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1181, file: !135, line: 3115, baseType: !1184, size: 1216)
!1184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !135, line: 2984, size: 1216, elements: !1185)
!1185 = !{!1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1184, file: !135, line: 2985, baseType: !1176, size: 960)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1184, file: !135, line: 2986, baseType: !1014, size: 64, offset: 960)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1184, file: !135, line: 2987, baseType: !1014, size: 64, offset: 1024)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1184, file: !135, line: 2988, baseType: !1014, size: 64, offset: 1088)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1184, file: !135, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1184, file: !135, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1184, file: !135, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1184, file: !135, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1184, file: !135, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1184, file: !135, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1184, file: !135, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1184, file: !135, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1184, file: !135, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1184, file: !135, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1184, file: !135, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1184, file: !135, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1184, file: !135, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1184, file: !135, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1181, file: !135, line: 3117, baseType: !1014, size: 64, offset: 1216)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1181, file: !135, line: 3119, baseType: !1014, size: 64, offset: 1280)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1181, file: !135, line: 3121, baseType: !1014, size: 64, offset: 1344)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1181, file: !135, line: 3123, baseType: !1014, size: 64, offset: 1408)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !1016, file: !135, line: 3385, baseType: !1209, size: 1088)
!1209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !135, line: 2874, size: 1088, elements: !1210)
!1210 = !{!1211, !1212, !1213}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1209, file: !135, line: 2875, baseType: !1176, size: 960)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1209, file: !135, line: 2876, baseType: !900, size: 64, offset: 960)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1209, file: !135, line: 2877, baseType: !1214, size: 64, offset: 1024)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64)
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1216, line: 172, size: 128, elements: !1217)
!1216 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1217 = !{!1218, !1219, !1220, !1221, !1222, !1223, !1224}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1215, file: !1216, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1215, file: !1216, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1215, file: !1216, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1215, file: !1216, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1215, file: !1216, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1215, file: !1216, line: 195, baseType: !7, size: 32, offset: 32)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1215, file: !1216, line: 199, baseType: !1014, size: 64, offset: 64)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !1016, file: !135, line: 3386, baseType: !1184, size: 1216)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !1016, file: !135, line: 3387, baseType: !1227, size: 1280)
!1227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !135, line: 3093, size: 1280, elements: !1228)
!1228 = !{!1229, !1230}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1227, file: !135, line: 3094, baseType: !1184, size: 1216)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1227, file: !135, line: 3095, baseType: !1214, size: 64, offset: 1216)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !1016, file: !135, line: 3388, baseType: !1232, size: 1216)
!1232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !135, line: 2824, size: 1216, elements: !1233)
!1233 = !{!1234, !1235, !1236, !1237, !1238, !1239}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1232, file: !135, line: 2825, baseType: !1138, size: 896)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1232, file: !135, line: 2827, baseType: !1014, size: 64, offset: 896)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1232, file: !135, line: 2828, baseType: !1014, size: 64, offset: 960)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1232, file: !135, line: 2829, baseType: !1014, size: 64, offset: 1024)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1232, file: !135, line: 2830, baseType: !1014, size: 64, offset: 1088)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1232, file: !135, line: 2831, baseType: !1014, size: 64, offset: 1152)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !1016, file: !135, line: 3389, baseType: !1241, size: 1024)
!1241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !135, line: 2850, size: 1024, elements: !1242)
!1242 = !{!1243, !1244, !1245}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1241, file: !135, line: 2851, baseType: !1176, size: 960)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1241, file: !135, line: 2852, baseType: !823, size: 32, offset: 960)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1241, file: !135, line: 2853, baseType: !823, size: 32, offset: 992)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !1016, file: !135, line: 3390, baseType: !1247, size: 1024)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !135, line: 2857, size: 1024, elements: !1248)
!1248 = !{!1249, !1250}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1247, file: !135, line: 2858, baseType: !1176, size: 960)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1247, file: !135, line: 2859, baseType: !1214, size: 64, offset: 960)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !1016, file: !135, line: 3391, baseType: !1252, size: 960)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !135, line: 2862, size: 960, elements: !1253)
!1253 = !{!1254}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1252, file: !135, line: 2863, baseType: !1176, size: 960)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !1016, file: !135, line: 3392, baseType: !1256, size: 1472)
!1256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !135, line: 3304, size: 1472, elements: !1257)
!1257 = !{!1258}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1256, file: !135, line: 3305, baseType: !1181, size: 1472)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !1016, file: !135, line: 3393, baseType: !1260, size: 1792)
!1260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !135, line: 3248, size: 1792, elements: !1261)
!1261 = !{!1262, !1263, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1260, file: !135, line: 3249, baseType: !1181, size: 1472)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1260, file: !135, line: 3251, baseType: !1264, size: 64, offset: 1472)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64)
!1265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1266, line: 463, size: 1152, elements: !1267)
!1266 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1267 = !{!1268, !1430, !1461, !1462, !1539, !1542, !1543, !1544, !1545, !1546, !1547, !1571, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1265, file: !1266, line: 464, baseType: !1269, size: 64)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64)
!1270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !330, line: 194, size: 384, elements: !1271)
!1271 = !{!1272, !1321, !1334, !1348, !1398, !1411}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !1270, file: !330, line: 197, baseType: !1273, size: 64)
!1273 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !330, line: 182, baseType: !1274)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64)
!1275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !330, line: 116, size: 704, elements: !1276)
!1276 = !{!1277, !1278, !1279, !1280, !1281, !1282, !1309, !1318, !1319, !1320}
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !1275, file: !330, line: 119, baseType: !1274, size: 64)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1275, file: !330, line: 122, baseType: !1274, size: 64, offset: 64)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !1275, file: !330, line: 123, baseType: !1274, size: 64, offset: 128)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1275, file: !330, line: 126, baseType: !823, size: 32, offset: 192)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1275, file: !330, line: 129, baseType: !329, size: 32, offset: 224)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1275, file: !330, line: 165, baseType: !1283, size: 192, offset: 256)
!1283 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !330, line: 132, size: 192, elements: !1284)
!1284 = !{!1285, !1298, !1304}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !1283, file: !330, line: 137, baseType: !1286, size: 128)
!1286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !330, line: 133, size: 128, elements: !1287)
!1287 = !{!1288, !1297}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !1286, file: !330, line: 135, baseType: !1289, size: 64)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64)
!1290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !330, line: 93, size: 320, elements: !1291)
!1291 = !{!1292, !1293, !1294, !1295, !1296}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !1290, file: !330, line: 96, baseType: !1289, size: 64)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !1290, file: !330, line: 97, baseType: !1289, size: 64, offset: 64)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1290, file: !330, line: 101, baseType: !1014, size: 64, offset: 128)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !1290, file: !330, line: 106, baseType: !1014, size: 64, offset: 192)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1290, file: !330, line: 111, baseType: !1014, size: 64, offset: 256)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !1286, file: !330, line: 136, baseType: !1289, size: 64, offset: 64)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !1283, file: !330, line: 151, baseType: !1299, size: 192)
!1299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !330, line: 139, size: 192, elements: !1300)
!1300 = !{!1301, !1302, !1303}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1299, file: !330, line: 141, baseType: !1014, size: 64)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1299, file: !330, line: 145, baseType: !1014, size: 64, offset: 64)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1299, file: !330, line: 150, baseType: !823, size: 32, offset: 128)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !1283, file: !330, line: 164, baseType: !1305, size: 128)
!1305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !330, line: 153, size: 128, elements: !1306)
!1306 = !{!1307, !1308}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !1305, file: !330, line: 161, baseType: !1014, size: 64)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !1305, file: !330, line: 163, baseType: !853, size: 32, offset: 64)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !1275, file: !330, line: 168, baseType: !1310, size: 64, offset: 448)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64)
!1311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !330, line: 67, size: 320, elements: !1312)
!1312 = !{!1313, !1314, !1315, !1316, !1317}
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !1311, file: !330, line: 70, baseType: !1310, size: 64)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1311, file: !330, line: 73, baseType: !1274, size: 64, offset: 64)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !1311, file: !330, line: 78, baseType: !1014, size: 64, offset: 128)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !1311, file: !330, line: 85, baseType: !900, size: 64, offset: 192)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1311, file: !330, line: 88, baseType: !823, size: 32, offset: 256)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !1275, file: !330, line: 173, baseType: !900, size: 64, offset: 512)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !1275, file: !330, line: 173, baseType: !900, size: 64, offset: 576)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !1275, file: !330, line: 177, baseType: !822, size: 8, offset: 640)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !1270, file: !330, line: 200, baseType: !1322, size: 64, offset: 64)
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64)
!1323 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !330, line: 185, baseType: !1324)
!1324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !330, line: 185, size: 128, elements: !1325)
!1325 = !{!1326}
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1324, file: !330, line: 185, baseType: !1327, size: 128)
!1327 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !330, line: 184, baseType: !1328)
!1328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !330, line: 184, size: 128, elements: !1329)
!1329 = !{!1330, !1331, !1332}
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1328, file: !330, line: 184, baseType: !7, size: 32)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1328, file: !330, line: 184, baseType: !7, size: 32, offset: 32)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1328, file: !330, line: 184, baseType: !1333, size: 64, offset: 64)
!1333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1273, size: 64, elements: !934)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !1270, file: !330, line: 203, baseType: !1335, size: 64, offset: 128)
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1336, size: 64)
!1336 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !330, line: 189, baseType: !1337)
!1337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !330, line: 189, size: 128, elements: !1338)
!1338 = !{!1339}
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1337, file: !330, line: 189, baseType: !1340, size: 128)
!1340 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !330, line: 188, baseType: !1341)
!1341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !330, line: 188, size: 128, elements: !1342)
!1342 = !{!1343, !1344, !1345}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1341, file: !330, line: 188, baseType: !7, size: 32)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1341, file: !330, line: 188, baseType: !7, size: 32, offset: 32)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1341, file: !330, line: 188, baseType: !1346, size: 64, offset: 64)
!1346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1347, size: 64, elements: !934)
!1347 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !330, line: 180, baseType: !1310)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !1270, file: !330, line: 207, baseType: !1349, size: 64, offset: 192)
!1349 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1350, line: 144, baseType: !1351)
!1350 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64)
!1352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1350, line: 100, size: 896, elements: !1353)
!1353 = !{!1354, !1362, !1367, !1372, !1374, !1375, !1376, !1377, !1378, !1379, !1384, !1386, !1387, !1392, !1397}
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1352, file: !1350, line: 102, baseType: !1355, size: 64)
!1355 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1350, line: 52, baseType: !1356)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64)
!1357 = !DISubroutineType(types: !1358)
!1358 = !{!1359, !1360}
!1359 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1350, line: 47, baseType: !7)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64)
!1361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1352, file: !1350, line: 105, baseType: !1363, size: 64, offset: 64)
!1363 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1350, line: 59, baseType: !1364)
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1365, size: 64)
!1365 = !DISubroutineType(types: !1366)
!1366 = !{!823, !1360, !1360}
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1352, file: !1350, line: 108, baseType: !1368, size: 64, offset: 128)
!1368 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1350, line: 63, baseType: !1369)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64)
!1370 = !DISubroutineType(types: !1371)
!1371 = !{null, !827}
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1352, file: !1350, line: 111, baseType: !1373, size: 64, offset: 192)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1352, file: !1350, line: 114, baseType: !833, size: 64, offset: 256)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1352, file: !1350, line: 117, baseType: !833, size: 64, offset: 320)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1352, file: !1350, line: 120, baseType: !833, size: 64, offset: 384)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1352, file: !1350, line: 124, baseType: !7, size: 32, offset: 448)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1352, file: !1350, line: 128, baseType: !7, size: 32, offset: 480)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1352, file: !1350, line: 131, baseType: !1380, size: 64, offset: 512)
!1380 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1350, line: 75, baseType: !1381)
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1382, size: 64)
!1382 = !DISubroutineType(types: !1383)
!1383 = !{!827, !833, !833}
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1352, file: !1350, line: 132, baseType: !1385, size: 64, offset: 576)
!1385 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1350, line: 78, baseType: !1369)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1352, file: !1350, line: 135, baseType: !827, size: 64, offset: 640)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1352, file: !1350, line: 136, baseType: !1388, size: 64, offset: 704)
!1388 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1350, line: 82, baseType: !1389)
!1389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1390, size: 64)
!1390 = !DISubroutineType(types: !1391)
!1391 = !{!827, !827, !833, !833}
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1352, file: !1350, line: 137, baseType: !1393, size: 64, offset: 768)
!1393 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1350, line: 83, baseType: !1394)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1395, size: 64)
!1395 = !DISubroutineType(types: !1396)
!1396 = !{null, !827, !827}
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1352, file: !1350, line: 141, baseType: !7, size: 32, offset: 832)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !1270, file: !330, line: 211, baseType: !1399, size: 64, offset: 256)
!1399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1400, size: 64)
!1400 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !135, line: 183, baseType: !1401)
!1401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !135, line: 183, size: 128, elements: !1402)
!1402 = !{!1403}
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1401, file: !135, line: 183, baseType: !1404, size: 128)
!1404 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !135, line: 182, baseType: !1405)
!1405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !135, line: 182, size: 128, elements: !1406)
!1406 = !{!1407, !1408, !1409}
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1405, file: !135, line: 182, baseType: !7, size: 32)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1405, file: !135, line: 182, baseType: !7, size: 32, offset: 32)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1405, file: !135, line: 182, baseType: !1410, size: 64, offset: 64)
!1410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1014, size: 64, elements: !934)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !1270, file: !330, line: 220, baseType: !1412, size: 64, offset: 320)
!1412 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !330, line: 217, size: 64, elements: !1413)
!1413 = !{!1414, !1415}
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !1412, file: !330, line: 218, baseType: !1399, size: 64)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !1412, file: !330, line: 219, baseType: !1416, size: 64)
!1416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1417, size: 64)
!1417 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !1418, line: 29, baseType: !1419)
!1418 = !DIFile(filename: "./vecprim.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !1418, line: 29, size: 96, elements: !1420)
!1420 = !{!1421}
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1419, file: !1418, line: 29, baseType: !1422, size: 96)
!1422 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !1418, line: 27, baseType: !1423)
!1423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !1418, line: 27, size: 96, elements: !1424)
!1424 = !{!1425, !1426, !1427}
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1423, file: !1418, line: 27, baseType: !7, size: 32)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1423, file: !1418, line: 27, baseType: !7, size: 32, offset: 32)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1423, file: !1418, line: 27, baseType: !1428, size: 8, offset: 64)
!1428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1429, size: 8, elements: !934)
!1429 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !1418, line: 26, baseType: !822)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1265, file: !1266, line: 467, baseType: !1431, size: 64, offset: 64)
!1431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1432, size: 64)
!1432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !337, line: 374, size: 640, elements: !1433)
!1433 = !{!1434, !1436, !1437, !1450, !1451, !1452, !1453, !1454, !1455, !1457, !1459, !1460}
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1432, file: !337, line: 377, baseType: !1435, size: 64)
!1435 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !874, line: 111, baseType: !857)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1432, file: !337, line: 378, baseType: !1435, size: 64, offset: 64)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1432, file: !337, line: 381, baseType: !1438, size: 64, offset: 128)
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64)
!1439 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !337, line: 282, baseType: !1440)
!1440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !337, line: 282, size: 128, elements: !1441)
!1441 = !{!1442}
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1440, file: !337, line: 282, baseType: !1443, size: 128)
!1443 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !337, line: 281, baseType: !1444)
!1444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !337, line: 281, size: 128, elements: !1445)
!1445 = !{!1446, !1447, !1448}
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1444, file: !337, line: 281, baseType: !7, size: 32)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1444, file: !337, line: 281, baseType: !7, size: 32, offset: 32)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1444, file: !337, line: 281, baseType: !1449, size: 64, offset: 64)
!1449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1435, size: 64, elements: !934)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1432, file: !337, line: 384, baseType: !823, size: 32, offset: 192)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1432, file: !337, line: 387, baseType: !823, size: 32, offset: 224)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1432, file: !337, line: 390, baseType: !823, size: 32, offset: 256)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1432, file: !337, line: 394, baseType: !1438, size: 64, offset: 320)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1432, file: !337, line: 396, baseType: !336, size: 32, offset: 384)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1432, file: !337, line: 399, baseType: !1456, size: 64, offset: 416)
!1456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 64, elements: !969)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1432, file: !337, line: 402, baseType: !1458, size: 64, offset: 480)
!1458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !969)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1432, file: !337, line: 406, baseType: !823, size: 32, offset: 544)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1432, file: !337, line: 409, baseType: !823, size: 32, offset: 576)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1265, file: !1266, line: 470, baseType: !885, size: 64, offset: 128)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1265, file: !1266, line: 473, baseType: !1463, size: 64, offset: 192)
!1463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1464, size: 64)
!1464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1216, line: 39, size: 1152, elements: !1465)
!1465 = !{!1466, !1467, !1480, !1481, !1482, !1494, !1495, !1499, !1500, !1501, !1502, !1503}
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1464, file: !1216, line: 41, baseType: !1349, size: 64)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1464, file: !1216, line: 48, baseType: !1468, size: 64, offset: 64)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64)
!1469 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !385, line: 35, baseType: !1470)
!1470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !385, line: 35, size: 128, elements: !1471)
!1471 = !{!1472}
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1470, file: !385, line: 35, baseType: !1473, size: 128)
!1473 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !385, line: 33, baseType: !1474)
!1474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !385, line: 33, size: 128, elements: !1475)
!1475 = !{!1476, !1477, !1478}
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1474, file: !385, line: 33, baseType: !7, size: 32)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1474, file: !385, line: 33, baseType: !7, size: 32, offset: 32)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1474, file: !385, line: 33, baseType: !1479, size: 64, offset: 64)
!1479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !894, size: 64, elements: !934)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1464, file: !1216, line: 51, baseType: !1399, size: 64, offset: 128)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1464, file: !1216, line: 54, baseType: !1014, size: 64, offset: 192)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1464, file: !1216, line: 57, baseType: !1483, size: 128, offset: 256)
!1483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1484, line: 31, size: 128, elements: !1485)
!1484 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1485 = !{!1486, !1487, !1488, !1489, !1490, !1491, !1492}
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1483, file: !1484, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1483, file: !1484, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1483, file: !1484, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1483, file: !1484, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1483, file: !1484, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1483, file: !1484, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1483, file: !1484, line: 56, baseType: !1493, size: 64, offset: 64)
!1493 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !874, line: 47, baseType: !953)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !1464, file: !1216, line: 60, baseType: !1483, size: 128, offset: 384)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !1464, file: !1216, line: 64, baseType: !1496, size: 64, offset: 512)
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64)
!1497 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1498, line: 33, flags: DIFlagFwdDecl)
!1498 = !DIFile(filename: "./pointer-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !1464, file: !1216, line: 67, baseType: !1014, size: 64, offset: 576)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !1464, file: !1216, line: 73, baseType: !1349, size: 64, offset: 640)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !1464, file: !1216, line: 77, baseType: !1493, size: 64, offset: 704)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !1464, file: !1216, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !1464, file: !1216, line: 82, baseType: !1504, size: 320, offset: 832)
!1504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !782, line: 62, size: 320, elements: !1505)
!1505 = !{!1506, !1512, !1513, !1514, !1515, !1522}
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1504, file: !782, line: 63, baseType: !1507, size: 64)
!1507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1508, size: 64)
!1508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !782, line: 56, size: 128, elements: !1509)
!1509 = !{!1510, !1511}
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1508, file: !782, line: 57, baseType: !1507, size: 64)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1508, file: !782, line: 58, baseType: !1109, size: 8, offset: 64)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1504, file: !782, line: 64, baseType: !7, size: 32, offset: 64)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1504, file: !782, line: 66, baseType: !7, size: 32, offset: 96)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1504, file: !782, line: 68, baseType: !822, size: 8, offset: 128)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1504, file: !782, line: 70, baseType: !1516, size: 64, offset: 192)
!1516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1517, size: 64)
!1517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !782, line: 37, size: 128, elements: !1518)
!1518 = !{!1519, !1520}
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1517, file: !782, line: 39, baseType: !1516, size: 64)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1517, file: !782, line: 40, baseType: !1521, size: 64, offset: 64)
!1521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1504, file: !782, line: 71, baseType: !1523, size: 64, offset: 256)
!1523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1524, size: 64)
!1524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !782, line: 45, size: 320, elements: !1525)
!1525 = !{!1526, !1527}
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1524, file: !782, line: 47, baseType: !1523, size: 64)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1524, file: !782, line: 48, baseType: !1528, size: 256, offset: 64)
!1528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !135, line: 1883, size: 256, elements: !1529)
!1529 = !{!1530, !1532, !1533, !1538}
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1528, file: !135, line: 1884, baseType: !1531, size: 64)
!1531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1528, size: 64)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1528, file: !135, line: 1885, baseType: !1531, size: 64, offset: 64)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1528, file: !135, line: 1891, baseType: !1534, size: 64, offset: 128)
!1534 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1528, file: !135, line: 1891, size: 64, elements: !1535)
!1535 = !{!1536, !1537}
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1534, file: !135, line: 1891, baseType: !894, size: 64)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1534, file: !135, line: 1891, baseType: !1014, size: 64)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1528, file: !135, line: 1892, baseType: !1521, size: 64, offset: 192)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1265, file: !1266, line: 476, baseType: !1540, size: 64, offset: 256)
!1540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1541, size: 64)
!1541 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1266, line: 476, flags: DIFlagFwdDecl)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1265, file: !1266, line: 479, baseType: !1349, size: 64, offset: 320)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1265, file: !1266, line: 484, baseType: !1014, size: 64, offset: 384)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1265, file: !1266, line: 488, baseType: !1014, size: 64, offset: 448)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1265, file: !1266, line: 493, baseType: !1014, size: 64, offset: 512)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1265, file: !1266, line: 496, baseType: !1014, size: 64, offset: 576)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1265, file: !1266, line: 501, baseType: !1548, size: 64, offset: 640)
!1548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1549, size: 64)
!1549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !348, line: 2355, size: 576, elements: !1550)
!1550 = !{!1551, !1554, !1555, !1556, !1557, !1559, !1560, !1565, !1566, !1567, !1568, !1569, !1570}
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1549, file: !348, line: 2356, baseType: !1552, size: 64)
!1552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1553, size: 64)
!1553 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !348, line: 2356, flags: DIFlagFwdDecl)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1549, file: !348, line: 2357, baseType: !828, size: 64, offset: 64)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1549, file: !348, line: 2358, baseType: !823, size: 32, offset: 128)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1549, file: !348, line: 2359, baseType: !823, size: 32, offset: 160)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1549, file: !348, line: 2360, baseType: !1558, size: 128, offset: 192)
!1558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !823, size: 128, elements: !994)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1549, file: !348, line: 2364, baseType: !823, size: 32, offset: 320)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1549, file: !348, line: 2367, baseType: !1561, size: 128, offset: 384)
!1561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !348, line: 2349, size: 128, elements: !1562)
!1562 = !{!1563, !1564}
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1561, file: !348, line: 2351, baseType: !900, size: 64)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1561, file: !348, line: 2352, baseType: !985, size: 64, offset: 64)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1549, file: !348, line: 2371, baseType: !347, size: 32, offset: 512)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1549, file: !348, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1549, file: !348, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1549, file: !348, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1549, file: !348, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1549, file: !348, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1265, file: !1266, line: 504, baseType: !1572, size: 64, offset: 704)
!1572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1573, size: 64)
!1573 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1266, line: 504, flags: DIFlagFwdDecl)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1265, file: !1266, line: 507, baseType: !1349, size: 64, offset: 768)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1265, file: !1266, line: 510, baseType: !823, size: 32, offset: 832)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1265, file: !1266, line: 513, baseType: !823, size: 32, offset: 864)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1265, file: !1266, line: 516, baseType: !853, size: 32, offset: 896)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1265, file: !1266, line: 519, baseType: !853, size: 32, offset: 928)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1265, file: !1266, line: 522, baseType: !7, size: 32, offset: 960)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1265, file: !1266, line: 523, baseType: !7, size: 32, offset: 992)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1265, file: !1266, line: 528, baseType: !828, size: 64, offset: 1024)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1265, file: !1266, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1265, file: !1266, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1265, file: !1266, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1265, file: !1266, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1265, file: !1266, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1265, file: !1266, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1265, file: !1266, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1265, file: !1266, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1265, file: !1266, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1265, file: !1266, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1265, file: !1266, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1265, file: !1266, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1265, file: !1266, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
