; ModuleID = 'cfghooks.bc'
source_filename = "cfghooks.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

!382 = !DIEnumerator(name: "VEC_INTERLEAVE_LOW_EXPR", value: 184, isUnsigned: true)
!383 = !DIEnumerator(name: "PREDICT_EXPR", value: 185, isUnsigned: true)
!384 = !DIEnumerator(name: "OPTIMIZATION_NODE", value: 186, isUnsigned: true)
!385 = !DIEnumerator(name: "TARGET_OPTION_NODE", value: 187, isUnsigned: true)
!386 = !DIEnumerator(name: "LAST_AND_UNUSED_TREE_CODE", value: 188, isUnsigned: true)
!387 = !DIEnumerator(name: "C_MAYBE_CONST_EXPR", value: 189, isUnsigned: true)
!388 = !DIEnumerator(name: "EXCESS_PRECISION_EXPR", value: 190, isUnsigned: true)
!389 = !DIEnumerator(name: "MAX_TREE_CODES", value: 191, isUnsigned: true)
!390 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "br_predictor", file: !391, line: 24, baseType: !7, size: 32, elements: !392)
!391 = !DIFile(filename: "./predict.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!392 = !{!393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421}
!393 = !DIEnumerator(name: "PRED_COMBINED", value: 0, isUnsigned: true)
!394 = !DIEnumerator(name: "PRED_DS_THEORY", value: 1, isUnsigned: true)
!395 = !DIEnumerator(name: "PRED_FIRST_MATCH", value: 2, isUnsigned: true)
!396 = !DIEnumerator(name: "PRED_NO_PREDICTION", value: 3, isUnsigned: true)
!397 = !DIEnumerator(name: "PRED_UNCONDITIONAL", value: 4, isUnsigned: true)
!398 = !DIEnumerator(name: "PRED_LOOP_ITERATIONS", value: 5, isUnsigned: true)
!399 = !DIEnumerator(name: "PRED_BUILTIN_EXPECT", value: 6, isUnsigned: true)
!400 = !DIEnumerator(name: "PRED_LOOP_ITERATIONS_GUESSED", value: 7, isUnsigned: true)
!401 = !DIEnumerator(name: "PRED_CONTINUE", value: 8, isUnsigned: true)
!402 = !DIEnumerator(name: "PRED_NORETURN", value: 9, isUnsigned: true)
!403 = !DIEnumerator(name: "PRED_COLD_FUNCTION", value: 10, isUnsigned: true)
!404 = !DIEnumerator(name: "PRED_LOOP_BRANCH", value: 11, isUnsigned: true)
!405 = !DIEnumerator(name: "PRED_LOOP_EXIT", value: 12, isUnsigned: true)
!406 = !DIEnumerator(name: "PRED_POINTER", value: 13, isUnsigned: true)
!407 = !DIEnumerator(name: "PRED_TREE_POINTER", value: 14, isUnsigned: true)
!408 = !DIEnumerator(name: "PRED_OPCODE_POSITIVE", value: 15, isUnsigned: true)
!409 = !DIEnumerator(name: "PRED_OPCODE_NONEQUAL", value: 16, isUnsigned: true)
!410 = !DIEnumerator(name: "PRED_FPOPCODE", value: 17, isUnsigned: true)
!411 = !DIEnumerator(name: "PRED_TREE_OPCODE_POSITIVE", value: 18, isUnsigned: true)
!412 = !DIEnumerator(name: "PRED_TREE_OPCODE_NONEQUAL", value: 19, isUnsigned: true)
!413 = !DIEnumerator(name: "PRED_TREE_FPOPCODE", value: 20, isUnsigned: true)
!414 = !DIEnumerator(name: "PRED_CALL", value: 21, isUnsigned: true)
!415 = !DIEnumerator(name: "PRED_TREE_EARLY_RETURN", value: 22, isUnsigned: true)
!416 = !DIEnumerator(name: "PRED_GOTO", value: 23, isUnsigned: true)
!417 = !DIEnumerator(name: "PRED_CONST_RETURN", value: 24, isUnsigned: true)
!418 = !DIEnumerator(name: "PRED_NEGATIVE_RETURN", value: 25, isUnsigned: true)
!419 = !DIEnumerator(name: "PRED_NULL_RETURN", value: 26, isUnsigned: true)
!420 = !DIEnumerator(name: "PRED_MUDFLAP", value: 27, isUnsigned: true)
!421 = !DIEnumerator(name: "END_PREDICTORS", value: 28, isUnsigned: true)
!422 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ir_type", file: !423, line: 80, baseType: !7, size: 32, elements: !424)
!423 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!424 = !{!425, !426, !427}
!425 = !DIEnumerator(name: "IR_GIMPLE", value: 0, isUnsigned: true)
!426 = !DIEnumerator(name: "IR_RTL_CFGRTL", value: 1, isUnsigned: true)
!427 = !DIEnumerator(name: "IR_RTL_CFGLAYOUT", value: 2, isUnsigned: true)
!428 = !{!429, !430, !431, !432, !435, !436, !438, !1792, !994, !433, !557, !672, !1793}
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!431 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !434)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !423, line: 111, baseType: !440)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !135, line: 217, size: 832, elements: !442)
!442 = !{!443, !1759, !1760, !1761, !1762, !1766, !1767, !1768, !1786, !1787, !1788, !1789, !1790, !1791}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !441, file: !135, line: 219, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !135, line: 151, baseType: !446)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !135, line: 151, size: 128, elements: !447)
!447 = !{!448}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !446, file: !135, line: 151, baseType: !449, size: 128)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !135, line: 150, baseType: !450)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !135, line: 150, size: 128, elements: !451)
!451 = !{!452, !453, !454}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !450, file: !135, line: 150, baseType: !7, size: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !450, file: !135, line: 150, baseType: !7, size: 32, offset: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !450, file: !135, line: 150, baseType: !455, size: 64, offset: 64)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !456, size: 64, elements: !600)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !423, line: 108, baseType: !457)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !135, line: 122, size: 512, elements: !459)
!459 = !{!460, !461, !462, !1751, !1752, !1753, !1754, !1755, !1756, !1757}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !458, file: !135, line: 124, baseType: !440, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !458, file: !135, line: 125, baseType: !440, size: 64, offset: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !458, file: !135, line: 131, baseType: !463, size: 64, offset: 128)
!463 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !135, line: 128, size: 64, elements: !464)
!464 = !{!465, !1750}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !463, file: !135, line: 129, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !423, line: 66, baseType: !467)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !469, line: 143, size: 192, elements: !470)
!469 = !DIFile(filename: "./gimple.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!470 = !{!471, !1748, !1749}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !468, file: !469, line: 145, baseType: !472, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !423, line: 69, baseType: !473)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !469, line: 136, size: 192, elements: !475)
!475 = !{!476, !1746, !1747}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !474, file: !469, line: 137, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !423, line: 58, baseType: !478)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !469, line: 737, size: 768, elements: !480)
!480 = !{!481, !1593, !1603, !1609, !1614, !1619, !1626, !1632, !1638, !1643, !1657, !1662, !1668, !1673, !1683, !1688, !1704, !1711, !1718, !1724, !1729, !1735, !1741}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !479, file: !469, line: 738, baseType: !482, size: 256)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !469, line: 271, size: 256, elements: !483)
!483 = !{!484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !499, !500, !501}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !482, file: !469, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !482, file: !469, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !482, file: !469, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !482, file: !469, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !482, file: !469, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !482, file: !469, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !482, file: !469, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !482, file: !469, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !482, file: !469, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !482, file: !469, line: 312, baseType: !7, size: 32, offset: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !482, file: !469, line: 316, baseType: !495, size: 32, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !496, line: 58, baseType: !497)
!496 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !498, line: 44, baseType: !7)
!498 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!499 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !482, file: !469, line: 319, baseType: !7, size: 32, offset: 96)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !482, file: !469, line: 323, baseType: !440, size: 64, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !482, file: !469, line: 327, baseType: !502, size: 64, offset: 192)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !423, line: 56, baseType: !503)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !164, line: 3371, size: 1792, elements: !505)
!505 = !{!506, !539, !545, !558, !577, !588, !593, !602, !608, !621, !629, !667, !841, !869, !886, !887, !892, !901, !907, !912, !916, !920, !1244, !1291, !1297, !1303, !1310, !1323, !1337, !1354, !1366, !1388, !1403, !1575}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !504, file: !164, line: 3372, baseType: !507, size: 64)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !164, line: 360, size: 64, elements: !508)
!508 = !{!509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !507, file: !164, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !507, file: !164, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !507, file: !164, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !507, file: !164, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !507, file: !164, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !507, file: !164, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !507, file: !164, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !507, file: !164, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !507, file: !164, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !507, file: !164, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !507, file: !164, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !507, file: !164, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !507, file: !164, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !507, file: !164, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !507, file: !164, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !507, file: !164, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !507, file: !164, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !507, file: !164, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !507, file: !164, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !507, file: !164, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !507, file: !164, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !507, file: !164, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !507, file: !164, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !507, file: !164, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !507, file: !164, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !507, file: !164, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !507, file: !164, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !507, file: !164, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !507, file: !164, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !507, file: !164, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !504, file: !164, line: 3373, baseType: !540, size: 192)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !164, line: 402, size: 192, elements: !541)
!541 = !{!542, !543, !544}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !540, file: !164, line: 403, baseType: !507, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !540, file: !164, line: 404, baseType: !502, size: 64, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !540, file: !164, line: 405, baseType: !502, size: 64, offset: 128)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !504, file: !164, line: 3374, baseType: !546, size: 320)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !164, line: 1384, size: 320, elements: !547)
!547 = !{!548, !549}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !546, file: !164, line: 1385, baseType: !540, size: 192)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !546, file: !164, line: 1386, baseType: !550, size: 128, offset: 192)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !551, line: 58, baseType: !552)
!551 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !551, line: 54, size: 128, elements: !553)
!553 = !{!554, !556}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !552, file: !551, line: 56, baseType: !555, size: 64)
!555 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !552, file: !551, line: 57, baseType: !557, size: 64, offset: 64)
!557 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !504, file: !164, line: 3375, baseType: !559, size: 256)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !164, line: 1397, size: 256, elements: !560)
!560 = !{!561, !562}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !559, file: !164, line: 1398, baseType: !540, size: 192)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !559, file: !164, line: 1399, baseType: !563, size: 64, offset: 192)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !565, line: 52, size: 256, elements: !566)
!565 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!566 = !{!567, !568, !569, !570, !571, !572, !573}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !564, file: !565, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !564, file: !565, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !564, file: !565, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !564, file: !565, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !564, file: !565, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !564, file: !565, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !564, file: !565, line: 62, baseType: !574, size: 192, offset: 64)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !555, size: 192, elements: !575)
!575 = !{!576}
!576 = !DISubrange(count: 3)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !504, file: !164, line: 3376, baseType: !578, size: 256)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !164, line: 1408, size: 256, elements: !579)
!579 = !{!580, !581}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !578, file: !164, line: 1409, baseType: !540, size: 192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !578, file: !164, line: 1410, baseType: !582, size: 64, offset: 192)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !584, line: 27, size: 192, elements: !585)
!584 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!585 = !{!586, !587}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !583, file: !584, line: 29, baseType: !550, size: 128)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !583, file: !584, line: 30, baseType: !5, size: 32, offset: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !504, file: !164, line: 3377, baseType: !589, size: 256)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !164, line: 1437, size: 256, elements: !590)
!590 = !{!591, !592}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !589, file: !164, line: 1438, baseType: !540, size: 192)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !589, file: !164, line: 1439, baseType: !502, size: 64, offset: 192)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !504, file: !164, line: 3378, baseType: !594, size: 256)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !164, line: 1418, size: 256, elements: !595)
!595 = !{!596, !597, !598}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !594, file: !164, line: 1419, baseType: !540, size: 192)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !594, file: !164, line: 1420, baseType: !431, size: 32, offset: 192)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !594, file: !164, line: 1421, baseType: !599, size: 8, offset: 224)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 8, elements: !600)
!600 = !{!601}
!601 = !DISubrange(count: 1)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !504, file: !164, line: 3379, baseType: !603, size: 320)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !164, line: 1428, size: 320, elements: !604)
!604 = !{!605, !606, !607}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !603, file: !164, line: 1429, baseType: !540, size: 192)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !603, file: !164, line: 1430, baseType: !502, size: 64, offset: 192)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !603, file: !164, line: 1431, baseType: !502, size: 64, offset: 256)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !504, file: !164, line: 3380, baseType: !609, size: 320)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !164, line: 1460, size: 320, elements: !610)
!610 = !{!611, !612}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !609, file: !164, line: 1461, baseType: !540, size: 192)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !609, file: !164, line: 1462, baseType: !613, size: 128, offset: 192)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !614, line: 31, size: 128, elements: !615)
!614 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!615 = !{!616, !619, !620}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !613, file: !614, line: 32, baseType: !617, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !430)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !613, file: !614, line: 33, baseType: !7, size: 32, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !613, file: !614, line: 34, baseType: !7, size: 32, offset: 96)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !504, file: !164, line: 3381, baseType: !622, size: 384)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !164, line: 2507, size: 384, elements: !623)
!623 = !{!624, !625, !626, !627, !628}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !622, file: !164, line: 2508, baseType: !540, size: 192)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !622, file: !164, line: 2509, baseType: !495, size: 32, offset: 192)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !622, file: !164, line: 2510, baseType: !7, size: 32, offset: 224)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !622, file: !164, line: 2511, baseType: !502, size: 64, offset: 256)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !622, file: !164, line: 2512, baseType: !502, size: 64, offset: 320)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !504, file: !164, line: 3382, baseType: !630, size: 896)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !164, line: 2652, size: 896, elements: !631)
!631 = !{!632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !630, file: !164, line: 2653, baseType: !622, size: 384)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !630, file: !164, line: 2654, baseType: !502, size: 64, offset: 384)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !630, file: !164, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !630, file: !164, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !630, file: !164, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !630, file: !164, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !630, file: !164, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !630, file: !164, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !630, file: !164, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !630, file: !164, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !630, file: !164, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !630, file: !164, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !630, file: !164, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !630, file: !164, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !630, file: !164, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !630, file: !164, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !630, file: !164, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !630, file: !164, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !630, file: !164, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !630, file: !164, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !630, file: !164, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !630, file: !164, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !630, file: !164, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !630, file: !164, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !630, file: !164, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !630, file: !164, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !630, file: !164, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !630, file: !164, line: 2703, baseType: !7, size: 32, offset: 512)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !630, file: !164, line: 2705, baseType: !502, size: 64, offset: 576)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !630, file: !164, line: 2706, baseType: !502, size: 64, offset: 640)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !630, file: !164, line: 2707, baseType: !502, size: 64, offset: 704)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !630, file: !164, line: 2708, baseType: !502, size: 64, offset: 768)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !630, file: !164, line: 2711, baseType: !665, size: 64, offset: 832)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !164, line: 2711, flags: DIFlagFwdDecl)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !504, file: !164, line: 3383, baseType: !668, size: 960)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !164, line: 2756, size: 960, elements: !669)
!669 = !{!670, !671}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !668, file: !164, line: 2757, baseType: !630, size: 896)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !668, file: !164, line: 2758, baseType: !672, size: 64, offset: 896)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !423, line: 50, baseType: !673)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !675, line: 240, size: 384, elements: !676)
!675 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!676 = !{!677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !674, file: !675, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !674, file: !675, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !674, file: !675, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !674, file: !675, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !674, file: !675, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !674, file: !675, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !674, file: !675, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !674, file: !675, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !674, file: !675, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !674, file: !675, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !674, file: !675, line: 321, baseType: !688, size: 320, offset: 64)
!688 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !675, line: 315, size: 320, elements: !689)
!689 = !{!690, !808, !810, !839, !840}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !688, file: !675, line: 316, baseType: !691, size: 64)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !692, size: 64, elements: !600)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !675, line: 183, baseType: !693)
!693 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !675, line: 166, size: 64, elements: !694)
!694 = !{!695, !696, !697, !698, !699, !707, !708, !720, !723, !783, !784, !785, !798, !805}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !693, file: !675, line: 168, baseType: !431, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !693, file: !675, line: 169, baseType: !7, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !693, file: !675, line: 170, baseType: !436, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !693, file: !675, line: 171, baseType: !672, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !693, file: !675, line: 172, baseType: !700, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !423, line: 53, baseType: !701)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !675, line: 359, size: 128, elements: !703)
!703 = !{!704, !705}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !702, file: !675, line: 360, baseType: !431, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !702, file: !675, line: 361, baseType: !706, size: 64, offset: 64)
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !672, size: 64, elements: !600)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !693, file: !675, line: 173, baseType: !5, size: 32)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !693, file: !675, line: 174, baseType: !709, size: 32)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !675, line: 133, baseType: !710)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !675, line: 115, size: 32, elements: !711)
!711 = !{!712, !713, !714, !715, !716, !717, !718, !719}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !710, file: !675, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !710, file: !675, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !710, file: !675, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !710, file: !675, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !710, file: !675, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !710, file: !675, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !710, file: !675, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !710, file: !675, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !693, file: !675, line: 175, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !675, line: 175, flags: DIFlagFwdDecl)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !693, file: !675, line: 176, baseType: !724, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !726, line: 75, size: 256, elements: !727)
!726 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!727 = !{!728, !742, !743, !744}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !725, file: !726, line: 76, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !726, line: 68, baseType: !731)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !726, line: 63, size: 320, elements: !732)
!732 = !{!733, !735, !736, !737}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !731, file: !726, line: 64, baseType: !734, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !731, file: !726, line: 65, baseType: !734, size: 64, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !731, file: !726, line: 66, baseType: !7, size: 32, offset: 128)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !731, file: !726, line: 67, baseType: !738, size: 128, offset: 192)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !739, size: 128, elements: !740)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !726, line: 29, baseType: !555)
!740 = !{!741}
!741 = !DISubrange(count: 2)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !725, file: !726, line: 77, baseType: !729, size: 64, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !725, file: !726, line: 78, baseType: !7, size: 32, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !725, file: !726, line: 79, baseType: !745, size: 64, offset: 192)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !726, line: 49, baseType: !747)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !726, line: 45, size: 832, elements: !748)
!748 = !{!749, !750, !751}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !747, file: !726, line: 46, baseType: !734, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !747, file: !726, line: 47, baseType: !724, size: 64, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !747, file: !726, line: 48, baseType: !752, size: 704, offset: 128)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !753, line: 164, size: 704, elements: !754)
!753 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!754 = !{!755, !756, !766, !767, !768, !769, !770, !771, !775, !779, !780, !781, !782}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !752, file: !753, line: 166, baseType: !557, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !752, file: !753, line: 167, baseType: !757, size: 64, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !753, line: 157, size: 192, elements: !759)
!759 = !{!760, !761, !762}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !758, file: !753, line: 159, baseType: !433, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !758, file: !753, line: 160, baseType: !757, size: 64, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !758, file: !753, line: 161, baseType: !763, size: 32, offset: 128)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 32, elements: !764)
!764 = !{!765}
!765 = !DISubrange(count: 4)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !752, file: !753, line: 168, baseType: !433, size: 64, offset: 128)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !752, file: !753, line: 169, baseType: !433, size: 64, offset: 192)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !752, file: !753, line: 170, baseType: !433, size: 64, offset: 256)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !752, file: !753, line: 171, baseType: !557, size: 64, offset: 320)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !752, file: !753, line: 172, baseType: !431, size: 32, offset: 384)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !752, file: !753, line: 176, baseType: !772, size: 64, offset: 448)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{!757, !435, !557}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !752, file: !753, line: 177, baseType: !776, size: 64, offset: 512)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DISubroutineType(types: !778)
!778 = !{null, !435, !757}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !752, file: !753, line: 178, baseType: !435, size: 64, offset: 576)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !752, file: !753, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !752, file: !753, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !752, file: !753, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !693, file: !675, line: 177, baseType: !502, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !693, file: !675, line: 178, baseType: !440, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !693, file: !675, line: 179, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !675, line: 150, baseType: !788)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !675, line: 142, size: 320, elements: !789)
!789 = !{!790, !791, !792, !793, !796, !797}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !788, file: !675, line: 144, baseType: !502, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !788, file: !675, line: 145, baseType: !672, size: 64, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !788, file: !675, line: 146, baseType: !672, size: 64, offset: 128)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !788, file: !675, line: 147, baseType: !794, size: 32, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !795, line: 31, baseType: !431)
!795 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!796 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !788, file: !675, line: 148, baseType: !7, size: 32, offset: 224)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !788, file: !675, line: 149, baseType: !430, size: 8, offset: 256)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !693, file: !675, line: 180, baseType: !799, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !675, line: 162, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !675, line: 159, size: 128, elements: !802)
!802 = !{!803, !804}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !801, file: !675, line: 160, baseType: !502, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !801, file: !675, line: 161, baseType: !557, size: 64, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !693, file: !675, line: 181, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !675, line: 181, flags: DIFlagFwdDecl)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !688, file: !675, line: 317, baseType: !809, size: 64)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !557, size: 64, elements: !600)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !688, file: !675, line: 318, baseType: !811, size: 320)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !675, line: 188, size: 320, elements: !812)
!812 = !{!813, !815, !838}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !811, file: !675, line: 190, baseType: !814, size: 192)
!814 = !DICompositeType(tag: DW_TAG_array_type, baseType: !692, size: 192, elements: !575)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !811, file: !675, line: 193, baseType: !816, size: 64, offset: 192)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !675, line: 206, size: 320, elements: !818)
!818 = !{!819, !823, !824, !825, !837}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !817, file: !675, line: 208, baseType: !820, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !423, line: 62, baseType: !822)
!822 = !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !423, line: 61, flags: DIFlagFwdDecl)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !817, file: !675, line: 211, baseType: !7, size: 32, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !817, file: !675, line: 214, baseType: !557, size: 64, offset: 128)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !817, file: !675, line: 224, baseType: !826, size: 64, offset: 192)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !675, line: 202, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !675, line: 202, size: 128, elements: !829)
!829 = !{!830}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !828, file: !675, line: 202, baseType: !831, size: 128)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !675, line: 200, baseType: !832)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !675, line: 200, size: 128, elements: !833)
!833 = !{!834, !835, !836}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !832, file: !675, line: 200, baseType: !7, size: 32)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !832, file: !675, line: 200, baseType: !7, size: 32, offset: 32)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !832, file: !675, line: 200, baseType: !706, size: 64, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !817, file: !675, line: 234, baseType: !826, size: 64, offset: 256)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !811, file: !675, line: 197, baseType: !557, size: 64, offset: 256)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !688, file: !675, line: 319, baseType: !564, size: 256)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !688, file: !675, line: 320, baseType: !583, size: 192)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !504, file: !164, line: 3384, baseType: !842, size: 1472)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !164, line: 3114, size: 1472, elements: !843)
!843 = !{!844, !865, !866, !867, !868}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !842, file: !164, line: 3115, baseType: !845, size: 1216)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !164, line: 2984, size: 1216, elements: !846)
!846 = !{!847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !845, file: !164, line: 2985, baseType: !668, size: 960)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !845, file: !164, line: 2986, baseType: !502, size: 64, offset: 960)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !845, file: !164, line: 2987, baseType: !502, size: 64, offset: 1024)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !845, file: !164, line: 2988, baseType: !502, size: 64, offset: 1088)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !845, file: !164, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !845, file: !164, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !845, file: !164, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !845, file: !164, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !845, file: !164, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !845, file: !164, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !845, file: !164, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !845, file: !164, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !845, file: !164, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !845, file: !164, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !845, file: !164, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !845, file: !164, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !845, file: !164, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !845, file: !164, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !842, file: !164, line: 3117, baseType: !502, size: 64, offset: 1216)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !842, file: !164, line: 3119, baseType: !502, size: 64, offset: 1280)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !842, file: !164, line: 3121, baseType: !502, size: 64, offset: 1344)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !842, file: !164, line: 3123, baseType: !502, size: 64, offset: 1408)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !504, file: !164, line: 3385, baseType: !870, size: 1088)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !164, line: 2874, size: 1088, elements: !871)
!871 = !{!872, !873, !874}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !870, file: !164, line: 2875, baseType: !668, size: 960)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !870, file: !164, line: 2876, baseType: !672, size: 64, offset: 960)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !870, file: !164, line: 2877, baseType: !875, size: 64, offset: 1024)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !877, line: 172, size: 128, elements: !878)
!877 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!878 = !{!879, !880, !881, !882, !883, !884, !885}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !876, file: !877, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !876, file: !877, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !876, file: !877, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !876, file: !877, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !876, file: !877, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !876, file: !877, line: 195, baseType: !7, size: 32, offset: 32)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !876, file: !877, line: 199, baseType: !502, size: 64, offset: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !504, file: !164, line: 3386, baseType: !845, size: 1216)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !504, file: !164, line: 3387, baseType: !888, size: 1280)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !164, line: 3093, size: 1280, elements: !889)
!889 = !{!890, !891}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !888, file: !164, line: 3094, baseType: !845, size: 1216)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !888, file: !164, line: 3095, baseType: !875, size: 64, offset: 1216)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !504, file: !164, line: 3388, baseType: !893, size: 1216)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !164, line: 2824, size: 1216, elements: !894)
!894 = !{!895, !896, !897, !898, !899, !900}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !893, file: !164, line: 2825, baseType: !630, size: 896)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !893, file: !164, line: 2827, baseType: !502, size: 64, offset: 896)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !893, file: !164, line: 2828, baseType: !502, size: 64, offset: 960)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !893, file: !164, line: 2829, baseType: !502, size: 64, offset: 1024)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !893, file: !164, line: 2830, baseType: !502, size: 64, offset: 1088)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !893, file: !164, line: 2831, baseType: !502, size: 64, offset: 1152)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !504, file: !164, line: 3389, baseType: !902, size: 1024)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !164, line: 2850, size: 1024, elements: !903)
!903 = !{!904, !905, !906}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !902, file: !164, line: 2851, baseType: !668, size: 960)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !902, file: !164, line: 2852, baseType: !431, size: 32, offset: 960)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !902, file: !164, line: 2853, baseType: !431, size: 32, offset: 992)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !504, file: !164, line: 3390, baseType: !908, size: 1024)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !164, line: 2857, size: 1024, elements: !909)
!909 = !{!910, !911}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !908, file: !164, line: 2858, baseType: !668, size: 960)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !908, file: !164, line: 2859, baseType: !875, size: 64, offset: 960)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !504, file: !164, line: 3391, baseType: !913, size: 960)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !164, line: 2862, size: 960, elements: !914)
!914 = !{!915}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !913, file: !164, line: 2863, baseType: !668, size: 960)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !504, file: !164, line: 3392, baseType: !917, size: 1472)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !164, line: 3304, size: 1472, elements: !918)
!918 = !{!919}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !917, file: !164, line: 3305, baseType: !842, size: 1472)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !504, file: !164, line: 3393, baseType: !921, size: 1792)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !164, line: 3248, size: 1792, elements: !922)
!922 = !{!923, !924, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !921, file: !164, line: 3249, baseType: !842, size: 1472)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !921, file: !164, line: 3251, baseType: !925, size: 64, offset: 1472)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !927, line: 463, size: 1152, elements: !928)
!927 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!928 = !{!929, !932, !962, !963, !1104, !1167, !1168, !1169, !1170, !1171, !1172, !1196, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !926, file: !927, line: 464, baseType: !930, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !927, line: 464, flags: DIFlagFwdDecl)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !926, file: !927, line: 467, baseType: !933, size: 64, offset: 64)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !135, line: 374, size: 640, elements: !935)
!935 = !{!936, !937, !938, !951, !952, !953, !954, !955, !956, !958, !960, !961}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !934, file: !135, line: 377, baseType: !439, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !934, file: !135, line: 378, baseType: !439, size: 64, offset: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !934, file: !135, line: 381, baseType: !939, size: 64, offset: 128)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !135, line: 282, baseType: !941)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !135, line: 282, size: 128, elements: !942)
!942 = !{!943}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !941, file: !135, line: 282, baseType: !944, size: 128)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !135, line: 281, baseType: !945)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !135, line: 281, size: 128, elements: !946)
!946 = !{!947, !948, !949}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !945, file: !135, line: 281, baseType: !7, size: 32)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !945, file: !135, line: 281, baseType: !7, size: 32, offset: 32)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !945, file: !135, line: 281, baseType: !950, size: 64, offset: 64)
!950 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 64, elements: !600)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !934, file: !135, line: 384, baseType: !431, size: 32, offset: 192)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !934, file: !135, line: 387, baseType: !431, size: 32, offset: 224)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !934, file: !135, line: 390, baseType: !431, size: 32, offset: 256)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !934, file: !135, line: 394, baseType: !939, size: 64, offset: 320)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !934, file: !135, line: 396, baseType: !134, size: 32, offset: 384)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !934, file: !135, line: 399, baseType: !957, size: 64, offset: 416)
!957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 64, elements: !740)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !934, file: !135, line: 402, baseType: !959, size: 64, offset: 480)
!959 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !740)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !934, file: !135, line: 406, baseType: !431, size: 32, offset: 544)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !934, file: !135, line: 409, baseType: !431, size: 32, offset: 576)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !926, file: !927, line: 470, baseType: !467, size: 64, offset: 128)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !926, file: !927, line: 473, baseType: !964, size: 64, offset: 192)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !877, line: 39, size: 1152, elements: !966)
!966 = !{!967, !1019, !1032, !1045, !1046, !1058, !1059, !1063, !1064, !1065, !1066, !1067}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !965, file: !877, line: 41, baseType: !968, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !969, line: 144, baseType: !970)
!969 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !969, line: 100, size: 896, elements: !972)
!972 = !{!973, !981, !986, !991, !993, !996, !997, !998, !999, !1000, !1005, !1007, !1008, !1013, !1018}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !971, file: !969, line: 102, baseType: !974, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !969, line: 52, baseType: !975)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DISubroutineType(types: !977)
!977 = !{!978, !979}
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !969, line: 47, baseType: !7)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !971, file: !969, line: 105, baseType: !982, size: 64, offset: 64)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !969, line: 59, baseType: !983)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!431, !979, !979}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !971, file: !969, line: 108, baseType: !987, size: 64, offset: 128)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !969, line: 63, baseType: !988)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{null, !435}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !971, file: !969, line: 111, baseType: !992, size: 64, offset: 192)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !971, file: !969, line: 114, baseType: !994, size: 64, offset: 256)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !995, line: 46, baseType: !555)
!995 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!996 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !971, file: !969, line: 117, baseType: !994, size: 64, offset: 320)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !971, file: !969, line: 120, baseType: !994, size: 64, offset: 384)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !971, file: !969, line: 124, baseType: !7, size: 32, offset: 448)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !971, file: !969, line: 128, baseType: !7, size: 32, offset: 480)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !971, file: !969, line: 131, baseType: !1001, size: 64, offset: 512)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !969, line: 75, baseType: !1002)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!435, !994, !994}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !971, file: !969, line: 132, baseType: !1006, size: 64, offset: 576)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !969, line: 78, baseType: !988)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !971, file: !969, line: 135, baseType: !435, size: 64, offset: 640)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !971, file: !969, line: 136, baseType: !1009, size: 64, offset: 704)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !969, line: 82, baseType: !1010)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!435, !435, !994, !994}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !971, file: !969, line: 137, baseType: !1014, size: 64, offset: 768)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !969, line: 83, baseType: !1015)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{null, !435, !435}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !971, file: !969, line: 141, baseType: !7, size: 32, offset: 832)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !965, file: !877, line: 48, baseType: !1020, size: 64, offset: 64)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !469, line: 35, baseType: !1022)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !469, line: 35, size: 128, elements: !1023)
!1023 = !{!1024}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1022, file: !469, line: 35, baseType: !1025, size: 128)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !469, line: 33, baseType: !1026)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !469, line: 33, size: 128, elements: !1027)
!1027 = !{!1028, !1029, !1030}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1026, file: !469, line: 33, baseType: !7, size: 32)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1026, file: !469, line: 33, baseType: !7, size: 32, offset: 32)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1026, file: !469, line: 33, baseType: !1031, size: 64, offset: 64)
!1031 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 64, elements: !600)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !965, file: !877, line: 51, baseType: !1033, size: 64, offset: 128)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !164, line: 183, baseType: !1035)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !164, line: 183, size: 128, elements: !1036)
!1036 = !{!1037}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1035, file: !164, line: 183, baseType: !1038, size: 128)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !164, line: 182, baseType: !1039)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !164, line: 182, size: 128, elements: !1040)
!1040 = !{!1041, !1042, !1043}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1039, file: !164, line: 182, baseType: !7, size: 32)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1039, file: !164, line: 182, baseType: !7, size: 32, offset: 32)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1039, file: !164, line: 182, baseType: !1044, size: 64, offset: 64)
!1044 = !DICompositeType(tag: DW_TAG_array_type, baseType: !502, size: 64, elements: !600)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !965, file: !877, line: 54, baseType: !502, size: 64, offset: 192)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !965, file: !877, line: 57, baseType: !1047, size: 128, offset: 256)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1048, line: 31, size: 128, elements: !1049)
!1048 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1049 = !{!1050, !1051, !1052, !1053, !1054, !1055, !1056}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1047, file: !1048, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1047, file: !1048, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1047, file: !1048, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1047, file: !1048, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1047, file: !1048, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1047, file: !1048, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1047, file: !1048, line: 56, baseType: !1057, size: 64, offset: 64)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !423, line: 47, baseType: !724)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !965, file: !877, line: 60, baseType: !1047, size: 128, offset: 384)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !965, file: !877, line: 64, baseType: !1060, size: 64, offset: 512)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1062, line: 33, flags: DIFlagFwdDecl)
!1062 = !DIFile(filename: "./pointer-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !965, file: !877, line: 67, baseType: !502, size: 64, offset: 576)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !965, file: !877, line: 73, baseType: !968, size: 64, offset: 640)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !965, file: !877, line: 77, baseType: !1057, size: 64, offset: 704)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !965, file: !877, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !965, file: !877, line: 82, baseType: !1068, size: 320, offset: 832)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !1069, line: 62, size: 320, elements: !1070)
!1069 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1070 = !{!1071, !1077, !1078, !1079, !1080, !1087}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1068, file: !1069, line: 63, baseType: !1072, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !1069, line: 56, size: 128, elements: !1074)
!1074 = !{!1075, !1076}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1073, file: !1069, line: 57, baseType: !1072, size: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1073, file: !1069, line: 58, baseType: !599, size: 8, offset: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1068, file: !1069, line: 64, baseType: !7, size: 32, offset: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1068, file: !1069, line: 66, baseType: !7, size: 32, offset: 96)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1068, file: !1069, line: 68, baseType: !430, size: 8, offset: 128)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1068, file: !1069, line: 70, baseType: !1081, size: 64, offset: 192)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1069, line: 37, size: 128, elements: !1083)
!1083 = !{!1084, !1085}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1082, file: !1069, line: 39, baseType: !1081, size: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1082, file: !1069, line: 40, baseType: !1086, size: 64, offset: 64)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1068, file: !1069, line: 71, baseType: !1088, size: 64, offset: 256)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1069, line: 45, size: 320, elements: !1090)
!1090 = !{!1091, !1092}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1089, file: !1069, line: 47, baseType: !1088, size: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1089, file: !1069, line: 48, baseType: !1093, size: 256, offset: 64)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !164, line: 1883, size: 256, elements: !1094)
!1094 = !{!1095, !1097, !1098, !1103}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1093, file: !164, line: 1884, baseType: !1096, size: 64)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1093, file: !164, line: 1885, baseType: !1096, size: 64, offset: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1093, file: !164, line: 1891, baseType: !1099, size: 64, offset: 128)
!1099 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1093, file: !164, line: 1891, size: 64, elements: !1100)
!1100 = !{!1101, !1102}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1099, file: !164, line: 1891, baseType: !477, size: 64)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1099, file: !164, line: 1891, baseType: !502, size: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1093, file: !164, line: 1892, baseType: !1086, size: 64, offset: 192)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !926, file: !927, line: 476, baseType: !1105, size: 64, offset: 256)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !146, line: 187, size: 256, elements: !1107)
!1107 = !{!1108, !1109, !1165, !1166}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1106, file: !146, line: 189, baseType: !431, size: 32)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !1106, file: !146, line: 192, baseType: !1110, size: 64, offset: 64)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !146, line: 87, baseType: !1112)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !146, line: 87, size: 128, elements: !1113)
!1113 = !{!1114}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1112, file: !146, line: 87, baseType: !1115, size: 128)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !146, line: 85, baseType: !1116)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !146, line: 85, size: 128, elements: !1117)
!1117 = !{!1118, !1119, !1120}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1116, file: !146, line: 85, baseType: !7, size: 32)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1116, file: !146, line: 85, baseType: !7, size: 32, offset: 32)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1116, file: !146, line: 85, baseType: !1121, size: 64, offset: 64)
!1121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1122, size: 64, elements: !600)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !146, line: 84, baseType: !1123)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !146, line: 100, size: 1216, elements: !1125)
!1125 = !{!1126, !1127, !1128, !1129, !1130, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1155, !1163, !1164}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1124, file: !146, line: 102, baseType: !431, size: 32)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1124, file: !146, line: 105, baseType: !7, size: 32, offset: 32)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1124, file: !146, line: 108, baseType: !440, size: 64, offset: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1124, file: !146, line: 111, baseType: !440, size: 64, offset: 128)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1124, file: !146, line: 114, baseType: !1131, size: 64, offset: 192)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !146, line: 41, size: 64, elements: !1132)
!1132 = !{!1133, !1134}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1131, file: !146, line: 42, baseType: !145, size: 32)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1131, file: !146, line: 43, baseType: !7, size: 32, offset: 32)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1124, file: !146, line: 117, baseType: !7, size: 32, offset: 256)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1124, file: !146, line: 120, baseType: !7, size: 32, offset: 288)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1124, file: !146, line: 123, baseType: !1110, size: 64, offset: 320)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1124, file: !146, line: 126, baseType: !1123, size: 64, offset: 384)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1124, file: !146, line: 129, baseType: !1123, size: 64, offset: 448)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1124, file: !146, line: 132, baseType: !435, size: 64, offset: 512)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1124, file: !146, line: 139, baseType: !502, size: 64, offset: 576)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1124, file: !146, line: 143, baseType: !550, size: 128, offset: 640)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1124, file: !146, line: 146, baseType: !550, size: 128, offset: 768)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1124, file: !146, line: 148, baseType: !430, size: 8, offset: 896)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1124, file: !146, line: 149, baseType: !430, size: 8, offset: 904)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1124, file: !146, line: 153, baseType: !154, size: 32, offset: 928)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1124, file: !146, line: 156, baseType: !1148, size: 64, offset: 960)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !146, line: 48, size: 320, elements: !1150)
!1150 = !{!1151, !1152, !1153, !1154}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1149, file: !146, line: 50, baseType: !477, size: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1149, file: !146, line: 59, baseType: !550, size: 128, offset: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1149, file: !146, line: 64, baseType: !430, size: 8, offset: 192)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1149, file: !146, line: 67, baseType: !1148, size: 64, offset: 256)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1124, file: !146, line: 159, baseType: !1156, size: 64, offset: 1024)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !146, line: 72, size: 256, elements: !1158)
!1158 = !{!1159, !1160, !1161, !1162}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1157, file: !146, line: 74, baseType: !457, size: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1157, file: !146, line: 77, baseType: !1156, size: 64, offset: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1157, file: !146, line: 78, baseType: !1156, size: 64, offset: 128)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1157, file: !146, line: 81, baseType: !1156, size: 64, offset: 192)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1124, file: !146, line: 162, baseType: !430, size: 8, offset: 1088)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1124, file: !146, line: 166, baseType: !502, size: 64, offset: 1152)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1106, file: !146, line: 197, baseType: !968, size: 64, offset: 128)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !1106, file: !146, line: 200, baseType: !1123, size: 64, offset: 192)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !926, file: !927, line: 479, baseType: !968, size: 64, offset: 320)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !926, file: !927, line: 484, baseType: !502, size: 64, offset: 384)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !926, file: !927, line: 488, baseType: !502, size: 64, offset: 448)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !926, file: !927, line: 493, baseType: !502, size: 64, offset: 512)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !926, file: !927, line: 496, baseType: !502, size: 64, offset: 576)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !926, file: !927, line: 501, baseType: !1173, size: 64, offset: 640)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64)
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !159, line: 2355, size: 576, elements: !1175)
!1175 = !{!1176, !1179, !1180, !1181, !1182, !1184, !1185, !1190, !1191, !1192, !1193, !1194, !1195}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1174, file: !159, line: 2356, baseType: !1177, size: 64)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64)
!1178 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !159, line: 2356, flags: DIFlagFwdDecl)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1174, file: !159, line: 2357, baseType: !436, size: 64, offset: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1174, file: !159, line: 2358, baseType: !431, size: 32, offset: 128)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1174, file: !159, line: 2359, baseType: !431, size: 32, offset: 160)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1174, file: !159, line: 2360, baseType: !1183, size: 128, offset: 192)
!1183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 128, elements: !764)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1174, file: !159, line: 2364, baseType: !431, size: 32, offset: 320)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1174, file: !159, line: 2367, baseType: !1186, size: 128, offset: 384)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !159, line: 2349, size: 128, elements: !1187)
!1187 = !{!1188, !1189}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1186, file: !159, line: 2351, baseType: !672, size: 64)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1186, file: !159, line: 2352, baseType: !557, size: 64, offset: 64)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1174, file: !159, line: 2371, baseType: !158, size: 32, offset: 512)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1174, file: !159, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1174, file: !159, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1174, file: !159, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1174, file: !159, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1174, file: !159, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !926, file: !927, line: 504, baseType: !1197, size: 64, offset: 704)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64)
!1198 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !927, line: 504, flags: DIFlagFwdDecl)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !926, file: !927, line: 507, baseType: !968, size: 64, offset: 768)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !926, file: !927, line: 510, baseType: !431, size: 32, offset: 832)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !926, file: !927, line: 513, baseType: !431, size: 32, offset: 864)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !926, file: !927, line: 516, baseType: !495, size: 32, offset: 896)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !926, file: !927, line: 519, baseType: !495, size: 32, offset: 928)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !926, file: !927, line: 522, baseType: !7, size: 32, offset: 960)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !926, file: !927, line: 523, baseType: !7, size: 32, offset: 992)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !926, file: !927, line: 528, baseType: !436, size: 64, offset: 1024)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !926, file: !927, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !926, file: !927, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !926, file: !927, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !926, file: !927, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !926, file: !927, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !926, file: !927, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !926, file: !927, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !926, file: !927, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !926, file: !927, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !926, file: !927, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !926, file: !927, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !926, file: !927, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !926, file: !927, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
