; ModuleID = 'cfgloop.bc'
source_filename = "cfgloop.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }

!331 = !DIEnumerator(name: "POLYNOMIAL_CHREC", value: 146, isUnsigned: true)
!332 = !DIEnumerator(name: "STATEMENT_LIST", value: 147, isUnsigned: true)
!333 = !DIEnumerator(name: "ASSERT_EXPR", value: 148, isUnsigned: true)
!334 = !DIEnumerator(name: "TREE_BINFO", value: 149, isUnsigned: true)
!335 = !DIEnumerator(name: "WITH_SIZE_EXPR", value: 150, isUnsigned: true)
!336 = !DIEnumerator(name: "REALIGN_LOAD_EXPR", value: 151, isUnsigned: true)
!337 = !DIEnumerator(name: "TARGET_MEM_REF", value: 152, isUnsigned: true)
!338 = !DIEnumerator(name: "OMP_PARALLEL", value: 153, isUnsigned: true)
!339 = !DIEnumerator(name: "OMP_TASK", value: 154, isUnsigned: true)
!340 = !DIEnumerator(name: "OMP_FOR", value: 155, isUnsigned: true)
!341 = !DIEnumerator(name: "OMP_SECTIONS", value: 156, isUnsigned: true)
!342 = !DIEnumerator(name: "OMP_SINGLE", value: 157, isUnsigned: true)
!343 = !DIEnumerator(name: "OMP_SECTION", value: 158, isUnsigned: true)
!344 = !DIEnumerator(name: "OMP_MASTER", value: 159, isUnsigned: true)
!345 = !DIEnumerator(name: "OMP_ORDERED", value: 160, isUnsigned: true)
!346 = !DIEnumerator(name: "OMP_CRITICAL", value: 161, isUnsigned: true)
!347 = !DIEnumerator(name: "OMP_ATOMIC", value: 162, isUnsigned: true)
!348 = !DIEnumerator(name: "OMP_CLAUSE", value: 163, isUnsigned: true)
!349 = !DIEnumerator(name: "REDUC_MAX_EXPR", value: 164, isUnsigned: true)
!350 = !DIEnumerator(name: "REDUC_MIN_EXPR", value: 165, isUnsigned: true)
!351 = !DIEnumerator(name: "REDUC_PLUS_EXPR", value: 166, isUnsigned: true)
!352 = !DIEnumerator(name: "DOT_PROD_EXPR", value: 167, isUnsigned: true)
!353 = !DIEnumerator(name: "WIDEN_SUM_EXPR", value: 168, isUnsigned: true)
!354 = !DIEnumerator(name: "WIDEN_MULT_EXPR", value: 169, isUnsigned: true)
!355 = !DIEnumerator(name: "VEC_LSHIFT_EXPR", value: 170, isUnsigned: true)
!356 = !DIEnumerator(name: "VEC_RSHIFT_EXPR", value: 171, isUnsigned: true)
!357 = !DIEnumerator(name: "VEC_WIDEN_MULT_HI_EXPR", value: 172, isUnsigned: true)
!358 = !DIEnumerator(name: "VEC_WIDEN_MULT_LO_EXPR", value: 173, isUnsigned: true)
!359 = !DIEnumerator(name: "VEC_UNPACK_HI_EXPR", value: 174, isUnsigned: true)
!360 = !DIEnumerator(name: "VEC_UNPACK_LO_EXPR", value: 175, isUnsigned: true)
!361 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_HI_EXPR", value: 176, isUnsigned: true)
!362 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_LO_EXPR", value: 177, isUnsigned: true)
!363 = !DIEnumerator(name: "VEC_PACK_TRUNC_EXPR", value: 178, isUnsigned: true)
!364 = !DIEnumerator(name: "VEC_PACK_SAT_EXPR", value: 179, isUnsigned: true)
!365 = !DIEnumerator(name: "VEC_PACK_FIX_TRUNC_EXPR", value: 180, isUnsigned: true)
!366 = !DIEnumerator(name: "VEC_EXTRACT_EVEN_EXPR", value: 181, isUnsigned: true)
!367 = !DIEnumerator(name: "VEC_EXTRACT_ODD_EXPR", value: 182, isUnsigned: true)
!368 = !DIEnumerator(name: "VEC_INTERLEAVE_HIGH_EXPR", value: 183, isUnsigned: true)
!369 = !DIEnumerator(name: "VEC_INTERLEAVE_LOW_EXPR", value: 184, isUnsigned: true)
!370 = !DIEnumerator(name: "PREDICT_EXPR", value: 185, isUnsigned: true)
!371 = !DIEnumerator(name: "OPTIMIZATION_NODE", value: 186, isUnsigned: true)
!372 = !DIEnumerator(name: "TARGET_OPTION_NODE", value: 187, isUnsigned: true)
!373 = !DIEnumerator(name: "LAST_AND_UNUSED_TREE_CODE", value: 188, isUnsigned: true)
!374 = !DIEnumerator(name: "C_MAYBE_CONST_EXPR", value: 189, isUnsigned: true)
!375 = !DIEnumerator(name: "EXCESS_PRECISION_EXPR", value: 190, isUnsigned: true)
!376 = !DIEnumerator(name: "MAX_TREE_CODES", value: 191, isUnsigned: true)
!377 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "lpt_dec", file: !378, line: 31, baseType: !7, size: 32, elements: !379)
!378 = !DIFile(filename: "./cfgloop.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!379 = !{!380, !381, !382, !383, !384, !385}
!380 = !DIEnumerator(name: "LPT_NONE", value: 0, isUnsigned: true)
!381 = !DIEnumerator(name: "LPT_PEEL_COMPLETELY", value: 1, isUnsigned: true)
!382 = !DIEnumerator(name: "LPT_PEEL_SIMPLE", value: 2, isUnsigned: true)
!383 = !DIEnumerator(name: "LPT_UNROLL_CONSTANT", value: 3, isUnsigned: true)
!384 = !DIEnumerator(name: "LPT_UNROLL_RUNTIME", value: 4, isUnsigned: true)
!385 = !DIEnumerator(name: "LPT_UNROLL_STUPID", value: 5, isUnsigned: true)
!386 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "loop_estimation", file: !378, line: 91, baseType: !7, size: 32, elements: !387)
!387 = !{!388, !389}
!388 = !DIEnumerator(name: "EST_NOT_COMPUTED", value: 0, isUnsigned: true)
!389 = !DIEnumerator(name: "EST_AVAILABLE", value: 1, isUnsigned: true)
!390 = !{!391, !392, !393, !394, !397, !398, !400, !401, !1777, !470, !1786, !7, !1787, !1057, !1788, !423, !1789, !1122, !1802, !1110, !523, !183, !1807, !1809, !1811, !1862}
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!393 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !396)
!400 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !378, line: 100, size: 1216, elements: !403)
!403 = !{!404, !405, !406, !1750, !1751, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1776, !1784, !1785}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !402, file: !378, line: 102, baseType: !393, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !402, file: !378, line: 105, baseType: !7, size: 32, offset: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !402, file: !378, line: 108, baseType: !407, size: 64, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !135, line: 217, size: 832, elements: !409)
!409 = !{!410, !1717, !1718, !1719, !1720, !1724, !1725, !1726, !1744, !1745, !1746, !1747, !1748, !1749}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !408, file: !135, line: 219, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !135, line: 151, baseType: !413)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !135, line: 151, size: 128, elements: !414)
!414 = !{!415}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !413, file: !135, line: 151, baseType: !416, size: 128)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !135, line: 150, baseType: !417)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !135, line: 150, size: 128, elements: !418)
!418 = !{!419, !420, !421}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !417, file: !135, line: 150, baseType: !7, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !417, file: !135, line: 150, baseType: !7, size: 32, offset: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !417, file: !135, line: 150, baseType: !422, size: 64, offset: 64)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !423, size: 64, elements: !567)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !424, line: 108, baseType: !425)
!424 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !135, line: 122, size: 512, elements: !427)
!427 = !{!428, !429, !430, !1709, !1710, !1711, !1712, !1713, !1714, !1715}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !426, file: !135, line: 124, baseType: !407, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !426, file: !135, line: 125, baseType: !407, size: 64, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !426, file: !135, line: 131, baseType: !431, size: 64, offset: 128)
!431 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !135, line: 128, size: 64, elements: !432)
!432 = !{!433, !1708}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !431, file: !135, line: 129, baseType: !434, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !424, line: 66, baseType: !435)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !437, line: 143, size: 192, elements: !438)
!437 = !DIFile(filename: "./gimple.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!438 = !{!439, !1706, !1707}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !436, file: !437, line: 145, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !424, line: 69, baseType: !441)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !437, line: 136, size: 192, elements: !443)
!443 = !{!444, !1704, !1705}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !442, file: !437, line: 137, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !424, line: 58, baseType: !446)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !437, line: 737, size: 768, elements: !448)
!448 = !{!449, !1551, !1561, !1567, !1572, !1577, !1584, !1590, !1596, !1601, !1615, !1620, !1626, !1631, !1641, !1646, !1662, !1669, !1676, !1682, !1687, !1693, !1699}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !447, file: !437, line: 738, baseType: !450, size: 256)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !437, line: 271, size: 256, elements: !451)
!451 = !{!452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !467, !468, !469}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !450, file: !437, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !450, file: !437, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !450, file: !437, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !450, file: !437, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !450, file: !437, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !450, file: !437, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !450, file: !437, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !450, file: !437, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !450, file: !437, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !450, file: !437, line: 312, baseType: !7, size: 32, offset: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !450, file: !437, line: 316, baseType: !463, size: 32, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !464, line: 58, baseType: !465)
!464 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !466, line: 44, baseType: !7)
!466 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!467 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !450, file: !437, line: 319, baseType: !7, size: 32, offset: 96)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !450, file: !437, line: 323, baseType: !407, size: 64, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !450, file: !437, line: 327, baseType: !470, size: 64, offset: 192)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !424, line: 56, baseType: !471)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !151, line: 3371, size: 1792, elements: !473)
!473 = !{!474, !507, !513, !525, !544, !555, !560, !569, !575, !588, !596, !634, !842, !870, !887, !888, !893, !902, !908, !913, !917, !921, !1202, !1249, !1255, !1261, !1268, !1281, !1295, !1312, !1324, !1346, !1361, !1533}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !472, file: !151, line: 3372, baseType: !475, size: 64)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !151, line: 360, size: 64, elements: !476)
!476 = !{!477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !475, file: !151, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !475, file: !151, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !475, file: !151, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !475, file: !151, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !475, file: !151, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !475, file: !151, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !475, file: !151, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !475, file: !151, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !475, file: !151, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !475, file: !151, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !475, file: !151, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !475, file: !151, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !475, file: !151, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !475, file: !151, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !475, file: !151, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !475, file: !151, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !475, file: !151, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !475, file: !151, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !475, file: !151, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !475, file: !151, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !475, file: !151, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !475, file: !151, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !475, file: !151, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !475, file: !151, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !475, file: !151, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !475, file: !151, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !475, file: !151, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !475, file: !151, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !475, file: !151, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !475, file: !151, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !472, file: !151, line: 3373, baseType: !508, size: 192)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !151, line: 402, size: 192, elements: !509)
!509 = !{!510, !511, !512}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !508, file: !151, line: 403, baseType: !475, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !508, file: !151, line: 404, baseType: !470, size: 64, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !508, file: !151, line: 405, baseType: !470, size: 64, offset: 128)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !472, file: !151, line: 3374, baseType: !514, size: 320)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !151, line: 1384, size: 320, elements: !515)
!515 = !{!516, !517}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !514, file: !151, line: 1385, baseType: !508, size: 192)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !514, file: !151, line: 1386, baseType: !518, size: 128, offset: 192)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !519, line: 58, baseType: !520)
!519 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !519, line: 54, size: 128, elements: !521)
!521 = !{!522, !524}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !520, file: !519, line: 56, baseType: !523, size: 64)
!523 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !520, file: !519, line: 57, baseType: !400, size: 64, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !472, file: !151, line: 3375, baseType: !526, size: 256)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !151, line: 1397, size: 256, elements: !527)
!527 = !{!528, !529}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !526, file: !151, line: 1398, baseType: !508, size: 192)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !526, file: !151, line: 1399, baseType: !530, size: 64, offset: 192)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !532, line: 52, size: 256, elements: !533)
!532 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!533 = !{!534, !535, !536, !537, !538, !539, !540}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !531, file: !532, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !531, file: !532, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !531, file: !532, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !531, file: !532, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !531, file: !532, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !531, file: !532, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !531, file: !532, line: 62, baseType: !541, size: 192, offset: 64)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !523, size: 192, elements: !542)
!542 = !{!543}
!543 = !DISubrange(count: 3)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !472, file: !151, line: 3376, baseType: !545, size: 256)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !151, line: 1408, size: 256, elements: !546)
!546 = !{!547, !548}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !545, file: !151, line: 1409, baseType: !508, size: 192)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !545, file: !151, line: 1410, baseType: !549, size: 64, offset: 192)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !551, line: 27, size: 192, elements: !552)
!551 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!552 = !{!553, !554}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !550, file: !551, line: 29, baseType: !518, size: 128)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !550, file: !551, line: 30, baseType: !5, size: 32, offset: 128)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !472, file: !151, line: 3377, baseType: !556, size: 256)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !151, line: 1437, size: 256, elements: !557)
!557 = !{!558, !559}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !556, file: !151, line: 1438, baseType: !508, size: 192)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !556, file: !151, line: 1439, baseType: !470, size: 64, offset: 192)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !472, file: !151, line: 3378, baseType: !561, size: 256)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !151, line: 1418, size: 256, elements: !562)
!562 = !{!563, !564, !565}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !561, file: !151, line: 1419, baseType: !508, size: 192)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !561, file: !151, line: 1420, baseType: !393, size: 32, offset: 192)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !561, file: !151, line: 1421, baseType: !566, size: 8, offset: 224)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !396, size: 8, elements: !567)
!567 = !{!568}
!568 = !DISubrange(count: 1)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !472, file: !151, line: 3379, baseType: !570, size: 320)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !151, line: 1428, size: 320, elements: !571)
!571 = !{!572, !573, !574}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !570, file: !151, line: 1429, baseType: !508, size: 192)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !570, file: !151, line: 1430, baseType: !470, size: 64, offset: 192)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !570, file: !151, line: 1431, baseType: !470, size: 64, offset: 256)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !472, file: !151, line: 3380, baseType: !576, size: 320)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !151, line: 1460, size: 320, elements: !577)
!577 = !{!578, !579}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !576, file: !151, line: 1461, baseType: !508, size: 192)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !576, file: !151, line: 1462, baseType: !580, size: 128, offset: 192)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !581, line: 31, size: 128, elements: !582)
!581 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!582 = !{!583, !586, !587}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !580, file: !581, line: 32, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !392)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !580, file: !581, line: 33, baseType: !7, size: 32, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !580, file: !581, line: 34, baseType: !7, size: 32, offset: 96)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !472, file: !151, line: 3381, baseType: !589, size: 384)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !151, line: 2507, size: 384, elements: !590)
!590 = !{!591, !592, !593, !594, !595}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !589, file: !151, line: 2508, baseType: !508, size: 192)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !589, file: !151, line: 2509, baseType: !463, size: 32, offset: 192)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !589, file: !151, line: 2510, baseType: !7, size: 32, offset: 224)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !589, file: !151, line: 2511, baseType: !470, size: 64, offset: 256)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !589, file: !151, line: 2512, baseType: !470, size: 64, offset: 320)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !472, file: !151, line: 3382, baseType: !597, size: 896)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !151, line: 2652, size: 896, elements: !598)
!598 = !{!599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !597, file: !151, line: 2653, baseType: !589, size: 384)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !597, file: !151, line: 2654, baseType: !470, size: 64, offset: 384)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !597, file: !151, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !597, file: !151, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !597, file: !151, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !597, file: !151, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !597, file: !151, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !597, file: !151, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !597, file: !151, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !597, file: !151, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !597, file: !151, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !597, file: !151, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !597, file: !151, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !597, file: !151, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !597, file: !151, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !597, file: !151, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !597, file: !151, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !597, file: !151, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !597, file: !151, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !597, file: !151, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !597, file: !151, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !597, file: !151, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !597, file: !151, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !597, file: !151, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !597, file: !151, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !597, file: !151, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !597, file: !151, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !597, file: !151, line: 2703, baseType: !7, size: 32, offset: 512)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !597, file: !151, line: 2705, baseType: !470, size: 64, offset: 576)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !597, file: !151, line: 2706, baseType: !470, size: 64, offset: 640)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !597, file: !151, line: 2707, baseType: !470, size: 64, offset: 704)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !597, file: !151, line: 2708, baseType: !470, size: 64, offset: 768)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !597, file: !151, line: 2711, baseType: !632, size: 64, offset: 832)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !151, line: 2711, flags: DIFlagFwdDecl)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !472, file: !151, line: 3383, baseType: !635, size: 960)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !151, line: 2756, size: 960, elements: !636)
!636 = !{!637, !638}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !635, file: !151, line: 2757, baseType: !597, size: 896)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !635, file: !151, line: 2758, baseType: !639, size: 64, offset: 896)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !424, line: 50, baseType: !640)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !642, line: 240, size: 384, elements: !643)
!642 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!643 = !{!644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !641, file: !642, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !641, file: !642, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !641, file: !642, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !641, file: !642, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !641, file: !642, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !641, file: !642, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !641, file: !642, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !641, file: !642, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !641, file: !642, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !641, file: !642, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !641, file: !642, line: 321, baseType: !655, size: 320, offset: 64)
!655 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !642, line: 315, size: 320, elements: !656)
!656 = !{!657, !775, !777, !840, !841}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !655, file: !642, line: 316, baseType: !658, size: 64)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !659, size: 64, elements: !567)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !642, line: 183, baseType: !660)
!660 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !642, line: 166, size: 64, elements: !661)
!661 = !{!662, !663, !664, !665, !666, !674, !675, !687, !690, !750, !751, !752, !765, !772}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !660, file: !642, line: 168, baseType: !393, size: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !660, file: !642, line: 169, baseType: !7, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !660, file: !642, line: 170, baseType: !398, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !660, file: !642, line: 171, baseType: !639, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !660, file: !642, line: 172, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !424, line: 53, baseType: !668)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !642, line: 359, size: 128, elements: !670)
!670 = !{!671, !672}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !669, file: !642, line: 360, baseType: !393, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !669, file: !642, line: 361, baseType: !673, size: 64, offset: 64)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !639, size: 64, elements: !567)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !660, file: !642, line: 173, baseType: !5, size: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !660, file: !642, line: 174, baseType: !676, size: 32)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !642, line: 133, baseType: !677)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !642, line: 115, size: 32, elements: !678)
!678 = !{!679, !680, !681, !682, !683, !684, !685, !686}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !677, file: !642, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !677, file: !642, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !677, file: !642, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !677, file: !642, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !677, file: !642, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !677, file: !642, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !677, file: !642, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !677, file: !642, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !660, file: !642, line: 175, baseType: !688, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !642, line: 175, flags: DIFlagFwdDecl)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !660, file: !642, line: 176, baseType: !691, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !693, line: 75, size: 256, elements: !694)
!693 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!694 = !{!695, !709, !710, !711}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !692, file: !693, line: 76, baseType: !696, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !693, line: 68, baseType: !698)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !693, line: 63, size: 320, elements: !699)
!699 = !{!700, !702, !703, !704}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !698, file: !693, line: 64, baseType: !701, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !698, file: !693, line: 65, baseType: !701, size: 64, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !698, file: !693, line: 66, baseType: !7, size: 32, offset: 128)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !698, file: !693, line: 67, baseType: !705, size: 128, offset: 192)
!705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !706, size: 128, elements: !707)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !693, line: 29, baseType: !523)
!707 = !{!708}
!708 = !DISubrange(count: 2)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !692, file: !693, line: 77, baseType: !696, size: 64, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !692, file: !693, line: 78, baseType: !7, size: 32, offset: 128)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !692, file: !693, line: 79, baseType: !712, size: 64, offset: 192)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !693, line: 49, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !693, line: 45, size: 832, elements: !715)
!715 = !{!716, !717, !718}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !714, file: !693, line: 46, baseType: !701, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !714, file: !693, line: 47, baseType: !691, size: 64, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !714, file: !693, line: 48, baseType: !719, size: 704, offset: 128)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !720, line: 164, size: 704, elements: !721)
!720 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!721 = !{!722, !723, !733, !734, !735, !736, !737, !738, !742, !746, !747, !748, !749}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !719, file: !720, line: 166, baseType: !400, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !719, file: !720, line: 167, baseType: !724, size: 64, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !720, line: 157, size: 192, elements: !726)
!726 = !{!727, !728, !729}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !725, file: !720, line: 159, baseType: !395, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !725, file: !720, line: 160, baseType: !724, size: 64, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !725, file: !720, line: 161, baseType: !730, size: 32, offset: 128)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !396, size: 32, elements: !731)
!731 = !{!732}
!732 = !DISubrange(count: 4)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !719, file: !720, line: 168, baseType: !395, size: 64, offset: 128)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !719, file: !720, line: 169, baseType: !395, size: 64, offset: 192)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !719, file: !720, line: 170, baseType: !395, size: 64, offset: 256)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !719, file: !720, line: 171, baseType: !400, size: 64, offset: 320)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !719, file: !720, line: 172, baseType: !393, size: 32, offset: 384)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !719, file: !720, line: 176, baseType: !739, size: 64, offset: 448)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!724, !397, !400}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !719, file: !720, line: 177, baseType: !743, size: 64, offset: 512)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{null, !397, !724}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !719, file: !720, line: 178, baseType: !397, size: 64, offset: 576)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !719, file: !720, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !719, file: !720, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !719, file: !720, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !660, file: !642, line: 177, baseType: !470, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !660, file: !642, line: 178, baseType: !407, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !660, file: !642, line: 179, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !642, line: 150, baseType: !755)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !642, line: 142, size: 320, elements: !756)
!756 = !{!757, !758, !759, !760, !763, !764}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !755, file: !642, line: 144, baseType: !470, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !755, file: !642, line: 145, baseType: !639, size: 64, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !755, file: !642, line: 146, baseType: !639, size: 64, offset: 128)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !755, file: !642, line: 147, baseType: !761, size: 32, offset: 192)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !762, line: 31, baseType: !393)
!762 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!763 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !755, file: !642, line: 148, baseType: !7, size: 32, offset: 224)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !755, file: !642, line: 149, baseType: !392, size: 8, offset: 256)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !660, file: !642, line: 180, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !642, line: 162, baseType: !768)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !642, line: 159, size: 128, elements: !769)
!769 = !{!770, !771}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !768, file: !642, line: 160, baseType: !470, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !768, file: !642, line: 161, baseType: !400, size: 64, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !660, file: !642, line: 181, baseType: !773, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !642, line: 181, flags: DIFlagFwdDecl)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !655, file: !642, line: 317, baseType: !776, size: 64)
!776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !400, size: 64, elements: !567)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !655, file: !642, line: 318, baseType: !778, size: 320)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !642, line: 188, size: 320, elements: !779)
!779 = !{!780, !782, !839}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !778, file: !642, line: 190, baseType: !781, size: 192)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !659, size: 192, elements: !542)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !778, file: !642, line: 193, baseType: !783, size: 64, offset: 192)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !642, line: 206, size: 320, elements: !785)
!785 = !{!786, !824, !825, !826, !838}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !784, file: !642, line: 208, baseType: !787, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !424, line: 62, baseType: !789)
!789 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !790, line: 538, size: 256, elements: !791)
!790 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!791 = !{!792, !796, !802, !815}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !789, file: !790, line: 539, baseType: !793, size: 32)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !790, line: 482, size: 32, elements: !794)
!794 = !{!795}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !793, file: !790, line: 484, baseType: !7, size: 32)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !789, file: !790, line: 540, baseType: !797, size: 192)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !790, line: 488, size: 192, elements: !798)
!798 = !{!799, !800, !801}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !797, file: !790, line: 489, baseType: !793, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !797, file: !790, line: 492, baseType: !398, size: 64, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !797, file: !790, line: 496, baseType: !470, size: 64, offset: 128)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !789, file: !790, line: 541, baseType: !803, size: 256)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !790, line: 504, size: 256, elements: !804)
!804 = !{!805, !806, !813, !814}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !803, file: !790, line: 505, baseType: !793, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !803, file: !790, line: 509, baseType: !807, size: 64, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !790, line: 501, baseType: !808)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DISubroutineType(types: !810)
!810 = !{null, !811}
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !803, file: !790, line: 510, baseType: !811, size: 64, offset: 128)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !803, file: !790, line: 513, baseType: !787, size: 64, offset: 192)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !789, file: !790, line: 542, baseType: !816, size: 128)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !790, line: 530, size: 128, elements: !817)
!817 = !{!818, !819}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !816, file: !790, line: 531, baseType: !793, size: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !816, file: !790, line: 534, baseType: !820, size: 64, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !790, line: 525, baseType: !821)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DISubroutineType(types: !823)
!823 = !{!392, !470, !398, !523, !523}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !784, file: !642, line: 211, baseType: !7, size: 32, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !784, file: !642, line: 214, baseType: !400, size: 64, offset: 128)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !784, file: !642, line: 224, baseType: !827, size: 64, offset: 192)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !642, line: 202, baseType: !829)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !642, line: 202, size: 128, elements: !830)
!830 = !{!831}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !829, file: !642, line: 202, baseType: !832, size: 128)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !642, line: 200, baseType: !833)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !642, line: 200, size: 128, elements: !834)
!834 = !{!835, !836, !837}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !833, file: !642, line: 200, baseType: !7, size: 32)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !833, file: !642, line: 200, baseType: !7, size: 32, offset: 32)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !833, file: !642, line: 200, baseType: !673, size: 64, offset: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !784, file: !642, line: 234, baseType: !827, size: 64, offset: 256)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !778, file: !642, line: 197, baseType: !400, size: 64, offset: 256)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !655, file: !642, line: 319, baseType: !531, size: 256)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !655, file: !642, line: 320, baseType: !550, size: 192)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !472, file: !151, line: 3384, baseType: !843, size: 1472)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !151, line: 3114, size: 1472, elements: !844)
!844 = !{!845, !866, !867, !868, !869}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !843, file: !151, line: 3115, baseType: !846, size: 1216)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !151, line: 2984, size: 1216, elements: !847)
!847 = !{!848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !846, file: !151, line: 2985, baseType: !635, size: 960)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !846, file: !151, line: 2986, baseType: !470, size: 64, offset: 960)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !846, file: !151, line: 2987, baseType: !470, size: 64, offset: 1024)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !846, file: !151, line: 2988, baseType: !470, size: 64, offset: 1088)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !846, file: !151, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !846, file: !151, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !846, file: !151, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !846, file: !151, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !846, file: !151, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !846, file: !151, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !846, file: !151, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !846, file: !151, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !846, file: !151, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !846, file: !151, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !846, file: !151, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !846, file: !151, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !846, file: !151, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !846, file: !151, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !843, file: !151, line: 3117, baseType: !470, size: 64, offset: 1216)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !843, file: !151, line: 3119, baseType: !470, size: 64, offset: 1280)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !843, file: !151, line: 3121, baseType: !470, size: 64, offset: 1344)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !843, file: !151, line: 3123, baseType: !470, size: 64, offset: 1408)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !472, file: !151, line: 3385, baseType: !871, size: 1088)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !151, line: 2874, size: 1088, elements: !872)
!872 = !{!873, !874, !875}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !871, file: !151, line: 2875, baseType: !635, size: 960)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !871, file: !151, line: 2876, baseType: !639, size: 64, offset: 960)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !871, file: !151, line: 2877, baseType: !876, size: 64, offset: 1024)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !878, line: 172, size: 128, elements: !879)
!878 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!879 = !{!880, !881, !882, !883, !884, !885, !886}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !877, file: !878, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !877, file: !878, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !877, file: !878, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !877, file: !878, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !877, file: !878, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !877, file: !878, line: 195, baseType: !7, size: 32, offset: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !877, file: !878, line: 199, baseType: !470, size: 64, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !472, file: !151, line: 3386, baseType: !846, size: 1216)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !472, file: !151, line: 3387, baseType: !889, size: 1280)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !151, line: 3093, size: 1280, elements: !890)
!890 = !{!891, !892}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !889, file: !151, line: 3094, baseType: !846, size: 1216)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !889, file: !151, line: 3095, baseType: !876, size: 64, offset: 1216)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !472, file: !151, line: 3388, baseType: !894, size: 1216)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !151, line: 2824, size: 1216, elements: !895)
!895 = !{!896, !897, !898, !899, !900, !901}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !894, file: !151, line: 2825, baseType: !597, size: 896)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !894, file: !151, line: 2827, baseType: !470, size: 64, offset: 896)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !894, file: !151, line: 2828, baseType: !470, size: 64, offset: 960)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !894, file: !151, line: 2829, baseType: !470, size: 64, offset: 1024)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !894, file: !151, line: 2830, baseType: !470, size: 64, offset: 1088)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !894, file: !151, line: 2831, baseType: !470, size: 64, offset: 1152)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !472, file: !151, line: 3389, baseType: !903, size: 1024)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !151, line: 2850, size: 1024, elements: !904)
!904 = !{!905, !906, !907}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !903, file: !151, line: 2851, baseType: !635, size: 960)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !903, file: !151, line: 2852, baseType: !393, size: 32, offset: 960)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !903, file: !151, line: 2853, baseType: !393, size: 32, offset: 992)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !472, file: !151, line: 3390, baseType: !909, size: 1024)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !151, line: 2857, size: 1024, elements: !910)
!910 = !{!911, !912}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !909, file: !151, line: 2858, baseType: !635, size: 960)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !909, file: !151, line: 2859, baseType: !876, size: 64, offset: 960)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !472, file: !151, line: 3391, baseType: !914, size: 960)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !151, line: 2862, size: 960, elements: !915)
!915 = !{!916}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !914, file: !151, line: 2863, baseType: !635, size: 960)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !472, file: !151, line: 3392, baseType: !918, size: 1472)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !151, line: 3304, size: 1472, elements: !919)
!919 = !{!920}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !918, file: !151, line: 3305, baseType: !843, size: 1472)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !472, file: !151, line: 3393, baseType: !922, size: 1792)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !151, line: 3248, size: 1792, elements: !923)
!923 = !{!924, !925, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !922, file: !151, line: 3249, baseType: !843, size: 1472)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !922, file: !151, line: 3251, baseType: !926, size: 64, offset: 1472)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !928, line: 463, size: 1152, elements: !929)
!928 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!929 = !{!930, !933, !964, !965, !1104, !1125, !1126, !1127, !1128, !1129, !1130, !1154, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !927, file: !928, line: 464, baseType: !931, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !928, line: 464, flags: DIFlagFwdDecl)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !927, file: !928, line: 467, baseType: !934, size: 64, offset: 64)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !135, line: 374, size: 640, elements: !936)
!936 = !{!937, !939, !940, !953, !954, !955, !956, !957, !958, !960, !962, !963}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !935, file: !135, line: 377, baseType: !938, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !424, line: 111, baseType: !407)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !935, file: !135, line: 378, baseType: !938, size: 64, offset: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !935, file: !135, line: 381, baseType: !941, size: 64, offset: 128)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !135, line: 282, baseType: !943)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !135, line: 282, size: 128, elements: !944)
!944 = !{!945}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !943, file: !135, line: 282, baseType: !946, size: 128)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !135, line: 281, baseType: !947)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !135, line: 281, size: 128, elements: !948)
!948 = !{!949, !950, !951}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !947, file: !135, line: 281, baseType: !7, size: 32)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !947, file: !135, line: 281, baseType: !7, size: 32, offset: 32)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !947, file: !135, line: 281, baseType: !952, size: 64, offset: 64)
!952 = !DICompositeType(tag: DW_TAG_array_type, baseType: !938, size: 64, elements: !567)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !935, file: !135, line: 384, baseType: !393, size: 32, offset: 192)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !935, file: !135, line: 387, baseType: !393, size: 32, offset: 224)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !935, file: !135, line: 390, baseType: !393, size: 32, offset: 256)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !935, file: !135, line: 394, baseType: !941, size: 64, offset: 320)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !935, file: !135, line: 396, baseType: !134, size: 32, offset: 384)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !935, file: !135, line: 399, baseType: !959, size: 64, offset: 416)
!959 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 64, elements: !707)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !935, file: !135, line: 402, baseType: !961, size: 64, offset: 480)
!961 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !707)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !935, file: !135, line: 406, baseType: !393, size: 32, offset: 544)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !935, file: !135, line: 409, baseType: !393, size: 32, offset: 576)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !927, file: !928, line: 470, baseType: !435, size: 64, offset: 128)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !927, file: !928, line: 473, baseType: !966, size: 64, offset: 192)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !878, line: 39, size: 1152, elements: !968)
!968 = !{!969, !1019, !1032, !1045, !1046, !1058, !1059, !1063, !1064, !1065, !1066, !1067}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !967, file: !878, line: 41, baseType: !970, size: 64)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !971, line: 144, baseType: !972)
!971 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !971, line: 100, size: 896, elements: !974)
!974 = !{!975, !981, !986, !991, !993, !996, !997, !998, !999, !1000, !1005, !1007, !1008, !1013, !1018}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !973, file: !971, line: 102, baseType: !976, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !971, line: 52, baseType: !977)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DISubroutineType(types: !979)
!979 = !{!980, !811}
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !971, line: 47, baseType: !7)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !973, file: !971, line: 105, baseType: !982, size: 64, offset: 64)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !971, line: 59, baseType: !983)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!393, !811, !811}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !973, file: !971, line: 108, baseType: !987, size: 64, offset: 128)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !971, line: 63, baseType: !988)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{null, !397}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !973, file: !971, line: 111, baseType: !992, size: 64, offset: 192)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !973, file: !971, line: 114, baseType: !994, size: 64, offset: 256)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !995, line: 46, baseType: !523)
!995 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!996 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !973, file: !971, line: 117, baseType: !994, size: 64, offset: 320)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !973, file: !971, line: 120, baseType: !994, size: 64, offset: 384)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !973, file: !971, line: 124, baseType: !7, size: 32, offset: 448)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !973, file: !971, line: 128, baseType: !7, size: 32, offset: 480)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !973, file: !971, line: 131, baseType: !1001, size: 64, offset: 512)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !971, line: 75, baseType: !1002)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!397, !994, !994}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !973, file: !971, line: 132, baseType: !1006, size: 64, offset: 576)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !971, line: 78, baseType: !988)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !973, file: !971, line: 135, baseType: !397, size: 64, offset: 640)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !973, file: !971, line: 136, baseType: !1009, size: 64, offset: 704)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !971, line: 82, baseType: !1010)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!397, !397, !994, !994}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !973, file: !971, line: 137, baseType: !1014, size: 64, offset: 768)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !971, line: 83, baseType: !1015)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{null, !397, !397}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !973, file: !971, line: 141, baseType: !7, size: 32, offset: 832)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !967, file: !878, line: 48, baseType: !1020, size: 64, offset: 64)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !437, line: 35, baseType: !1022)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !437, line: 35, size: 128, elements: !1023)
!1023 = !{!1024}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1022, file: !437, line: 35, baseType: !1025, size: 128)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !437, line: 33, baseType: !1026)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !437, line: 33, size: 128, elements: !1027)
!1027 = !{!1028, !1029, !1030}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1026, file: !437, line: 33, baseType: !7, size: 32)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1026, file: !437, line: 33, baseType: !7, size: 32, offset: 32)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1026, file: !437, line: 33, baseType: !1031, size: 64, offset: 64)
!1031 = !DICompositeType(tag: DW_TAG_array_type, baseType: !445, size: 64, elements: !567)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !967, file: !878, line: 51, baseType: !1033, size: 64, offset: 128)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !151, line: 183, baseType: !1035)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !151, line: 183, size: 128, elements: !1036)
!1036 = !{!1037}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1035, file: !151, line: 183, baseType: !1038, size: 128)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !151, line: 182, baseType: !1039)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !151, line: 182, size: 128, elements: !1040)
!1040 = !{!1041, !1042, !1043}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1039, file: !151, line: 182, baseType: !7, size: 32)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1039, file: !151, line: 182, baseType: !7, size: 32, offset: 32)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1039, file: !151, line: 182, baseType: !1044, size: 64, offset: 64)
!1044 = !DICompositeType(tag: DW_TAG_array_type, baseType: !470, size: 64, elements: !567)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !967, file: !878, line: 54, baseType: !470, size: 64, offset: 192)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !967, file: !878, line: 57, baseType: !1047, size: 128, offset: 256)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1048, line: 31, size: 128, elements: !1049)
!1048 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1049 = !{!1050, !1051, !1052, !1053, !1054, !1055, !1056}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1047, file: !1048, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1047, file: !1048, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1047, file: !1048, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1047, file: !1048, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1047, file: !1048, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1047, file: !1048, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1047, file: !1048, line: 56, baseType: !1057, size: 64, offset: 64)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !424, line: 47, baseType: !691)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !967, file: !878, line: 60, baseType: !1047, size: 128, offset: 384)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !967, file: !878, line: 64, baseType: !1060, size: 64, offset: 512)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1062, line: 33, flags: DIFlagFwdDecl)
!1062 = !DIFile(filename: "./pointer-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !967, file: !878, line: 67, baseType: !470, size: 64, offset: 576)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !967, file: !878, line: 73, baseType: !970, size: 64, offset: 640)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !967, file: !878, line: 77, baseType: !1057, size: 64, offset: 704)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !967, file: !878, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !967, file: !878, line: 82, baseType: !1068, size: 320, offset: 832)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !1069, line: 62, size: 320, elements: !1070)
!1069 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1070 = !{!1071, !1077, !1078, !1079, !1080, !1087}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1068, file: !1069, line: 63, baseType: !1072, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !1069, line: 56, size: 128, elements: !1074)
!1074 = !{!1075, !1076}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1073, file: !1069, line: 57, baseType: !1072, size: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1073, file: !1069, line: 58, baseType: !566, size: 8, offset: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1068, file: !1069, line: 64, baseType: !7, size: 32, offset: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1068, file: !1069, line: 66, baseType: !7, size: 32, offset: 96)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1068, file: !1069, line: 68, baseType: !392, size: 8, offset: 128)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1068, file: !1069, line: 70, baseType: !1081, size: 64, offset: 192)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1069, line: 37, size: 128, elements: !1083)
!1083 = !{!1084, !1085}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1082, file: !1069, line: 39, baseType: !1081, size: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1082, file: !1069, line: 40, baseType: !1086, size: 64, offset: 64)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1068, file: !1069, line: 71, baseType: !1088, size: 64, offset: 256)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1069, line: 45, size: 320, elements: !1090)
!1090 = !{!1091, !1092}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1089, file: !1069, line: 47, baseType: !1088, size: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1089, file: !1069, line: 48, baseType: !1093, size: 256, offset: 64)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !151, line: 1883, size: 256, elements: !1094)
!1094 = !{!1095, !1097, !1098, !1103}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1093, file: !151, line: 1884, baseType: !1096, size: 64)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1093, file: !151, line: 1885, baseType: !1096, size: 64, offset: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1093, file: !151, line: 1891, baseType: !1099, size: 64, offset: 128)
!1099 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1093, file: !151, line: 1891, size: 64, elements: !1100)
!1100 = !{!1101, !1102}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1099, file: !151, line: 1891, baseType: !445, size: 64)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1099, file: !151, line: 1891, baseType: !470, size: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1093, file: !151, line: 1892, baseType: !1086, size: 64, offset: 192)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !927, file: !928, line: 476, baseType: !1105, size: 64, offset: 256)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !378, line: 187, size: 256, elements: !1107)
!1107 = !{!1108, !1109, !1123, !1124}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1106, file: !378, line: 189, baseType: !393, size: 32)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !1106, file: !378, line: 192, baseType: !1110, size: 64, offset: 64)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !378, line: 87, baseType: !1112)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !378, line: 87, size: 128, elements: !1113)
!1113 = !{!1114}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1112, file: !378, line: 87, baseType: !1115, size: 128)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !378, line: 85, baseType: !1116)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !378, line: 85, size: 128, elements: !1117)
!1117 = !{!1118, !1119, !1120}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1116, file: !378, line: 85, baseType: !7, size: 32)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1116, file: !378, line: 85, baseType: !7, size: 32, offset: 32)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1116, file: !378, line: 85, baseType: !1121, size: 64, offset: 64)
!1121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1122, size: 64, elements: !567)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !378, line: 84, baseType: !401)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1106, file: !378, line: 197, baseType: !970, size: 64, offset: 128)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !1106, file: !378, line: 200, baseType: !401, size: 64, offset: 192)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !927, file: !928, line: 479, baseType: !970, size: 64, offset: 320)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !927, file: !928, line: 484, baseType: !470, size: 64, offset: 384)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !927, file: !928, line: 488, baseType: !470, size: 64, offset: 448)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !927, file: !928, line: 493, baseType: !470, size: 64, offset: 512)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !927, file: !928, line: 496, baseType: !470, size: 64, offset: 576)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !927, file: !928, line: 501, baseType: !1131, size: 64, offset: 640)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64)
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !146, line: 2355, size: 576, elements: !1133)
!1133 = !{!1134, !1137, !1138, !1139, !1140, !1142, !1143, !1148, !1149, !1150, !1151, !1152, !1153}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1132, file: !146, line: 2356, baseType: !1135, size: 64)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !146, line: 2356, flags: DIFlagFwdDecl)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1132, file: !146, line: 2357, baseType: !398, size: 64, offset: 64)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1132, file: !146, line: 2358, baseType: !393, size: 32, offset: 128)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1132, file: !146, line: 2359, baseType: !393, size: 32, offset: 160)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1132, file: !146, line: 2360, baseType: !1141, size: 128, offset: 192)
!1141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !393, size: 128, elements: !731)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1132, file: !146, line: 2364, baseType: !393, size: 32, offset: 320)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1132, file: !146, line: 2367, baseType: !1144, size: 128, offset: 384)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !146, line: 2349, size: 128, elements: !1145)
!1145 = !{!1146, !1147}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1144, file: !146, line: 2351, baseType: !639, size: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1144, file: !146, line: 2352, baseType: !400, size: 64, offset: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1132, file: !146, line: 2371, baseType: !145, size: 32, offset: 512)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1132, file: !146, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1132, file: !146, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1132, file: !146, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1132, file: !146, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1132, file: !146, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !927, file: !928, line: 504, baseType: !1155, size: 64, offset: 704)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1156 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !928, line: 504, flags: DIFlagFwdDecl)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !927, file: !928, line: 507, baseType: !970, size: 64, offset: 768)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !927, file: !928, line: 510, baseType: !393, size: 32, offset: 832)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !927, file: !928, line: 513, baseType: !393, size: 32, offset: 864)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !927, file: !928, line: 516, baseType: !463, size: 32, offset: 896)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !927, file: !928, line: 519, baseType: !463, size: 32, offset: 928)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !927, file: !928, line: 522, baseType: !7, size: 32, offset: 960)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !927, file: !928, line: 523, baseType: !7, size: 32, offset: 992)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !927, file: !928, line: 528, baseType: !398, size: 64, offset: 1024)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !927, file: !928, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !927, file: !928, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !927, file: !928, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !927, file: !928, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !927, file: !928, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !927, file: !928, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !927, file: !928, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !927, file: !928, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !927, file: !928, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !927, file: !928, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
