; ModuleID = 'cfgloopmanip.bc'
source_filename = "cfgloopmanip.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }

!552 = !DIEnumerator(name: "GIMPLE_PHI", value: 16, isUnsigned: true)
!553 = !DIEnumerator(name: "GIMPLE_TRY", value: 17, isUnsigned: true)
!554 = !DIEnumerator(name: "GIMPLE_NOP", value: 18, isUnsigned: true)
!555 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!556 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!557 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!558 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!559 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!560 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!561 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!562 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!563 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!564 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!565 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!566 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!567 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!568 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!569 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!570 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!571 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!572 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !534, line: 727, baseType: !7, size: 32, elements: !573)
!573 = !{!574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597}
!574 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!575 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!576 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!577 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!578 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!579 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!580 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!581 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!582 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!583 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!584 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!585 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!586 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!587 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!588 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!589 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!590 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!591 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!592 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!593 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!594 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!595 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!596 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!597 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!598 = !{!599, !600, !601, !602, !605, !606, !608, !7, !672, !1993, !1994, !1195, !1258, !390, !1995, !725, !1998, !627, !1311, !648, !2003, !1287, !603, !2005, !609, !2010, !1323}
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!601 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !604)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !610, line: 111, baseType: !611)
!610 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !144, line: 217, size: 832, elements: !613)
!613 = !{!614, !1960, !1961, !1962, !1963, !1967, !1968, !1969, !1987, !1988, !1989, !1990, !1991, !1992}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !612, file: !144, line: 219, baseType: !615, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !144, line: 151, baseType: !617)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !144, line: 151, size: 128, elements: !618)
!618 = !{!619}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !617, file: !144, line: 151, baseType: !620, size: 128)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !144, line: 150, baseType: !621)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !144, line: 150, size: 128, elements: !622)
!622 = !{!623, !624, !625}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !621, file: !144, line: 150, baseType: !7, size: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !621, file: !144, line: 150, baseType: !7, size: 32, offset: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !621, file: !144, line: 150, baseType: !626, size: 64, offset: 64)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !627, size: 64, elements: !770)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !610, line: 108, baseType: !628)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !144, line: 122, size: 512, elements: !630)
!630 = !{!631, !632, !633, !1952, !1953, !1954, !1955, !1956, !1957, !1958}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !629, file: !144, line: 124, baseType: !611, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !629, file: !144, line: 125, baseType: !611, size: 64, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !629, file: !144, line: 131, baseType: !634, size: 64, offset: 128)
!634 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !144, line: 128, size: 64, elements: !635)
!635 = !{!636, !1951}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !634, file: !144, line: 129, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !610, line: 66, baseType: !638)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !534, line: 143, size: 192, elements: !640)
!640 = !{!641, !1949, !1950}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !639, file: !534, line: 145, baseType: !642, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !610, line: 69, baseType: !643)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !534, line: 136, size: 192, elements: !645)
!645 = !{!646, !1947, !1948}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !644, file: !534, line: 137, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !610, line: 58, baseType: !648)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !534, line: 737, size: 768, elements: !650)
!650 = !{!651, !1794, !1804, !1810, !1815, !1820, !1827, !1833, !1839, !1844, !1858, !1863, !1869, !1874, !1884, !1889, !1905, !1912, !1919, !1925, !1930, !1936, !1942}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !649, file: !534, line: 738, baseType: !652, size: 256)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !534, line: 271, size: 256, elements: !653)
!653 = !{!654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !669, !670, !671}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !652, file: !534, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !652, file: !534, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !652, file: !534, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !652, file: !534, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !652, file: !534, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !652, file: !534, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !652, file: !534, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !652, file: !534, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !652, file: !534, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !652, file: !534, line: 312, baseType: !7, size: 32, offset: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !652, file: !534, line: 316, baseType: !665, size: 32, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !666, line: 58, baseType: !667)
!666 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !668, line: 44, baseType: !7)
!668 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!669 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !652, file: !534, line: 319, baseType: !7, size: 32, offset: 96)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !652, file: !534, line: 323, baseType: !611, size: 64, offset: 128)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !652, file: !534, line: 327, baseType: !672, size: 64, offset: 192)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !610, line: 56, baseType: !673)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !155, line: 3371, size: 1792, elements: !675)
!675 = !{!676, !709, !715, !728, !747, !758, !763, !772, !778, !791, !799, !837, !1044, !1072, !1089, !1090, !1095, !1104, !1110, !1115, !1119, !1123, !1445, !1492, !1498, !1504, !1511, !1524, !1538, !1555, !1567, !1589, !1604, !1776}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !674, file: !155, line: 3372, baseType: !677, size: 64)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !155, line: 360, size: 64, elements: !678)
!678 = !{!679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !677, file: !155, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !677, file: !155, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !677, file: !155, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !677, file: !155, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !677, file: !155, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !677, file: !155, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !677, file: !155, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !677, file: !155, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !677, file: !155, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !677, file: !155, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !677, file: !155, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !677, file: !155, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !677, file: !155, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !677, file: !155, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !677, file: !155, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !677, file: !155, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !677, file: !155, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !677, file: !155, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !677, file: !155, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !677, file: !155, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !677, file: !155, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !677, file: !155, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !677, file: !155, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !677, file: !155, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !677, file: !155, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !677, file: !155, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !677, file: !155, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !677, file: !155, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !677, file: !155, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !677, file: !155, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !674, file: !155, line: 3373, baseType: !710, size: 192)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !155, line: 402, size: 192, elements: !711)
!711 = !{!712, !713, !714}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !710, file: !155, line: 403, baseType: !677, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !710, file: !155, line: 404, baseType: !672, size: 64, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !710, file: !155, line: 405, baseType: !672, size: 64, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !674, file: !155, line: 3374, baseType: !716, size: 320)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !155, line: 1384, size: 320, elements: !717)
!717 = !{!718, !719}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !716, file: !155, line: 1385, baseType: !710, size: 192)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !716, file: !155, line: 1386, baseType: !720, size: 128, offset: 192)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !721, line: 58, baseType: !722)
!721 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !721, line: 54, size: 128, elements: !723)
!723 = !{!724, !726}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !722, file: !721, line: 56, baseType: !725, size: 64)
!725 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !722, file: !721, line: 57, baseType: !727, size: 64, offset: 64)
!727 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !674, file: !155, line: 3375, baseType: !729, size: 256)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !155, line: 1397, size: 256, elements: !730)
!730 = !{!731, !732}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !729, file: !155, line: 1398, baseType: !710, size: 192)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !729, file: !155, line: 1399, baseType: !733, size: 64, offset: 192)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !735, line: 52, size: 256, elements: !736)
!735 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!736 = !{!737, !738, !739, !740, !741, !742, !743}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !734, file: !735, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !734, file: !735, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !734, file: !735, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !734, file: !735, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !734, file: !735, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !734, file: !735, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !734, file: !735, line: 62, baseType: !744, size: 192, offset: 64)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !725, size: 192, elements: !745)
!745 = !{!746}
!746 = !DISubrange(count: 3)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !674, file: !155, line: 3376, baseType: !748, size: 256)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !155, line: 1408, size: 256, elements: !749)
!749 = !{!750, !751}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !748, file: !155, line: 1409, baseType: !710, size: 192)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !748, file: !155, line: 1410, baseType: !752, size: 64, offset: 192)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !754, line: 27, size: 192, elements: !755)
!754 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!755 = !{!756, !757}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !753, file: !754, line: 29, baseType: !720, size: 128)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !753, file: !754, line: 30, baseType: !15, size: 32, offset: 128)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !674, file: !155, line: 3377, baseType: !759, size: 256)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !155, line: 1437, size: 256, elements: !760)
!760 = !{!761, !762}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !759, file: !155, line: 1438, baseType: !710, size: 192)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !759, file: !155, line: 1439, baseType: !672, size: 64, offset: 192)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !674, file: !155, line: 3378, baseType: !764, size: 256)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !155, line: 1418, size: 256, elements: !765)
!765 = !{!766, !767, !768}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !764, file: !155, line: 1419, baseType: !710, size: 192)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !764, file: !155, line: 1420, baseType: !601, size: 32, offset: 192)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !764, file: !155, line: 1421, baseType: !769, size: 8, offset: 224)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !604, size: 8, elements: !770)
!770 = !{!771}
!771 = !DISubrange(count: 1)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !674, file: !155, line: 3379, baseType: !773, size: 320)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !155, line: 1428, size: 320, elements: !774)
!774 = !{!775, !776, !777}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !773, file: !155, line: 1429, baseType: !710, size: 192)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !773, file: !155, line: 1430, baseType: !672, size: 64, offset: 192)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !773, file: !155, line: 1431, baseType: !672, size: 64, offset: 256)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !674, file: !155, line: 3380, baseType: !779, size: 320)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !155, line: 1460, size: 320, elements: !780)
!780 = !{!781, !782}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !779, file: !155, line: 1461, baseType: !710, size: 192)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !779, file: !155, line: 1462, baseType: !783, size: 128, offset: 192)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !784, line: 31, size: 128, elements: !785)
!784 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!785 = !{!786, !789, !790}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !783, file: !784, line: 32, baseType: !787, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !600)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !783, file: !784, line: 33, baseType: !7, size: 32, offset: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !783, file: !784, line: 34, baseType: !7, size: 32, offset: 96)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !674, file: !155, line: 3381, baseType: !792, size: 384)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !155, line: 2507, size: 384, elements: !793)
!793 = !{!794, !795, !796, !797, !798}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !792, file: !155, line: 2508, baseType: !710, size: 192)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !792, file: !155, line: 2509, baseType: !665, size: 32, offset: 192)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !792, file: !155, line: 2510, baseType: !7, size: 32, offset: 224)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !792, file: !155, line: 2511, baseType: !672, size: 64, offset: 256)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !792, file: !155, line: 2512, baseType: !672, size: 64, offset: 320)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !674, file: !155, line: 3382, baseType: !800, size: 896)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !155, line: 2652, size: 896, elements: !801)
!801 = !{!802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !800, file: !155, line: 2653, baseType: !792, size: 384)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !800, file: !155, line: 2654, baseType: !672, size: 64, offset: 384)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !800, file: !155, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !800, file: !155, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !800, file: !155, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !800, file: !155, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !800, file: !155, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !800, file: !155, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !800, file: !155, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !800, file: !155, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !800, file: !155, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !800, file: !155, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !800, file: !155, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !800, file: !155, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !800, file: !155, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !800, file: !155, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !800, file: !155, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !800, file: !155, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !800, file: !155, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !800, file: !155, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !800, file: !155, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !800, file: !155, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !800, file: !155, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !800, file: !155, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !800, file: !155, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !800, file: !155, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !800, file: !155, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !800, file: !155, line: 2703, baseType: !7, size: 32, offset: 512)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !800, file: !155, line: 2705, baseType: !672, size: 64, offset: 576)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !800, file: !155, line: 2706, baseType: !672, size: 64, offset: 640)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !800, file: !155, line: 2707, baseType: !672, size: 64, offset: 704)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !800, file: !155, line: 2708, baseType: !672, size: 64, offset: 768)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !800, file: !155, line: 2711, baseType: !835, size: 64, offset: 832)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !155, line: 2711, flags: DIFlagFwdDecl)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !674, file: !155, line: 3383, baseType: !838, size: 960)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !155, line: 2756, size: 960, elements: !839)
!839 = !{!840, !841}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !838, file: !155, line: 2757, baseType: !800, size: 896)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !838, file: !155, line: 2758, baseType: !842, size: 64, offset: 896)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !610, line: 50, baseType: !843)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !391, line: 240, size: 384, elements: !845)
!845 = !{!846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !844, file: !391, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !844, file: !391, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !844, file: !391, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !844, file: !391, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !844, file: !391, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !844, file: !391, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !844, file: !391, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !844, file: !391, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !844, file: !391, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !844, file: !391, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !844, file: !391, line: 321, baseType: !857, size: 320, offset: 64)
!857 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !391, line: 315, size: 320, elements: !858)
!858 = !{!859, !977, !979, !1042, !1043}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !857, file: !391, line: 316, baseType: !860, size: 64)
!860 = !DICompositeType(tag: DW_TAG_array_type, baseType: !861, size: 64, elements: !770)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !391, line: 183, baseType: !862)
!862 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !391, line: 166, size: 64, elements: !863)
!863 = !{!864, !865, !866, !867, !868, !876, !877, !889, !892, !952, !953, !954, !967, !974}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !862, file: !391, line: 168, baseType: !601, size: 32)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !862, file: !391, line: 169, baseType: !7, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !862, file: !391, line: 170, baseType: !606, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !862, file: !391, line: 171, baseType: !842, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !862, file: !391, line: 172, baseType: !869, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !610, line: 53, baseType: !870)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !391, line: 359, size: 128, elements: !872)
!872 = !{!873, !874}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !871, file: !391, line: 360, baseType: !601, size: 32)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !871, file: !391, line: 361, baseType: !875, size: 64, offset: 64)
!875 = !DICompositeType(tag: DW_TAG_array_type, baseType: !842, size: 64, elements: !770)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !862, file: !391, line: 173, baseType: !15, size: 32)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !862, file: !391, line: 174, baseType: !878, size: 32)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !391, line: 133, baseType: !879)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !391, line: 115, size: 32, elements: !880)
!880 = !{!881, !882, !883, !884, !885, !886, !887, !888}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !879, file: !391, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !879, file: !391, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !879, file: !391, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !879, file: !391, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !879, file: !391, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !879, file: !391, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !879, file: !391, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !879, file: !391, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !862, file: !391, line: 175, baseType: !890, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !391, line: 175, flags: DIFlagFwdDecl)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !862, file: !391, line: 176, baseType: !893, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !895, line: 75, size: 256, elements: !896)
!895 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!896 = !{!897, !911, !912, !913}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !894, file: !895, line: 76, baseType: !898, size: 64)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !895, line: 68, baseType: !900)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !895, line: 63, size: 320, elements: !901)
!901 = !{!902, !904, !905, !906}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !900, file: !895, line: 64, baseType: !903, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !900, file: !895, line: 65, baseType: !903, size: 64, offset: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !900, file: !895, line: 66, baseType: !7, size: 32, offset: 128)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !900, file: !895, line: 67, baseType: !907, size: 128, offset: 192)
!907 = !DICompositeType(tag: DW_TAG_array_type, baseType: !908, size: 128, elements: !909)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !895, line: 29, baseType: !725)
!909 = !{!910}
!910 = !DISubrange(count: 2)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !894, file: !895, line: 77, baseType: !898, size: 64, offset: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !894, file: !895, line: 78, baseType: !7, size: 32, offset: 128)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !894, file: !895, line: 79, baseType: !914, size: 64, offset: 192)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !895, line: 49, baseType: !916)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !895, line: 45, size: 832, elements: !917)
!917 = !{!918, !919, !920}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !916, file: !895, line: 46, baseType: !903, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !916, file: !895, line: 47, baseType: !893, size: 64, offset: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !916, file: !895, line: 48, baseType: !921, size: 704, offset: 128)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !922, line: 164, size: 704, elements: !923)
!922 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!923 = !{!924, !925, !935, !936, !937, !938, !939, !940, !944, !948, !949, !950, !951}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !921, file: !922, line: 166, baseType: !727, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !921, file: !922, line: 167, baseType: !926, size: 64, offset: 64)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !922, line: 157, size: 192, elements: !928)
!928 = !{!929, !930, !931}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !927, file: !922, line: 159, baseType: !603, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !927, file: !922, line: 160, baseType: !926, size: 64, offset: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !927, file: !922, line: 161, baseType: !932, size: 32, offset: 128)
!932 = !DICompositeType(tag: DW_TAG_array_type, baseType: !604, size: 32, elements: !933)
!933 = !{!934}
!934 = !DISubrange(count: 4)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !921, file: !922, line: 168, baseType: !603, size: 64, offset: 128)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !921, file: !922, line: 169, baseType: !603, size: 64, offset: 192)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !921, file: !922, line: 170, baseType: !603, size: 64, offset: 256)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !921, file: !922, line: 171, baseType: !727, size: 64, offset: 320)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !921, file: !922, line: 172, baseType: !601, size: 32, offset: 384)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !921, file: !922, line: 176, baseType: !941, size: 64, offset: 448)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DISubroutineType(types: !943)
!943 = !{!926, !605, !727}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !921, file: !922, line: 177, baseType: !945, size: 64, offset: 512)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{null, !605, !926}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !921, file: !922, line: 178, baseType: !605, size: 64, offset: 576)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !921, file: !922, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !921, file: !922, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !921, file: !922, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !862, file: !391, line: 177, baseType: !672, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !862, file: !391, line: 178, baseType: !611, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !862, file: !391, line: 179, baseType: !955, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !391, line: 150, baseType: !957)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !391, line: 142, size: 320, elements: !958)
!958 = !{!959, !960, !961, !962, !965, !966}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !957, file: !391, line: 144, baseType: !672, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !957, file: !391, line: 145, baseType: !842, size: 64, offset: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !957, file: !391, line: 146, baseType: !842, size: 64, offset: 128)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !957, file: !391, line: 147, baseType: !963, size: 32, offset: 192)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !964, line: 31, baseType: !601)
!964 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!965 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !957, file: !391, line: 148, baseType: !7, size: 32, offset: 224)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !957, file: !391, line: 149, baseType: !600, size: 8, offset: 256)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !862, file: !391, line: 180, baseType: !968, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !391, line: 162, baseType: !970)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !391, line: 159, size: 128, elements: !971)
!971 = !{!972, !973}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !970, file: !391, line: 160, baseType: !672, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !970, file: !391, line: 161, baseType: !727, size: 64, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !862, file: !391, line: 181, baseType: !975, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !391, line: 181, flags: DIFlagFwdDecl)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !857, file: !391, line: 317, baseType: !978, size: 64)
!978 = !DICompositeType(tag: DW_TAG_array_type, baseType: !727, size: 64, elements: !770)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !857, file: !391, line: 318, baseType: !980, size: 320)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !391, line: 188, size: 320, elements: !981)
!981 = !{!982, !984, !1041}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !980, file: !391, line: 190, baseType: !983, size: 192)
!983 = !DICompositeType(tag: DW_TAG_array_type, baseType: !861, size: 192, elements: !745)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !980, file: !391, line: 193, baseType: !985, size: 64, offset: 192)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !391, line: 206, size: 320, elements: !987)
!987 = !{!988, !1026, !1027, !1028, !1040}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !986, file: !391, line: 208, baseType: !989, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !610, line: 62, baseType: !991)
!991 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !992, line: 538, size: 256, elements: !993)
!992 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!993 = !{!994, !998, !1004, !1017}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !991, file: !992, line: 539, baseType: !995, size: 32)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !992, line: 482, size: 32, elements: !996)
!996 = !{!997}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !995, file: !992, line: 484, baseType: !7, size: 32)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !991, file: !992, line: 540, baseType: !999, size: 192)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !992, line: 488, size: 192, elements: !1000)
!1000 = !{!1001, !1002, !1003}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !999, file: !992, line: 489, baseType: !995, size: 32)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !999, file: !992, line: 492, baseType: !606, size: 64, offset: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !999, file: !992, line: 496, baseType: !672, size: 64, offset: 128)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !991, file: !992, line: 541, baseType: !1005, size: 256)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !992, line: 504, size: 256, elements: !1006)
!1006 = !{!1007, !1008, !1015, !1016}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1005, file: !992, line: 505, baseType: !995, size: 32)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1005, file: !992, line: 509, baseType: !1009, size: 64, offset: 64)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !992, line: 501, baseType: !1010)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{null, !1013}
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1005, file: !992, line: 510, baseType: !1013, size: 64, offset: 128)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1005, file: !992, line: 513, baseType: !989, size: 64, offset: 192)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !991, file: !992, line: 542, baseType: !1018, size: 128)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !992, line: 530, size: 128, elements: !1019)
!1019 = !{!1020, !1021}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1018, file: !992, line: 531, baseType: !995, size: 32)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1018, file: !992, line: 534, baseType: !1022, size: 64, offset: 64)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !992, line: 525, baseType: !1023)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!600, !672, !606, !725, !725}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !986, file: !391, line: 211, baseType: !7, size: 32, offset: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !986, file: !391, line: 214, baseType: !727, size: 64, offset: 128)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !986, file: !391, line: 224, baseType: !1029, size: 64, offset: 192)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !391, line: 202, baseType: !1031)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !391, line: 202, size: 128, elements: !1032)
!1032 = !{!1033}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1031, file: !391, line: 202, baseType: !1034, size: 128)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !391, line: 200, baseType: !1035)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !391, line: 200, size: 128, elements: !1036)
!1036 = !{!1037, !1038, !1039}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1035, file: !391, line: 200, baseType: !7, size: 32)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1035, file: !391, line: 200, baseType: !7, size: 32, offset: 32)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1035, file: !391, line: 200, baseType: !875, size: 64, offset: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !986, file: !391, line: 234, baseType: !1029, size: 64, offset: 256)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !980, file: !391, line: 197, baseType: !727, size: 64, offset: 256)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !857, file: !391, line: 319, baseType: !734, size: 256)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !857, file: !391, line: 320, baseType: !753, size: 192)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !674, file: !155, line: 3384, baseType: !1045, size: 1472)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !155, line: 3114, size: 1472, elements: !1046)
!1046 = !{!1047, !1068, !1069, !1070, !1071}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1045, file: !155, line: 3115, baseType: !1048, size: 1216)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !155, line: 2984, size: 1216, elements: !1049)
!1049 = !{!1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1048, file: !155, line: 2985, baseType: !838, size: 960)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1048, file: !155, line: 2986, baseType: !672, size: 64, offset: 960)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1048, file: !155, line: 2987, baseType: !672, size: 64, offset: 1024)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1048, file: !155, line: 2988, baseType: !672, size: 64, offset: 1088)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1048, file: !155, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1048, file: !155, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1048, file: !155, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1048, file: !155, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1048, file: !155, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1048, file: !155, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1048, file: !155, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1048, file: !155, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1048, file: !155, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1048, file: !155, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1048, file: !155, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1048, file: !155, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1048, file: !155, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1048, file: !155, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1045, file: !155, line: 3117, baseType: !672, size: 64, offset: 1216)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1045, file: !155, line: 3119, baseType: !672, size: 64, offset: 1280)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1045, file: !155, line: 3121, baseType: !672, size: 64, offset: 1344)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1045, file: !155, line: 3123, baseType: !672, size: 64, offset: 1408)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !674, file: !155, line: 3385, baseType: !1073, size: 1088)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !155, line: 2874, size: 1088, elements: !1074)
!1074 = !{!1075, !1076, !1077}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1073, file: !155, line: 2875, baseType: !838, size: 960)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1073, file: !155, line: 2876, baseType: !842, size: 64, offset: 960)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1073, file: !155, line: 2877, baseType: !1078, size: 64, offset: 1024)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1080, line: 172, size: 128, elements: !1081)
!1080 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1081 = !{!1082, !1083, !1084, !1085, !1086, !1087, !1088}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1079, file: !1080, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1079, file: !1080, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1079, file: !1080, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1079, file: !1080, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1079, file: !1080, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1079, file: !1080, line: 195, baseType: !7, size: 32, offset: 32)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1079, file: !1080, line: 199, baseType: !672, size: 64, offset: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !674, file: !155, line: 3386, baseType: !1048, size: 1216)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !674, file: !155, line: 3387, baseType: !1091, size: 1280)
!1091 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !155, line: 3093, size: 1280, elements: !1092)
!1092 = !{!1093, !1094}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1091, file: !155, line: 3094, baseType: !1048, size: 1216)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1091, file: !155, line: 3095, baseType: !1078, size: 64, offset: 1216)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !674, file: !155, line: 3388, baseType: !1096, size: 1216)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !155, line: 2824, size: 1216, elements: !1097)
!1097 = !{!1098, !1099, !1100, !1101, !1102, !1103}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1096, file: !155, line: 2825, baseType: !800, size: 896)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1096, file: !155, line: 2827, baseType: !672, size: 64, offset: 896)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1096, file: !155, line: 2828, baseType: !672, size: 64, offset: 960)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1096, file: !155, line: 2829, baseType: !672, size: 64, offset: 1024)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1096, file: !155, line: 2830, baseType: !672, size: 64, offset: 1088)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1096, file: !155, line: 2831, baseType: !672, size: 64, offset: 1152)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !674, file: !155, line: 3389, baseType: !1105, size: 1024)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !155, line: 2850, size: 1024, elements: !1106)
!1106 = !{!1107, !1108, !1109}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1105, file: !155, line: 2851, baseType: !838, size: 960)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1105, file: !155, line: 2852, baseType: !601, size: 32, offset: 960)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1105, file: !155, line: 2853, baseType: !601, size: 32, offset: 992)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !674, file: !155, line: 3390, baseType: !1111, size: 1024)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !155, line: 2857, size: 1024, elements: !1112)
!1112 = !{!1113, !1114}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1111, file: !155, line: 2858, baseType: !838, size: 960)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1111, file: !155, line: 2859, baseType: !1078, size: 64, offset: 960)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !674, file: !155, line: 3391, baseType: !1116, size: 960)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !155, line: 2862, size: 960, elements: !1117)
!1117 = !{!1118}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1116, file: !155, line: 2863, baseType: !838, size: 960)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !674, file: !155, line: 3392, baseType: !1120, size: 1472)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !155, line: 3304, size: 1472, elements: !1121)
!1121 = !{!1122}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1120, file: !155, line: 3305, baseType: !1045, size: 1472)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !674, file: !155, line: 3393, baseType: !1124, size: 1792)
!1124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !155, line: 3248, size: 1792, elements: !1125)
!1125 = !{!1126, !1127, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1124, file: !155, line: 3249, baseType: !1045, size: 1472)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1124, file: !155, line: 3251, baseType: !1128, size: 64, offset: 1472)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1130, line: 463, size: 1152, elements: !1131)
!1130 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1131 = !{!1132, !1135, !1165, !1166, !1305, !1368, !1369, !1370, !1371, !1372, !1373, !1397, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1129, file: !1130, line: 464, baseType: !1133, size: 64)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64)
!1134 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1130, line: 464, flags: DIFlagFwdDecl)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1129, file: !1130, line: 467, baseType: !1136, size: 64, offset: 64)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !144, line: 374, size: 640, elements: !1138)
!1138 = !{!1139, !1140, !1141, !1154, !1155, !1156, !1157, !1158, !1159, !1161, !1163, !1164}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1137, file: !144, line: 377, baseType: !609, size: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1137, file: !144, line: 378, baseType: !609, size: 64, offset: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1137, file: !144, line: 381, baseType: !1142, size: 64, offset: 128)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64)
!1143 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !144, line: 282, baseType: !1144)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !144, line: 282, size: 128, elements: !1145)
!1145 = !{!1146}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1144, file: !144, line: 282, baseType: !1147, size: 128)
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !144, line: 281, baseType: !1148)
!1148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !144, line: 281, size: 128, elements: !1149)
!1149 = !{!1150, !1151, !1152}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1148, file: !144, line: 281, baseType: !7, size: 32)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1148, file: !144, line: 281, baseType: !7, size: 32, offset: 32)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1148, file: !144, line: 281, baseType: !1153, size: 64, offset: 64)
!1153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !609, size: 64, elements: !770)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1137, file: !144, line: 384, baseType: !601, size: 32, offset: 192)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1137, file: !144, line: 387, baseType: !601, size: 32, offset: 224)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1137, file: !144, line: 390, baseType: !601, size: 32, offset: 256)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1137, file: !144, line: 394, baseType: !1142, size: 64, offset: 320)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1137, file: !144, line: 396, baseType: !143, size: 32, offset: 384)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1137, file: !144, line: 399, baseType: !1160, size: 64, offset: 416)
!1160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 64, elements: !909)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1137, file: !144, line: 402, baseType: !1162, size: 64, offset: 480)
!1162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !909)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1137, file: !144, line: 406, baseType: !601, size: 32, offset: 544)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1137, file: !144, line: 409, baseType: !601, size: 32, offset: 576)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1129, file: !1130, line: 470, baseType: !638, size: 64, offset: 128)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1129, file: !1130, line: 473, baseType: !1167, size: 64, offset: 192)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1080, line: 39, size: 1152, elements: !1169)
!1169 = !{!1170, !1220, !1233, !1246, !1247, !1259, !1260, !1264, !1265, !1266, !1267, !1268}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1168, file: !1080, line: 41, baseType: !1171, size: 64)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1172, line: 144, baseType: !1173)
!1172 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64)
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1172, line: 100, size: 896, elements: !1175)
!1175 = !{!1176, !1182, !1187, !1192, !1194, !1197, !1198, !1199, !1200, !1201, !1206, !1208, !1209, !1214, !1219}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1174, file: !1172, line: 102, baseType: !1177, size: 64)
!1177 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1172, line: 52, baseType: !1178)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64)
!1179 = !DISubroutineType(types: !1180)
!1180 = !{!1181, !1013}
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1172, line: 47, baseType: !7)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1174, file: !1172, line: 105, baseType: !1183, size: 64, offset: 64)
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1172, line: 59, baseType: !1184)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = !DISubroutineType(types: !1186)
!1186 = !{!601, !1013, !1013}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1174, file: !1172, line: 108, baseType: !1188, size: 64, offset: 128)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1172, line: 63, baseType: !1189)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64)
!1190 = !DISubroutineType(types: !1191)
!1191 = !{null, !605}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1174, file: !1172, line: 111, baseType: !1193, size: 64, offset: 192)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1174, file: !1172, line: 114, baseType: !1195, size: 64, offset: 256)
!1195 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1196, line: 46, baseType: !725)
!1196 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1174, file: !1172, line: 117, baseType: !1195, size: 64, offset: 320)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1174, file: !1172, line: 120, baseType: !1195, size: 64, offset: 384)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1174, file: !1172, line: 124, baseType: !7, size: 32, offset: 448)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1174, file: !1172, line: 128, baseType: !7, size: 32, offset: 480)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1174, file: !1172, line: 131, baseType: !1202, size: 64, offset: 512)
!1202 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1172, line: 75, baseType: !1203)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64)
!1204 = !DISubroutineType(types: !1205)
!1205 = !{!605, !1195, !1195}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1174, file: !1172, line: 132, baseType: !1207, size: 64, offset: 576)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1172, line: 78, baseType: !1189)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1174, file: !1172, line: 135, baseType: !605, size: 64, offset: 640)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1174, file: !1172, line: 136, baseType: !1210, size: 64, offset: 704)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1172, line: 82, baseType: !1211)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64)
!1212 = !DISubroutineType(types: !1213)
!1213 = !{!605, !605, !1195, !1195}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1174, file: !1172, line: 137, baseType: !1215, size: 64, offset: 768)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1172, line: 83, baseType: !1216)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1217 = !DISubroutineType(types: !1218)
!1218 = !{null, !605, !605}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1174, file: !1172, line: 141, baseType: !7, size: 32, offset: 832)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1168, file: !1080, line: 48, baseType: !1221, size: 64, offset: 64)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64)
!1222 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !534, line: 35, baseType: !1223)
!1223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !534, line: 35, size: 128, elements: !1224)
!1224 = !{!1225}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1223, file: !534, line: 35, baseType: !1226, size: 128)
!1226 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !534, line: 33, baseType: !1227)
!1227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !534, line: 33, size: 128, elements: !1228)
!1228 = !{!1229, !1230, !1231}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1227, file: !534, line: 33, baseType: !7, size: 32)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1227, file: !534, line: 33, baseType: !7, size: 32, offset: 32)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1227, file: !534, line: 33, baseType: !1232, size: 64, offset: 64)
!1232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !647, size: 64, elements: !770)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1168, file: !1080, line: 51, baseType: !1234, size: 64, offset: 128)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64)
!1235 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !155, line: 183, baseType: !1236)
!1236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !155, line: 183, size: 128, elements: !1237)
!1237 = !{!1238}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1236, file: !155, line: 183, baseType: !1239, size: 128)
!1239 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !155, line: 182, baseType: !1240)
!1240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !155, line: 182, size: 128, elements: !1241)
!1241 = !{!1242, !1243, !1244}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1240, file: !155, line: 182, baseType: !7, size: 32)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1240, file: !155, line: 182, baseType: !7, size: 32, offset: 32)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1240, file: !155, line: 182, baseType: !1245, size: 64, offset: 64)
!1245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !672, size: 64, elements: !770)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1168, file: !1080, line: 54, baseType: !672, size: 64, offset: 192)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1168, file: !1080, line: 57, baseType: !1248, size: 128, offset: 256)
!1248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1249, line: 31, size: 128, elements: !1250)
!1249 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1250 = !{!1251, !1252, !1253, !1254, !1255, !1256, !1257}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1248, file: !1249, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1248, file: !1249, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1248, file: !1249, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1248, file: !1249, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1248, file: !1249, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1248, file: !1249, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1248, file: !1249, line: 56, baseType: !1258, size: 64, offset: 64)
!1258 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !610, line: 47, baseType: !893)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !1168, file: !1080, line: 60, baseType: !1248, size: 128, offset: 384)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !1168, file: !1080, line: 64, baseType: !1261, size: 64, offset: 512)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64)
!1262 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1263, line: 33, flags: DIFlagFwdDecl)
!1263 = !DIFile(filename: "./pointer-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !1168, file: !1080, line: 67, baseType: !672, size: 64, offset: 576)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !1168, file: !1080, line: 73, baseType: !1171, size: 64, offset: 640)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !1168, file: !1080, line: 77, baseType: !1258, size: 64, offset: 704)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !1168, file: !1080, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !1168, file: !1080, line: 82, baseType: !1269, size: 320, offset: 832)
!1269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !1270, line: 62, size: 320, elements: !1271)
!1270 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1271 = !{!1272, !1278, !1279, !1280, !1281, !1288}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1269, file: !1270, line: 63, baseType: !1273, size: 64)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64)
!1274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !1270, line: 56, size: 128, elements: !1275)
!1275 = !{!1276, !1277}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1274, file: !1270, line: 57, baseType: !1273, size: 64)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1274, file: !1270, line: 58, baseType: !769, size: 8, offset: 64)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1269, file: !1270, line: 64, baseType: !7, size: 32, offset: 64)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1269, file: !1270, line: 66, baseType: !7, size: 32, offset: 96)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1269, file: !1270, line: 68, baseType: !600, size: 8, offset: 128)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1269, file: !1270, line: 70, baseType: !1282, size: 64, offset: 192)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64)
!1283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1270, line: 37, size: 128, elements: !1284)
!1284 = !{!1285, !1286}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1283, file: !1270, line: 39, baseType: !1282, size: 64)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1283, file: !1270, line: 40, baseType: !1287, size: 64, offset: 64)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1269, file: !1270, line: 71, baseType: !1289, size: 64, offset: 256)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64)
!1290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1270, line: 45, size: 320, elements: !1291)
!1291 = !{!1292, !1293}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1290, file: !1270, line: 47, baseType: !1289, size: 64)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1290, file: !1270, line: 48, baseType: !1294, size: 256, offset: 64)
!1294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !155, line: 1883, size: 256, elements: !1295)
!1295 = !{!1296, !1298, !1299, !1304}
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1294, file: !155, line: 1884, baseType: !1297, size: 64)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1294, file: !155, line: 1885, baseType: !1297, size: 64, offset: 64)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1294, file: !155, line: 1891, baseType: !1300, size: 64, offset: 128)
!1300 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1294, file: !155, line: 1891, size: 64, elements: !1301)
!1301 = !{!1302, !1303}
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1300, file: !155, line: 1891, baseType: !647, size: 64)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1300, file: !155, line: 1891, baseType: !672, size: 64)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1294, file: !155, line: 1892, baseType: !1287, size: 64, offset: 192)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1129, file: !1130, line: 476, baseType: !1306, size: 64, offset: 256)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64)
!1307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !6, line: 187, size: 256, elements: !1308)
!1308 = !{!1309, !1310, !1366, !1367}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1307, file: !6, line: 189, baseType: !601, size: 32)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !1307, file: !6, line: 192, baseType: !1311, size: 64, offset: 64)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64)
!1312 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !6, line: 87, baseType: !1313)
!1313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !6, line: 87, size: 128, elements: !1314)
!1314 = !{!1315}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1313, file: !6, line: 87, baseType: !1316, size: 128)
!1316 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !6, line: 85, baseType: !1317)
!1317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !6, line: 85, size: 128, elements: !1318)
!1318 = !{!1319, !1320, !1321}
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1317, file: !6, line: 85, baseType: !7, size: 32)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1317, file: !6, line: 85, baseType: !7, size: 32, offset: 32)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1317, file: !6, line: 85, baseType: !1322, size: 64, offset: 64)
!1322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1323, size: 64, elements: !770)
!1323 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !6, line: 84, baseType: !1324)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64)
!1325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !6, line: 100, size: 1216, elements: !1326)
!1326 = !{!1327, !1328, !1329, !1330, !1331, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1356, !1364, !1365}
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1325, file: !6, line: 102, baseType: !601, size: 32)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1325, file: !6, line: 105, baseType: !7, size: 32, offset: 32)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1325, file: !6, line: 108, baseType: !611, size: 64, offset: 64)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1325, file: !6, line: 111, baseType: !611, size: 64, offset: 128)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1325, file: !6, line: 114, baseType: !1332, size: 64, offset: 192)
!1332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !6, line: 41, size: 64, elements: !1333)
!1333 = !{!1334, !1335}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1332, file: !6, line: 42, baseType: !5, size: 32)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1332, file: !6, line: 43, baseType: !7, size: 32, offset: 32)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1325, file: !6, line: 117, baseType: !7, size: 32, offset: 256)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1325, file: !6, line: 120, baseType: !7, size: 32, offset: 288)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1325, file: !6, line: 123, baseType: !1311, size: 64, offset: 320)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1325, file: !6, line: 126, baseType: !1324, size: 64, offset: 384)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1325, file: !6, line: 129, baseType: !1324, size: 64, offset: 448)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1325, file: !6, line: 132, baseType: !605, size: 64, offset: 512)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1325, file: !6, line: 139, baseType: !672, size: 64, offset: 576)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1325, file: !6, line: 143, baseType: !720, size: 128, offset: 640)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1325, file: !6, line: 146, baseType: !720, size: 128, offset: 768)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1325, file: !6, line: 148, baseType: !600, size: 8, offset: 896)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1325, file: !6, line: 149, baseType: !600, size: 8, offset: 904)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1325, file: !6, line: 153, baseType: !386, size: 32, offset: 928)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1325, file: !6, line: 156, baseType: !1349, size: 64, offset: 960)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64)
!1350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !6, line: 48, size: 320, elements: !1351)
!1351 = !{!1352, !1353, !1354, !1355}
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1350, file: !6, line: 50, baseType: !647, size: 64)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1350, file: !6, line: 59, baseType: !720, size: 128, offset: 64)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1350, file: !6, line: 64, baseType: !600, size: 8, offset: 192)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1350, file: !6, line: 67, baseType: !1349, size: 64, offset: 256)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1325, file: !6, line: 159, baseType: !1357, size: 64, offset: 1024)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64)
!1358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !6, line: 72, size: 256, elements: !1359)
!1359 = !{!1360, !1361, !1362, !1363}
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1358, file: !6, line: 74, baseType: !628, size: 64)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1358, file: !6, line: 77, baseType: !1357, size: 64, offset: 64)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1358, file: !6, line: 78, baseType: !1357, size: 64, offset: 128)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1358, file: !6, line: 81, baseType: !1357, size: 64, offset: 192)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1325, file: !6, line: 162, baseType: !600, size: 8, offset: 1088)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1325, file: !6, line: 166, baseType: !672, size: 64, offset: 1152)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1307, file: !6, line: 197, baseType: !1171, size: 64, offset: 128)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !1307, file: !6, line: 200, baseType: !1324, size: 64, offset: 192)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1129, file: !1130, line: 479, baseType: !1171, size: 64, offset: 320)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1129, file: !1130, line: 484, baseType: !672, size: 64, offset: 384)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1129, file: !1130, line: 488, baseType: !672, size: 64, offset: 448)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1129, file: !1130, line: 493, baseType: !672, size: 64, offset: 512)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1129, file: !1130, line: 496, baseType: !672, size: 64, offset: 576)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1129, file: !1130, line: 501, baseType: !1374, size: 64, offset: 640)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64)
!1375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !350, line: 2355, size: 576, elements: !1376)
!1376 = !{!1377, !1380, !1381, !1382, !1383, !1385, !1386, !1391, !1392, !1393, !1394, !1395, !1396}
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1375, file: !350, line: 2356, baseType: !1378, size: 64)
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64)
!1379 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !350, line: 2356, flags: DIFlagFwdDecl)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1375, file: !350, line: 2357, baseType: !606, size: 64, offset: 64)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1375, file: !350, line: 2358, baseType: !601, size: 32, offset: 128)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1375, file: !350, line: 2359, baseType: !601, size: 32, offset: 160)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1375, file: !350, line: 2360, baseType: !1384, size: 128, offset: 192)
!1384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !601, size: 128, elements: !933)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1375, file: !350, line: 2364, baseType: !601, size: 32, offset: 320)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1375, file: !350, line: 2367, baseType: !1387, size: 128, offset: 384)
!1387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !350, line: 2349, size: 128, elements: !1388)
!1388 = !{!1389, !1390}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1387, file: !350, line: 2351, baseType: !842, size: 64)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1387, file: !350, line: 2352, baseType: !727, size: 64, offset: 64)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1375, file: !350, line: 2371, baseType: !349, size: 32, offset: 512)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1375, file: !350, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1375, file: !350, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1375, file: !350, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
