; ModuleID = 'cfgloopanal.bc'
source_filename = "cfgloopanal.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }

!484 = !DIEnumerator(name: "ORDERED", value: 91, isUnsigned: true)
!485 = !DIEnumerator(name: "UNEQ", value: 92, isUnsigned: true)
!486 = !DIEnumerator(name: "UNGE", value: 93, isUnsigned: true)
!487 = !DIEnumerator(name: "UNGT", value: 94, isUnsigned: true)
!488 = !DIEnumerator(name: "UNLE", value: 95, isUnsigned: true)
!489 = !DIEnumerator(name: "UNLT", value: 96, isUnsigned: true)
!490 = !DIEnumerator(name: "LTGT", value: 97, isUnsigned: true)
!491 = !DIEnumerator(name: "SIGN_EXTEND", value: 98, isUnsigned: true)
!492 = !DIEnumerator(name: "ZERO_EXTEND", value: 99, isUnsigned: true)
!493 = !DIEnumerator(name: "TRUNCATE", value: 100, isUnsigned: true)
!494 = !DIEnumerator(name: "FLOAT_EXTEND", value: 101, isUnsigned: true)
!495 = !DIEnumerator(name: "FLOAT_TRUNCATE", value: 102, isUnsigned: true)
!496 = !DIEnumerator(name: "FLOAT", value: 103, isUnsigned: true)
!497 = !DIEnumerator(name: "FIX", value: 104, isUnsigned: true)
!498 = !DIEnumerator(name: "UNSIGNED_FLOAT", value: 105, isUnsigned: true)
!499 = !DIEnumerator(name: "UNSIGNED_FIX", value: 106, isUnsigned: true)
!500 = !DIEnumerator(name: "FRACT_CONVERT", value: 107, isUnsigned: true)
!501 = !DIEnumerator(name: "UNSIGNED_FRACT_CONVERT", value: 108, isUnsigned: true)
!502 = !DIEnumerator(name: "SAT_FRACT", value: 109, isUnsigned: true)
!503 = !DIEnumerator(name: "UNSIGNED_SAT_FRACT", value: 110, isUnsigned: true)
!504 = !DIEnumerator(name: "ABS", value: 111, isUnsigned: true)
!505 = !DIEnumerator(name: "SQRT", value: 112, isUnsigned: true)
!506 = !DIEnumerator(name: "BSWAP", value: 113, isUnsigned: true)
!507 = !DIEnumerator(name: "FFS", value: 114, isUnsigned: true)
!508 = !DIEnumerator(name: "CLZ", value: 115, isUnsigned: true)
!509 = !DIEnumerator(name: "CTZ", value: 116, isUnsigned: true)
!510 = !DIEnumerator(name: "POPCOUNT", value: 117, isUnsigned: true)
!511 = !DIEnumerator(name: "PARITY", value: 118, isUnsigned: true)
!512 = !DIEnumerator(name: "SIGN_EXTRACT", value: 119, isUnsigned: true)
!513 = !DIEnumerator(name: "ZERO_EXTRACT", value: 120, isUnsigned: true)
!514 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!515 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!516 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!517 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!518 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!519 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!520 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!521 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!522 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!523 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!524 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!525 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!526 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!527 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!528 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!529 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!530 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!531 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!532 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!533 = !{!534, !535, !536, !537, !540, !541, !543, !390, !1671, !7, !774}
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!536 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !539)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !544, line: 108, baseType: !545)
!544 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !135, line: 122, size: 512, elements: !547)
!547 = !{!548, !1658, !1659, !1664, !1665, !1666, !1667, !1668, !1669, !1670}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !546, file: !135, line: 124, baseType: !549, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !135, line: 217, size: 832, elements: !551)
!551 = !{!552, !567, !568, !569, !1627, !1631, !1632, !1633, !1651, !1653, !1654, !1655, !1656, !1657}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !550, file: !135, line: 219, baseType: !553, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !135, line: 151, baseType: !555)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !135, line: 151, size: 128, elements: !556)
!556 = !{!557}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !555, file: !135, line: 151, baseType: !558, size: 128)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !135, line: 150, baseType: !559)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !135, line: 150, size: 128, elements: !560)
!560 = !{!561, !562, !563}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !559, file: !135, line: 150, baseType: !7, size: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !559, file: !135, line: 150, baseType: !7, size: 32, offset: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !559, file: !135, line: 150, baseType: !564, size: 64, offset: 64)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 64, elements: !565)
!565 = !{!566}
!566 = !DISubrange(count: 1)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !550, file: !135, line: 220, baseType: !553, size: 64, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !550, file: !135, line: 223, baseType: !540, size: 64, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !550, file: !135, line: 226, baseType: !570, size: 64, offset: 192)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !378, line: 100, size: 1216, elements: !572)
!572 = !{!573, !574, !575, !576, !577, !582, !583, !584, !598, !599, !600, !601, !1604, !1605, !1606, !1607, !1608, !1609, !1617, !1625, !1626}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !571, file: !378, line: 102, baseType: !536, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !571, file: !378, line: 105, baseType: !7, size: 32, offset: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !571, file: !378, line: 108, baseType: !549, size: 64, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !571, file: !378, line: 111, baseType: !549, size: 64, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !571, file: !378, line: 114, baseType: !578, size: 64, offset: 192)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !378, line: 41, size: 64, elements: !579)
!579 = !{!580, !581}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !578, file: !378, line: 42, baseType: !377, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !578, file: !378, line: 43, baseType: !7, size: 32, offset: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !571, file: !378, line: 117, baseType: !7, size: 32, offset: 256)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !571, file: !378, line: 120, baseType: !7, size: 32, offset: 288)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !571, file: !378, line: 123, baseType: !585, size: 64, offset: 320)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !378, line: 87, baseType: !587)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !378, line: 87, size: 128, elements: !588)
!588 = !{!589}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !587, file: !378, line: 87, baseType: !590, size: 128)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !378, line: 85, baseType: !591)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !378, line: 85, size: 128, elements: !592)
!592 = !{!593, !594, !595}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !591, file: !378, line: 85, baseType: !7, size: 32)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !591, file: !378, line: 85, baseType: !7, size: 32, offset: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !591, file: !378, line: 85, baseType: !596, size: 64, offset: 64)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !597, size: 64, elements: !565)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !378, line: 84, baseType: !570)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !571, file: !378, line: 126, baseType: !570, size: 64, offset: 384)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !571, file: !378, line: 129, baseType: !570, size: 64, offset: 448)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !571, file: !378, line: 132, baseType: !540, size: 64, offset: 512)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !571, file: !378, line: 139, baseType: !602, size: 64, offset: 576)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !544, line: 56, baseType: !603)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !151, line: 3371, size: 1792, elements: !605)
!605 = !{!606, !639, !645, !658, !677, !688, !693, !700, !706, !719, !731, !769, !976, !1004, !1012, !1013, !1018, !1027, !1033, !1038, !1042, !1046, !1229, !1276, !1282, !1289, !1296, !1322, !1347, !1364, !1376, !1398, !1414, !1586}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !604, file: !151, line: 3372, baseType: !607, size: 64)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !151, line: 360, size: 64, elements: !608)
!608 = !{!609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !607, file: !151, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !607, file: !151, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !607, file: !151, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !607, file: !151, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !607, file: !151, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !607, file: !151, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !607, file: !151, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !607, file: !151, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !607, file: !151, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !607, file: !151, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !607, file: !151, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !607, file: !151, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !607, file: !151, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !607, file: !151, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !607, file: !151, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !607, file: !151, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !607, file: !151, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !607, file: !151, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !607, file: !151, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !607, file: !151, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !607, file: !151, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !607, file: !151, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !607, file: !151, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !607, file: !151, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !607, file: !151, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !607, file: !151, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !607, file: !151, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !607, file: !151, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !607, file: !151, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !607, file: !151, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !604, file: !151, line: 3373, baseType: !640, size: 192)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !151, line: 402, size: 192, elements: !641)
!641 = !{!642, !643, !644}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !640, file: !151, line: 403, baseType: !607, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !640, file: !151, line: 404, baseType: !602, size: 64, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !640, file: !151, line: 405, baseType: !602, size: 64, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !604, file: !151, line: 3374, baseType: !646, size: 320)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !151, line: 1384, size: 320, elements: !647)
!647 = !{!648, !649}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !646, file: !151, line: 1385, baseType: !640, size: 192)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !646, file: !151, line: 1386, baseType: !650, size: 128, offset: 192)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !651, line: 58, baseType: !652)
!651 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !651, line: 54, size: 128, elements: !653)
!653 = !{!654, !656}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !652, file: !651, line: 56, baseType: !655, size: 64)
!655 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !652, file: !651, line: 57, baseType: !657, size: 64, offset: 64)
!657 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !604, file: !151, line: 3375, baseType: !659, size: 256)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !151, line: 1397, size: 256, elements: !660)
!660 = !{!661, !662}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !659, file: !151, line: 1398, baseType: !640, size: 192)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !659, file: !151, line: 1399, baseType: !663, size: 64, offset: 192)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !665, line: 52, size: 256, elements: !666)
!665 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!666 = !{!667, !668, !669, !670, !671, !672, !673}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !664, file: !665, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !664, file: !665, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !664, file: !665, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !664, file: !665, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !664, file: !665, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !664, file: !665, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !664, file: !665, line: 62, baseType: !674, size: 192, offset: 64)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !655, size: 192, elements: !675)
!675 = !{!676}
!676 = !DISubrange(count: 3)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !604, file: !151, line: 3376, baseType: !678, size: 256)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !151, line: 1408, size: 256, elements: !679)
!679 = !{!680, !681}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !678, file: !151, line: 1409, baseType: !640, size: 192)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !678, file: !151, line: 1410, baseType: !682, size: 64, offset: 192)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !684, line: 27, size: 192, elements: !685)
!684 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!685 = !{!686, !687}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !683, file: !684, line: 29, baseType: !650, size: 128)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !683, file: !684, line: 30, baseType: !5, size: 32, offset: 128)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !604, file: !151, line: 3377, baseType: !689, size: 256)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !151, line: 1437, size: 256, elements: !690)
!690 = !{!691, !692}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !689, file: !151, line: 1438, baseType: !640, size: 192)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !689, file: !151, line: 1439, baseType: !602, size: 64, offset: 192)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !604, file: !151, line: 3378, baseType: !694, size: 256)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !151, line: 1418, size: 256, elements: !695)
!695 = !{!696, !697, !698}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !694, file: !151, line: 1419, baseType: !640, size: 192)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !694, file: !151, line: 1420, baseType: !536, size: 32, offset: 192)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !694, file: !151, line: 1421, baseType: !699, size: 8, offset: 224)
!699 = !DICompositeType(tag: DW_TAG_array_type, baseType: !539, size: 8, elements: !565)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !604, file: !151, line: 3379, baseType: !701, size: 320)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !151, line: 1428, size: 320, elements: !702)
!702 = !{!703, !704, !705}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !701, file: !151, line: 1429, baseType: !640, size: 192)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !701, file: !151, line: 1430, baseType: !602, size: 64, offset: 192)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !701, file: !151, line: 1431, baseType: !602, size: 64, offset: 256)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !604, file: !151, line: 3380, baseType: !707, size: 320)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !151, line: 1460, size: 320, elements: !708)
!708 = !{!709, !710}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !707, file: !151, line: 1461, baseType: !640, size: 192)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !707, file: !151, line: 1462, baseType: !711, size: 128, offset: 192)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !712, line: 31, size: 128, elements: !713)
!712 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!713 = !{!714, !717, !718}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !711, file: !712, line: 32, baseType: !715, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !535)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !711, file: !712, line: 33, baseType: !7, size: 32, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !711, file: !712, line: 34, baseType: !7, size: 32, offset: 96)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !604, file: !151, line: 3381, baseType: !720, size: 384)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !151, line: 2507, size: 384, elements: !721)
!721 = !{!722, !723, !728, !729, !730}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !720, file: !151, line: 2508, baseType: !640, size: 192)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !720, file: !151, line: 2509, baseType: !724, size: 32, offset: 192)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !725, line: 58, baseType: !726)
!725 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !727, line: 44, baseType: !7)
!727 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!728 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !720, file: !151, line: 2510, baseType: !7, size: 32, offset: 224)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !720, file: !151, line: 2511, baseType: !602, size: 64, offset: 256)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !720, file: !151, line: 2512, baseType: !602, size: 64, offset: 320)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !604, file: !151, line: 3382, baseType: !732, size: 896)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !151, line: 2652, size: 896, elements: !733)
!733 = !{!734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !732, file: !151, line: 2653, baseType: !720, size: 384)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !732, file: !151, line: 2654, baseType: !602, size: 64, offset: 384)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !732, file: !151, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !732, file: !151, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !732, file: !151, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !732, file: !151, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !732, file: !151, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !732, file: !151, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !732, file: !151, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !732, file: !151, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !732, file: !151, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !732, file: !151, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !732, file: !151, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !732, file: !151, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !732, file: !151, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !732, file: !151, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !732, file: !151, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !732, file: !151, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !732, file: !151, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !732, file: !151, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !732, file: !151, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !732, file: !151, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !732, file: !151, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !732, file: !151, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !732, file: !151, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !732, file: !151, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !732, file: !151, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !732, file: !151, line: 2703, baseType: !7, size: 32, offset: 512)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !732, file: !151, line: 2705, baseType: !602, size: 64, offset: 576)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !732, file: !151, line: 2706, baseType: !602, size: 64, offset: 640)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !732, file: !151, line: 2707, baseType: !602, size: 64, offset: 704)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !732, file: !151, line: 2708, baseType: !602, size: 64, offset: 768)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !732, file: !151, line: 2711, baseType: !767, size: 64, offset: 832)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !151, line: 2711, flags: DIFlagFwdDecl)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !604, file: !151, line: 3383, baseType: !770, size: 960)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !151, line: 2756, size: 960, elements: !771)
!771 = !{!772, !773}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !770, file: !151, line: 2757, baseType: !732, size: 896)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !770, file: !151, line: 2758, baseType: !774, size: 64, offset: 896)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !544, line: 50, baseType: !775)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !391, line: 240, size: 384, elements: !777)
!777 = !{!778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !776, file: !391, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !776, file: !391, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !776, file: !391, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !776, file: !391, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !776, file: !391, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !776, file: !391, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !776, file: !391, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !776, file: !391, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !776, file: !391, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !776, file: !391, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !776, file: !391, line: 321, baseType: !789, size: 320, offset: 64)
!789 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !391, line: 315, size: 320, elements: !790)
!790 = !{!791, !909, !911, !974, !975}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !789, file: !391, line: 316, baseType: !792, size: 64)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !793, size: 64, elements: !565)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !391, line: 183, baseType: !794)
!794 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !391, line: 166, size: 64, elements: !795)
!795 = !{!796, !797, !798, !799, !800, !808, !809, !821, !824, !884, !885, !886, !899, !906}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !794, file: !391, line: 168, baseType: !536, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !794, file: !391, line: 169, baseType: !7, size: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !794, file: !391, line: 170, baseType: !541, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !794, file: !391, line: 171, baseType: !774, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !794, file: !391, line: 172, baseType: !801, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !544, line: 53, baseType: !802)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !391, line: 359, size: 128, elements: !804)
!804 = !{!805, !806}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !803, file: !391, line: 360, baseType: !536, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !803, file: !391, line: 361, baseType: !807, size: 64, offset: 64)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !774, size: 64, elements: !565)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !794, file: !391, line: 173, baseType: !5, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !794, file: !391, line: 174, baseType: !810, size: 32)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !391, line: 133, baseType: !811)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !391, line: 115, size: 32, elements: !812)
!812 = !{!813, !814, !815, !816, !817, !818, !819, !820}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !811, file: !391, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !811, file: !391, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !811, file: !391, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !811, file: !391, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !811, file: !391, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !811, file: !391, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !811, file: !391, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !811, file: !391, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !794, file: !391, line: 175, baseType: !822, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !391, line: 175, flags: DIFlagFwdDecl)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !794, file: !391, line: 176, baseType: !825, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !827, line: 75, size: 256, elements: !828)
!827 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!828 = !{!829, !843, !844, !845}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !826, file: !827, line: 76, baseType: !830, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !827, line: 68, baseType: !832)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !827, line: 63, size: 320, elements: !833)
!833 = !{!834, !836, !837, !838}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !832, file: !827, line: 64, baseType: !835, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !832, file: !827, line: 65, baseType: !835, size: 64, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !832, file: !827, line: 66, baseType: !7, size: 32, offset: 128)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !832, file: !827, line: 67, baseType: !839, size: 128, offset: 192)
!839 = !DICompositeType(tag: DW_TAG_array_type, baseType: !840, size: 128, elements: !841)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !827, line: 29, baseType: !655)
!841 = !{!842}
!842 = !DISubrange(count: 2)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !826, file: !827, line: 77, baseType: !830, size: 64, offset: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !826, file: !827, line: 78, baseType: !7, size: 32, offset: 128)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !826, file: !827, line: 79, baseType: !846, size: 64, offset: 192)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !827, line: 49, baseType: !848)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !827, line: 45, size: 832, elements: !849)
!849 = !{!850, !851, !852}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !848, file: !827, line: 46, baseType: !835, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !848, file: !827, line: 47, baseType: !825, size: 64, offset: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !848, file: !827, line: 48, baseType: !853, size: 704, offset: 128)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !854, line: 164, size: 704, elements: !855)
!854 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!855 = !{!856, !857, !867, !868, !869, !870, !871, !872, !876, !880, !881, !882, !883}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !853, file: !854, line: 166, baseType: !657, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !853, file: !854, line: 167, baseType: !858, size: 64, offset: 64)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !854, line: 157, size: 192, elements: !860)
!860 = !{!861, !862, !863}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !859, file: !854, line: 159, baseType: !538, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !859, file: !854, line: 160, baseType: !858, size: 64, offset: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !859, file: !854, line: 161, baseType: !864, size: 32, offset: 128)
!864 = !DICompositeType(tag: DW_TAG_array_type, baseType: !539, size: 32, elements: !865)
!865 = !{!866}
!866 = !DISubrange(count: 4)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !853, file: !854, line: 168, baseType: !538, size: 64, offset: 128)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !853, file: !854, line: 169, baseType: !538, size: 64, offset: 192)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !853, file: !854, line: 170, baseType: !538, size: 64, offset: 256)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !853, file: !854, line: 171, baseType: !657, size: 64, offset: 320)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !853, file: !854, line: 172, baseType: !536, size: 32, offset: 384)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !853, file: !854, line: 176, baseType: !873, size: 64, offset: 448)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DISubroutineType(types: !875)
!875 = !{!858, !540, !657}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !853, file: !854, line: 177, baseType: !877, size: 64, offset: 512)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DISubroutineType(types: !879)
!879 = !{null, !540, !858}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !853, file: !854, line: 178, baseType: !540, size: 64, offset: 576)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !853, file: !854, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !853, file: !854, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !853, file: !854, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !794, file: !391, line: 177, baseType: !602, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !794, file: !391, line: 178, baseType: !549, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !794, file: !391, line: 179, baseType: !887, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !391, line: 150, baseType: !889)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !391, line: 142, size: 320, elements: !890)
!890 = !{!891, !892, !893, !894, !897, !898}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !889, file: !391, line: 144, baseType: !602, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !889, file: !391, line: 145, baseType: !774, size: 64, offset: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !889, file: !391, line: 146, baseType: !774, size: 64, offset: 128)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !889, file: !391, line: 147, baseType: !895, size: 32, offset: 192)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !896, line: 31, baseType: !536)
!896 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!897 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !889, file: !391, line: 148, baseType: !7, size: 32, offset: 224)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !889, file: !391, line: 149, baseType: !535, size: 8, offset: 256)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !794, file: !391, line: 180, baseType: !900, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !391, line: 162, baseType: !902)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !391, line: 159, size: 128, elements: !903)
!903 = !{!904, !905}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !902, file: !391, line: 160, baseType: !602, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !902, file: !391, line: 161, baseType: !657, size: 64, offset: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !794, file: !391, line: 181, baseType: !907, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !391, line: 181, flags: DIFlagFwdDecl)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !789, file: !391, line: 317, baseType: !910, size: 64)
!910 = !DICompositeType(tag: DW_TAG_array_type, baseType: !657, size: 64, elements: !565)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !789, file: !391, line: 318, baseType: !912, size: 320)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !391, line: 188, size: 320, elements: !913)
!913 = !{!914, !916, !973}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !912, file: !391, line: 190, baseType: !915, size: 192)
!915 = !DICompositeType(tag: DW_TAG_array_type, baseType: !793, size: 192, elements: !675)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !912, file: !391, line: 193, baseType: !917, size: 64, offset: 192)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !391, line: 206, size: 320, elements: !919)
!919 = !{!920, !958, !959, !960, !972}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !918, file: !391, line: 208, baseType: !921, size: 64)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !544, line: 62, baseType: !923)
!923 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !924, line: 538, size: 256, elements: !925)
!924 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!925 = !{!926, !930, !936, !949}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !923, file: !924, line: 539, baseType: !927, size: 32)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !924, line: 482, size: 32, elements: !928)
!928 = !{!929}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !927, file: !924, line: 484, baseType: !7, size: 32)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !923, file: !924, line: 540, baseType: !931, size: 192)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !924, line: 488, size: 192, elements: !932)
!932 = !{!933, !934, !935}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !931, file: !924, line: 489, baseType: !927, size: 32)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !931, file: !924, line: 492, baseType: !541, size: 64, offset: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !931, file: !924, line: 496, baseType: !602, size: 64, offset: 128)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !923, file: !924, line: 541, baseType: !937, size: 256)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !924, line: 504, size: 256, elements: !938)
!938 = !{!939, !940, !947, !948}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !937, file: !924, line: 505, baseType: !927, size: 32)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !937, file: !924, line: 509, baseType: !941, size: 64, offset: 64)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !924, line: 501, baseType: !942)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DISubroutineType(types: !944)
!944 = !{null, !945}
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !937, file: !924, line: 510, baseType: !945, size: 64, offset: 128)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !937, file: !924, line: 513, baseType: !921, size: 64, offset: 192)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !923, file: !924, line: 542, baseType: !950, size: 128)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !924, line: 530, size: 128, elements: !951)
!951 = !{!952, !953}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !950, file: !924, line: 531, baseType: !927, size: 32)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !950, file: !924, line: 534, baseType: !954, size: 64, offset: 64)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !924, line: 525, baseType: !955)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DISubroutineType(types: !957)
!957 = !{!535, !602, !541, !655, !655}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !918, file: !391, line: 211, baseType: !7, size: 32, offset: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !918, file: !391, line: 214, baseType: !657, size: 64, offset: 128)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !918, file: !391, line: 224, baseType: !961, size: 64, offset: 192)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !391, line: 202, baseType: !963)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !391, line: 202, size: 128, elements: !964)
!964 = !{!965}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !963, file: !391, line: 202, baseType: !966, size: 128)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !391, line: 200, baseType: !967)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !391, line: 200, size: 128, elements: !968)
!968 = !{!969, !970, !971}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !967, file: !391, line: 200, baseType: !7, size: 32)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !967, file: !391, line: 200, baseType: !7, size: 32, offset: 32)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !967, file: !391, line: 200, baseType: !807, size: 64, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !918, file: !391, line: 234, baseType: !961, size: 64, offset: 256)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !912, file: !391, line: 197, baseType: !657, size: 64, offset: 256)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !789, file: !391, line: 319, baseType: !664, size: 256)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !789, file: !391, line: 320, baseType: !683, size: 192)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !604, file: !151, line: 3384, baseType: !977, size: 1472)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !151, line: 3114, size: 1472, elements: !978)
!978 = !{!979, !1000, !1001, !1002, !1003}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !977, file: !151, line: 3115, baseType: !980, size: 1216)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !151, line: 2984, size: 1216, elements: !981)
!981 = !{!982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !980, file: !151, line: 2985, baseType: !770, size: 960)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !980, file: !151, line: 2986, baseType: !602, size: 64, offset: 960)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !980, file: !151, line: 2987, baseType: !602, size: 64, offset: 1024)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !980, file: !151, line: 2988, baseType: !602, size: 64, offset: 1088)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !980, file: !151, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !980, file: !151, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !980, file: !151, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !980, file: !151, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !980, file: !151, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !980, file: !151, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !980, file: !151, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !980, file: !151, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !980, file: !151, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !980, file: !151, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !980, file: !151, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !980, file: !151, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !980, file: !151, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !980, file: !151, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !977, file: !151, line: 3117, baseType: !602, size: 64, offset: 1216)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !977, file: !151, line: 3119, baseType: !602, size: 64, offset: 1280)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !977, file: !151, line: 3121, baseType: !602, size: 64, offset: 1344)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !977, file: !151, line: 3123, baseType: !602, size: 64, offset: 1408)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !604, file: !151, line: 3385, baseType: !1005, size: 1088)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !151, line: 2874, size: 1088, elements: !1006)
!1006 = !{!1007, !1008, !1009}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1005, file: !151, line: 2875, baseType: !770, size: 960)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1005, file: !151, line: 2876, baseType: !774, size: 64, offset: 960)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1005, file: !151, line: 2877, baseType: !1010, size: 64, offset: 1024)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !151, line: 2856, flags: DIFlagFwdDecl)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !604, file: !151, line: 3386, baseType: !980, size: 1216)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !604, file: !151, line: 3387, baseType: !1014, size: 1280)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !151, line: 3093, size: 1280, elements: !1015)
!1015 = !{!1016, !1017}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1014, file: !151, line: 3094, baseType: !980, size: 1216)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1014, file: !151, line: 3095, baseType: !1010, size: 64, offset: 1216)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !604, file: !151, line: 3388, baseType: !1019, size: 1216)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !151, line: 2824, size: 1216, elements: !1020)
!1020 = !{!1021, !1022, !1023, !1024, !1025, !1026}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1019, file: !151, line: 2825, baseType: !732, size: 896)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1019, file: !151, line: 2827, baseType: !602, size: 64, offset: 896)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1019, file: !151, line: 2828, baseType: !602, size: 64, offset: 960)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1019, file: !151, line: 2829, baseType: !602, size: 64, offset: 1024)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1019, file: !151, line: 2830, baseType: !602, size: 64, offset: 1088)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1019, file: !151, line: 2831, baseType: !602, size: 64, offset: 1152)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !604, file: !151, line: 3389, baseType: !1028, size: 1024)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !151, line: 2850, size: 1024, elements: !1029)
!1029 = !{!1030, !1031, !1032}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1028, file: !151, line: 2851, baseType: !770, size: 960)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1028, file: !151, line: 2852, baseType: !536, size: 32, offset: 960)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1028, file: !151, line: 2853, baseType: !536, size: 32, offset: 992)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !604, file: !151, line: 3390, baseType: !1034, size: 1024)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !151, line: 2857, size: 1024, elements: !1035)
!1035 = !{!1036, !1037}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1034, file: !151, line: 2858, baseType: !770, size: 960)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1034, file: !151, line: 2859, baseType: !1010, size: 64, offset: 960)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !604, file: !151, line: 3391, baseType: !1039, size: 960)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !151, line: 2862, size: 960, elements: !1040)
!1040 = !{!1041}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1039, file: !151, line: 2863, baseType: !770, size: 960)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !604, file: !151, line: 3392, baseType: !1043, size: 1472)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !151, line: 3304, size: 1472, elements: !1044)
!1044 = !{!1045}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1043, file: !151, line: 3305, baseType: !977, size: 1472)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !604, file: !151, line: 3393, baseType: !1047, size: 1792)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !151, line: 3248, size: 1792, elements: !1048)
!1048 = !{!1049, !1050, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1047, file: !151, line: 3249, baseType: !977, size: 1472)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1047, file: !151, line: 3251, baseType: !1051, size: 64, offset: 1472)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1053, line: 463, size: 1152, elements: !1054)
!1053 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1054 = !{!1055, !1058, !1089, !1092, !1095, !1152, !1153, !1154, !1155, !1156, !1157, !1181, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1052, file: !1053, line: 464, baseType: !1056, size: 64)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1053, line: 464, flags: DIFlagFwdDecl)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1052, file: !1053, line: 467, baseType: !1059, size: 64, offset: 64)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !135, line: 374, size: 640, elements: !1061)
!1061 = !{!1062, !1064, !1065, !1078, !1079, !1080, !1081, !1082, !1083, !1085, !1087, !1088}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1060, file: !135, line: 377, baseType: !1063, size: 64)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !544, line: 111, baseType: !549)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1060, file: !135, line: 378, baseType: !1063, size: 64, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1060, file: !135, line: 381, baseType: !1066, size: 64, offset: 128)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !135, line: 282, baseType: !1068)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !135, line: 282, size: 128, elements: !1069)
!1069 = !{!1070}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1068, file: !135, line: 282, baseType: !1071, size: 128)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !135, line: 281, baseType: !1072)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !135, line: 281, size: 128, elements: !1073)
!1073 = !{!1074, !1075, !1076}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1072, file: !135, line: 281, baseType: !7, size: 32)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1072, file: !135, line: 281, baseType: !7, size: 32, offset: 32)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1072, file: !135, line: 281, baseType: !1077, size: 64, offset: 64)
!1077 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1063, size: 64, elements: !565)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1060, file: !135, line: 384, baseType: !536, size: 32, offset: 192)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1060, file: !135, line: 387, baseType: !536, size: 32, offset: 224)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1060, file: !135, line: 390, baseType: !536, size: 32, offset: 256)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1060, file: !135, line: 394, baseType: !1066, size: 64, offset: 320)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1060, file: !135, line: 396, baseType: !134, size: 32, offset: 384)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1060, file: !135, line: 399, baseType: !1084, size: 64, offset: 416)
!1084 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 64, elements: !841)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1060, file: !135, line: 402, baseType: !1086, size: 64, offset: 480)
!1086 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !841)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1060, file: !135, line: 406, baseType: !536, size: 32, offset: 544)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1060, file: !135, line: 409, baseType: !536, size: 32, offset: 576)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1052, file: !1053, line: 470, baseType: !1090, size: 64, offset: 128)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64)
!1091 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !544, line: 65, flags: DIFlagFwdDecl)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1052, file: !1053, line: 473, baseType: !1093, size: 64, offset: 192)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1053, line: 166, flags: DIFlagFwdDecl)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1052, file: !1053, line: 476, baseType: !1096, size: 64, offset: 256)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !378, line: 187, size: 256, elements: !1098)
!1098 = !{!1099, !1100, !1101, !1151}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1097, file: !378, line: 189, baseType: !536, size: 32)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !1097, file: !378, line: 192, baseType: !585, size: 64, offset: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1097, file: !378, line: 197, baseType: !1102, size: 64, offset: 128)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1103, line: 144, baseType: !1104)
!1103 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1103, line: 100, size: 896, elements: !1106)
!1106 = !{!1107, !1113, !1118, !1123, !1125, !1128, !1129, !1130, !1131, !1132, !1137, !1139, !1140, !1145, !1150}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1105, file: !1103, line: 102, baseType: !1108, size: 64)
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1103, line: 52, baseType: !1109)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = !DISubroutineType(types: !1111)
!1111 = !{!1112, !945}
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1103, line: 47, baseType: !7)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1105, file: !1103, line: 105, baseType: !1114, size: 64, offset: 64)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1103, line: 59, baseType: !1115)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{!536, !945, !945}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1105, file: !1103, line: 108, baseType: !1119, size: 64, offset: 128)
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1103, line: 63, baseType: !1120)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64)
!1121 = !DISubroutineType(types: !1122)
!1122 = !{null, !540}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1105, file: !1103, line: 111, baseType: !1124, size: 64, offset: 192)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1105, file: !1103, line: 114, baseType: !1126, size: 64, offset: 256)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1127, line: 46, baseType: !655)
!1127 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1105, file: !1103, line: 117, baseType: !1126, size: 64, offset: 320)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1105, file: !1103, line: 120, baseType: !1126, size: 64, offset: 384)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1105, file: !1103, line: 124, baseType: !7, size: 32, offset: 448)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1105, file: !1103, line: 128, baseType: !7, size: 32, offset: 480)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1105, file: !1103, line: 131, baseType: !1133, size: 64, offset: 512)
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1103, line: 75, baseType: !1134)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64)
!1135 = !DISubroutineType(types: !1136)
!1136 = !{!540, !1126, !1126}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1105, file: !1103, line: 132, baseType: !1138, size: 64, offset: 576)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1103, line: 78, baseType: !1120)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1105, file: !1103, line: 135, baseType: !540, size: 64, offset: 640)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1105, file: !1103, line: 136, baseType: !1141, size: 64, offset: 704)
!1141 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1103, line: 82, baseType: !1142)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64)
!1143 = !DISubroutineType(types: !1144)
!1144 = !{!540, !540, !1126, !1126}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1105, file: !1103, line: 137, baseType: !1146, size: 64, offset: 768)
!1146 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1103, line: 83, baseType: !1147)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64)
!1148 = !DISubroutineType(types: !1149)
!1149 = !{null, !540, !540}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1105, file: !1103, line: 141, baseType: !7, size: 32, offset: 832)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !1097, file: !378, line: 200, baseType: !570, size: 64, offset: 192)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1052, file: !1053, line: 479, baseType: !1102, size: 64, offset: 320)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1052, file: !1053, line: 484, baseType: !602, size: 64, offset: 384)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1052, file: !1053, line: 488, baseType: !602, size: 64, offset: 448)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1052, file: !1053, line: 493, baseType: !602, size: 64, offset: 512)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1052, file: !1053, line: 496, baseType: !602, size: 64, offset: 576)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1052, file: !1053, line: 501, baseType: !1158, size: 64, offset: 640)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !146, line: 2355, size: 576, elements: !1160)
!1160 = !{!1161, !1164, !1165, !1166, !1167, !1169, !1170, !1175, !1176, !1177, !1178, !1179, !1180}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1159, file: !146, line: 2356, baseType: !1162, size: 64)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !146, line: 2356, flags: DIFlagFwdDecl)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1159, file: !146, line: 2357, baseType: !541, size: 64, offset: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1159, file: !146, line: 2358, baseType: !536, size: 32, offset: 128)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1159, file: !146, line: 2359, baseType: !536, size: 32, offset: 160)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1159, file: !146, line: 2360, baseType: !1168, size: 128, offset: 192)
!1168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !536, size: 128, elements: !865)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1159, file: !146, line: 2364, baseType: !536, size: 32, offset: 320)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1159, file: !146, line: 2367, baseType: !1171, size: 128, offset: 384)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !146, line: 2349, size: 128, elements: !1172)
!1172 = !{!1173, !1174}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1171, file: !146, line: 2351, baseType: !774, size: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1171, file: !146, line: 2352, baseType: !657, size: 64, offset: 64)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1159, file: !146, line: 2371, baseType: !145, size: 32, offset: 512)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1159, file: !146, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1159, file: !146, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1159, file: !146, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1159, file: !146, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1159, file: !146, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1052, file: !1053, line: 504, baseType: !1182, size: 64, offset: 704)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64)
!1183 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1053, line: 504, flags: DIFlagFwdDecl)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1052, file: !1053, line: 507, baseType: !1102, size: 64, offset: 768)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1052, file: !1053, line: 510, baseType: !536, size: 32, offset: 832)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1052, file: !1053, line: 513, baseType: !536, size: 32, offset: 864)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1052, file: !1053, line: 516, baseType: !724, size: 32, offset: 896)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1052, file: !1053, line: 519, baseType: !724, size: 32, offset: 928)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1052, file: !1053, line: 522, baseType: !7, size: 32, offset: 960)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1052, file: !1053, line: 523, baseType: !7, size: 32, offset: 992)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1052, file: !1053, line: 528, baseType: !541, size: 64, offset: 1024)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1052, file: !1053, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1052, file: !1053, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1052, file: !1053, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1052, file: !1053, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1052, file: !1053, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1052, file: !1053, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1052, file: !1053, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1052, file: !1053, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1052, file: !1053, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1052, file: !1053, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1052, file: !1053, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1052, file: !1053, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1052, file: !1053, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1052, file: !1053, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1052, file: !1053, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1052, file: !1053, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1047, file: !151, line: 3254, baseType: !602, size: 64, offset: 1536)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1047, file: !151, line: 3257, baseType: !602, size: 64, offset: 1600)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1047, file: !151, line: 3258, baseType: !602, size: 64, offset: 1664)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1047, file: !151, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1047, file: !151, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1047, file: !151, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1047, file: !151, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1047, file: !151, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1047, file: !151, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1047, file: !151, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1047, file: !151, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1047, file: !151, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1047, file: !151, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1047, file: !151, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1047, file: !151, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1047, file: !151, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1047, file: !151, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1047, file: !151, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1047, file: !151, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1047, file: !151, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1047, file: !151, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !604, file: !151, line: 3394, baseType: !1230, size: 1344)
!1230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !151, line: 2279, size: 1344, elements: !1231)
!1231 = !{!1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1230, file: !151, line: 2280, baseType: !640, size: 192)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1230, file: !151, line: 2281, baseType: !602, size: 64, offset: 192)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1230, file: !151, line: 2282, baseType: !602, size: 64, offset: 256)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1230, file: !151, line: 2283, baseType: !602, size: 64, offset: 320)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1230, file: !151, line: 2284, baseType: !602, size: 64, offset: 384)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1230, file: !151, line: 2285, baseType: !7, size: 32, offset: 448)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1230, file: !151, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1230, file: !151, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1230, file: !151, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1230, file: !151, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1230, file: !151, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1230, file: !151, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1230, file: !151, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1230, file: !151, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1230, file: !151, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1230, file: !151, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1230, file: !151, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1230, file: !151, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1230, file: !151, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1230, file: !151, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1230, file: !151, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1230, file: !151, line: 2305, baseType: !7, size: 32, offset: 512)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1230, file: !151, line: 2306, baseType: !895, size: 32, offset: 544)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1230, file: !151, line: 2307, baseType: !602, size: 64, offset: 576)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1230, file: !151, line: 2308, baseType: !602, size: 64, offset: 640)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1230, file: !151, line: 2314, baseType: !1258, size: 64, offset: 704)
!1258 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !151, line: 2309, size: 64, elements: !1259)
!1259 = !{!1260, !1261, !1262}
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1258, file: !151, line: 2310, baseType: !536, size: 32)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1258, file: !151, line: 2311, baseType: !541, size: 64)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1258, file: !151, line: 2312, baseType: !1263, size: 64)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64)
!1264 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !151, line: 2277, flags: DIFlagFwdDecl)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1230, file: !151, line: 2315, baseType: !602, size: 64, offset: 768)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1230, file: !151, line: 2316, baseType: !602, size: 64, offset: 832)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1230, file: !151, line: 2317, baseType: !602, size: 64, offset: 896)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1230, file: !151, line: 2318, baseType: !602, size: 64, offset: 960)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1230, file: !151, line: 2319, baseType: !602, size: 64, offset: 1024)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1230, file: !151, line: 2320, baseType: !602, size: 64, offset: 1088)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1230, file: !151, line: 2321, baseType: !602, size: 64, offset: 1152)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1230, file: !151, line: 2322, baseType: !602, size: 64, offset: 1216)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1230, file: !151, line: 2324, baseType: !1274, size: 64, offset: 1280)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64)
!1275 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !151, line: 2324, flags: DIFlagFwdDecl)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !604, file: !151, line: 3395, baseType: !1277, size: 320)
!1277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !151, line: 1469, size: 320, elements: !1278)
!1278 = !{!1279, !1280, !1281}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1277, file: !151, line: 1470, baseType: !640, size: 192)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1277, file: !151, line: 1471, baseType: !602, size: 64, offset: 192)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1277, file: !151, line: 1472, baseType: !602, size: 64, offset: 256)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !604, file: !151, line: 3396, baseType: !1283, size: 320)
!1283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !151, line: 1482, size: 320, elements: !1284)
!1284 = !{!1285, !1286, !1287}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1283, file: !151, line: 1483, baseType: !640, size: 192)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1283, file: !151, line: 1484, baseType: !536, size: 32, offset: 192)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1283, file: !151, line: 1485, baseType: !1288, size: 64, offset: 256)
!1288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 64, elements: !565)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !604, file: !151, line: 3397, baseType: !1290, size: 384)
!1290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !151, line: 1829, size: 384, elements: !1291)
!1291 = !{!1292, !1293, !1294, !1295}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1290, file: !151, line: 1830, baseType: !640, size: 192)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1290, file: !151, line: 1831, baseType: !724, size: 32, offset: 192)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1290, file: !151, line: 1832, baseType: !602, size: 64, offset: 256)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1290, file: !151, line: 1835, baseType: !1288, size: 64, offset: 320)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !604, file: !151, line: 3398, baseType: !1297, size: 704)
!1297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !151, line: 1898, size: 704, elements: !1298)
!1298 = !{!1299, !1300, !1301, !1305, !1306, !1309}
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1297, file: !151, line: 1899, baseType: !640, size: 192)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1297, file: !151, line: 1902, baseType: !602, size: 64, offset: 192)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1297, file: !151, line: 1905, baseType: !1302, size: 64, offset: 256)
