; ModuleID = 'cfgrtl.bc'
source_filename = "cfgrtl.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.rtl_data = type { %struct.expr_status, %struct.emit_status, %struct.varasm_status, %struct.incoming_args, %struct.function_subsections, %struct.rtl_eh, i32, %struct.rtx_def*, %struct.initial_value_struct*, %union.tree_node*, %struct.rtx_def*, %struct.rtx_def*, %struct.rtx_def*, %struct.rtx_def*, %struct.rtx_def*, %struct.rtx_def*, %struct.rtx_def*, i64, %struct.rtx_def*, %struct.VEC_temp_slot_p_gc*, %struct.temp_slot*, i32, i32, i32, i32, i32, i32, %struct.rtx_def*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.expr_status = type { i32, i32, i32, %struct.rtx_def*, %struct.rtx_def*, %struct.rtx_def* }
%struct.emit_status = type { i32, i32, %struct.rtx_def*, %struct.rtx_def*, %struct.sequence_stack*, i32, i32, i32, i32, i8* }
%struct.sequence_stack = type { %struct.rtx_def*, %struct.rtx_def*, %struct.sequence_stack* }
%struct.varasm_status = type { %struct.rtx_constant_pool*, i32 }

!659 = !DIEnumerator(name: "TV_TREE_SWITCH_CONVERSION", value: 109, isUnsigned: true)
!660 = !DIEnumerator(name: "TV_CGRAPH_VERIFY", value: 110, isUnsigned: true)
!661 = !DIEnumerator(name: "TV_DOM_FRONTIERS", value: 111, isUnsigned: true)
!662 = !DIEnumerator(name: "TV_DOMINANCE", value: 112, isUnsigned: true)
!663 = !DIEnumerator(name: "TV_CONTROL_DEPENDENCES", value: 113, isUnsigned: true)
!664 = !DIEnumerator(name: "TV_OVERLOAD", value: 114, isUnsigned: true)
!665 = !DIEnumerator(name: "TV_TEMPLATE_INSTANTIATION", value: 115, isUnsigned: true)
!666 = !DIEnumerator(name: "TV_EXPAND", value: 116, isUnsigned: true)
!667 = !DIEnumerator(name: "TV_VARCONST", value: 117, isUnsigned: true)
!668 = !DIEnumerator(name: "TV_LOWER_SUBREG", value: 118, isUnsigned: true)
!669 = !DIEnumerator(name: "TV_JUMP", value: 119, isUnsigned: true)
!670 = !DIEnumerator(name: "TV_FWPROP", value: 120, isUnsigned: true)
!671 = !DIEnumerator(name: "TV_CSE", value: 121, isUnsigned: true)
!672 = !DIEnumerator(name: "TV_DCE", value: 122, isUnsigned: true)
!673 = !DIEnumerator(name: "TV_DSE1", value: 123, isUnsigned: true)
!674 = !DIEnumerator(name: "TV_DSE2", value: 124, isUnsigned: true)
!675 = !DIEnumerator(name: "TV_LOOP", value: 125, isUnsigned: true)
!676 = !DIEnumerator(name: "TV_LOOP_MOVE_INVARIANTS", value: 126, isUnsigned: true)
!677 = !DIEnumerator(name: "TV_LOOP_UNSWITCH", value: 127, isUnsigned: true)
!678 = !DIEnumerator(name: "TV_LOOP_UNROLL", value: 128, isUnsigned: true)
!679 = !DIEnumerator(name: "TV_LOOP_DOLOOP", value: 129, isUnsigned: true)
!680 = !DIEnumerator(name: "TV_CPROP", value: 130, isUnsigned: true)
!681 = !DIEnumerator(name: "TV_PRE", value: 131, isUnsigned: true)
!682 = !DIEnumerator(name: "TV_HOIST", value: 132, isUnsigned: true)
!683 = !DIEnumerator(name: "TV_LSM", value: 133, isUnsigned: true)
!684 = !DIEnumerator(name: "TV_TRACER", value: 134, isUnsigned: true)
!685 = !DIEnumerator(name: "TV_WEB", value: 135, isUnsigned: true)
!686 = !DIEnumerator(name: "TV_AUTO_INC_DEC", value: 136, isUnsigned: true)
!687 = !DIEnumerator(name: "TV_CSE2", value: 137, isUnsigned: true)
!688 = !DIEnumerator(name: "TV_BRANCH_PROB", value: 138, isUnsigned: true)
!689 = !DIEnumerator(name: "TV_VPT", value: 139, isUnsigned: true)
!690 = !DIEnumerator(name: "TV_COMBINE", value: 140, isUnsigned: true)
!691 = !DIEnumerator(name: "TV_IFCVT", value: 141, isUnsigned: true)
!692 = !DIEnumerator(name: "TV_REGMOVE", value: 142, isUnsigned: true)
!693 = !DIEnumerator(name: "TV_MODE_SWITCH", value: 143, isUnsigned: true)
!694 = !DIEnumerator(name: "TV_SMS", value: 144, isUnsigned: true)
!695 = !DIEnumerator(name: "TV_SCHED", value: 145, isUnsigned: true)
!696 = !DIEnumerator(name: "TV_LOCAL_ALLOC", value: 146, isUnsigned: true)
!697 = !DIEnumerator(name: "TV_GLOBAL_ALLOC", value: 147, isUnsigned: true)
!698 = !DIEnumerator(name: "TV_IRA", value: 148, isUnsigned: true)
!699 = !DIEnumerator(name: "TV_RELOAD", value: 149, isUnsigned: true)
!700 = !DIEnumerator(name: "TV_RELOAD_CSE_REGS", value: 150, isUnsigned: true)
!701 = !DIEnumerator(name: "TV_SEQABSTR", value: 151, isUnsigned: true)
!702 = !DIEnumerator(name: "TV_GCSE_AFTER_RELOAD", value: 152, isUnsigned: true)
!703 = !DIEnumerator(name: "TV_THREAD_PROLOGUE_AND_EPILOGUE", value: 153, isUnsigned: true)
!704 = !DIEnumerator(name: "TV_IFCVT2", value: 154, isUnsigned: true)
!705 = !DIEnumerator(name: "TV_COMBINE_STACK_ADJUST", value: 155, isUnsigned: true)
!706 = !DIEnumerator(name: "TV_PEEPHOLE2", value: 156, isUnsigned: true)
!707 = !DIEnumerator(name: "TV_RENAME_REGISTERS", value: 157, isUnsigned: true)
!708 = !DIEnumerator(name: "TV_CPROP_REGISTERS", value: 158, isUnsigned: true)
!709 = !DIEnumerator(name: "TV_SCHED2", value: 159, isUnsigned: true)
!710 = !DIEnumerator(name: "TV_MACH_DEP", value: 160, isUnsigned: true)
!711 = !DIEnumerator(name: "TV_DBR_SCHED", value: 161, isUnsigned: true)
!712 = !DIEnumerator(name: "TV_REORDER_BLOCKS", value: 162, isUnsigned: true)
!713 = !DIEnumerator(name: "TV_SHORTEN_BRANCH", value: 163, isUnsigned: true)
!714 = !DIEnumerator(name: "TV_REG_STACK", value: 164, isUnsigned: true)
!715 = !DIEnumerator(name: "TV_FINAL", value: 165, isUnsigned: true)
!716 = !DIEnumerator(name: "TV_SYMOUT", value: 166, isUnsigned: true)
!717 = !DIEnumerator(name: "TV_VAR_TRACKING", value: 167, isUnsigned: true)
!718 = !DIEnumerator(name: "TV_TREE_IFCOMBINE", value: 168, isUnsigned: true)
!719 = !DIEnumerator(name: "TV_PLUGIN_INIT", value: 169, isUnsigned: true)
!720 = !DIEnumerator(name: "TV_PLUGIN_RUN", value: 170, isUnsigned: true)
!721 = !DIEnumerator(name: "TV_REST_OF_COMPILATION", value: 171, isUnsigned: true)
!722 = !DIEnumerator(name: "TIMEVAR_LAST", value: 172, isUnsigned: true)
!723 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "bb_state", scope: !724, file: !3, line: 1645, baseType: !7, size: 32, elements: !2053)
!724 = distinct !DISubprogram(name: "print_rtl_with_bb", scope: !3, file: !3, line: 1638, type: !725, scopeLine: 1639, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !2014)
!725 = !DISubroutineType(types: !726)
!726 = !{null, !727, !790}
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !729, line: 7, baseType: !730)
!729 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !731, line: 49, size: 1728, elements: !732)
!731 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!732 = !{!733, !735, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !751, !753, !754, !755, !759, !761, !763, !767, !770, !772, !775, !778, !779, !781, !785, !786}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !730, file: !731, line: 51, baseType: !734, size: 32)
!734 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !730, file: !731, line: 54, baseType: !736, size: 64, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !730, file: !731, line: 55, baseType: !736, size: 64, offset: 128)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !730, file: !731, line: 56, baseType: !736, size: 64, offset: 192)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !730, file: !731, line: 57, baseType: !736, size: 64, offset: 256)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !730, file: !731, line: 58, baseType: !736, size: 64, offset: 320)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !730, file: !731, line: 59, baseType: !736, size: 64, offset: 384)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !730, file: !731, line: 60, baseType: !736, size: 64, offset: 448)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !730, file: !731, line: 61, baseType: !736, size: 64, offset: 512)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !730, file: !731, line: 64, baseType: !736, size: 64, offset: 576)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !730, file: !731, line: 65, baseType: !736, size: 64, offset: 640)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !730, file: !731, line: 66, baseType: !736, size: 64, offset: 704)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !730, file: !731, line: 68, baseType: !749, size: 64, offset: 768)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !731, line: 36, flags: DIFlagFwdDecl)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !730, file: !731, line: 70, baseType: !752, size: 64, offset: 832)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !730, file: !731, line: 72, baseType: !734, size: 32, offset: 896)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !730, file: !731, line: 73, baseType: !734, size: 32, offset: 928)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !730, file: !731, line: 74, baseType: !756, size: 64, offset: 960)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !757, line: 152, baseType: !758)
!757 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!758 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !730, file: !731, line: 77, baseType: !760, size: 16, offset: 1024)
!760 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !730, file: !731, line: 78, baseType: !762, size: 8, offset: 1040)
!762 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !730, file: !731, line: 79, baseType: !764, size: 8, offset: 1048)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !737, size: 8, elements: !765)
!765 = !{!766}
!766 = !DISubrange(count: 1)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !730, file: !731, line: 81, baseType: !768, size: 64, offset: 1088)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !731, line: 43, baseType: null)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !730, file: !731, line: 89, baseType: !771, size: 64, offset: 1152)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !757, line: 153, baseType: !758)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !730, file: !731, line: 91, baseType: !773, size: 64, offset: 1216)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !731, line: 37, flags: DIFlagFwdDecl)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !730, file: !731, line: 92, baseType: !776, size: 64, offset: 1280)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !731, line: 38, flags: DIFlagFwdDecl)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !730, file: !731, line: 93, baseType: !752, size: 64, offset: 1344)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !730, file: !731, line: 94, baseType: !780, size: 64, offset: 1408)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !730, file: !731, line: 95, baseType: !782, size: 64, offset: 1472)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !783, line: 46, baseType: !784)
!783 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!784 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !730, file: !731, line: 96, baseType: !734, size: 32, offset: 1536)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !730, file: !731, line: 98, baseType: !787, size: 160, offset: 1568)
!787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !737, size: 160, elements: !788)
!788 = !{!789}
!789 = !DISubrange(count: 20)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_rtx", file: !791, line: 51, baseType: !792)
!791 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !794)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !398, line: 240, size: 384, elements: !795)
!795 = !{!796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !794, file: !398, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !794, file: !398, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !794, file: !398, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !794, file: !398, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !794, file: !398, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !794, file: !398, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !794, file: !398, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !794, file: !398, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !794, file: !398, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !794, file: !398, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !794, file: !398, line: 321, baseType: !807, size: 320, offset: 64)
!807 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !398, line: 315, size: 320, elements: !808)
!808 = !{!809, !1949, !1951, !2012, !2013}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !807, file: !398, line: 316, baseType: !810, size: 64)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !811, size: 64, elements: !765)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !398, line: 183, baseType: !812)
!812 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !398, line: 166, size: 64, elements: !813)
!813 = !{!814, !815, !816, !819, !822, !830, !831, !843, !846, !906, !1927, !1928, !1939, !1946}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !812, file: !398, line: 168, baseType: !734, size: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !812, file: !398, line: 169, baseType: !7, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !812, file: !398, line: 170, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !737)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !812, file: !398, line: 171, baseType: !820, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !791, line: 50, baseType: !821)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !812, file: !398, line: 172, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !791, line: 53, baseType: !824)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !398, line: 359, size: 128, elements: !826)
!826 = !{!827, !828}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !825, file: !398, line: 360, baseType: !734, size: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !825, file: !398, line: 361, baseType: !829, size: 64, offset: 64)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !820, size: 64, elements: !765)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !812, file: !398, line: 173, baseType: !5, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !812, file: !398, line: 174, baseType: !832, size: 32)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !398, line: 133, baseType: !833)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !398, line: 115, size: 32, elements: !834)
!834 = !{!835, !836, !837, !838, !839, !840, !841, !842}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !833, file: !398, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !833, file: !398, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !833, file: !398, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !833, file: !398, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !833, file: !398, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !833, file: !398, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !833, file: !398, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !833, file: !398, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !812, file: !398, line: 175, baseType: !844, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !398, line: 175, flags: DIFlagFwdDecl)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !812, file: !398, line: 176, baseType: !847, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !849, line: 75, size: 256, elements: !850)
!849 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!850 = !{!851, !865, !866, !867}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !848, file: !849, line: 76, baseType: !852, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !849, line: 68, baseType: !854)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !849, line: 63, size: 320, elements: !855)
!855 = !{!856, !858, !859, !860}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !854, file: !849, line: 64, baseType: !857, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !854, file: !849, line: 65, baseType: !857, size: 64, offset: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !854, file: !849, line: 66, baseType: !7, size: 32, offset: 128)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !854, file: !849, line: 67, baseType: !861, size: 128, offset: 192)
!861 = !DICompositeType(tag: DW_TAG_array_type, baseType: !862, size: 128, elements: !863)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !849, line: 29, baseType: !784)
!863 = !{!864}
!864 = !DISubrange(count: 2)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !848, file: !849, line: 77, baseType: !852, size: 64, offset: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !848, file: !849, line: 78, baseType: !7, size: 32, offset: 128)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !848, file: !849, line: 79, baseType: !868, size: 64, offset: 192)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !849, line: 49, baseType: !870)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !849, line: 45, size: 832, elements: !871)
!871 = !{!872, !873, !874}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !870, file: !849, line: 46, baseType: !857, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !870, file: !849, line: 47, baseType: !847, size: 64, offset: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !870, file: !849, line: 48, baseType: !875, size: 704, offset: 128)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !876, line: 164, size: 704, elements: !877)
!876 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!877 = !{!878, !879, !889, !890, !891, !892, !893, !894, !898, !902, !903, !904, !905}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !875, file: !876, line: 166, baseType: !758, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !875, file: !876, line: 167, baseType: !880, size: 64, offset: 64)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !876, line: 157, size: 192, elements: !882)
!882 = !{!883, !884, !885}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !881, file: !876, line: 159, baseType: !736, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !881, file: !876, line: 160, baseType: !880, size: 64, offset: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !881, file: !876, line: 161, baseType: !886, size: 32, offset: 128)
!886 = !DICompositeType(tag: DW_TAG_array_type, baseType: !737, size: 32, elements: !887)
!887 = !{!888}
!888 = !DISubrange(count: 4)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !875, file: !876, line: 168, baseType: !736, size: 64, offset: 128)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !875, file: !876, line: 169, baseType: !736, size: 64, offset: 192)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !875, file: !876, line: 170, baseType: !736, size: 64, offset: 256)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !875, file: !876, line: 171, baseType: !758, size: 64, offset: 320)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !875, file: !876, line: 172, baseType: !734, size: 32, offset: 384)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !875, file: !876, line: 176, baseType: !895, size: 64, offset: 448)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DISubroutineType(types: !897)
!897 = !{!880, !780, !758}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !875, file: !876, line: 177, baseType: !899, size: 64, offset: 512)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DISubroutineType(types: !901)
!901 = !{null, !780, !880}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !875, file: !876, line: 178, baseType: !780, size: 64, offset: 576)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !875, file: !876, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !875, file: !876, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !875, file: !876, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !812, file: !398, line: 177, baseType: !907, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !791, line: 56, baseType: !908)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !171, line: 3371, size: 1792, elements: !910)
!910 = !{!911, !944, !950, !961, !980, !991, !996, !1002, !1008, !1022, !1034, !1072, !1077, !1105, !1113, !1114, !1119, !1128, !1134, !1139, !1143, !1147, !1567, !1616, !1622, !1628, !1635, !1658, !1672, !1689, !1701, !1723, !1738, !1909}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !909, file: !171, line: 3372, baseType: !912, size: 64)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !171, line: 360, size: 64, elements: !913)
!913 = !{!914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !912, file: !171, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !912, file: !171, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !912, file: !171, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !912, file: !171, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !912, file: !171, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !912, file: !171, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !912, file: !171, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !912, file: !171, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !912, file: !171, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !912, file: !171, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !912, file: !171, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !912, file: !171, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !912, file: !171, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !912, file: !171, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !912, file: !171, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !912, file: !171, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !912, file: !171, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !912, file: !171, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !912, file: !171, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !912, file: !171, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !912, file: !171, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !912, file: !171, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !912, file: !171, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !912, file: !171, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !912, file: !171, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !912, file: !171, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !912, file: !171, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !912, file: !171, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !912, file: !171, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !912, file: !171, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !909, file: !171, line: 3373, baseType: !945, size: 192)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !171, line: 402, size: 192, elements: !946)
!946 = !{!947, !948, !949}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !945, file: !171, line: 403, baseType: !912, size: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !945, file: !171, line: 404, baseType: !907, size: 64, offset: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !945, file: !171, line: 405, baseType: !907, size: 64, offset: 128)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !909, file: !171, line: 3374, baseType: !951, size: 320)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !171, line: 1384, size: 320, elements: !952)
!952 = !{!953, !954}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !951, file: !171, line: 1385, baseType: !945, size: 192)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !951, file: !171, line: 1386, baseType: !955, size: 128, offset: 192)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !956, line: 58, baseType: !957)
!956 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !956, line: 54, size: 128, elements: !958)
!958 = !{!959, !960}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !957, file: !956, line: 56, baseType: !784, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !957, file: !956, line: 57, baseType: !758, size: 64, offset: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !909, file: !171, line: 3375, baseType: !962, size: 256)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !171, line: 1397, size: 256, elements: !963)
!963 = !{!964, !965}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !962, file: !171, line: 1398, baseType: !945, size: 192)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !962, file: !171, line: 1399, baseType: !966, size: 64, offset: 192)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !968, line: 52, size: 256, elements: !969)
!968 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!969 = !{!970, !971, !972, !973, !974, !975, !976}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !967, file: !968, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !967, file: !968, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !967, file: !968, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !967, file: !968, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !967, file: !968, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !967, file: !968, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !967, file: !968, line: 62, baseType: !977, size: 192, offset: 64)
!977 = !DICompositeType(tag: DW_TAG_array_type, baseType: !784, size: 192, elements: !978)
!978 = !{!979}
!979 = !DISubrange(count: 3)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !909, file: !171, line: 3376, baseType: !981, size: 256)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !171, line: 1408, size: 256, elements: !982)
!982 = !{!983, !984}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !981, file: !171, line: 1409, baseType: !945, size: 192)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !981, file: !171, line: 1410, baseType: !985, size: 64, offset: 192)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !987, line: 27, size: 192, elements: !988)
!987 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!988 = !{!989, !990}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !986, file: !987, line: 29, baseType: !955, size: 128)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !986, file: !987, line: 30, baseType: !5, size: 32, offset: 128)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !909, file: !171, line: 3377, baseType: !992, size: 256)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !171, line: 1437, size: 256, elements: !993)
!993 = !{!994, !995}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !992, file: !171, line: 1438, baseType: !945, size: 192)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !992, file: !171, line: 1439, baseType: !907, size: 64, offset: 192)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !909, file: !171, line: 3378, baseType: !997, size: 256)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !171, line: 1418, size: 256, elements: !998)
!998 = !{!999, !1000, !1001}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !997, file: !171, line: 1419, baseType: !945, size: 192)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !997, file: !171, line: 1420, baseType: !734, size: 32, offset: 192)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !997, file: !171, line: 1421, baseType: !764, size: 8, offset: 224)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !909, file: !171, line: 3379, baseType: !1003, size: 320)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !171, line: 1428, size: 320, elements: !1004)
!1004 = !{!1005, !1006, !1007}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1003, file: !171, line: 1429, baseType: !945, size: 192)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !1003, file: !171, line: 1430, baseType: !907, size: 64, offset: 192)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !1003, file: !171, line: 1431, baseType: !907, size: 64, offset: 256)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !909, file: !171, line: 3380, baseType: !1009, size: 320)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !171, line: 1460, size: 320, elements: !1010)
!1010 = !{!1011, !1012}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1009, file: !171, line: 1461, baseType: !945, size: 192)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1009, file: !171, line: 1462, baseType: !1013, size: 128, offset: 192)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1014, line: 31, size: 128, elements: !1015)
!1014 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1015 = !{!1016, !1020, !1021}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1013, file: !1014, line: 32, baseType: !1017, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1019)
!1019 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1013, file: !1014, line: 33, baseType: !7, size: 32, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1013, file: !1014, line: 34, baseType: !7, size: 32, offset: 96)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !909, file: !171, line: 3381, baseType: !1023, size: 384)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !171, line: 2507, size: 384, elements: !1024)
!1024 = !{!1025, !1026, !1031, !1032, !1033}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1023, file: !171, line: 2508, baseType: !945, size: 192)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1023, file: !171, line: 2509, baseType: !1027, size: 32, offset: 192)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1028, line: 58, baseType: !1029)
!1028 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1030, line: 44, baseType: !7)
!1030 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1023, file: !171, line: 2510, baseType: !7, size: 32, offset: 224)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1023, file: !171, line: 2511, baseType: !907, size: 64, offset: 256)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1023, file: !171, line: 2512, baseType: !907, size: 64, offset: 320)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !909, file: !171, line: 3382, baseType: !1035, size: 896)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !171, line: 2652, size: 896, elements: !1036)
!1036 = !{!1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1035, file: !171, line: 2653, baseType: !1023, size: 384)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1035, file: !171, line: 2654, baseType: !907, size: 64, offset: 384)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1035, file: !171, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1035, file: !171, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1035, file: !171, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1035, file: !171, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1035, file: !171, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1035, file: !171, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1035, file: !171, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1035, file: !171, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1035, file: !171, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1035, file: !171, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1035, file: !171, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1035, file: !171, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1035, file: !171, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1035, file: !171, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1035, file: !171, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1035, file: !171, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1035, file: !171, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1035, file: !171, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1035, file: !171, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1035, file: !171, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1035, file: !171, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1035, file: !171, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1035, file: !171, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1035, file: !171, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1035, file: !171, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1035, file: !171, line: 2703, baseType: !7, size: 32, offset: 512)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1035, file: !171, line: 2705, baseType: !907, size: 64, offset: 576)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1035, file: !171, line: 2706, baseType: !907, size: 64, offset: 640)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1035, file: !171, line: 2707, baseType: !907, size: 64, offset: 704)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1035, file: !171, line: 2708, baseType: !907, size: 64, offset: 768)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1035, file: !171, line: 2711, baseType: !1070, size: 64, offset: 832)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !171, line: 2711, flags: DIFlagFwdDecl)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !909, file: !171, line: 3383, baseType: !1073, size: 960)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !171, line: 2756, size: 960, elements: !1074)
!1074 = !{!1075, !1076}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1073, file: !171, line: 2757, baseType: !1035, size: 896)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1073, file: !171, line: 2758, baseType: !820, size: 64, offset: 896)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !909, file: !171, line: 3384, baseType: !1078, size: 1472)
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !171, line: 3114, size: 1472, elements: !1079)
!1079 = !{!1080, !1101, !1102, !1103, !1104}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1078, file: !171, line: 3115, baseType: !1081, size: 1216)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !171, line: 2984, size: 1216, elements: !1082)
!1082 = !{!1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1081, file: !171, line: 2985, baseType: !1073, size: 960)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1081, file: !171, line: 2986, baseType: !907, size: 64, offset: 960)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1081, file: !171, line: 2987, baseType: !907, size: 64, offset: 1024)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1081, file: !171, line: 2988, baseType: !907, size: 64, offset: 1088)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1081, file: !171, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1081, file: !171, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1081, file: !171, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1081, file: !171, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1081, file: !171, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1081, file: !171, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1081, file: !171, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1081, file: !171, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1081, file: !171, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1081, file: !171, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1081, file: !171, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1081, file: !171, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1081, file: !171, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1081, file: !171, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1078, file: !171, line: 3117, baseType: !907, size: 64, offset: 1216)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1078, file: !171, line: 3119, baseType: !907, size: 64, offset: 1280)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1078, file: !171, line: 3121, baseType: !907, size: 64, offset: 1344)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1078, file: !171, line: 3123, baseType: !907, size: 64, offset: 1408)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !909, file: !171, line: 3385, baseType: !1106, size: 1088)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !171, line: 2874, size: 1088, elements: !1107)
!1107 = !{!1108, !1109, !1110}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1106, file: !171, line: 2875, baseType: !1073, size: 960)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1106, file: !171, line: 2876, baseType: !820, size: 64, offset: 960)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1106, file: !171, line: 2877, baseType: !1111, size: 64, offset: 1024)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64)
!1112 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !171, line: 2856, flags: DIFlagFwdDecl)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !909, file: !171, line: 3386, baseType: !1081, size: 1216)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !909, file: !171, line: 3387, baseType: !1115, size: 1280)
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !171, line: 3093, size: 1280, elements: !1116)
!1116 = !{!1117, !1118}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1115, file: !171, line: 3094, baseType: !1081, size: 1216)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1115, file: !171, line: 3095, baseType: !1111, size: 64, offset: 1216)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !909, file: !171, line: 3388, baseType: !1120, size: 1216)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !171, line: 2824, size: 1216, elements: !1121)
!1121 = !{!1122, !1123, !1124, !1125, !1126, !1127}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1120, file: !171, line: 2825, baseType: !1035, size: 896)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1120, file: !171, line: 2827, baseType: !907, size: 64, offset: 896)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1120, file: !171, line: 2828, baseType: !907, size: 64, offset: 960)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1120, file: !171, line: 2829, baseType: !907, size: 64, offset: 1024)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1120, file: !171, line: 2830, baseType: !907, size: 64, offset: 1088)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1120, file: !171, line: 2831, baseType: !907, size: 64, offset: 1152)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !909, file: !171, line: 3389, baseType: !1129, size: 1024)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !171, line: 2850, size: 1024, elements: !1130)
!1130 = !{!1131, !1132, !1133}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1129, file: !171, line: 2851, baseType: !1073, size: 960)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1129, file: !171, line: 2852, baseType: !734, size: 32, offset: 960)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1129, file: !171, line: 2853, baseType: !734, size: 32, offset: 992)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !909, file: !171, line: 3390, baseType: !1135, size: 1024)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !171, line: 2857, size: 1024, elements: !1136)
!1136 = !{!1137, !1138}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1135, file: !171, line: 2858, baseType: !1073, size: 960)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1135, file: !171, line: 2859, baseType: !1111, size: 64, offset: 960)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !909, file: !171, line: 3391, baseType: !1140, size: 960)
!1140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !171, line: 2862, size: 960, elements: !1141)
!1141 = !{!1142}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1140, file: !171, line: 2863, baseType: !1073, size: 960)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !909, file: !171, line: 3392, baseType: !1144, size: 1472)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !171, line: 3304, size: 1472, elements: !1145)
!1145 = !{!1146}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1144, file: !171, line: 3305, baseType: !1078, size: 1472)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !909, file: !171, line: 3393, baseType: !1148, size: 1792)
!1148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !171, line: 3248, size: 1792, elements: !1149)
!1149 = !{!1150, !1151, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1148, file: !171, line: 3249, baseType: !1078, size: 1472)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1148, file: !171, line: 3251, baseType: !1152, size: 64, offset: 1472)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1154, line: 463, size: 1152, elements: !1155)
!1154 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1155 = !{!1156, !1318, !1478, !1479, !1482, !1490, !1491, !1492, !1493, !1494, !1495, !1519, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1153, file: !1154, line: 464, baseType: !1157, size: 64)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !135, line: 194, size: 384, elements: !1159)
!1159 = !{!1160, !1209, !1222, !1236, !1286, !1299}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !1158, file: !135, line: 197, baseType: !1161, size: 64)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !135, line: 182, baseType: !1162)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !135, line: 116, size: 704, elements: !1164)
!1164 = !{!1165, !1166, !1167, !1168, !1169, !1170, !1197, !1206, !1207, !1208}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !1163, file: !135, line: 119, baseType: !1162, size: 64)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1163, file: !135, line: 122, baseType: !1162, size: 64, offset: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !1163, file: !135, line: 123, baseType: !1162, size: 64, offset: 128)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1163, file: !135, line: 126, baseType: !734, size: 32, offset: 192)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1163, file: !135, line: 129, baseType: !134, size: 32, offset: 224)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1163, file: !135, line: 165, baseType: !1171, size: 192, offset: 256)
!1171 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !135, line: 132, size: 192, elements: !1172)
!1172 = !{!1173, !1186, !1192}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !1171, file: !135, line: 137, baseType: !1174, size: 128)
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !135, line: 133, size: 128, elements: !1175)
!1175 = !{!1176, !1185}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !1174, file: !135, line: 135, baseType: !1177, size: 64)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64)
!1178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !135, line: 93, size: 320, elements: !1179)
!1179 = !{!1180, !1181, !1182, !1183, !1184}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !1178, file: !135, line: 96, baseType: !1177, size: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !1178, file: !135, line: 97, baseType: !1177, size: 64, offset: 64)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1178, file: !135, line: 101, baseType: !907, size: 64, offset: 128)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !1178, file: !135, line: 106, baseType: !907, size: 64, offset: 192)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1178, file: !135, line: 111, baseType: !907, size: 64, offset: 256)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !1174, file: !135, line: 136, baseType: !1177, size: 64, offset: 64)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !1171, file: !135, line: 151, baseType: !1187, size: 192)
!1187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !135, line: 139, size: 192, elements: !1188)
!1188 = !{!1189, !1190, !1191}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1187, file: !135, line: 141, baseType: !907, size: 64)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1187, file: !135, line: 145, baseType: !907, size: 64, offset: 64)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1187, file: !135, line: 150, baseType: !734, size: 32, offset: 128)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !1171, file: !135, line: 164, baseType: !1193, size: 128)
!1193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !135, line: 153, size: 128, elements: !1194)
!1194 = !{!1195, !1196}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !1193, file: !135, line: 161, baseType: !907, size: 64)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !1193, file: !135, line: 163, baseType: !1027, size: 32, offset: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !1163, file: !135, line: 168, baseType: !1198, size: 64, offset: 448)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !135, line: 67, size: 320, elements: !1200)
!1200 = !{!1201, !1202, !1203, !1204, !1205}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !1199, file: !135, line: 70, baseType: !1198, size: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1199, file: !135, line: 73, baseType: !1162, size: 64, offset: 64)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !1199, file: !135, line: 78, baseType: !907, size: 64, offset: 128)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !1199, file: !135, line: 85, baseType: !820, size: 64, offset: 192)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1199, file: !135, line: 88, baseType: !734, size: 32, offset: 256)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !1163, file: !135, line: 173, baseType: !820, size: 64, offset: 512)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !1163, file: !135, line: 173, baseType: !820, size: 64, offset: 576)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !1163, file: !135, line: 177, baseType: !1019, size: 8, offset: 640)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !1158, file: !135, line: 200, baseType: !1210, size: 64, offset: 64)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !135, line: 185, baseType: !1212)
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !135, line: 185, size: 128, elements: !1213)
!1213 = !{!1214}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1212, file: !135, line: 185, baseType: !1215, size: 128)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !135, line: 184, baseType: !1216)
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !135, line: 184, size: 128, elements: !1217)
!1217 = !{!1218, !1219, !1220}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1216, file: !135, line: 184, baseType: !7, size: 32)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1216, file: !135, line: 184, baseType: !7, size: 32, offset: 32)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1216, file: !135, line: 184, baseType: !1221, size: 64, offset: 64)
!1221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1161, size: 64, elements: !765)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !1158, file: !135, line: 203, baseType: !1223, size: 64, offset: 128)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, baseType: !1225)
!1225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, size: 128, elements: !1226)
!1226 = !{!1227}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1225, file: !135, line: 189, baseType: !1228, size: 128)
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !135, line: 188, baseType: !1229)
!1229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !135, line: 188, size: 128, elements: !1230)
!1230 = !{!1231, !1232, !1233}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1229, file: !135, line: 188, baseType: !7, size: 32)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1229, file: !135, line: 188, baseType: !7, size: 32, offset: 32)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1229, file: !135, line: 188, baseType: !1234, size: 64, offset: 64)
!1234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1235, size: 64, elements: !765)
!1235 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !135, line: 180, baseType: !1198)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !1158, file: !135, line: 207, baseType: !1237, size: 64, offset: 192)
!1237 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1238, line: 144, baseType: !1239)
!1238 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64)
!1240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1238, line: 100, size: 896, elements: !1241)
!1241 = !{!1242, !1250, !1255, !1260, !1262, !1263, !1264, !1265, !1266, !1267, !1272, !1274, !1275, !1280, !1285}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1240, file: !1238, line: 102, baseType: !1243, size: 64)
!1243 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1238, line: 52, baseType: !1244)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64)
!1245 = !DISubroutineType(types: !1246)
!1246 = !{!1247, !1248}
!1247 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1238, line: 47, baseType: !7)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64)
!1249 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1240, file: !1238, line: 105, baseType: !1251, size: 64, offset: 64)
!1251 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1238, line: 59, baseType: !1252)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64)
!1253 = !DISubroutineType(types: !1254)
!1254 = !{!734, !1248, !1248}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1240, file: !1238, line: 108, baseType: !1256, size: 64, offset: 128)
!1256 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1238, line: 63, baseType: !1257)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64)
!1258 = !DISubroutineType(types: !1259)
!1259 = !{null, !780}
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1240, file: !1238, line: 111, baseType: !1261, size: 64, offset: 192)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1240, file: !1238, line: 114, baseType: !782, size: 64, offset: 256)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1240, file: !1238, line: 117, baseType: !782, size: 64, offset: 320)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1240, file: !1238, line: 120, baseType: !782, size: 64, offset: 384)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1240, file: !1238, line: 124, baseType: !7, size: 32, offset: 448)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1240, file: !1238, line: 128, baseType: !7, size: 32, offset: 480)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1240, file: !1238, line: 131, baseType: !1268, size: 64, offset: 512)
!1268 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1238, line: 75, baseType: !1269)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64)
!1270 = !DISubroutineType(types: !1271)
!1271 = !{!780, !782, !782}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1240, file: !1238, line: 132, baseType: !1273, size: 64, offset: 576)
!1273 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1238, line: 78, baseType: !1257)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1240, file: !1238, line: 135, baseType: !780, size: 64, offset: 640)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1240, file: !1238, line: 136, baseType: !1276, size: 64, offset: 704)
!1276 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1238, line: 82, baseType: !1277)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64)
!1278 = !DISubroutineType(types: !1279)
!1279 = !{!780, !780, !782, !782}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1240, file: !1238, line: 137, baseType: !1281, size: 64, offset: 768)
!1281 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1238, line: 83, baseType: !1282)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64)
!1283 = !DISubroutineType(types: !1284)
!1284 = !{null, !780, !780}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1240, file: !1238, line: 141, baseType: !7, size: 32, offset: 832)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !1158, file: !135, line: 211, baseType: !1287, size: 64, offset: 256)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64)
!1288 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !171, line: 183, baseType: !1289)
!1289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !171, line: 183, size: 128, elements: !1290)
!1290 = !{!1291}
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1289, file: !171, line: 183, baseType: !1292, size: 128)
!1292 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !171, line: 182, baseType: !1293)
!1293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !171, line: 182, size: 128, elements: !1294)
!1294 = !{!1295, !1296, !1297}
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1293, file: !171, line: 182, baseType: !7, size: 32)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1293, file: !171, line: 182, baseType: !7, size: 32, offset: 32)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1293, file: !171, line: 182, baseType: !1298, size: 64, offset: 64)
!1298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !907, size: 64, elements: !765)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !1158, file: !135, line: 220, baseType: !1300, size: 64, offset: 320)
!1300 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !135, line: 217, size: 64, elements: !1301)
!1301 = !{!1302, !1303}
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !1300, file: !135, line: 218, baseType: !1287, size: 64)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !1300, file: !135, line: 219, baseType: !1304, size: 64)
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64)
!1305 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !1306, line: 29, baseType: !1307)
!1306 = !DIFile(filename: "./vecprim.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !1306, line: 29, size: 96, elements: !1308)
!1308 = !{!1309}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1307, file: !1306, line: 29, baseType: !1310, size: 96)
!1310 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !1306, line: 27, baseType: !1311)
!1311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !1306, line: 27, size: 96, elements: !1312)
!1312 = !{!1313, !1314, !1315}
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1311, file: !1306, line: 27, baseType: !7, size: 32)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1311, file: !1306, line: 27, baseType: !7, size: 32, offset: 32)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1311, file: !1306, line: 27, baseType: !1316, size: 8, offset: 64)
!1316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1317, size: 8, elements: !765)
!1317 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !1306, line: 26, baseType: !1019)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1153, file: !1154, line: 467, baseType: !1319, size: 64, offset: 64)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64)
!1320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !155, line: 374, size: 640, elements: !1321)
!1321 = !{!1322, !1453, !1454, !1467, !1468, !1469, !1470, !1471, !1472, !1474, !1476, !1477}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1320, file: !155, line: 377, baseType: !1323, size: 64)
!1323 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !791, line: 111, baseType: !1324)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64)
!1325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !155, line: 217, size: 832, elements: !1326)
!1326 = !{!1327, !1362, !1363, !1364, !1423, !1427, !1428, !1429, !1447, !1448, !1449, !1450, !1451, !1452}
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1325, file: !155, line: 219, baseType: !1328, size: 64)
!1328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1329, size: 64)
!1329 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !155, line: 151, baseType: !1330)
!1330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !155, line: 151, size: 128, elements: !1331)
!1331 = !{!1332}
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1330, file: !155, line: 151, baseType: !1333, size: 128)
!1333 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !155, line: 150, baseType: !1334)
!1334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !155, line: 150, size: 128, elements: !1335)
!1335 = !{!1336, !1337, !1338}
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1334, file: !155, line: 150, baseType: !7, size: 32)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1334, file: !155, line: 150, baseType: !7, size: 32, offset: 32)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1334, file: !155, line: 150, baseType: !1339, size: 64, offset: 64)
!1339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1340, size: 64, elements: !765)
!1340 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !791, line: 108, baseType: !1341)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64)
!1342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !155, line: 122, size: 512, elements: !1343)
!1343 = !{!1344, !1345, !1346, !1354, !1355, !1356, !1357, !1358, !1359, !1360}
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1342, file: !155, line: 124, baseType: !1324, size: 64)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1342, file: !155, line: 125, baseType: !1324, size: 64, offset: 64)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1342, file: !155, line: 131, baseType: !1347, size: 64, offset: 128)
!1347 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !155, line: 128, size: 64, elements: !1348)
!1348 = !{!1349, !1353}
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1347, file: !155, line: 129, baseType: !1350, size: 64)
!1350 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !791, line: 66, baseType: !1351)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64)
!1352 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !791, line: 65, flags: DIFlagFwdDecl)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1347, file: !155, line: 130, baseType: !820, size: 64)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1342, file: !155, line: 134, baseType: !780, size: 64, offset: 192)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1342, file: !155, line: 137, baseType: !907, size: 64, offset: 256)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1342, file: !155, line: 138, baseType: !1027, size: 32, offset: 320)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1342, file: !155, line: 142, baseType: !7, size: 32, offset: 352)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1342, file: !155, line: 144, baseType: !734, size: 32, offset: 384)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1342, file: !155, line: 145, baseType: !734, size: 32, offset: 416)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1342, file: !155, line: 146, baseType: !1361, size: 64, offset: 448)
!1361 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !155, line: 119, baseType: !758)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1325, file: !155, line: 220, baseType: !1328, size: 64, offset: 64)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1325, file: !155, line: 223, baseType: !780, size: 64, offset: 128)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1325, file: !155, line: 226, baseType: !1365, size: 64, offset: 192)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64)
!1366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !142, line: 100, size: 1216, elements: !1367)
!1367 = !{!1368, !1369, !1370, !1371, !1372, !1377, !1378, !1379, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1413, !1421, !1422}
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1366, file: !142, line: 102, baseType: !734, size: 32)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1366, file: !142, line: 105, baseType: !7, size: 32, offset: 32)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1366, file: !142, line: 108, baseType: !1324, size: 64, offset: 64)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1366, file: !142, line: 111, baseType: !1324, size: 64, offset: 128)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1366, file: !142, line: 114, baseType: !1373, size: 64, offset: 192)
!1373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !142, line: 41, size: 64, elements: !1374)
!1374 = !{!1375, !1376}
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1373, file: !142, line: 42, baseType: !141, size: 32)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1373, file: !142, line: 43, baseType: !7, size: 32, offset: 32)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1366, file: !142, line: 117, baseType: !7, size: 32, offset: 256)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1366, file: !142, line: 120, baseType: !7, size: 32, offset: 288)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1366, file: !142, line: 123, baseType: !1380, size: 64, offset: 320)
!1380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1381, size: 64)
!1381 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !142, line: 87, baseType: !1382)
!1382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !142, line: 87, size: 128, elements: !1383)
!1383 = !{!1384}
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1382, file: !142, line: 87, baseType: !1385, size: 128)
!1385 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !142, line: 85, baseType: !1386)
!1386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !142, line: 85, size: 128, elements: !1387)
!1387 = !{!1388, !1389, !1390}
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1386, file: !142, line: 85, baseType: !7, size: 32)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1386, file: !142, line: 85, baseType: !7, size: 32, offset: 32)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1386, file: !142, line: 85, baseType: !1391, size: 64, offset: 64)
!1391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1392, size: 64, elements: !765)
!1392 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !142, line: 84, baseType: !1365)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1366, file: !142, line: 126, baseType: !1365, size: 64, offset: 384)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1366, file: !142, line: 129, baseType: !1365, size: 64, offset: 448)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1366, file: !142, line: 132, baseType: !780, size: 64, offset: 512)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1366, file: !142, line: 139, baseType: !907, size: 64, offset: 576)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1366, file: !142, line: 143, baseType: !955, size: 128, offset: 640)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1366, file: !142, line: 146, baseType: !955, size: 128, offset: 768)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1366, file: !142, line: 148, baseType: !1019, size: 8, offset: 896)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1366, file: !142, line: 149, baseType: !1019, size: 8, offset: 904)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1366, file: !142, line: 153, baseType: !150, size: 32, offset: 928)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1366, file: !142, line: 156, baseType: !1403, size: 64, offset: 960)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64)
!1404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !142, line: 48, size: 320, elements: !1405)
!1405 = !{!1406, !1410, !1411, !1412}
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1404, file: !142, line: 50, baseType: !1407, size: 64)
!1407 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !791, line: 58, baseType: !1408)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64)
!1409 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !791, line: 57, flags: DIFlagFwdDecl)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1404, file: !142, line: 59, baseType: !955, size: 128, offset: 64)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1404, file: !142, line: 64, baseType: !1019, size: 8, offset: 192)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1404, file: !142, line: 67, baseType: !1403, size: 64, offset: 256)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1366, file: !142, line: 159, baseType: !1414, size: 64, offset: 1024)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64)
!1415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !142, line: 72, size: 256, elements: !1416)
!1416 = !{!1417, !1418, !1419, !1420}
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1415, file: !142, line: 74, baseType: !1341, size: 64)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1415, file: !142, line: 77, baseType: !1414, size: 64, offset: 64)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1415, file: !142, line: 78, baseType: !1414, size: 64, offset: 128)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1415, file: !142, line: 81, baseType: !1414, size: 64, offset: 192)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1366, file: !142, line: 162, baseType: !1019, size: 8, offset: 1088)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1366, file: !142, line: 166, baseType: !907, size: 64, offset: 1152)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1325, file: !155, line: 229, baseType: !1424, size: 128, offset: 256)
!1424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1425, size: 128, elements: !863)
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1426, size: 64)
!1426 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !155, line: 229, flags: DIFlagFwdDecl)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1325, file: !155, line: 232, baseType: !1324, size: 64, offset: 384)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1325, file: !155, line: 233, baseType: !1324, size: 64, offset: 448)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1325, file: !155, line: 238, baseType: !1430, size: 64, offset: 512)
!1430 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !155, line: 235, size: 64, elements: !1431)
!1431 = !{!1432, !1438}
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1430, file: !155, line: 236, baseType: !1433, size: 64)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64)
!1434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !155, line: 273, size: 128, elements: !1435)
!1435 = !{!1436, !1437}
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1434, file: !155, line: 275, baseType: !1350, size: 64)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1434, file: !155, line: 278, baseType: !1350, size: 64, offset: 64)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1430, file: !155, line: 237, baseType: !1439, size: 64)
!1439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1440, size: 64)
!1440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !155, line: 259, size: 320, elements: !1441)
!1441 = !{!1442, !1443, !1444, !1445, !1446}
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1440, file: !155, line: 261, baseType: !820, size: 64)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1440, file: !155, line: 262, baseType: !820, size: 64, offset: 64)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1440, file: !155, line: 266, baseType: !820, size: 64, offset: 128)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1440, file: !155, line: 267, baseType: !820, size: 64, offset: 192)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1440, file: !155, line: 270, baseType: !734, size: 32, offset: 256)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1325, file: !155, line: 241, baseType: !1361, size: 64, offset: 576)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1325, file: !155, line: 244, baseType: !734, size: 32, offset: 640)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1325, file: !155, line: 247, baseType: !734, size: 32, offset: 672)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1325, file: !155, line: 250, baseType: !734, size: 32, offset: 704)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1325, file: !155, line: 253, baseType: !734, size: 32, offset: 736)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1325, file: !155, line: 256, baseType: !734, size: 32, offset: 768)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1320, file: !155, line: 378, baseType: !1323, size: 64, offset: 64)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1320, file: !155, line: 381, baseType: !1455, size: 64, offset: 128)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1456, size: 64)
!1456 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !155, line: 282, baseType: !1457)
!1457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !155, line: 282, size: 128, elements: !1458)
!1458 = !{!1459}
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1457, file: !155, line: 282, baseType: !1460, size: 128)
!1460 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !155, line: 281, baseType: !1461)
!1461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !155, line: 281, size: 128, elements: !1462)
!1462 = !{!1463, !1464, !1465}
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1461, file: !155, line: 281, baseType: !7, size: 32)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1461, file: !155, line: 281, baseType: !7, size: 32, offset: 32)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1461, file: !155, line: 281, baseType: !1466, size: 64, offset: 64)
!1466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1323, size: 64, elements: !765)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1320, file: !155, line: 384, baseType: !734, size: 32, offset: 192)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1320, file: !155, line: 387, baseType: !734, size: 32, offset: 224)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1320, file: !155, line: 390, baseType: !734, size: 32, offset: 256)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1320, file: !155, line: 394, baseType: !1455, size: 64, offset: 320)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1320, file: !155, line: 396, baseType: !154, size: 32, offset: 384)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1320, file: !155, line: 399, baseType: !1473, size: 64, offset: 416)
!1473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 64, elements: !863)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1320, file: !155, line: 402, baseType: !1475, size: 64, offset: 480)
!1475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !863)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1320, file: !155, line: 406, baseType: !734, size: 32, offset: 544)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1320, file: !155, line: 409, baseType: !734, size: 32, offset: 576)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1153, file: !1154, line: 470, baseType: !1351, size: 64, offset: 128)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1153, file: !1154, line: 473, baseType: !1480, size: 64, offset: 192)
!1480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1481, size: 64)
!1481 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1154, line: 166, flags: DIFlagFwdDecl)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1153, file: !1154, line: 476, baseType: !1483, size: 64, offset: 256)
!1483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1484, size: 64)
!1484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !142, line: 187, size: 256, elements: !1485)
!1485 = !{!1486, !1487, !1488, !1489}
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1484, file: !142, line: 189, baseType: !734, size: 32)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !1484, file: !142, line: 192, baseType: !1380, size: 64, offset: 64)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1484, file: !142, line: 197, baseType: !1237, size: 64, offset: 128)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !1484, file: !142, line: 200, baseType: !1365, size: 64, offset: 192)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1153, file: !1154, line: 479, baseType: !1237, size: 64, offset: 320)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1153, file: !1154, line: 484, baseType: !907, size: 64, offset: 384)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1153, file: !1154, line: 488, baseType: !907, size: 64, offset: 448)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1153, file: !1154, line: 493, baseType: !907, size: 64, offset: 512)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1153, file: !1154, line: 496, baseType: !907, size: 64, offset: 576)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1153, file: !1154, line: 501, baseType: !1496, size: 64, offset: 640)
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64)
!1497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !166, line: 2355, size: 576, elements: !1498)
!1498 = !{!1499, !1502, !1503, !1504, !1505, !1507, !1508, !1513, !1514, !1515, !1516, !1517, !1518}
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1497, file: !166, line: 2356, baseType: !1500, size: 64)
!1500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1501, size: 64)
!1501 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !166, line: 2356, flags: DIFlagFwdDecl)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1497, file: !166, line: 2357, baseType: !817, size: 64, offset: 64)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1497, file: !166, line: 2358, baseType: !734, size: 32, offset: 128)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1497, file: !166, line: 2359, baseType: !734, size: 32, offset: 160)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1497, file: !166, line: 2360, baseType: !1506, size: 128, offset: 192)
!1506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !734, size: 128, elements: !887)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1497, file: !166, line: 2364, baseType: !734, size: 32, offset: 320)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1497, file: !166, line: 2367, baseType: !1509, size: 128, offset: 384)
!1509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !166, line: 2349, size: 128, elements: !1510)
!1510 = !{!1511, !1512}
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1509, file: !166, line: 2351, baseType: !820, size: 64)
