; ModuleID = 'cgraph.bc'
source_filename = "cgraph.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.cgraph_edge_hook_list = type { void (%struct.cgraph_edge*, i8*)*, i8*, %struct.cgraph_edge_hook_list* }
%struct.cgraph_edge = type { i64, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_edge*, %struct.cgraph_edge*, %struct.cgraph_edge*, %struct.cgraph_edge*, %union.gimple_statement_d*, i8*, i32, i32, i32, i32, i16, i8 }
%struct.cgraph_node = type { %union.tree_node*, %struct.cgraph_edge*, %struct.cgraph_edge*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.htab*, i8*, %struct.VEC_ipa_opt_pass_heap*, %struct.cgraph_local_info, %struct.cgraph_global_info, %struct.cgraph_rtl_info, %struct.cgraph_clone_info, %struct.cgraph_thunk_info, i64, i32, i32, i32, i16 }
%union.tree_node = type { %struct.tree_function_decl }

!762 = !DIEnumerator(name: "GIMPLE_EH_FILTER", value: 12, isUnsigned: true)
!763 = !DIEnumerator(name: "GIMPLE_EH_MUST_NOT_THROW", value: 13, isUnsigned: true)
!764 = !DIEnumerator(name: "GIMPLE_RESX", value: 14, isUnsigned: true)
!765 = !DIEnumerator(name: "GIMPLE_EH_DISPATCH", value: 15, isUnsigned: true)
!766 = !DIEnumerator(name: "GIMPLE_PHI", value: 16, isUnsigned: true)
!767 = !DIEnumerator(name: "GIMPLE_TRY", value: 17, isUnsigned: true)
!768 = !DIEnumerator(name: "GIMPLE_NOP", value: 18, isUnsigned: true)
!769 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!770 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!771 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!772 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!773 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!774 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!775 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!776 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!777 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!778 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!779 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!780 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!781 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!782 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!783 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!784 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!785 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!786 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !748, line: 727, baseType: !7, size: 32, elements: !787)
!787 = !{!788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811}
!788 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!789 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!790 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!791 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!792 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!793 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!794 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!795 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!796 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!797 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!798 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!799 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!800 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!801 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!802 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!803 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!804 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!805 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!806 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!807 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!808 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!809 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!810 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!811 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!812 = !{!813, !814, !815, !816, !819, !820, !822, !2485, !2495, !2505, !142, !2515, !837, !830, !7, !835, !2516, !841, !2517, !834, !604, !2523, !1679, !2525, !2528, !1164, !2530, !1198, !817, !2532, !895}
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!815 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !818)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cgraph_edge_hook_list", file: !3, line: 144, size: 192, elements: !824)
!824 = !{!825, !2483, !2484}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "hook", scope: !823, file: !3, line: 145, baseType: !826, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "cgraph_edge_hook", file: !6, line: 513, baseType: !827)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DISubroutineType(types: !829)
!829 = !{null, !830, !819}
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cgraph_edge", file: !6, line: 314, size: 768, elements: !832)
!832 = !{!833, !836, !2466, !2467, !2468, !2469, !2470, !2471, !2472, !2473, !2475, !2476, !2477, !2478, !2480, !2481, !2482}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !831, file: !6, line: 316, baseType: !834, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !345, line: 119, baseType: !835)
!835 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "caller", scope: !831, file: !6, line: 317, baseType: !837, size: 64, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cgraph_node", file: !6, line: 181, size: 2496, elements: !839)
!839 = !{!840, !2263, !2264, !2265, !2266, !2267, !2268, !2269, !2270, !2271, !2272, !2273, !2274, !2275, !2276, !2277, !2278, !2279, !2381, !2403, !2413, !2417, !2443, !2452, !2453, !2454, !2455, !2456, !2457, !2458, !2459, !2460, !2461, !2462, !2463, !2464, !2465}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !838, file: !6, line: 182, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !842, line: 56, baseType: !843)
!842 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !143, line: 3371, size: 1792, elements: !845)
!845 = !{!846, !879, !885, !897, !916, !927, !932, !941, !947, !960, !972, !1010, !1500, !1528, !1545, !1546, !1551, !1560, !1566, !1571, !1575, !1579, !1914, !1961, !1967, !1973, !1980, !1993, !2007, !2024, !2036, !2058, !2073, !2245}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !844, file: !143, line: 3372, baseType: !847, size: 64)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !143, line: 360, size: 64, elements: !848)
!848 = !{!849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !847, file: !143, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !847, file: !143, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !847, file: !143, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !847, file: !143, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !847, file: !143, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !847, file: !143, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !847, file: !143, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !847, file: !143, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !847, file: !143, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !847, file: !143, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !847, file: !143, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !847, file: !143, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !847, file: !143, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !847, file: !143, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !847, file: !143, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !847, file: !143, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !847, file: !143, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !847, file: !143, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !847, file: !143, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !847, file: !143, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !847, file: !143, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !847, file: !143, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !847, file: !143, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !847, file: !143, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !847, file: !143, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !847, file: !143, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !847, file: !143, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !847, file: !143, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !847, file: !143, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !847, file: !143, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !844, file: !143, line: 3373, baseType: !880, size: 192)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !143, line: 402, size: 192, elements: !881)
!881 = !{!882, !883, !884}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !880, file: !143, line: 403, baseType: !847, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !880, file: !143, line: 404, baseType: !841, size: 64, offset: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !880, file: !143, line: 405, baseType: !841, size: 64, offset: 128)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !844, file: !143, line: 3374, baseType: !886, size: 320)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !143, line: 1384, size: 320, elements: !887)
!887 = !{!888, !889}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !886, file: !143, line: 1385, baseType: !880, size: 192)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !886, file: !143, line: 1386, baseType: !890, size: 128, offset: 192)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !891, line: 58, baseType: !892)
!891 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !891, line: 54, size: 128, elements: !893)
!893 = !{!894, !896}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !892, file: !891, line: 56, baseType: !895, size: 64)
!895 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !892, file: !891, line: 57, baseType: !835, size: 64, offset: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !844, file: !143, line: 3375, baseType: !898, size: 256)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !143, line: 1397, size: 256, elements: !899)
!899 = !{!900, !901}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !898, file: !143, line: 1398, baseType: !880, size: 192)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !898, file: !143, line: 1399, baseType: !902, size: 64, offset: 192)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !904, line: 52, size: 256, elements: !905)
!904 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!905 = !{!906, !907, !908, !909, !910, !911, !912}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !903, file: !904, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !903, file: !904, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !903, file: !904, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !903, file: !904, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !903, file: !904, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !903, file: !904, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !903, file: !904, line: 62, baseType: !913, size: 192, offset: 64)
!913 = !DICompositeType(tag: DW_TAG_array_type, baseType: !895, size: 192, elements: !914)
!914 = !{!915}
!915 = !DISubrange(count: 3)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !844, file: !143, line: 3376, baseType: !917, size: 256)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !143, line: 1408, size: 256, elements: !918)
!918 = !{!919, !920}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !917, file: !143, line: 1409, baseType: !880, size: 192)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !917, file: !143, line: 1410, baseType: !921, size: 64, offset: 192)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !923, line: 27, size: 192, elements: !924)
!923 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!924 = !{!925, !926}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !922, file: !923, line: 29, baseType: !890, size: 128)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !922, file: !923, line: 30, baseType: !14, size: 32, offset: 128)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !844, file: !143, line: 3377, baseType: !928, size: 256)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !143, line: 1437, size: 256, elements: !929)
!929 = !{!930, !931}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !928, file: !143, line: 1438, baseType: !880, size: 192)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !928, file: !143, line: 1439, baseType: !841, size: 64, offset: 192)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !844, file: !143, line: 3378, baseType: !933, size: 256)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !143, line: 1418, size: 256, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !933, file: !143, line: 1419, baseType: !880, size: 192)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !933, file: !143, line: 1420, baseType: !815, size: 32, offset: 192)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !933, file: !143, line: 1421, baseType: !938, size: 8, offset: 224)
!938 = !DICompositeType(tag: DW_TAG_array_type, baseType: !818, size: 8, elements: !939)
!939 = !{!940}
!940 = !DISubrange(count: 1)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !844, file: !143, line: 3379, baseType: !942, size: 320)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !143, line: 1428, size: 320, elements: !943)
!943 = !{!944, !945, !946}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !942, file: !143, line: 1429, baseType: !880, size: 192)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !942, file: !143, line: 1430, baseType: !841, size: 64, offset: 192)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !942, file: !143, line: 1431, baseType: !841, size: 64, offset: 256)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !844, file: !143, line: 3380, baseType: !948, size: 320)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !143, line: 1460, size: 320, elements: !949)
!949 = !{!950, !951}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !948, file: !143, line: 1461, baseType: !880, size: 192)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !948, file: !143, line: 1462, baseType: !952, size: 128, offset: 192)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !953, line: 31, size: 128, elements: !954)
!953 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!954 = !{!955, !958, !959}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !952, file: !953, line: 32, baseType: !956, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !814)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !952, file: !953, line: 33, baseType: !7, size: 32, offset: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !952, file: !953, line: 34, baseType: !7, size: 32, offset: 96)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !844, file: !143, line: 3381, baseType: !961, size: 384)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !143, line: 2507, size: 384, elements: !962)
!962 = !{!963, !964, !969, !970, !971}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !961, file: !143, line: 2508, baseType: !880, size: 192)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !961, file: !143, line: 2509, baseType: !965, size: 32, offset: 192)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !966, line: 58, baseType: !967)
!966 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !968, line: 44, baseType: !7)
!968 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!969 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !961, file: !143, line: 2510, baseType: !7, size: 32, offset: 224)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !961, file: !143, line: 2511, baseType: !841, size: 64, offset: 256)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !961, file: !143, line: 2512, baseType: !841, size: 64, offset: 320)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !844, file: !143, line: 3382, baseType: !973, size: 896)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !143, line: 2652, size: 896, elements: !974)
!974 = !{!975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !973, file: !143, line: 2653, baseType: !961, size: 384)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !973, file: !143, line: 2654, baseType: !841, size: 64, offset: 384)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !973, file: !143, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !973, file: !143, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !973, file: !143, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !973, file: !143, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !973, file: !143, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !973, file: !143, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !973, file: !143, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !973, file: !143, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !973, file: !143, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !973, file: !143, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !973, file: !143, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !973, file: !143, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !973, file: !143, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !973, file: !143, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !973, file: !143, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !973, file: !143, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !973, file: !143, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !973, file: !143, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !973, file: !143, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !973, file: !143, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !973, file: !143, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !973, file: !143, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !973, file: !143, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !973, file: !143, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !973, file: !143, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !973, file: !143, line: 2703, baseType: !7, size: 32, offset: 512)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !973, file: !143, line: 2705, baseType: !841, size: 64, offset: 576)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !973, file: !143, line: 2706, baseType: !841, size: 64, offset: 640)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !973, file: !143, line: 2707, baseType: !841, size: 64, offset: 704)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !973, file: !143, line: 2708, baseType: !841, size: 64, offset: 768)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !973, file: !143, line: 2711, baseType: !1008, size: 64, offset: 832)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !143, line: 2711, flags: DIFlagFwdDecl)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !844, file: !143, line: 3383, baseType: !1011, size: 960)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !143, line: 2756, size: 960, elements: !1012)
!1012 = !{!1013, !1014}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1011, file: !143, line: 2757, baseType: !973, size: 896)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1011, file: !143, line: 2758, baseType: !1015, size: 64, offset: 896)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !842, line: 50, baseType: !1016)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !605, line: 240, size: 384, elements: !1018)
!1018 = !{!1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1017, file: !605, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1017, file: !605, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !1017, file: !605, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !1017, file: !605, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !1017, file: !605, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !1017, file: !605, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !1017, file: !605, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1017, file: !605, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !1017, file: !605, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !1017, file: !605, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1017, file: !605, line: 321, baseType: !1030, size: 320, offset: 64)
!1030 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !605, line: 315, size: 320, elements: !1031)
!1031 = !{!1032, !1433, !1435, !1498, !1499}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1030, file: !605, line: 316, baseType: !1033, size: 64)
!1033 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1034, size: 64, elements: !939)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !605, line: 183, baseType: !1035)
!1035 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !605, line: 166, size: 64, elements: !1036)
!1036 = !{!1037, !1038, !1039, !1040, !1041, !1049, !1050, !1062, !1065, !1125, !1126, !1410, !1423, !1430}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !1035, file: !605, line: 168, baseType: !815, size: 32)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !1035, file: !605, line: 169, baseType: !7, size: 32)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !1035, file: !605, line: 170, baseType: !820, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !1035, file: !605, line: 171, baseType: !1015, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !1035, file: !605, line: 172, baseType: !1042, size: 64)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !842, line: 53, baseType: !1043)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !605, line: 359, size: 128, elements: !1045)
!1045 = !{!1046, !1047}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !1044, file: !605, line: 360, baseType: !815, size: 32)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !1044, file: !605, line: 361, baseType: !1048, size: 64, offset: 64)
!1048 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1015, size: 64, elements: !939)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !1035, file: !605, line: 173, baseType: !14, size: 32)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !1035, file: !605, line: 174, baseType: !1051, size: 32)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !605, line: 133, baseType: !1052)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !605, line: 115, size: 32, elements: !1053)
!1053 = !{!1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !1052, file: !605, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !1052, file: !605, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !1052, file: !605, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !1052, file: !605, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !1052, file: !605, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !1052, file: !605, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !1052, file: !605, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1052, file: !605, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !1035, file: !605, line: 175, baseType: !1063, size: 64)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !605, line: 175, flags: DIFlagFwdDecl)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !1035, file: !605, line: 176, baseType: !1066, size: 64)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1068, line: 75, size: 256, elements: !1069)
!1068 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1069 = !{!1070, !1084, !1085, !1086}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1067, file: !1068, line: 76, baseType: !1071, size: 64)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1068, line: 68, baseType: !1073)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1068, line: 63, size: 320, elements: !1074)
!1074 = !{!1075, !1077, !1078, !1079}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1073, file: !1068, line: 64, baseType: !1076, size: 64)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1073, file: !1068, line: 65, baseType: !1076, size: 64, offset: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1073, file: !1068, line: 66, baseType: !7, size: 32, offset: 128)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1073, file: !1068, line: 67, baseType: !1080, size: 128, offset: 192)
!1080 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1081, size: 128, elements: !1082)
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1068, line: 29, baseType: !895)
!1082 = !{!1083}
!1083 = !DISubrange(count: 2)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1067, file: !1068, line: 77, baseType: !1071, size: 64, offset: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1067, file: !1068, line: 78, baseType: !7, size: 32, offset: 128)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1067, file: !1068, line: 79, baseType: !1087, size: 64, offset: 192)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1068, line: 49, baseType: !1089)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1068, line: 45, size: 832, elements: !1090)
!1090 = !{!1091, !1092, !1093}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1089, file: !1068, line: 46, baseType: !1076, size: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1089, file: !1068, line: 47, baseType: !1066, size: 64, offset: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1089, file: !1068, line: 48, baseType: !1094, size: 704, offset: 128)
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1095, line: 164, size: 704, elements: !1096)
!1095 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1096 = !{!1097, !1098, !1108, !1109, !1110, !1111, !1112, !1113, !1117, !1121, !1122, !1123, !1124}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1094, file: !1095, line: 166, baseType: !835, size: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1094, file: !1095, line: 167, baseType: !1099, size: 64, offset: 64)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64)
!1100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1095, line: 157, size: 192, elements: !1101)
!1101 = !{!1102, !1103, !1104}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1100, file: !1095, line: 159, baseType: !817, size: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1100, file: !1095, line: 160, baseType: !1099, size: 64, offset: 64)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1100, file: !1095, line: 161, baseType: !1105, size: 32, offset: 128)
!1105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !818, size: 32, elements: !1106)
!1106 = !{!1107}
!1107 = !DISubrange(count: 4)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1094, file: !1095, line: 168, baseType: !817, size: 64, offset: 128)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1094, file: !1095, line: 169, baseType: !817, size: 64, offset: 192)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1094, file: !1095, line: 170, baseType: !817, size: 64, offset: 256)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1094, file: !1095, line: 171, baseType: !835, size: 64, offset: 320)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1094, file: !1095, line: 172, baseType: !815, size: 32, offset: 384)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1094, file: !1095, line: 176, baseType: !1114, size: 64, offset: 448)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{!1099, !819, !835}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1094, file: !1095, line: 177, baseType: !1118, size: 64, offset: 512)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64)
!1119 = !DISubroutineType(types: !1120)
!1120 = !{null, !819, !1099}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1094, file: !1095, line: 178, baseType: !819, size: 64, offset: 576)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1094, file: !1095, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1094, file: !1095, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1094, file: !1095, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !1035, file: !605, line: 177, baseType: !841, size: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !1035, file: !605, line: 178, baseType: !1127, size: 64)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !345, line: 217, size: 832, elements: !1129)
!1129 = !{!1130, !1375, !1376, !1377, !1380, !1384, !1385, !1386, !1404, !1405, !1406, !1407, !1408, !1409}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1128, file: !345, line: 219, baseType: !1131, size: 64)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64)
!1132 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !345, line: 151, baseType: !1133)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !345, line: 151, size: 128, elements: !1134)
!1134 = !{!1135}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1133, file: !345, line: 151, baseType: !1136, size: 128)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !345, line: 150, baseType: !1137)
!1137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !345, line: 150, size: 128, elements: !1138)
!1138 = !{!1139, !1140, !1141}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1137, file: !345, line: 150, baseType: !7, size: 32)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1137, file: !345, line: 150, baseType: !7, size: 32, offset: 32)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1137, file: !345, line: 150, baseType: !1142, size: 64, offset: 64)
!1142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1143, size: 64, elements: !939)
!1143 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !842, line: 108, baseType: !1144)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !345, line: 122, size: 512, elements: !1146)
!1146 = !{!1147, !1148, !1149, !1368, !1369, !1370, !1371, !1372, !1373, !1374}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1145, file: !345, line: 124, baseType: !1127, size: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1145, file: !345, line: 125, baseType: !1127, size: 64, offset: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1145, file: !345, line: 131, baseType: !1150, size: 64, offset: 128)
!1150 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !345, line: 128, size: 64, elements: !1151)
!1151 = !{!1152, !1367}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1150, file: !345, line: 129, baseType: !1153, size: 64)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !842, line: 66, baseType: !1154)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64)
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !748, line: 143, size: 192, elements: !1156)
!1156 = !{!1157, !1365, !1366}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1155, file: !748, line: 145, baseType: !1158, size: 64)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !842, line: 69, baseType: !1159)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !748, line: 136, size: 192, elements: !1161)
!1161 = !{!1162, !1363, !1364}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1160, file: !748, line: 137, baseType: !1163, size: 64)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !842, line: 58, baseType: !1164)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64)
!1165 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !748, line: 737, size: 768, elements: !1166)
!1166 = !{!1167, !1184, !1218, !1224, !1229, !1234, !1241, !1247, !1253, !1258, !1272, !1277, !1283, !1288, !1298, !1303, !1321, !1328, !1335, !1341, !1346, !1352, !1358}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1165, file: !748, line: 738, baseType: !1168, size: 256)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !748, line: 271, size: 256, elements: !1169)
!1169 = !{!1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1168, file: !748, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !1168, file: !748, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1168, file: !748, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !1168, file: !748, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !1168, file: !748, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !1168, file: !748, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !1168, file: !748, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1168, file: !748, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !1168, file: !748, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1168, file: !748, line: 312, baseType: !7, size: 32, offset: 32)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !1168, file: !748, line: 316, baseType: !965, size: 32, offset: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !1168, file: !748, line: 319, baseType: !7, size: 32, offset: 96)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1168, file: !748, line: 323, baseType: !1127, size: 64, offset: 128)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1168, file: !748, line: 327, baseType: !841, size: 64, offset: 192)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !1165, file: !748, line: 739, baseType: !1185, size: 448)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !748, line: 350, size: 448, elements: !1186)
!1186 = !{!1187, !1216}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1185, file: !748, line: 353, baseType: !1188, size: 384)
!1188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !748, line: 333, size: 384, elements: !1189)
!1189 = !{!1190, !1191, !1199}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1188, file: !748, line: 336, baseType: !1168, size: 256)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !1188, file: !748, line: 343, baseType: !1192, size: 64, offset: 256)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1193, size: 64)
!1193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1194, line: 37, size: 128, elements: !1195)
!1194 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1195 = !{!1196, !1197}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1193, file: !1194, line: 39, baseType: !1192, size: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1193, file: !1194, line: 40, baseType: !1198, size: 64, offset: 64)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !1188, file: !748, line: 344, baseType: !1200, size: 64, offset: 320)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64)
!1201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1194, line: 45, size: 320, elements: !1202)
!1202 = !{!1203, !1204}
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1201, file: !1194, line: 47, baseType: !1200, size: 64)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1201, file: !1194, line: 48, baseType: !1205, size: 256, offset: 64)
!1205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !143, line: 1883, size: 256, elements: !1206)
!1206 = !{!1207, !1209, !1210, !1215}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1205, file: !143, line: 1884, baseType: !1208, size: 64)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1205, file: !143, line: 1885, baseType: !1208, size: 64, offset: 64)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1205, file: !143, line: 1891, baseType: !1211, size: 64, offset: 128)
!1211 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1205, file: !143, line: 1891, size: 64, elements: !1212)
!1212 = !{!1213, !1214}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1211, file: !143, line: 1891, baseType: !1163, size: 64)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1211, file: !143, line: 1891, baseType: !841, size: 64)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1205, file: !143, line: 1892, baseType: !1198, size: 64, offset: 192)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1185, file: !748, line: 359, baseType: !1217, size: 64, offset: 384)
!1217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !841, size: 64, elements: !939)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !1165, file: !748, line: 740, baseType: !1219, size: 512)
!1219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !748, line: 365, size: 512, elements: !1220)
!1220 = !{!1221, !1222, !1223}
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1219, file: !748, line: 368, baseType: !1188, size: 384)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1219, file: !748, line: 373, baseType: !841, size: 64, offset: 384)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1219, file: !748, line: 374, baseType: !841, size: 64, offset: 448)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !1165, file: !748, line: 741, baseType: !1225, size: 576)
!1225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !748, line: 380, size: 576, elements: !1226)
!1226 = !{!1227, !1228}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1225, file: !748, line: 383, baseType: !1219, size: 512)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1225, file: !748, line: 389, baseType: !1217, size: 64, offset: 512)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1165, file: !748, line: 742, baseType: !1230, size: 320)
!1230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !748, line: 395, size: 320, elements: !1231)
!1231 = !{!1232, !1233}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1230, file: !748, line: 397, baseType: !1168, size: 256)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1230, file: !748, line: 400, baseType: !1153, size: 64, offset: 256)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !1165, file: !748, line: 743, baseType: !1235, size: 448)
!1235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !748, line: 406, size: 448, elements: !1236)
!1236 = !{!1237, !1238, !1239, !1240}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1235, file: !748, line: 408, baseType: !1168, size: 256)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1235, file: !748, line: 412, baseType: !841, size: 64, offset: 256)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1235, file: !748, line: 420, baseType: !841, size: 64, offset: 320)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1235, file: !748, line: 423, baseType: !1153, size: 64, offset: 384)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !1165, file: !748, line: 744, baseType: !1242, size: 384)
!1242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !748, line: 429, size: 384, elements: !1243)
!1243 = !{!1244, !1245, !1246}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1242, file: !748, line: 431, baseType: !1168, size: 256)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1242, file: !748, line: 434, baseType: !841, size: 64, offset: 256)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1242, file: !748, line: 437, baseType: !1153, size: 64, offset: 320)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !1165, file: !748, line: 745, baseType: !1248, size: 384)
!1248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !748, line: 443, size: 384, elements: !1249)
!1249 = !{!1250, !1251, !1252}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1248, file: !748, line: 445, baseType: !1168, size: 256)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1248, file: !748, line: 449, baseType: !841, size: 64, offset: 256)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1248, file: !748, line: 453, baseType: !1153, size: 64, offset: 320)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !1165, file: !748, line: 746, baseType: !1254, size: 320)
!1254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !748, line: 459, size: 320, elements: !1255)
!1255 = !{!1256, !1257}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1254, file: !748, line: 461, baseType: !1168, size: 256)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1254, file: !748, line: 464, baseType: !841, size: 64, offset: 256)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !1165, file: !748, line: 747, baseType: !1259, size: 768)
!1259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !748, line: 469, size: 768, elements: !1260)
!1260 = !{!1261, !1262, !1263, !1264, !1265}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1259, file: !748, line: 471, baseType: !1168, size: 256)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1259, file: !748, line: 474, baseType: !7, size: 32, offset: 256)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1259, file: !748, line: 475, baseType: !7, size: 32, offset: 288)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1259, file: !748, line: 478, baseType: !841, size: 64, offset: 320)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1259, file: !748, line: 481, baseType: !1266, size: 384, offset: 384)
!1266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1267, size: 384, elements: !939)
!1267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !143, line: 1917, size: 384, elements: !1268)
!1268 = !{!1269, !1270, !1271}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1267, file: !143, line: 1920, baseType: !1205, size: 256)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1267, file: !143, line: 1921, baseType: !841, size: 64, offset: 256)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1267, file: !143, line: 1922, baseType: !965, size: 32, offset: 320)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !1165, file: !748, line: 748, baseType: !1273, size: 320)
!1273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !748, line: 487, size: 320, elements: !1274)
!1274 = !{!1275, !1276}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1273, file: !748, line: 490, baseType: !1168, size: 256)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1273, file: !748, line: 494, baseType: !815, size: 32, offset: 256)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !1165, file: !748, line: 749, baseType: !1278, size: 384)
!1278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !748, line: 500, size: 384, elements: !1279)
!1279 = !{!1280, !1281, !1282}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1278, file: !748, line: 502, baseType: !1168, size: 256)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1278, file: !748, line: 506, baseType: !1153, size: 64, offset: 256)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1278, file: !748, line: 510, baseType: !1153, size: 64, offset: 320)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !1165, file: !748, line: 750, baseType: !1284, size: 320)
!1284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !748, line: 529, size: 320, elements: !1285)
!1285 = !{!1286, !1287}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1284, file: !748, line: 531, baseType: !1168, size: 256)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1284, file: !748, line: 540, baseType: !1153, size: 64, offset: 256)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !1165, file: !748, line: 751, baseType: !1289, size: 704)
!1289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !748, line: 546, size: 704, elements: !1290)
!1290 = !{!1291, !1292, !1293, !1294, !1295, !1296, !1297}
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1289, file: !748, line: 549, baseType: !1219, size: 512)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1289, file: !748, line: 553, baseType: !820, size: 64, offset: 512)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1289, file: !748, line: 557, baseType: !814, size: 8, offset: 576)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1289, file: !748, line: 558, baseType: !814, size: 8, offset: 584)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1289, file: !748, line: 559, baseType: !814, size: 8, offset: 592)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1289, file: !748, line: 560, baseType: !814, size: 8, offset: 600)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1289, file: !748, line: 566, baseType: !1217, size: 64, offset: 640)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !1165, file: !748, line: 752, baseType: !1299, size: 384)
!1299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !748, line: 571, size: 384, elements: !1300)
!1300 = !{!1301, !1302}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1299, file: !748, line: 573, baseType: !1230, size: 320)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1299, file: !748, line: 577, baseType: !841, size: 64, offset: 320)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !1165, file: !748, line: 753, baseType: !1304, size: 576)
!1304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !748, line: 600, size: 576, elements: !1305)
!1305 = !{!1306, !1307, !1308, !1311, !1320}
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1304, file: !748, line: 602, baseType: !1230, size: 320)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1304, file: !748, line: 605, baseType: !841, size: 64, offset: 320)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1304, file: !748, line: 609, baseType: !1309, size: 64, offset: 384)
!1309 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1310, line: 46, baseType: !895)
!1310 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1304, file: !748, line: 612, baseType: !1312, size: 64, offset: 448)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64)
!1313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !748, line: 581, size: 320, elements: !1314)
!1314 = !{!1315, !1316, !1317, !1318, !1319}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1313, file: !748, line: 583, baseType: !142, size: 32)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1313, file: !748, line: 586, baseType: !841, size: 64, offset: 64)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1313, file: !748, line: 589, baseType: !841, size: 64, offset: 128)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1313, file: !748, line: 592, baseType: !841, size: 64, offset: 192)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1313, file: !748, line: 595, baseType: !841, size: 64, offset: 256)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1304, file: !748, line: 616, baseType: !1153, size: 64, offset: 512)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !1165, file: !748, line: 754, baseType: !1322, size: 512)
!1322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !748, line: 622, size: 512, elements: !1323)
!1323 = !{!1324, !1325, !1326, !1327}
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1322, file: !748, line: 624, baseType: !1230, size: 320)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1322, file: !748, line: 628, baseType: !841, size: 64, offset: 320)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1322, file: !748, line: 632, baseType: !841, size: 64, offset: 384)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1322, file: !748, line: 636, baseType: !841, size: 64, offset: 448)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !1165, file: !748, line: 755, baseType: !1329, size: 704)
!1329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !748, line: 642, size: 704, elements: !1330)
!1330 = !{!1331, !1332, !1333, !1334}
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1329, file: !748, line: 644, baseType: !1322, size: 512)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1329, file: !748, line: 648, baseType: !841, size: 64, offset: 512)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1329, file: !748, line: 652, baseType: !841, size: 64, offset: 576)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1329, file: !748, line: 653, baseType: !841, size: 64, offset: 640)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !1165, file: !748, line: 756, baseType: !1336, size: 448)
!1336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !748, line: 663, size: 448, elements: !1337)
!1337 = !{!1338, !1339, !1340}
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1336, file: !748, line: 665, baseType: !1230, size: 320)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1336, file: !748, line: 668, baseType: !841, size: 64, offset: 320)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1336, file: !748, line: 673, baseType: !841, size: 64, offset: 384)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !1165, file: !748, line: 757, baseType: !1342, size: 384)
!1342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !748, line: 694, size: 384, elements: !1343)
!1343 = !{!1344, !1345}
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1342, file: !748, line: 696, baseType: !1230, size: 320)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1342, file: !748, line: 699, baseType: !841, size: 64, offset: 320)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !1165, file: !748, line: 758, baseType: !1347, size: 384)
!1347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !748, line: 681, size: 384, elements: !1348)
!1348 = !{!1349, !1350, !1351}
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1347, file: !748, line: 683, baseType: !1168, size: 256)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1347, file: !748, line: 686, baseType: !841, size: 64, offset: 256)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1347, file: !748, line: 689, baseType: !841, size: 64, offset: 320)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !1165, file: !748, line: 759, baseType: !1353, size: 384)
!1353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !748, line: 707, size: 384, elements: !1354)
!1354 = !{!1355, !1356, !1357}
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1353, file: !748, line: 709, baseType: !1168, size: 256)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1353, file: !748, line: 712, baseType: !841, size: 64, offset: 256)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1353, file: !748, line: 712, baseType: !841, size: 64, offset: 320)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !1165, file: !748, line: 760, baseType: !1359, size: 320)
!1359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !748, line: 718, size: 320, elements: !1360)
!1360 = !{!1361, !1362}
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1359, file: !748, line: 720, baseType: !1168, size: 256)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1359, file: !748, line: 723, baseType: !841, size: 64, offset: 256)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1160, file: !748, line: 138, baseType: !1159, size: 64, offset: 64)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1160, file: !748, line: 139, baseType: !1159, size: 64, offset: 128)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1155, file: !748, line: 146, baseType: !1158, size: 64, offset: 64)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1155, file: !748, line: 152, baseType: !1153, size: 64, offset: 128)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1150, file: !345, line: 130, baseType: !1015, size: 64)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1145, file: !345, line: 134, baseType: !819, size: 64, offset: 192)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1145, file: !345, line: 137, baseType: !841, size: 64, offset: 256)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1145, file: !345, line: 138, baseType: !965, size: 32, offset: 320)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1145, file: !345, line: 142, baseType: !7, size: 32, offset: 352)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1145, file: !345, line: 144, baseType: !815, size: 32, offset: 384)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1145, file: !345, line: 145, baseType: !815, size: 32, offset: 416)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1145, file: !345, line: 146, baseType: !834, size: 64, offset: 448)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1128, file: !345, line: 220, baseType: !1131, size: 64, offset: 64)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1128, file: !345, line: 223, baseType: !819, size: 64, offset: 128)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1128, file: !345, line: 226, baseType: !1378, size: 64, offset: 192)
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64)
!1379 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !345, line: 185, flags: DIFlagFwdDecl)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1128, file: !345, line: 229, baseType: !1381, size: 128, offset: 256)
!1381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1382, size: 128, elements: !1082)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64)
!1383 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !345, line: 229, flags: DIFlagFwdDecl)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1128, file: !345, line: 232, baseType: !1127, size: 64, offset: 384)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1128, file: !345, line: 233, baseType: !1127, size: 64, offset: 448)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1128, file: !345, line: 238, baseType: !1387, size: 64, offset: 512)
!1387 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !345, line: 235, size: 64, elements: !1388)
!1388 = !{!1389, !1395}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1387, file: !345, line: 236, baseType: !1390, size: 64)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64)
!1391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !345, line: 273, size: 128, elements: !1392)
!1392 = !{!1393, !1394}
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1391, file: !345, line: 275, baseType: !1153, size: 64)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1391, file: !345, line: 278, baseType: !1153, size: 64, offset: 64)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1387, file: !345, line: 237, baseType: !1396, size: 64)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64)
!1397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !345, line: 259, size: 320, elements: !1398)
!1398 = !{!1399, !1400, !1401, !1402, !1403}
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1397, file: !345, line: 261, baseType: !1015, size: 64)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1397, file: !345, line: 262, baseType: !1015, size: 64, offset: 64)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1397, file: !345, line: 266, baseType: !1015, size: 64, offset: 128)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1397, file: !345, line: 267, baseType: !1015, size: 64, offset: 192)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1397, file: !345, line: 270, baseType: !815, size: 32, offset: 256)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1128, file: !345, line: 241, baseType: !834, size: 64, offset: 576)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1128, file: !345, line: 244, baseType: !815, size: 32, offset: 640)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1128, file: !345, line: 247, baseType: !815, size: 32, offset: 672)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1128, file: !345, line: 250, baseType: !815, size: 32, offset: 704)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1128, file: !345, line: 253, baseType: !815, size: 32, offset: 736)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1128, file: !345, line: 256, baseType: !815, size: 32, offset: 768)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !1035, file: !605, line: 179, baseType: !1411, size: 64)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64)
!1412 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !605, line: 150, baseType: !1413)
!1413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !605, line: 142, size: 320, elements: !1414)
!1414 = !{!1415, !1416, !1417, !1418, !1421, !1422}
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1413, file: !605, line: 144, baseType: !841, size: 64)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1413, file: !605, line: 145, baseType: !1015, size: 64, offset: 64)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1413, file: !605, line: 146, baseType: !1015, size: 64, offset: 128)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1413, file: !605, line: 147, baseType: !1419, size: 32, offset: 192)
!1419 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1420, line: 31, baseType: !815)
!1420 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1413, file: !605, line: 148, baseType: !7, size: 32, offset: 224)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1413, file: !605, line: 149, baseType: !814, size: 8, offset: 256)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !1035, file: !605, line: 180, baseType: !1424, size: 64)
!1424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1425, size: 64)
!1425 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !605, line: 162, baseType: !1426)
!1426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !605, line: 159, size: 128, elements: !1427)
!1427 = !{!1428, !1429}
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1426, file: !605, line: 160, baseType: !841, size: 64)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1426, file: !605, line: 161, baseType: !835, size: 64, offset: 64)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !1035, file: !605, line: 181, baseType: !1431, size: 64)
!1431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1432, size: 64)
!1432 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !605, line: 181, flags: DIFlagFwdDecl)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !1030, file: !605, line: 317, baseType: !1434, size: 64)
!1434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !835, size: 64, elements: !939)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !1030, file: !605, line: 318, baseType: !1436, size: 320)
!1436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !605, line: 188, size: 320, elements: !1437)
!1437 = !{!1438, !1440, !1497}
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1436, file: !605, line: 190, baseType: !1439, size: 192)
!1439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1034, size: 192, elements: !914)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1436, file: !605, line: 193, baseType: !1441, size: 64, offset: 192)
!1441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1442, size: 64)
!1442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !605, line: 206, size: 320, elements: !1443)
!1443 = !{!1444, !1482, !1483, !1484, !1496}
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1442, file: !605, line: 208, baseType: !1445, size: 64)
!1445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1446, size: 64)
!1446 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !842, line: 62, baseType: !1447)
!1447 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1448, line: 538, size: 256, elements: !1449)
!1448 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1449 = !{!1450, !1454, !1460, !1473}
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1447, file: !1448, line: 539, baseType: !1451, size: 32)
!1451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1448, line: 482, size: 32, elements: !1452)
!1452 = !{!1453}
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1451, file: !1448, line: 484, baseType: !7, size: 32)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1447, file: !1448, line: 540, baseType: !1455, size: 192)
!1455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1448, line: 488, size: 192, elements: !1456)
!1456 = !{!1457, !1458, !1459}
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1455, file: !1448, line: 489, baseType: !1451, size: 32)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1455, file: !1448, line: 492, baseType: !820, size: 64, offset: 64)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1455, file: !1448, line: 496, baseType: !841, size: 64, offset: 128)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1447, file: !1448, line: 541, baseType: !1461, size: 256)
!1461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1448, line: 504, size: 256, elements: !1462)
!1462 = !{!1463, !1464, !1471, !1472}
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1461, file: !1448, line: 505, baseType: !1451, size: 32)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1461, file: !1448, line: 509, baseType: !1465, size: 64, offset: 64)
!1465 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1448, line: 501, baseType: !1466)
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1467, size: 64)
!1467 = !DISubroutineType(types: !1468)
!1468 = !{null, !1469}
!1469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1470, size: 64)
!1470 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1461, file: !1448, line: 510, baseType: !1469, size: 64, offset: 128)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1461, file: !1448, line: 513, baseType: !1445, size: 64, offset: 192)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1447, file: !1448, line: 542, baseType: !1474, size: 128)
!1474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1448, line: 530, size: 128, elements: !1475)
!1475 = !{!1476, !1477}
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1474, file: !1448, line: 531, baseType: !1451, size: 32)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1474, file: !1448, line: 534, baseType: !1478, size: 64, offset: 64)
!1478 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1448, line: 525, baseType: !1479)
!1479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1480, size: 64)
!1480 = !DISubroutineType(types: !1481)
!1481 = !{!814, !841, !820, !895, !895}
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1442, file: !605, line: 211, baseType: !7, size: 32, offset: 64)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1442, file: !605, line: 214, baseType: !835, size: 64, offset: 128)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1442, file: !605, line: 224, baseType: !1485, size: 64, offset: 192)
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1486, size: 64)
!1486 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !605, line: 202, baseType: !1487)
!1487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !605, line: 202, size: 128, elements: !1488)
!1488 = !{!1489}
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1487, file: !605, line: 202, baseType: !1490, size: 128)
!1490 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !605, line: 200, baseType: !1491)
!1491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !605, line: 200, size: 128, elements: !1492)
!1492 = !{!1493, !1494, !1495}
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1491, file: !605, line: 200, baseType: !7, size: 32)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1491, file: !605, line: 200, baseType: !7, size: 32, offset: 32)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1491, file: !605, line: 200, baseType: !1048, size: 64, offset: 64)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1442, file: !605, line: 234, baseType: !1485, size: 64, offset: 256)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1436, file: !605, line: 197, baseType: !835, size: 64, offset: 256)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !1030, file: !605, line: 319, baseType: !903, size: 256)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !1030, file: !605, line: 320, baseType: !922, size: 192)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !844, file: !143, line: 3384, baseType: !1501, size: 1472)
!1501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !143, line: 3114, size: 1472, elements: !1502)
!1502 = !{!1503, !1524, !1525, !1526, !1527}
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1501, file: !143, line: 3115, baseType: !1504, size: 1216)
!1504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !143, line: 2984, size: 1216, elements: !1505)
!1505 = !{!1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523}
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1504, file: !143, line: 2985, baseType: !1011, size: 960)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1504, file: !143, line: 2986, baseType: !841, size: 64, offset: 960)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1504, file: !143, line: 2987, baseType: !841, size: 64, offset: 1024)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1504, file: !143, line: 2988, baseType: !841, size: 64, offset: 1088)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1504, file: !143, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1504, file: !143, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1504, file: !143, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1504, file: !143, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1504, file: !143, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1504, file: !143, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1504, file: !143, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1504, file: !143, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1504, file: !143, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1504, file: !143, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1504, file: !143, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1504, file: !143, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1504, file: !143, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1504, file: !143, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1501, file: !143, line: 3117, baseType: !841, size: 64, offset: 1216)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1501, file: !143, line: 3119, baseType: !841, size: 64, offset: 1280)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1501, file: !143, line: 3121, baseType: !841, size: 64, offset: 1344)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1501, file: !143, line: 3123, baseType: !841, size: 64, offset: 1408)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !844, file: !143, line: 3385, baseType: !1529, size: 1088)
!1529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !143, line: 2874, size: 1088, elements: !1530)
!1530 = !{!1531, !1532, !1533}
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1529, file: !143, line: 2875, baseType: !1011, size: 960)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1529, file: !143, line: 2876, baseType: !1015, size: 64, offset: 960)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1529, file: !143, line: 2877, baseType: !1534, size: 64, offset: 1024)
!1534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1535, size: 64)
!1535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1536, line: 172, size: 128, elements: !1537)
!1536 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1537 = !{!1538, !1539, !1540, !1541, !1542, !1543, !1544}
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1535, file: !1536, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1535, file: !1536, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1535, file: !1536, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1535, file: !1536, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1535, file: !1536, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1535, file: !1536, line: 195, baseType: !7, size: 32, offset: 32)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1535, file: !1536, line: 199, baseType: !841, size: 64, offset: 64)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !844, file: !143, line: 3386, baseType: !1504, size: 1216)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !844, file: !143, line: 3387, baseType: !1547, size: 1280)
!1547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !143, line: 3093, size: 1280, elements: !1548)
!1548 = !{!1549, !1550}
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1547, file: !143, line: 3094, baseType: !1504, size: 1216)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1547, file: !143, line: 3095, baseType: !1534, size: 64, offset: 1216)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !844, file: !143, line: 3388, baseType: !1552, size: 1216)
!1552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !143, line: 2824, size: 1216, elements: !1553)
!1553 = !{!1554, !1555, !1556, !1557, !1558, !1559}
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1552, file: !143, line: 2825, baseType: !973, size: 896)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1552, file: !143, line: 2827, baseType: !841, size: 64, offset: 896)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1552, file: !143, line: 2828, baseType: !841, size: 64, offset: 960)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1552, file: !143, line: 2829, baseType: !841, size: 64, offset: 1024)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1552, file: !143, line: 2830, baseType: !841, size: 64, offset: 1088)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1552, file: !143, line: 2831, baseType: !841, size: 64, offset: 1152)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !844, file: !143, line: 3389, baseType: !1561, size: 1024)
!1561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !143, line: 2850, size: 1024, elements: !1562)
!1562 = !{!1563, !1564, !1565}
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1561, file: !143, line: 2851, baseType: !1011, size: 960)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1561, file: !143, line: 2852, baseType: !815, size: 32, offset: 960)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1561, file: !143, line: 2853, baseType: !815, size: 32, offset: 992)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !844, file: !143, line: 3390, baseType: !1567, size: 1024)
!1567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !143, line: 2857, size: 1024, elements: !1568)
!1568 = !{!1569, !1570}
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1567, file: !143, line: 2858, baseType: !1011, size: 960)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1567, file: !143, line: 2859, baseType: !1534, size: 64, offset: 960)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !844, file: !143, line: 3391, baseType: !1572, size: 960)
!1572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !143, line: 2862, size: 960, elements: !1573)
!1573 = !{!1574}
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1572, file: !143, line: 2863, baseType: !1011, size: 960)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !844, file: !143, line: 3392, baseType: !1576, size: 1472)
!1576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !143, line: 3304, size: 1472, elements: !1577)
!1577 = !{!1578}
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1576, file: !143, line: 3305, baseType: !1501, size: 1472)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !844, file: !143, line: 3393, baseType: !1580, size: 1792)
!1580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !143, line: 3248, size: 1792, elements: !1581)
!1581 = !{!1582, !1583, !1893, !1894, !1895, !1896, !1897, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913}
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1580, file: !143, line: 3249, baseType: !1501, size: 1472)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1580, file: !143, line: 3251, baseType: !1584, size: 64, offset: 1472)
!1584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1585, size: 64)
!1585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1586, line: 463, size: 1152, elements: !1587)
!1586 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1587 = !{!1588, !1747, !1778, !1779, !1834, !1837, !1838, !1839, !1840, !1841, !1842, !1866, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892}
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1585, file: !1586, line: 464, baseType: !1589, size: 64)
!1589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1590, size: 64)
!1590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !338, line: 194, size: 384, elements: !1591)
!1591 = !{!1592, !1641, !1654, !1668, !1716, !1728}
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !1590, file: !338, line: 197, baseType: !1593, size: 64)
!1593 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !338, line: 182, baseType: !1594)
!1594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1595, size: 64)
!1595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !338, line: 116, size: 704, elements: !1596)
!1596 = !{!1597, !1598, !1599, !1600, !1601, !1602, !1629, !1638, !1639, !1640}
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !1595, file: !338, line: 119, baseType: !1594, size: 64)
