; ModuleID = 'cgraphunit.bc'
source_filename = "cgraphunit.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.cgraph_node = type { %union.tree_node*, %struct.cgraph_edge*, %struct.cgraph_edge*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.htab*, i8*, %struct.VEC_ipa_opt_pass_heap*, %struct.cgraph_local_info, %struct.cgraph_global_info, %struct.cgraph_rtl_info, %struct.cgraph_clone_info, %struct.cgraph_thunk_info, i64, i32, i32, i32, i16 }
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }

!604 = !DIEnumerator(name: "GIMPLE_NOP", value: 18, isUnsigned: true)
!605 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!606 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!607 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!608 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!609 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!610 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!611 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!612 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!613 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!614 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!615 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!616 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!617 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!618 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!619 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!620 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!621 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!622 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !584, line: 727, baseType: !7, size: 32, elements: !623)
!623 = !{!624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647}
!624 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!625 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!626 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!627 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!628 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!629 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!630 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!631 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!632 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!633 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!634 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!635 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!636 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!637 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!638 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!639 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!640 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!641 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!642 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!643 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!644 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!645 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!646 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!647 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!648 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cgraph_order_sort_kind", file: !3, line: 1652, baseType: !7, size: 32, elements: !649)
!649 = !{!650, !651, !652, !653}
!650 = !DIEnumerator(name: "ORDER_UNDEFINED", value: 0, isUnsigned: true)
!651 = !DIEnumerator(name: "ORDER_FUNCTION", value: 1, isUnsigned: true)
!652 = !DIEnumerator(name: "ORDER_VAR", value: 2, isUnsigned: true)
!653 = !DIEnumerator(name: "ORDER_ASM", value: 3, isUnsigned: true)
!654 = !{!655, !656, !657, !658, !661, !662, !134, !664, !1515, !7, !989, !1991, !1023, !659, !1993, !791, !1995, !2000, !2229, !2245, !2246}
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!657 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !660)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !665, line: 56, baseType: !666)
!665 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !135, line: 3371, size: 1792, elements: !668)
!668 = !{!669, !702, !708, !721, !740, !751, !756, !765, !771, !784, !796, !834, !1326, !1354, !1371, !1372, !1377, !1386, !1392, !1397, !1401, !1405, !1642, !1689, !1695, !1701, !1708, !1721, !1735, !1752, !1764, !1786, !1801, !1973}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !667, file: !135, line: 3372, baseType: !670, size: 64)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !135, line: 360, size: 64, elements: !671)
!671 = !{!672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !670, file: !135, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !670, file: !135, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !670, file: !135, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !670, file: !135, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !670, file: !135, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !670, file: !135, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !670, file: !135, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !670, file: !135, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !670, file: !135, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !670, file: !135, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !670, file: !135, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !670, file: !135, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !670, file: !135, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !670, file: !135, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !670, file: !135, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !670, file: !135, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !670, file: !135, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !670, file: !135, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !670, file: !135, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !670, file: !135, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !670, file: !135, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !670, file: !135, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !670, file: !135, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !670, file: !135, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !670, file: !135, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !670, file: !135, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !670, file: !135, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !670, file: !135, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !670, file: !135, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !670, file: !135, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !667, file: !135, line: 3373, baseType: !703, size: 192)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !135, line: 402, size: 192, elements: !704)
!704 = !{!705, !706, !707}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !703, file: !135, line: 403, baseType: !670, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !703, file: !135, line: 404, baseType: !664, size: 64, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !703, file: !135, line: 405, baseType: !664, size: 64, offset: 128)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !667, file: !135, line: 3374, baseType: !709, size: 320)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !135, line: 1384, size: 320, elements: !710)
!710 = !{!711, !712}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !709, file: !135, line: 1385, baseType: !703, size: 192)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !709, file: !135, line: 1386, baseType: !713, size: 128, offset: 192)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !714, line: 58, baseType: !715)
!714 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !714, line: 54, size: 128, elements: !716)
!716 = !{!717, !719}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !715, file: !714, line: 56, baseType: !718, size: 64)
!718 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !715, file: !714, line: 57, baseType: !720, size: 64, offset: 64)
!720 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !667, file: !135, line: 3375, baseType: !722, size: 256)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !135, line: 1397, size: 256, elements: !723)
!723 = !{!724, !725}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !722, file: !135, line: 1398, baseType: !703, size: 192)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !722, file: !135, line: 1399, baseType: !726, size: 64, offset: 192)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !728, line: 52, size: 256, elements: !729)
!728 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!729 = !{!730, !731, !732, !733, !734, !735, !736}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !727, file: !728, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !727, file: !728, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !727, file: !728, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !727, file: !728, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !727, file: !728, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !727, file: !728, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !727, file: !728, line: 62, baseType: !737, size: 192, offset: 64)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !718, size: 192, elements: !738)
!738 = !{!739}
!739 = !DISubrange(count: 3)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !667, file: !135, line: 3376, baseType: !741, size: 256)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !135, line: 1408, size: 256, elements: !742)
!742 = !{!743, !744}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !741, file: !135, line: 1409, baseType: !703, size: 192)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !741, file: !135, line: 1410, baseType: !745, size: 64, offset: 192)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !747, line: 27, size: 192, elements: !748)
!747 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!748 = !{!749, !750}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !746, file: !747, line: 29, baseType: !713, size: 128)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !746, file: !747, line: 30, baseType: !5, size: 32, offset: 128)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !667, file: !135, line: 3377, baseType: !752, size: 256)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !135, line: 1437, size: 256, elements: !753)
!753 = !{!754, !755}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !752, file: !135, line: 1438, baseType: !703, size: 192)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !752, file: !135, line: 1439, baseType: !664, size: 64, offset: 192)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !667, file: !135, line: 3378, baseType: !757, size: 256)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !135, line: 1418, size: 256, elements: !758)
!758 = !{!759, !760, !761}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !757, file: !135, line: 1419, baseType: !703, size: 192)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !757, file: !135, line: 1420, baseType: !657, size: 32, offset: 192)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !757, file: !135, line: 1421, baseType: !762, size: 8, offset: 224)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !660, size: 8, elements: !763)
!763 = !{!764}
!764 = !DISubrange(count: 1)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !667, file: !135, line: 3379, baseType: !766, size: 320)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !135, line: 1428, size: 320, elements: !767)
!767 = !{!768, !769, !770}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !766, file: !135, line: 1429, baseType: !703, size: 192)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !766, file: !135, line: 1430, baseType: !664, size: 64, offset: 192)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !766, file: !135, line: 1431, baseType: !664, size: 64, offset: 256)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !667, file: !135, line: 3380, baseType: !772, size: 320)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !135, line: 1460, size: 320, elements: !773)
!773 = !{!774, !775}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !772, file: !135, line: 1461, baseType: !703, size: 192)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !772, file: !135, line: 1462, baseType: !776, size: 128, offset: 192)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !777, line: 31, size: 128, elements: !778)
!777 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!778 = !{!779, !782, !783}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !776, file: !777, line: 32, baseType: !780, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !656)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !776, file: !777, line: 33, baseType: !7, size: 32, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !776, file: !777, line: 34, baseType: !7, size: 32, offset: 96)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !667, file: !135, line: 3381, baseType: !785, size: 384)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !135, line: 2507, size: 384, elements: !786)
!786 = !{!787, !788, !793, !794, !795}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !785, file: !135, line: 2508, baseType: !703, size: 192)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !785, file: !135, line: 2509, baseType: !789, size: 32, offset: 192)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !790, line: 58, baseType: !791)
!790 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !792, line: 44, baseType: !7)
!792 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!793 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !785, file: !135, line: 2510, baseType: !7, size: 32, offset: 224)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !785, file: !135, line: 2511, baseType: !664, size: 64, offset: 256)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !785, file: !135, line: 2512, baseType: !664, size: 64, offset: 320)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !667, file: !135, line: 3382, baseType: !797, size: 896)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !135, line: 2652, size: 896, elements: !798)
!798 = !{!799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !797, file: !135, line: 2653, baseType: !785, size: 384)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !797, file: !135, line: 2654, baseType: !664, size: 64, offset: 384)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !797, file: !135, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !797, file: !135, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !797, file: !135, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !797, file: !135, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !797, file: !135, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !797, file: !135, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !797, file: !135, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !797, file: !135, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !797, file: !135, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !797, file: !135, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !797, file: !135, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !797, file: !135, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !797, file: !135, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !797, file: !135, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !797, file: !135, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !797, file: !135, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !797, file: !135, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !797, file: !135, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !797, file: !135, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !797, file: !135, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !797, file: !135, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !797, file: !135, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !797, file: !135, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !797, file: !135, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !797, file: !135, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !797, file: !135, line: 2703, baseType: !7, size: 32, offset: 512)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !797, file: !135, line: 2705, baseType: !664, size: 64, offset: 576)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !797, file: !135, line: 2706, baseType: !664, size: 64, offset: 640)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !797, file: !135, line: 2707, baseType: !664, size: 64, offset: 704)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !797, file: !135, line: 2708, baseType: !664, size: 64, offset: 768)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !797, file: !135, line: 2711, baseType: !832, size: 64, offset: 832)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !135, line: 2711, flags: DIFlagFwdDecl)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !667, file: !135, line: 3383, baseType: !835, size: 960)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !135, line: 2756, size: 960, elements: !836)
!836 = !{!837, !838}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !835, file: !135, line: 2757, baseType: !797, size: 896)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !835, file: !135, line: 2758, baseType: !839, size: 64, offset: 896)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !665, line: 50, baseType: !840)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !842, line: 240, size: 384, elements: !843)
!842 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!843 = !{!844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !841, file: !842, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !841, file: !842, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !841, file: !842, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !841, file: !842, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !841, file: !842, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !841, file: !842, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !841, file: !842, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !841, file: !842, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !841, file: !842, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !841, file: !842, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !841, file: !842, line: 321, baseType: !855, size: 320, offset: 64)
!855 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !842, line: 315, size: 320, elements: !856)
!856 = !{!857, !1259, !1261, !1324, !1325}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !855, file: !842, line: 316, baseType: !858, size: 64)
!858 = !DICompositeType(tag: DW_TAG_array_type, baseType: !859, size: 64, elements: !763)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !842, line: 183, baseType: !860)
!860 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !842, line: 166, size: 64, elements: !861)
!861 = !{!862, !863, !864, !865, !866, !874, !875, !887, !890, !950, !951, !1236, !1249, !1256}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !860, file: !842, line: 168, baseType: !657, size: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !860, file: !842, line: 169, baseType: !7, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !860, file: !842, line: 170, baseType: !662, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !860, file: !842, line: 171, baseType: !839, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !860, file: !842, line: 172, baseType: !867, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !665, line: 53, baseType: !868)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !842, line: 359, size: 128, elements: !870)
!870 = !{!871, !872}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !869, file: !842, line: 360, baseType: !657, size: 32)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !869, file: !842, line: 361, baseType: !873, size: 64, offset: 64)
!873 = !DICompositeType(tag: DW_TAG_array_type, baseType: !839, size: 64, elements: !763)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !860, file: !842, line: 173, baseType: !5, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !860, file: !842, line: 174, baseType: !876, size: 32)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !842, line: 133, baseType: !877)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !842, line: 115, size: 32, elements: !878)
!878 = !{!879, !880, !881, !882, !883, !884, !885, !886}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !877, file: !842, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !877, file: !842, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !877, file: !842, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !877, file: !842, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !877, file: !842, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !877, file: !842, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !877, file: !842, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !877, file: !842, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !860, file: !842, line: 175, baseType: !888, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !842, line: 175, flags: DIFlagFwdDecl)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !860, file: !842, line: 176, baseType: !891, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !893, line: 75, size: 256, elements: !894)
!893 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!894 = !{!895, !909, !910, !911}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !892, file: !893, line: 76, baseType: !896, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !893, line: 68, baseType: !898)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !893, line: 63, size: 320, elements: !899)
!899 = !{!900, !902, !903, !904}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !898, file: !893, line: 64, baseType: !901, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !898, file: !893, line: 65, baseType: !901, size: 64, offset: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !898, file: !893, line: 66, baseType: !7, size: 32, offset: 128)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !898, file: !893, line: 67, baseType: !905, size: 128, offset: 192)
!905 = !DICompositeType(tag: DW_TAG_array_type, baseType: !906, size: 128, elements: !907)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !893, line: 29, baseType: !718)
!907 = !{!908}
!908 = !DISubrange(count: 2)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !892, file: !893, line: 77, baseType: !896, size: 64, offset: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !892, file: !893, line: 78, baseType: !7, size: 32, offset: 128)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !892, file: !893, line: 79, baseType: !912, size: 64, offset: 192)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !893, line: 49, baseType: !914)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !893, line: 45, size: 832, elements: !915)
!915 = !{!916, !917, !918}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !914, file: !893, line: 46, baseType: !901, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !914, file: !893, line: 47, baseType: !891, size: 64, offset: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !914, file: !893, line: 48, baseType: !919, size: 704, offset: 128)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !920, line: 164, size: 704, elements: !921)
!920 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!921 = !{!922, !923, !933, !934, !935, !936, !937, !938, !942, !946, !947, !948, !949}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !919, file: !920, line: 166, baseType: !720, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !919, file: !920, line: 167, baseType: !924, size: 64, offset: 64)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !920, line: 157, size: 192, elements: !926)
!926 = !{!927, !928, !929}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !925, file: !920, line: 159, baseType: !659, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !925, file: !920, line: 160, baseType: !924, size: 64, offset: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !925, file: !920, line: 161, baseType: !930, size: 32, offset: 128)
!930 = !DICompositeType(tag: DW_TAG_array_type, baseType: !660, size: 32, elements: !931)
!931 = !{!932}
!932 = !DISubrange(count: 4)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !919, file: !920, line: 168, baseType: !659, size: 64, offset: 128)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !919, file: !920, line: 169, baseType: !659, size: 64, offset: 192)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !919, file: !920, line: 170, baseType: !659, size: 64, offset: 256)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !919, file: !920, line: 171, baseType: !720, size: 64, offset: 320)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !919, file: !920, line: 172, baseType: !657, size: 32, offset: 384)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !919, file: !920, line: 176, baseType: !939, size: 64, offset: 448)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DISubroutineType(types: !941)
!941 = !{!924, !661, !720}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !919, file: !920, line: 177, baseType: !943, size: 64, offset: 512)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DISubroutineType(types: !945)
!945 = !{null, !661, !924}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !919, file: !920, line: 178, baseType: !661, size: 64, offset: 576)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !919, file: !920, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !919, file: !920, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !919, file: !920, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !860, file: !842, line: 177, baseType: !664, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !860, file: !842, line: 178, baseType: !952, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !330, line: 217, size: 832, elements: !954)
!954 = !{!955, !1201, !1202, !1203, !1206, !1210, !1211, !1212, !1230, !1231, !1232, !1233, !1234, !1235}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !953, file: !330, line: 219, baseType: !956, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !330, line: 151, baseType: !958)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !330, line: 151, size: 128, elements: !959)
!959 = !{!960}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !958, file: !330, line: 151, baseType: !961, size: 128)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !330, line: 150, baseType: !962)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !330, line: 150, size: 128, elements: !963)
!963 = !{!964, !965, !966}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !962, file: !330, line: 150, baseType: !7, size: 32)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !962, file: !330, line: 150, baseType: !7, size: 32, offset: 32)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !962, file: !330, line: 150, baseType: !967, size: 64, offset: 64)
!967 = !DICompositeType(tag: DW_TAG_array_type, baseType: !968, size: 64, elements: !763)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !665, line: 108, baseType: !969)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !330, line: 122, size: 512, elements: !971)
!971 = !{!972, !973, !974, !1193, !1194, !1195, !1196, !1197, !1198, !1199}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !970, file: !330, line: 124, baseType: !952, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !970, file: !330, line: 125, baseType: !952, size: 64, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !970, file: !330, line: 131, baseType: !975, size: 64, offset: 128)
!975 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !330, line: 128, size: 64, elements: !976)
!976 = !{!977, !1192}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !975, file: !330, line: 129, baseType: !978, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !665, line: 66, baseType: !979)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !584, line: 143, size: 192, elements: !981)
!981 = !{!982, !1190, !1191}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !980, file: !584, line: 145, baseType: !983, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !665, line: 69, baseType: !984)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !584, line: 136, size: 192, elements: !986)
!986 = !{!987, !1188, !1189}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !985, file: !584, line: 137, baseType: !988, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !665, line: 58, baseType: !989)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !584, line: 737, size: 768, elements: !991)
!991 = !{!992, !1009, !1043, !1049, !1054, !1059, !1066, !1072, !1078, !1083, !1097, !1102, !1108, !1113, !1123, !1128, !1146, !1153, !1160, !1166, !1171, !1177, !1183}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !990, file: !584, line: 738, baseType: !993, size: 256)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !584, line: 271, size: 256, elements: !994)
!994 = !{!995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !993, file: !584, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !993, file: !584, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !993, file: !584, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !993, file: !584, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !993, file: !584, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !993, file: !584, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !993, file: !584, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !993, file: !584, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !993, file: !584, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !993, file: !584, line: 312, baseType: !7, size: 32, offset: 32)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !993, file: !584, line: 316, baseType: !789, size: 32, offset: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !993, file: !584, line: 319, baseType: !7, size: 32, offset: 96)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !993, file: !584, line: 323, baseType: !952, size: 64, offset: 128)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !993, file: !584, line: 327, baseType: !664, size: 64, offset: 192)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !990, file: !584, line: 739, baseType: !1010, size: 448)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !584, line: 350, size: 448, elements: !1011)
!1011 = !{!1012, !1041}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1010, file: !584, line: 353, baseType: !1013, size: 384)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !584, line: 333, size: 384, elements: !1014)
!1014 = !{!1015, !1016, !1024}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1013, file: !584, line: 336, baseType: !993, size: 256)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !1013, file: !584, line: 343, baseType: !1017, size: 64, offset: 256)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1019, line: 37, size: 128, elements: !1020)
!1019 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1020 = !{!1021, !1022}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1018, file: !1019, line: 39, baseType: !1017, size: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1018, file: !1019, line: 40, baseType: !1023, size: 64, offset: 64)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !1013, file: !584, line: 344, baseType: !1025, size: 64, offset: 320)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1019, line: 45, size: 320, elements: !1027)
!1027 = !{!1028, !1029}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1026, file: !1019, line: 47, baseType: !1025, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1026, file: !1019, line: 48, baseType: !1030, size: 256, offset: 64)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !135, line: 1883, size: 256, elements: !1031)
!1031 = !{!1032, !1034, !1035, !1040}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1030, file: !135, line: 1884, baseType: !1033, size: 64)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1030, file: !135, line: 1885, baseType: !1033, size: 64, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1030, file: !135, line: 1891, baseType: !1036, size: 64, offset: 128)
!1036 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1030, file: !135, line: 1891, size: 64, elements: !1037)
!1037 = !{!1038, !1039}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1036, file: !135, line: 1891, baseType: !988, size: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1036, file: !135, line: 1891, baseType: !664, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1030, file: !135, line: 1892, baseType: !1023, size: 64, offset: 192)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1010, file: !584, line: 359, baseType: !1042, size: 64, offset: 384)
!1042 = !DICompositeType(tag: DW_TAG_array_type, baseType: !664, size: 64, elements: !763)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !990, file: !584, line: 740, baseType: !1044, size: 512)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !584, line: 365, size: 512, elements: !1045)
!1045 = !{!1046, !1047, !1048}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1044, file: !584, line: 368, baseType: !1013, size: 384)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1044, file: !584, line: 373, baseType: !664, size: 64, offset: 384)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1044, file: !584, line: 374, baseType: !664, size: 64, offset: 448)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !990, file: !584, line: 741, baseType: !1050, size: 576)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !584, line: 380, size: 576, elements: !1051)
!1051 = !{!1052, !1053}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1050, file: !584, line: 383, baseType: !1044, size: 512)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1050, file: !584, line: 389, baseType: !1042, size: 64, offset: 512)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !990, file: !584, line: 742, baseType: !1055, size: 320)
!1055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !584, line: 395, size: 320, elements: !1056)
!1056 = !{!1057, !1058}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1055, file: !584, line: 397, baseType: !993, size: 256)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1055, file: !584, line: 400, baseType: !978, size: 64, offset: 256)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !990, file: !584, line: 743, baseType: !1060, size: 448)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !584, line: 406, size: 448, elements: !1061)
!1061 = !{!1062, !1063, !1064, !1065}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1060, file: !584, line: 408, baseType: !993, size: 256)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1060, file: !584, line: 412, baseType: !664, size: 64, offset: 256)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1060, file: !584, line: 420, baseType: !664, size: 64, offset: 320)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1060, file: !584, line: 423, baseType: !978, size: 64, offset: 384)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !990, file: !584, line: 744, baseType: !1067, size: 384)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !584, line: 429, size: 384, elements: !1068)
!1068 = !{!1069, !1070, !1071}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1067, file: !584, line: 431, baseType: !993, size: 256)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1067, file: !584, line: 434, baseType: !664, size: 64, offset: 256)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1067, file: !584, line: 437, baseType: !978, size: 64, offset: 320)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !990, file: !584, line: 745, baseType: !1073, size: 384)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !584, line: 443, size: 384, elements: !1074)
!1074 = !{!1075, !1076, !1077}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1073, file: !584, line: 445, baseType: !993, size: 256)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1073, file: !584, line: 449, baseType: !664, size: 64, offset: 256)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1073, file: !584, line: 453, baseType: !978, size: 64, offset: 320)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !990, file: !584, line: 746, baseType: !1079, size: 320)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !584, line: 459, size: 320, elements: !1080)
!1080 = !{!1081, !1082}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1079, file: !584, line: 461, baseType: !993, size: 256)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1079, file: !584, line: 464, baseType: !664, size: 64, offset: 256)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !990, file: !584, line: 747, baseType: !1084, size: 768)
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !584, line: 469, size: 768, elements: !1085)
!1085 = !{!1086, !1087, !1088, !1089, !1090}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1084, file: !584, line: 471, baseType: !993, size: 256)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1084, file: !584, line: 474, baseType: !7, size: 32, offset: 256)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1084, file: !584, line: 475, baseType: !7, size: 32, offset: 288)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1084, file: !584, line: 478, baseType: !664, size: 64, offset: 320)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1084, file: !584, line: 481, baseType: !1091, size: 384, offset: 384)
!1091 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1092, size: 384, elements: !763)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !135, line: 1917, size: 384, elements: !1093)
!1093 = !{!1094, !1095, !1096}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1092, file: !135, line: 1920, baseType: !1030, size: 256)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1092, file: !135, line: 1921, baseType: !664, size: 64, offset: 256)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1092, file: !135, line: 1922, baseType: !789, size: 32, offset: 320)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !990, file: !584, line: 748, baseType: !1098, size: 320)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !584, line: 487, size: 320, elements: !1099)
!1099 = !{!1100, !1101}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1098, file: !584, line: 490, baseType: !993, size: 256)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1098, file: !584, line: 494, baseType: !657, size: 32, offset: 256)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !990, file: !584, line: 749, baseType: !1103, size: 384)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !584, line: 500, size: 384, elements: !1104)
!1104 = !{!1105, !1106, !1107}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1103, file: !584, line: 502, baseType: !993, size: 256)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1103, file: !584, line: 506, baseType: !978, size: 64, offset: 256)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1103, file: !584, line: 510, baseType: !978, size: 64, offset: 320)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !990, file: !584, line: 750, baseType: !1109, size: 320)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !584, line: 529, size: 320, elements: !1110)
!1110 = !{!1111, !1112}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1109, file: !584, line: 531, baseType: !993, size: 256)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1109, file: !584, line: 540, baseType: !978, size: 64, offset: 256)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !990, file: !584, line: 751, baseType: !1114, size: 704)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !584, line: 546, size: 704, elements: !1115)
!1115 = !{!1116, !1117, !1118, !1119, !1120, !1121, !1122}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1114, file: !584, line: 549, baseType: !1044, size: 512)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1114, file: !584, line: 553, baseType: !662, size: 64, offset: 512)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1114, file: !584, line: 557, baseType: !656, size: 8, offset: 576)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1114, file: !584, line: 558, baseType: !656, size: 8, offset: 584)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1114, file: !584, line: 559, baseType: !656, size: 8, offset: 592)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1114, file: !584, line: 560, baseType: !656, size: 8, offset: 600)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1114, file: !584, line: 566, baseType: !1042, size: 64, offset: 640)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !990, file: !584, line: 752, baseType: !1124, size: 384)
!1124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !584, line: 571, size: 384, elements: !1125)
!1125 = !{!1126, !1127}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1124, file: !584, line: 573, baseType: !1055, size: 320)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1124, file: !584, line: 577, baseType: !664, size: 64, offset: 320)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !990, file: !584, line: 753, baseType: !1129, size: 576)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !584, line: 600, size: 576, elements: !1130)
!1130 = !{!1131, !1132, !1133, !1136, !1145}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1129, file: !584, line: 602, baseType: !1055, size: 320)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1129, file: !584, line: 605, baseType: !664, size: 64, offset: 320)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1129, file: !584, line: 609, baseType: !1134, size: 64, offset: 384)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1135, line: 46, baseType: !718)
!1135 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1129, file: !584, line: 612, baseType: !1137, size: 64, offset: 448)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !584, line: 581, size: 320, elements: !1139)
!1139 = !{!1140, !1141, !1142, !1143, !1144}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1138, file: !584, line: 583, baseType: !134, size: 32)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1138, file: !584, line: 586, baseType: !664, size: 64, offset: 64)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1138, file: !584, line: 589, baseType: !664, size: 64, offset: 128)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1138, file: !584, line: 592, baseType: !664, size: 64, offset: 192)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1138, file: !584, line: 595, baseType: !664, size: 64, offset: 256)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1129, file: !584, line: 616, baseType: !978, size: 64, offset: 512)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !990, file: !584, line: 754, baseType: !1147, size: 512)
!1147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !584, line: 622, size: 512, elements: !1148)
!1148 = !{!1149, !1150, !1151, !1152}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1147, file: !584, line: 624, baseType: !1055, size: 320)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1147, file: !584, line: 628, baseType: !664, size: 64, offset: 320)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1147, file: !584, line: 632, baseType: !664, size: 64, offset: 384)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1147, file: !584, line: 636, baseType: !664, size: 64, offset: 448)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !990, file: !584, line: 755, baseType: !1154, size: 704)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !584, line: 642, size: 704, elements: !1155)
!1155 = !{!1156, !1157, !1158, !1159}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1154, file: !584, line: 644, baseType: !1147, size: 512)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1154, file: !584, line: 648, baseType: !664, size: 64, offset: 512)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1154, file: !584, line: 652, baseType: !664, size: 64, offset: 576)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1154, file: !584, line: 653, baseType: !664, size: 64, offset: 640)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !990, file: !584, line: 756, baseType: !1161, size: 448)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !584, line: 663, size: 448, elements: !1162)
!1162 = !{!1163, !1164, !1165}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1161, file: !584, line: 665, baseType: !1055, size: 320)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1161, file: !584, line: 668, baseType: !664, size: 64, offset: 320)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1161, file: !584, line: 673, baseType: !664, size: 64, offset: 384)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !990, file: !584, line: 757, baseType: !1167, size: 384)
!1167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !584, line: 694, size: 384, elements: !1168)
!1168 = !{!1169, !1170}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1167, file: !584, line: 696, baseType: !1055, size: 320)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1167, file: !584, line: 699, baseType: !664, size: 64, offset: 320)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !990, file: !584, line: 758, baseType: !1172, size: 384)
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !584, line: 681, size: 384, elements: !1173)
!1173 = !{!1174, !1175, !1176}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1172, file: !584, line: 683, baseType: !993, size: 256)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1172, file: !584, line: 686, baseType: !664, size: 64, offset: 256)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1172, file: !584, line: 689, baseType: !664, size: 64, offset: 320)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !990, file: !584, line: 759, baseType: !1178, size: 384)
!1178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !584, line: 707, size: 384, elements: !1179)
!1179 = !{!1180, !1181, !1182}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1178, file: !584, line: 709, baseType: !993, size: 256)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1178, file: !584, line: 712, baseType: !664, size: 64, offset: 256)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1178, file: !584, line: 712, baseType: !664, size: 64, offset: 320)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !990, file: !584, line: 760, baseType: !1184, size: 320)
!1184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !584, line: 718, size: 320, elements: !1185)
!1185 = !{!1186, !1187}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1184, file: !584, line: 720, baseType: !993, size: 256)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1184, file: !584, line: 723, baseType: !664, size: 64, offset: 256)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !985, file: !584, line: 138, baseType: !984, size: 64, offset: 64)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !985, file: !584, line: 139, baseType: !984, size: 64, offset: 128)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !980, file: !584, line: 146, baseType: !983, size: 64, offset: 64)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !980, file: !584, line: 152, baseType: !978, size: 64, offset: 128)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !975, file: !330, line: 130, baseType: !839, size: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !970, file: !330, line: 134, baseType: !661, size: 64, offset: 192)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !970, file: !330, line: 137, baseType: !664, size: 64, offset: 256)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !970, file: !330, line: 138, baseType: !789, size: 32, offset: 320)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !970, file: !330, line: 142, baseType: !7, size: 32, offset: 352)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !970, file: !330, line: 144, baseType: !657, size: 32, offset: 384)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !970, file: !330, line: 145, baseType: !657, size: 32, offset: 416)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !970, file: !330, line: 146, baseType: !1200, size: 64, offset: 448)
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !330, line: 119, baseType: !720)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !953, file: !330, line: 220, baseType: !956, size: 64, offset: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !953, file: !330, line: 223, baseType: !661, size: 64, offset: 128)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !953, file: !330, line: 226, baseType: !1204, size: 64, offset: 192)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64)
!1205 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !330, line: 185, flags: DIFlagFwdDecl)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !953, file: !330, line: 229, baseType: !1207, size: 128, offset: 256)
!1207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1208, size: 128, elements: !907)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64)
!1209 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !330, line: 229, flags: DIFlagFwdDecl)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !953, file: !330, line: 232, baseType: !952, size: 64, offset: 384)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !953, file: !330, line: 233, baseType: !952, size: 64, offset: 448)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !953, file: !330, line: 238, baseType: !1213, size: 64, offset: 512)
!1213 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !330, line: 235, size: 64, elements: !1214)
!1214 = !{!1215, !1221}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1213, file: !330, line: 236, baseType: !1216, size: 64)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !330, line: 273, size: 128, elements: !1218)
!1218 = !{!1219, !1220}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1217, file: !330, line: 275, baseType: !978, size: 64)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1217, file: !330, line: 278, baseType: !978, size: 64, offset: 64)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1213, file: !330, line: 237, baseType: !1222, size: 64)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64)
!1223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !330, line: 259, size: 320, elements: !1224)
!1224 = !{!1225, !1226, !1227, !1228, !1229}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1223, file: !330, line: 261, baseType: !839, size: 64)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1223, file: !330, line: 262, baseType: !839, size: 64, offset: 64)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1223, file: !330, line: 266, baseType: !839, size: 64, offset: 128)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1223, file: !330, line: 267, baseType: !839, size: 64, offset: 192)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1223, file: !330, line: 270, baseType: !657, size: 32, offset: 256)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !953, file: !330, line: 241, baseType: !1200, size: 64, offset: 576)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !953, file: !330, line: 244, baseType: !657, size: 32, offset: 640)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !953, file: !330, line: 247, baseType: !657, size: 32, offset: 672)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !953, file: !330, line: 250, baseType: !657, size: 32, offset: 704)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !953, file: !330, line: 253, baseType: !657, size: 32, offset: 736)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !953, file: !330, line: 256, baseType: !657, size: 32, offset: 768)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !860, file: !842, line: 179, baseType: !1237, size: 64)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !842, line: 150, baseType: !1239)
!1239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !842, line: 142, size: 320, elements: !1240)
!1240 = !{!1241, !1242, !1243, !1244, !1247, !1248}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1239, file: !842, line: 144, baseType: !664, size: 64)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1239, file: !842, line: 145, baseType: !839, size: 64, offset: 64)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1239, file: !842, line: 146, baseType: !839, size: 64, offset: 128)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1239, file: !842, line: 147, baseType: !1245, size: 32, offset: 192)
!1245 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1246, line: 31, baseType: !657)
!1246 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1239, file: !842, line: 148, baseType: !7, size: 32, offset: 224)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1239, file: !842, line: 149, baseType: !656, size: 8, offset: 256)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !860, file: !842, line: 180, baseType: !1250, size: 64)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64)
!1251 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !842, line: 162, baseType: !1252)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !842, line: 159, size: 128, elements: !1253)
!1253 = !{!1254, !1255}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1252, file: !842, line: 160, baseType: !664, size: 64)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1252, file: !842, line: 161, baseType: !720, size: 64, offset: 64)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !860, file: !842, line: 181, baseType: !1257, size: 64)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64)
!1258 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !842, line: 181, flags: DIFlagFwdDecl)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !855, file: !842, line: 317, baseType: !1260, size: 64)
!1260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !720, size: 64, elements: !763)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !855, file: !842, line: 318, baseType: !1262, size: 320)
!1262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !842, line: 188, size: 320, elements: !1263)
!1263 = !{!1264, !1266, !1323}
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1262, file: !842, line: 190, baseType: !1265, size: 192)
!1265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !859, size: 192, elements: !738)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1262, file: !842, line: 193, baseType: !1267, size: 64, offset: 192)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64)
!1268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !842, line: 206, size: 320, elements: !1269)
!1269 = !{!1270, !1308, !1309, !1310, !1322}
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1268, file: !842, line: 208, baseType: !1271, size: 64)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64)
!1272 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !665, line: 62, baseType: !1273)
!1273 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1274, line: 538, size: 256, elements: !1275)
!1274 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1275 = !{!1276, !1280, !1286, !1299}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1273, file: !1274, line: 539, baseType: !1277, size: 32)
!1277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1274, line: 482, size: 32, elements: !1278)
!1278 = !{!1279}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1277, file: !1274, line: 484, baseType: !7, size: 32)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1273, file: !1274, line: 540, baseType: !1281, size: 192)
!1281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1274, line: 488, size: 192, elements: !1282)
!1282 = !{!1283, !1284, !1285}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1281, file: !1274, line: 489, baseType: !1277, size: 32)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1281, file: !1274, line: 492, baseType: !662, size: 64, offset: 64)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1281, file: !1274, line: 496, baseType: !664, size: 64, offset: 128)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1273, file: !1274, line: 541, baseType: !1287, size: 256)
!1287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1274, line: 504, size: 256, elements: !1288)
!1288 = !{!1289, !1290, !1297, !1298}
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1287, file: !1274, line: 505, baseType: !1277, size: 32)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1287, file: !1274, line: 509, baseType: !1291, size: 64, offset: 64)
!1291 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1274, line: 501, baseType: !1292)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64)
!1293 = !DISubroutineType(types: !1294)
!1294 = !{null, !1295}
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64)
!1296 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1287, file: !1274, line: 510, baseType: !1295, size: 64, offset: 128)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1287, file: !1274, line: 513, baseType: !1271, size: 64, offset: 192)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1273, file: !1274, line: 542, baseType: !1300, size: 128)
!1300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1274, line: 530, size: 128, elements: !1301)
!1301 = !{!1302, !1303}
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1300, file: !1274, line: 531, baseType: !1277, size: 32)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1300, file: !1274, line: 534, baseType: !1304, size: 64, offset: 64)
!1304 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1274, line: 525, baseType: !1305)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64)
!1306 = !DISubroutineType(types: !1307)
!1307 = !{!656, !664, !662, !718, !718}
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1268, file: !842, line: 211, baseType: !7, size: 32, offset: 64)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1268, file: !842, line: 214, baseType: !720, size: 64, offset: 128)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1268, file: !842, line: 224, baseType: !1311, size: 64, offset: 192)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64)
!1312 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !842, line: 202, baseType: !1313)
!1313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !842, line: 202, size: 128, elements: !1314)
!1314 = !{!1315}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1313, file: !842, line: 202, baseType: !1316, size: 128)
!1316 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !842, line: 200, baseType: !1317)
!1317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !842, line: 200, size: 128, elements: !1318)
!1318 = !{!1319, !1320, !1321}
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1317, file: !842, line: 200, baseType: !7, size: 32)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1317, file: !842, line: 200, baseType: !7, size: 32, offset: 32)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1317, file: !842, line: 200, baseType: !873, size: 64, offset: 64)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1268, file: !842, line: 234, baseType: !1311, size: 64, offset: 256)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1262, file: !842, line: 197, baseType: !720, size: 64, offset: 256)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !855, file: !842, line: 319, baseType: !727, size: 256)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !855, file: !842, line: 320, baseType: !746, size: 192)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !667, file: !135, line: 3384, baseType: !1327, size: 1472)
!1327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !135, line: 3114, size: 1472, elements: !1328)
!1328 = !{!1329, !1350, !1351, !1352, !1353}
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1327, file: !135, line: 3115, baseType: !1330, size: 1216)
!1330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !135, line: 2984, size: 1216, elements: !1331)
!1331 = !{!1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349}
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1330, file: !135, line: 2985, baseType: !835, size: 960)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1330, file: !135, line: 2986, baseType: !664, size: 64, offset: 960)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1330, file: !135, line: 2987, baseType: !664, size: 64, offset: 1024)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1330, file: !135, line: 2988, baseType: !664, size: 64, offset: 1088)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1330, file: !135, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1330, file: !135, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1330, file: !135, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1330, file: !135, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1330, file: !135, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1330, file: !135, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1330, file: !135, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1330, file: !135, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1330, file: !135, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1330, file: !135, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1330, file: !135, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1330, file: !135, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1330, file: !135, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1330, file: !135, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1327, file: !135, line: 3117, baseType: !664, size: 64, offset: 1216)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1327, file: !135, line: 3119, baseType: !664, size: 64, offset: 1280)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1327, file: !135, line: 3121, baseType: !664, size: 64, offset: 1344)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1327, file: !135, line: 3123, baseType: !664, size: 64, offset: 1408)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !667, file: !135, line: 3385, baseType: !1355, size: 1088)
!1355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !135, line: 2874, size: 1088, elements: !1356)
!1356 = !{!1357, !1358, !1359}
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1355, file: !135, line: 2875, baseType: !835, size: 960)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1355, file: !135, line: 2876, baseType: !839, size: 64, offset: 960)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1355, file: !135, line: 2877, baseType: !1360, size: 64, offset: 1024)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64)
!1361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1362, line: 172, size: 128, elements: !1363)
!1362 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1363 = !{!1364, !1365, !1366, !1367, !1368, !1369, !1370}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1361, file: !1362, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1361, file: !1362, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1361, file: !1362, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1361, file: !1362, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1361, file: !1362, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1361, file: !1362, line: 195, baseType: !7, size: 32, offset: 32)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1361, file: !1362, line: 199, baseType: !664, size: 64, offset: 64)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !667, file: !135, line: 3386, baseType: !1330, size: 1216)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !667, file: !135, line: 3387, baseType: !1373, size: 1280)
!1373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !135, line: 3093, size: 1280, elements: !1374)
!1374 = !{!1375, !1376}
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1373, file: !135, line: 3094, baseType: !1330, size: 1216)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1373, file: !135, line: 3095, baseType: !1360, size: 64, offset: 1216)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !667, file: !135, line: 3388, baseType: !1378, size: 1216)
!1378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !135, line: 2824, size: 1216, elements: !1379)
!1379 = !{!1380, !1381, !1382, !1383, !1384, !1385}
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1378, file: !135, line: 2825, baseType: !797, size: 896)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1378, file: !135, line: 2827, baseType: !664, size: 64, offset: 896)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1378, file: !135, line: 2828, baseType: !664, size: 64, offset: 960)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1378, file: !135, line: 2829, baseType: !664, size: 64, offset: 1024)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1378, file: !135, line: 2830, baseType: !664, size: 64, offset: 1088)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1378, file: !135, line: 2831, baseType: !664, size: 64, offset: 1152)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !667, file: !135, line: 3389, baseType: !1387, size: 1024)
!1387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !135, line: 2850, size: 1024, elements: !1388)
!1388 = !{!1389, !1390, !1391}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1387, file: !135, line: 2851, baseType: !835, size: 960)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1387, file: !135, line: 2852, baseType: !657, size: 32, offset: 960)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1387, file: !135, line: 2853, baseType: !657, size: 32, offset: 992)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !667, file: !135, line: 3390, baseType: !1393, size: 1024)
!1393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !135, line: 2857, size: 1024, elements: !1394)
!1394 = !{!1395, !1396}
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1393, file: !135, line: 2858, baseType: !835, size: 960)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1393, file: !135, line: 2859, baseType: !1360, size: 64, offset: 960)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !667, file: !135, line: 3391, baseType: !1398, size: 960)
!1398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !135, line: 2862, size: 960, elements: !1399)
!1399 = !{!1400}
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1398, file: !135, line: 2863, baseType: !835, size: 960)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !667, file: !135, line: 3392, baseType: !1402, size: 1472)
!1402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !135, line: 3304, size: 1472, elements: !1403)
!1403 = !{!1404}
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1402, file: !135, line: 3305, baseType: !1327, size: 1472)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !667, file: !135, line: 3393, baseType: !1406, size: 1792)
!1406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !135, line: 3248, size: 1792, elements: !1407)
!1407 = !{!1408, !1409, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641}
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1406, file: !135, line: 3249, baseType: !1327, size: 1472)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1406, file: !135, line: 3251, baseType: !1410, size: 64, offset: 1472)
!1410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1411, size: 64)
!1411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1412, line: 463, size: 1152, elements: !1413)
!1412 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1413 = !{!1414, !1417, !1448, !1449, !1562, !1565, !1566, !1567, !1568, !1569, !1570, !1594, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620}
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1411, file: !1412, line: 464, baseType: !1415, size: 64)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64)
!1416 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1412, line: 464, flags: DIFlagFwdDecl)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1411, file: !1412, line: 467, baseType: !1418, size: 64, offset: 64)
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64)
!1419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !330, line: 374, size: 640, elements: !1420)
!1420 = !{!1421, !1423, !1424, !1437, !1438, !1439, !1440, !1441, !1442, !1444, !1446, !1447}
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1419, file: !330, line: 377, baseType: !1422, size: 64)
!1422 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !665, line: 111, baseType: !952)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1419, file: !330, line: 378, baseType: !1422, size: 64, offset: 64)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1419, file: !330, line: 381, baseType: !1425, size: 64, offset: 128)
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1426, size: 64)
!1426 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !330, line: 282, baseType: !1427)
!1427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !330, line: 282, size: 128, elements: !1428)
!1428 = !{!1429}
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1427, file: !330, line: 282, baseType: !1430, size: 128)
!1430 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !330, line: 281, baseType: !1431)
!1431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !330, line: 281, size: 128, elements: !1432)
!1432 = !{!1433, !1434, !1435}
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1431, file: !330, line: 281, baseType: !7, size: 32)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1431, file: !330, line: 281, baseType: !7, size: 32, offset: 32)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1431, file: !330, line: 281, baseType: !1436, size: 64, offset: 64)
!1436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1422, size: 64, elements: !763)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1419, file: !330, line: 384, baseType: !657, size: 32, offset: 192)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1419, file: !330, line: 387, baseType: !657, size: 32, offset: 224)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1419, file: !330, line: 390, baseType: !657, size: 32, offset: 256)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1419, file: !330, line: 394, baseType: !1425, size: 64, offset: 320)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1419, file: !330, line: 396, baseType: !329, size: 32, offset: 384)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1419, file: !330, line: 399, baseType: !1443, size: 64, offset: 416)
