; ModuleID = 'cgraphbuild.bc'
source_filename = "cgraphbuild.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.gimple_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }

!464 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!465 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!466 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!467 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!468 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!469 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!470 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!471 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!472 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!473 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!474 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!475 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!476 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!477 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!478 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!479 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!480 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!481 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!482 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_code", file: !456, line: 51, baseType: !7, size: 32, elements: !483)
!483 = !{!484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519}
!484 = !DIEnumerator(name: "GIMPLE_ERROR_MARK", value: 0, isUnsigned: true)
!485 = !DIEnumerator(name: "GIMPLE_COND", value: 1, isUnsigned: true)
!486 = !DIEnumerator(name: "GIMPLE_DEBUG", value: 2, isUnsigned: true)
!487 = !DIEnumerator(name: "GIMPLE_GOTO", value: 3, isUnsigned: true)
!488 = !DIEnumerator(name: "GIMPLE_LABEL", value: 4, isUnsigned: true)
!489 = !DIEnumerator(name: "GIMPLE_SWITCH", value: 5, isUnsigned: true)
!490 = !DIEnumerator(name: "GIMPLE_ASSIGN", value: 6, isUnsigned: true)
!491 = !DIEnumerator(name: "GIMPLE_ASM", value: 7, isUnsigned: true)
!492 = !DIEnumerator(name: "GIMPLE_CALL", value: 8, isUnsigned: true)
!493 = !DIEnumerator(name: "GIMPLE_RETURN", value: 9, isUnsigned: true)
!494 = !DIEnumerator(name: "GIMPLE_BIND", value: 10, isUnsigned: true)
!495 = !DIEnumerator(name: "GIMPLE_CATCH", value: 11, isUnsigned: true)
!496 = !DIEnumerator(name: "GIMPLE_EH_FILTER", value: 12, isUnsigned: true)
!497 = !DIEnumerator(name: "GIMPLE_EH_MUST_NOT_THROW", value: 13, isUnsigned: true)
!498 = !DIEnumerator(name: "GIMPLE_RESX", value: 14, isUnsigned: true)
!499 = !DIEnumerator(name: "GIMPLE_EH_DISPATCH", value: 15, isUnsigned: true)
!500 = !DIEnumerator(name: "GIMPLE_PHI", value: 16, isUnsigned: true)
!501 = !DIEnumerator(name: "GIMPLE_TRY", value: 17, isUnsigned: true)
!502 = !DIEnumerator(name: "GIMPLE_NOP", value: 18, isUnsigned: true)
!503 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!504 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!505 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!506 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!507 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!508 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!509 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!510 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!511 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!512 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!513 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!514 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!515 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!516 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!517 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!518 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!519 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!520 = !{!521, !522, !523, !524, !527, !528, !5, !530, !1704, !1060, !525, !601, !7}
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!523 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !526)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !456, line: 737, size: 768, elements: !532)
!532 = !{!533, !1551, !1561, !1567, !1572, !1577, !1584, !1590, !1596, !1601, !1615, !1620, !1626, !1631, !1641, !1646, !1662, !1669, !1676, !1682, !1687, !1693, !1699}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !531, file: !456, line: 738, baseType: !534, size: 256)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !456, line: 271, size: 256, elements: !535)
!535 = !{!536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !551, !552, !1550}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !534, file: !456, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !534, file: !456, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !534, file: !456, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !534, file: !456, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !534, file: !456, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !534, file: !456, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !534, file: !456, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !534, file: !456, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !534, file: !456, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !534, file: !456, line: 312, baseType: !7, size: 32, offset: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !534, file: !456, line: 316, baseType: !547, size: 32, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !548, line: 58, baseType: !549)
!548 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !550, line: 44, baseType: !7)
!550 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!551 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !534, file: !456, line: 319, baseType: !7, size: 32, offset: 96)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !534, file: !456, line: 323, baseType: !553, size: 64, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !202, line: 217, size: 832, elements: !555)
!555 = !{!556, !1515, !1516, !1517, !1520, !1524, !1525, !1526, !1544, !1545, !1546, !1547, !1548, !1549}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !554, file: !202, line: 219, baseType: !557, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !202, line: 151, baseType: !559)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !202, line: 151, size: 128, elements: !560)
!560 = !{!561}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !559, file: !202, line: 151, baseType: !562, size: 128)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !202, line: 150, baseType: !563)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !202, line: 150, size: 128, elements: !564)
!564 = !{!565, !566, !567}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !563, file: !202, line: 150, baseType: !7, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !563, file: !202, line: 150, baseType: !7, size: 32, offset: 32)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !563, file: !202, line: 150, baseType: !568, size: 64, offset: 64)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 64, elements: !683)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !570, line: 108, baseType: !571)
!570 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !202, line: 122, size: 512, elements: !573)
!573 = !{!574, !575, !576, !599, !600, !1509, !1510, !1511, !1512, !1513}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !572, file: !202, line: 124, baseType: !553, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !572, file: !202, line: 125, baseType: !553, size: 64, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !572, file: !202, line: 131, baseType: !577, size: 64, offset: 128)
!577 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !202, line: 128, size: 64, elements: !578)
!578 = !{!579, !595}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !577, file: !202, line: 129, baseType: !580, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !570, line: 66, baseType: !581)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !456, line: 143, size: 192, elements: !583)
!583 = !{!584, !593, !594}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !582, file: !456, line: 145, baseType: !585, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !570, line: 69, baseType: !586)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !456, line: 136, size: 192, elements: !588)
!588 = !{!589, !591, !592}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !587, file: !456, line: 137, baseType: !590, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !570, line: 58, baseType: !530)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !587, file: !456, line: 138, baseType: !586, size: 64, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !587, file: !456, line: 139, baseType: !586, size: 64, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !582, file: !456, line: 146, baseType: !585, size: 64, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !582, file: !456, line: 152, baseType: !580, size: 64, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !577, file: !202, line: 130, baseType: !596, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !570, line: 50, baseType: !597)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !570, line: 49, flags: DIFlagFwdDecl)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !572, file: !202, line: 134, baseType: !527, size: 64, offset: 192)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !572, file: !202, line: 137, baseType: !601, size: 64, offset: 256)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !570, line: 56, baseType: !602)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !6, line: 3371, size: 1792, elements: !604)
!604 = !{!605, !638, !644, !657, !664, !671, !676, !685, !691, !704, !712, !750, !755, !783, !800, !801, !806, !815, !821, !826, !830, !834, !1158, !1207, !1213, !1219, !1226, !1239, !1253, !1270, !1282, !1304, !1319, !1491}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !603, file: !6, line: 3372, baseType: !606, size: 64)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !6, line: 360, size: 64, elements: !607)
!607 = !{!608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !606, file: !6, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !606, file: !6, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !606, file: !6, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !606, file: !6, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !606, file: !6, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !606, file: !6, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !606, file: !6, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !606, file: !6, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !606, file: !6, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !606, file: !6, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !606, file: !6, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !606, file: !6, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !606, file: !6, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !606, file: !6, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !606, file: !6, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !606, file: !6, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !606, file: !6, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !606, file: !6, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !606, file: !6, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !606, file: !6, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !606, file: !6, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !606, file: !6, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !606, file: !6, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !606, file: !6, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !606, file: !6, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !606, file: !6, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !606, file: !6, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !606, file: !6, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !606, file: !6, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !606, file: !6, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !603, file: !6, line: 3373, baseType: !639, size: 192)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !6, line: 402, size: 192, elements: !640)
!640 = !{!641, !642, !643}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !639, file: !6, line: 403, baseType: !606, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !639, file: !6, line: 404, baseType: !601, size: 64, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !639, file: !6, line: 405, baseType: !601, size: 64, offset: 128)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !603, file: !6, line: 3374, baseType: !645, size: 320)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !6, line: 1384, size: 320, elements: !646)
!646 = !{!647, !648}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !645, file: !6, line: 1385, baseType: !639, size: 192)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !645, file: !6, line: 1386, baseType: !649, size: 128, offset: 192)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !650, line: 58, baseType: !651)
!650 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !650, line: 54, size: 128, elements: !652)
!652 = !{!653, !655}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !651, file: !650, line: 56, baseType: !654, size: 64)
!654 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !651, file: !650, line: 57, baseType: !656, size: 64, offset: 64)
!656 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !603, file: !6, line: 3375, baseType: !658, size: 256)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !6, line: 1397, size: 256, elements: !659)
!659 = !{!660, !661}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !658, file: !6, line: 1398, baseType: !639, size: 192)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !658, file: !6, line: 1399, baseType: !662, size: 64, offset: 192)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !6, line: 1392, flags: DIFlagFwdDecl)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !603, file: !6, line: 3376, baseType: !665, size: 256)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !6, line: 1408, size: 256, elements: !666)
!666 = !{!667, !668}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !665, file: !6, line: 1409, baseType: !639, size: 192)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !665, file: !6, line: 1410, baseType: !669, size: 64, offset: 192)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !6, line: 1403, flags: DIFlagFwdDecl)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !603, file: !6, line: 3377, baseType: !672, size: 256)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !6, line: 1437, size: 256, elements: !673)
!673 = !{!674, !675}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !672, file: !6, line: 1438, baseType: !639, size: 192)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !672, file: !6, line: 1439, baseType: !601, size: 64, offset: 192)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !603, file: !6, line: 3378, baseType: !677, size: 256)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !6, line: 1418, size: 256, elements: !678)
!678 = !{!679, !680, !681}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !677, file: !6, line: 1419, baseType: !639, size: 192)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !677, file: !6, line: 1420, baseType: !523, size: 32, offset: 192)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !677, file: !6, line: 1421, baseType: !682, size: 8, offset: 224)
!682 = !DICompositeType(tag: DW_TAG_array_type, baseType: !526, size: 8, elements: !683)
!683 = !{!684}
!684 = !DISubrange(count: 1)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !603, file: !6, line: 3379, baseType: !686, size: 320)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !6, line: 1428, size: 320, elements: !687)
!687 = !{!688, !689, !690}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !686, file: !6, line: 1429, baseType: !639, size: 192)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !686, file: !6, line: 1430, baseType: !601, size: 64, offset: 192)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !686, file: !6, line: 1431, baseType: !601, size: 64, offset: 256)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !603, file: !6, line: 3380, baseType: !692, size: 320)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !6, line: 1460, size: 320, elements: !693)
!693 = !{!694, !695}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !692, file: !6, line: 1461, baseType: !639, size: 192)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !692, file: !6, line: 1462, baseType: !696, size: 128, offset: 192)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !697, line: 31, size: 128, elements: !698)
!697 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!698 = !{!699, !702, !703}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !696, file: !697, line: 32, baseType: !700, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !522)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !696, file: !697, line: 33, baseType: !7, size: 32, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !696, file: !697, line: 34, baseType: !7, size: 32, offset: 96)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !603, file: !6, line: 3381, baseType: !705, size: 384)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !6, line: 2507, size: 384, elements: !706)
!706 = !{!707, !708, !709, !710, !711}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !705, file: !6, line: 2508, baseType: !639, size: 192)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !705, file: !6, line: 2509, baseType: !547, size: 32, offset: 192)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !705, file: !6, line: 2510, baseType: !7, size: 32, offset: 224)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !705, file: !6, line: 2511, baseType: !601, size: 64, offset: 256)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !705, file: !6, line: 2512, baseType: !601, size: 64, offset: 320)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !603, file: !6, line: 3382, baseType: !713, size: 896)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !6, line: 2652, size: 896, elements: !714)
!714 = !{!715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !713, file: !6, line: 2653, baseType: !705, size: 384)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !713, file: !6, line: 2654, baseType: !601, size: 64, offset: 384)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !713, file: !6, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !713, file: !6, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !713, file: !6, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !713, file: !6, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !713, file: !6, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !713, file: !6, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !713, file: !6, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !713, file: !6, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !713, file: !6, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !713, file: !6, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !713, file: !6, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !713, file: !6, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !713, file: !6, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !713, file: !6, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !713, file: !6, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !713, file: !6, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !713, file: !6, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !713, file: !6, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !713, file: !6, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !713, file: !6, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !713, file: !6, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !713, file: !6, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !713, file: !6, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !713, file: !6, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !713, file: !6, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !713, file: !6, line: 2703, baseType: !7, size: 32, offset: 512)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !713, file: !6, line: 2705, baseType: !601, size: 64, offset: 576)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !713, file: !6, line: 2706, baseType: !601, size: 64, offset: 640)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !713, file: !6, line: 2707, baseType: !601, size: 64, offset: 704)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !713, file: !6, line: 2708, baseType: !601, size: 64, offset: 768)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !713, file: !6, line: 2711, baseType: !748, size: 64, offset: 832)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !6, line: 2711, flags: DIFlagFwdDecl)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !603, file: !6, line: 3383, baseType: !751, size: 960)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !6, line: 2756, size: 960, elements: !752)
!752 = !{!753, !754}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !751, file: !6, line: 2757, baseType: !713, size: 896)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !751, file: !6, line: 2758, baseType: !596, size: 64, offset: 896)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !603, file: !6, line: 3384, baseType: !756, size: 1472)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !6, line: 3114, size: 1472, elements: !757)
!757 = !{!758, !779, !780, !781, !782}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !756, file: !6, line: 3115, baseType: !759, size: 1216)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !6, line: 2984, size: 1216, elements: !760)
!760 = !{!761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !759, file: !6, line: 2985, baseType: !751, size: 960)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !759, file: !6, line: 2986, baseType: !601, size: 64, offset: 960)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !759, file: !6, line: 2987, baseType: !601, size: 64, offset: 1024)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !759, file: !6, line: 2988, baseType: !601, size: 64, offset: 1088)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !759, file: !6, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !759, file: !6, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !759, file: !6, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !759, file: !6, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !759, file: !6, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !759, file: !6, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !759, file: !6, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !759, file: !6, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !759, file: !6, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !759, file: !6, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !759, file: !6, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !759, file: !6, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !759, file: !6, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !759, file: !6, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !756, file: !6, line: 3117, baseType: !601, size: 64, offset: 1216)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !756, file: !6, line: 3119, baseType: !601, size: 64, offset: 1280)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !756, file: !6, line: 3121, baseType: !601, size: 64, offset: 1344)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !756, file: !6, line: 3123, baseType: !601, size: 64, offset: 1408)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !603, file: !6, line: 3385, baseType: !784, size: 1088)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !6, line: 2874, size: 1088, elements: !785)
!785 = !{!786, !787, !788}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !784, file: !6, line: 2875, baseType: !751, size: 960)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !784, file: !6, line: 2876, baseType: !596, size: 64, offset: 960)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !784, file: !6, line: 2877, baseType: !789, size: 64, offset: 1024)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !791, line: 172, size: 128, elements: !792)
!791 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!792 = !{!793, !794, !795, !796, !797, !798, !799}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !790, file: !791, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !790, file: !791, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !790, file: !791, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !790, file: !791, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !790, file: !791, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !790, file: !791, line: 195, baseType: !7, size: 32, offset: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !790, file: !791, line: 199, baseType: !601, size: 64, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !603, file: !6, line: 3386, baseType: !759, size: 1216)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !603, file: !6, line: 3387, baseType: !802, size: 1280)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !6, line: 3093, size: 1280, elements: !803)
!803 = !{!804, !805}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !802, file: !6, line: 3094, baseType: !759, size: 1216)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !802, file: !6, line: 3095, baseType: !789, size: 64, offset: 1216)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !603, file: !6, line: 3388, baseType: !807, size: 1216)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !6, line: 2824, size: 1216, elements: !808)
!808 = !{!809, !810, !811, !812, !813, !814}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !807, file: !6, line: 2825, baseType: !713, size: 896)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !807, file: !6, line: 2827, baseType: !601, size: 64, offset: 896)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !807, file: !6, line: 2828, baseType: !601, size: 64, offset: 960)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !807, file: !6, line: 2829, baseType: !601, size: 64, offset: 1024)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !807, file: !6, line: 2830, baseType: !601, size: 64, offset: 1088)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !807, file: !6, line: 2831, baseType: !601, size: 64, offset: 1152)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !603, file: !6, line: 3389, baseType: !816, size: 1024)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !6, line: 2850, size: 1024, elements: !817)
!817 = !{!818, !819, !820}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !816, file: !6, line: 2851, baseType: !751, size: 960)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !816, file: !6, line: 2852, baseType: !523, size: 32, offset: 960)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !816, file: !6, line: 2853, baseType: !523, size: 32, offset: 992)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !603, file: !6, line: 3390, baseType: !822, size: 1024)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !6, line: 2857, size: 1024, elements: !823)
!823 = !{!824, !825}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !822, file: !6, line: 2858, baseType: !751, size: 960)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !822, file: !6, line: 2859, baseType: !789, size: 64, offset: 960)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !603, file: !6, line: 3391, baseType: !827, size: 960)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !6, line: 2862, size: 960, elements: !828)
!828 = !{!829}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !827, file: !6, line: 2863, baseType: !751, size: 960)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !603, file: !6, line: 3392, baseType: !831, size: 1472)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !6, line: 3304, size: 1472, elements: !832)
!832 = !{!833}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !831, file: !6, line: 3305, baseType: !756, size: 1472)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !603, file: !6, line: 3393, baseType: !835, size: 1792)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !6, line: 3248, size: 1792, elements: !836)
!836 = !{!837, !838, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !835, file: !6, line: 3249, baseType: !756, size: 1472)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !835, file: !6, line: 3251, baseType: !839, size: 64, offset: 1472)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !841, line: 463, size: 1152, elements: !842)
!841 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!842 = !{!843, !846, !879, !880, !1078, !1081, !1082, !1083, !1084, !1085, !1086, !1110, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !840, file: !841, line: 464, baseType: !844, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !841, line: 464, flags: DIFlagFwdDecl)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !840, file: !841, line: 467, baseType: !847, size: 64, offset: 64)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !202, line: 374, size: 640, elements: !849)
!849 = !{!850, !852, !853, !866, !867, !868, !869, !870, !871, !875, !877, !878}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !848, file: !202, line: 377, baseType: !851, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !570, line: 111, baseType: !553)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !848, file: !202, line: 378, baseType: !851, size: 64, offset: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !848, file: !202, line: 381, baseType: !854, size: 64, offset: 128)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !202, line: 282, baseType: !856)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !202, line: 282, size: 128, elements: !857)
!857 = !{!858}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !856, file: !202, line: 282, baseType: !859, size: 128)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !202, line: 281, baseType: !860)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !202, line: 281, size: 128, elements: !861)
!861 = !{!862, !863, !864}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !860, file: !202, line: 281, baseType: !7, size: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !860, file: !202, line: 281, baseType: !7, size: 32, offset: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !860, file: !202, line: 281, baseType: !865, size: 64, offset: 64)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !851, size: 64, elements: !683)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !848, file: !202, line: 384, baseType: !523, size: 32, offset: 192)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !848, file: !202, line: 387, baseType: !523, size: 32, offset: 224)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !848, file: !202, line: 390, baseType: !523, size: 32, offset: 256)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !848, file: !202, line: 394, baseType: !854, size: 64, offset: 320)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !848, file: !202, line: 396, baseType: !201, size: 32, offset: 384)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !848, file: !202, line: 399, baseType: !872, size: 64, offset: 416)
!872 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 64, elements: !873)
!873 = !{!874}
!874 = !DISubrange(count: 2)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !848, file: !202, line: 402, baseType: !876, size: 64, offset: 480)
!876 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !873)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !848, file: !202, line: 406, baseType: !523, size: 32, offset: 544)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !848, file: !202, line: 409, baseType: !523, size: 32, offset: 576)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !840, file: !841, line: 470, baseType: !581, size: 64, offset: 128)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !840, file: !841, line: 473, baseType: !881, size: 64, offset: 192)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !791, line: 39, size: 1152, elements: !883)
!883 = !{!884, !936, !949, !962, !963, !1032, !1033, !1037, !1038, !1039, !1040, !1041}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !882, file: !791, line: 41, baseType: !885, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !886, line: 144, baseType: !887)
!886 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !886, line: 100, size: 896, elements: !889)
!889 = !{!890, !898, !903, !908, !910, !913, !914, !915, !916, !917, !922, !924, !925, !930, !935}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !888, file: !886, line: 102, baseType: !891, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !886, line: 52, baseType: !892)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DISubroutineType(types: !894)
!894 = !{!895, !896}
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !886, line: 47, baseType: !7)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !888, file: !886, line: 105, baseType: !899, size: 64, offset: 64)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !886, line: 59, baseType: !900)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DISubroutineType(types: !902)
!902 = !{!523, !896, !896}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !888, file: !886, line: 108, baseType: !904, size: 64, offset: 128)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !886, line: 63, baseType: !905)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DISubroutineType(types: !907)
!907 = !{null, !527}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !888, file: !886, line: 111, baseType: !909, size: 64, offset: 192)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !888, file: !886, line: 114, baseType: !911, size: 64, offset: 256)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !912, line: 46, baseType: !654)
!912 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!913 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !888, file: !886, line: 117, baseType: !911, size: 64, offset: 320)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !888, file: !886, line: 120, baseType: !911, size: 64, offset: 384)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !888, file: !886, line: 124, baseType: !7, size: 32, offset: 448)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !888, file: !886, line: 128, baseType: !7, size: 32, offset: 480)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !888, file: !886, line: 131, baseType: !918, size: 64, offset: 512)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !886, line: 75, baseType: !919)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DISubroutineType(types: !921)
!921 = !{!527, !911, !911}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !888, file: !886, line: 132, baseType: !923, size: 64, offset: 576)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !886, line: 78, baseType: !905)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !888, file: !886, line: 135, baseType: !527, size: 64, offset: 640)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !888, file: !886, line: 136, baseType: !926, size: 64, offset: 704)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !886, line: 82, baseType: !927)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DISubroutineType(types: !929)
!929 = !{!527, !527, !911, !911}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !888, file: !886, line: 137, baseType: !931, size: 64, offset: 768)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !886, line: 83, baseType: !932)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{null, !527, !527}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !888, file: !886, line: 141, baseType: !7, size: 32, offset: 832)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !882, file: !791, line: 48, baseType: !937, size: 64, offset: 64)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !456, line: 35, baseType: !939)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !456, line: 35, size: 128, elements: !940)
!940 = !{!941}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !939, file: !456, line: 35, baseType: !942, size: 128)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !456, line: 33, baseType: !943)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !456, line: 33, size: 128, elements: !944)
!944 = !{!945, !946, !947}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !943, file: !456, line: 33, baseType: !7, size: 32)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !943, file: !456, line: 33, baseType: !7, size: 32, offset: 32)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !943, file: !456, line: 33, baseType: !948, size: 64, offset: 64)
!948 = !DICompositeType(tag: DW_TAG_array_type, baseType: !590, size: 64, elements: !683)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !882, file: !791, line: 51, baseType: !950, size: 64, offset: 128)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !6, line: 183, baseType: !952)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !6, line: 183, size: 128, elements: !953)
!953 = !{!954}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !952, file: !6, line: 183, baseType: !955, size: 128)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !6, line: 182, baseType: !956)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !6, line: 182, size: 128, elements: !957)
!957 = !{!958, !959, !960}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !956, file: !6, line: 182, baseType: !7, size: 32)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !956, file: !6, line: 182, baseType: !7, size: 32, offset: 32)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !956, file: !6, line: 182, baseType: !961, size: 64, offset: 64)
!961 = !DICompositeType(tag: DW_TAG_array_type, baseType: !601, size: 64, elements: !683)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !882, file: !791, line: 54, baseType: !601, size: 64, offset: 192)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !882, file: !791, line: 57, baseType: !964, size: 128, offset: 256)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !965, line: 31, size: 128, elements: !966)
!965 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!966 = !{!967, !968, !969, !970, !971, !972, !973}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !964, file: !965, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !964, file: !965, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !964, file: !965, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !964, file: !965, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !964, file: !965, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !964, file: !965, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !964, file: !965, line: 56, baseType: !974, size: 64, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !570, line: 47, baseType: !975)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !977, line: 75, size: 256, elements: !978)
!977 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!978 = !{!979, !991, !992, !993}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !976, file: !977, line: 76, baseType: !980, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !977, line: 68, baseType: !982)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !977, line: 63, size: 320, elements: !983)
!983 = !{!984, !986, !987, !988}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !982, file: !977, line: 64, baseType: !985, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !982, file: !977, line: 65, baseType: !985, size: 64, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !982, file: !977, line: 66, baseType: !7, size: 32, offset: 128)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !982, file: !977, line: 67, baseType: !989, size: 128, offset: 192)
!989 = !DICompositeType(tag: DW_TAG_array_type, baseType: !990, size: 128, elements: !873)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !977, line: 29, baseType: !654)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !976, file: !977, line: 77, baseType: !980, size: 64, offset: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !976, file: !977, line: 78, baseType: !7, size: 32, offset: 128)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !976, file: !977, line: 79, baseType: !994, size: 64, offset: 192)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !977, line: 49, baseType: !996)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !977, line: 45, size: 832, elements: !997)
!997 = !{!998, !999, !1000}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !996, file: !977, line: 46, baseType: !985, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !996, file: !977, line: 47, baseType: !975, size: 64, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !996, file: !977, line: 48, baseType: !1001, size: 704, offset: 128)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1002, line: 164, size: 704, elements: !1003)
!1002 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1003 = !{!1004, !1005, !1015, !1016, !1017, !1018, !1019, !1020, !1024, !1028, !1029, !1030, !1031}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1001, file: !1002, line: 166, baseType: !656, size: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1001, file: !1002, line: 167, baseType: !1006, size: 64, offset: 64)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1002, line: 157, size: 192, elements: !1008)
!1008 = !{!1009, !1010, !1011}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1007, file: !1002, line: 159, baseType: !525, size: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1007, file: !1002, line: 160, baseType: !1006, size: 64, offset: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1007, file: !1002, line: 161, baseType: !1012, size: 32, offset: 128)
!1012 = !DICompositeType(tag: DW_TAG_array_type, baseType: !526, size: 32, elements: !1013)
!1013 = !{!1014}
!1014 = !DISubrange(count: 4)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1001, file: !1002, line: 168, baseType: !525, size: 64, offset: 128)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1001, file: !1002, line: 169, baseType: !525, size: 64, offset: 192)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1001, file: !1002, line: 170, baseType: !525, size: 64, offset: 256)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1001, file: !1002, line: 171, baseType: !656, size: 64, offset: 320)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1001, file: !1002, line: 172, baseType: !523, size: 32, offset: 384)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1001, file: !1002, line: 176, baseType: !1021, size: 64, offset: 448)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!1006, !527, !656}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1001, file: !1002, line: 177, baseType: !1025, size: 64, offset: 512)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{null, !527, !1006}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1001, file: !1002, line: 178, baseType: !527, size: 64, offset: 576)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1001, file: !1002, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1001, file: !1002, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1001, file: !1002, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !882, file: !791, line: 60, baseType: !964, size: 128, offset: 384)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !882, file: !791, line: 64, baseType: !1034, size: 64, offset: 512)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1036, line: 33, flags: DIFlagFwdDecl)
!1036 = !DIFile(filename: "./pointer-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !882, file: !791, line: 67, baseType: !601, size: 64, offset: 576)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !882, file: !791, line: 73, baseType: !885, size: 64, offset: 640)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !882, file: !791, line: 77, baseType: !974, size: 64, offset: 704)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !882, file: !791, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !882, file: !791, line: 82, baseType: !1042, size: 320, offset: 832)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !1043, line: 62, size: 320, elements: !1044)
!1043 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1044 = !{!1045, !1051, !1052, !1053, !1054, !1061}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1042, file: !1043, line: 63, baseType: !1046, size: 64)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !1043, line: 56, size: 128, elements: !1048)
!1048 = !{!1049, !1050}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1047, file: !1043, line: 57, baseType: !1046, size: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1047, file: !1043, line: 58, baseType: !682, size: 8, offset: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1042, file: !1043, line: 64, baseType: !7, size: 32, offset: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1042, file: !1043, line: 66, baseType: !7, size: 32, offset: 96)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1042, file: !1043, line: 68, baseType: !522, size: 8, offset: 128)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1042, file: !1043, line: 70, baseType: !1055, size: 64, offset: 192)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1043, line: 37, size: 128, elements: !1057)
!1057 = !{!1058, !1059}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1056, file: !1043, line: 39, baseType: !1055, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1056, file: !1043, line: 40, baseType: !1060, size: 64, offset: 64)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1042, file: !1043, line: 71, baseType: !1062, size: 64, offset: 256)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1043, line: 45, size: 320, elements: !1064)
!1064 = !{!1065, !1066}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1063, file: !1043, line: 47, baseType: !1062, size: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1063, file: !1043, line: 48, baseType: !1067, size: 256, offset: 64)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !6, line: 1883, size: 256, elements: !1068)
!1068 = !{!1069, !1071, !1072, !1077}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1067, file: !6, line: 1884, baseType: !1070, size: 64)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1067, file: !6, line: 1885, baseType: !1070, size: 64, offset: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1067, file: !6, line: 1891, baseType: !1073, size: 64, offset: 128)
!1073 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1067, file: !6, line: 1891, size: 64, elements: !1074)
!1074 = !{!1075, !1076}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1073, file: !6, line: 1891, baseType: !590, size: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1073, file: !6, line: 1891, baseType: !601, size: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1067, file: !6, line: 1892, baseType: !1060, size: 64, offset: 192)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !840, file: !841, line: 476, baseType: !1079, size: 64, offset: 256)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64)
!1080 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !841, line: 476, flags: DIFlagFwdDecl)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !840, file: !841, line: 479, baseType: !885, size: 64, offset: 320)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !840, file: !841, line: 484, baseType: !601, size: 64, offset: 384)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !840, file: !841, line: 488, baseType: !601, size: 64, offset: 448)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !840, file: !841, line: 493, baseType: !601, size: 64, offset: 512)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !840, file: !841, line: 496, baseType: !601, size: 64, offset: 576)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !840, file: !841, line: 501, baseType: !1087, size: 64, offset: 640)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !213, line: 2355, size: 576, elements: !1089)
!1089 = !{!1090, !1093, !1094, !1095, !1096, !1098, !1099, !1104, !1105, !1106, !1107, !1108, !1109}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1088, file: !213, line: 2356, baseType: !1091, size: 64)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !213, line: 2356, flags: DIFlagFwdDecl)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1088, file: !213, line: 2357, baseType: !528, size: 64, offset: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1088, file: !213, line: 2358, baseType: !523, size: 32, offset: 128)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1088, file: !213, line: 2359, baseType: !523, size: 32, offset: 160)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1088, file: !213, line: 2360, baseType: !1097, size: 128, offset: 192)
!1097 = !DICompositeType(tag: DW_TAG_array_type, baseType: !523, size: 128, elements: !1013)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1088, file: !213, line: 2364, baseType: !523, size: 32, offset: 320)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1088, file: !213, line: 2367, baseType: !1100, size: 128, offset: 384)
!1100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !213, line: 2349, size: 128, elements: !1101)
!1101 = !{!1102, !1103}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1100, file: !213, line: 2351, baseType: !596, size: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1100, file: !213, line: 2352, baseType: !656, size: 64, offset: 64)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1088, file: !213, line: 2371, baseType: !212, size: 32, offset: 512)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1088, file: !213, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1088, file: !213, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1088, file: !213, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1088, file: !213, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1088, file: !213, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !840, file: !841, line: 504, baseType: !1111, size: 64, offset: 704)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64)
!1112 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !841, line: 504, flags: DIFlagFwdDecl)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !840, file: !841, line: 507, baseType: !885, size: 64, offset: 768)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !840, file: !841, line: 510, baseType: !523, size: 32, offset: 832)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !840, file: !841, line: 513, baseType: !523, size: 32, offset: 864)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !840, file: !841, line: 516, baseType: !547, size: 32, offset: 896)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !840, file: !841, line: 519, baseType: !547, size: 32, offset: 928)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !840, file: !841, line: 522, baseType: !7, size: 32, offset: 960)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !840, file: !841, line: 523, baseType: !7, size: 32, offset: 992)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !840, file: !841, line: 528, baseType: !528, size: 64, offset: 1024)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !840, file: !841, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !840, file: !841, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !840, file: !841, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !840, file: !841, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !840, file: !841, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !840, file: !841, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !840, file: !841, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !840, file: !841, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !840, file: !841, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !840, file: !841, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !840, file: !841, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !840, file: !841, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !840, file: !841, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !840, file: !841, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !840, file: !841, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !840, file: !841, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !835, file: !6, line: 3254, baseType: !601, size: 64, offset: 1536)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !835, file: !6, line: 3257, baseType: !601, size: 64, offset: 1600)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !835, file: !6, line: 3258, baseType: !601, size: 64, offset: 1664)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !835, file: !6, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !835, file: !6, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !835, file: !6, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !835, file: !6, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !835, file: !6, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !835, file: !6, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !835, file: !6, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !835, file: !6, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !835, file: !6, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !835, file: !6, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !835, file: !6, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !835, file: !6, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !835, file: !6, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !835, file: !6, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !835, file: !6, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !835, file: !6, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !835, file: !6, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !835, file: !6, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !603, file: !6, line: 3394, baseType: !1159, size: 1344)
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !6, line: 2279, size: 1344, elements: !1160)
!1160 = !{!1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1186, !1187, !1188, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1159, file: !6, line: 2280, baseType: !639, size: 192)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1159, file: !6, line: 2281, baseType: !601, size: 64, offset: 192)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1159, file: !6, line: 2282, baseType: !601, size: 64, offset: 256)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1159, file: !6, line: 2283, baseType: !601, size: 64, offset: 320)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1159, file: !6, line: 2284, baseType: !601, size: 64, offset: 384)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1159, file: !6, line: 2285, baseType: !7, size: 32, offset: 448)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1159, file: !6, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1159, file: !6, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1159, file: !6, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1159, file: !6, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1159, file: !6, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1159, file: !6, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1159, file: !6, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1159, file: !6, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1159, file: !6, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1159, file: !6, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1159, file: !6, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1159, file: !6, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1159, file: !6, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1159, file: !6, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1159, file: !6, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1159, file: !6, line: 2305, baseType: !7, size: 32, offset: 512)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1159, file: !6, line: 2306, baseType: !1184, size: 32, offset: 544)
!1184 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1185, line: 31, baseType: !523)
!1185 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1159, file: !6, line: 2307, baseType: !601, size: 64, offset: 576)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1159, file: !6, line: 2308, baseType: !601, size: 64, offset: 640)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1159, file: !6, line: 2314, baseType: !1189, size: 64, offset: 704)
!1189 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !6, line: 2309, size: 64, elements: !1190)
!1190 = !{!1191, !1192, !1193}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1189, file: !6, line: 2310, baseType: !523, size: 32)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1189, file: !6, line: 2311, baseType: !528, size: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1189, file: !6, line: 2312, baseType: !1194, size: 64)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64)
!1195 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !6, line: 2277, flags: DIFlagFwdDecl)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1159, file: !6, line: 2315, baseType: !601, size: 64, offset: 768)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1159, file: !6, line: 2316, baseType: !601, size: 64, offset: 832)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1159, file: !6, line: 2317, baseType: !601, size: 64, offset: 896)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1159, file: !6, line: 2318, baseType: !601, size: 64, offset: 960)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1159, file: !6, line: 2319, baseType: !601, size: 64, offset: 1024)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1159, file: !6, line: 2320, baseType: !601, size: 64, offset: 1088)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1159, file: !6, line: 2321, baseType: !601, size: 64, offset: 1152)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1159, file: !6, line: 2322, baseType: !601, size: 64, offset: 1216)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1159, file: !6, line: 2324, baseType: !1205, size: 64, offset: 1280)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64)
!1206 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !6, line: 2324, flags: DIFlagFwdDecl)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !603, file: !6, line: 3395, baseType: !1208, size: 320)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !6, line: 1469, size: 320, elements: !1209)
!1209 = !{!1210, !1211, !1212}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1208, file: !6, line: 1470, baseType: !639, size: 192)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1208, file: !6, line: 1471, baseType: !601, size: 64, offset: 192)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1208, file: !6, line: 1472, baseType: !601, size: 64, offset: 256)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !603, file: !6, line: 3396, baseType: !1214, size: 320)
!1214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !6, line: 1482, size: 320, elements: !1215)
!1215 = !{!1216, !1217, !1218}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1214, file: !6, line: 1483, baseType: !639, size: 192)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1214, file: !6, line: 1484, baseType: !523, size: 32, offset: 192)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1214, file: !6, line: 1485, baseType: !961, size: 64, offset: 256)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !603, file: !6, line: 3397, baseType: !1220, size: 384)
!1220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !6, line: 1829, size: 384, elements: !1221)
!1221 = !{!1222, !1223, !1224, !1225}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1220, file: !6, line: 1830, baseType: !639, size: 192)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1220, file: !6, line: 1831, baseType: !547, size: 32, offset: 192)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1220, file: !6, line: 1832, baseType: !601, size: 64, offset: 256)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1220, file: !6, line: 1835, baseType: !961, size: 64, offset: 320)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !603, file: !6, line: 3398, baseType: !1227, size: 704)
!1227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !6, line: 1898, size: 704, elements: !1228)
!1228 = !{!1229, !1230, !1231, !1232, !1233, !1238}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1227, file: !6, line: 1899, baseType: !639, size: 192)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1227, file: !6, line: 1902, baseType: !601, size: 64, offset: 192)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1227, file: !6, line: 1905, baseType: !590, size: 64, offset: 256)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1227, file: !6, line: 1908, baseType: !7, size: 32, offset: 320)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1227, file: !6, line: 1911, baseType: !1234, size: 64, offset: 384)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64)
!1235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !791, line: 117, size: 128, elements: !1236)
!1236 = !{!1237}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "pt", scope: !1235, file: !791, line: 120, baseType: !964, size: 128)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1227, file: !6, line: 1914, baseType: !1067, size: 256, offset: 448)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !603, file: !6, line: 3399, baseType: !1240, size: 704)
!1240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !6, line: 2008, size: 704, elements: !1241)
!1241 = !{!1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1240, file: !6, line: 2009, baseType: !639, size: 192)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1240, file: !6, line: 2011, baseType: !7, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !1240, file: !6, line: 2012, baseType: !7, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1240, file: !6, line: 2014, baseType: !547, size: 32, offset: 224)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1240, file: !6, line: 2016, baseType: !601, size: 64, offset: 256)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !1240, file: !6, line: 2017, baseType: !950, size: 64, offset: 320)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !1240, file: !6, line: 2019, baseType: !601, size: 64, offset: 384)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !1240, file: !6, line: 2020, baseType: !601, size: 64, offset: 448)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1240, file: !6, line: 2021, baseType: !601, size: 64, offset: 512)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !1240, file: !6, line: 2022, baseType: !601, size: 64, offset: 576)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !1240, file: !6, line: 2023, baseType: !601, size: 64, offset: 640)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !603, file: !6, line: 3400, baseType: !1254, size: 832)
!1254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !6, line: 2430, size: 832, elements: !1255)
!1255 = !{!1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1254, file: !6, line: 2431, baseType: !639, size: 192)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1254, file: !6, line: 2433, baseType: !601, size: 64, offset: 192)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !1254, file: !6, line: 2434, baseType: !601, size: 64, offset: 256)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !1254, file: !6, line: 2435, baseType: !601, size: 64, offset: 320)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !1254, file: !6, line: 2436, baseType: !601, size: 64, offset: 384)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "base_accesses", scope: !1254, file: !6, line: 2437, baseType: !950, size: 64, offset: 448)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "inheritance", scope: !1254, file: !6, line: 2438, baseType: !601, size: 64, offset: 512)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_subvtt", scope: !1254, file: !6, line: 2440, baseType: !601, size: 64, offset: 576)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_vptr", scope: !1254, file: !6, line: 2441, baseType: !601, size: 64, offset: 640)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "base_binfos", scope: !1254, file: !6, line: 2443, baseType: !1266, size: 128, offset: 704)
!1266 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_none", file: !6, line: 182, baseType: !1267)
!1267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_none", file: !6, line: 182, size: 128, elements: !1268)
!1268 = !{!1269}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1267, file: !6, line: 182, baseType: !955, size: 128)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "stmt_list", scope: !603, file: !6, line: 3401, baseType: !1271, size: 320)
!1271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list", file: !6, line: 3327, size: 320, elements: !1272)
!1272 = !{!1273, !1274, !1281}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1271, file: !6, line: 3329, baseType: !639, size: 192)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1271, file: !6, line: 3330, baseType: !1275, size: 64, offset: 192)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64)
