; ModuleID = 'combine.bc'
source_filename = "combine.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.rtl_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.rtl_hooks = type { %struct.rtx_def* (i32, %struct.rtx_def*)*, %struct.rtx_def* (i32, %struct.rtx_def*)*, %struct.rtx_def* (%struct.rtx_def*, i32, %struct.rtx_def*, i32, i64, i64*)*, %struct.rtx_def* (%struct.rtx_def*, i32, %struct.rtx_def*, i32, i32, i32*)*, i8 (i32, %struct.rtx_def*)* }
%struct.rtx_def = type { i32, %union.u }
%union.u = type { %struct.block_symbol }
%struct.block_symbol = type { [3 x %union.rtunion_def], %struct.object_block*, i64 }
%union.rtunion_def = type { i8* }
%struct.object_block = type { %union.section*, i32, i64, %struct.VEC_rtx_gc*, %struct.VEC_rtx_gc* }
%union.section = type { %struct.unnamed_section }
%struct.unnamed_section = type { %struct.section_common, void (i8*)*, i8*, %union.section* }
%struct.section_common = type { i32 }

!707 = !DIEnumerator(name: "MODE_CC", value: 1, isUnsigned: true)
!708 = !DIEnumerator(name: "MODE_INT", value: 2, isUnsigned: true)
!709 = !DIEnumerator(name: "MODE_PARTIAL_INT", value: 3, isUnsigned: true)
!710 = !DIEnumerator(name: "MODE_FRACT", value: 4, isUnsigned: true)
!711 = !DIEnumerator(name: "MODE_UFRACT", value: 5, isUnsigned: true)
!712 = !DIEnumerator(name: "MODE_ACCUM", value: 6, isUnsigned: true)
!713 = !DIEnumerator(name: "MODE_UACCUM", value: 7, isUnsigned: true)
!714 = !DIEnumerator(name: "MODE_FLOAT", value: 8, isUnsigned: true)
!715 = !DIEnumerator(name: "MODE_DECIMAL_FLOAT", value: 9, isUnsigned: true)
!716 = !DIEnumerator(name: "MODE_COMPLEX_INT", value: 10, isUnsigned: true)
!717 = !DIEnumerator(name: "MODE_COMPLEX_FLOAT", value: 11, isUnsigned: true)
!718 = !DIEnumerator(name: "MODE_VECTOR_INT", value: 12, isUnsigned: true)
!719 = !DIEnumerator(name: "MODE_VECTOR_FRACT", value: 13, isUnsigned: true)
!720 = !DIEnumerator(name: "MODE_VECTOR_UFRACT", value: 14, isUnsigned: true)
!721 = !DIEnumerator(name: "MODE_VECTOR_ACCUM", value: 15, isUnsigned: true)
!722 = !DIEnumerator(name: "MODE_VECTOR_UACCUM", value: 16, isUnsigned: true)
!723 = !DIEnumerator(name: "MODE_VECTOR_FLOAT", value: 17, isUnsigned: true)
!724 = !DIEnumerator(name: "MAX_MODE_CLASS", value: 18, isUnsigned: true)
!725 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "undo_kind", file: !3, line: 345, baseType: !7, size: 32, elements: !726)
!726 = !{!727, !728, !729}
!727 = !DIEnumerator(name: "UNDO_RTX", value: 0, isUnsigned: true)
!728 = !DIEnumerator(name: "UNDO_INT", value: 1, isUnsigned: true)
!729 = !DIEnumerator(name: "UNDO_MODE", value: 2, isUnsigned: true)
!730 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "reg_note", file: !561, line: 836, baseType: !7, size: 32, elements: !731)
!731 = !{!732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763}
!732 = !DIEnumerator(name: "REG_DEP_TRUE", value: 0, isUnsigned: true)
!733 = !DIEnumerator(name: "REG_DEAD", value: 1, isUnsigned: true)
!734 = !DIEnumerator(name: "REG_INC", value: 2, isUnsigned: true)
!735 = !DIEnumerator(name: "REG_EQUIV", value: 3, isUnsigned: true)
!736 = !DIEnumerator(name: "REG_EQUAL", value: 4, isUnsigned: true)
!737 = !DIEnumerator(name: "REG_NONNEG", value: 5, isUnsigned: true)
!738 = !DIEnumerator(name: "REG_UNUSED", value: 6, isUnsigned: true)
!739 = !DIEnumerator(name: "REG_CC_SETTER", value: 7, isUnsigned: true)
!740 = !DIEnumerator(name: "REG_CC_USER", value: 8, isUnsigned: true)
!741 = !DIEnumerator(name: "REG_LABEL_TARGET", value: 9, isUnsigned: true)
!742 = !DIEnumerator(name: "REG_LABEL_OPERAND", value: 10, isUnsigned: true)
!743 = !DIEnumerator(name: "REG_DEP_OUTPUT", value: 11, isUnsigned: true)
!744 = !DIEnumerator(name: "REG_DEP_ANTI", value: 12, isUnsigned: true)
!745 = !DIEnumerator(name: "REG_BR_PROB", value: 13, isUnsigned: true)
!746 = !DIEnumerator(name: "REG_VALUE_PROFILE", value: 14, isUnsigned: true)
!747 = !DIEnumerator(name: "REG_NOALIAS", value: 15, isUnsigned: true)
!748 = !DIEnumerator(name: "REG_BR_PRED", value: 16, isUnsigned: true)
!749 = !DIEnumerator(name: "REG_FRAME_RELATED_EXPR", value: 17, isUnsigned: true)
!750 = !DIEnumerator(name: "REG_CFA_DEF_CFA", value: 18, isUnsigned: true)
!751 = !DIEnumerator(name: "REG_CFA_ADJUST_CFA", value: 19, isUnsigned: true)
!752 = !DIEnumerator(name: "REG_CFA_OFFSET", value: 20, isUnsigned: true)
!753 = !DIEnumerator(name: "REG_CFA_REGISTER", value: 21, isUnsigned: true)
!754 = !DIEnumerator(name: "REG_CFA_RESTORE", value: 22, isUnsigned: true)
!755 = !DIEnumerator(name: "REG_CFA_SET_VDRAP", value: 23, isUnsigned: true)
!756 = !DIEnumerator(name: "REG_EH_CONTEXT", value: 24, isUnsigned: true)
!757 = !DIEnumerator(name: "REG_EH_REGION", value: 25, isUnsigned: true)
!758 = !DIEnumerator(name: "REG_SAVE_NOTE", value: 26, isUnsigned: true)
!759 = !DIEnumerator(name: "REG_NORETURN", value: 27, isUnsigned: true)
!760 = !DIEnumerator(name: "REG_NON_LOCAL_GOTO", value: 28, isUnsigned: true)
!761 = !DIEnumerator(name: "REG_CROSSING_JUMP", value: 29, isUnsigned: true)
!762 = !DIEnumerator(name: "REG_SETJMP", value: 30, isUnsigned: true)
!763 = !DIEnumerator(name: "REG_NOTE_MAX", value: 31, isUnsigned: true)
!764 = !{!765, !766, !767, !768, !771, !772, !774, !7, !560, !775, !1846, !776, !5, !703, !1847, !1856, !183, !846, !863, !730, !1884, !1886, !1892}
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!767 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !770)
!774 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !777, line: 50, baseType: !778)
!777 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !561, line: 240, size: 384, elements: !780)
!780 = !{!781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !779, file: !561, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !779, file: !561, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !779, file: !561, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !779, file: !561, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !779, file: !561, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !779, file: !561, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !779, file: !561, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !779, file: !561, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !779, file: !561, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !779, file: !561, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !779, file: !561, line: 321, baseType: !792, size: 320, offset: 64)
!792 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !561, line: 315, size: 320, elements: !793)
!793 = !{!794, !1781, !1783, !1844, !1845}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !792, file: !561, line: 316, baseType: !795, size: 64)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !796, size: 64, elements: !811)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !561, line: 183, baseType: !797)
!797 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !561, line: 166, size: 64, elements: !798)
!798 = !{!799, !800, !801, !802, !803, !813, !814, !826, !829, !891, !1759, !1760, !1771, !1778}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !797, file: !561, line: 168, baseType: !767, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !797, file: !561, line: 169, baseType: !7, size: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !797, file: !561, line: 170, baseType: !772, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !797, file: !561, line: 171, baseType: !776, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !797, file: !561, line: 172, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !777, line: 53, baseType: !805)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !561, line: 359, size: 128, elements: !807)
!807 = !{!808, !809}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !806, file: !561, line: 360, baseType: !767, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !806, file: !561, line: 361, baseType: !810, size: 64, offset: 64)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !776, size: 64, elements: !811)
!811 = !{!812}
!812 = !DISubrange(count: 1)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !797, file: !561, line: 173, baseType: !5, size: 32)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !797, file: !561, line: 174, baseType: !815, size: 32)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !561, line: 133, baseType: !816)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !561, line: 115, size: 32, elements: !817)
!817 = !{!818, !819, !820, !821, !822, !823, !824, !825}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !816, file: !561, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !816, file: !561, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !816, file: !561, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !816, file: !561, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !816, file: !561, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !816, file: !561, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !816, file: !561, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !816, file: !561, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !797, file: !561, line: 175, baseType: !827, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !561, line: 175, flags: DIFlagFwdDecl)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !797, file: !561, line: 176, baseType: !830, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !832, line: 75, size: 256, elements: !833)
!832 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!833 = !{!834, !849, !850, !851}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !831, file: !832, line: 76, baseType: !835, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !832, line: 68, baseType: !837)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !832, line: 63, size: 320, elements: !838)
!838 = !{!839, !841, !842, !843}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !837, file: !832, line: 64, baseType: !840, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !837, file: !832, line: 65, baseType: !840, size: 64, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !837, file: !832, line: 66, baseType: !7, size: 32, offset: 128)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !837, file: !832, line: 67, baseType: !844, size: 128, offset: 192)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !845, size: 128, elements: !847)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !832, line: 29, baseType: !846)
!846 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!847 = !{!848}
!848 = !DISubrange(count: 2)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !831, file: !832, line: 77, baseType: !835, size: 64, offset: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !831, file: !832, line: 78, baseType: !7, size: 32, offset: 128)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !831, file: !832, line: 79, baseType: !852, size: 64, offset: 192)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !832, line: 49, baseType: !854)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !832, line: 45, size: 832, elements: !855)
!855 = !{!856, !857, !858}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !854, file: !832, line: 46, baseType: !840, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !854, file: !832, line: 47, baseType: !830, size: 64, offset: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !854, file: !832, line: 48, baseType: !859, size: 704, offset: 128)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !860, line: 164, size: 704, elements: !861)
!860 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!861 = !{!862, !864, !874, !875, !876, !877, !878, !879, !883, !887, !888, !889, !890}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !859, file: !860, line: 166, baseType: !863, size: 64)
!863 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !859, file: !860, line: 167, baseType: !865, size: 64, offset: 64)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !860, line: 157, size: 192, elements: !867)
!867 = !{!868, !869, !870}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !866, file: !860, line: 159, baseType: !769, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !866, file: !860, line: 160, baseType: !865, size: 64, offset: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !866, file: !860, line: 161, baseType: !871, size: 32, offset: 128)
!871 = !DICompositeType(tag: DW_TAG_array_type, baseType: !770, size: 32, elements: !872)
!872 = !{!873}
!873 = !DISubrange(count: 4)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !859, file: !860, line: 168, baseType: !769, size: 64, offset: 128)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !859, file: !860, line: 169, baseType: !769, size: 64, offset: 192)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !859, file: !860, line: 170, baseType: !769, size: 64, offset: 256)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !859, file: !860, line: 171, baseType: !863, size: 64, offset: 320)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !859, file: !860, line: 172, baseType: !767, size: 32, offset: 384)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !859, file: !860, line: 176, baseType: !880, size: 64, offset: 448)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DISubroutineType(types: !882)
!882 = !{!865, !771, !863}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !859, file: !860, line: 177, baseType: !884, size: 64, offset: 512)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DISubroutineType(types: !886)
!886 = !{null, !771, !865}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !859, file: !860, line: 178, baseType: !771, size: 64, offset: 576)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !859, file: !860, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !859, file: !860, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !859, file: !860, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !797, file: !561, line: 177, baseType: !892, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !777, line: 56, baseType: !893)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !151, line: 3371, size: 1792, elements: !895)
!895 = !{!896, !929, !935, !946, !965, !976, !981, !988, !994, !1007, !1019, !1057, !1062, !1090, !1098, !1099, !1104, !1113, !1119, !1124, !1128, !1132, !1383, !1432, !1438, !1445, !1452, !1478, !1503, !1520, !1532, !1554, !1569, !1741}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !894, file: !151, line: 3372, baseType: !897, size: 64)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !151, line: 360, size: 64, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !897, file: !151, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !897, file: !151, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !897, file: !151, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !897, file: !151, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !897, file: !151, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !897, file: !151, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !897, file: !151, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !897, file: !151, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !897, file: !151, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !897, file: !151, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !897, file: !151, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !897, file: !151, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !897, file: !151, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !897, file: !151, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !897, file: !151, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !897, file: !151, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !897, file: !151, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !897, file: !151, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !897, file: !151, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !897, file: !151, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !897, file: !151, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !897, file: !151, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !897, file: !151, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !897, file: !151, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !897, file: !151, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !897, file: !151, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !897, file: !151, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !897, file: !151, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !897, file: !151, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !897, file: !151, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !894, file: !151, line: 3373, baseType: !930, size: 192)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !151, line: 402, size: 192, elements: !931)
!931 = !{!932, !933, !934}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !930, file: !151, line: 403, baseType: !897, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !930, file: !151, line: 404, baseType: !892, size: 64, offset: 64)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !930, file: !151, line: 405, baseType: !892, size: 64, offset: 128)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !894, file: !151, line: 3374, baseType: !936, size: 320)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !151, line: 1384, size: 320, elements: !937)
!937 = !{!938, !939}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !936, file: !151, line: 1385, baseType: !930, size: 192)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !936, file: !151, line: 1386, baseType: !940, size: 128, offset: 192)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !941, line: 58, baseType: !942)
!941 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !941, line: 54, size: 128, elements: !943)
!943 = !{!944, !945}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !942, file: !941, line: 56, baseType: !846, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !942, file: !941, line: 57, baseType: !863, size: 64, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !894, file: !151, line: 3375, baseType: !947, size: 256)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !151, line: 1397, size: 256, elements: !948)
!948 = !{!949, !950}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !947, file: !151, line: 1398, baseType: !930, size: 192)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !947, file: !151, line: 1399, baseType: !951, size: 64, offset: 192)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !953, line: 52, size: 256, elements: !954)
!953 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!954 = !{!955, !956, !957, !958, !959, !960, !961}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !952, file: !953, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !952, file: !953, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !952, file: !953, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !952, file: !953, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !952, file: !953, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !952, file: !953, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !952, file: !953, line: 62, baseType: !962, size: 192, offset: 64)
!962 = !DICompositeType(tag: DW_TAG_array_type, baseType: !846, size: 192, elements: !963)
!963 = !{!964}
!964 = !DISubrange(count: 3)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !894, file: !151, line: 3376, baseType: !966, size: 256)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !151, line: 1408, size: 256, elements: !967)
!967 = !{!968, !969}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !966, file: !151, line: 1409, baseType: !930, size: 192)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !966, file: !151, line: 1410, baseType: !970, size: 64, offset: 192)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !972, line: 27, size: 192, elements: !973)
!972 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!973 = !{!974, !975}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !971, file: !972, line: 29, baseType: !940, size: 128)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !971, file: !972, line: 30, baseType: !5, size: 32, offset: 128)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !894, file: !151, line: 3377, baseType: !977, size: 256)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !151, line: 1437, size: 256, elements: !978)
!978 = !{!979, !980}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !977, file: !151, line: 1438, baseType: !930, size: 192)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !977, file: !151, line: 1439, baseType: !892, size: 64, offset: 192)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !894, file: !151, line: 3378, baseType: !982, size: 256)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !151, line: 1418, size: 256, elements: !983)
!983 = !{!984, !985, !986}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !982, file: !151, line: 1419, baseType: !930, size: 192)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !982, file: !151, line: 1420, baseType: !767, size: 32, offset: 192)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !982, file: !151, line: 1421, baseType: !987, size: 8, offset: 224)
!987 = !DICompositeType(tag: DW_TAG_array_type, baseType: !770, size: 8, elements: !811)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !894, file: !151, line: 3379, baseType: !989, size: 320)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !151, line: 1428, size: 320, elements: !990)
!990 = !{!991, !992, !993}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !989, file: !151, line: 1429, baseType: !930, size: 192)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !989, file: !151, line: 1430, baseType: !892, size: 64, offset: 192)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !989, file: !151, line: 1431, baseType: !892, size: 64, offset: 256)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !894, file: !151, line: 3380, baseType: !995, size: 320)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !151, line: 1460, size: 320, elements: !996)
!996 = !{!997, !998}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !995, file: !151, line: 1461, baseType: !930, size: 192)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !995, file: !151, line: 1462, baseType: !999, size: 128, offset: 192)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1000, line: 31, size: 128, elements: !1001)
!1000 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1001 = !{!1002, !1005, !1006}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !999, file: !1000, line: 32, baseType: !1003, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !766)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !999, file: !1000, line: 33, baseType: !7, size: 32, offset: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !999, file: !1000, line: 34, baseType: !7, size: 32, offset: 96)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !894, file: !151, line: 3381, baseType: !1008, size: 384)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !151, line: 2507, size: 384, elements: !1009)
!1009 = !{!1010, !1011, !1016, !1017, !1018}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1008, file: !151, line: 2508, baseType: !930, size: 192)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1008, file: !151, line: 2509, baseType: !1012, size: 32, offset: 192)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1013, line: 58, baseType: !1014)
!1013 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1015, line: 44, baseType: !7)
!1015 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1008, file: !151, line: 2510, baseType: !7, size: 32, offset: 224)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1008, file: !151, line: 2511, baseType: !892, size: 64, offset: 256)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1008, file: !151, line: 2512, baseType: !892, size: 64, offset: 320)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !894, file: !151, line: 3382, baseType: !1020, size: 896)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !151, line: 2652, size: 896, elements: !1021)
!1021 = !{!1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1020, file: !151, line: 2653, baseType: !1008, size: 384)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1020, file: !151, line: 2654, baseType: !892, size: 64, offset: 384)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1020, file: !151, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1020, file: !151, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1020, file: !151, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1020, file: !151, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1020, file: !151, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1020, file: !151, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1020, file: !151, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1020, file: !151, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1020, file: !151, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1020, file: !151, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1020, file: !151, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1020, file: !151, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1020, file: !151, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1020, file: !151, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1020, file: !151, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1020, file: !151, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1020, file: !151, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1020, file: !151, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1020, file: !151, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1020, file: !151, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1020, file: !151, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1020, file: !151, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1020, file: !151, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1020, file: !151, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1020, file: !151, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1020, file: !151, line: 2703, baseType: !7, size: 32, offset: 512)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1020, file: !151, line: 2705, baseType: !892, size: 64, offset: 576)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1020, file: !151, line: 2706, baseType: !892, size: 64, offset: 640)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1020, file: !151, line: 2707, baseType: !892, size: 64, offset: 704)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1020, file: !151, line: 2708, baseType: !892, size: 64, offset: 768)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1020, file: !151, line: 2711, baseType: !1055, size: 64, offset: 832)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !151, line: 2711, flags: DIFlagFwdDecl)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !894, file: !151, line: 3383, baseType: !1058, size: 960)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !151, line: 2756, size: 960, elements: !1059)
!1059 = !{!1060, !1061}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1058, file: !151, line: 2757, baseType: !1020, size: 896)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1058, file: !151, line: 2758, baseType: !776, size: 64, offset: 896)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !894, file: !151, line: 3384, baseType: !1063, size: 1472)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !151, line: 3114, size: 1472, elements: !1064)
!1064 = !{!1065, !1086, !1087, !1088, !1089}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1063, file: !151, line: 3115, baseType: !1066, size: 1216)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !151, line: 2984, size: 1216, elements: !1067)
!1067 = !{!1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1066, file: !151, line: 2985, baseType: !1058, size: 960)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1066, file: !151, line: 2986, baseType: !892, size: 64, offset: 960)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1066, file: !151, line: 2987, baseType: !892, size: 64, offset: 1024)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1066, file: !151, line: 2988, baseType: !892, size: 64, offset: 1088)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1066, file: !151, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1066, file: !151, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1066, file: !151, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1066, file: !151, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1066, file: !151, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1066, file: !151, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1066, file: !151, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1066, file: !151, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1066, file: !151, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1066, file: !151, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1066, file: !151, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1066, file: !151, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1066, file: !151, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1066, file: !151, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1063, file: !151, line: 3117, baseType: !892, size: 64, offset: 1216)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1063, file: !151, line: 3119, baseType: !892, size: 64, offset: 1280)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1063, file: !151, line: 3121, baseType: !892, size: 64, offset: 1344)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1063, file: !151, line: 3123, baseType: !892, size: 64, offset: 1408)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !894, file: !151, line: 3385, baseType: !1091, size: 1088)
!1091 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !151, line: 2874, size: 1088, elements: !1092)
!1092 = !{!1093, !1094, !1095}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1091, file: !151, line: 2875, baseType: !1058, size: 960)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1091, file: !151, line: 2876, baseType: !776, size: 64, offset: 960)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1091, file: !151, line: 2877, baseType: !1096, size: 64, offset: 1024)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1097 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !151, line: 2856, flags: DIFlagFwdDecl)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !894, file: !151, line: 3386, baseType: !1066, size: 1216)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !894, file: !151, line: 3387, baseType: !1100, size: 1280)
!1100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !151, line: 3093, size: 1280, elements: !1101)
!1101 = !{!1102, !1103}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1100, file: !151, line: 3094, baseType: !1066, size: 1216)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1100, file: !151, line: 3095, baseType: !1096, size: 64, offset: 1216)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !894, file: !151, line: 3388, baseType: !1105, size: 1216)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !151, line: 2824, size: 1216, elements: !1106)
!1106 = !{!1107, !1108, !1109, !1110, !1111, !1112}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1105, file: !151, line: 2825, baseType: !1020, size: 896)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1105, file: !151, line: 2827, baseType: !892, size: 64, offset: 896)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1105, file: !151, line: 2828, baseType: !892, size: 64, offset: 960)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1105, file: !151, line: 2829, baseType: !892, size: 64, offset: 1024)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1105, file: !151, line: 2830, baseType: !892, size: 64, offset: 1088)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1105, file: !151, line: 2831, baseType: !892, size: 64, offset: 1152)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !894, file: !151, line: 3389, baseType: !1114, size: 1024)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !151, line: 2850, size: 1024, elements: !1115)
!1115 = !{!1116, !1117, !1118}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1114, file: !151, line: 2851, baseType: !1058, size: 960)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1114, file: !151, line: 2852, baseType: !767, size: 32, offset: 960)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1114, file: !151, line: 2853, baseType: !767, size: 32, offset: 992)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !894, file: !151, line: 3390, baseType: !1120, size: 1024)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !151, line: 2857, size: 1024, elements: !1121)
!1121 = !{!1122, !1123}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1120, file: !151, line: 2858, baseType: !1058, size: 960)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1120, file: !151, line: 2859, baseType: !1096, size: 64, offset: 960)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !894, file: !151, line: 3391, baseType: !1125, size: 960)
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !151, line: 2862, size: 960, elements: !1126)
!1126 = !{!1127}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1125, file: !151, line: 2863, baseType: !1058, size: 960)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !894, file: !151, line: 3392, baseType: !1129, size: 1472)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !151, line: 3304, size: 1472, elements: !1130)
!1130 = !{!1131}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1129, file: !151, line: 3305, baseType: !1063, size: 1472)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !894, file: !151, line: 3393, baseType: !1133, size: 1792)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !151, line: 3248, size: 1792, elements: !1134)
!1134 = !{!1135, !1136, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1133, file: !151, line: 3249, baseType: !1063, size: 1472)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1133, file: !151, line: 3251, baseType: !1137, size: 64, offset: 1472)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1139, line: 463, size: 1152, elements: !1140)
!1139 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1140 = !{!1141, !1144, !1248, !1249, !1252, !1255, !1307, !1308, !1309, !1310, !1311, !1335, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1138, file: !1139, line: 464, baseType: !1142, size: 64)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64)
!1143 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1139, line: 464, flags: DIFlagFwdDecl)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1138, file: !1139, line: 467, baseType: !1145, size: 64, offset: 64)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !135, line: 374, size: 640, elements: !1147)
!1147 = !{!1148, !1223, !1224, !1237, !1238, !1239, !1240, !1241, !1242, !1244, !1246, !1247}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1146, file: !135, line: 377, baseType: !1149, size: 64)
!1149 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !777, line: 111, baseType: !1150)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !135, line: 217, size: 832, elements: !1152)
!1152 = !{!1153, !1188, !1189, !1190, !1193, !1197, !1198, !1199, !1217, !1218, !1219, !1220, !1221, !1222}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1151, file: !135, line: 219, baseType: !1154, size: 64)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !135, line: 151, baseType: !1156)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !135, line: 151, size: 128, elements: !1157)
!1157 = !{!1158}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1156, file: !135, line: 151, baseType: !1159, size: 128)
!1159 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !135, line: 150, baseType: !1160)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !135, line: 150, size: 128, elements: !1161)
!1161 = !{!1162, !1163, !1164}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1160, file: !135, line: 150, baseType: !7, size: 32)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1160, file: !135, line: 150, baseType: !7, size: 32, offset: 32)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1160, file: !135, line: 150, baseType: !1165, size: 64, offset: 64)
!1165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1166, size: 64, elements: !811)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !777, line: 108, baseType: !1167)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !135, line: 122, size: 512, elements: !1169)
!1169 = !{!1170, !1171, !1172, !1180, !1181, !1182, !1183, !1184, !1185, !1186}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1168, file: !135, line: 124, baseType: !1150, size: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1168, file: !135, line: 125, baseType: !1150, size: 64, offset: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1168, file: !135, line: 131, baseType: !1173, size: 64, offset: 128)
!1173 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !135, line: 128, size: 64, elements: !1174)
!1174 = !{!1175, !1179}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1173, file: !135, line: 129, baseType: !1176, size: 64)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !777, line: 66, baseType: !1177)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64)
!1178 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !777, line: 65, flags: DIFlagFwdDecl)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1173, file: !135, line: 130, baseType: !776, size: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1168, file: !135, line: 134, baseType: !771, size: 64, offset: 192)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1168, file: !135, line: 137, baseType: !892, size: 64, offset: 256)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1168, file: !135, line: 138, baseType: !1012, size: 32, offset: 320)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1168, file: !135, line: 142, baseType: !7, size: 32, offset: 352)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1168, file: !135, line: 144, baseType: !767, size: 32, offset: 384)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1168, file: !135, line: 145, baseType: !767, size: 32, offset: 416)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1168, file: !135, line: 146, baseType: !1187, size: 64, offset: 448)
!1187 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !135, line: 119, baseType: !863)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1151, file: !135, line: 220, baseType: !1154, size: 64, offset: 64)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1151, file: !135, line: 223, baseType: !771, size: 64, offset: 128)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1151, file: !135, line: 226, baseType: !1191, size: 64, offset: 192)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64)
!1192 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !135, line: 185, flags: DIFlagFwdDecl)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1151, file: !135, line: 229, baseType: !1194, size: 128, offset: 256)
!1194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1195, size: 128, elements: !847)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64)
!1196 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !135, line: 229, flags: DIFlagFwdDecl)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1151, file: !135, line: 232, baseType: !1150, size: 64, offset: 384)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1151, file: !135, line: 233, baseType: !1150, size: 64, offset: 448)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1151, file: !135, line: 238, baseType: !1200, size: 64, offset: 512)
!1200 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !135, line: 235, size: 64, elements: !1201)
!1201 = !{!1202, !1208}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1200, file: !135, line: 236, baseType: !1203, size: 64)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64)
!1204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !135, line: 273, size: 128, elements: !1205)
!1205 = !{!1206, !1207}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1204, file: !135, line: 275, baseType: !1176, size: 64)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1204, file: !135, line: 278, baseType: !1176, size: 64, offset: 64)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1200, file: !135, line: 237, baseType: !1209, size: 64)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64)
!1210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !135, line: 259, size: 320, elements: !1211)
!1211 = !{!1212, !1213, !1214, !1215, !1216}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1210, file: !135, line: 261, baseType: !776, size: 64)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1210, file: !135, line: 262, baseType: !776, size: 64, offset: 64)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1210, file: !135, line: 266, baseType: !776, size: 64, offset: 128)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1210, file: !135, line: 267, baseType: !776, size: 64, offset: 192)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1210, file: !135, line: 270, baseType: !767, size: 32, offset: 256)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1151, file: !135, line: 241, baseType: !1187, size: 64, offset: 576)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1151, file: !135, line: 244, baseType: !767, size: 32, offset: 640)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1151, file: !135, line: 247, baseType: !767, size: 32, offset: 672)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1151, file: !135, line: 250, baseType: !767, size: 32, offset: 704)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1151, file: !135, line: 253, baseType: !767, size: 32, offset: 736)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1151, file: !135, line: 256, baseType: !767, size: 32, offset: 768)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1146, file: !135, line: 378, baseType: !1149, size: 64, offset: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1146, file: !135, line: 381, baseType: !1225, size: 64, offset: 128)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64)
!1226 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !135, line: 282, baseType: !1227)
!1227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !135, line: 282, size: 128, elements: !1228)
!1228 = !{!1229}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1227, file: !135, line: 282, baseType: !1230, size: 128)
!1230 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !135, line: 281, baseType: !1231)
!1231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !135, line: 281, size: 128, elements: !1232)
!1232 = !{!1233, !1234, !1235}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1231, file: !135, line: 281, baseType: !7, size: 32)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1231, file: !135, line: 281, baseType: !7, size: 32, offset: 32)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1231, file: !135, line: 281, baseType: !1236, size: 64, offset: 64)
!1236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1149, size: 64, elements: !811)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1146, file: !135, line: 384, baseType: !767, size: 32, offset: 192)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1146, file: !135, line: 387, baseType: !767, size: 32, offset: 224)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1146, file: !135, line: 390, baseType: !767, size: 32, offset: 256)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1146, file: !135, line: 394, baseType: !1225, size: 64, offset: 320)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1146, file: !135, line: 396, baseType: !134, size: 32, offset: 384)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1146, file: !135, line: 399, baseType: !1243, size: 64, offset: 416)
!1243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 64, elements: !847)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1146, file: !135, line: 402, baseType: !1245, size: 64, offset: 480)
!1245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !847)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1146, file: !135, line: 406, baseType: !767, size: 32, offset: 544)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1146, file: !135, line: 409, baseType: !767, size: 32, offset: 576)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1138, file: !1139, line: 470, baseType: !1177, size: 64, offset: 128)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1138, file: !1139, line: 473, baseType: !1250, size: 64, offset: 192)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64)
!1251 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1139, line: 166, flags: DIFlagFwdDecl)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1138, file: !1139, line: 476, baseType: !1253, size: 64, offset: 256)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64)
!1254 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1139, line: 476, flags: DIFlagFwdDecl)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1138, file: !1139, line: 479, baseType: !1256, size: 64, offset: 320)
!1256 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1257, line: 144, baseType: !1258)
!1257 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64)
!1259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1257, line: 100, size: 896, elements: !1260)
!1260 = !{!1261, !1269, !1274, !1279, !1281, !1284, !1285, !1286, !1287, !1288, !1293, !1295, !1296, !1301, !1306}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1259, file: !1257, line: 102, baseType: !1262, size: 64)
!1262 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1257, line: 52, baseType: !1263)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64)
!1264 = !DISubroutineType(types: !1265)
!1265 = !{!1266, !1267}
!1266 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1257, line: 47, baseType: !7)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64)
!1268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1259, file: !1257, line: 105, baseType: !1270, size: 64, offset: 64)
!1270 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1257, line: 59, baseType: !1271)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64)
!1272 = !DISubroutineType(types: !1273)
!1273 = !{!767, !1267, !1267}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1259, file: !1257, line: 108, baseType: !1275, size: 64, offset: 128)
!1275 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1257, line: 63, baseType: !1276)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64)
!1277 = !DISubroutineType(types: !1278)
!1278 = !{null, !771}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1259, file: !1257, line: 111, baseType: !1280, size: 64, offset: 192)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1259, file: !1257, line: 114, baseType: !1282, size: 64, offset: 256)
!1282 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1283, line: 46, baseType: !846)
!1283 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1259, file: !1257, line: 117, baseType: !1282, size: 64, offset: 320)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1259, file: !1257, line: 120, baseType: !1282, size: 64, offset: 384)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1259, file: !1257, line: 124, baseType: !7, size: 32, offset: 448)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1259, file: !1257, line: 128, baseType: !7, size: 32, offset: 480)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1259, file: !1257, line: 131, baseType: !1289, size: 64, offset: 512)
!1289 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1257, line: 75, baseType: !1290)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64)
!1291 = !DISubroutineType(types: !1292)
!1292 = !{!771, !1282, !1282}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1259, file: !1257, line: 132, baseType: !1294, size: 64, offset: 576)
!1294 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1257, line: 78, baseType: !1276)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1259, file: !1257, line: 135, baseType: !771, size: 64, offset: 640)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1259, file: !1257, line: 136, baseType: !1297, size: 64, offset: 704)
!1297 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1257, line: 82, baseType: !1298)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64)
!1299 = !DISubroutineType(types: !1300)
!1300 = !{!771, !771, !1282, !1282}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1259, file: !1257, line: 137, baseType: !1302, size: 64, offset: 768)
!1302 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1257, line: 83, baseType: !1303)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64)
!1304 = !DISubroutineType(types: !1305)
!1305 = !{null, !771, !771}
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1259, file: !1257, line: 141, baseType: !7, size: 32, offset: 832)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1138, file: !1139, line: 484, baseType: !892, size: 64, offset: 384)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1138, file: !1139, line: 488, baseType: !892, size: 64, offset: 448)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1138, file: !1139, line: 493, baseType: !892, size: 64, offset: 512)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1138, file: !1139, line: 496, baseType: !892, size: 64, offset: 576)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1138, file: !1139, line: 501, baseType: !1312, size: 64, offset: 640)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64)
!1313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !146, line: 2355, size: 576, elements: !1314)
!1314 = !{!1315, !1318, !1319, !1320, !1321, !1323, !1324, !1329, !1330, !1331, !1332, !1333, !1334}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1313, file: !146, line: 2356, baseType: !1316, size: 64)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64)
!1317 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !146, line: 2356, flags: DIFlagFwdDecl)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1313, file: !146, line: 2357, baseType: !772, size: 64, offset: 64)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1313, file: !146, line: 2358, baseType: !767, size: 32, offset: 128)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1313, file: !146, line: 2359, baseType: !767, size: 32, offset: 160)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1313, file: !146, line: 2360, baseType: !1322, size: 128, offset: 192)
!1322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !767, size: 128, elements: !872)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1313, file: !146, line: 2364, baseType: !767, size: 32, offset: 320)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1313, file: !146, line: 2367, baseType: !1325, size: 128, offset: 384)
!1325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !146, line: 2349, size: 128, elements: !1326)
!1326 = !{!1327, !1328}
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1325, file: !146, line: 2351, baseType: !776, size: 64)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1325, file: !146, line: 2352, baseType: !863, size: 64, offset: 64)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1313, file: !146, line: 2371, baseType: !145, size: 32, offset: 512)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1313, file: !146, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1313, file: !146, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1313, file: !146, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1313, file: !146, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1313, file: !146, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1138, file: !1139, line: 504, baseType: !1336, size: 64, offset: 704)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64)
!1337 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1139, line: 504, flags: DIFlagFwdDecl)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1138, file: !1139, line: 507, baseType: !1256, size: 64, offset: 768)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1138, file: !1139, line: 510, baseType: !767, size: 32, offset: 832)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1138, file: !1139, line: 513, baseType: !767, size: 32, offset: 864)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1138, file: !1139, line: 516, baseType: !1012, size: 32, offset: 896)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1138, file: !1139, line: 519, baseType: !1012, size: 32, offset: 928)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1138, file: !1139, line: 522, baseType: !7, size: 32, offset: 960)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1138, file: !1139, line: 523, baseType: !7, size: 32, offset: 992)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1138, file: !1139, line: 528, baseType: !772, size: 64, offset: 1024)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1138, file: !1139, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1138, file: !1139, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1138, file: !1139, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1138, file: !1139, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1138, file: !1139, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1138, file: !1139, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1138, file: !1139, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1138, file: !1139, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1138, file: !1139, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1138, file: !1139, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1138, file: !1139, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1138, file: !1139, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1138, file: !1139, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1138, file: !1139, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1138, file: !1139, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1138, file: !1139, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1133, file: !151, line: 3254, baseType: !892, size: 64, offset: 1536)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1133, file: !151, line: 3257, baseType: !892, size: 64, offset: 1600)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1133, file: !151, line: 3258, baseType: !892, size: 64, offset: 1664)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1133, file: !151, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1133, file: !151, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1133, file: !151, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1133, file: !151, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1133, file: !151, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1133, file: !151, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1133, file: !151, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1133, file: !151, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1133, file: !151, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1133, file: !151, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1133, file: !151, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1133, file: !151, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1133, file: !151, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1133, file: !151, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1133, file: !151, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1133, file: !151, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1133, file: !151, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1133, file: !151, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !894, file: !151, line: 3394, baseType: !1384, size: 1344)
!1384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !151, line: 2279, size: 1344, elements: !1385)
!1385 = !{!1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1411, !1412, !1413, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429}
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1384, file: !151, line: 2280, baseType: !930, size: 192)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1384, file: !151, line: 2281, baseType: !892, size: 64, offset: 192)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1384, file: !151, line: 2282, baseType: !892, size: 64, offset: 256)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1384, file: !151, line: 2283, baseType: !892, size: 64, offset: 320)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1384, file: !151, line: 2284, baseType: !892, size: 64, offset: 384)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1384, file: !151, line: 2285, baseType: !7, size: 32, offset: 448)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1384, file: !151, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1384, file: !151, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1384, file: !151, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1384, file: !151, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1384, file: !151, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1384, file: !151, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1384, file: !151, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1384, file: !151, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1384, file: !151, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1384, file: !151, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1384, file: !151, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1384, file: !151, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1384, file: !151, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1384, file: !151, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1384, file: !151, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1384, file: !151, line: 2305, baseType: !7, size: 32, offset: 512)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1384, file: !151, line: 2306, baseType: !1409, size: 32, offset: 544)
!1409 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1410, line: 31, baseType: !767)
!1410 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1384, file: !151, line: 2307, baseType: !892, size: 64, offset: 576)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1384, file: !151, line: 2308, baseType: !892, size: 64, offset: 640)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1384, file: !151, line: 2314, baseType: !1414, size: 64, offset: 704)
!1414 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !151, line: 2309, size: 64, elements: !1415)
!1415 = !{!1416, !1417, !1418}
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1414, file: !151, line: 2310, baseType: !767, size: 32)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1414, file: !151, line: 2311, baseType: !772, size: 64)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1414, file: !151, line: 2312, baseType: !1419, size: 64)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64)
!1420 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !151, line: 2277, flags: DIFlagFwdDecl)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1384, file: !151, line: 2315, baseType: !892, size: 64, offset: 768)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1384, file: !151, line: 2316, baseType: !892, size: 64, offset: 832)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1384, file: !151, line: 2317, baseType: !892, size: 64, offset: 896)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1384, file: !151, line: 2318, baseType: !892, size: 64, offset: 960)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1384, file: !151, line: 2319, baseType: !892, size: 64, offset: 1024)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1384, file: !151, line: 2320, baseType: !892, size: 64, offset: 1088)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1384, file: !151, line: 2321, baseType: !892, size: 64, offset: 1152)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1384, file: !151, line: 2322, baseType: !892, size: 64, offset: 1216)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1384, file: !151, line: 2324, baseType: !1430, size: 64, offset: 1280)
!1430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1431, size: 64)
!1431 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !151, line: 2324, flags: DIFlagFwdDecl)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !894, file: !151, line: 3395, baseType: !1433, size: 320)
!1433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !151, line: 1469, size: 320, elements: !1434)
!1434 = !{!1435, !1436, !1437}
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1433, file: !151, line: 1470, baseType: !930, size: 192)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1433, file: !151, line: 1471, baseType: !892, size: 64, offset: 192)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1433, file: !151, line: 1472, baseType: !892, size: 64, offset: 256)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !894, file: !151, line: 3396, baseType: !1439, size: 320)
!1439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !151, line: 1482, size: 320, elements: !1440)
!1440 = !{!1441, !1442, !1443}
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1439, file: !151, line: 1483, baseType: !930, size: 192)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1439, file: !151, line: 1484, baseType: !767, size: 32, offset: 192)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1439, file: !151, line: 1485, baseType: !1444, size: 64, offset: 256)
!1444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !892, size: 64, elements: !811)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !894, file: !151, line: 3397, baseType: !1446, size: 384)
!1446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !151, line: 1829, size: 384, elements: !1447)
!1447 = !{!1448, !1449, !1450, !1451}
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1446, file: !151, line: 1830, baseType: !930, size: 192)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1446, file: !151, line: 1831, baseType: !1012, size: 32, offset: 192)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1446, file: !151, line: 1832, baseType: !892, size: 64, offset: 256)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1446, file: !151, line: 1835, baseType: !1444, size: 64, offset: 320)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !894, file: !151, line: 3398, baseType: !1453, size: 704)
!1453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !151, line: 1898, size: 704, elements: !1454)
!1454 = !{!1455, !1456, !1457, !1461, !1462, !1465}
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1453, file: !151, line: 1899, baseType: !930, size: 192)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1453, file: !151, line: 1902, baseType: !892, size: 64, offset: 192)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1453, file: !151, line: 1905, baseType: !1458, size: 64, offset: 256)
!1458 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !777, line: 58, baseType: !1459)
!1459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1460, size: 64)
!1460 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !777, line: 57, flags: DIFlagFwdDecl)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1453, file: !151, line: 1908, baseType: !7, size: 32, offset: 320)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1453, file: !151, line: 1911, baseType: !1463, size: 64, offset: 384)
!1463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1464, size: 64)
!1464 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !151, line: 1876, flags: DIFlagFwdDecl)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1453, file: !151, line: 1914, baseType: !1466, size: 256, offset: 448)
!1466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !151, line: 1883, size: 256, elements: !1467)
!1467 = !{!1468, !1470, !1471, !1476}
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1466, file: !151, line: 1884, baseType: !1469, size: 64)
!1469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1466, file: !151, line: 1885, baseType: !1469, size: 64, offset: 64)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1466, file: !151, line: 1891, baseType: !1472, size: 64, offset: 128)
!1472 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1466, file: !151, line: 1891, size: 64, elements: !1473)
!1473 = !{!1474, !1475}
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1472, file: !151, line: 1891, baseType: !1458, size: 64)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1472, file: !151, line: 1891, baseType: !892, size: 64)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1466, file: !151, line: 1892, baseType: !1477, size: 64, offset: 192)
!1477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !894, file: !151, line: 3399, baseType: !1479, size: 704)
!1479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !151, line: 2008, size: 704, elements: !1480)
!1480 = !{!1481, !1482, !1483, !1484, !1485, !1486, !1498, !1499, !1500, !1501, !1502}
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1479, file: !151, line: 2009, baseType: !930, size: 192)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1479, file: !151, line: 2011, baseType: !7, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !1479, file: !151, line: 2012, baseType: !7, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1479, file: !151, line: 2014, baseType: !1012, size: 32, offset: 224)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1479, file: !151, line: 2016, baseType: !892, size: 64, offset: 256)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !1479, file: !151, line: 2017, baseType: !1487, size: 64, offset: 320)
!1487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1488, size: 64)
!1488 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !151, line: 183, baseType: !1489)
!1489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !151, line: 183, size: 128, elements: !1490)
!1490 = !{!1491}
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1489, file: !151, line: 183, baseType: !1492, size: 128)
!1492 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !151, line: 182, baseType: !1493)
!1493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !151, line: 182, size: 128, elements: !1494)
!1494 = !{!1495, !1496, !1497}
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1493, file: !151, line: 182, baseType: !7, size: 32)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1493, file: !151, line: 182, baseType: !7, size: 32, offset: 32)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1493, file: !151, line: 182, baseType: !1444, size: 64, offset: 64)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !1479, file: !151, line: 2019, baseType: !892, size: 64, offset: 384)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !1479, file: !151, line: 2020, baseType: !892, size: 64, offset: 448)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1479, file: !151, line: 2021, baseType: !892, size: 64, offset: 512)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !1479, file: !151, line: 2022, baseType: !892, size: 64, offset: 576)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !1479, file: !151, line: 2023, baseType: !892, size: 64, offset: 640)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !894, file: !151, line: 3400, baseType: !1504, size: 832)
!1504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !151, line: 2430, size: 832, elements: !1505)
!1505 = !{!1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515}
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1504, file: !151, line: 2431, baseType: !930, size: 192)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1504, file: !151, line: 2433, baseType: !892, size: 64, offset: 192)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !1504, file: !151, line: 2434, baseType: !892, size: 64, offset: 256)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !1504, file: !151, line: 2435, baseType: !892, size: 64, offset: 320)
