; ModuleID = 'combine-stack-adj.bc'
source_filename = "combine-stack-adj.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.rtl_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type { %struct.eh_region_d*, %struct.VEC_eh_region_gc*, %struct.VEC_eh_landing_pad_gc*, %struct.htab*, %struct.VEC_tree_gc*, %union.eh_status_u }
%struct.eh_region_d = type { %struct.eh_region_d*, %struct.eh_region_d*, %struct.eh_region_d*, i32, i32, %union.eh_region_u, %struct.eh_landing_pad_d*, %struct.rtx_def*, %struct.rtx_def*, i8 }
%union.eh_region_u = type { %struct.eh_region_u_allowed }

!643 = !DIEnumerator(name: "UMAX", value: 73, isUnsigned: true)
!644 = !DIEnumerator(name: "PRE_DEC", value: 74, isUnsigned: true)
!645 = !DIEnumerator(name: "PRE_INC", value: 75, isUnsigned: true)
!646 = !DIEnumerator(name: "POST_DEC", value: 76, isUnsigned: true)
!647 = !DIEnumerator(name: "POST_INC", value: 77, isUnsigned: true)
!648 = !DIEnumerator(name: "PRE_MODIFY", value: 78, isUnsigned: true)
!649 = !DIEnumerator(name: "POST_MODIFY", value: 79, isUnsigned: true)
!650 = !DIEnumerator(name: "NE", value: 80, isUnsigned: true)
!651 = !DIEnumerator(name: "EQ", value: 81, isUnsigned: true)
!652 = !DIEnumerator(name: "GE", value: 82, isUnsigned: true)
!653 = !DIEnumerator(name: "GT", value: 83, isUnsigned: true)
!654 = !DIEnumerator(name: "LE", value: 84, isUnsigned: true)
!655 = !DIEnumerator(name: "LT", value: 85, isUnsigned: true)
!656 = !DIEnumerator(name: "GEU", value: 86, isUnsigned: true)
!657 = !DIEnumerator(name: "GTU", value: 87, isUnsigned: true)
!658 = !DIEnumerator(name: "LEU", value: 88, isUnsigned: true)
!659 = !DIEnumerator(name: "LTU", value: 89, isUnsigned: true)
!660 = !DIEnumerator(name: "UNORDERED", value: 90, isUnsigned: true)
!661 = !DIEnumerator(name: "ORDERED", value: 91, isUnsigned: true)
!662 = !DIEnumerator(name: "UNEQ", value: 92, isUnsigned: true)
!663 = !DIEnumerator(name: "UNGE", value: 93, isUnsigned: true)
!664 = !DIEnumerator(name: "UNGT", value: 94, isUnsigned: true)
!665 = !DIEnumerator(name: "UNLE", value: 95, isUnsigned: true)
!666 = !DIEnumerator(name: "UNLT", value: 96, isUnsigned: true)
!667 = !DIEnumerator(name: "LTGT", value: 97, isUnsigned: true)
!668 = !DIEnumerator(name: "SIGN_EXTEND", value: 98, isUnsigned: true)
!669 = !DIEnumerator(name: "ZERO_EXTEND", value: 99, isUnsigned: true)
!670 = !DIEnumerator(name: "TRUNCATE", value: 100, isUnsigned: true)
!671 = !DIEnumerator(name: "FLOAT_EXTEND", value: 101, isUnsigned: true)
!672 = !DIEnumerator(name: "FLOAT_TRUNCATE", value: 102, isUnsigned: true)
!673 = !DIEnumerator(name: "FLOAT", value: 103, isUnsigned: true)
!674 = !DIEnumerator(name: "FIX", value: 104, isUnsigned: true)
!675 = !DIEnumerator(name: "UNSIGNED_FLOAT", value: 105, isUnsigned: true)
!676 = !DIEnumerator(name: "UNSIGNED_FIX", value: 106, isUnsigned: true)
!677 = !DIEnumerator(name: "FRACT_CONVERT", value: 107, isUnsigned: true)
!678 = !DIEnumerator(name: "UNSIGNED_FRACT_CONVERT", value: 108, isUnsigned: true)
!679 = !DIEnumerator(name: "SAT_FRACT", value: 109, isUnsigned: true)
!680 = !DIEnumerator(name: "UNSIGNED_SAT_FRACT", value: 110, isUnsigned: true)
!681 = !DIEnumerator(name: "ABS", value: 111, isUnsigned: true)
!682 = !DIEnumerator(name: "SQRT", value: 112, isUnsigned: true)
!683 = !DIEnumerator(name: "BSWAP", value: 113, isUnsigned: true)
!684 = !DIEnumerator(name: "FFS", value: 114, isUnsigned: true)
!685 = !DIEnumerator(name: "CLZ", value: 115, isUnsigned: true)
!686 = !DIEnumerator(name: "CTZ", value: 116, isUnsigned: true)
!687 = !DIEnumerator(name: "POPCOUNT", value: 117, isUnsigned: true)
!688 = !DIEnumerator(name: "PARITY", value: 118, isUnsigned: true)
!689 = !DIEnumerator(name: "SIGN_EXTRACT", value: 119, isUnsigned: true)
!690 = !DIEnumerator(name: "ZERO_EXTRACT", value: 120, isUnsigned: true)
!691 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!692 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!693 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!694 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!695 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!696 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!697 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!698 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!699 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!700 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!701 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!702 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!703 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!704 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!705 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!706 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!707 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!708 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!709 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!710 = !{!711, !712, !713, !714, !717, !718, !720, !567, !807, !1888, !189, !1889, !1894}
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!713 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !721, line: 50, baseType: !722)
!721 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !568, line: 240, size: 384, elements: !724)
!724 = !{!725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !723, file: !568, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !723, file: !568, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !723, file: !568, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !723, file: !568, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !723, file: !568, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !723, file: !568, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !723, file: !568, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !723, file: !568, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !723, file: !568, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !723, file: !568, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !723, file: !568, line: 321, baseType: !736, size: 320, offset: 64)
!736 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !568, line: 315, size: 320, elements: !737)
!737 = !{!738, !1823, !1825, !1886, !1887}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !736, file: !568, line: 316, baseType: !739, size: 64)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !740, size: 64, elements: !755)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !568, line: 183, baseType: !741)
!741 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !568, line: 166, size: 64, elements: !742)
!742 = !{!743, !744, !745, !746, !747, !757, !758, !770, !773, !835, !1801, !1802, !1813, !1820}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !741, file: !568, line: 168, baseType: !713, size: 32)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !741, file: !568, line: 169, baseType: !7, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !741, file: !568, line: 170, baseType: !718, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !741, file: !568, line: 171, baseType: !720, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !741, file: !568, line: 172, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !721, line: 53, baseType: !749)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !568, line: 359, size: 128, elements: !751)
!751 = !{!752, !753}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !750, file: !568, line: 360, baseType: !713, size: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !750, file: !568, line: 361, baseType: !754, size: 64, offset: 64)
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !720, size: 64, elements: !755)
!755 = !{!756}
!756 = !DISubrange(count: 1)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !741, file: !568, line: 173, baseType: !189, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !741, file: !568, line: 174, baseType: !759, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !568, line: 133, baseType: !760)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !568, line: 115, size: 32, elements: !761)
!761 = !{!762, !763, !764, !765, !766, !767, !768, !769}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !760, file: !568, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !760, file: !568, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !760, file: !568, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !760, file: !568, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !760, file: !568, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !760, file: !568, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !760, file: !568, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !760, file: !568, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !741, file: !568, line: 175, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !568, line: 175, flags: DIFlagFwdDecl)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !741, file: !568, line: 176, baseType: !774, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !776, line: 75, size: 256, elements: !777)
!776 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!777 = !{!778, !793, !794, !795}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !775, file: !776, line: 76, baseType: !779, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !776, line: 68, baseType: !781)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !776, line: 63, size: 320, elements: !782)
!782 = !{!783, !785, !786, !787}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !781, file: !776, line: 64, baseType: !784, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !781, file: !776, line: 65, baseType: !784, size: 64, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !781, file: !776, line: 66, baseType: !7, size: 32, offset: 128)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !781, file: !776, line: 67, baseType: !788, size: 128, offset: 192)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !789, size: 128, elements: !791)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !776, line: 29, baseType: !790)
!790 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!791 = !{!792}
!792 = !DISubrange(count: 2)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !775, file: !776, line: 77, baseType: !779, size: 64, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !775, file: !776, line: 78, baseType: !7, size: 32, offset: 128)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !775, file: !776, line: 79, baseType: !796, size: 64, offset: 192)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !776, line: 49, baseType: !798)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !776, line: 45, size: 832, elements: !799)
!799 = !{!800, !801, !802}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !798, file: !776, line: 46, baseType: !784, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !798, file: !776, line: 47, baseType: !774, size: 64, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !798, file: !776, line: 48, baseType: !803, size: 704, offset: 128)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !804, line: 164, size: 704, elements: !805)
!804 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!805 = !{!806, !808, !818, !819, !820, !821, !822, !823, !827, !831, !832, !833, !834}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !803, file: !804, line: 166, baseType: !807, size: 64)
!807 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !803, file: !804, line: 167, baseType: !809, size: 64, offset: 64)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !804, line: 157, size: 192, elements: !811)
!811 = !{!812, !813, !814}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !810, file: !804, line: 159, baseType: !715, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !810, file: !804, line: 160, baseType: !809, size: 64, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !810, file: !804, line: 161, baseType: !815, size: 32, offset: 128)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !716, size: 32, elements: !816)
!816 = !{!817}
!817 = !DISubrange(count: 4)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !803, file: !804, line: 168, baseType: !715, size: 64, offset: 128)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !803, file: !804, line: 169, baseType: !715, size: 64, offset: 192)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !803, file: !804, line: 170, baseType: !715, size: 64, offset: 256)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !803, file: !804, line: 171, baseType: !807, size: 64, offset: 320)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !803, file: !804, line: 172, baseType: !713, size: 32, offset: 384)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !803, file: !804, line: 176, baseType: !824, size: 64, offset: 448)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DISubroutineType(types: !826)
!826 = !{!809, !717, !807}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !803, file: !804, line: 177, baseType: !828, size: 64, offset: 512)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DISubroutineType(types: !830)
!830 = !{null, !717, !809}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !803, file: !804, line: 178, baseType: !717, size: 64, offset: 576)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !803, file: !804, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !803, file: !804, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !803, file: !804, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !741, file: !568, line: 177, baseType: !836, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !721, line: 56, baseType: !837)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !341, line: 3371, size: 1792, elements: !839)
!839 = !{!840, !873, !879, !890, !909, !920, !925, !932, !938, !951, !963, !1001, !1006, !1034, !1042, !1043, !1048, !1057, !1063, !1068, !1072, !1076, !1437, !1486, !1492, !1498, !1505, !1531, !1545, !1562, !1574, !1596, !1611, !1783}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !838, file: !341, line: 3372, baseType: !841, size: 64)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !341, line: 360, size: 64, elements: !842)
!842 = !{!843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !841, file: !341, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !841, file: !341, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !841, file: !341, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !841, file: !341, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !841, file: !341, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !841, file: !341, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !841, file: !341, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !841, file: !341, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !841, file: !341, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !841, file: !341, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !841, file: !341, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !841, file: !341, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !841, file: !341, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !841, file: !341, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !841, file: !341, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !841, file: !341, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !841, file: !341, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !841, file: !341, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !841, file: !341, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !841, file: !341, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !841, file: !341, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !841, file: !341, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !841, file: !341, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !841, file: !341, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !841, file: !341, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !841, file: !341, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !841, file: !341, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !841, file: !341, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !841, file: !341, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !841, file: !341, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !838, file: !341, line: 3373, baseType: !874, size: 192)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !341, line: 402, size: 192, elements: !875)
!875 = !{!876, !877, !878}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !874, file: !341, line: 403, baseType: !841, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !874, file: !341, line: 404, baseType: !836, size: 64, offset: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !874, file: !341, line: 405, baseType: !836, size: 64, offset: 128)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !838, file: !341, line: 3374, baseType: !880, size: 320)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !341, line: 1384, size: 320, elements: !881)
!881 = !{!882, !883}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !880, file: !341, line: 1385, baseType: !874, size: 192)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !880, file: !341, line: 1386, baseType: !884, size: 128, offset: 192)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !885, line: 58, baseType: !886)
!885 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !885, line: 54, size: 128, elements: !887)
!887 = !{!888, !889}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !886, file: !885, line: 56, baseType: !790, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !886, file: !885, line: 57, baseType: !807, size: 64, offset: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !838, file: !341, line: 3375, baseType: !891, size: 256)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !341, line: 1397, size: 256, elements: !892)
!892 = !{!893, !894}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !891, file: !341, line: 1398, baseType: !874, size: 192)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !891, file: !341, line: 1399, baseType: !895, size: 64, offset: 192)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !897, line: 52, size: 256, elements: !898)
!897 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!898 = !{!899, !900, !901, !902, !903, !904, !905}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !896, file: !897, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !896, file: !897, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !896, file: !897, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !896, file: !897, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !896, file: !897, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !896, file: !897, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !896, file: !897, line: 62, baseType: !906, size: 192, offset: 64)
!906 = !DICompositeType(tag: DW_TAG_array_type, baseType: !790, size: 192, elements: !907)
!907 = !{!908}
!908 = !DISubrange(count: 3)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !838, file: !341, line: 3376, baseType: !910, size: 256)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !341, line: 1408, size: 256, elements: !911)
!911 = !{!912, !913}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !910, file: !341, line: 1409, baseType: !874, size: 192)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !910, file: !341, line: 1410, baseType: !914, size: 64, offset: 192)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !916, line: 27, size: 192, elements: !917)
!916 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!917 = !{!918, !919}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !915, file: !916, line: 29, baseType: !884, size: 128)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !915, file: !916, line: 30, baseType: !189, size: 32, offset: 128)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !838, file: !341, line: 3377, baseType: !921, size: 256)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !341, line: 1437, size: 256, elements: !922)
!922 = !{!923, !924}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !921, file: !341, line: 1438, baseType: !874, size: 192)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !921, file: !341, line: 1439, baseType: !836, size: 64, offset: 192)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !838, file: !341, line: 3378, baseType: !926, size: 256)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !341, line: 1418, size: 256, elements: !927)
!927 = !{!928, !929, !930}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !926, file: !341, line: 1419, baseType: !874, size: 192)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !926, file: !341, line: 1420, baseType: !713, size: 32, offset: 192)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !926, file: !341, line: 1421, baseType: !931, size: 8, offset: 224)
!931 = !DICompositeType(tag: DW_TAG_array_type, baseType: !716, size: 8, elements: !755)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !838, file: !341, line: 3379, baseType: !933, size: 320)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !341, line: 1428, size: 320, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !933, file: !341, line: 1429, baseType: !874, size: 192)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !933, file: !341, line: 1430, baseType: !836, size: 64, offset: 192)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !933, file: !341, line: 1431, baseType: !836, size: 64, offset: 256)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !838, file: !341, line: 3380, baseType: !939, size: 320)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !341, line: 1460, size: 320, elements: !940)
!940 = !{!941, !942}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !939, file: !341, line: 1461, baseType: !874, size: 192)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !939, file: !341, line: 1462, baseType: !943, size: 128, offset: 192)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !944, line: 31, size: 128, elements: !945)
!944 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!945 = !{!946, !949, !950}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !943, file: !944, line: 32, baseType: !947, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !712)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !943, file: !944, line: 33, baseType: !7, size: 32, offset: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !943, file: !944, line: 34, baseType: !7, size: 32, offset: 96)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !838, file: !341, line: 3381, baseType: !952, size: 384)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !341, line: 2507, size: 384, elements: !953)
!953 = !{!954, !955, !960, !961, !962}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !952, file: !341, line: 2508, baseType: !874, size: 192)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !952, file: !341, line: 2509, baseType: !956, size: 32, offset: 192)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !957, line: 58, baseType: !958)
!957 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !959, line: 44, baseType: !7)
!959 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!960 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !952, file: !341, line: 2510, baseType: !7, size: 32, offset: 224)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !952, file: !341, line: 2511, baseType: !836, size: 64, offset: 256)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !952, file: !341, line: 2512, baseType: !836, size: 64, offset: 320)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !838, file: !341, line: 3382, baseType: !964, size: 896)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !341, line: 2652, size: 896, elements: !965)
!965 = !{!966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !964, file: !341, line: 2653, baseType: !952, size: 384)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !964, file: !341, line: 2654, baseType: !836, size: 64, offset: 384)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !964, file: !341, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !964, file: !341, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !964, file: !341, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !964, file: !341, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !964, file: !341, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !964, file: !341, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !964, file: !341, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !964, file: !341, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !964, file: !341, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !964, file: !341, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !964, file: !341, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !964, file: !341, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !964, file: !341, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !964, file: !341, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !964, file: !341, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !964, file: !341, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !964, file: !341, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !964, file: !341, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !964, file: !341, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !964, file: !341, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !964, file: !341, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !964, file: !341, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !964, file: !341, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !964, file: !341, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !964, file: !341, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !964, file: !341, line: 2703, baseType: !7, size: 32, offset: 512)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !964, file: !341, line: 2705, baseType: !836, size: 64, offset: 576)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !964, file: !341, line: 2706, baseType: !836, size: 64, offset: 640)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !964, file: !341, line: 2707, baseType: !836, size: 64, offset: 704)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !964, file: !341, line: 2708, baseType: !836, size: 64, offset: 768)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !964, file: !341, line: 2711, baseType: !999, size: 64, offset: 832)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !341, line: 2711, flags: DIFlagFwdDecl)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !838, file: !341, line: 3383, baseType: !1002, size: 960)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !341, line: 2756, size: 960, elements: !1003)
!1003 = !{!1004, !1005}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1002, file: !341, line: 2757, baseType: !964, size: 896)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1002, file: !341, line: 2758, baseType: !720, size: 64, offset: 896)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !838, file: !341, line: 3384, baseType: !1007, size: 1472)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !341, line: 3114, size: 1472, elements: !1008)
!1008 = !{!1009, !1030, !1031, !1032, !1033}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1007, file: !341, line: 3115, baseType: !1010, size: 1216)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !341, line: 2984, size: 1216, elements: !1011)
!1011 = !{!1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1010, file: !341, line: 2985, baseType: !1002, size: 960)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1010, file: !341, line: 2986, baseType: !836, size: 64, offset: 960)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1010, file: !341, line: 2987, baseType: !836, size: 64, offset: 1024)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1010, file: !341, line: 2988, baseType: !836, size: 64, offset: 1088)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1010, file: !341, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1010, file: !341, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1010, file: !341, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1010, file: !341, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1010, file: !341, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1010, file: !341, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1010, file: !341, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1010, file: !341, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1010, file: !341, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1010, file: !341, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1010, file: !341, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1010, file: !341, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1010, file: !341, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1010, file: !341, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1007, file: !341, line: 3117, baseType: !836, size: 64, offset: 1216)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1007, file: !341, line: 3119, baseType: !836, size: 64, offset: 1280)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1007, file: !341, line: 3121, baseType: !836, size: 64, offset: 1344)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1007, file: !341, line: 3123, baseType: !836, size: 64, offset: 1408)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !838, file: !341, line: 3385, baseType: !1035, size: 1088)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !341, line: 2874, size: 1088, elements: !1036)
!1036 = !{!1037, !1038, !1039}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1035, file: !341, line: 2875, baseType: !1002, size: 960)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1035, file: !341, line: 2876, baseType: !720, size: 64, offset: 960)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1035, file: !341, line: 2877, baseType: !1040, size: 64, offset: 1024)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !341, line: 2856, flags: DIFlagFwdDecl)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !838, file: !341, line: 3386, baseType: !1010, size: 1216)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !838, file: !341, line: 3387, baseType: !1044, size: 1280)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !341, line: 3093, size: 1280, elements: !1045)
!1045 = !{!1046, !1047}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1044, file: !341, line: 3094, baseType: !1010, size: 1216)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1044, file: !341, line: 3095, baseType: !1040, size: 64, offset: 1216)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !838, file: !341, line: 3388, baseType: !1049, size: 1216)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !341, line: 2824, size: 1216, elements: !1050)
!1050 = !{!1051, !1052, !1053, !1054, !1055, !1056}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1049, file: !341, line: 2825, baseType: !964, size: 896)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1049, file: !341, line: 2827, baseType: !836, size: 64, offset: 896)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1049, file: !341, line: 2828, baseType: !836, size: 64, offset: 960)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1049, file: !341, line: 2829, baseType: !836, size: 64, offset: 1024)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1049, file: !341, line: 2830, baseType: !836, size: 64, offset: 1088)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1049, file: !341, line: 2831, baseType: !836, size: 64, offset: 1152)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !838, file: !341, line: 3389, baseType: !1058, size: 1024)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !341, line: 2850, size: 1024, elements: !1059)
!1059 = !{!1060, !1061, !1062}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1058, file: !341, line: 2851, baseType: !1002, size: 960)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1058, file: !341, line: 2852, baseType: !713, size: 32, offset: 960)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1058, file: !341, line: 2853, baseType: !713, size: 32, offset: 992)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !838, file: !341, line: 3390, baseType: !1064, size: 1024)
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !341, line: 2857, size: 1024, elements: !1065)
!1065 = !{!1066, !1067}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1064, file: !341, line: 2858, baseType: !1002, size: 960)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1064, file: !341, line: 2859, baseType: !1040, size: 64, offset: 960)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !838, file: !341, line: 3391, baseType: !1069, size: 960)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !341, line: 2862, size: 960, elements: !1070)
!1070 = !{!1071}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1069, file: !341, line: 2863, baseType: !1002, size: 960)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !838, file: !341, line: 3392, baseType: !1073, size: 1472)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !341, line: 3304, size: 1472, elements: !1074)
!1074 = !{!1075}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1073, file: !341, line: 3305, baseType: !1007, size: 1472)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !838, file: !341, line: 3393, baseType: !1077, size: 1792)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !341, line: 3248, size: 1792, elements: !1078)
!1078 = !{!1079, !1080, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1077, file: !341, line: 3249, baseType: !1007, size: 1472)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1077, file: !341, line: 3251, baseType: !1081, size: 64, offset: 1472)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1083, line: 463, size: 1152, elements: !1084)
!1083 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1084 = !{!1085, !1249, !1353, !1354, !1357, !1360, !1361, !1362, !1363, !1364, !1365, !1389, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1082, file: !1083, line: 464, baseType: !1086, size: 64)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !318, line: 194, size: 384, elements: !1088)
!1088 = !{!1089, !1138, !1151, !1165, !1217, !1230}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !1087, file: !318, line: 197, baseType: !1090, size: 64)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !318, line: 182, baseType: !1091)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !318, line: 116, size: 704, elements: !1093)
!1093 = !{!1094, !1095, !1096, !1097, !1098, !1099, !1126, !1135, !1136, !1137}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !1092, file: !318, line: 119, baseType: !1091, size: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1092, file: !318, line: 122, baseType: !1091, size: 64, offset: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !1092, file: !318, line: 123, baseType: !1091, size: 64, offset: 128)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1092, file: !318, line: 126, baseType: !713, size: 32, offset: 192)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1092, file: !318, line: 129, baseType: !317, size: 32, offset: 224)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1092, file: !318, line: 165, baseType: !1100, size: 192, offset: 256)
!1100 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !318, line: 132, size: 192, elements: !1101)
!1101 = !{!1102, !1115, !1121}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !1100, file: !318, line: 137, baseType: !1103, size: 128)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !318, line: 133, size: 128, elements: !1104)
!1104 = !{!1105, !1114}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !1103, file: !318, line: 135, baseType: !1106, size: 64)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !318, line: 93, size: 320, elements: !1108)
!1108 = !{!1109, !1110, !1111, !1112, !1113}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !1107, file: !318, line: 96, baseType: !1106, size: 64)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !1107, file: !318, line: 97, baseType: !1106, size: 64, offset: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1107, file: !318, line: 101, baseType: !836, size: 64, offset: 128)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !1107, file: !318, line: 106, baseType: !836, size: 64, offset: 192)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1107, file: !318, line: 111, baseType: !836, size: 64, offset: 256)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !1103, file: !318, line: 136, baseType: !1106, size: 64, offset: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !1100, file: !318, line: 151, baseType: !1116, size: 192)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !318, line: 139, size: 192, elements: !1117)
!1117 = !{!1118, !1119, !1120}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1116, file: !318, line: 141, baseType: !836, size: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1116, file: !318, line: 145, baseType: !836, size: 64, offset: 64)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1116, file: !318, line: 150, baseType: !713, size: 32, offset: 128)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !1100, file: !318, line: 164, baseType: !1122, size: 128)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !318, line: 153, size: 128, elements: !1123)
!1123 = !{!1124, !1125}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !1122, file: !318, line: 161, baseType: !836, size: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !1122, file: !318, line: 163, baseType: !956, size: 32, offset: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !1092, file: !318, line: 168, baseType: !1127, size: 64, offset: 448)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !318, line: 67, size: 320, elements: !1129)
!1129 = !{!1130, !1131, !1132, !1133, !1134}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !1128, file: !318, line: 70, baseType: !1127, size: 64)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1128, file: !318, line: 73, baseType: !1091, size: 64, offset: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !1128, file: !318, line: 78, baseType: !836, size: 64, offset: 128)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !1128, file: !318, line: 85, baseType: !720, size: 64, offset: 192)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1128, file: !318, line: 88, baseType: !713, size: 32, offset: 256)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !1092, file: !318, line: 173, baseType: !720, size: 64, offset: 512)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !1092, file: !318, line: 173, baseType: !720, size: 64, offset: 576)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !1092, file: !318, line: 177, baseType: !712, size: 8, offset: 640)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !1087, file: !318, line: 200, baseType: !1139, size: 64, offset: 64)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !318, line: 185, baseType: !1141)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !318, line: 185, size: 128, elements: !1142)
!1142 = !{!1143}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1141, file: !318, line: 185, baseType: !1144, size: 128)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !318, line: 184, baseType: !1145)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !318, line: 184, size: 128, elements: !1146)
!1146 = !{!1147, !1148, !1149}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1145, file: !318, line: 184, baseType: !7, size: 32)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1145, file: !318, line: 184, baseType: !7, size: 32, offset: 32)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1145, file: !318, line: 184, baseType: !1150, size: 64, offset: 64)
!1150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1090, size: 64, elements: !755)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !1087, file: !318, line: 203, baseType: !1152, size: 64, offset: 128)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !318, line: 189, baseType: !1154)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !318, line: 189, size: 128, elements: !1155)
!1155 = !{!1156}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1154, file: !318, line: 189, baseType: !1157, size: 128)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !318, line: 188, baseType: !1158)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !318, line: 188, size: 128, elements: !1159)
!1159 = !{!1160, !1161, !1162}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1158, file: !318, line: 188, baseType: !7, size: 32)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1158, file: !318, line: 188, baseType: !7, size: 32, offset: 32)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1158, file: !318, line: 188, baseType: !1163, size: 64, offset: 64)
!1163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1164, size: 64, elements: !755)
!1164 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !318, line: 180, baseType: !1127)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !1087, file: !318, line: 207, baseType: !1166, size: 64, offset: 192)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1167, line: 144, baseType: !1168)
!1167 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64)
!1169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1167, line: 100, size: 896, elements: !1170)
!1170 = !{!1171, !1179, !1184, !1189, !1191, !1194, !1195, !1196, !1197, !1198, !1203, !1205, !1206, !1211, !1216}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1169, file: !1167, line: 102, baseType: !1172, size: 64)
!1172 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1167, line: 52, baseType: !1173)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64)
!1174 = !DISubroutineType(types: !1175)
!1175 = !{!1176, !1177}
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1167, line: 47, baseType: !7)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64)
!1178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1169, file: !1167, line: 105, baseType: !1180, size: 64, offset: 64)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1167, line: 59, baseType: !1181)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64)
!1182 = !DISubroutineType(types: !1183)
!1183 = !{!713, !1177, !1177}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1169, file: !1167, line: 108, baseType: !1185, size: 64, offset: 128)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1167, line: 63, baseType: !1186)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64)
!1187 = !DISubroutineType(types: !1188)
!1188 = !{null, !717}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1169, file: !1167, line: 111, baseType: !1190, size: 64, offset: 192)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1169, file: !1167, line: 114, baseType: !1192, size: 64, offset: 256)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1193, line: 46, baseType: !790)
!1193 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1169, file: !1167, line: 117, baseType: !1192, size: 64, offset: 320)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1169, file: !1167, line: 120, baseType: !1192, size: 64, offset: 384)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1169, file: !1167, line: 124, baseType: !7, size: 32, offset: 448)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1169, file: !1167, line: 128, baseType: !7, size: 32, offset: 480)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1169, file: !1167, line: 131, baseType: !1199, size: 64, offset: 512)
!1199 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1167, line: 75, baseType: !1200)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64)
!1201 = !DISubroutineType(types: !1202)
!1202 = !{!717, !1192, !1192}
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1169, file: !1167, line: 132, baseType: !1204, size: 64, offset: 576)
!1204 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1167, line: 78, baseType: !1186)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1169, file: !1167, line: 135, baseType: !717, size: 64, offset: 640)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1169, file: !1167, line: 136, baseType: !1207, size: 64, offset: 704)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1167, line: 82, baseType: !1208)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64)
!1209 = !DISubroutineType(types: !1210)
!1210 = !{!717, !717, !1192, !1192}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1169, file: !1167, line: 137, baseType: !1212, size: 64, offset: 768)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1167, line: 83, baseType: !1213)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64)
!1214 = !DISubroutineType(types: !1215)
!1215 = !{null, !717, !717}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1169, file: !1167, line: 141, baseType: !7, size: 32, offset: 832)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !1087, file: !318, line: 211, baseType: !1218, size: 64, offset: 256)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64)
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !341, line: 183, baseType: !1220)
!1220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !341, line: 183, size: 128, elements: !1221)
!1221 = !{!1222}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1220, file: !341, line: 183, baseType: !1223, size: 128)
!1223 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !341, line: 182, baseType: !1224)
!1224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !341, line: 182, size: 128, elements: !1225)
!1225 = !{!1226, !1227, !1228}
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1224, file: !341, line: 182, baseType: !7, size: 32)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1224, file: !341, line: 182, baseType: !7, size: 32, offset: 32)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1224, file: !341, line: 182, baseType: !1229, size: 64, offset: 64)
!1229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !836, size: 64, elements: !755)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !1087, file: !318, line: 220, baseType: !1231, size: 64, offset: 320)
!1231 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !318, line: 217, size: 64, elements: !1232)
!1232 = !{!1233, !1234}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !1231, file: !318, line: 218, baseType: !1218, size: 64)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !1231, file: !318, line: 219, baseType: !1235, size: 64)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64)
!1236 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !1237, line: 29, baseType: !1238)
!1237 = !DIFile(filename: "./vecprim.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !1237, line: 29, size: 96, elements: !1239)
!1239 = !{!1240}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1238, file: !1237, line: 29, baseType: !1241, size: 96)
!1241 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !1237, line: 27, baseType: !1242)
!1242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !1237, line: 27, size: 96, elements: !1243)
!1243 = !{!1244, !1245, !1246}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1242, file: !1237, line: 27, baseType: !7, size: 32)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1242, file: !1237, line: 27, baseType: !7, size: 32, offset: 32)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1242, file: !1237, line: 27, baseType: !1247, size: 8, offset: 64)
!1247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1248, size: 8, elements: !755)
!1248 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !1237, line: 26, baseType: !712)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1082, file: !1083, line: 467, baseType: !1250, size: 64, offset: 64)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64)
!1251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !325, line: 374, size: 640, elements: !1252)
!1252 = !{!1253, !1328, !1329, !1342, !1343, !1344, !1345, !1346, !1347, !1349, !1351, !1352}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1251, file: !325, line: 377, baseType: !1254, size: 64)
!1254 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !721, line: 111, baseType: !1255)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64)
!1256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !325, line: 217, size: 832, elements: !1257)
!1257 = !{!1258, !1293, !1294, !1295, !1298, !1302, !1303, !1304, !1322, !1323, !1324, !1325, !1326, !1327}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1256, file: !325, line: 219, baseType: !1259, size: 64)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64)
!1260 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !325, line: 151, baseType: !1261)
!1261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !325, line: 151, size: 128, elements: !1262)
!1262 = !{!1263}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1261, file: !325, line: 151, baseType: !1264, size: 128)
!1264 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !325, line: 150, baseType: !1265)
!1265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !325, line: 150, size: 128, elements: !1266)
!1266 = !{!1267, !1268, !1269}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1265, file: !325, line: 150, baseType: !7, size: 32)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1265, file: !325, line: 150, baseType: !7, size: 32, offset: 32)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1265, file: !325, line: 150, baseType: !1270, size: 64, offset: 64)
!1270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1271, size: 64, elements: !755)
!1271 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !721, line: 108, baseType: !1272)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64)
!1273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !325, line: 122, size: 512, elements: !1274)
!1274 = !{!1275, !1276, !1277, !1285, !1286, !1287, !1288, !1289, !1290, !1291}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1273, file: !325, line: 124, baseType: !1255, size: 64)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1273, file: !325, line: 125, baseType: !1255, size: 64, offset: 64)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1273, file: !325, line: 131, baseType: !1278, size: 64, offset: 128)
!1278 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !325, line: 128, size: 64, elements: !1279)
!1279 = !{!1280, !1284}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1278, file: !325, line: 129, baseType: !1281, size: 64)
!1281 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !721, line: 66, baseType: !1282)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64)
!1283 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !721, line: 65, flags: DIFlagFwdDecl)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1278, file: !325, line: 130, baseType: !720, size: 64)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1273, file: !325, line: 134, baseType: !717, size: 64, offset: 192)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1273, file: !325, line: 137, baseType: !836, size: 64, offset: 256)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1273, file: !325, line: 138, baseType: !956, size: 32, offset: 320)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1273, file: !325, line: 142, baseType: !7, size: 32, offset: 352)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1273, file: !325, line: 144, baseType: !713, size: 32, offset: 384)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1273, file: !325, line: 145, baseType: !713, size: 32, offset: 416)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1273, file: !325, line: 146, baseType: !1292, size: 64, offset: 448)
!1292 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !325, line: 119, baseType: !807)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1256, file: !325, line: 220, baseType: !1259, size: 64, offset: 64)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1256, file: !325, line: 223, baseType: !717, size: 64, offset: 128)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1256, file: !325, line: 226, baseType: !1296, size: 64, offset: 192)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64)
!1297 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !325, line: 185, flags: DIFlagFwdDecl)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1256, file: !325, line: 229, baseType: !1299, size: 128, offset: 256)
!1299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1300, size: 128, elements: !791)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64)
!1301 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !325, line: 229, flags: DIFlagFwdDecl)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1256, file: !325, line: 232, baseType: !1255, size: 64, offset: 384)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1256, file: !325, line: 233, baseType: !1255, size: 64, offset: 448)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1256, file: !325, line: 238, baseType: !1305, size: 64, offset: 512)
!1305 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !325, line: 235, size: 64, elements: !1306)
!1306 = !{!1307, !1313}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1305, file: !325, line: 236, baseType: !1308, size: 64)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64)
!1309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !325, line: 273, size: 128, elements: !1310)
!1310 = !{!1311, !1312}
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1309, file: !325, line: 275, baseType: !1281, size: 64)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1309, file: !325, line: 278, baseType: !1281, size: 64, offset: 64)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1305, file: !325, line: 237, baseType: !1314, size: 64)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64)
!1315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !325, line: 259, size: 320, elements: !1316)
!1316 = !{!1317, !1318, !1319, !1320, !1321}
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1315, file: !325, line: 261, baseType: !720, size: 64)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1315, file: !325, line: 262, baseType: !720, size: 64, offset: 64)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1315, file: !325, line: 266, baseType: !720, size: 64, offset: 128)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1315, file: !325, line: 267, baseType: !720, size: 64, offset: 192)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1315, file: !325, line: 270, baseType: !713, size: 32, offset: 256)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1256, file: !325, line: 241, baseType: !1292, size: 64, offset: 576)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1256, file: !325, line: 244, baseType: !713, size: 32, offset: 640)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1256, file: !325, line: 247, baseType: !713, size: 32, offset: 672)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1256, file: !325, line: 250, baseType: !713, size: 32, offset: 704)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1256, file: !325, line: 253, baseType: !713, size: 32, offset: 736)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1256, file: !325, line: 256, baseType: !713, size: 32, offset: 768)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1251, file: !325, line: 378, baseType: !1254, size: 64, offset: 64)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1251, file: !325, line: 381, baseType: !1330, size: 64, offset: 128)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64)
!1331 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !325, line: 282, baseType: !1332)
!1332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !325, line: 282, size: 128, elements: !1333)
!1333 = !{!1334}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1332, file: !325, line: 282, baseType: !1335, size: 128)
!1335 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !325, line: 281, baseType: !1336)
!1336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !325, line: 281, size: 128, elements: !1337)
!1337 = !{!1338, !1339, !1340}
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1336, file: !325, line: 281, baseType: !7, size: 32)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1336, file: !325, line: 281, baseType: !7, size: 32, offset: 32)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1336, file: !325, line: 281, baseType: !1341, size: 64, offset: 64)
!1341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1254, size: 64, elements: !755)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1251, file: !325, line: 384, baseType: !713, size: 32, offset: 192)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1251, file: !325, line: 387, baseType: !713, size: 32, offset: 224)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1251, file: !325, line: 390, baseType: !713, size: 32, offset: 256)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1251, file: !325, line: 394, baseType: !1330, size: 64, offset: 320)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1251, file: !325, line: 396, baseType: !324, size: 32, offset: 384)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1251, file: !325, line: 399, baseType: !1348, size: 64, offset: 416)
!1348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 64, elements: !791)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1251, file: !325, line: 402, baseType: !1350, size: 64, offset: 480)
!1350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !791)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1251, file: !325, line: 406, baseType: !713, size: 32, offset: 544)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1251, file: !325, line: 409, baseType: !713, size: 32, offset: 576)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1082, file: !1083, line: 470, baseType: !1282, size: 64, offset: 128)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1082, file: !1083, line: 473, baseType: !1355, size: 64, offset: 192)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64)
!1356 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1083, line: 166, flags: DIFlagFwdDecl)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1082, file: !1083, line: 476, baseType: !1358, size: 64, offset: 256)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64)
!1359 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1083, line: 476, flags: DIFlagFwdDecl)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1082, file: !1083, line: 479, baseType: !1166, size: 64, offset: 320)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1082, file: !1083, line: 484, baseType: !836, size: 64, offset: 384)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1082, file: !1083, line: 488, baseType: !836, size: 64, offset: 448)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1082, file: !1083, line: 493, baseType: !836, size: 64, offset: 512)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1082, file: !1083, line: 496, baseType: !836, size: 64, offset: 576)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1082, file: !1083, line: 501, baseType: !1366, size: 64, offset: 640)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64)
!1367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !336, line: 2355, size: 576, elements: !1368)
!1368 = !{!1369, !1372, !1373, !1374, !1375, !1377, !1378, !1383, !1384, !1385, !1386, !1387, !1388}
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1367, file: !336, line: 2356, baseType: !1370, size: 64)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64)
!1371 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !336, line: 2356, flags: DIFlagFwdDecl)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1367, file: !336, line: 2357, baseType: !718, size: 64, offset: 64)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1367, file: !336, line: 2358, baseType: !713, size: 32, offset: 128)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1367, file: !336, line: 2359, baseType: !713, size: 32, offset: 160)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1367, file: !336, line: 2360, baseType: !1376, size: 128, offset: 192)
!1376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !713, size: 128, elements: !816)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1367, file: !336, line: 2364, baseType: !713, size: 32, offset: 320)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1367, file: !336, line: 2367, baseType: !1379, size: 128, offset: 384)
!1379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !336, line: 2349, size: 128, elements: !1380)
!1380 = !{!1381, !1382}
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1379, file: !336, line: 2351, baseType: !720, size: 64)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1379, file: !336, line: 2352, baseType: !807, size: 64, offset: 64)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1367, file: !336, line: 2371, baseType: !335, size: 32, offset: 512)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1367, file: !336, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1367, file: !336, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1367, file: !336, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1367, file: !336, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1367, file: !336, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1082, file: !1083, line: 504, baseType: !1390, size: 64, offset: 704)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64)
!1391 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1083, line: 504, flags: DIFlagFwdDecl)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1082, file: !1083, line: 507, baseType: !1166, size: 64, offset: 768)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1082, file: !1083, line: 510, baseType: !713, size: 32, offset: 832)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1082, file: !1083, line: 513, baseType: !713, size: 32, offset: 864)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1082, file: !1083, line: 516, baseType: !956, size: 32, offset: 896)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1082, file: !1083, line: 519, baseType: !956, size: 32, offset: 928)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1082, file: !1083, line: 522, baseType: !7, size: 32, offset: 960)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1082, file: !1083, line: 523, baseType: !7, size: 32, offset: 992)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1082, file: !1083, line: 528, baseType: !718, size: 64, offset: 1024)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1082, file: !1083, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1082, file: !1083, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1082, file: !1083, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1082, file: !1083, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1082, file: !1083, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1082, file: !1083, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1082, file: !1083, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1082, file: !1083, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1082, file: !1083, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1082, file: !1083, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1082, file: !1083, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1082, file: !1083, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1082, file: !1083, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1082, file: !1083, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1082, file: !1083, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1082, file: !1083, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1077, file: !341, line: 3254, baseType: !836, size: 64, offset: 1536)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1077, file: !341, line: 3257, baseType: !836, size: 64, offset: 1600)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1077, file: !341, line: 3258, baseType: !836, size: 64, offset: 1664)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1077, file: !341, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1077, file: !341, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1077, file: !341, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1077, file: !341, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1077, file: !341, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1077, file: !341, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1077, file: !341, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1077, file: !341, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1077, file: !341, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1077, file: !341, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1077, file: !341, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1077, file: !341, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1077, file: !341, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1077, file: !341, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1077, file: !341, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1077, file: !341, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1077, file: !341, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1077, file: !341, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !838, file: !341, line: 3394, baseType: !1438, size: 1344)
!1438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !341, line: 2279, size: 1344, elements: !1439)
!1439 = !{!1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1465, !1466, !1467, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483}
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1438, file: !341, line: 2280, baseType: !874, size: 192)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1438, file: !341, line: 2281, baseType: !836, size: 64, offset: 192)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1438, file: !341, line: 2282, baseType: !836, size: 64, offset: 256)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1438, file: !341, line: 2283, baseType: !836, size: 64, offset: 320)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1438, file: !341, line: 2284, baseType: !836, size: 64, offset: 384)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1438, file: !341, line: 2285, baseType: !7, size: 32, offset: 448)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1438, file: !341, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1438, file: !341, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1438, file: !341, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1438, file: !341, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1438, file: !341, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1438, file: !341, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1438, file: !341, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1438, file: !341, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1438, file: !341, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1438, file: !341, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1438, file: !341, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1438, file: !341, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1438, file: !341, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1438, file: !341, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1438, file: !341, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1438, file: !341, line: 2305, baseType: !7, size: 32, offset: 512)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1438, file: !341, line: 2306, baseType: !1463, size: 32, offset: 544)
