; ModuleID = 'convert.bc'
source_filename = "convert.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

!1062 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_DYNAMIC_START", value: 679, isUnsigned: true)
!1063 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_GUIDED_START", value: 680, isUnsigned: true)
!1064 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_RUNTIME_START", value: 681, isUnsigned: true)
!1065 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_ORDERED_STATIC_START", value: 682, isUnsigned: true)
!1066 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_ORDERED_DYNAMIC_START", value: 683, isUnsigned: true)
!1067 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_ORDERED_GUIDED_START", value: 684, isUnsigned: true)
!1068 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_ORDERED_RUNTIME_START", value: 685, isUnsigned: true)
!1069 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_STATIC_NEXT", value: 686, isUnsigned: true)
!1070 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_DYNAMIC_NEXT", value: 687, isUnsigned: true)
!1071 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_GUIDED_NEXT", value: 688, isUnsigned: true)
!1072 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_RUNTIME_NEXT", value: 689, isUnsigned: true)
!1073 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_ORDERED_STATIC_NEXT", value: 690, isUnsigned: true)
!1074 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_ORDERED_DYNAMIC_NEXT", value: 691, isUnsigned: true)
!1075 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_ORDERED_GUIDED_NEXT", value: 692, isUnsigned: true)
!1076 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_ORDERED_RUNTIME_NEXT", value: 693, isUnsigned: true)
!1077 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_LOOP_STATIC_START", value: 694, isUnsigned: true)
!1078 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_LOOP_DYNAMIC_START", value: 695, isUnsigned: true)
!1079 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_LOOP_GUIDED_START", value: 696, isUnsigned: true)
!1080 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_LOOP_RUNTIME_START", value: 697, isUnsigned: true)
!1081 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_END", value: 698, isUnsigned: true)
!1082 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_END_NOWAIT", value: 699, isUnsigned: true)
!1083 = !DIEnumerator(name: "BUILT_IN_GOMP_ORDERED_START", value: 700, isUnsigned: true)
!1084 = !DIEnumerator(name: "BUILT_IN_GOMP_ORDERED_END", value: 701, isUnsigned: true)
!1085 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_START", value: 702, isUnsigned: true)
!1086 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_END", value: 703, isUnsigned: true)
!1087 = !DIEnumerator(name: "BUILT_IN_GOMP_TASK", value: 704, isUnsigned: true)
!1088 = !DIEnumerator(name: "BUILT_IN_GOMP_SECTIONS_START", value: 705, isUnsigned: true)
!1089 = !DIEnumerator(name: "BUILT_IN_GOMP_SECTIONS_NEXT", value: 706, isUnsigned: true)
!1090 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_SECTIONS_START", value: 707, isUnsigned: true)
!1091 = !DIEnumerator(name: "BUILT_IN_GOMP_SECTIONS_END", value: 708, isUnsigned: true)
!1092 = !DIEnumerator(name: "BUILT_IN_GOMP_SECTIONS_END_NOWAIT", value: 709, isUnsigned: true)
!1093 = !DIEnumerator(name: "BUILT_IN_GOMP_SINGLE_START", value: 710, isUnsigned: true)
!1094 = !DIEnumerator(name: "BUILT_IN_GOMP_SINGLE_COPY_START", value: 711, isUnsigned: true)
!1095 = !DIEnumerator(name: "BUILT_IN_GOMP_SINGLE_COPY_END", value: 712, isUnsigned: true)
!1096 = !DIEnumerator(name: "BUILT_IN_COMPLEX_MUL_MIN", value: 713, isUnsigned: true)
!1097 = !DIEnumerator(name: "BUILT_IN_COMPLEX_MUL_MAX", value: 716, isUnsigned: true)
!1098 = !DIEnumerator(name: "BUILT_IN_COMPLEX_DIV_MIN", value: 717, isUnsigned: true)
!1099 = !DIEnumerator(name: "BUILT_IN_COMPLEX_DIV_MAX", value: 720, isUnsigned: true)
!1100 = !DIEnumerator(name: "END_BUILTINS", value: 721, isUnsigned: true)
!1101 = !{!1102, !1103, !1104, !1105, !1108, !1109, !165, !1111, !359, !1113, !1767}
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1104 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1107)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1112, line: 44, baseType: !5)
!1112 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !1114, line: 56, baseType: !1115)
!1114 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !133, line: 3371, size: 1792, elements: !1117)
!1117 = !{!1118, !1151, !1157, !1170, !1189, !1200, !1205, !1214, !1220, !1233, !1243, !1281, !1289, !1317, !1325, !1326, !1331, !1340, !1346, !1351, !1355, !1359, !1388, !1437, !1443, !1450, !1457, !1483, !1508, !1525, !1537, !1559, !1577, !1749}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1116, file: !133, line: 3372, baseType: !1119, size: 64)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !133, line: 360, size: 64, elements: !1120)
!1120 = !{!1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1119, file: !133, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !1119, file: !133, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !1119, file: !133, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !1119, file: !133, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !1119, file: !133, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !1119, file: !133, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !1119, file: !133, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !1119, file: !133, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !1119, file: !133, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !1119, file: !133, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !1119, file: !133, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !1119, file: !133, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !1119, file: !133, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !1119, file: !133, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !1119, file: !133, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !1119, file: !133, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !1119, file: !133, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !1119, file: !133, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1119, file: !133, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1119, file: !133, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1119, file: !133, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1119, file: !133, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1119, file: !133, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1119, file: !133, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1119, file: !133, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1119, file: !133, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !1119, file: !133, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !1119, file: !133, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !1119, file: !133, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !1119, file: !133, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1116, file: !133, line: 3373, baseType: !1152, size: 192)
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !133, line: 402, size: 192, elements: !1153)
!1153 = !{!1154, !1155, !1156}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1152, file: !133, line: 403, baseType: !1119, size: 64)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !1152, file: !133, line: 404, baseType: !1113, size: 64, offset: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1152, file: !133, line: 405, baseType: !1113, size: 64, offset: 128)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1116, file: !133, line: 3374, baseType: !1158, size: 320)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !133, line: 1384, size: 320, elements: !1159)
!1159 = !{!1160, !1161}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1158, file: !133, line: 1385, baseType: !1152, size: 192)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1158, file: !133, line: 1386, baseType: !1162, size: 128, offset: 192)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !1163, line: 58, baseType: !1164)
!1163 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1163, line: 54, size: 128, elements: !1165)
!1165 = !{!1166, !1168}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !1164, file: !1163, line: 56, baseType: !1167, size: 64)
!1167 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !1164, file: !1163, line: 57, baseType: !1169, size: 64, offset: 64)
!1169 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !1116, file: !133, line: 3375, baseType: !1171, size: 256)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !133, line: 1397, size: 256, elements: !1172)
!1172 = !{!1173, !1174}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1171, file: !133, line: 1398, baseType: !1152, size: 192)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !1171, file: !133, line: 1399, baseType: !1175, size: 64, offset: 192)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !1177, line: 52, size: 256, elements: !1178)
!1177 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1178 = !{!1179, !1180, !1181, !1182, !1183, !1184, !1185}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !1176, file: !1177, line: 56, baseType: !5, size: 2, flags: DIFlagBitField, extraData: i64 0)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !1176, file: !1177, line: 57, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !1176, file: !1177, line: 58, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !1176, file: !1177, line: 59, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1176, file: !1177, line: 60, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !1176, file: !1177, line: 61, baseType: !5, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !1176, file: !1177, line: 62, baseType: !1186, size: 192, offset: 64)
!1186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1167, size: 192, elements: !1187)
!1187 = !{!1188}
!1188 = !DISubrange(count: 3)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !1116, file: !133, line: 3376, baseType: !1190, size: 256)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !133, line: 1408, size: 256, elements: !1191)
!1191 = !{!1192, !1193}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1190, file: !133, line: 1409, baseType: !1152, size: 192)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !1190, file: !133, line: 1410, baseType: !1194, size: 64, offset: 192)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64)
!1195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !1196, line: 27, size: 192, elements: !1197)
!1196 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1197 = !{!1198, !1199}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1195, file: !1196, line: 29, baseType: !1162, size: 128)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1195, file: !1196, line: 30, baseType: !3, size: 32, offset: 128)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !1116, file: !133, line: 3377, baseType: !1201, size: 256)
!1201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !133, line: 1437, size: 256, elements: !1202)
!1202 = !{!1203, !1204}
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1201, file: !133, line: 1438, baseType: !1152, size: 192)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1201, file: !133, line: 1439, baseType: !1113, size: 64, offset: 192)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1116, file: !133, line: 3378, baseType: !1206, size: 256)
!1206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !133, line: 1418, size: 256, elements: !1207)
!1207 = !{!1208, !1209, !1210}
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1206, file: !133, line: 1419, baseType: !1152, size: 192)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1206, file: !133, line: 1420, baseType: !1104, size: 32, offset: 192)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1206, file: !133, line: 1421, baseType: !1211, size: 8, offset: 224)
!1211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1107, size: 8, elements: !1212)
!1212 = !{!1213}
!1213 = !DISubrange(count: 1)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !1116, file: !133, line: 3379, baseType: !1215, size: 320)
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !133, line: 1428, size: 320, elements: !1216)
!1216 = !{!1217, !1218, !1219}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1215, file: !133, line: 1429, baseType: !1152, size: 192)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !1215, file: !133, line: 1430, baseType: !1113, size: 64, offset: 192)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !1215, file: !133, line: 1431, baseType: !1113, size: 64, offset: 256)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !1116, file: !133, line: 3380, baseType: !1221, size: 320)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !133, line: 1460, size: 320, elements: !1222)
!1222 = !{!1223, !1224}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1221, file: !133, line: 1461, baseType: !1152, size: 192)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1221, file: !133, line: 1462, baseType: !1225, size: 128, offset: 192)
!1225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1226, line: 31, size: 128, elements: !1227)
!1226 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1227 = !{!1228, !1231, !1232}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1225, file: !1226, line: 32, baseType: !1229, size: 64)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64)
!1230 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1103)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1225, file: !1226, line: 33, baseType: !5, size: 32, offset: 64)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1225, file: !1226, line: 34, baseType: !5, size: 32, offset: 96)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !1116, file: !133, line: 3381, baseType: !1234, size: 384)
!1234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !133, line: 2507, size: 384, elements: !1235)
!1235 = !{!1236, !1237, !1240, !1241, !1242}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1234, file: !133, line: 2508, baseType: !1152, size: 192)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1234, file: !133, line: 2509, baseType: !1238, size: 32, offset: 192)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1239, line: 58, baseType: !1111)
!1239 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1234, file: !133, line: 2510, baseType: !5, size: 32, offset: 224)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1234, file: !133, line: 2511, baseType: !1113, size: 64, offset: 256)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1234, file: !133, line: 2512, baseType: !1113, size: 64, offset: 320)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !1116, file: !133, line: 3382, baseType: !1244, size: 896)
!1244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !133, line: 2652, size: 896, elements: !1245)
!1245 = !{!1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278}
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1244, file: !133, line: 2653, baseType: !1234, size: 384)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1244, file: !133, line: 2654, baseType: !1113, size: 64, offset: 384)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1244, file: !133, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1244, file: !133, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1244, file: !133, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1244, file: !133, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1244, file: !133, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1244, file: !133, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1244, file: !133, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1244, file: !133, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1244, file: !133, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1244, file: !133, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1244, file: !133, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1244, file: !133, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1244, file: !133, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1244, file: !133, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1244, file: !133, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1244, file: !133, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1244, file: !133, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1244, file: !133, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1244, file: !133, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1244, file: !133, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1244, file: !133, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1244, file: !133, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1244, file: !133, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1244, file: !133, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1244, file: !133, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1244, file: !133, line: 2703, baseType: !5, size: 32, offset: 512)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1244, file: !133, line: 2705, baseType: !1113, size: 64, offset: 576)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1244, file: !133, line: 2706, baseType: !1113, size: 64, offset: 640)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1244, file: !133, line: 2707, baseType: !1113, size: 64, offset: 704)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1244, file: !133, line: 2708, baseType: !1113, size: 64, offset: 768)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1244, file: !133, line: 2711, baseType: !1279, size: 64, offset: 832)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64)
!1280 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !133, line: 2711, flags: DIFlagFwdDecl)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !1116, file: !133, line: 3383, baseType: !1282, size: 960)
!1282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !133, line: 2756, size: 960, elements: !1283)
!1283 = !{!1284, !1285}
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1282, file: !133, line: 2757, baseType: !1244, size: 896)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1282, file: !133, line: 2758, baseType: !1286, size: 64, offset: 896)
!1286 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !1114, line: 50, baseType: !1287)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64)
!1288 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !1114, line: 49, flags: DIFlagFwdDecl)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !1116, file: !133, line: 3384, baseType: !1290, size: 1472)
!1290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !133, line: 3114, size: 1472, elements: !1291)
!1291 = !{!1292, !1313, !1314, !1315, !1316}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1290, file: !133, line: 3115, baseType: !1293, size: 1216)
!1293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !133, line: 2984, size: 1216, elements: !1294)
!1294 = !{!1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312}
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1293, file: !133, line: 2985, baseType: !1282, size: 960)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1293, file: !133, line: 2986, baseType: !1113, size: 64, offset: 960)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1293, file: !133, line: 2987, baseType: !1113, size: 64, offset: 1024)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1293, file: !133, line: 2988, baseType: !1113, size: 64, offset: 1088)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1293, file: !133, line: 2991, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1293, file: !133, line: 2992, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1293, file: !133, line: 2993, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1293, file: !133, line: 2994, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1293, file: !133, line: 2995, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1293, file: !133, line: 2996, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1293, file: !133, line: 2998, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1293, file: !133, line: 3000, baseType: !5, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1293, file: !133, line: 3002, baseType: !5, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1293, file: !133, line: 3003, baseType: !5, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1293, file: !133, line: 3004, baseType: !5, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1293, file: !133, line: 3005, baseType: !5, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1293, file: !133, line: 3007, baseType: !5, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1293, file: !133, line: 3010, baseType: !5, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1290, file: !133, line: 3117, baseType: !1113, size: 64, offset: 1216)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1290, file: !133, line: 3119, baseType: !1113, size: 64, offset: 1280)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1290, file: !133, line: 3121, baseType: !1113, size: 64, offset: 1344)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1290, file: !133, line: 3123, baseType: !1113, size: 64, offset: 1408)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !1116, file: !133, line: 3385, baseType: !1318, size: 1088)
!1318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !133, line: 2874, size: 1088, elements: !1319)
!1319 = !{!1320, !1321, !1322}
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1318, file: !133, line: 2875, baseType: !1282, size: 960)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1318, file: !133, line: 2876, baseType: !1286, size: 64, offset: 960)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1318, file: !133, line: 2877, baseType: !1323, size: 64, offset: 1024)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64)
!1324 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !133, line: 2856, flags: DIFlagFwdDecl)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !1116, file: !133, line: 3386, baseType: !1293, size: 1216)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !1116, file: !133, line: 3387, baseType: !1327, size: 1280)
!1327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !133, line: 3093, size: 1280, elements: !1328)
!1328 = !{!1329, !1330}
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1327, file: !133, line: 3094, baseType: !1293, size: 1216)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1327, file: !133, line: 3095, baseType: !1323, size: 64, offset: 1216)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !1116, file: !133, line: 3388, baseType: !1332, size: 1216)
!1332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !133, line: 2824, size: 1216, elements: !1333)
!1333 = !{!1334, !1335, !1336, !1337, !1338, !1339}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1332, file: !133, line: 2825, baseType: !1244, size: 896)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1332, file: !133, line: 2827, baseType: !1113, size: 64, offset: 896)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1332, file: !133, line: 2828, baseType: !1113, size: 64, offset: 960)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1332, file: !133, line: 2829, baseType: !1113, size: 64, offset: 1024)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1332, file: !133, line: 2830, baseType: !1113, size: 64, offset: 1088)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1332, file: !133, line: 2831, baseType: !1113, size: 64, offset: 1152)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !1116, file: !133, line: 3389, baseType: !1341, size: 1024)
!1341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !133, line: 2850, size: 1024, elements: !1342)
!1342 = !{!1343, !1344, !1345}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1341, file: !133, line: 2851, baseType: !1282, size: 960)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1341, file: !133, line: 2852, baseType: !1104, size: 32, offset: 960)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1341, file: !133, line: 2853, baseType: !1104, size: 32, offset: 992)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !1116, file: !133, line: 3390, baseType: !1347, size: 1024)
!1347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !133, line: 2857, size: 1024, elements: !1348)
!1348 = !{!1349, !1350}
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1347, file: !133, line: 2858, baseType: !1282, size: 960)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1347, file: !133, line: 2859, baseType: !1323, size: 64, offset: 960)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !1116, file: !133, line: 3391, baseType: !1352, size: 960)
!1352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !133, line: 2862, size: 960, elements: !1353)
!1353 = !{!1354}
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1352, file: !133, line: 2863, baseType: !1282, size: 960)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !1116, file: !133, line: 3392, baseType: !1356, size: 1472)
!1356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !133, line: 3304, size: 1472, elements: !1357)
!1357 = !{!1358}
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1356, file: !133, line: 3305, baseType: !1290, size: 1472)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !1116, file: !133, line: 3393, baseType: !1360, size: 1792)
!1360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !133, line: 3248, size: 1792, elements: !1361)
!1361 = !{!1362, !1363, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387}
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1360, file: !133, line: 3249, baseType: !1290, size: 1472)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1360, file: !133, line: 3251, baseType: !1364, size: 64, offset: 1472)
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1365, size: 64)
!1365 = !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1366, line: 41, flags: DIFlagFwdDecl)
!1366 = !DIFile(filename: "./statistics.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1360, file: !133, line: 3254, baseType: !1113, size: 64, offset: 1536)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1360, file: !133, line: 3257, baseType: !1113, size: 64, offset: 1600)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1360, file: !133, line: 3258, baseType: !1113, size: 64, offset: 1664)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1360, file: !133, line: 3264, baseType: !5, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1360, file: !133, line: 3265, baseType: !5, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1360, file: !133, line: 3267, baseType: !5, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1360, file: !133, line: 3268, baseType: !5, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1360, file: !133, line: 3269, baseType: !5, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1360, file: !133, line: 3271, baseType: !5, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1360, file: !133, line: 3272, baseType: !5, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1360, file: !133, line: 3273, baseType: !5, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1360, file: !133, line: 3274, baseType: !5, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1360, file: !133, line: 3275, baseType: !5, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1360, file: !133, line: 3276, baseType: !5, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1360, file: !133, line: 3277, baseType: !5, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1360, file: !133, line: 3279, baseType: !5, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1360, file: !133, line: 3280, baseType: !5, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1360, file: !133, line: 3281, baseType: !5, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1360, file: !133, line: 3282, baseType: !5, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1360, file: !133, line: 3283, baseType: !5, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1360, file: !133, line: 3284, baseType: !5, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1116, file: !133, line: 3394, baseType: !1389, size: 1344)
!1389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !133, line: 2279, size: 1344, elements: !1390)
!1390 = !{!1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1416, !1417, !1418, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434}
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1389, file: !133, line: 2280, baseType: !1152, size: 192)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1389, file: !133, line: 2281, baseType: !1113, size: 64, offset: 192)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1389, file: !133, line: 2282, baseType: !1113, size: 64, offset: 256)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1389, file: !133, line: 2283, baseType: !1113, size: 64, offset: 320)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1389, file: !133, line: 2284, baseType: !1113, size: 64, offset: 384)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1389, file: !133, line: 2285, baseType: !5, size: 32, offset: 448)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1389, file: !133, line: 2287, baseType: !5, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1389, file: !133, line: 2288, baseType: !5, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1389, file: !133, line: 2289, baseType: !5, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1389, file: !133, line: 2290, baseType: !5, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1389, file: !133, line: 2291, baseType: !5, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1389, file: !133, line: 2292, baseType: !5, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1389, file: !133, line: 2294, baseType: !5, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1389, file: !133, line: 2296, baseType: !5, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1389, file: !133, line: 2297, baseType: !5, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1389, file: !133, line: 2298, baseType: !5, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1389, file: !133, line: 2299, baseType: !5, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1389, file: !133, line: 2300, baseType: !5, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1389, file: !133, line: 2301, baseType: !5, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1389, file: !133, line: 2302, baseType: !5, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1389, file: !133, line: 2303, baseType: !5, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1389, file: !133, line: 2305, baseType: !5, size: 32, offset: 512)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1389, file: !133, line: 2306, baseType: !1414, size: 32, offset: 544)
!1414 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1415, line: 31, baseType: !1104)
!1415 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1389, file: !133, line: 2307, baseType: !1113, size: 64, offset: 576)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1389, file: !133, line: 2308, baseType: !1113, size: 64, offset: 640)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1389, file: !133, line: 2314, baseType: !1419, size: 64, offset: 704)
!1419 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !133, line: 2309, size: 64, elements: !1420)
!1420 = !{!1421, !1422, !1423}
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1419, file: !133, line: 2310, baseType: !1104, size: 32)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1419, file: !133, line: 2311, baseType: !1109, size: 64)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1419, file: !133, line: 2312, baseType: !1424, size: 64)
!1424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1425, size: 64)
!1425 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !133, line: 2277, flags: DIFlagFwdDecl)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1389, file: !133, line: 2315, baseType: !1113, size: 64, offset: 768)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1389, file: !133, line: 2316, baseType: !1113, size: 64, offset: 832)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1389, file: !133, line: 2317, baseType: !1113, size: 64, offset: 896)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1389, file: !133, line: 2318, baseType: !1113, size: 64, offset: 960)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1389, file: !133, line: 2319, baseType: !1113, size: 64, offset: 1024)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1389, file: !133, line: 2320, baseType: !1113, size: 64, offset: 1088)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1389, file: !133, line: 2321, baseType: !1113, size: 64, offset: 1152)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1389, file: !133, line: 2322, baseType: !1113, size: 64, offset: 1216)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1389, file: !133, line: 2324, baseType: !1435, size: 64, offset: 1280)
!1435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1436, size: 64)
!1436 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !133, line: 2324, flags: DIFlagFwdDecl)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !1116, file: !133, line: 3395, baseType: !1438, size: 320)
!1438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !133, line: 1469, size: 320, elements: !1439)
!1439 = !{!1440, !1441, !1442}
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1438, file: !133, line: 1470, baseType: !1152, size: 192)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1438, file: !133, line: 1471, baseType: !1113, size: 64, offset: 192)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1438, file: !133, line: 1472, baseType: !1113, size: 64, offset: 256)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1116, file: !133, line: 3396, baseType: !1444, size: 320)
!1444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !133, line: 1482, size: 320, elements: !1445)
!1445 = !{!1446, !1447, !1448}
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1444, file: !133, line: 1483, baseType: !1152, size: 192)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1444, file: !133, line: 1484, baseType: !1104, size: 32, offset: 192)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1444, file: !133, line: 1485, baseType: !1449, size: 64, offset: 256)
!1449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1113, size: 64, elements: !1212)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !1116, file: !133, line: 3397, baseType: !1451, size: 384)
!1451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !133, line: 1829, size: 384, elements: !1452)
!1452 = !{!1453, !1454, !1455, !1456}
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1451, file: !133, line: 1830, baseType: !1152, size: 192)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1451, file: !133, line: 1831, baseType: !1238, size: 32, offset: 192)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1451, file: !133, line: 1832, baseType: !1113, size: 64, offset: 256)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1451, file: !133, line: 1835, baseType: !1449, size: 64, offset: 320)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1116, file: !133, line: 3398, baseType: !1458, size: 704)
!1458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !133, line: 1898, size: 704, elements: !1459)
!1459 = !{!1460, !1461, !1462, !1466, !1467, !1470}
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1458, file: !133, line: 1899, baseType: !1152, size: 192)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1458, file: !133, line: 1902, baseType: !1113, size: 64, offset: 192)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1458, file: !133, line: 1905, baseType: !1463, size: 64, offset: 256)
!1463 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !1114, line: 58, baseType: !1464)
!1464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1465, size: 64)
!1465 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !1114, line: 57, flags: DIFlagFwdDecl)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1458, file: !133, line: 1908, baseType: !5, size: 32, offset: 320)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1458, file: !133, line: 1911, baseType: !1468, size: 64, offset: 384)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64)
!1469 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !133, line: 1876, flags: DIFlagFwdDecl)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1458, file: !133, line: 1914, baseType: !1471, size: 256, offset: 448)
!1471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !133, line: 1883, size: 256, elements: !1472)
!1472 = !{!1473, !1475, !1476, !1481}
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1471, file: !133, line: 1884, baseType: !1474, size: 64)
!1474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1471, size: 64)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1471, file: !133, line: 1885, baseType: !1474, size: 64, offset: 64)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1471, file: !133, line: 1891, baseType: !1477, size: 64, offset: 128)
!1477 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1471, file: !133, line: 1891, size: 64, elements: !1478)
!1478 = !{!1479, !1480}
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1477, file: !133, line: 1891, baseType: !1463, size: 64)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1477, file: !133, line: 1891, baseType: !1113, size: 64)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1471, file: !133, line: 1892, baseType: !1482, size: 64, offset: 192)
!1482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1116, file: !133, line: 3399, baseType: !1484, size: 704)
!1484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !133, line: 2008, size: 704, elements: !1485)
!1485 = !{!1486, !1487, !1488, !1489, !1490, !1491, !1503, !1504, !1505, !1506, !1507}
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1484, file: !133, line: 2009, baseType: !1152, size: 192)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1484, file: !133, line: 2011, baseType: !5, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !1484, file: !133, line: 2012, baseType: !5, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1484, file: !133, line: 2014, baseType: !1238, size: 32, offset: 224)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1484, file: !133, line: 2016, baseType: !1113, size: 64, offset: 256)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !1484, file: !133, line: 2017, baseType: !1492, size: 64, offset: 320)
!1492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1493, size: 64)
!1493 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !133, line: 183, baseType: !1494)
!1494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !133, line: 183, size: 128, elements: !1495)
!1495 = !{!1496}
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1494, file: !133, line: 183, baseType: !1497, size: 128)
!1497 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !133, line: 182, baseType: !1498)
!1498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !133, line: 182, size: 128, elements: !1499)
!1499 = !{!1500, !1501, !1502}
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1498, file: !133, line: 182, baseType: !5, size: 32)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1498, file: !133, line: 182, baseType: !5, size: 32, offset: 32)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1498, file: !133, line: 182, baseType: !1449, size: 64, offset: 64)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !1484, file: !133, line: 2019, baseType: !1113, size: 64, offset: 384)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !1484, file: !133, line: 2020, baseType: !1113, size: 64, offset: 448)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1484, file: !133, line: 2021, baseType: !1113, size: 64, offset: 512)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !1484, file: !133, line: 2022, baseType: !1113, size: 64, offset: 576)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !1484, file: !133, line: 2023, baseType: !1113, size: 64, offset: 640)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1116, file: !133, line: 3400, baseType: !1509, size: 832)
!1509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !133, line: 2430, size: 832, elements: !1510)
!1510 = !{!1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520}
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1509, file: !133, line: 2431, baseType: !1152, size: 192)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1509, file: !133, line: 2433, baseType: !1113, size: 64, offset: 192)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !1509, file: !133, line: 2434, baseType: !1113, size: 64, offset: 256)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !1509, file: !133, line: 2435, baseType: !1113, size: 64, offset: 320)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !1509, file: !133, line: 2436, baseType: !1113, size: 64, offset: 384)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "base_accesses", scope: !1509, file: !133, line: 2437, baseType: !1492, size: 64, offset: 448)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "inheritance", scope: !1509, file: !133, line: 2438, baseType: !1113, size: 64, offset: 512)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_subvtt", scope: !1509, file: !133, line: 2440, baseType: !1113, size: 64, offset: 576)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_vptr", scope: !1509, file: !133, line: 2441, baseType: !1113, size: 64, offset: 640)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "base_binfos", scope: !1509, file: !133, line: 2443, baseType: !1521, size: 128, offset: 704)
!1521 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_none", file: !133, line: 182, baseType: !1522)
!1522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_none", file: !133, line: 182, size: 128, elements: !1523)
!1523 = !{!1524}
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1522, file: !133, line: 182, baseType: !1497, size: 128)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "stmt_list", scope: !1116, file: !133, line: 3401, baseType: !1526, size: 320)
!1526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list", file: !133, line: 3327, size: 320, elements: !1527)
!1527 = !{!1528, !1529, !1536}
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1526, file: !133, line: 3329, baseType: !1152, size: 192)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1526, file: !133, line: 3330, baseType: !1530, size: 64, offset: 192)
!1530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1531, size: 64)
!1531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list_node", file: !133, line: 3320, size: 192, elements: !1532)
!1532 = !{!1533, !1534, !1535}
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1531, file: !133, line: 3322, baseType: !1530, size: 64)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1531, file: !133, line: 3323, baseType: !1530, size: 64, offset: 64)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1531, file: !133, line: 3324, baseType: !1113, size: 64, offset: 128)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1526, file: !133, line: 3331, baseType: !1530, size: 64, offset: 256)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "constructor", scope: !1116, file: !133, line: 3402, baseType: !1538, size: 256)
!1538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_constructor", file: !133, line: 1540, size: 256, elements: !1539)
!1539 = !{!1540, !1541}
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1538, file: !133, line: 1541, baseType: !1152, size: 192)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !1538, file: !133, line: 1542, baseType: !1542, size: 64, offset: 192)
!1542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1543, size: 64)
!1543 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_gc", file: !133, line: 1538, baseType: !1544)
!1544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_gc", file: !133, line: 1538, size: 192, elements: !1545)
!1545 = !{!1546}
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1544, file: !133, line: 1538, baseType: !1547, size: 192)
!1547 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_base", file: !133, line: 1537, baseType: !1548)
!1548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_base", file: !133, line: 1537, size: 192, elements: !1549)
!1549 = !{!1550, !1551, !1552}
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1548, file: !133, line: 1537, baseType: !5, size: 32)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1548, file: !133, line: 1537, baseType: !5, size: 32, offset: 32)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1548, file: !133, line: 1537, baseType: !1553, size: 128, offset: 64)
!1553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1554, size: 128, elements: !1212)
!1554 = !DIDerivedType(tag: DW_TAG_typedef, name: "constructor_elt", file: !133, line: 1535, baseType: !1555)
!1555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "constructor_elt_d", file: !133, line: 1532, size: 128, elements: !1556)
!1556 = !{!1557, !1558}
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1555, file: !133, line: 1533, baseType: !1113, size: 64)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1555, file: !133, line: 1534, baseType: !1113, size: 64, offset: 64)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "omp_clause", scope: !1116, file: !133, line: 3403, baseType: !1560, size: 512)
!1560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_omp_clause", file: !133, line: 1938, size: 512, elements: !1561)
!1561 = !{!1562, !1563, !1564, !1565, !1571, !1575, !1576}
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1560, file: !133, line: 1939, baseType: !1152, size: 192)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1560, file: !133, line: 1940, baseType: !1238, size: 32, offset: 192)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1560, file: !133, line: 1941, baseType: !132, size: 32, offset: 224)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !1560, file: !133, line: 1946, baseType: !1566, size: 32, offset: 256)
!1566 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "omp_clause_subcode", file: !133, line: 1942, size: 32, elements: !1567)
!1567 = !{!1568, !1569, !1570}
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "default_kind", scope: !1566, file: !133, line: 1943, baseType: !151, size: 32)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "schedule_kind", scope: !1566, file: !133, line: 1944, baseType: !158, size: 32)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "reduction_code", scope: !1566, file: !133, line: 1945, baseType: !165, size: 32)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reduction_init", scope: !1560, file: !133, line: 1950, baseType: !1572, size: 64, offset: 320)
!1572 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !1114, line: 66, baseType: !1573)
!1573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1574, size: 64)
!1574 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !1114, line: 65, flags: DIFlagFwdDecl)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reduction_merge", scope: !1560, file: !133, line: 1951, baseType: !1572, size: 64, offset: 384)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1560, file: !133, line: 1953, baseType: !1449, size: 64, offset: 448)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "optimization", scope: !1116, file: !133, line: 3404, baseType: !1578, size: 1664)
!1578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_optimization_option", file: !133, line: 3337, size: 1664, elements: !1579)
!1579 = !{!1580, !1581}
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1578, file: !133, line: 3338, baseType: !1152, size: 192)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !1578, file: !133, line: 3341, baseType: !1582, size: 1472, offset: 192)
!1582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cl_optimization", file: !1583, line: 410, size: 1472, elements: !1584)
!1583 = !DIFile(filename: "./options.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1584 = !{!1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748}
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "align_functions", scope: !1582, file: !1583, line: 412, baseType: !1104, size: 32)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "align_jumps", scope: !1582, file: !1583, line: 413, baseType: !1104, size: 32, offset: 32)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "align_labels", scope: !1582, file: !1583, line: 414, baseType: !1104, size: 32, offset: 64)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "align_loops", scope: !1582, file: !1583, line: 415, baseType: !1104, size: 32, offset: 96)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_stalled_insns", scope: !1582, file: !1583, line: 416, baseType: !1104, size: 32, offset: 128)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_stalled_insns_dep", scope: !1582, file: !1583, line: 417, baseType: !1104, size: 32, offset: 160)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "optimize", scope: !1582, file: !1583, line: 418, baseType: !1103, size: 8, offset: 192)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_size", scope: !1582, file: !1583, line: 419, baseType: !1103, size: 8, offset: 200)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "flag_argument_noalias", scope: !1582, file: !1583, line: 420, baseType: !1594, size: 8, offset: 208)
!1594 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "flag_asynchronous_unwind_tables", scope: !1582, file: !1583, line: 421, baseType: !1594, size: 8, offset: 216)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_on_count_reg", scope: !1582, file: !1583, line: 422, baseType: !1594, size: 8, offset: 224)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_probabilities", scope: !1582, file: !1583, line: 423, baseType: !1594, size: 8, offset: 232)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_target_load_optimize", scope: !1582, file: !1583, line: 424, baseType: !1594, size: 8, offset: 240)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_target_load_optimize2", scope: !1582, file: !1583, line: 425, baseType: !1594, size: 8, offset: 248)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "flag_btr_bb_exclusive", scope: !1582, file: !1583, line: 426, baseType: !1594, size: 8, offset: 256)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "flag_caller_saves", scope: !1582, file: !1583, line: 427, baseType: !1594, size: 8, offset: 264)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "flag_no_common", scope: !1582, file: !1583, line: 428, baseType: !1594, size: 8, offset: 272)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "flag_conserve_stack", scope: !1582, file: !1583, line: 429, baseType: !1594, size: 8, offset: 280)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cprop_registers", scope: !1582, file: !1583, line: 430, baseType: !1594, size: 8, offset: 288)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "flag_crossjumping", scope: !1582, file: !1583, line: 431, baseType: !1594, size: 8, offset: 296)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cse_follow_jumps", scope: !1582, file: !1583, line: 432, baseType: !1594, size: 8, offset: 304)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cx_fortran_rules", scope: !1582, file: !1583, line: 433, baseType: !1594, size: 8, offset: 312)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cx_limited_range", scope: !1582, file: !1583, line: 434, baseType: !1594, size: 8, offset: 320)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "flag_data_sections", scope: !1582, file: !1583, line: 435, baseType: !1594, size: 8, offset: 328)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "flag_dce", scope: !1582, file: !1583, line: 436, baseType: !1594, size: 8, offset: 336)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "flag_defer_pop", scope: !1582, file: !1583, line: 437, baseType: !1594, size: 8, offset: 344)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "flag_delayed_branch", scope: !1582, file: !1583, line: 438, baseType: !1594, size: 8, offset: 352)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "flag_delete_null_pointer_checks", scope: !1582, file: !1583, line: 439, baseType: !1594, size: 8, offset: 360)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "flag_dse", scope: !1582, file: !1583, line: 440, baseType: !1594, size: 8, offset: 368)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "flag_early_inlining", scope: !1582, file: !1583, line: 441, baseType: !1594, size: 8, offset: 376)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "flag_exceptions", scope: !1582, file: !1583, line: 442, baseType: !1594, size: 8, offset: 384)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "flag_expensive_optimizations", scope: !1582, file: !1583, line: 443, baseType: !1594, size: 8, offset: 392)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "flag_finite_math_only", scope: !1582, file: !1583, line: 444, baseType: !1594, size: 8, offset: 400)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "flag_float_store", scope: !1582, file: !1583, line: 445, baseType: !1594, size: 8, offset: 408)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "flag_forward_propagate", scope: !1582, file: !1583, line: 446, baseType: !1594, size: 8, offset: 416)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse", scope: !1582, file: !1583, line: 447, baseType: !1594, size: 8, offset: 424)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_after_reload", scope: !1582, file: !1583, line: 448, baseType: !1594, size: 8, offset: 432)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_las", scope: !1582, file: !1583, line: 449, baseType: !1594, size: 8, offset: 440)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_lm", scope: !1582, file: !1583, line: 450, baseType: !1594, size: 8, offset: 448)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_sm", scope: !1582, file: !1583, line: 451, baseType: !1594, size: 8, offset: 456)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "flag_graphite_identity", scope: !1582, file: !1583, line: 452, baseType: !1594, size: 8, offset: 464)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "flag_guess_branch_prob", scope: !1582, file: !1583, line: 453, baseType: !1594, size: 8, offset: 472)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "flag_if_conversion", scope: !1582, file: !1583, line: 454, baseType: !1594, size: 8, offset: 480)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "flag_if_conversion2", scope: !1582, file: !1583, line: 455, baseType: !1594, size: 8, offset: 488)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_functions", scope: !1582, file: !1583, line: 456, baseType: !1594, size: 8, offset: 496)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_functions_called_once", scope: !1582, file: !1583, line: 457, baseType: !1594, size: 8, offset: 504)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_small_functions", scope: !1582, file: !1583, line: 458, baseType: !1594, size: 8, offset: 512)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_cp", scope: !1582, file: !1583, line: 459, baseType: !1594, size: 8, offset: 520)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_cp_clone", scope: !1582, file: !1583, line: 460, baseType: !1594, size: 8, offset: 528)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_matrix_reorg", scope: !1582, file: !1583, line: 461, baseType: !1594, size: 8, offset: 536)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_pta", scope: !1582, file: !1583, line: 462, baseType: !1594, size: 8, offset: 544)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_pure_const", scope: !1582, file: !1583, line: 463, baseType: !1594, size: 8, offset: 552)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_reference", scope: !1582, file: !1583, line: 464, baseType: !1594, size: 8, offset: 560)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_sra", scope: !1582, file: !1583, line: 465, baseType: !1594, size: 8, offset: 568)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_type_escape", scope: !1582, file: !1583, line: 466, baseType: !1594, size: 8, offset: 576)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ivopts", scope: !1582, file: !1583, line: 467, baseType: !1594, size: 8, offset: 584)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "flag_jump_tables", scope: !1582, file: !1583, line: 468, baseType: !1594, size: 8, offset: 592)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_block", scope: !1582, file: !1583, line: 469, baseType: !1594, size: 8, offset: 600)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_interchange", scope: !1582, file: !1583, line: 470, baseType: !1594, size: 8, offset: 608)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_parallelize_all", scope: !1582, file: !1583, line: 471, baseType: !1594, size: 8, offset: 616)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_strip_mine", scope: !1582, file: !1583, line: 472, baseType: !1594, size: 8, offset: 624)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "flag_lto_report", scope: !1582, file: !1583, line: 473, baseType: !1594, size: 8, offset: 632)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ltrans", scope: !1582, file: !1583, line: 474, baseType: !1594, size: 8, offset: 640)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "flag_errno_math", scope: !1582, file: !1583, line: 475, baseType: !1594, size: 8, offset: 648)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "flag_merge_constants", scope: !1582, file: !1583, line: 476, baseType: !1594, size: 8, offset: 656)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "flag_modulo_sched", scope: !1582, file: !1583, line: 477, baseType: !1594, size: 8, offset: 664)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "flag_move_loop_invariants", scope: !1582, file: !1583, line: 478, baseType: !1594, size: 8, offset: 672)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "flag_non_call_exceptions", scope: !1582, file: !1583, line: 479, baseType: !1594, size: 8, offset: 680)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "flag_omit_frame_pointer", scope: !1582, file: !1583, line: 480, baseType: !1594, size: 8, offset: 688)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "flag_regmove", scope: !1582, file: !1583, line: 481, baseType: !1594, size: 8, offset: 696)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "flag_optimize_sibling_calls", scope: !1582, file: !1583, line: 482, baseType: !1594, size: 8, offset: 704)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "flag_pack_struct", scope: !1582, file: !1583, line: 483, baseType: !1594, size: 8, offset: 712)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "flag_peel_loops", scope: !1582, file: !1583, line: 484, baseType: !1594, size: 8, offset: 720)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "flag_no_peephole", scope: !1582, file: !1583, line: 485, baseType: !1594, size: 8, offset: 728)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "flag_peephole2", scope: !1582, file: !1583, line: 486, baseType: !1594, size: 8, offset: 736)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "flag_predictive_commoning", scope: !1582, file: !1583, line: 487, baseType: !1594, size: 8, offset: 744)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "flag_prefetch_loop_arrays", scope: !1582, file: !1583, line: 488, baseType: !1594, size: 8, offset: 752)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "flag_pcc_struct_return", scope: !1582, file: !1583, line: 489, baseType: !1594, size: 8, offset: 760)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "flag_rename_registers", scope: !1582, file: !1583, line: 490, baseType: !1594, size: 8, offset: 768)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "flag_reorder_blocks", scope: !1582, file: !1583, line: 491, baseType: !1594, size: 8, offset: 776)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "flag_reorder_blocks_and_partition", scope: !1582, file: !1583, line: 492, baseType: !1594, size: 8, offset: 784)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "flag_reorder_functions", scope: !1582, file: !1583, line: 493, baseType: !1594, size: 8, offset: 792)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "flag_rerun_cse_after_loop", scope: !1582, file: !1583, line: 494, baseType: !1594, size: 8, offset: 800)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "flag_resched_modulo_sched", scope: !1582, file: !1583, line: 495, baseType: !1594, size: 8, offset: 808)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "flag_rounding_math", scope: !1582, file: !1583, line: 496, baseType: !1594, size: 8, offset: 816)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_critical_path_heuristic", scope: !1582, file: !1583, line: 497, baseType: !1594, size: 8, offset: 824)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_dep_count_heuristic", scope: !1582, file: !1583, line: 498, baseType: !1594, size: 8, offset: 832)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_group_heuristic", scope: !1582, file: !1583, line: 499, baseType: !1594, size: 8, offset: 840)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_interblock", scope: !1582, file: !1583, line: 500, baseType: !1594, size: 8, offset: 848)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_last_insn_heuristic", scope: !1582, file: !1583, line: 501, baseType: !1594, size: 8, offset: 856)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_pressure", scope: !1582, file: !1583, line: 502, baseType: !1594, size: 8, offset: 864)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_rank_heuristic", scope: !1582, file: !1583, line: 503, baseType: !1594, size: 8, offset: 872)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_speculative", scope: !1582, file: !1583, line: 504, baseType: !1594, size: 8, offset: 880)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_spec_insn_heuristic", scope: !1582, file: !1583, line: 505, baseType: !1594, size: 8, offset: 888)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_speculative_load", scope: !1582, file: !1583, line: 506, baseType: !1594, size: 8, offset: 896)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_speculative_load_dangerous", scope: !1582, file: !1583, line: 507, baseType: !1594, size: 8, offset: 904)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched2_use_superblocks", scope: !1582, file: !1583, line: 508, baseType: !1594, size: 8, offset: 912)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_insns", scope: !1582, file: !1583, line: 509, baseType: !1594, size: 8, offset: 920)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_insns_after_reload", scope: !1582, file: !1583, line: 510, baseType: !1594, size: 8, offset: 928)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "flag_section_anchors", scope: !1582, file: !1583, line: 511, baseType: !1594, size: 8, offset: 936)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sel_sched_pipelining", scope: !1582, file: !1583, line: 512, baseType: !1594, size: 8, offset: 944)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sel_sched_pipelining_outer_loops", scope: !1582, file: !1583, line: 513, baseType: !1594, size: 8, offset: 952)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sel_sched_reschedule_pipelined", scope: !1582, file: !1583, line: 514, baseType: !1594, size: 8, offset: 960)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "flag_selective_scheduling", scope: !1582, file: !1583, line: 515, baseType: !1594, size: 8, offset: 968)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "flag_selective_scheduling2", scope: !1582, file: !1583, line: 516, baseType: !1594, size: 8, offset: 976)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "flag_signaling_nans", scope: !1582, file: !1583, line: 517, baseType: !1594, size: 8, offset: 984)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "flag_signed_zeros", scope: !1582, file: !1583, line: 518, baseType: !1594, size: 8, offset: 992)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "flag_single_precision_constant", scope: !1582, file: !1583, line: 519, baseType: !1594, size: 8, offset: 1000)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "flag_split_ivs_in_unroller", scope: !1582, file: !1583, line: 520, baseType: !1594, size: 8, offset: 1008)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "flag_split_wide_types", scope: !1582, file: !1583, line: 521, baseType: !1594, size: 8, offset: 1016)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "flag_strict_aliasing", scope: !1582, file: !1583, line: 522, baseType: !1594, size: 8, offset: 1024)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "flag_thread_jumps", scope: !1582, file: !1583, line: 523, baseType: !1594, size: 8, offset: 1032)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "flag_toplevel_reorder", scope: !1582, file: !1583, line: 524, baseType: !1594, size: 8, offset: 1040)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "flag_trapping_math", scope: !1582, file: !1583, line: 525, baseType: !1594, size: 8, offset: 1048)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "flag_trapv", scope: !1582, file: !1583, line: 526, baseType: !1594, size: 8, offset: 1056)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_builtin_call_dce", scope: !1582, file: !1583, line: 527, baseType: !1594, size: 8, offset: 1064)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_ccp", scope: !1582, file: !1583, line: 528, baseType: !1594, size: 8, offset: 1072)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_ch", scope: !1582, file: !1583, line: 529, baseType: !1594, size: 8, offset: 1080)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_copy_prop", scope: !1582, file: !1583, line: 530, baseType: !1594, size: 8, offset: 1088)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_copyrename", scope: !1582, file: !1583, line: 531, baseType: !1594, size: 8, offset: 1096)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_cselim", scope: !1582, file: !1583, line: 532, baseType: !1594, size: 8, offset: 1104)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_dce", scope: !1582, file: !1583, line: 533, baseType: !1594, size: 8, offset: 1112)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_dom", scope: !1582, file: !1583, line: 534, baseType: !1594, size: 8, offset: 1120)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_dse", scope: !1582, file: !1583, line: 535, baseType: !1594, size: 8, offset: 1128)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_forwprop", scope: !1582, file: !1583, line: 536, baseType: !1594, size: 8, offset: 1136)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_fre", scope: !1582, file: !1583, line: 537, baseType: !1594, size: 8, offset: 1144)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_loop_distribution", scope: !1582, file: !1583, line: 538, baseType: !1594, size: 8, offset: 1152)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_loop_im", scope: !1582, file: !1583, line: 539, baseType: !1594, size: 8, offset: 1160)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_loop_ivcanon", scope: !1582, file: !1583, line: 540, baseType: !1594, size: 8, offset: 1168)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_loop_linear", scope: !1582, file: !1583, line: 541, baseType: !1594, size: 8, offset: 1176)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_loop_optimize", scope: !1582, file: !1583, line: 542, baseType: !1594, size: 8, offset: 1184)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_live_range_split", scope: !1582, file: !1583, line: 543, baseType: !1594, size: 8, offset: 1192)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_phiprop", scope: !1582, file: !1583, line: 544, baseType: !1594, size: 8, offset: 1200)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_pre", scope: !1582, file: !1583, line: 545, baseType: !1594, size: 8, offset: 1208)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_pta", scope: !1582, file: !1583, line: 546, baseType: !1594, size: 8, offset: 1216)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_reassoc", scope: !1582, file: !1583, line: 547, baseType: !1594, size: 8, offset: 1224)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_scev_cprop", scope: !1582, file: !1583, line: 548, baseType: !1594, size: 8, offset: 1232)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_sink", scope: !1582, file: !1583, line: 549, baseType: !1594, size: 8, offset: 1240)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_slp_vectorize", scope: !1582, file: !1583, line: 550, baseType: !1594, size: 8, offset: 1248)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_sra", scope: !1582, file: !1583, line: 551, baseType: !1594, size: 8, offset: 1256)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_switch_conversion", scope: !1582, file: !1583, line: 552, baseType: !1594, size: 8, offset: 1264)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_ter", scope: !1582, file: !1583, line: 553, baseType: !1594, size: 8, offset: 1272)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_vect_loop_version", scope: !1582, file: !1583, line: 554, baseType: !1594, size: 8, offset: 1280)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_vectorize", scope: !1582, file: !1583, line: 555, baseType: !1594, size: 8, offset: 1288)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_vrp", scope: !1582, file: !1583, line: 556, baseType: !1594, size: 8, offset: 1296)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unit_at_a_time", scope: !1582, file: !1583, line: 557, baseType: !1594, size: 8, offset: 1304)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unroll_all_loops", scope: !1582, file: !1583, line: 558, baseType: !1594, size: 8, offset: 1312)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unroll_loops", scope: !1582, file: !1583, line: 559, baseType: !1594, size: 8, offset: 1320)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unsafe_loop_optimizations", scope: !1582, file: !1583, line: 560, baseType: !1594, size: 8, offset: 1328)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unsafe_math_optimizations", scope: !1582, file: !1583, line: 561, baseType: !1594, size: 8, offset: 1336)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unswitch_loops", scope: !1582, file: !1583, line: 562, baseType: !1594, size: 8, offset: 1344)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unwind_tables", scope: !1582, file: !1583, line: 563, baseType: !1594, size: 8, offset: 1352)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "flag_var_tracking", scope: !1582, file: !1583, line: 564, baseType: !1594, size: 8, offset: 1360)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "flag_var_tracking_assignments", scope: !1582, file: !1583, line: 565, baseType: !1594, size: 8, offset: 1368)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "flag_var_tracking_assignments_toggle", scope: !1582, file: !1583, line: 566, baseType: !1594, size: 8, offset: 1376)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "flag_var_tracking_uninit", scope: !1582, file: !1583, line: 567, baseType: !1594, size: 8, offset: 1384)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "flag_variable_expansion_in_unroller", scope: !1582, file: !1583, line: 568, baseType: !1594, size: 8, offset: 1392)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "flag_vect_cost_model", scope: !1582, file: !1583, line: 569, baseType: !1594, size: 8, offset: 1400)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "flag_value_profile_transformations", scope: !1582, file: !1583, line: 570, baseType: !1594, size: 8, offset: 1408)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "flag_web", scope: !1582, file: !1583, line: 571, baseType: !1594, size: 8, offset: 1416)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "flag_whole_program", scope: !1582, file: !1583, line: 572, baseType: !1594, size: 8, offset: 1424)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "flag_wpa", scope: !1582, file: !1583, line: 573, baseType: !1594, size: 8, offset: 1432)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "flag_wrapv", scope: !1582, file: !1583, line: 574, baseType: !1594, size: 8, offset: 1440)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "target_option", scope: !1116, file: !133, line: 3405, baseType: !1750, size: 384)
!1750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_target_option", file: !133, line: 3352, size: 384, elements: !1751)
!1751 = !{!1752, !1753}
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1750, file: !133, line: 3353, baseType: !1152, size: 192)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !1750, file: !133, line: 3356, baseType: !1754, size: 192, offset: 192)
!1754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cl_target_option", file: !1583, line: 578, size: 192, elements: !1755)
!1755 = !{!1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766}
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "ix86_isa_flags_explicit", scope: !1754, file: !1583, line: 580, baseType: !1104, size: 32)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "target_flags_explicit", scope: !1754, file: !1583, line: 581, baseType: !1104, size: 32, offset: 32)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "target_flags", scope: !1754, file: !1583, line: 582, baseType: !1104, size: 32, offset: 64)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "ix86_isa_flags", scope: !1754, file: !1583, line: 583, baseType: !1104, size: 32, offset: 96)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !1754, file: !1583, line: 584, baseType: !1103, size: 8, offset: 128)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "arch_specified", scope: !1754, file: !1583, line: 585, baseType: !1103, size: 8, offset: 136)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "branch_cost", scope: !1754, file: !1583, line: 586, baseType: !1103, size: 8, offset: 144)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "fpmath", scope: !1754, file: !1583, line: 587, baseType: !1103, size: 8, offset: 152)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "schedule", scope: !1754, file: !1583, line: 588, baseType: !1103, size: 8, offset: 160)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "tune", scope: !1754, file: !1583, line: 589, baseType: !1103, size: 8, offset: 168)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "tune_defaulted", scope: !1754, file: !1583, line: 590, baseType: !1103, size: 8, offset: 176)
!1767 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1768 = !{i32 2, !"Dwarf Version", i32 4}
!1769 = !{i32 2, !"Debug Info Version", i32 3}
!1770 = !{i32 1, !"wchar_size", i32 4}
!1771 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!1772 = distinct !DISubprogram(name: "vprintf", scope: !1773, file: !1773, line: 39, type: !1774, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1784)
!1773 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!1774 = !DISubroutineType(types: !1775)
!1775 = !{!1104, !1776, !1777}
!1776 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1109)
!1777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1778, size: 64)
!1778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, elements: !1779)
!1779 = !{!1780, !1781, !1782, !1783}
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !1778, file: !1, baseType: !5, size: 32)
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !1778, file: !1, baseType: !5, size: 32, offset: 32)
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !1778, file: !1, baseType: !1108, size: 64, offset: 64)
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !1778, file: !1, baseType: !1108, size: 64, offset: 128)
!1784 = !{!1785, !1786}
!1785 = !DILocalVariable(name: "__fmt", arg: 1, scope: !1772, file: !1773, line: 39, type: !1776)
!1786 = !DILocalVariable(name: "__arg", arg: 2, scope: !1772, file: !1773, line: 39, type: !1777)
!1787 = !DILocation(line: 0, scope: !1772)
!1788 = !DILocation(line: 41, column: 20, scope: !1772)
!1789 = !DILocation(line: 41, column: 10, scope: !1772)
!1790 = !DILocation(line: 41, column: 3, scope: !1772)
!1791 = distinct !DISubprogram(name: "getchar", scope: !1773, file: !1773, line: 47, type: !1792, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1794)
!1792 = !DISubroutineType(types: !1793)
!1793 = !{!1104}
!1794 = !{}
!1795 = !DILocation(line: 49, column: 16, scope: !1791)
!1796 = !DILocation(line: 49, column: 10, scope: !1791)
!1797 = !DILocation(line: 49, column: 3, scope: !1791)
!1798 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !1773, file: !1773, line: 56, type: !1799, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1853)
!1799 = !DISubroutineType(types: !1800)
!1800 = !{!1104, !1801}
!1801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1802, size: 64)
!1802 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1803, line: 7, baseType: !1804)
!1803 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!1804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1805, line: 49, size: 1728, elements: !1806)
!1805 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!1806 = !{!1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1822, !1824, !1825, !1826, !1829, !1830, !1831, !1832, !1835, !1837, !1840, !1843, !1844, !1845, !1848, !1849}
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1804, file: !1805, line: 51, baseType: !1104, size: 32)
!1808 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1804, file: !1805, line: 54, baseType: !1106, size: 64, offset: 64)
!1809 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1804, file: !1805, line: 55, baseType: !1106, size: 64, offset: 128)
!1810 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1804, file: !1805, line: 56, baseType: !1106, size: 64, offset: 192)
!1811 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1804, file: !1805, line: 57, baseType: !1106, size: 64, offset: 256)
!1812 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1804, file: !1805, line: 58, baseType: !1106, size: 64, offset: 320)
!1813 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1804, file: !1805, line: 59, baseType: !1106, size: 64, offset: 384)
