; ModuleID = 'cpp_directives.bc'
source_filename = "cpp_directives.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.directive = type { void (%struct.cpp_reader*)*, i8*, i16, i8, i8 }
%struct.cpp_reader = type { %struct.cpp_buffer*, %struct.cpp_buffer*, %struct.lexer_state, %struct.line_maps*, i32, %struct._cpp_buff*, %struct._cpp_buff*, %struct._cpp_buff*, %struct.cpp_context, %struct.cpp_context*, %struct.directive*, %struct.cpp_token, i32, i8, %struct.cpp_dir*, %struct.cpp_dir*, %struct.cpp_dir, %struct._cpp_file*, %struct._cpp_file*, %struct.htab*, %struct.htab*, %struct.file_hash_entry_pool*, %struct.htab*, %struct.obstack, i8, i8, %struct.cpp_hashnode*, %struct.cpp_hashnode*, i8, %struct.cpp_token*, %struct.tokenrun, %struct.tokenrun*, i32, i32, i8*, i32, %struct.cset_converter, %struct.cset_converter, %struct.cset_converter, %struct.cset_converter, %struct.cset_converter, i8*, i8*, %struct.cpp_token, %struct.cpp_token, %struct.deps*, %struct.obstack, %struct.obstack, %struct.pragma_entry*, %struct.cpp_callbacks, %struct.ht*, %struct.op*, %struct.op*, %struct.cpp_options, %struct.spec_nodes, i8, %struct.anon.3, i8*, i8*, i8*, %struct.cpp_savedstate*, i32, %struct.cpp_comment_table, %struct.def_pragma_macro* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "dtable", scope: !2, file: !3, line: 184, type: !668, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !56, globals: !663, nameTableKind: None)
!3 = !DIFile(filename: "cpp_directives.c", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!4 = !{!5, !19, !31, !37, !42, !49}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cpp_builtin_type", file: !6, line: 593, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./cpplib.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!9 = !DIEnumerator(name: "BT_SPECLINE", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "BT_DATE", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "BT_FILE", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "BT_BASE_FILE", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "BT_INCLUDE_LEVEL", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "BT_TIME", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "BT_STDC", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "BT_PRAGMA", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "BT_TIMESTAMP", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "BT_COUNTER", value: 9, isUnsigned: true)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_lang", file: !6, line: 158, baseType: !7, size: 32, elements: !20)
!20 = !{!21, !22, !23, !24, !25, !26, !27, !28, !29, !30}
!21 = !DIEnumerator(name: "CLK_GNUC89", value: 0, isUnsigned: true)
!22 = !DIEnumerator(name: "CLK_GNUC99", value: 1, isUnsigned: true)
!23 = !DIEnumerator(name: "CLK_STDC89", value: 2, isUnsigned: true)
!24 = !DIEnumerator(name: "CLK_STDC94", value: 3, isUnsigned: true)
!25 = !DIEnumerator(name: "CLK_STDC99", value: 4, isUnsigned: true)
!26 = !DIEnumerator(name: "CLK_GNUCXX", value: 5, isUnsigned: true)
!27 = !DIEnumerator(name: "CLK_CXX98", value: 6, isUnsigned: true)
!28 = !DIEnumerator(name: "CLK_GNUCXX0X", value: 7, isUnsigned: true)
!29 = !DIEnumerator(name: "CLK_CXX0X", value: 8, isUnsigned: true)
!30 = !DIEnumerator(name: "CLK_ASM", value: 9, isUnsigned: true)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cpp_normalize_level", file: !6, line: 265, baseType: !7, size: 32, elements: !32)
!32 = !{!33, !34, !35, !36}
!33 = !DIEnumerator(name: "normalized_KC", value: 0, isUnsigned: true)
!34 = !DIEnumerator(name: "normalized_C", value: 1, isUnsigned: true)
!35 = !DIEnumerator(name: "normalized_identifier_C", value: 2, isUnsigned: true)
!36 = !DIEnumerator(name: "normalized_none", value: 3, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cpp_deps_style", file: !6, line: 262, baseType: !7, size: 32, elements: !38)
!38 = !{!39, !40, !41}
!39 = !DIEnumerator(name: "DEPS_NONE", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "DEPS_USER", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "DEPS_SYSTEM", value: 2, isUnsigned: true)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "lc_reason", file: !43, line: 36, baseType: !7, size: 32, elements: !44)
!43 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!44 = !{!45, !46, !47, !48}
!45 = !DIEnumerator(name: "LC_ENTER", value: 0, isUnsigned: true)
!46 = !DIEnumerator(name: "LC_LEAVE", value: 1, isUnsigned: true)
!47 = !DIEnumerator(name: "LC_RENAME", value: 2, isUnsigned: true)
!48 = !DIEnumerator(name: "LC_RENAME_VERBATIM", value: 3, isUnsigned: true)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "include_type", file: !50, line: 119, baseType: !7, size: 32, elements: !51)
!50 = !DIFile(filename: "./internal.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!51 = !{!52, !53, !54, !55}
!52 = !DIEnumerator(name: "IT_INCLUDE", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "IT_INCLUDE_NEXT", value: 1, isUnsigned: true)
!54 = !DIEnumerator(name: "IT_IMPORT", value: 2, isUnsigned: true)
!55 = !DIEnumerator(name: "IT_CMDLINE", value: 3, isUnsigned: true)
!56 = !{!57, !58, !59, !61, !64, !234, !7, !236, !238, !90, !201, !138, !130, !169, !241, !655, !328, !361, !319, !228}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!63 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_buffer", file: !6, line: 32, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_buffer", file: !50, line: 249, size: 1536, elements: !67)
!67 = !{!68, !69, !70, !71, !72, !73, !80, !81, !82, !83, !85, !88, !89, !184, !185, !186, !187, !188, !189, !218}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !66, file: !50, line: 251, baseType: !61, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "line_base", scope: !66, file: !50, line: 252, baseType: !61, size: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "next_line", scope: !66, file: !50, line: 253, baseType: !61, size: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !66, file: !50, line: 255, baseType: !61, size: 64, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit", scope: !66, file: !50, line: 256, baseType: !61, size: 64, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "notes", scope: !66, file: !50, line: 258, baseType: !74, size: 64, offset: 320)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cpp_line_note", file: !50, line: 235, baseType: !76)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_line_note", file: !50, line: 236, size: 128, elements: !77)
!77 = !{!78, !79}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !76, file: !50, line: 239, baseType: !61, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !76, file: !50, line: 245, baseType: !7, size: 32, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "cur_note", scope: !66, file: !50, line: 259, baseType: !7, size: 32, offset: 384)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "notes_used", scope: !66, file: !50, line: 260, baseType: !7, size: 32, offset: 416)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "notes_cap", scope: !66, file: !50, line: 261, baseType: !7, size: 32, offset: 448)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !66, file: !50, line: 263, baseType: !84, size: 64, offset: 512)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !66, file: !50, line: 267, baseType: !86, size: 64, offset: 576)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_file", file: !6, line: 42, flags: DIFlagFwdDecl)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !66, file: !50, line: 271, baseType: !61, size: 64, offset: 640)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "if_stack", scope: !66, file: !50, line: 275, baseType: !90, size: 64, offset: 704)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "if_stack", file: !3, line: 33, size: 256, elements: !92)
!92 = !{!93, !94, !96, !180, !181, !182}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !91, file: !3, line: 35, baseType: !90, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !91, file: !3, line: 36, baseType: !95, size: 32, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "linenum_type", file: !43, line: 39, baseType: !7)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "mi_cmacro", scope: !91, file: !3, line: 37, baseType: !97, size: 64, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !99)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_hashnode", file: !6, line: 36, baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_hashnode", file: !6, line: 644, size: 256, elements: !101)
!101 = !{!102, !109, !110, !111, !112, !113, !114}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !100, file: !6, line: 645, baseType: !103, size: 128)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !104, line: 31, size: 128, elements: !105)
!104 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!105 = !{!106, !107, !108}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !103, file: !104, line: 32, baseType: !61, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !103, file: !104, line: 33, baseType: !7, size: 32, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !103, file: !104, line: 34, baseType: !7, size: 32, offset: 96)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "is_directive", scope: !100, file: !6, line: 646, baseType: !7, size: 1, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "directive_index", scope: !100, file: !6, line: 647, baseType: !7, size: 7, offset: 129, flags: DIFlagBitField, extraData: i64 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "rid_code", scope: !100, file: !6, line: 650, baseType: !63, size: 8, offset: 136)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !100, file: !6, line: 651, baseType: !7, size: 6, offset: 144, flags: DIFlagBitField, extraData: i64 144)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !100, file: !6, line: 652, baseType: !7, size: 10, offset: 150, flags: DIFlagBitField, extraData: i64 144)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !100, file: !6, line: 654, baseType: !115, size: 64, offset: 192)
!115 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_cpp_hashnode_value", file: !6, line: 633, size: 64, elements: !116)
!116 = !{!117, !168, !178, !179}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !115, file: !6, line: 635, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_macro", file: !6, line: 37, baseType: !120)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_macro", file: !121, line: 36, size: 256, elements: !122)
!121 = !DIFile(filename: "./cpp-id-data.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!122 = !{!123, !126, !159, !160, !161, !162, !163, !164, !165, !166, !167}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !120, file: !121, line: 42, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !120, file: !121, line: 51, baseType: !127, size: 64, offset: 64)
!127 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cpp_macro_u", file: !121, line: 47, size: 64, elements: !128)
!128 = !{!129, !158}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "tokens", scope: !127, file: !121, line: 49, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_token", file: !6, line: 34, baseType: !132)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_token", file: !6, line: 212, size: 192, elements: !133)
!133 = !{!134, !136, !137, !139}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "src_loc", scope: !132, file: !6, line: 213, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !43, line: 44, baseType: !7)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !132, file: !6, line: 214, baseType: !7, size: 8, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !132, file: !6, line: 215, baseType: !138, size: 16, offset: 48)
!138 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !132, file: !6, line: 237, baseType: !140, size: 128, offset: 64)
!140 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cpp_token_u", file: !6, line: 217, size: 128, elements: !141)
!141 = !{!142, !146, !147, !152, !156, !157}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !140, file: !6, line: 220, baseType: !143, size: 64)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_identifier", file: !6, line: 201, size: 64, elements: !144)
!144 = !{!145}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !143, file: !6, line: 207, baseType: !125, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !140, file: !6, line: 223, baseType: !130, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !140, file: !6, line: 226, baseType: !148, size: 128)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_string", file: !6, line: 162, size: 128, elements: !149)
!149 = !{!150, !151}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !148, file: !6, line: 163, baseType: !7, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !148, file: !6, line: 164, baseType: !61, size: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "macro_arg", scope: !140, file: !6, line: 229, baseType: !153, size: 32)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_macro_arg", file: !6, line: 195, size: 32, elements: !154)
!154 = !{!155}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "arg_no", scope: !153, file: !6, line: 197, baseType: !7, size: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "token_no", scope: !140, file: !6, line: 233, baseType: !7, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "pragma", scope: !140, file: !6, line: 236, baseType: !7, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !127, file: !121, line: 50, baseType: !61, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !120, file: !121, line: 54, baseType: !135, size: 32, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !120, file: !121, line: 57, baseType: !7, size: 32, offset: 160)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "paramc", scope: !120, file: !121, line: 60, baseType: !138, size: 16, offset: 192)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "fun_like", scope: !120, file: !121, line: 63, baseType: !7, size: 1, offset: 208, flags: DIFlagBitField, extraData: i64 208)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "variadic", scope: !120, file: !121, line: 66, baseType: !7, size: 1, offset: 209, flags: DIFlagBitField, extraData: i64 208)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "syshdr", scope: !120, file: !121, line: 69, baseType: !7, size: 1, offset: 210, flags: DIFlagBitField, extraData: i64 208)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !120, file: !121, line: 72, baseType: !7, size: 1, offset: 211, flags: DIFlagBitField, extraData: i64 208)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "traditional", scope: !120, file: !121, line: 75, baseType: !7, size: 1, offset: 212, flags: DIFlagBitField, extraData: i64 208)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "extra_tokens", scope: !120, file: !121, line: 80, baseType: !7, size: 1, offset: 213, flags: DIFlagBitField, extraData: i64 208)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "answers", scope: !115, file: !6, line: 637, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "answer", file: !121, line: 28, size: 320, elements: !171)
!171 = !{!172, !173, !174}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !170, file: !121, line: 29, baseType: !169, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !170, file: !121, line: 30, baseType: !7, size: 32, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !170, file: !121, line: 31, baseType: !175, size: 192, offset: 128)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 192, elements: !176)
!176 = !{!177}
!177 = !DISubrange(count: 1)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "builtin", scope: !115, file: !6, line: 639, baseType: !5, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "arg_index", scope: !115, file: !6, line: 641, baseType: !138, size: 16)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "skip_elses", scope: !91, file: !3, line: 38, baseType: !63, size: 8, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "was_skipping", scope: !91, file: !3, line: 39, baseType: !63, size: 8, offset: 200)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !91, file: !3, line: 40, baseType: !183, size: 32, offset: 224)
!183 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "need_line", scope: !66, file: !50, line: 278, baseType: !63, size: 8, offset: 768)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "warned_cplusplus_comments", scope: !66, file: !50, line: 284, baseType: !7, size: 1, offset: 776, flags: DIFlagBitField, extraData: i64 776)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "from_stage3", scope: !66, file: !50, line: 289, baseType: !7, size: 1, offset: 777, flags: DIFlagBitField, extraData: i64 776)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "return_at_eof", scope: !66, file: !50, line: 294, baseType: !7, size: 1, offset: 778, flags: DIFlagBitField, extraData: i64 776)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !66, file: !50, line: 298, baseType: !63, size: 8, offset: 784)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !66, file: !50, line: 302, baseType: !190, size: 512, offset: 832)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_dir", file: !6, line: 523, size: 512, elements: !191)
!191 = !{!192, !194, !195, !196, !197, !198, !199, !203, !209, !215}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !190, file: !6, line: 526, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !190, file: !6, line: 529, baseType: !59, size: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !190, file: !6, line: 530, baseType: !7, size: 32, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !190, file: !6, line: 534, baseType: !63, size: 8, offset: 160)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "user_supplied_p", scope: !190, file: !6, line: 537, baseType: !63, size: 8, offset: 168)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "canonical_name", scope: !190, file: !6, line: 541, baseType: !59, size: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "name_map", scope: !190, file: !6, line: 545, baseType: !200, size: 64, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "construct", scope: !190, file: !6, line: 551, baseType: !204, size: 64, offset: 320)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!59, !201, !207}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_dir", file: !6, line: 39, baseType: !190)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !190, file: !6, line: 555, baseType: !210, size: 64, offset: 384)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !211, line: 47, baseType: !212)
!211 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !213, line: 148, baseType: !214)
!213 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!214 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !190, file: !6, line: 556, baseType: !216, size: 64, offset: 448)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !211, line: 59, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !213, line: 145, baseType: !214)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "input_cset_desc", scope: !66, file: !50, line: 306, baseType: !219, size: 192, offset: 1344)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cset_converter", file: !50, line: 47, size: 192, elements: !220)
!220 = !{!221, !232, !233}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !219, file: !50, line: 49, baseType: !222, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "convert_f", file: !50, line: 45, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!63, !226, !61, !228, !230}
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "iconv_t", file: !227, line: 29, baseType: !57)
!227 = !DIFile(filename: "/usr/include/iconv.h", directory: "")
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !229, line: 46, baseType: !214)
!229 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_strbuf", file: !50, line: 43, flags: DIFlagFwdDecl)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "cd", scope: !219, file: !50, line: 50, baseType: !226, size: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !219, file: !50, line: 51, baseType: !183, size: 32, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !229, line: 35, baseType: !235)
!235 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !121, line: 22, baseType: !63)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pragma_entry", file: !3, line: 45, size: 256, elements: !243)
!243 = !{!244, !245, !246, !247, !248, !249, !250}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !242, file: !3, line: 47, baseType: !241, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "pragma", scope: !242, file: !3, line: 48, baseType: !97, size: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "is_nspace", scope: !242, file: !3, line: 49, baseType: !63, size: 8, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "is_internal", scope: !242, file: !3, line: 50, baseType: !63, size: 8, offset: 136)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "is_deferred", scope: !242, file: !3, line: 51, baseType: !63, size: 8, offset: 144)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "allow_expansion", scope: !242, file: !3, line: 52, baseType: !63, size: 8, offset: 152)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !242, file: !3, line: 57, baseType: !251, size: 64, offset: 192)
!251 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !242, file: !3, line: 53, size: 64, elements: !252)
!252 = !{!253, !661, !662}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !251, file: !3, line: 54, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "pragma_cb", file: !3, line: 44, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{null, !258}
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_reader", file: !6, line: 31, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_reader", file: !50, line: 322, size: 10432, elements: !261)
!261 = !{!262, !263, !264, !281, !310, !311, !322, !323, !324, !351, !353, !366, !367, !368, !369, !370, !371, !372, !373, !374, !377, !378, !381, !382, !414, !415, !416, !417, !418, !419, !420, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !446, !447, !448, !449, !526, !552, !555, !556, !619, !626, !627, !634, !635, !636, !637, !640, !641, !654}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !260, file: !50, line: 325, baseType: !64, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "overlaid_buffer", scope: !260, file: !50, line: 328, baseType: !64, size: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !260, file: !50, line: 331, baseType: !265, size: 160, offset: 128)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lexer_state", file: !50, line: 177, size: 160, elements: !266)
!266 = !{!267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "in_directive", scope: !265, file: !50, line: 180, baseType: !63, size: 8)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "directive_wants_padding", scope: !265, file: !50, line: 185, baseType: !63, size: 8, offset: 8)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "skipping", scope: !265, file: !50, line: 188, baseType: !63, size: 8, offset: 16)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "angled_headers", scope: !265, file: !50, line: 191, baseType: !63, size: 8, offset: 24)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "in_expression", scope: !265, file: !50, line: 194, baseType: !63, size: 8, offset: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "save_comments", scope: !265, file: !50, line: 198, baseType: !63, size: 8, offset: 40)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "va_args_ok", scope: !265, file: !50, line: 201, baseType: !63, size: 8, offset: 48)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "poisoned_ok", scope: !265, file: !50, line: 204, baseType: !63, size: 8, offset: 56)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "prevent_expansion", scope: !265, file: !50, line: 207, baseType: !63, size: 8, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "parsing_args", scope: !265, file: !50, line: 210, baseType: !63, size: 8, offset: 72)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "discarding_output", scope: !265, file: !50, line: 214, baseType: !63, size: 8, offset: 80)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "skip_eval", scope: !265, file: !50, line: 217, baseType: !7, size: 32, offset: 96)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "in_deferred_pragma", scope: !265, file: !50, line: 220, baseType: !63, size: 8, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "pragma_allow_expansion", scope: !265, file: !50, line: 223, baseType: !63, size: 8, offset: 136)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "line_table", scope: !260, file: !50, line: 334, baseType: !282, size: 64, offset: 320)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line_maps", file: !43, line: 74, size: 448, elements: !284)
!284 = !{!285, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "maps", scope: !283, file: !43, line: 75, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line_map", file: !43, line: 61, size: 192, elements: !288)
!288 = !{!289, !290, !291, !292, !293, !294, !295}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "to_file", scope: !287, file: !43, line: 62, baseType: !201, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "to_line", scope: !287, file: !43, line: 63, baseType: !95, size: 32, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "start_location", scope: !287, file: !43, line: 64, baseType: !135, size: 32, offset: 96)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "included_from", scope: !287, file: !43, line: 65, baseType: !183, size: 32, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !287, file: !43, line: 66, baseType: !7, size: 8, offset: 160, flags: DIFlagBitField, extraData: i64 160)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !287, file: !43, line: 68, baseType: !63, size: 8, offset: 168)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "column_bits", scope: !287, file: !43, line: 70, baseType: !7, size: 8, offset: 176, flags: DIFlagBitField, extraData: i64 176)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !283, file: !43, line: 76, baseType: !7, size: 32, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !283, file: !43, line: 77, baseType: !7, size: 32, offset: 96)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !283, file: !43, line: 79, baseType: !7, size: 32, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "last_listed", scope: !283, file: !43, line: 84, baseType: !183, size: 32, offset: 160)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !283, file: !43, line: 87, baseType: !7, size: 32, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "trace_includes", scope: !283, file: !43, line: 90, baseType: !63, size: 8, offset: 224)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "highest_location", scope: !283, file: !43, line: 93, baseType: !135, size: 32, offset: 256)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "highest_line", scope: !283, file: !43, line: 96, baseType: !135, size: 32, offset: 288)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "max_column_hint", scope: !283, file: !43, line: 100, baseType: !7, size: 32, offset: 320)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "reallocator", scope: !283, file: !43, line: 104, baseType: !306, size: 64, offset: 384)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "line_map_realloc", file: !43, line: 47, baseType: !307)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DISubroutineType(types: !309)
!309 = !{!57, !57, !228}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "directive_line", scope: !260, file: !50, line: 337, baseType: !135, size: 32, offset: 384)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "a_buff", scope: !260, file: !50, line: 340, baseType: !312, size: 64, offset: 448)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cpp_buff", file: !50, line: 99, baseType: !314)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_buff", file: !50, line: 100, size: 256, elements: !315)
!315 = !{!316, !318, !320, !321}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !314, file: !50, line: 102, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !314, file: !50, line: 103, baseType: !319, size: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !314, file: !50, line: 103, baseType: !319, size: 64, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !314, file: !50, line: 103, baseType: !319, size: 64, offset: 192)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "u_buff", scope: !260, file: !50, line: 341, baseType: !312, size: 64, offset: 512)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "free_buffs", scope: !260, file: !50, line: 342, baseType: !312, size: 64, offset: 576)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "base_context", scope: !260, file: !50, line: 345, baseType: !325, size: 448, offset: 640)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_context", file: !50, line: 142, size: 448, elements: !326)
!326 = !{!327, !330, !331, !348, !349, !350}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !325, file: !50, line: 145, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_context", file: !50, line: 141, baseType: !325)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !325, file: !50, line: 145, baseType: !328, size: 64, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !325, file: !50, line: 164, baseType: !332, size: 128, offset: 128)
!332 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !325, file: !50, line: 147, size: 128, elements: !333)
!333 = !{!334, !343}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "iso", scope: !332, file: !50, line: 156, baseType: !335, size: 128)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !332, file: !50, line: 152, size: 128, elements: !336)
!336 = !{!337, !342}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !335, file: !50, line: 154, baseType: !338, size: 64)
!338 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "utoken", file: !50, line: 121, size: 64, elements: !339)
!339 = !{!340, !341}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !338, file: !50, line: 123, baseType: !239, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ptoken", scope: !338, file: !50, line: 124, baseType: !238, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !335, file: !50, line: 155, baseType: !338, size: 64, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "trad", scope: !332, file: !50, line: 163, baseType: !344, size: 128)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !332, file: !50, line: 159, size: 128, elements: !345)
!345 = !{!346, !347}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !344, file: !50, line: 161, baseType: !61, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit", scope: !344, file: !50, line: 162, baseType: !61, size: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !325, file: !50, line: 168, baseType: !312, size: 64, offset: 256)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !325, file: !50, line: 171, baseType: !125, size: 64, offset: 320)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "direct_p", scope: !325, file: !50, line: 174, baseType: !63, size: 8, offset: 384)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !260, file: !50, line: 346, baseType: !352, size: 64, offset: 1088)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "directive", scope: !260, file: !50, line: 349, baseType: !354, size: 64, offset: 1152)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !356)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "directive", file: !3, line: 84, size: 192, elements: !357)
!357 = !{!358, !360, !363, !364, !365}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !356, file: !3, line: 86, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "directive_handler", file: !3, line: 82, baseType: !255)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !356, file: !3, line: 87, baseType: !361, size: 64, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !237)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !356, file: !3, line: 88, baseType: !138, size: 16, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !356, file: !3, line: 89, baseType: !63, size: 8, offset: 144)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !356, file: !3, line: 90, baseType: !63, size: 8, offset: 152)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "directive_result", scope: !260, file: !50, line: 352, baseType: !131, size: 192, offset: 1216)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "invocation_location", scope: !260, file: !50, line: 356, baseType: !135, size: 32, offset: 1408)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "set_invocation_location", scope: !260, file: !50, line: 360, baseType: !63, size: 8, offset: 1440)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "quote_include", scope: !260, file: !50, line: 363, baseType: !193, size: 64, offset: 1472)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "bracket_include", scope: !260, file: !50, line: 364, baseType: !193, size: 64, offset: 1536)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "no_search_path", scope: !260, file: !50, line: 365, baseType: !190, size: 512, offset: 1600)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "all_files", scope: !260, file: !50, line: 368, baseType: !86, size: 64, offset: 2112)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "main_file", scope: !260, file: !50, line: 370, baseType: !86, size: 64, offset: 2176)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "file_hash", scope: !260, file: !50, line: 373, baseType: !375, size: 64, offset: 2240)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !50, line: 373, flags: DIFlagFwdDecl)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "dir_hash", scope: !260, file: !50, line: 374, baseType: !375, size: 64, offset: 2304)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "file_hash_entries", scope: !260, file: !50, line: 375, baseType: !379, size: 64, offset: 2368)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "file_hash_entry_pool", file: !50, line: 375, flags: DIFlagFwdDecl)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "nonexistent_file_hash", scope: !260, file: !50, line: 378, baseType: !375, size: 64, offset: 2432)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "nonexistent_file_ob", scope: !260, file: !50, line: 379, baseType: !383, size: 704, offset: 2496)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !384, line: 164, size: 704, elements: !385)
!384 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!385 = !{!386, !387, !397, !398, !399, !400, !401, !402, !406, !410, !411, !412, !413}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !383, file: !384, line: 166, baseType: !235, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !383, file: !384, line: 167, baseType: !388, size: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !384, line: 157, size: 192, elements: !390)
!390 = !{!391, !392, !393}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !389, file: !384, line: 159, baseType: !59, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !389, file: !384, line: 160, baseType: !388, size: 64, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !389, file: !384, line: 161, baseType: !394, size: 32, offset: 128)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 32, elements: !395)
!395 = !{!396}
!396 = !DISubrange(count: 4)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !383, file: !384, line: 168, baseType: !59, size: 64, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !383, file: !384, line: 169, baseType: !59, size: 64, offset: 192)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !383, file: !384, line: 170, baseType: !59, size: 64, offset: 256)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !383, file: !384, line: 171, baseType: !235, size: 64, offset: 320)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !383, file: !384, line: 172, baseType: !183, size: 32, offset: 384)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !383, file: !384, line: 176, baseType: !403, size: 64, offset: 448)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!388, !57, !235}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !383, file: !384, line: 177, baseType: !407, size: 64, offset: 512)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{null, !57, !388}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !383, file: !384, line: 178, baseType: !57, size: 64, offset: 576)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !383, file: !384, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !383, file: !384, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !383, file: !384, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "quote_ignores_source_dir", scope: !260, file: !50, line: 383, baseType: !63, size: 8, offset: 3200)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "seen_once_only", scope: !260, file: !50, line: 387, baseType: !63, size: 8, offset: 3208)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "mi_cmacro", scope: !260, file: !50, line: 390, baseType: !97, size: 64, offset: 3264)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "mi_ind_cmacro", scope: !260, file: !50, line: 391, baseType: !97, size: 64, offset: 3328)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "mi_valid", scope: !260, file: !50, line: 392, baseType: !63, size: 8, offset: 3392)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "cur_token", scope: !260, file: !50, line: 395, baseType: !130, size: 64, offset: 3456)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "base_run", scope: !260, file: !50, line: 396, baseType: !421, size: 256, offset: 3520)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "tokenrun", file: !50, line: 128, baseType: !422)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tokenrun", file: !50, line: 129, size: 256, elements: !423)
!423 = !{!424, !426, !427, !428}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !422, file: !50, line: 131, baseType: !425, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !422, file: !50, line: 131, baseType: !425, size: 64, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !422, file: !50, line: 132, baseType: !130, size: 64, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !422, file: !50, line: 132, baseType: !130, size: 64, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "cur_run", scope: !260, file: !50, line: 396, baseType: !425, size: 64, offset: 3776)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "lookaheads", scope: !260, file: !50, line: 397, baseType: !7, size: 32, offset: 3840)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "keep_tokens", scope: !260, file: !50, line: 400, baseType: !7, size: 32, offset: 3872)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "macro_buffer", scope: !260, file: !50, line: 403, baseType: !319, size: 64, offset: 3904)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "macro_buffer_len", scope: !260, file: !50, line: 404, baseType: !7, size: 32, offset: 3968)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "narrow_cset_desc", scope: !260, file: !50, line: 408, baseType: !219, size: 192, offset: 4032)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_cset_desc", scope: !260, file: !50, line: 412, baseType: !219, size: 192, offset: 4224)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "char16_cset_desc", scope: !260, file: !50, line: 416, baseType: !219, size: 192, offset: 4416)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "char32_cset_desc", scope: !260, file: !50, line: 420, baseType: !219, size: 192, offset: 4608)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "wide_cset_desc", scope: !260, file: !50, line: 424, baseType: !219, size: 192, offset: 4800)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !260, file: !50, line: 427, baseType: !61, size: 64, offset: 4992)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !260, file: !50, line: 428, baseType: !61, size: 64, offset: 5056)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "avoid_paste", scope: !260, file: !50, line: 431, baseType: !131, size: 192, offset: 5120)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !260, file: !50, line: 432, baseType: !131, size: 192, offset: 5312)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "deps", scope: !260, file: !50, line: 435, baseType: !444, size: 64, offset: 5504)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "deps", file: !6, line: 685, flags: DIFlagFwdDecl)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "hash_ob", scope: !260, file: !50, line: 439, baseType: !383, size: 704, offset: 5568)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_ob", scope: !260, file: !50, line: 443, baseType: !383, size: 704, offset: 6272)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "pragmas", scope: !260, file: !50, line: 447, baseType: !241, size: 64, offset: 6976)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !260, file: !50, line: 450, baseType: !450, size: 1088, offset: 7040)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_callbacks", file: !6, line: 472, size: 1088, elements: !451)
!451 = !{!452, !456, !462, !466, !470, !474, !475, !482, !486, !490, !494, !500, !504, !519, !520, !521, !522}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "line_change", scope: !450, file: !6, line: 475, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{null, !258, !239, !183}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "file_change", scope: !450, file: !6, line: 481, baseType: !457, size: 64, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{null, !258, !460}
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !287)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "dir_change", scope: !450, file: !6, line: 483, baseType: !463, size: 64, offset: 128)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{null, !258, !201}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "include", scope: !450, file: !6, line: 484, baseType: !467, size: 64, offset: 192)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{null, !258, !7, !61, !201, !183, !238}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "define", scope: !450, file: !6, line: 486, baseType: !471, size: 64, offset: 256)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{null, !258, !7, !125}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "undef", scope: !450, file: !6, line: 487, baseType: !471, size: 64, offset: 320)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !450, file: !6, line: 488, baseType: !476, size: 64, offset: 384)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{null, !258, !7, !479}
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !481)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_string", file: !6, line: 35, baseType: !148)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "def_pragma", scope: !450, file: !6, line: 489, baseType: !483, size: 64, offset: 448)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DISubroutineType(types: !485)
!485 = !{null, !258, !7}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "valid_pch", scope: !450, file: !6, line: 490, baseType: !487, size: 64, offset: 512)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DISubroutineType(types: !489)
!489 = !{!183, !258, !201, !183}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "read_pch", scope: !450, file: !6, line: 491, baseType: !491, size: 64, offset: 576)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{null, !258, !201, !183, !201}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "missing_header", scope: !450, file: !6, line: 492, baseType: !495, size: 64, offset: 640)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "missing_header_cb", file: !6, line: 469, baseType: !496)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DISubroutineType(types: !498)
!498 = !{!201, !258, !201, !499}
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "macro_to_expand", scope: !450, file: !6, line: 496, baseType: !501, size: 64, offset: 704)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DISubroutineType(types: !503)
!503 = !{!125, !258, !239}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !450, file: !6, line: 500, baseType: !505, size: 64, offset: 768)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DISubroutineType(types: !507)
!507 = !{!63, !258, !183, !135, !7, !201, !508}
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !510, line: 14, baseType: !511)
!510 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stdarg.h", directory: "")
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 216, baseType: !512)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !513, size: 192, elements: !176)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 216, size: 192, elements: !514)
!514 = !{!515, !516, !517, !518}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !513, file: !3, line: 216, baseType: !7, size: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !513, file: !3, line: 216, baseType: !7, size: 32, offset: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !513, file: !3, line: 216, baseType: !57, size: 64, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !513, file: !3, line: 216, baseType: !57, size: 64, offset: 128)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "used_define", scope: !450, file: !6, line: 506, baseType: !471, size: 64, offset: 832)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "used_undef", scope: !450, file: !6, line: 507, baseType: !471, size: 64, offset: 896)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "before_define", scope: !450, file: !6, line: 510, baseType: !255, size: 64, offset: 960)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !450, file: !6, line: 513, baseType: !523, size: 64, offset: 1024)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{null, !258, !135, !125}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "hash_table", scope: !260, file: !50, line: 453, baseType: !527, size: 64, offset: 8128)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht", file: !104, line: 46, size: 1152, elements: !529)
!529 = !{!530, !531, !535, !541, !545, !546, !547, !549, !550, !551}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !528, file: !104, line: 49, baseType: !383, size: 704)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !528, file: !104, line: 51, baseType: !532, size: 64, offset: 704)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashnode", file: !104, line: 41, baseType: !534)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_node", scope: !528, file: !104, line: 53, baseType: !536, size: 64, offset: 768)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{!533, !539}
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_table", file: !104, line: 40, baseType: !528)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_subobject", scope: !528, file: !104, line: 56, baseType: !542, size: 64, offset: 832)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{!57, !228}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "nslots", scope: !528, file: !104, line: 58, baseType: !7, size: 32, offset: 896)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "nelements", scope: !528, file: !104, line: 59, baseType: !7, size: 32, offset: 928)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "pfile", scope: !528, file: !104, line: 62, baseType: !548, size: 64, offset: 960)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !528, file: !104, line: 65, baseType: !7, size: 32, offset: 1024)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !528, file: !104, line: 66, baseType: !7, size: 32, offset: 1056)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "entries_owned", scope: !528, file: !104, line: 69, baseType: !63, size: 8, offset: 1088)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "op_stack", scope: !260, file: !50, line: 456, baseType: !553, size: 64, offset: 8192)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DICompositeType(tag: DW_TAG_structure_type, name: "op", file: !50, line: 42, flags: DIFlagFwdDecl)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "op_limit", scope: !260, file: !50, line: 456, baseType: !553, size: 64, offset: 8256)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !260, file: !50, line: 459, baseType: !557, size: 1024, offset: 8320)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_options", file: !6, line: 279, size: 1024, elements: !558)
!558 = !{!559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !610, !611, !612, !613, !614, !615, !616, !617, !618}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "tabstop", scope: !557, file: !6, line: 282, baseType: !7, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "lang", scope: !557, file: !6, line: 285, baseType: !19, size: 32, offset: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "cplusplus", scope: !557, file: !6, line: 288, baseType: !63, size: 8, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "cplusplus_comments", scope: !557, file: !6, line: 291, baseType: !63, size: 8, offset: 72)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "objc", scope: !557, file: !6, line: 296, baseType: !63, size: 8, offset: 80)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "discard_comments", scope: !557, file: !6, line: 299, baseType: !63, size: 8, offset: 88)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "discard_comments_in_macro_exp", scope: !557, file: !6, line: 303, baseType: !63, size: 8, offset: 96)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "trigraphs", scope: !557, file: !6, line: 306, baseType: !63, size: 8, offset: 104)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "digraphs", scope: !557, file: !6, line: 309, baseType: !63, size: 8, offset: 112)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "extended_numbers", scope: !557, file: !6, line: 312, baseType: !63, size: 8, offset: 120)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "uliterals", scope: !557, file: !6, line: 315, baseType: !63, size: 8, offset: 128)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "print_include_names", scope: !557, file: !6, line: 318, baseType: !63, size: 8, offset: 136)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "warn_deprecated", scope: !557, file: !6, line: 321, baseType: !63, size: 8, offset: 144)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "warn_comments", scope: !557, file: !6, line: 324, baseType: !63, size: 8, offset: 152)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "warn_missing_include_dirs", scope: !557, file: !6, line: 328, baseType: !63, size: 8, offset: 160)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "warn_trigraphs", scope: !557, file: !6, line: 331, baseType: !63, size: 8, offset: 168)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "warn_multichar", scope: !557, file: !6, line: 334, baseType: !63, size: 8, offset: 176)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "warn_traditional", scope: !557, file: !6, line: 338, baseType: !63, size: 8, offset: 184)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "warn_long_long", scope: !557, file: !6, line: 341, baseType: !63, size: 8, offset: 192)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "warn_endif_labels", scope: !557, file: !6, line: 344, baseType: !63, size: 8, offset: 200)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "warn_num_sign_change", scope: !557, file: !6, line: 348, baseType: !63, size: 8, offset: 208)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "warn_variadic_macros", scope: !557, file: !6, line: 352, baseType: !63, size: 8, offset: 216)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "warn_builtin_macro_redefined", scope: !557, file: !6, line: 356, baseType: !63, size: 8, offset: 224)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !557, file: !6, line: 360, baseType: !63, size: 8, offset: 232)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "dollars_in_ident", scope: !557, file: !6, line: 363, baseType: !63, size: 8, offset: 240)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "extended_identifiers", scope: !557, file: !6, line: 366, baseType: !63, size: 8, offset: 248)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "warn_dollars", scope: !557, file: !6, line: 370, baseType: !63, size: 8, offset: 256)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "warn_undef", scope: !557, file: !6, line: 373, baseType: !63, size: 8, offset: 264)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "warn_unused_macros", scope: !557, file: !6, line: 376, baseType: !63, size: 8, offset: 272)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "c99", scope: !557, file: !6, line: 379, baseType: !63, size: 8, offset: 280)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "std", scope: !557, file: !6, line: 382, baseType: !63, size: 8, offset: 288)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "pedantic", scope: !557, file: !6, line: 385, baseType: !63, size: 8, offset: 296)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "preprocessed", scope: !557, file: !6, line: 389, baseType: !63, size: 8, offset: 304)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "show_column", scope: !557, file: !6, line: 392, baseType: !63, size: 8, offset: 312)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "operator_names", scope: !557, file: !6, line: 395, baseType: !63, size: 8, offset: 320)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "warn_cxx_operator_names", scope: !557, file: !6, line: 398, baseType: !63, size: 8, offset: 328)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "traditional", scope: !557, file: !6, line: 401, baseType: !63, size: 8, offset: 336)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "narrow_charset", scope: !557, file: !6, line: 404, baseType: !201, size: 64, offset: 384)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "wide_charset", scope: !557, file: !6, line: 407, baseType: !201, size: 64, offset: 448)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "input_charset", scope: !557, file: !6, line: 410, baseType: !201, size: 64, offset: 512)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "warn_normalize", scope: !557, file: !6, line: 414, baseType: !31, size: 32, offset: 576)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "warn_invalid_pch", scope: !557, file: !6, line: 417, baseType: !63, size: 8, offset: 608)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "restore_pch_deps", scope: !557, file: !6, line: 420, baseType: !63, size: 8, offset: 616)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "deps", scope: !557, file: !6, line: 441, baseType: !603, size: 64, offset: 640)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !557, file: !6, line: 423, size: 64, elements: !604)
!604 = !{!605, !606, !607, !608, !609}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !603, file: !6, line: 426, baseType: !37, size: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "missing_files", scope: !603, file: !6, line: 429, baseType: !63, size: 8, offset: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "phony_targets", scope: !603, file: !6, line: 433, baseType: !63, size: 8, offset: 40)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_main_file", scope: !603, file: !6, line: 436, baseType: !63, size: 8, offset: 48)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "need_preprocessor_output", scope: !603, file: !6, line: 440, baseType: !63, size: 8, offset: 56)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !557, file: !6, line: 447, baseType: !228, size: 64, offset: 704)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "char_precision", scope: !557, file: !6, line: 447, baseType: !228, size: 64, offset: 768)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "int_precision", scope: !557, file: !6, line: 447, baseType: !228, size: 64, offset: 832)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "wchar_precision", scope: !557, file: !6, line: 447, baseType: !228, size: 64, offset: 896)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_char", scope: !557, file: !6, line: 450, baseType: !63, size: 8, offset: 960)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_wchar", scope: !557, file: !6, line: 450, baseType: !63, size: 8, offset: 968)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_big_endian", scope: !557, file: !6, line: 454, baseType: !63, size: 8, offset: 976)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "stdc_0_in_system_headers", scope: !557, file: !6, line: 457, baseType: !63, size: 8, offset: 984)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "directives_only", scope: !557, file: !6, line: 460, baseType: !63, size: 8, offset: 992)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "spec_nodes", scope: !260, file: !50, line: 463, baseType: !620, size: 256, offset: 9344)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spec_nodes", file: !50, line: 227, size: 256, elements: !621)
!621 = !{!622, !623, !624, !625}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "n_defined", scope: !620, file: !50, line: 229, baseType: !125, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "n_true", scope: !620, file: !50, line: 230, baseType: !125, size: 64, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "n_false", scope: !620, file: !50, line: 231, baseType: !125, size: 64, offset: 128)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "n__VA_ARGS__", scope: !620, file: !50, line: 232, baseType: !125, size: 64, offset: 192)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "our_hashtable", scope: !260, file: !50, line: 466, baseType: !63, size: 8, offset: 9600)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !260, file: !50, line: 475, baseType: !628, size: 256, offset: 9664)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !260, file: !50, line: 469, size: 256, elements: !629)
!629 = !{!630, !631, !632, !633}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !628, file: !50, line: 471, baseType: !319, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !628, file: !50, line: 472, baseType: !319, size: 64, offset: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !628, file: !50, line: 473, baseType: !319, size: 64, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "first_line", scope: !628, file: !50, line: 474, baseType: !135, size: 32, offset: 192)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "saved_cur", scope: !260, file: !50, line: 478, baseType: !61, size: 64, offset: 9920)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "saved_rlimit", scope: !260, file: !50, line: 478, baseType: !61, size: 64, offset: 9984)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "saved_line_base", scope: !260, file: !50, line: 478, baseType: !61, size: 64, offset: 10048)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "savedstate", scope: !260, file: !50, line: 482, baseType: !638, size: 64, offset: 10112)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_savedstate", file: !50, line: 482, flags: DIFlagFwdDecl)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !260, file: !50, line: 485, baseType: !7, size: 32, offset: 10176)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "comments", scope: !260, file: !50, line: 488, baseType: !642, size: 128, offset: 10240)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_comment_table", file: !6, line: 901, baseType: !643)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 891, size: 128, elements: !644)
!644 = !{!645, !652, !653}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !643, file: !6, line: 894, baseType: !646, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_comment", file: !6, line: 887, baseType: !648)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 880, size: 128, elements: !649)
!649 = !{!650, !651}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !648, file: !6, line: 883, baseType: !59, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "sloc", scope: !648, file: !6, line: 886, baseType: !135, size: 32, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !643, file: !6, line: 897, baseType: !183, size: 32, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !643, file: !6, line: 900, baseType: !183, size: 32, offset: 96)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "pushed_macros", scope: !260, file: !50, line: 491, baseType: !655, size: 64, offset: 10368)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_pragma_macro", file: !50, line: 310, size: 192, elements: !657)
!657 = !{!658, !659, !660}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !656, file: !50, line: 312, baseType: !655, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !656, file: !50, line: 314, baseType: !59, size: 64, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !656, file: !50, line: 316, baseType: !118, size: 64, offset: 128)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !251, file: !3, line: 55, baseType: !241, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !251, file: !3, line: 56, baseType: !7, size: 32)
!663 = !{!0, !664}
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(name: "linemarker_dir", scope: !2, file: !3, line: 194, type: !666, isLocal: true, isDefinition: true)
!666 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "directive", file: !3, line: 83, baseType: !356)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !666, size: 3648, elements: !669)
!669 = !{!670}
!670 = !DISubrange(count: 19)
!671 = !{i32 2, !"Dwarf Version", i32 4}
!672 = !{i32 2, !"Debug Info Version", i32 3}
!673 = !{i32 1, !"wchar_size", i32 4}
!674 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!675 = distinct !DISubprogram(name: "tolower", scope: !676, file: !676, line: 207, type: !677, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !679)
!676 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!677 = !DISubroutineType(types: !678)
!678 = !{!183, !183}
!679 = !{!680}
!680 = !DILocalVariable(name: "__c", arg: 1, scope: !675, file: !676, line: 207, type: !183)
!681 = !DILocation(line: 0, scope: !675)
!682 = !DILocation(line: 209, column: 22, scope: !675)
!683 = !DILocation(line: 209, column: 39, scope: !675)
!684 = !DILocation(line: 209, column: 38, scope: !675)
!685 = !DILocation(line: 209, column: 37, scope: !675)
!686 = !DILocation(line: 209, column: 10, scope: !675)
!687 = !DILocation(line: 209, column: 3, scope: !675)
!688 = distinct !DISubprogram(name: "toupper", scope: !676, file: !676, line: 213, type: !677, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !689)
!689 = !{!690}
!690 = !DILocalVariable(name: "__c", arg: 1, scope: !688, file: !676, line: 213, type: !183)
!691 = !DILocation(line: 0, scope: !688)
!692 = !DILocation(line: 215, column: 22, scope: !688)
!693 = !DILocation(line: 215, column: 39, scope: !688)
!694 = !DILocation(line: 215, column: 38, scope: !688)
!695 = !DILocation(line: 215, column: 37, scope: !688)
!696 = !DILocation(line: 215, column: 10, scope: !688)
!697 = !DILocation(line: 215, column: 3, scope: !688)
!698 = distinct !DISubprogram(name: "_cpp_handle_directive", scope: !3, file: !3, line: 391, type: !699, scopeLine: 392, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !701)
!699 = !DISubroutineType(types: !700)
!700 = !{!183, !258, !183}
!701 = !{!702, !703, !704, !706, !707, !708, !709}
!702 = !DILocalVariable(name: "pfile", arg: 1, scope: !698, file: !3, line: 391, type: !258)
!703 = !DILocalVariable(name: "indented", arg: 2, scope: !698, file: !3, line: 391, type: !183)
!704 = !DILocalVariable(name: "dir", scope: !698, file: !3, line: 393, type: !705)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!706 = !DILocalVariable(name: "dname", scope: !698, file: !3, line: 394, type: !239)
!707 = !DILocalVariable(name: "was_parsing_args", scope: !698, file: !3, line: 395, type: !63)
!708 = !DILocalVariable(name: "was_discarding_output", scope: !698, file: !3, line: 396, type: !63)
!709 = !DILocalVariable(name: "skip", scope: !698, file: !3, line: 397, type: !183)
!710 = !DILocation(line: 0, scope: !698)
!711 = !DILocation(line: 395, column: 40, scope: !698)
!712 = !DILocation(line: 396, column: 45, scope: !698)
!713 = !DILocation(line: 399, column: 7, scope: !714)
!714 = distinct !DILexicalBlock(scope: !698, file: !3, line: 399, column: 7)
!715 = !DILocation(line: 399, column: 7, scope: !698)
