; ModuleID = 'cpp_macro.bc'
source_filename = "cpp_macro.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.cpp_reader = type { %struct.cpp_buffer*, %struct.cpp_buffer*, %struct.lexer_state, %struct.line_maps*, i32, %struct._cpp_buff*, %struct._cpp_buff*, %struct._cpp_buff*, %struct.cpp_context, %struct.cpp_context*, %struct.directive*, %struct.cpp_token, i32, i8, %struct.cpp_dir*, %struct.cpp_dir*, %struct.cpp_dir, %struct._cpp_file*, %struct._cpp_file*, %struct.htab*, %struct.htab*, %struct.file_hash_entry_pool*, %struct.htab*, %struct.obstack, i8, i8, %struct.cpp_hashnode*, %struct.cpp_hashnode*, i8, %struct.cpp_token*, %struct.tokenrun, %struct.tokenrun*, i32, i32, i8*, i32, %struct.cset_converter, %struct.cset_converter, %struct.cset_converter, %struct.cset_converter, %struct.cset_converter, i8*, i8*, %struct.cpp_token, %struct.cpp_token, %struct.deps*, %struct.obstack, %struct.obstack, %struct.pragma_entry*, %struct.cpp_callbacks, %struct.ht*, %struct.op*, %struct.op*, %struct.cpp_options, %struct.spec_nodes, i8, %struct.anon.2, i8*, i8*, i8*, %struct.cpp_savedstate*, i32, %struct.cpp_comment_table, %struct.def_pragma_macro* }
%struct.cpp_buffer = type { i8*, i8*, i8*, i8*, i8*, %struct._cpp_line_note*, i32, i32, i32, %struct.cpp_buffer*, %struct._cpp_file*, i8*, %struct.if_stack*, i8, i8, i8, %struct.cpp_dir, %struct.cset_converter }
%struct._cpp_line_note = type { i8*, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "monthnames", scope: !2, file: !3, line: 109, type: !196, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !42, globals: !195, nameTableKind: None)
!3 = !DIFile(filename: "cpp_macro.c", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!4 = !{!5, !19, !31, !37}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cpp_builtin_type", file: !6, line: 593, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./cpplib.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!9 = !DIEnumerator(name: "BT_SPECLINE", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "BT_DATE", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "BT_FILE", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "BT_BASE_FILE", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "BT_INCLUDE_LEVEL", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "BT_TIME", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "BT_STDC", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "BT_PRAGMA", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "BT_TIMESTAMP", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "BT_COUNTER", value: 9, isUnsigned: true)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_lang", file: !6, line: 158, baseType: !7, size: 32, elements: !20)
!20 = !{!21, !22, !23, !24, !25, !26, !27, !28, !29, !30}
!21 = !DIEnumerator(name: "CLK_GNUC89", value: 0, isUnsigned: true)
!22 = !DIEnumerator(name: "CLK_GNUC99", value: 1, isUnsigned: true)
!23 = !DIEnumerator(name: "CLK_STDC89", value: 2, isUnsigned: true)
!24 = !DIEnumerator(name: "CLK_STDC94", value: 3, isUnsigned: true)
!25 = !DIEnumerator(name: "CLK_STDC99", value: 4, isUnsigned: true)
!26 = !DIEnumerator(name: "CLK_GNUCXX", value: 5, isUnsigned: true)
!27 = !DIEnumerator(name: "CLK_CXX98", value: 6, isUnsigned: true)
!28 = !DIEnumerator(name: "CLK_GNUCXX0X", value: 7, isUnsigned: true)
!29 = !DIEnumerator(name: "CLK_CXX0X", value: 8, isUnsigned: true)
!30 = !DIEnumerator(name: "CLK_ASM", value: 9, isUnsigned: true)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cpp_normalize_level", file: !6, line: 265, baseType: !7, size: 32, elements: !32)
!32 = !{!33, !34, !35, !36}
!33 = !DIEnumerator(name: "normalized_KC", value: 0, isUnsigned: true)
!34 = !DIEnumerator(name: "normalized_C", value: 1, isUnsigned: true)
!35 = !DIEnumerator(name: "normalized_identifier_C", value: 2, isUnsigned: true)
!36 = !DIEnumerator(name: "normalized_none", value: 3, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cpp_deps_style", file: !6, line: 262, baseType: !7, size: 32, elements: !38)
!38 = !{!39, !40, !41}
!39 = !DIEnumerator(name: "DEPS_NONE", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "DEPS_USER", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "DEPS_SYSTEM", value: 2, isUnsigned: true)
!42 = !{!43, !44, !46, !49, !54, !57, !139, !140, !78, !141, !144, !88, !183, !164, !192, !193, !97}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!48 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !50, line: 7, baseType: !51)
!50 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !52, line: 160, baseType: !53)
!52 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!53 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !55, line: 46, baseType: !56)
!55 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!56 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_hashnode", file: !6, line: 36, baseType: !60)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_hashnode", file: !6, line: 644, size: 256, elements: !61)
!61 = !{!62, !69, !70, !71, !72, !73, !74}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !60, file: !6, line: 645, baseType: !63, size: 128)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !64, line: 31, size: 128, elements: !65)
!64 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!65 = !{!66, !67, !68}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !63, file: !64, line: 32, baseType: !46, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !63, file: !64, line: 33, baseType: !7, size: 32, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !63, file: !64, line: 34, baseType: !7, size: 32, offset: 96)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "is_directive", scope: !60, file: !6, line: 646, baseType: !7, size: 1, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "directive_index", scope: !60, file: !6, line: 647, baseType: !7, size: 7, offset: 129, flags: DIFlagBitField, extraData: i64 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "rid_code", scope: !60, file: !6, line: 650, baseType: !48, size: 8, offset: 136)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !60, file: !6, line: 651, baseType: !7, size: 6, offset: 144, flags: DIFlagBitField, extraData: i64 144)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !60, file: !6, line: 652, baseType: !7, size: 10, offset: 150, flags: DIFlagBitField, extraData: i64 144)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !60, file: !6, line: 654, baseType: !75, size: 64, offset: 192)
!75 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_cpp_hashnode_value", file: !6, line: 633, size: 64, elements: !76)
!76 = !{!77, !127, !137, !138}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !75, file: !6, line: 635, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_macro", file: !6, line: 37, baseType: !80)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_macro", file: !81, line: 36, size: 256, elements: !82)
!81 = !DIFile(filename: "./cpp-id-data.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!82 = !{!83, !84, !118, !119, !120, !121, !122, !123, !124, !125, !126}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !80, file: !81, line: 42, baseType: !57, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !80, file: !81, line: 51, baseType: !85, size: 64, offset: 64)
!85 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cpp_macro_u", file: !81, line: 47, size: 64, elements: !86)
!86 = !{!87, !117}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "tokens", scope: !85, file: !81, line: 49, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_token", file: !6, line: 34, baseType: !90)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_token", file: !6, line: 212, size: 192, elements: !91)
!91 = !{!92, !95, !96, !98}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "src_loc", scope: !90, file: !6, line: 213, baseType: !93, size: 32)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !94, line: 44, baseType: !7)
!94 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!95 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !90, file: !6, line: 214, baseType: !7, size: 8, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !90, file: !6, line: 215, baseType: !97, size: 16, offset: 48)
!97 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !90, file: !6, line: 237, baseType: !99, size: 128, offset: 64)
!99 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cpp_token_u", file: !6, line: 217, size: 128, elements: !100)
!100 = !{!101, !105, !106, !111, !115, !116}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !99, file: !6, line: 220, baseType: !102, size: 64)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_identifier", file: !6, line: 201, size: 64, elements: !103)
!103 = !{!104}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !102, file: !6, line: 207, baseType: !58, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !99, file: !6, line: 223, baseType: !88, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !99, file: !6, line: 226, baseType: !107, size: 128)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_string", file: !6, line: 162, size: 128, elements: !108)
!108 = !{!109, !110}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !107, file: !6, line: 163, baseType: !7, size: 32)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !107, file: !6, line: 164, baseType: !46, size: 64, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "macro_arg", scope: !99, file: !6, line: 229, baseType: !112, size: 32)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_macro_arg", file: !6, line: 195, size: 32, elements: !113)
!113 = !{!114}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "arg_no", scope: !112, file: !6, line: 197, baseType: !7, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "token_no", scope: !99, file: !6, line: 233, baseType: !7, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "pragma", scope: !99, file: !6, line: 236, baseType: !7, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !85, file: !81, line: 50, baseType: !46, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !80, file: !81, line: 54, baseType: !93, size: 32, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !80, file: !81, line: 57, baseType: !7, size: 32, offset: 160)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "paramc", scope: !80, file: !81, line: 60, baseType: !97, size: 16, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "fun_like", scope: !80, file: !81, line: 63, baseType: !7, size: 1, offset: 208, flags: DIFlagBitField, extraData: i64 208)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "variadic", scope: !80, file: !81, line: 66, baseType: !7, size: 1, offset: 209, flags: DIFlagBitField, extraData: i64 208)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "syshdr", scope: !80, file: !81, line: 69, baseType: !7, size: 1, offset: 210, flags: DIFlagBitField, extraData: i64 208)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !80, file: !81, line: 72, baseType: !7, size: 1, offset: 211, flags: DIFlagBitField, extraData: i64 208)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "traditional", scope: !80, file: !81, line: 75, baseType: !7, size: 1, offset: 212, flags: DIFlagBitField, extraData: i64 208)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "extra_tokens", scope: !80, file: !81, line: 80, baseType: !7, size: 1, offset: 213, flags: DIFlagBitField, extraData: i64 208)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "answers", scope: !75, file: !6, line: 637, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "answer", file: !81, line: 28, size: 320, elements: !130)
!130 = !{!131, !132, !133}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !129, file: !81, line: 29, baseType: !128, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !129, file: !81, line: 30, baseType: !7, size: 32, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !129, file: !81, line: 31, baseType: !134, size: 192, offset: 128)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 192, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 1)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "builtin", scope: !75, file: !6, line: 639, baseType: !5, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "arg_index", scope: !75, file: !6, line: 641, baseType: !97, size: 16)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !81, line: 22, baseType: !48)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_context", file: !146, line: 141, baseType: !147)
!146 = !DIFile(filename: "./internal.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_context", file: !146, line: 142, size: 448, elements: !148)
!148 = !{!149, !150, !151, !171, !181, !182}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !147, file: !146, line: 145, baseType: !144, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !147, file: !146, line: 145, baseType: !144, size: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !147, file: !146, line: 164, baseType: !152, size: 128, offset: 128)
!152 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !147, file: !146, line: 147, size: 128, elements: !153)
!153 = !{!154, !166}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "iso", scope: !152, file: !146, line: 156, baseType: !155, size: 128)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !152, file: !146, line: 152, size: 128, elements: !156)
!156 = !{!157, !165}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !155, file: !146, line: 154, baseType: !158, size: 64)
!158 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "utoken", file: !146, line: 121, size: 64, elements: !159)
!159 = !{!160, !163}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !158, file: !146, line: 123, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !89)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "ptoken", scope: !158, file: !146, line: 124, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !155, file: !146, line: 155, baseType: !158, size: 64, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "trad", scope: !152, file: !146, line: 163, baseType: !167, size: 128)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !152, file: !146, line: 159, size: 128, elements: !168)
!168 = !{!169, !170}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !167, file: !146, line: 161, baseType: !46, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit", scope: !167, file: !146, line: 162, baseType: !46, size: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !147, file: !146, line: 168, baseType: !172, size: 64, offset: 256)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cpp_buff", file: !146, line: 99, baseType: !174)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_buff", file: !146, line: 100, size: 256, elements: !175)
!175 = !{!176, !178, !179, !180}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !174, file: !146, line: 102, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !174, file: !146, line: 103, baseType: !139, size: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !174, file: !146, line: 103, baseType: !139, size: 64, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !174, file: !146, line: 103, baseType: !139, size: 64, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !147, file: !146, line: 171, baseType: !58, size: 64, offset: 320)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "direct_p", scope: !147, file: !146, line: 174, baseType: !48, size: 8, offset: 384)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "macro_arg", file: !3, line: 33, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "macro_arg", file: !3, line: 34, size: 256, elements: !186)
!186 = !{!187, !188, !189, !190, !191}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !185, file: !3, line: 36, baseType: !164, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "expanded", scope: !185, file: !3, line: 37, baseType: !164, size: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "stringified", scope: !185, file: !3, line: 38, baseType: !161, size: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !185, file: !3, line: 39, baseType: !7, size: 32, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "expanded_count", scope: !185, file: !3, line: 40, baseType: !7, size: 32, offset: 224)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!195 = !{!0}
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 768, elements: !198)
!197 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !193)
!198 = !{!199}
!199 = !DISubrange(count: 12)
!200 = !{i32 2, !"Dwarf Version", i32 4}
!201 = !{i32 2, !"Debug Info Version", i32 3}
!202 = !{i32 1, !"wchar_size", i32 4}
!203 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!204 = distinct !DISubprogram(name: "tolower", scope: !205, file: !205, line: 207, type: !206, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !209)
!205 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!206 = !DISubroutineType(types: !207)
!207 = !{!208, !208}
!208 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!209 = !{!210}
!210 = !DILocalVariable(name: "__c", arg: 1, scope: !204, file: !205, line: 207, type: !208)
!211 = !DILocation(line: 0, scope: !204)
!212 = !DILocation(line: 209, column: 22, scope: !204)
!213 = !DILocation(line: 209, column: 39, scope: !204)
!214 = !DILocation(line: 209, column: 38, scope: !204)
!215 = !DILocation(line: 209, column: 37, scope: !204)
!216 = !DILocation(line: 209, column: 10, scope: !204)
!217 = !DILocation(line: 209, column: 3, scope: !204)
!218 = distinct !DISubprogram(name: "toupper", scope: !205, file: !205, line: 213, type: !206, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !219)
!219 = !{!220}
!220 = !DILocalVariable(name: "__c", arg: 1, scope: !218, file: !205, line: 213, type: !208)
!221 = !DILocation(line: 0, scope: !218)
!222 = !DILocation(line: 215, column: 22, scope: !218)
!223 = !DILocation(line: 215, column: 39, scope: !218)
!224 = !DILocation(line: 215, column: 38, scope: !218)
!225 = !DILocation(line: 215, column: 37, scope: !218)
!226 = !DILocation(line: 215, column: 10, scope: !218)
!227 = !DILocation(line: 215, column: 3, scope: !218)
!228 = distinct !DISubprogram(name: "_cpp_warn_if_unused_macro", scope: !3, file: !3, line: 78, type: !229, scopeLine: 80, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !669)
!229 = !DISubroutineType(types: !230)
!230 = !{!208, !231, !58, !43}
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_reader", file: !6, line: 31, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_reader", file: !146, line: 322, size: 10432, elements: !234)
!234 = !{!235, !308, !309, !326, !356, !357, !358, !359, !360, !361, !363, !367, !368, !369, !370, !371, !372, !373, !374, !375, !378, !379, !382, !383, !415, !416, !417, !420, !421, !422, !423, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !449, !450, !451, !454, !534, !560, !563, !564, !627, !634, !635, !642, !643, !644, !645, !648, !649, !662}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !233, file: !146, line: 325, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_buffer", file: !6, line: 32, baseType: !238)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_buffer", file: !146, line: 249, size: 1536, elements: !239)
!239 = !{!240, !241, !242, !243, !244, !245, !252, !253, !254, !255, !257, !260, !261, !264, !265, !266, !267, !268, !269, !294}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !238, file: !146, line: 251, baseType: !46, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "line_base", scope: !238, file: !146, line: 252, baseType: !46, size: 64, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "next_line", scope: !238, file: !146, line: 253, baseType: !46, size: 64, offset: 128)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !238, file: !146, line: 255, baseType: !46, size: 64, offset: 192)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit", scope: !238, file: !146, line: 256, baseType: !46, size: 64, offset: 256)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "notes", scope: !238, file: !146, line: 258, baseType: !246, size: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cpp_line_note", file: !146, line: 235, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_line_note", file: !146, line: 236, size: 128, elements: !249)
!249 = !{!250, !251}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !248, file: !146, line: 239, baseType: !46, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !248, file: !146, line: 245, baseType: !7, size: 32, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "cur_note", scope: !238, file: !146, line: 259, baseType: !7, size: 32, offset: 384)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "notes_used", scope: !238, file: !146, line: 260, baseType: !7, size: 32, offset: 416)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "notes_cap", scope: !238, file: !146, line: 261, baseType: !7, size: 32, offset: 448)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !238, file: !146, line: 263, baseType: !256, size: 64, offset: 512)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !238, file: !146, line: 267, baseType: !258, size: 64, offset: 576)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_file", file: !6, line: 42, flags: DIFlagFwdDecl)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !238, file: !146, line: 271, baseType: !46, size: 64, offset: 640)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "if_stack", scope: !238, file: !146, line: 275, baseType: !262, size: 64, offset: 704)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "if_stack", file: !146, line: 275, flags: DIFlagFwdDecl)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "need_line", scope: !238, file: !146, line: 278, baseType: !48, size: 8, offset: 768)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "warned_cplusplus_comments", scope: !238, file: !146, line: 284, baseType: !7, size: 1, offset: 776, flags: DIFlagBitField, extraData: i64 776)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "from_stage3", scope: !238, file: !146, line: 289, baseType: !7, size: 1, offset: 777, flags: DIFlagBitField, extraData: i64 776)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "return_at_eof", scope: !238, file: !146, line: 294, baseType: !7, size: 1, offset: 778, flags: DIFlagBitField, extraData: i64 776)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !238, file: !146, line: 298, baseType: !48, size: 8, offset: 784)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !238, file: !146, line: 302, baseType: !270, size: 512, offset: 832)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_dir", file: !6, line: 523, size: 512, elements: !271)
!271 = !{!272, !274, !275, !276, !277, !278, !279, !281, !287, !291}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !270, file: !6, line: 526, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !270, file: !6, line: 529, baseType: !44, size: 64, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !270, file: !6, line: 530, baseType: !7, size: 32, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !270, file: !6, line: 534, baseType: !48, size: 8, offset: 160)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "user_supplied_p", scope: !270, file: !6, line: 537, baseType: !48, size: 8, offset: 168)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "canonical_name", scope: !270, file: !6, line: 541, baseType: !44, size: 64, offset: 192)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "name_map", scope: !270, file: !6, line: 545, baseType: !280, size: 64, offset: 256)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "construct", scope: !270, file: !6, line: 551, baseType: !282, size: 64, offset: 320)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!44, !193, !285}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_dir", file: !6, line: 39, baseType: !270)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !270, file: !6, line: 555, baseType: !288, size: 64, offset: 384)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !289, line: 47, baseType: !290)
!289 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !52, line: 148, baseType: !56)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !270, file: !6, line: 556, baseType: !292, size: 64, offset: 448)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !289, line: 59, baseType: !293)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !52, line: 145, baseType: !56)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "input_cset_desc", scope: !238, file: !146, line: 306, baseType: !295, size: 192, offset: 1344)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cset_converter", file: !146, line: 47, size: 192, elements: !296)
!296 = !{!297, !306, !307}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !295, file: !146, line: 49, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "convert_f", file: !146, line: 45, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!48, !302, !46, !54, !304}
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "iconv_t", file: !303, line: 29, baseType: !43)
!303 = !DIFile(filename: "/usr/include/iconv.h", directory: "")
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_strbuf", file: !146, line: 43, flags: DIFlagFwdDecl)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "cd", scope: !295, file: !146, line: 50, baseType: !302, size: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !295, file: !146, line: 51, baseType: !208, size: 32, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "overlaid_buffer", scope: !233, file: !146, line: 328, baseType: !236, size: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !233, file: !146, line: 331, baseType: !310, size: 160, offset: 128)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lexer_state", file: !146, line: 177, size: 160, elements: !311)
!311 = !{!312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "in_directive", scope: !310, file: !146, line: 180, baseType: !48, size: 8)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "directive_wants_padding", scope: !310, file: !146, line: 185, baseType: !48, size: 8, offset: 8)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "skipping", scope: !310, file: !146, line: 188, baseType: !48, size: 8, offset: 16)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "angled_headers", scope: !310, file: !146, line: 191, baseType: !48, size: 8, offset: 24)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "in_expression", scope: !310, file: !146, line: 194, baseType: !48, size: 8, offset: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "save_comments", scope: !310, file: !146, line: 198, baseType: !48, size: 8, offset: 40)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "va_args_ok", scope: !310, file: !146, line: 201, baseType: !48, size: 8, offset: 48)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "poisoned_ok", scope: !310, file: !146, line: 204, baseType: !48, size: 8, offset: 56)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "prevent_expansion", scope: !310, file: !146, line: 207, baseType: !48, size: 8, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "parsing_args", scope: !310, file: !146, line: 210, baseType: !48, size: 8, offset: 72)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "discarding_output", scope: !310, file: !146, line: 214, baseType: !48, size: 8, offset: 80)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "skip_eval", scope: !310, file: !146, line: 217, baseType: !7, size: 32, offset: 96)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "in_deferred_pragma", scope: !310, file: !146, line: 220, baseType: !48, size: 8, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "pragma_allow_expansion", scope: !310, file: !146, line: 223, baseType: !48, size: 8, offset: 136)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "line_table", scope: !233, file: !146, line: 334, baseType: !327, size: 64, offset: 320)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line_maps", file: !94, line: 74, size: 448, elements: !329)
!329 = !{!330, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "maps", scope: !328, file: !94, line: 75, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line_map", file: !94, line: 61, size: 192, elements: !333)
!333 = !{!334, !335, !337, !338, !339, !340, !341}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "to_file", scope: !332, file: !94, line: 62, baseType: !193, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "to_line", scope: !332, file: !94, line: 63, baseType: !336, size: 32, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "linenum_type", file: !94, line: 39, baseType: !7)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "start_location", scope: !332, file: !94, line: 64, baseType: !93, size: 32, offset: 96)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "included_from", scope: !332, file: !94, line: 65, baseType: !208, size: 32, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !332, file: !94, line: 66, baseType: !7, size: 8, offset: 160, flags: DIFlagBitField, extraData: i64 160)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !332, file: !94, line: 68, baseType: !48, size: 8, offset: 168)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "column_bits", scope: !332, file: !94, line: 70, baseType: !7, size: 8, offset: 176, flags: DIFlagBitField, extraData: i64 176)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !328, file: !94, line: 76, baseType: !7, size: 32, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !328, file: !94, line: 77, baseType: !7, size: 32, offset: 96)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !328, file: !94, line: 79, baseType: !7, size: 32, offset: 128)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "last_listed", scope: !328, file: !94, line: 84, baseType: !208, size: 32, offset: 160)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !328, file: !94, line: 87, baseType: !7, size: 32, offset: 192)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "trace_includes", scope: !328, file: !94, line: 90, baseType: !48, size: 8, offset: 224)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "highest_location", scope: !328, file: !94, line: 93, baseType: !93, size: 32, offset: 256)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "highest_line", scope: !328, file: !94, line: 96, baseType: !93, size: 32, offset: 288)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "max_column_hint", scope: !328, file: !94, line: 100, baseType: !7, size: 32, offset: 320)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "reallocator", scope: !328, file: !94, line: 104, baseType: !352, size: 64, offset: 384)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "line_map_realloc", file: !94, line: 47, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{!43, !43, !54}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "directive_line", scope: !233, file: !146, line: 337, baseType: !93, size: 32, offset: 384)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "a_buff", scope: !233, file: !146, line: 340, baseType: !172, size: 64, offset: 448)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "u_buff", scope: !233, file: !146, line: 341, baseType: !172, size: 64, offset: 512)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "free_buffs", scope: !233, file: !146, line: 342, baseType: !172, size: 64, offset: 576)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "base_context", scope: !233, file: !146, line: 345, baseType: !147, size: 448, offset: 640)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !233, file: !146, line: 346, baseType: !362, size: 64, offset: 1088)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "directive", scope: !233, file: !146, line: 349, baseType: !364, size: 64, offset: 1152)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !366)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "directive", file: !146, line: 40, flags: DIFlagFwdDecl)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "directive_result", scope: !233, file: !146, line: 352, baseType: !89, size: 192, offset: 1216)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "invocation_location", scope: !233, file: !146, line: 356, baseType: !93, size: 32, offset: 1408)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "set_invocation_location", scope: !233, file: !146, line: 360, baseType: !48, size: 8, offset: 1440)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "quote_include", scope: !233, file: !146, line: 363, baseType: !273, size: 64, offset: 1472)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "bracket_include", scope: !233, file: !146, line: 364, baseType: !273, size: 64, offset: 1536)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "no_search_path", scope: !233, file: !146, line: 365, baseType: !270, size: 512, offset: 1600)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "all_files", scope: !233, file: !146, line: 368, baseType: !258, size: 64, offset: 2112)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "main_file", scope: !233, file: !146, line: 370, baseType: !258, size: 64, offset: 2176)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "file_hash", scope: !233, file: !146, line: 373, baseType: !376, size: 64, offset: 2240)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !146, line: 373, flags: DIFlagFwdDecl)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "dir_hash", scope: !233, file: !146, line: 374, baseType: !376, size: 64, offset: 2304)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "file_hash_entries", scope: !233, file: !146, line: 375, baseType: !380, size: 64, offset: 2368)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "file_hash_entry_pool", file: !146, line: 375, flags: DIFlagFwdDecl)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "nonexistent_file_hash", scope: !233, file: !146, line: 378, baseType: !376, size: 64, offset: 2432)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "nonexistent_file_ob", scope: !233, file: !146, line: 379, baseType: !384, size: 704, offset: 2496)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !385, line: 164, size: 704, elements: !386)
!385 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!386 = !{!387, !388, !398, !399, !400, !401, !402, !403, !407, !411, !412, !413, !414}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !384, file: !385, line: 166, baseType: !53, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !384, file: !385, line: 167, baseType: !389, size: 64, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !385, line: 157, size: 192, elements: !391)
!391 = !{!392, !393, !394}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !390, file: !385, line: 159, baseType: !44, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !390, file: !385, line: 160, baseType: !389, size: 64, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !390, file: !385, line: 161, baseType: !395, size: 32, offset: 128)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 32, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 4)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !384, file: !385, line: 168, baseType: !44, size: 64, offset: 128)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !384, file: !385, line: 169, baseType: !44, size: 64, offset: 192)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !384, file: !385, line: 170, baseType: !44, size: 64, offset: 256)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !384, file: !385, line: 171, baseType: !53, size: 64, offset: 320)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !384, file: !385, line: 172, baseType: !208, size: 32, offset: 384)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !384, file: !385, line: 176, baseType: !404, size: 64, offset: 448)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!389, !43, !53}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !384, file: !385, line: 177, baseType: !408, size: 64, offset: 512)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{null, !43, !389}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !384, file: !385, line: 178, baseType: !43, size: 64, offset: 576)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !384, file: !385, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !384, file: !385, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !384, file: !385, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "quote_ignores_source_dir", scope: !233, file: !146, line: 383, baseType: !48, size: 8, offset: 3200)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "seen_once_only", scope: !233, file: !146, line: 387, baseType: !48, size: 8, offset: 3208)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "mi_cmacro", scope: !233, file: !146, line: 390, baseType: !418, size: 64, offset: 3264)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !59)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "mi_ind_cmacro", scope: !233, file: !146, line: 391, baseType: !418, size: 64, offset: 3328)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "mi_valid", scope: !233, file: !146, line: 392, baseType: !48, size: 8, offset: 3392)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "cur_token", scope: !233, file: !146, line: 395, baseType: !88, size: 64, offset: 3456)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "base_run", scope: !233, file: !146, line: 396, baseType: !424, size: 256, offset: 3520)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "tokenrun", file: !146, line: 128, baseType: !425)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tokenrun", file: !146, line: 129, size: 256, elements: !426)
!426 = !{!427, !429, !430, !431}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !425, file: !146, line: 131, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !425, file: !146, line: 131, baseType: !428, size: 64, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !425, file: !146, line: 132, baseType: !88, size: 64, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !425, file: !146, line: 132, baseType: !88, size: 64, offset: 192)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "cur_run", scope: !233, file: !146, line: 396, baseType: !428, size: 64, offset: 3776)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "lookaheads", scope: !233, file: !146, line: 397, baseType: !7, size: 32, offset: 3840)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "keep_tokens", scope: !233, file: !146, line: 400, baseType: !7, size: 32, offset: 3872)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "macro_buffer", scope: !233, file: !146, line: 403, baseType: !139, size: 64, offset: 3904)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "macro_buffer_len", scope: !233, file: !146, line: 404, baseType: !7, size: 32, offset: 3968)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "narrow_cset_desc", scope: !233, file: !146, line: 408, baseType: !295, size: 192, offset: 4032)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_cset_desc", scope: !233, file: !146, line: 412, baseType: !295, size: 192, offset: 4224)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "char16_cset_desc", scope: !233, file: !146, line: 416, baseType: !295, size: 192, offset: 4416)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "char32_cset_desc", scope: !233, file: !146, line: 420, baseType: !295, size: 192, offset: 4608)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "wide_cset_desc", scope: !233, file: !146, line: 424, baseType: !295, size: 192, offset: 4800)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !233, file: !146, line: 427, baseType: !46, size: 64, offset: 4992)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !233, file: !146, line: 428, baseType: !46, size: 64, offset: 5056)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "avoid_paste", scope: !233, file: !146, line: 431, baseType: !89, size: 192, offset: 5120)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !233, file: !146, line: 432, baseType: !89, size: 192, offset: 5312)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "deps", scope: !233, file: !146, line: 435, baseType: !447, size: 64, offset: 5504)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DICompositeType(tag: DW_TAG_structure_type, name: "deps", file: !6, line: 685, flags: DIFlagFwdDecl)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "hash_ob", scope: !233, file: !146, line: 439, baseType: !384, size: 704, offset: 5568)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_ob", scope: !233, file: !146, line: 443, baseType: !384, size: 704, offset: 6272)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "pragmas", scope: !233, file: !146, line: 447, baseType: !452, size: 64, offset: 6976)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DICompositeType(tag: DW_TAG_structure_type, name: "pragma_entry", file: !146, line: 447, flags: DIFlagFwdDecl)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !233, file: !146, line: 450, baseType: !455, size: 1088, offset: 7040)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_callbacks", file: !6, line: 472, size: 1088, elements: !456)
!456 = !{!457, !461, !467, !471, !475, !479, !480, !487, !491, !495, !499, !505, !509, !524, !525, !526, !530}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "line_change", scope: !455, file: !6, line: 475, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{null, !231, !161, !208}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "file_change", scope: !455, file: !6, line: 481, baseType: !462, size: 64, offset: 64)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{null, !231, !465}
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !332)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "dir_change", scope: !455, file: !6, line: 483, baseType: !468, size: 64, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{null, !231, !193}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "include", scope: !455, file: !6, line: 484, baseType: !472, size: 64, offset: 192)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{null, !231, !7, !46, !193, !208, !164}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "define", scope: !455, file: !6, line: 486, baseType: !476, size: 64, offset: 256)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{null, !231, !7, !58}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "undef", scope: !455, file: !6, line: 487, baseType: !476, size: 64, offset: 320)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !455, file: !6, line: 488, baseType: !481, size: 64, offset: 384)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{null, !231, !7, !484}
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !486)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_string", file: !6, line: 35, baseType: !107)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "def_pragma", scope: !455, file: !6, line: 489, baseType: !488, size: 64, offset: 448)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DISubroutineType(types: !490)
!490 = !{null, !231, !7}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "valid_pch", scope: !455, file: !6, line: 490, baseType: !492, size: 64, offset: 512)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DISubroutineType(types: !494)
!494 = !{!208, !231, !193, !208}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "read_pch", scope: !455, file: !6, line: 491, baseType: !496, size: 64, offset: 576)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DISubroutineType(types: !498)
!498 = !{null, !231, !193, !208, !193}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "missing_header", scope: !455, file: !6, line: 492, baseType: !500, size: 64, offset: 640)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "missing_header_cb", file: !6, line: 469, baseType: !501)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DISubroutineType(types: !503)
!503 = !{!193, !231, !193, !504}
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "macro_to_expand", scope: !455, file: !6, line: 496, baseType: !506, size: 64, offset: 704)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DISubroutineType(types: !508)
!508 = !{!58, !231, !161}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !455, file: !6, line: 500, baseType: !510, size: 64, offset: 768)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DISubroutineType(types: !512)
!512 = !{!48, !231, !208, !93, !7, !193, !513}
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !515, line: 14, baseType: !516)
!515 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stdarg.h", directory: "")
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 216, baseType: !517)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !518, size: 192, elements: !135)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 216, size: 192, elements: !519)
!519 = !{!520, !521, !522, !523}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !518, file: !3, line: 216, baseType: !7, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !518, file: !3, line: 216, baseType: !7, size: 32, offset: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !518, file: !3, line: 216, baseType: !43, size: 64, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !518, file: !3, line: 216, baseType: !43, size: 64, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "used_define", scope: !455, file: !6, line: 506, baseType: !476, size: 64, offset: 832)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "used_undef", scope: !455, file: !6, line: 507, baseType: !476, size: 64, offset: 896)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "before_define", scope: !455, file: !6, line: 510, baseType: !527, size: 64, offset: 960)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{null, !231}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !455, file: !6, line: 513, baseType: !531, size: 64, offset: 1024)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DISubroutineType(types: !533)
!533 = !{null, !231, !93, !58}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "hash_table", scope: !233, file: !146, line: 453, baseType: !535, size: 64, offset: 8128)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht", file: !64, line: 46, size: 1152, elements: !537)
!537 = !{!538, !539, !543, !549, !553, !554, !555, !557, !558, !559}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !536, file: !64, line: 49, baseType: !384, size: 704)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !536, file: !64, line: 51, baseType: !540, size: 64, offset: 704)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashnode", file: !64, line: 41, baseType: !542)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_node", scope: !536, file: !64, line: 53, baseType: !544, size: 64, offset: 768)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DISubroutineType(types: !546)
!546 = !{!541, !547}
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_table", file: !64, line: 40, baseType: !536)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_subobject", scope: !536, file: !64, line: 56, baseType: !550, size: 64, offset: 832)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DISubroutineType(types: !552)
!552 = !{!43, !54}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "nslots", scope: !536, file: !64, line: 58, baseType: !7, size: 32, offset: 896)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "nelements", scope: !536, file: !64, line: 59, baseType: !7, size: 32, offset: 928)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "pfile", scope: !536, file: !64, line: 62, baseType: !556, size: 64, offset: 960)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !536, file: !64, line: 65, baseType: !7, size: 32, offset: 1024)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !536, file: !64, line: 66, baseType: !7, size: 32, offset: 1056)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "entries_owned", scope: !536, file: !64, line: 69, baseType: !48, size: 8, offset: 1088)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "op_stack", scope: !233, file: !146, line: 456, baseType: !561, size: 64, offset: 8192)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DICompositeType(tag: DW_TAG_structure_type, name: "op", file: !146, line: 42, flags: DIFlagFwdDecl)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "op_limit", scope: !233, file: !146, line: 456, baseType: !561, size: 64, offset: 8256)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !233, file: !146, line: 459, baseType: !565, size: 1024, offset: 8320)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_options", file: !6, line: 279, size: 1024, elements: !566)
!566 = !{!567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !618, !619, !620, !621, !622, !623, !624, !625, !626}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "tabstop", scope: !565, file: !6, line: 282, baseType: !7, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "lang", scope: !565, file: !6, line: 285, baseType: !19, size: 32, offset: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "cplusplus", scope: !565, file: !6, line: 288, baseType: !48, size: 8, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "cplusplus_comments", scope: !565, file: !6, line: 291, baseType: !48, size: 8, offset: 72)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "objc", scope: !565, file: !6, line: 296, baseType: !48, size: 8, offset: 80)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "discard_comments", scope: !565, file: !6, line: 299, baseType: !48, size: 8, offset: 88)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "discard_comments_in_macro_exp", scope: !565, file: !6, line: 303, baseType: !48, size: 8, offset: 96)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "trigraphs", scope: !565, file: !6, line: 306, baseType: !48, size: 8, offset: 104)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "digraphs", scope: !565, file: !6, line: 309, baseType: !48, size: 8, offset: 112)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "extended_numbers", scope: !565, file: !6, line: 312, baseType: !48, size: 8, offset: 120)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "uliterals", scope: !565, file: !6, line: 315, baseType: !48, size: 8, offset: 128)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "print_include_names", scope: !565, file: !6, line: 318, baseType: !48, size: 8, offset: 136)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "warn_deprecated", scope: !565, file: !6, line: 321, baseType: !48, size: 8, offset: 144)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "warn_comments", scope: !565, file: !6, line: 324, baseType: !48, size: 8, offset: 152)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "warn_missing_include_dirs", scope: !565, file: !6, line: 328, baseType: !48, size: 8, offset: 160)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "warn_trigraphs", scope: !565, file: !6, line: 331, baseType: !48, size: 8, offset: 168)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "warn_multichar", scope: !565, file: !6, line: 334, baseType: !48, size: 8, offset: 176)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "warn_traditional", scope: !565, file: !6, line: 338, baseType: !48, size: 8, offset: 184)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "warn_long_long", scope: !565, file: !6, line: 341, baseType: !48, size: 8, offset: 192)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "warn_endif_labels", scope: !565, file: !6, line: 344, baseType: !48, size: 8, offset: 200)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "warn_num_sign_change", scope: !565, file: !6, line: 348, baseType: !48, size: 8, offset: 208)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "warn_variadic_macros", scope: !565, file: !6, line: 352, baseType: !48, size: 8, offset: 216)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "warn_builtin_macro_redefined", scope: !565, file: !6, line: 356, baseType: !48, size: 8, offset: 224)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !565, file: !6, line: 360, baseType: !48, size: 8, offset: 232)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "dollars_in_ident", scope: !565, file: !6, line: 363, baseType: !48, size: 8, offset: 240)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "extended_identifiers", scope: !565, file: !6, line: 366, baseType: !48, size: 8, offset: 248)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "warn_dollars", scope: !565, file: !6, line: 370, baseType: !48, size: 8, offset: 256)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "warn_undef", scope: !565, file: !6, line: 373, baseType: !48, size: 8, offset: 264)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "warn_unused_macros", scope: !565, file: !6, line: 376, baseType: !48, size: 8, offset: 272)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "c99", scope: !565, file: !6, line: 379, baseType: !48, size: 8, offset: 280)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "std", scope: !565, file: !6, line: 382, baseType: !48, size: 8, offset: 288)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "pedantic", scope: !565, file: !6, line: 385, baseType: !48, size: 8, offset: 296)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "preprocessed", scope: !565, file: !6, line: 389, baseType: !48, size: 8, offset: 304)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "show_column", scope: !565, file: !6, line: 392, baseType: !48, size: 8, offset: 312)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "operator_names", scope: !565, file: !6, line: 395, baseType: !48, size: 8, offset: 320)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "warn_cxx_operator_names", scope: !565, file: !6, line: 398, baseType: !48, size: 8, offset: 328)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "traditional", scope: !565, file: !6, line: 401, baseType: !48, size: 8, offset: 336)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "narrow_charset", scope: !565, file: !6, line: 404, baseType: !193, size: 64, offset: 384)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "wide_charset", scope: !565, file: !6, line: 407, baseType: !193, size: 64, offset: 448)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "input_charset", scope: !565, file: !6, line: 410, baseType: !193, size: 64, offset: 512)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "warn_normalize", scope: !565, file: !6, line: 414, baseType: !31, size: 32, offset: 576)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "warn_invalid_pch", scope: !565, file: !6, line: 417, baseType: !48, size: 8, offset: 608)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "restore_pch_deps", scope: !565, file: !6, line: 420, baseType: !48, size: 8, offset: 616)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "deps", scope: !565, file: !6, line: 441, baseType: !611, size: 64, offset: 640)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !565, file: !6, line: 423, size: 64, elements: !612)
!612 = !{!613, !614, !615, !616, !617}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !611, file: !6, line: 426, baseType: !37, size: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "missing_files", scope: !611, file: !6, line: 429, baseType: !48, size: 8, offset: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "phony_targets", scope: !611, file: !6, line: 433, baseType: !48, size: 8, offset: 40)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_main_file", scope: !611, file: !6, line: 436, baseType: !48, size: 8, offset: 48)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "need_preprocessor_output", scope: !611, file: !6, line: 440, baseType: !48, size: 8, offset: 56)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !565, file: !6, line: 447, baseType: !54, size: 64, offset: 704)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "char_precision", scope: !565, file: !6, line: 447, baseType: !54, size: 64, offset: 768)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "int_precision", scope: !565, file: !6, line: 447, baseType: !54, size: 64, offset: 832)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "wchar_precision", scope: !565, file: !6, line: 447, baseType: !54, size: 64, offset: 896)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_char", scope: !565, file: !6, line: 450, baseType: !48, size: 8, offset: 960)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_wchar", scope: !565, file: !6, line: 450, baseType: !48, size: 8, offset: 968)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_big_endian", scope: !565, file: !6, line: 454, baseType: !48, size: 8, offset: 976)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "stdc_0_in_system_headers", scope: !565, file: !6, line: 457, baseType: !48, size: 8, offset: 984)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "directives_only", scope: !565, file: !6, line: 460, baseType: !48, size: 8, offset: 992)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "spec_nodes", scope: !233, file: !146, line: 463, baseType: !628, size: 256, offset: 9344)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spec_nodes", file: !146, line: 227, size: 256, elements: !629)
!629 = !{!630, !631, !632, !633}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "n_defined", scope: !628, file: !146, line: 229, baseType: !58, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "n_true", scope: !628, file: !146, line: 230, baseType: !58, size: 64, offset: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "n_false", scope: !628, file: !146, line: 231, baseType: !58, size: 64, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "n__VA_ARGS__", scope: !628, file: !146, line: 232, baseType: !58, size: 64, offset: 192)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "our_hashtable", scope: !233, file: !146, line: 466, baseType: !48, size: 8, offset: 9600)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !233, file: !146, line: 475, baseType: !636, size: 256, offset: 9664)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !233, file: !146, line: 469, size: 256, elements: !637)
!637 = !{!638, !639, !640, !641}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !636, file: !146, line: 471, baseType: !139, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !636, file: !146, line: 472, baseType: !139, size: 64, offset: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !636, file: !146, line: 473, baseType: !139, size: 64, offset: 128)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "first_line", scope: !636, file: !146, line: 474, baseType: !93, size: 32, offset: 192)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "saved_cur", scope: !233, file: !146, line: 478, baseType: !46, size: 64, offset: 9920)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "saved_rlimit", scope: !233, file: !146, line: 478, baseType: !46, size: 64, offset: 9984)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "saved_line_base", scope: !233, file: !146, line: 478, baseType: !46, size: 64, offset: 10048)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "savedstate", scope: !233, file: !146, line: 482, baseType: !646, size: 64, offset: 10112)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_savedstate", file: !146, line: 482, flags: DIFlagFwdDecl)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !233, file: !146, line: 485, baseType: !7, size: 32, offset: 10176)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "comments", scope: !233, file: !146, line: 488, baseType: !650, size: 128, offset: 10240)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_comment_table", file: !6, line: 901, baseType: !651)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 891, size: 128, elements: !652)
!652 = !{!653, !660, !661}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !651, file: !6, line: 894, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_comment", file: !6, line: 887, baseType: !656)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 880, size: 128, elements: !657)
!657 = !{!658, !659}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !656, file: !6, line: 883, baseType: !44, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "sloc", scope: !656, file: !6, line: 886, baseType: !93, size: 32, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !651, file: !6, line: 897, baseType: !208, size: 32, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !651, file: !6, line: 900, baseType: !208, size: 32, offset: 96)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "pushed_macros", scope: !233, file: !146, line: 491, baseType: !663, size: 64, offset: 10368)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_pragma_macro", file: !146, line: 310, size: 192, elements: !665)
!665 = !{!666, !667, !668}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !664, file: !146, line: 312, baseType: !663, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !664, file: !146, line: 314, baseType: !44, size: 64, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !664, file: !146, line: 316, baseType: !78, size: 64, offset: 128)
!669 = !{!670, !671, !672, !673}
!670 = !DILocalVariable(name: "pfile", arg: 1, scope: !228, file: !3, line: 78, type: !231)
!671 = !DILocalVariable(name: "node", arg: 2, scope: !228, file: !3, line: 78, type: !58)
!672 = !DILocalVariable(name: "v", arg: 3, scope: !228, file: !3, line: 79, type: !43)
!673 = !DILocalVariable(name: "macro", scope: !674, file: !3, line: 83, type: !78)
!674 = distinct !DILexicalBlock(scope: !675, file: !3, line: 82, column: 5)
!675 = distinct !DILexicalBlock(scope: !228, file: !3, line: 81, column: 7)
!676 = !DILocation(line: 0, scope: !228)
!677 = !DILocation(line: 81, column: 13, scope: !675)
!678 = !DILocation(line: 81, column: 18, scope: !675)
!679 = !DILocation(line: 81, column: 30, scope: !675)
!680 = !DILocation(line: 81, column: 47, scope: !675)
!681 = !DILocation(line: 81, column: 7, scope: !228)
!682 = !DILocation(line: 83, column: 38, scope: !674)
!683 = !DILocation(line: 0, scope: !674)
!684 = !DILocation(line: 85, column: 19, scope: !685)
!685 = distinct !DILexicalBlock(scope: !674, file: !3, line: 85, column: 11)
!686 = !DILocation(line: 85, column: 12, scope: !685)
!687 = !DILocation(line: 86, column: 4, scope: !685)
!688 = !DILocation(line: 86, column: 7, scope: !685)
!689 = !DILocation(line: 85, column: 11, scope: !674)
!690 = !DILocation(line: 87, column: 53, scope: !685)
!691 = !DILocation(line: 88, column: 37, scope: !685)
!692 = !DILocation(line: 87, column: 2, scope: !685)
!693 = !DILocation(line: 91, column: 3, scope: !228)
!694 = distinct !DISubprogram(name: "_cpp_builtin_macro_text", scope: !3, file: !3, line: 118, type: !695, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !697)
!695 = !DISubroutineType(types: !696)
!696 = !{!46, !231, !58}
!697 = !{!698, !699, !700, !701, !702, !703, !706, !709, !727, !762, !765, !766, !767, !769, !770, !771, !774}
!698 = !DILocalVariable(name: "pfile", arg: 1, scope: !694, file: !3, line: 118, type: !231)
!699 = !DILocalVariable(name: "node", arg: 2, scope: !694, file: !3, line: 118, type: !58)
!700 = !DILocalVariable(name: "map", scope: !694, file: !3, line: 120, type: !465)
!701 = !DILocalVariable(name: "result", scope: !694, file: !3, line: 121, type: !141)
!702 = !DILocalVariable(name: "number", scope: !694, file: !3, line: 122, type: !336)
!703 = !DILocalVariable(name: "pbuffer", scope: !704, file: !3, line: 133, type: !236)
!704 = distinct !DILexicalBlock(scope: !705, file: !3, line: 132, column: 7)
!705 = distinct !DILexicalBlock(scope: !694, file: !3, line: 125, column: 5)
!706 = !DILocalVariable(name: "file", scope: !707, file: !3, line: 137, type: !258)
!707 = distinct !DILexicalBlock(scope: !708, file: !3, line: 135, column: 4)
!708 = distinct !DILexicalBlock(scope: !704, file: !3, line: 134, column: 6)
!709 = !DILocalVariable(name: "tb", scope: !710, file: !3, line: 144, type: !712)
!710 = distinct !DILexicalBlock(scope: !711, file: !3, line: 139, column: 8)
!711 = distinct !DILexicalBlock(scope: !707, file: !3, line: 138, column: 10)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !714, line: 7, size: 448, elements: !715)
!714 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h", directory: "")
!715 = !{!716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !713, file: !714, line: 9, baseType: !208, size: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !713, file: !714, line: 10, baseType: !208, size: 32, offset: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !713, file: !714, line: 11, baseType: !208, size: 32, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !713, file: !714, line: 12, baseType: !208, size: 32, offset: 96)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !713, file: !714, line: 13, baseType: !208, size: 32, offset: 128)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !713, file: !714, line: 14, baseType: !208, size: 32, offset: 160)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !713, file: !714, line: 15, baseType: !208, size: 32, offset: 192)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !713, file: !714, line: 16, baseType: !208, size: 32, offset: 224)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !713, file: !714, line: 17, baseType: !208, size: 32, offset: 256)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_gmtoff", scope: !713, file: !714, line: 23, baseType: !53, size: 64, offset: 320)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_zone", scope: !713, file: !714, line: 24, baseType: !193, size: 64, offset: 384)
!727 = !DILocalVariable(name: "st", scope: !710, file: !3, line: 145, type: !728)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !730, line: 46, size: 1152, elements: !731)
!730 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!731 = !{!732, !733, !734, !736, !738, !740, !742, !743, !744, !746, !748, !750, !751, !753, !754, !755, !756, !757}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !729, file: !730, line: 48, baseType: !293, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !729, file: !730, line: 53, baseType: !290, size: 64, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !729, file: !730, line: 61, baseType: !735, size: 64, offset: 128)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !52, line: 151, baseType: !56)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !729, file: !730, line: 62, baseType: !737, size: 32, offset: 192)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !52, line: 150, baseType: !7)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !729, file: !730, line: 64, baseType: !739, size: 32, offset: 224)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !52, line: 146, baseType: !7)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !729, file: !730, line: 65, baseType: !741, size: 32, offset: 256)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !52, line: 147, baseType: !7)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !729, file: !730, line: 67, baseType: !208, size: 32, offset: 288)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !729, file: !730, line: 69, baseType: !293, size: 64, offset: 320)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !729, file: !730, line: 74, baseType: !745, size: 64, offset: 384)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !52, line: 152, baseType: !53)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !729, file: !730, line: 78, baseType: !747, size: 64, offset: 448)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !52, line: 174, baseType: !53)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !729, file: !730, line: 80, baseType: !749, size: 64, offset: 512)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !52, line: 179, baseType: !53)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "st_atime", scope: !729, file: !730, line: 98, baseType: !51, size: 64, offset: 576)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "st_atimensec", scope: !729, file: !730, line: 99, baseType: !752, size: 64, offset: 640)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_ulong_t", file: !52, line: 198, baseType: !56)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtime", scope: !729, file: !730, line: 100, baseType: !51, size: 64, offset: 704)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtimensec", scope: !729, file: !730, line: 101, baseType: !752, size: 64, offset: 768)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctime", scope: !729, file: !730, line: 102, baseType: !51, size: 64, offset: 832)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctimensec", scope: !729, file: !730, line: 103, baseType: !752, size: 64, offset: 896)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !729, file: !730, line: 106, baseType: !758, size: 192, offset: 960)
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !759, size: 192, elements: !760)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !52, line: 196, baseType: !53)
!760 = !{!761}
!761 = !DISubrange(count: 3)
!762 = !DILocalVariable(name: "str", scope: !763, file: !3, line: 150, type: !44)
!763 = distinct !DILexicalBlock(scope: !764, file: !3, line: 149, column: 5)
!764 = distinct !DILexicalBlock(scope: !710, file: !3, line: 148, column: 7)
!765 = !DILocalVariable(name: "len", scope: !763, file: !3, line: 151, type: !54)
!766 = !DILocalVariable(name: "buf", scope: !763, file: !3, line: 152, type: !139)
!767 = !DILocalVariable(name: "len", scope: !768, file: !3, line: 172, type: !7)
!768 = distinct !DILexicalBlock(scope: !705, file: !3, line: 171, column: 7)
!769 = !DILocalVariable(name: "name", scope: !768, file: !3, line: 173, type: !193)
!770 = !DILocalVariable(name: "buf", scope: !768, file: !3, line: 174, type: !192)
!771 = !DILocalVariable(name: "tt", scope: !772, file: !3, line: 230, type: !49)
!772 = distinct !DILexicalBlock(scope: !773, file: !3, line: 225, column: 2)
!773 = distinct !DILexicalBlock(scope: !705, file: !3, line: 224, column: 11)
!774 = !DILocalVariable(name: "tb", scope: !772, file: !3, line: 231, type: !712)
!775 = !DILocation(line: 0, scope: !694)
!776 = !DILocation(line: 124, column: 17, scope: !694)
!777 = !DILocation(line: 124, column: 23, scope: !694)
!778 = !DILocation(line: 124, column: 3, scope: !694)
!779 = !DILocation(line: 128, column: 4, scope: !705)
!780 = !DILocation(line: 127, column: 7, scope: !705)
!781 = !DILocation(line: 129, column: 7, scope: !705)
!782 = !DILocation(line: 133, column: 24, scope: !704)
!783 = !DILocation(line: 0, scope: !704)
!784 = !DILocation(line: 134, column: 15, scope: !708)
!785 = !DILocation(line: 134, column: 25, scope: !708)
!786 = !DILocation(line: 134, column: 6, scope: !704)
!787 = !DILocation(line: 137, column: 38, scope: !707)
!788 = !DILocation(line: 0, scope: !707)
!789 = !DILocation(line: 138, column: 10, scope: !711)
!790 = !DILocation(line: 138, column: 10, scope: !707)
!791 = !DILocation(line: 166, column: 20, scope: !704)
!792 = !DILocation(line: 0, scope: !710)
!793 = !DILocation(line: 145, column: 21, scope: !710)
!794 = !DILocation(line: 146, column: 7, scope: !795)
!795 = distinct !DILexicalBlock(scope: !710, file: !3, line: 146, column: 7)
!796 = !DILocation(line: 146, column: 7, scope: !710)
!797 = !DILocation(line: 147, column: 26, scope: !795)
!798 = !DILocation(line: 147, column: 10, scope: !795)
!799 = !DILocation(line: 147, column: 5, scope: !795)
!800 = !DILocation(line: 148, column: 7, scope: !764)
!801 = !DILocation(line: 148, column: 7, scope: !710)
!802 = !DILocation(line: 150, column: 19, scope: !763)
!803 = !DILocation(line: 0, scope: !763)
!804 = !DILocation(line: 151, column: 20, scope: !763)
!805 = !DILocation(line: 152, column: 61, scope: !763)
!806 = !DILocation(line: 152, column: 28, scope: !763)
!807 = !DILocation(line: 153, column: 14, scope: !763)
!808 = !DILocation(line: 154, column: 28, scope: !763)
!809 = !DILocation(line: 154, column: 7, scope: !763)
!810 = !DILocation(line: 155, column: 7, scope: !763)
!811 = !DILocation(line: 155, column: 16, scope: !763)
!812 = !DILocation(line: 156, column: 26, scope: !763)
!813 = !DILocation(line: 157, column: 5, scope: !763)
!814 = !DILocation(line: 160, column: 7, scope: !815)
!815 = distinct !DILexicalBlock(scope: !764, file: !3, line: 159, column: 5)
!816 = !DILocation(line: 162, column: 26, scope: !815)
!817 = !DILocation(line: 168, column: 7, scope: !705)
!818 = !DILocation(line: 175, column: 31, scope: !768)
!819 = !DILocation(line: 175, column: 62, scope: !768)
!820 = !DILocation(line: 175, column: 8, scope: !768)
!821 = !DILocation(line: 177, column: 18, scope: !822)
