; ModuleID = 'cpp_symtab.bc'
source_filename = "cpp_symtab.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.ht = type { %struct.obstack, %struct.ht_identifier**, %struct.ht_identifier* (%struct.ht*)*, i8* (i64)*, i32, i32, %struct.cpp_reader*, i32, i32, i8 }
%struct.obstack = type { i64, %struct._obstack_chunk*, i8*, i8*, i8*, i64, i32, %struct._obstack_chunk* (i8*, i64)*, void (i8*, %struct._obstack_chunk*)*, i8*, i8 }
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [4 x i8] }
%struct.ht_identifier = type { i8*, i32, i32 }
%struct.cpp_reader = type opaque

@stderr = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [27 x i8] c"\0AString pool\0Aentries\09\09%lu\0A\00", align 1
@.str.1 = private unnamed_addr constant [26 x i8] c"identifiers\09%lu (%.2f%%)\0A\00", align 1
@.str.2 = private unnamed_addr constant [12 x i8] c"slots\09\09%lu\0A\00", align 1
@.str.3 = private unnamed_addr constant [14 x i8] c"deleted\09\09%lu\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !9, nameTableKind: None)
!1 = !DIFile(filename: "cpp_symtab.c", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ht_lookup_option", file: !4, line: 43, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "HT_NO_INSERT", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "HT_ALLOC", value: 1, isUnsigned: true)
!9 = !{!10, !82, !85, !52, !25, !42, !88, !53, !5, !58, !89, !73}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_table", file: !4, line: 40, baseType: !12)
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht", file: !4, line: 46, size: 1152, elements: !13)
!13 = !{!14, !51, !63, !67, !74, !75, !76, !79, !80, !81}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !12, file: !4, line: 49, baseType: !15, size: 704)
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !16, line: 164, size: 704, elements: !17)
!16 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!17 = !{!18, !20, !32, !33, !34, !35, !36, !38, !43, !47, !48, !49, !50}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !15, file: !16, line: 166, baseType: !19, size: 64)
!19 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !15, file: !16, line: 167, baseType: !21, size: 64, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !16, line: 157, size: 192, elements: !23)
!23 = !{!24, !27, !28}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !22, file: !16, line: 159, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !22, file: !16, line: 160, baseType: !21, size: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !22, file: !16, line: 161, baseType: !29, size: 32, offset: 128)
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 32, elements: !30)
!30 = !{!31}
!31 = !DISubrange(count: 4)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !15, file: !16, line: 168, baseType: !25, size: 64, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !15, file: !16, line: 169, baseType: !25, size: 64, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !15, file: !16, line: 170, baseType: !25, size: 64, offset: 256)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !15, file: !16, line: 171, baseType: !19, size: 64, offset: 320)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !15, file: !16, line: 172, baseType: !37, size: 32, offset: 384)
!37 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !15, file: !16, line: 176, baseType: !39, size: 64, offset: 448)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DISubroutineType(types: !41)
!41 = !{!21, !42, !19}
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !15, file: !16, line: 177, baseType: !44, size: 64, offset: 512)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{null, !42, !21}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !15, file: !16, line: 178, baseType: !42, size: 64, offset: 576)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !15, file: !16, line: 179, baseType: !5, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !15, file: !16, line: 180, baseType: !5, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !15, file: !16, line: 184, baseType: !5, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !12, file: !4, line: 51, baseType: !52, size: 64, offset: 704)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashnode", file: !4, line: 41, baseType: !54)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !4, line: 31, size: 128, elements: !56)
!56 = !{!57, !61, !62}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !55, file: !4, line: 32, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!60 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !55, file: !4, line: 33, baseType: !5, size: 32, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !55, file: !4, line: 34, baseType: !5, size: 32, offset: 96)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_node", scope: !12, file: !4, line: 53, baseType: !64, size: 64, offset: 768)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{!53, !10}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_subobject", scope: !12, file: !4, line: 56, baseType: !68, size: 64, offset: 832)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{!42, !71}
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !72, line: 46, baseType: !73)
!72 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!73 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "nslots", scope: !12, file: !4, line: 58, baseType: !5, size: 32, offset: 896)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "nelements", scope: !12, file: !4, line: 59, baseType: !5, size: 32, offset: 928)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "pfile", scope: !12, file: !4, line: 62, baseType: !77, size: 64, offset: 960)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_reader", file: !4, line: 62, flags: DIFlagFwdDecl)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !12, file: !4, line: 65, baseType: !5, size: 32, offset: 1024)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !12, file: !4, line: 66, baseType: !5, size: 32, offset: 1056)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "entries_owned", scope: !12, file: !4, line: 69, baseType: !60, size: 8, offset: 1088)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{!42, !19}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{null, !42}
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !72, line: 35, baseType: !19)
!89 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!90 = !{i32 2, !"Dwarf Version", i32 4}
!91 = !{i32 2, !"Debug Info Version", i32 3}
!92 = !{i32 1, !"wchar_size", i32 4}
!93 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!94 = distinct !DISubprogram(name: "tolower", scope: !95, file: !95, line: 207, type: !96, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !98)
!95 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!96 = !DISubroutineType(types: !97)
!97 = !{!37, !37}
!98 = !{!99}
!99 = !DILocalVariable(name: "__c", arg: 1, scope: !94, file: !95, line: 207, type: !37)
!100 = !DILocation(line: 0, scope: !94)
!101 = !DILocation(line: 209, column: 22, scope: !94)
!102 = !DILocation(line: 209, column: 39, scope: !94)
!103 = !DILocation(line: 209, column: 38, scope: !94)
!104 = !DILocation(line: 209, column: 37, scope: !94)
!105 = !DILocation(line: 209, column: 10, scope: !94)
!106 = !DILocation(line: 209, column: 3, scope: !94)
!107 = distinct !DISubprogram(name: "toupper", scope: !95, file: !95, line: 213, type: !96, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !108)
!108 = !{!109}
!109 = !DILocalVariable(name: "__c", arg: 1, scope: !107, file: !95, line: 213, type: !37)
!110 = !DILocation(line: 0, scope: !107)
!111 = !DILocation(line: 215, column: 22, scope: !107)
!112 = !DILocation(line: 215, column: 39, scope: !107)
!113 = !DILocation(line: 215, column: 38, scope: !107)
!114 = !DILocation(line: 215, column: 37, scope: !107)
!115 = !DILocation(line: 215, column: 10, scope: !107)
!116 = !DILocation(line: 215, column: 3, scope: !107)
!117 = distinct !DISubprogram(name: "ht_create", scope: !1, file: !1, line: 58, type: !118, scopeLine: 59, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !120)
!118 = !DISubroutineType(types: !119)
!119 = !{!10, !5}
!120 = !{!121, !122, !123}
!121 = !DILocalVariable(name: "order", arg: 1, scope: !117, file: !1, line: 58, type: !5)
!122 = !DILocalVariable(name: "nslots", scope: !117, file: !1, line: 60, type: !5)
!123 = !DILocalVariable(name: "table", scope: !117, file: !1, line: 61, type: !10)
!124 = !DILocation(line: 0, scope: !117)
!125 = !DILocation(line: 60, column: 27, scope: !117)
!126 = !DILocation(line: 63, column: 11, scope: !117)
!127 = !DILocation(line: 66, column: 27, scope: !117)
!128 = !DILocation(line: 66, column: 3, scope: !117)
!129 = !DILocation(line: 70, column: 3, scope: !117)
!130 = !DILocation(line: 70, column: 42, scope: !117)
!131 = !DILocation(line: 72, column: 20, scope: !117)
!132 = !DILocation(line: 72, column: 10, scope: !117)
!133 = !DILocation(line: 72, column: 18, scope: !117)
!134 = !DILocation(line: 73, column: 10, scope: !117)
!135 = !DILocation(line: 73, column: 24, scope: !117)
!136 = !DILocation(line: 74, column: 10, scope: !117)
!137 = !DILocation(line: 74, column: 17, scope: !117)
!138 = !DILocation(line: 75, column: 3, scope: !117)
!139 = distinct !DISubprogram(name: "ht_destroy", scope: !1, file: !1, line: 81, type: !140, scopeLine: 82, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !142)
!140 = !DISubroutineType(types: !141)
!141 = !{null, !10}
!142 = !{!143}
!143 = !DILocalVariable(name: "table", arg: 1, scope: !139, file: !1, line: 81, type: !10)
