; ModuleID = 'cpp_pch.bc'
source_filename = "cpp_pch.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.cpp_reader = type { %struct.cpp_buffer*, %struct.cpp_buffer*, %struct.lexer_state, %struct.line_maps*, i32, %struct._cpp_buff*, %struct._cpp_buff*, %struct._cpp_buff*, %struct.cpp_context, %struct.cpp_context*, %struct.directive*, %struct.cpp_token, i32, i8, %struct.cpp_dir*, %struct.cpp_dir*, %struct.cpp_dir, %struct._cpp_file*, %struct._cpp_file*, %struct.htab*, %struct.htab*, %struct.file_hash_entry_pool*, %struct.htab*, %struct.obstack, i8, i8, %struct.cpp_hashnode*, %struct.cpp_hashnode*, i8, %struct.cpp_token*, %struct.tokenrun, %struct.tokenrun*, i32, i32, i8*, i32, %struct.cset_converter, %struct.cset_converter, %struct.cset_converter, %struct.cset_converter, %struct.cset_converter, i8*, i8*, %struct.cpp_token, %struct.cpp_token, %struct.deps*, %struct.obstack, %struct.obstack, %struct.pragma_entry*, %struct.cpp_callbacks, %struct.ht*, %struct.op*, %struct.op*, %struct.cpp_options, %struct.spec_nodes, i8, %struct.anon.2, i8*, i8*, i8*, %struct.cpp_savedstate*, i32, %struct.cpp_comment_table, %struct.def_pragma_macro* }
%struct.cpp_buffer = type { i8*, i8*, i8*, i8*, i8*, %struct._cpp_line_note*, i32, i32, i32, %struct.cpp_buffer*, %struct._cpp_file*, i8*, %struct.if_stack*, i8, i8, i8, %struct.cpp_dir, %struct.cset_converter }
%struct._cpp_line_note = type { i8*, i32 }
%struct.if_stack = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !40, nameTableKind: None)
!1 = !DIFile(filename: "cpp_pch.c", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2 = !{!3, !17, !29, !35}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cpp_builtin_type", file: !4, line: 593, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "./cpplib.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16}
!7 = !DIEnumerator(name: "BT_SPECLINE", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "BT_DATE", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "BT_FILE", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "BT_BASE_FILE", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "BT_INCLUDE_LEVEL", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "BT_TIME", value: 5, isUnsigned: true)
!13 = !DIEnumerator(name: "BT_STDC", value: 6, isUnsigned: true)
!14 = !DIEnumerator(name: "BT_PRAGMA", value: 7, isUnsigned: true)
!15 = !DIEnumerator(name: "BT_TIMESTAMP", value: 8, isUnsigned: true)
!16 = !DIEnumerator(name: "BT_COUNTER", value: 9, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_lang", file: !4, line: 158, baseType: !5, size: 32, elements: !18)
!18 = !{!19, !20, !21, !22, !23, !24, !25, !26, !27, !28}
!19 = !DIEnumerator(name: "CLK_GNUC89", value: 0, isUnsigned: true)
!20 = !DIEnumerator(name: "CLK_GNUC99", value: 1, isUnsigned: true)
!21 = !DIEnumerator(name: "CLK_STDC89", value: 2, isUnsigned: true)
!22 = !DIEnumerator(name: "CLK_STDC94", value: 3, isUnsigned: true)
!23 = !DIEnumerator(name: "CLK_STDC99", value: 4, isUnsigned: true)
!24 = !DIEnumerator(name: "CLK_GNUCXX", value: 5, isUnsigned: true)
!25 = !DIEnumerator(name: "CLK_CXX98", value: 6, isUnsigned: true)
!26 = !DIEnumerator(name: "CLK_GNUCXX0X", value: 7, isUnsigned: true)
!27 = !DIEnumerator(name: "CLK_CXX0X", value: 8, isUnsigned: true)
!28 = !DIEnumerator(name: "CLK_ASM", value: 9, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cpp_normalize_level", file: !4, line: 265, baseType: !5, size: 32, elements: !30)
!30 = !{!31, !32, !33, !34}
!31 = !DIEnumerator(name: "normalized_KC", value: 0, isUnsigned: true)
!32 = !DIEnumerator(name: "normalized_C", value: 1, isUnsigned: true)
!33 = !DIEnumerator(name: "normalized_identifier_C", value: 2, isUnsigned: true)
!34 = !DIEnumerator(name: "normalized_none", value: 3, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cpp_deps_style", file: !4, line: 262, baseType: !5, size: 32, elements: !36)
!36 = !{!37, !38, !39}
!37 = !DIEnumerator(name: "DEPS_NONE", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "DEPS_USER", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "DEPS_SYSTEM", value: 2, isUnsigned: true)
!40 = !{!41, !102, !188, !73, !69, !189, !193, !112, !202, !204, !205, !71, !258, !266, !268, !194, !259, !200}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_savedstate", file: !1, line: 110, size: 320, elements: !43)
!43 = !{!44, !99, !100, !101, !187}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "definedhash", scope: !42, file: !1, line: 113, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !46, line: 144, baseType: !47)
!46 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !46, line: 100, size: 896, elements: !49)
!49 = !{!50, !58, !64, !70, !72, !76, !77, !78, !79, !80, !85, !87, !88, !93, !98}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !48, file: !46, line: 102, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !46, line: 52, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!55, !56}
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !46, line: 47, baseType: !5)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !48, file: !46, line: 105, baseType: !59, size: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !46, line: 59, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!63, !56, !56}
!63 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !48, file: !46, line: 108, baseType: !65, size: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !46, line: 63, baseType: !66)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{null, !69}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !48, file: !46, line: 111, baseType: !71, size: 64, offset: 192)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !48, file: !46, line: 114, baseType: !73, size: 64, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !74, line: 46, baseType: !75)
!74 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!75 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !48, file: !46, line: 117, baseType: !73, size: 64, offset: 320)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !48, file: !46, line: 120, baseType: !73, size: 64, offset: 384)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !48, file: !46, line: 124, baseType: !5, size: 32, offset: 448)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !48, file: !46, line: 128, baseType: !5, size: 32, offset: 480)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !48, file: !46, line: 131, baseType: !81, size: 64, offset: 512)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !46, line: 75, baseType: !82)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{!69, !73, !73}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !48, file: !46, line: 132, baseType: !86, size: 64, offset: 576)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !46, line: 78, baseType: !66)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !48, file: !46, line: 135, baseType: !69, size: 64, offset: 640)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !48, file: !46, line: 136, baseType: !89, size: 64, offset: 704)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !46, line: 82, baseType: !90)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{!69, !69, !73, !73}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !48, file: !46, line: 137, baseType: !94, size: 64, offset: 768)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !46, line: 83, baseType: !95)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{null, !69, !69}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !48, file: !46, line: 141, baseType: !5, size: 32, offset: 832)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "hashsize", scope: !42, file: !1, line: 116, baseType: !73, size: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "n_defs", scope: !42, file: !1, line: 118, baseType: !73, size: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "defs", scope: !42, file: !1, line: 120, baseType: !102, size: 64, offset: 192)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_hashnode", file: !4, line: 36, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_hashnode", file: !4, line: 644, size: 256, elements: !106)
!106 = !{!107, !117, !118, !119, !120, !121, !122}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !105, file: !4, line: 645, baseType: !108, size: 128)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !109, line: 31, size: 128, elements: !110)
!109 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!110 = !{!111, !115, !116}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !108, file: !109, line: 32, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!114 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !108, file: !109, line: 33, baseType: !5, size: 32, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !108, file: !109, line: 34, baseType: !5, size: 32, offset: 96)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "is_directive", scope: !105, file: !4, line: 646, baseType: !5, size: 1, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "directive_index", scope: !105, file: !4, line: 647, baseType: !5, size: 7, offset: 129, flags: DIFlagBitField, extraData: i64 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "rid_code", scope: !105, file: !4, line: 650, baseType: !114, size: 8, offset: 136)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !105, file: !4, line: 651, baseType: !5, size: 6, offset: 144, flags: DIFlagBitField, extraData: i64 144)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !105, file: !4, line: 652, baseType: !5, size: 10, offset: 150, flags: DIFlagBitField, extraData: i64 144)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !105, file: !4, line: 654, baseType: !123, size: 64, offset: 192)
!123 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_cpp_hashnode_value", file: !4, line: 633, size: 64, elements: !124)
!124 = !{!125, !175, !185, !186}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !123, file: !4, line: 635, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_macro", file: !4, line: 37, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_macro", file: !129, line: 36, size: 256, elements: !130)
!129 = !DIFile(filename: "./cpp-id-data.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!130 = !{!131, !132, !166, !167, !168, !169, !170, !171, !172, !173, !174}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !128, file: !129, line: 42, baseType: !102, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !128, file: !129, line: 51, baseType: !133, size: 64, offset: 64)
!133 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cpp_macro_u", file: !129, line: 47, size: 64, elements: !134)
!134 = !{!135, !165}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "tokens", scope: !133, file: !129, line: 49, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_token", file: !4, line: 34, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_token", file: !4, line: 212, size: 192, elements: !139)
!139 = !{!140, !143, !144, !146}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "src_loc", scope: !138, file: !4, line: 213, baseType: !141, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !142, line: 44, baseType: !5)
!142 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!143 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !138, file: !4, line: 214, baseType: !5, size: 8, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !138, file: !4, line: 215, baseType: !145, size: 16, offset: 48)
!145 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !138, file: !4, line: 237, baseType: !147, size: 128, offset: 64)
!147 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cpp_token_u", file: !4, line: 217, size: 128, elements: !148)
!148 = !{!149, !153, !154, !159, !163, !164}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !147, file: !4, line: 220, baseType: !150, size: 64)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_identifier", file: !4, line: 201, size: 64, elements: !151)
!151 = !{!152}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !150, file: !4, line: 207, baseType: !103, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !147, file: !4, line: 223, baseType: !136, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !147, file: !4, line: 226, baseType: !155, size: 128)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_string", file: !4, line: 162, size: 128, elements: !156)
!156 = !{!157, !158}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !155, file: !4, line: 163, baseType: !5, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !155, file: !4, line: 164, baseType: !112, size: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "macro_arg", scope: !147, file: !4, line: 229, baseType: !160, size: 32)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_macro_arg", file: !4, line: 195, size: 32, elements: !161)
!161 = !{!162}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "arg_no", scope: !160, file: !4, line: 197, baseType: !5, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "token_no", scope: !147, file: !4, line: 233, baseType: !5, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "pragma", scope: !147, file: !4, line: 236, baseType: !5, size: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !133, file: !129, line: 50, baseType: !112, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !128, file: !129, line: 54, baseType: !141, size: 32, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !128, file: !129, line: 57, baseType: !5, size: 32, offset: 160)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "paramc", scope: !128, file: !129, line: 60, baseType: !145, size: 16, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "fun_like", scope: !128, file: !129, line: 63, baseType: !5, size: 1, offset: 208, flags: DIFlagBitField, extraData: i64 208)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "variadic", scope: !128, file: !129, line: 66, baseType: !5, size: 1, offset: 209, flags: DIFlagBitField, extraData: i64 208)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "syshdr", scope: !128, file: !129, line: 69, baseType: !5, size: 1, offset: 210, flags: DIFlagBitField, extraData: i64 208)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !128, file: !129, line: 72, baseType: !5, size: 1, offset: 211, flags: DIFlagBitField, extraData: i64 208)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "traditional", scope: !128, file: !129, line: 75, baseType: !5, size: 1, offset: 212, flags: DIFlagBitField, extraData: i64 208)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "extra_tokens", scope: !128, file: !129, line: 80, baseType: !5, size: 1, offset: 213, flags: DIFlagBitField, extraData: i64 208)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "answers", scope: !123, file: !4, line: 637, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "answer", file: !129, line: 28, size: 320, elements: !178)
!178 = !{!179, !180, !181}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !177, file: !129, line: 29, baseType: !176, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !177, file: !129, line: 30, baseType: !5, size: 32, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !177, file: !129, line: 31, baseType: !182, size: 192, offset: 128)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 192, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 1)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "builtin", scope: !123, file: !4, line: 639, baseType: !3, size: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "arg_index", scope: !123, file: !4, line: 641, baseType: !145, size: 16)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "definedstrs", scope: !42, file: !1, line: 123, baseType: !188, size: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "save_macro_data", file: !1, line: 749, size: 256, elements: !191)
!191 = !{!192, !196, !197, !198}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "defns", scope: !190, file: !1, line: 751, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !129, line: 22, baseType: !114)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !190, file: !1, line: 752, baseType: !73, size: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "array_size", scope: !190, file: !1, line: 753, baseType: !73, size: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "saved_pragmas", scope: !190, file: !1, line: 754, baseType: !199, size: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !155)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !207, line: 7, baseType: !208)
!207 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !209, line: 49, size: 1728, elements: !210)
!209 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!210 = !{!211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !226, !228, !229, !230, !234, !235, !237, !239, !242, !244, !247, !250, !251, !252, !253, !254}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !208, file: !209, line: 51, baseType: !63, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !208, file: !209, line: 54, baseType: !200, size: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !208, file: !209, line: 55, baseType: !200, size: 64, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !208, file: !209, line: 56, baseType: !200, size: 64, offset: 192)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !208, file: !209, line: 57, baseType: !200, size: 64, offset: 256)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !208, file: !209, line: 58, baseType: !200, size: 64, offset: 320)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !208, file: !209, line: 59, baseType: !200, size: 64, offset: 384)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !208, file: !209, line: 60, baseType: !200, size: 64, offset: 448)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !208, file: !209, line: 61, baseType: !200, size: 64, offset: 512)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !208, file: !209, line: 64, baseType: !200, size: 64, offset: 576)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !208, file: !209, line: 65, baseType: !200, size: 64, offset: 640)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !208, file: !209, line: 66, baseType: !200, size: 64, offset: 704)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !208, file: !209, line: 68, baseType: !224, size: 64, offset: 768)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !209, line: 36, flags: DIFlagFwdDecl)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !208, file: !209, line: 70, baseType: !227, size: 64, offset: 832)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !208, file: !209, line: 72, baseType: !63, size: 32, offset: 896)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !208, file: !209, line: 73, baseType: !63, size: 32, offset: 928)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !208, file: !209, line: 74, baseType: !231, size: 64, offset: 960)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !232, line: 152, baseType: !233)
!232 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!233 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !208, file: !209, line: 77, baseType: !145, size: 16, offset: 1024)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !208, file: !209, line: 78, baseType: !236, size: 8, offset: 1040)
!236 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !208, file: !209, line: 79, baseType: !238, size: 8, offset: 1048)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 8, elements: !183)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !208, file: !209, line: 81, baseType: !240, size: 64, offset: 1088)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !209, line: 43, baseType: null)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !208, file: !209, line: 89, baseType: !243, size: 64, offset: 1152)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !232, line: 153, baseType: !233)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !208, file: !209, line: 91, baseType: !245, size: 64, offset: 1216)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !209, line: 37, flags: DIFlagFwdDecl)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !208, file: !209, line: 92, baseType: !248, size: 64, offset: 1280)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !209, line: 38, flags: DIFlagFwdDecl)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !208, file: !209, line: 93, baseType: !227, size: 64, offset: 1344)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !208, file: !209, line: 94, baseType: !69, size: 64, offset: 1408)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !208, file: !209, line: 95, baseType: !73, size: 64, offset: 1472)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !208, file: !209, line: 96, baseType: !63, size: 32, offset: 1536)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !208, file: !209, line: 98, baseType: !255, size: 160, offset: 1568)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 160, elements: !256)
!256 = !{!257}
!257 = !DISubrange(count: 20)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_pragma_macro", file: !261, line: 310, size: 192, elements: !262)
!261 = !DIFile(filename: "./internal.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!262 = !{!263, !264, !265}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !260, file: !261, line: 312, baseType: !259, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !260, file: !261, line: 314, baseType: !200, size: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !260, file: !261, line: 316, baseType: !126, size: 64, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !201)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_node_list", file: !1, line: 529, size: 192, elements: !270)
!270 = !{!271, !272, !273}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "defs", scope: !269, file: !1, line: 532, baseType: !102, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "n_defs", scope: !269, file: !1, line: 534, baseType: !73, size: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "asize", scope: !269, file: !1, line: 536, baseType: !73, size: 64, offset: 128)
!274 = !{i32 2, !"Dwarf Version", i32 4}
!275 = !{i32 2, !"Debug Info Version", i32 3}
!276 = !{i32 1, !"wchar_size", i32 4}
!277 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!278 = distinct !DISubprogram(name: "tolower", scope: !279, file: !279, line: 207, type: !280, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !282)
!279 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!280 = !DISubroutineType(types: !281)
!281 = !{!63, !63}
!282 = !{!283}
!283 = !DILocalVariable(name: "__c", arg: 1, scope: !278, file: !279, line: 207, type: !63)
!284 = !DILocation(line: 0, scope: !278)
!285 = !DILocation(line: 209, column: 22, scope: !278)
!286 = !DILocation(line: 209, column: 39, scope: !278)
!287 = !DILocation(line: 209, column: 38, scope: !278)
!288 = !DILocation(line: 209, column: 37, scope: !278)
!289 = !DILocation(line: 209, column: 10, scope: !278)
!290 = !DILocation(line: 209, column: 3, scope: !278)
!291 = distinct !DISubprogram(name: "toupper", scope: !279, file: !279, line: 213, type: !280, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !292)
!292 = !{!293}
!293 = !DILocalVariable(name: "__c", arg: 1, scope: !291, file: !279, line: 213, type: !63)
!294 = !DILocation(line: 0, scope: !291)
!295 = !DILocation(line: 215, column: 22, scope: !291)
!296 = !DILocation(line: 215, column: 39, scope: !291)
!297 = !DILocation(line: 215, column: 38, scope: !291)
!298 = !DILocation(line: 215, column: 37, scope: !291)
!299 = !DILocation(line: 215, column: 10, scope: !291)
!300 = !DILocation(line: 215, column: 3, scope: !291)
!301 = distinct !DISubprogram(name: "cpp_save_state", scope: !1, file: !1, line: 200, type: !302, scopeLine: 201, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !770)
!302 = !DISubroutineType(types: !303)
!303 = !{!63, !304, !205}
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_reader", file: !4, line: 31, baseType: !306)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_reader", file: !261, line: 322, size: 10432, elements: !307)
!307 = !{!308, !381, !382, !399, !429, !430, !440, !441, !442, !472, !474, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !491, !492, !524, !525, !526, !529, !530, !531, !532, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !558, !559, !560, !563, !643, !669, !672, !673, !736, !743, !744, !751, !752, !753, !754, !755, !756, !769}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !306, file: !261, line: 325, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_buffer", file: !4, line: 32, baseType: !311)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_buffer", file: !261, line: 249, size: 1536, elements: !312)
!312 = !{!313, !314, !315, !316, !317, !318, !325, !326, !327, !328, !330, !333, !334, !337, !338, !339, !340, !341, !342, !367}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !311, file: !261, line: 251, baseType: !112, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "line_base", scope: !311, file: !261, line: 252, baseType: !112, size: 64, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "next_line", scope: !311, file: !261, line: 253, baseType: !112, size: 64, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !311, file: !261, line: 255, baseType: !112, size: 64, offset: 192)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit", scope: !311, file: !261, line: 256, baseType: !112, size: 64, offset: 256)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "notes", scope: !311, file: !261, line: 258, baseType: !319, size: 64, offset: 320)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cpp_line_note", file: !261, line: 235, baseType: !321)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_line_note", file: !261, line: 236, size: 128, elements: !322)
!322 = !{!323, !324}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !321, file: !261, line: 239, baseType: !112, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !321, file: !261, line: 245, baseType: !5, size: 32, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "cur_note", scope: !311, file: !261, line: 259, baseType: !5, size: 32, offset: 384)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "notes_used", scope: !311, file: !261, line: 260, baseType: !5, size: 32, offset: 416)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "notes_cap", scope: !311, file: !261, line: 261, baseType: !5, size: 32, offset: 448)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !311, file: !261, line: 263, baseType: !329, size: 64, offset: 512)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !311, file: !261, line: 267, baseType: !331, size: 64, offset: 576)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_file", file: !4, line: 42, flags: DIFlagFwdDecl)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !311, file: !261, line: 271, baseType: !112, size: 64, offset: 640)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "if_stack", scope: !311, file: !261, line: 275, baseType: !335, size: 64, offset: 704)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "if_stack", file: !261, line: 275, flags: DIFlagFwdDecl)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "need_line", scope: !311, file: !261, line: 278, baseType: !114, size: 8, offset: 768)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "warned_cplusplus_comments", scope: !311, file: !261, line: 284, baseType: !5, size: 1, offset: 776, flags: DIFlagBitField, extraData: i64 776)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "from_stage3", scope: !311, file: !261, line: 289, baseType: !5, size: 1, offset: 777, flags: DIFlagBitField, extraData: i64 776)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "return_at_eof", scope: !311, file: !261, line: 294, baseType: !5, size: 1, offset: 778, flags: DIFlagBitField, extraData: i64 776)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !311, file: !261, line: 298, baseType: !114, size: 8, offset: 784)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !311, file: !261, line: 302, baseType: !343, size: 512, offset: 832)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_dir", file: !4, line: 523, size: 512, elements: !344)
!344 = !{!345, !347, !348, !349, !350, !351, !352, !354, !360, !364}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !343, file: !4, line: 526, baseType: !346, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !343, file: !4, line: 529, baseType: !200, size: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !343, file: !4, line: 530, baseType: !5, size: 32, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !343, file: !4, line: 534, baseType: !114, size: 8, offset: 160)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "user_supplied_p", scope: !343, file: !4, line: 537, baseType: !114, size: 8, offset: 168)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "canonical_name", scope: !343, file: !4, line: 541, baseType: !200, size: 64, offset: 192)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "name_map", scope: !343, file: !4, line: 545, baseType: !353, size: 64, offset: 256)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "construct", scope: !343, file: !4, line: 551, baseType: !355, size: 64, offset: 320)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!200, !266, !358}
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_dir", file: !4, line: 39, baseType: !343)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !343, file: !4, line: 555, baseType: !361, size: 64, offset: 384)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !362, line: 47, baseType: !363)
!362 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !232, line: 148, baseType: !75)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !343, file: !4, line: 556, baseType: !365, size: 64, offset: 448)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !362, line: 59, baseType: !366)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !232, line: 145, baseType: !75)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "input_cset_desc", scope: !311, file: !261, line: 306, baseType: !368, size: 192, offset: 1344)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cset_converter", file: !261, line: 47, size: 192, elements: !369)
!369 = !{!370, !379, !380}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !368, file: !261, line: 49, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "convert_f", file: !261, line: 45, baseType: !372)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{!114, !375, !112, !73, !377}
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "iconv_t", file: !376, line: 29, baseType: !69)
!376 = !DIFile(filename: "/usr/include/iconv.h", directory: "")
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_strbuf", file: !261, line: 43, flags: DIFlagFwdDecl)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "cd", scope: !368, file: !261, line: 50, baseType: !375, size: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !368, file: !261, line: 51, baseType: !63, size: 32, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "overlaid_buffer", scope: !306, file: !261, line: 328, baseType: !309, size: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !306, file: !261, line: 331, baseType: !383, size: 160, offset: 128)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lexer_state", file: !261, line: 177, size: 160, elements: !384)
!384 = !{!385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "in_directive", scope: !383, file: !261, line: 180, baseType: !114, size: 8)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "directive_wants_padding", scope: !383, file: !261, line: 185, baseType: !114, size: 8, offset: 8)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "skipping", scope: !383, file: !261, line: 188, baseType: !114, size: 8, offset: 16)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "angled_headers", scope: !383, file: !261, line: 191, baseType: !114, size: 8, offset: 24)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "in_expression", scope: !383, file: !261, line: 194, baseType: !114, size: 8, offset: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "save_comments", scope: !383, file: !261, line: 198, baseType: !114, size: 8, offset: 40)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "va_args_ok", scope: !383, file: !261, line: 201, baseType: !114, size: 8, offset: 48)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "poisoned_ok", scope: !383, file: !261, line: 204, baseType: !114, size: 8, offset: 56)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "prevent_expansion", scope: !383, file: !261, line: 207, baseType: !114, size: 8, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "parsing_args", scope: !383, file: !261, line: 210, baseType: !114, size: 8, offset: 72)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "discarding_output", scope: !383, file: !261, line: 214, baseType: !114, size: 8, offset: 80)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "skip_eval", scope: !383, file: !261, line: 217, baseType: !5, size: 32, offset: 96)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "in_deferred_pragma", scope: !383, file: !261, line: 220, baseType: !114, size: 8, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "pragma_allow_expansion", scope: !383, file: !261, line: 223, baseType: !114, size: 8, offset: 136)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "line_table", scope: !306, file: !261, line: 334, baseType: !400, size: 64, offset: 320)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line_maps", file: !142, line: 74, size: 448, elements: !402)
!402 = !{!403, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "maps", scope: !401, file: !142, line: 75, baseType: !404, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line_map", file: !142, line: 61, size: 192, elements: !406)
!406 = !{!407, !408, !410, !411, !412, !413, !414}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "to_file", scope: !405, file: !142, line: 62, baseType: !266, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "to_line", scope: !405, file: !142, line: 63, baseType: !409, size: 32, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "linenum_type", file: !142, line: 39, baseType: !5)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "start_location", scope: !405, file: !142, line: 64, baseType: !141, size: 32, offset: 96)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "included_from", scope: !405, file: !142, line: 65, baseType: !63, size: 32, offset: 128)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !405, file: !142, line: 66, baseType: !5, size: 8, offset: 160, flags: DIFlagBitField, extraData: i64 160)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !405, file: !142, line: 68, baseType: !114, size: 8, offset: 168)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "column_bits", scope: !405, file: !142, line: 70, baseType: !5, size: 8, offset: 176, flags: DIFlagBitField, extraData: i64 176)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !401, file: !142, line: 76, baseType: !5, size: 32, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !401, file: !142, line: 77, baseType: !5, size: 32, offset: 96)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !401, file: !142, line: 79, baseType: !5, size: 32, offset: 128)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "last_listed", scope: !401, file: !142, line: 84, baseType: !63, size: 32, offset: 160)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !401, file: !142, line: 87, baseType: !5, size: 32, offset: 192)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "trace_includes", scope: !401, file: !142, line: 90, baseType: !114, size: 8, offset: 224)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "highest_location", scope: !401, file: !142, line: 93, baseType: !141, size: 32, offset: 256)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "highest_line", scope: !401, file: !142, line: 96, baseType: !141, size: 32, offset: 288)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "max_column_hint", scope: !401, file: !142, line: 100, baseType: !5, size: 32, offset: 320)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "reallocator", scope: !401, file: !142, line: 104, baseType: !425, size: 64, offset: 384)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "line_map_realloc", file: !142, line: 47, baseType: !426)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{!69, !69, !73}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "directive_line", scope: !306, file: !261, line: 337, baseType: !141, size: 32, offset: 384)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "a_buff", scope: !306, file: !261, line: 340, baseType: !431, size: 64, offset: 448)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cpp_buff", file: !261, line: 99, baseType: !433)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_buff", file: !261, line: 100, size: 256, elements: !434)
!434 = !{!435, !437, !438, !439}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !433, file: !261, line: 102, baseType: !436, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !433, file: !261, line: 103, baseType: !188, size: 64, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !433, file: !261, line: 103, baseType: !188, size: 64, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !433, file: !261, line: 103, baseType: !188, size: 64, offset: 192)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "u_buff", scope: !306, file: !261, line: 341, baseType: !431, size: 64, offset: 512)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "free_buffs", scope: !306, file: !261, line: 342, baseType: !431, size: 64, offset: 576)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "base_context", scope: !306, file: !261, line: 345, baseType: !443, size: 448, offset: 640)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_context", file: !261, line: 142, size: 448, elements: !444)
!444 = !{!445, !448, !449, !469, !470, !471}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !443, file: !261, line: 145, baseType: !446, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_context", file: !261, line: 141, baseType: !443)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !443, file: !261, line: 145, baseType: !446, size: 64, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !443, file: !261, line: 164, baseType: !450, size: 128, offset: 128)
!450 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !443, file: !261, line: 147, size: 128, elements: !451)
!451 = !{!452, !464}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "iso", scope: !450, file: !261, line: 156, baseType: !453, size: 128)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !450, file: !261, line: 152, size: 128, elements: !454)
!454 = !{!455, !463}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !453, file: !261, line: 154, baseType: !456, size: 64)
!456 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "utoken", file: !261, line: 121, size: 64, elements: !457)
!457 = !{!458, !461}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !456, file: !261, line: 123, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !137)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "ptoken", scope: !456, file: !261, line: 124, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !453, file: !261, line: 155, baseType: !456, size: 64, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "trad", scope: !450, file: !261, line: 163, baseType: !465, size: 128)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !450, file: !261, line: 159, size: 128, elements: !466)
!466 = !{!467, !468}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !465, file: !261, line: 161, baseType: !112, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit", scope: !465, file: !261, line: 162, baseType: !112, size: 64, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !443, file: !261, line: 168, baseType: !431, size: 64, offset: 256)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !443, file: !261, line: 171, baseType: !103, size: 64, offset: 320)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "direct_p", scope: !443, file: !261, line: 174, baseType: !114, size: 8, offset: 384)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !306, file: !261, line: 346, baseType: !473, size: 64, offset: 1088)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "directive", scope: !306, file: !261, line: 349, baseType: !475, size: 64, offset: 1152)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !477)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "directive", file: !261, line: 40, flags: DIFlagFwdDecl)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "directive_result", scope: !306, file: !261, line: 352, baseType: !137, size: 192, offset: 1216)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "invocation_location", scope: !306, file: !261, line: 356, baseType: !141, size: 32, offset: 1408)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "set_invocation_location", scope: !306, file: !261, line: 360, baseType: !114, size: 8, offset: 1440)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "quote_include", scope: !306, file: !261, line: 363, baseType: !346, size: 64, offset: 1472)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "bracket_include", scope: !306, file: !261, line: 364, baseType: !346, size: 64, offset: 1536)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "no_search_path", scope: !306, file: !261, line: 365, baseType: !343, size: 512, offset: 1600)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "all_files", scope: !306, file: !261, line: 368, baseType: !331, size: 64, offset: 2112)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "main_file", scope: !306, file: !261, line: 370, baseType: !331, size: 64, offset: 2176)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "file_hash", scope: !306, file: !261, line: 373, baseType: !47, size: 64, offset: 2240)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "dir_hash", scope: !306, file: !261, line: 374, baseType: !47, size: 64, offset: 2304)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "file_hash_entries", scope: !306, file: !261, line: 375, baseType: !489, size: 64, offset: 2368)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DICompositeType(tag: DW_TAG_structure_type, name: "file_hash_entry_pool", file: !261, line: 375, flags: DIFlagFwdDecl)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "nonexistent_file_hash", scope: !306, file: !261, line: 378, baseType: !47, size: 64, offset: 2432)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "nonexistent_file_ob", scope: !306, file: !261, line: 379, baseType: !493, size: 704, offset: 2496)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !494, line: 164, size: 704, elements: !495)
!494 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!495 = !{!496, !497, !507, !508, !509, !510, !511, !512, !516, !520, !521, !522, !523}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !493, file: !494, line: 166, baseType: !233, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !493, file: !494, line: 167, baseType: !498, size: 64, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !494, line: 157, size: 192, elements: !500)
!500 = !{!501, !502, !503}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !499, file: !494, line: 159, baseType: !200, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !499, file: !494, line: 160, baseType: !498, size: 64, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !499, file: !494, line: 161, baseType: !504, size: 32, offset: 128)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 32, elements: !505)
!505 = !{!506}
!506 = !DISubrange(count: 4)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !493, file: !494, line: 168, baseType: !200, size: 64, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !493, file: !494, line: 169, baseType: !200, size: 64, offset: 192)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !493, file: !494, line: 170, baseType: !200, size: 64, offset: 256)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !493, file: !494, line: 171, baseType: !233, size: 64, offset: 320)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !493, file: !494, line: 172, baseType: !63, size: 32, offset: 384)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !493, file: !494, line: 176, baseType: !513, size: 64, offset: 448)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DISubroutineType(types: !515)
!515 = !{!498, !69, !233}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !493, file: !494, line: 177, baseType: !517, size: 64, offset: 512)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DISubroutineType(types: !519)
!519 = !{null, !69, !498}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !493, file: !494, line: 178, baseType: !69, size: 64, offset: 576)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !493, file: !494, line: 179, baseType: !5, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !493, file: !494, line: 180, baseType: !5, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !493, file: !494, line: 184, baseType: !5, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "quote_ignores_source_dir", scope: !306, file: !261, line: 383, baseType: !114, size: 8, offset: 3200)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "seen_once_only", scope: !306, file: !261, line: 387, baseType: !114, size: 8, offset: 3208)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "mi_cmacro", scope: !306, file: !261, line: 390, baseType: !527, size: 64, offset: 3264)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !104)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "mi_ind_cmacro", scope: !306, file: !261, line: 391, baseType: !527, size: 64, offset: 3328)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "mi_valid", scope: !306, file: !261, line: 392, baseType: !114, size: 8, offset: 3392)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "cur_token", scope: !306, file: !261, line: 395, baseType: !136, size: 64, offset: 3456)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "base_run", scope: !306, file: !261, line: 396, baseType: !533, size: 256, offset: 3520)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "tokenrun", file: !261, line: 128, baseType: !534)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tokenrun", file: !261, line: 129, size: 256, elements: !535)
!535 = !{!536, !538, !539, !540}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !534, file: !261, line: 131, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !534, file: !261, line: 131, baseType: !537, size: 64, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !534, file: !261, line: 132, baseType: !136, size: 64, offset: 128)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !534, file: !261, line: 132, baseType: !136, size: 64, offset: 192)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "cur_run", scope: !306, file: !261, line: 396, baseType: !537, size: 64, offset: 3776)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "lookaheads", scope: !306, file: !261, line: 397, baseType: !5, size: 32, offset: 3840)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "keep_tokens", scope: !306, file: !261, line: 400, baseType: !5, size: 32, offset: 3872)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "macro_buffer", scope: !306, file: !261, line: 403, baseType: !188, size: 64, offset: 3904)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "macro_buffer_len", scope: !306, file: !261, line: 404, baseType: !5, size: 32, offset: 3968)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "narrow_cset_desc", scope: !306, file: !261, line: 408, baseType: !368, size: 192, offset: 4032)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_cset_desc", scope: !306, file: !261, line: 412, baseType: !368, size: 192, offset: 4224)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "char16_cset_desc", scope: !306, file: !261, line: 416, baseType: !368, size: 192, offset: 4416)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "char32_cset_desc", scope: !306, file: !261, line: 420, baseType: !368, size: 192, offset: 4608)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "wide_cset_desc", scope: !306, file: !261, line: 424, baseType: !368, size: 192, offset: 4800)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !306, file: !261, line: 427, baseType: !112, size: 64, offset: 4992)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !306, file: !261, line: 428, baseType: !112, size: 64, offset: 5056)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "avoid_paste", scope: !306, file: !261, line: 431, baseType: !137, size: 192, offset: 5120)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !306, file: !261, line: 432, baseType: !137, size: 192, offset: 5312)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "deps", scope: !306, file: !261, line: 435, baseType: !556, size: 64, offset: 5504)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DICompositeType(tag: DW_TAG_structure_type, name: "deps", file: !4, line: 685, flags: DIFlagFwdDecl)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "hash_ob", scope: !306, file: !261, line: 439, baseType: !493, size: 704, offset: 5568)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_ob", scope: !306, file: !261, line: 443, baseType: !493, size: 704, offset: 6272)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "pragmas", scope: !306, file: !261, line: 447, baseType: !561, size: 64, offset: 6976)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DICompositeType(tag: DW_TAG_structure_type, name: "pragma_entry", file: !261, line: 447, flags: DIFlagFwdDecl)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !306, file: !261, line: 450, baseType: !564, size: 1088, offset: 7040)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_callbacks", file: !4, line: 472, size: 1088, elements: !565)
!565 = !{!566, !570, !576, !580, !584, !588, !589, !596, !600, !604, !608, !614, !618, !633, !634, !635, !639}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "line_change", scope: !564, file: !4, line: 475, baseType: !567, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{null, !304, !459, !63}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "file_change", scope: !564, file: !4, line: 481, baseType: !571, size: 64, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DISubroutineType(types: !573)
!573 = !{null, !304, !574}
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !405)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "dir_change", scope: !564, file: !4, line: 483, baseType: !577, size: 64, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DISubroutineType(types: !579)
!579 = !{null, !304, !266}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "include", scope: !564, file: !4, line: 484, baseType: !581, size: 64, offset: 192)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DISubroutineType(types: !583)
!583 = !{null, !304, !5, !112, !266, !63, !462}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "define", scope: !564, file: !4, line: 486, baseType: !585, size: 64, offset: 256)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DISubroutineType(types: !587)
!587 = !{null, !304, !5, !103}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "undef", scope: !564, file: !4, line: 487, baseType: !585, size: 64, offset: 320)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !564, file: !4, line: 488, baseType: !590, size: 64, offset: 384)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{null, !304, !5, !593}
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !595)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_string", file: !4, line: 35, baseType: !155)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "def_pragma", scope: !564, file: !4, line: 489, baseType: !597, size: 64, offset: 448)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DISubroutineType(types: !599)
!599 = !{null, !304, !5}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "valid_pch", scope: !564, file: !4, line: 490, baseType: !601, size: 64, offset: 512)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{!63, !304, !266, !63}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "read_pch", scope: !564, file: !4, line: 491, baseType: !605, size: 64, offset: 576)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DISubroutineType(types: !607)
!607 = !{null, !304, !266, !63, !266}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "missing_header", scope: !564, file: !4, line: 492, baseType: !609, size: 64, offset: 640)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "missing_header_cb", file: !4, line: 469, baseType: !610)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DISubroutineType(types: !612)
!612 = !{!266, !304, !266, !613}
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "macro_to_expand", scope: !564, file: !4, line: 496, baseType: !615, size: 64, offset: 704)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{!103, !304, !459}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !564, file: !4, line: 500, baseType: !619, size: 64, offset: 768)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{!114, !304, !63, !141, !5, !266, !622}
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !624, line: 14, baseType: !625)
!624 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stdarg.h", directory: "")
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 216, baseType: !626)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !627, size: 192, elements: !183)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 216, size: 192, elements: !628)
!628 = !{!629, !630, !631, !632}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !627, file: !1, line: 216, baseType: !5, size: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !627, file: !1, line: 216, baseType: !5, size: 32, offset: 32)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !627, file: !1, line: 216, baseType: !69, size: 64, offset: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !627, file: !1, line: 216, baseType: !69, size: 64, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "used_define", scope: !564, file: !4, line: 506, baseType: !585, size: 64, offset: 832)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "used_undef", scope: !564, file: !4, line: 507, baseType: !585, size: 64, offset: 896)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "before_define", scope: !564, file: !4, line: 510, baseType: !636, size: 64, offset: 960)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DISubroutineType(types: !638)
!638 = !{null, !304}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !564, file: !4, line: 513, baseType: !640, size: 64, offset: 1024)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DISubroutineType(types: !642)
!642 = !{null, !304, !141, !103}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "hash_table", scope: !306, file: !261, line: 453, baseType: !644, size: 64, offset: 8128)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht", file: !109, line: 46, size: 1152, elements: !646)
!646 = !{!647, !648, !652, !658, !662, !663, !664, !666, !667, !668}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !645, file: !109, line: 49, baseType: !493, size: 704)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !645, file: !109, line: 51, baseType: !649, size: 64, offset: 704)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashnode", file: !109, line: 41, baseType: !651)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_node", scope: !645, file: !109, line: 53, baseType: !653, size: 64, offset: 768)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DISubroutineType(types: !655)
!655 = !{!650, !656}
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_table", file: !109, line: 40, baseType: !645)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_subobject", scope: !645, file: !109, line: 56, baseType: !659, size: 64, offset: 832)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DISubroutineType(types: !661)
!661 = !{!69, !73}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "nslots", scope: !645, file: !109, line: 58, baseType: !5, size: 32, offset: 896)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "nelements", scope: !645, file: !109, line: 59, baseType: !5, size: 32, offset: 928)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "pfile", scope: !645, file: !109, line: 62, baseType: !665, size: 64, offset: 960)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !645, file: !109, line: 65, baseType: !5, size: 32, offset: 1024)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !645, file: !109, line: 66, baseType: !5, size: 32, offset: 1056)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "entries_owned", scope: !645, file: !109, line: 69, baseType: !114, size: 8, offset: 1088)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "op_stack", scope: !306, file: !261, line: 456, baseType: !670, size: 64, offset: 8192)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DICompositeType(tag: DW_TAG_structure_type, name: "op", file: !261, line: 42, flags: DIFlagFwdDecl)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "op_limit", scope: !306, file: !261, line: 456, baseType: !670, size: 64, offset: 8256)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !306, file: !261, line: 459, baseType: !674, size: 1024, offset: 8320)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_options", file: !4, line: 279, size: 1024, elements: !675)
!675 = !{!676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !727, !728, !729, !730, !731, !732, !733, !734, !735}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "tabstop", scope: !674, file: !4, line: 282, baseType: !5, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "lang", scope: !674, file: !4, line: 285, baseType: !17, size: 32, offset: 32)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "cplusplus", scope: !674, file: !4, line: 288, baseType: !114, size: 8, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "cplusplus_comments", scope: !674, file: !4, line: 291, baseType: !114, size: 8, offset: 72)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "objc", scope: !674, file: !4, line: 296, baseType: !114, size: 8, offset: 80)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "discard_comments", scope: !674, file: !4, line: 299, baseType: !114, size: 8, offset: 88)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "discard_comments_in_macro_exp", scope: !674, file: !4, line: 303, baseType: !114, size: 8, offset: 96)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "trigraphs", scope: !674, file: !4, line: 306, baseType: !114, size: 8, offset: 104)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "digraphs", scope: !674, file: !4, line: 309, baseType: !114, size: 8, offset: 112)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "extended_numbers", scope: !674, file: !4, line: 312, baseType: !114, size: 8, offset: 120)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "uliterals", scope: !674, file: !4, line: 315, baseType: !114, size: 8, offset: 128)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "print_include_names", scope: !674, file: !4, line: 318, baseType: !114, size: 8, offset: 136)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "warn_deprecated", scope: !674, file: !4, line: 321, baseType: !114, size: 8, offset: 144)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "warn_comments", scope: !674, file: !4, line: 324, baseType: !114, size: 8, offset: 152)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "warn_missing_include_dirs", scope: !674, file: !4, line: 328, baseType: !114, size: 8, offset: 160)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "warn_trigraphs", scope: !674, file: !4, line: 331, baseType: !114, size: 8, offset: 168)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "warn_multichar", scope: !674, file: !4, line: 334, baseType: !114, size: 8, offset: 176)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "warn_traditional", scope: !674, file: !4, line: 338, baseType: !114, size: 8, offset: 184)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "warn_long_long", scope: !674, file: !4, line: 341, baseType: !114, size: 8, offset: 192)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "warn_endif_labels", scope: !674, file: !4, line: 344, baseType: !114, size: 8, offset: 200)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "warn_num_sign_change", scope: !674, file: !4, line: 348, baseType: !114, size: 8, offset: 208)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "warn_variadic_macros", scope: !674, file: !4, line: 352, baseType: !114, size: 8, offset: 216)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "warn_builtin_macro_redefined", scope: !674, file: !4, line: 356, baseType: !114, size: 8, offset: 224)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !674, file: !4, line: 360, baseType: !114, size: 8, offset: 232)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "dollars_in_ident", scope: !674, file: !4, line: 363, baseType: !114, size: 8, offset: 240)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "extended_identifiers", scope: !674, file: !4, line: 366, baseType: !114, size: 8, offset: 248)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "warn_dollars", scope: !674, file: !4, line: 370, baseType: !114, size: 8, offset: 256)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "warn_undef", scope: !674, file: !4, line: 373, baseType: !114, size: 8, offset: 264)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "warn_unused_macros", scope: !674, file: !4, line: 376, baseType: !114, size: 8, offset: 272)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "c99", scope: !674, file: !4, line: 379, baseType: !114, size: 8, offset: 280)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "std", scope: !674, file: !4, line: 382, baseType: !114, size: 8, offset: 288)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "pedantic", scope: !674, file: !4, line: 385, baseType: !114, size: 8, offset: 296)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "preprocessed", scope: !674, file: !4, line: 389, baseType: !114, size: 8, offset: 304)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "show_column", scope: !674, file: !4, line: 392, baseType: !114, size: 8, offset: 312)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "operator_names", scope: !674, file: !4, line: 395, baseType: !114, size: 8, offset: 320)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "warn_cxx_operator_names", scope: !674, file: !4, line: 398, baseType: !114, size: 8, offset: 328)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "traditional", scope: !674, file: !4, line: 401, baseType: !114, size: 8, offset: 336)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "narrow_charset", scope: !674, file: !4, line: 404, baseType: !266, size: 64, offset: 384)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "wide_charset", scope: !674, file: !4, line: 407, baseType: !266, size: 64, offset: 448)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "input_charset", scope: !674, file: !4, line: 410, baseType: !266, size: 64, offset: 512)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "warn_normalize", scope: !674, file: !4, line: 414, baseType: !29, size: 32, offset: 576)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "warn_invalid_pch", scope: !674, file: !4, line: 417, baseType: !114, size: 8, offset: 608)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "restore_pch_deps", scope: !674, file: !4, line: 420, baseType: !114, size: 8, offset: 616)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "deps", scope: !674, file: !4, line: 441, baseType: !720, size: 64, offset: 640)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !674, file: !4, line: 423, size: 64, elements: !721)
!721 = !{!722, !723, !724, !725, !726}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !720, file: !4, line: 426, baseType: !35, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "missing_files", scope: !720, file: !4, line: 429, baseType: !114, size: 8, offset: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "phony_targets", scope: !720, file: !4, line: 433, baseType: !114, size: 8, offset: 40)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_main_file", scope: !720, file: !4, line: 436, baseType: !114, size: 8, offset: 48)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "need_preprocessor_output", scope: !720, file: !4, line: 440, baseType: !114, size: 8, offset: 56)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !674, file: !4, line: 447, baseType: !73, size: 64, offset: 704)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "char_precision", scope: !674, file: !4, line: 447, baseType: !73, size: 64, offset: 768)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "int_precision", scope: !674, file: !4, line: 447, baseType: !73, size: 64, offset: 832)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "wchar_precision", scope: !674, file: !4, line: 447, baseType: !73, size: 64, offset: 896)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_char", scope: !674, file: !4, line: 450, baseType: !114, size: 8, offset: 960)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_wchar", scope: !674, file: !4, line: 450, baseType: !114, size: 8, offset: 968)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_big_endian", scope: !674, file: !4, line: 454, baseType: !114, size: 8, offset: 976)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "stdc_0_in_system_headers", scope: !674, file: !4, line: 457, baseType: !114, size: 8, offset: 984)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "directives_only", scope: !674, file: !4, line: 460, baseType: !114, size: 8, offset: 992)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "spec_nodes", scope: !306, file: !261, line: 463, baseType: !737, size: 256, offset: 9344)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spec_nodes", file: !261, line: 227, size: 256, elements: !738)
!738 = !{!739, !740, !741, !742}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "n_defined", scope: !737, file: !261, line: 229, baseType: !103, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "n_true", scope: !737, file: !261, line: 230, baseType: !103, size: 64, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "n_false", scope: !737, file: !261, line: 231, baseType: !103, size: 64, offset: 128)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "n__VA_ARGS__", scope: !737, file: !261, line: 232, baseType: !103, size: 64, offset: 192)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "our_hashtable", scope: !306, file: !261, line: 466, baseType: !114, size: 8, offset: 9600)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !306, file: !261, line: 475, baseType: !745, size: 256, offset: 9664)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !306, file: !261, line: 469, size: 256, elements: !746)
!746 = !{!747, !748, !749, !750}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !745, file: !261, line: 471, baseType: !188, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !745, file: !261, line: 472, baseType: !188, size: 64, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !745, file: !261, line: 473, baseType: !188, size: 64, offset: 128)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "first_line", scope: !745, file: !261, line: 474, baseType: !141, size: 32, offset: 192)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "saved_cur", scope: !306, file: !261, line: 478, baseType: !112, size: 64, offset: 9920)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "saved_rlimit", scope: !306, file: !261, line: 478, baseType: !112, size: 64, offset: 9984)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "saved_line_base", scope: !306, file: !261, line: 478, baseType: !112, size: 64, offset: 10048)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "savedstate", scope: !306, file: !261, line: 482, baseType: !41, size: 64, offset: 10112)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !306, file: !261, line: 485, baseType: !5, size: 32, offset: 10176)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "comments", scope: !306, file: !261, line: 488, baseType: !757, size: 128, offset: 10240)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_comment_table", file: !4, line: 901, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 891, size: 128, elements: !759)
!759 = !{!760, !767, !768}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !758, file: !4, line: 894, baseType: !761, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_comment", file: !4, line: 887, baseType: !763)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 880, size: 128, elements: !764)
!764 = !{!765, !766}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !763, file: !4, line: 883, baseType: !200, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "sloc", scope: !763, file: !4, line: 886, baseType: !141, size: 32, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !758, file: !4, line: 897, baseType: !63, size: 32, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !758, file: !4, line: 900, baseType: !63, size: 32, offset: 96)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "pushed_macros", scope: !306, file: !261, line: 491, baseType: !259, size: 64, offset: 10368)
!770 = !{!771, !772}
!771 = !DILocalVariable(name: "r", arg: 1, scope: !301, file: !1, line: 200, type: !304)
!772 = !DILocalVariable(name: "f", arg: 2, scope: !301, file: !1, line: 200, type: !205)
!773 = !DILocation(line: 0, scope: !301)
!774 = !DILocation(line: 203, column: 19, scope: !301)
!775 = !DILocation(line: 203, column: 6, scope: !301)
!776 = !DILocation(line: 203, column: 17, scope: !301)
!777 = !DILocation(line: 204, column: 32, scope: !301)
!778 = !DILocation(line: 204, column: 6, scope: !301)
!779 = !DILocation(line: 204, column: 18, scope: !301)
!780 = !DILocation(line: 204, column: 30, scope: !301)
!781 = !DILocation(line: 206, column: 46, scope: !301)
!782 = !DILocation(line: 206, column: 3, scope: !301)
!783 = !DILocation(line: 209, column: 44, scope: !301)
!784 = !DILocation(line: 209, column: 3, scope: !301)
!785 = !DILocation(line: 211, column: 3, scope: !301)
!786 = distinct !DISubprogram(name: "cpp_string_hash", scope: !1, file: !1, line: 177, type: !53, scopeLine: 178, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !787)
!787 = !{!788, !789}
!788 = !DILocalVariable(name: "a_p", arg: 1, scope: !786, file: !1, line: 177, type: !56)
!789 = !DILocalVariable(name: "a", scope: !786, file: !1, line: 179, type: !202)
!790 = !DILocation(line: 0, scope: !786)
!791 = !DILocation(line: 180, column: 22, scope: !786)
!792 = !DILocation(line: 180, column: 31, scope: !786)
!793 = !DILocation(line: 180, column: 28, scope: !786)
!794 = !DILocation(line: 180, column: 10, scope: !786)
!795 = !DILocation(line: 180, column: 3, scope: !786)
!796 = distinct !DISubprogram(name: "cpp_string_eq", scope: !1, file: !1, line: 186, type: !61, scopeLine: 187, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !797)
!797 = !{!798, !799, !800, !801}
!798 = !DILocalVariable(name: "a_p", arg: 1, scope: !796, file: !1, line: 186, type: !56)
!799 = !DILocalVariable(name: "b_p", arg: 2, scope: !796, file: !1, line: 186, type: !56)
!800 = !DILocalVariable(name: "a", scope: !796, file: !1, line: 188, type: !202)
!801 = !DILocalVariable(name: "b", scope: !796, file: !1, line: 189, type: !202)
!802 = !DILocation(line: 0, scope: !796)
!803 = !DILocation(line: 190, column: 14, scope: !796)
!804 = !DILocation(line: 190, column: 24, scope: !796)
!805 = !DILocation(line: 190, column: 18, scope: !796)
!806 = !DILocation(line: 191, column: 4, scope: !796)
!807 = !DILocation(line: 191, column: 18, scope: !796)
!808 = !DILocation(line: 191, column: 27, scope: !796)
!809 = !DILocation(line: 191, column: 33, scope: !796)
!810 = !DILocation(line: 191, column: 7, scope: !796)
!811 = !DILocation(line: 191, column: 41, scope: !796)
!812 = !DILocation(line: 190, column: 3, scope: !796)
!813 = distinct !DISubprogram(name: "save_idents", scope: !1, file: !1, line: 130, type: !814, scopeLine: 131, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !816)
!814 = !DISubroutineType(types: !815)
!815 = !{!63, !304, !103, !69}
!816 = !{!817, !818, !819, !820, !822, !825, !826, !829}
!817 = !DILocalVariable(name: "pfile", arg: 1, scope: !813, file: !1, line: 130, type: !304)
!818 = !DILocalVariable(name: "hn", arg: 2, scope: !813, file: !1, line: 130, type: !103)
!819 = !DILocalVariable(name: "ss_p", arg: 3, scope: !813, file: !1, line: 130, type: !69)
!820 = !DILocalVariable(name: "ss", scope: !813, file: !1, line: 132, type: !821)
!821 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!822 = !DILocalVariable(name: "news", scope: !823, file: !1, line: 136, type: !155)
!823 = distinct !DILexicalBlock(scope: !824, file: !1, line: 135, column: 5)
!824 = distinct !DILexicalBlock(scope: !813, file: !1, line: 134, column: 7)
!825 = !DILocalVariable(name: "slot", scope: !823, file: !1, line: 137, type: !71)
!826 = !DILocalVariable(name: "sp", scope: !827, file: !1, line: 144, type: !204)
!827 = distinct !DILexicalBlock(scope: !828, file: !1, line: 143, column: 2)
!828 = distinct !DILexicalBlock(scope: !823, file: !1, line: 142, column: 11)
!829 = !DILocalVariable(name: "text", scope: !827, file: !1, line: 145, type: !188)
!830 = !DILocation(line: 0, scope: !813)
!831 = !DILocation(line: 134, column: 11, scope: !824)
!832 = !DILocation(line: 134, column: 16, scope: !824)
!833 = !DILocation(line: 134, column: 7, scope: !813)
!834 = !DILocation(line: 136, column: 7, scope: !823)
!835 = !DILocation(line: 139, column: 18, scope: !823)
!836 = !DILocation(line: 139, column: 12, scope: !823)
!837 = !DILocation(line: 139, column: 16, scope: !823)
!838 = !DILocation(line: 140, column: 18, scope: !823)
!839 = !DILocation(line: 140, column: 12, scope: !823)
!840 = !DILocation(line: 140, column: 16, scope: !823)
!841 = !DILocation(line: 141, column: 34, scope: !823)
!842 = !DILocation(line: 141, column: 14, scope: !823)
!843 = !DILocation(line: 0, scope: !823)
!844 = !DILocation(line: 142, column: 11, scope: !828)
!845 = !DILocation(line: 142, column: 17, scope: !828)
!846 = !DILocation(line: 142, column: 11, scope: !823)
!847 = !DILocation(line: 147, column: 9, scope: !827)
!848 = !DILocation(line: 0, scope: !827)
!849 = !DILocation(line: 148, column: 10, scope: !827)
!850 = !DILocation(line: 150, column: 14, scope: !827)
!851 = !DILocation(line: 150, column: 8, scope: !827)
!852 = !DILocation(line: 150, column: 12, scope: !827)
!853 = !DILocation(line: 151, column: 22, scope: !827)
!854 = !DILocation(line: 151, column: 8, scope: !827)
!855 = !DILocation(line: 151, column: 13, scope: !827)
!856 = !DILocation(line: 152, column: 18, scope: !827)
!857 = !DILocation(line: 152, column: 34, scope: !827)
!858 = !DILocation(line: 152, column: 4, scope: !827)
!859 = !DILocation(line: 153, column: 2, scope: !827)
!860 = !DILocation(line: 154, column: 5, scope: !824)
!861 = !DILocation(line: 154, column: 5, scope: !823)
!862 = !DILocation(line: 156, column: 3, scope: !813)
!863 = distinct !DISubprogram(name: "write_macdef", scope: !1, file: !1, line: 56, type: !814, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !864)
!864 = !{!865, !866, !867, !868, !869, !877}
!865 = !DILocalVariable(name: "pfile", arg: 1, scope: !863, file: !1, line: 56, type: !304)
!866 = !DILocalVariable(name: "hn", arg: 2, scope: !863, file: !1, line: 56, type: !103)
!867 = !DILocalVariable(name: "file_p", arg: 3, scope: !863, file: !1, line: 56, type: !69)
!868 = !DILocalVariable(name: "f", scope: !863, file: !1, line: 58, type: !205)
!869 = !DILocalVariable(name: "s", scope: !870, file: !1, line: 70, type: !872)
!870 = distinct !DILexicalBlock(scope: !871, file: !1, line: 69, column: 7)
!871 = distinct !DILexicalBlock(scope: !863, file: !1, line: 60, column: 5)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "macrodef_struct", file: !1, line: 45, size: 64, elements: !873)
!873 = !{!874, !875, !876}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "definition_length", scope: !872, file: !1, line: 47, baseType: !5, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "name_length", scope: !872, file: !1, line: 48, baseType: !145, size: 16, offset: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !872, file: !1, line: 49, baseType: !145, size: 16, offset: 48)
!877 = !DILocalVariable(name: "defn", scope: !870, file: !1, line: 71, type: !112)
!878 = !DILocation(line: 0, scope: !863)
!879 = !DILocation(line: 58, column: 13, scope: !863)
!880 = !DILocation(line: 59, column: 15, scope: !863)
!881 = !DILocation(line: 59, column: 3, scope: !863)
!882 = !DILocation(line: 62, column: 24, scope: !883)
!883 = distinct !DILexicalBlock(scope: !871, file: !1, line: 62, column: 11)
!884 = !DILocation(line: 62, column: 11, scope: !871)
!885 = !DILocation(line: 66, column: 22, scope: !886)
!886 = distinct !DILexicalBlock(scope: !871, file: !1, line: 66, column: 11)
!887 = !DILocation(line: 66, column: 11, scope: !871)
!888 = !DILocation(line: 70, column: 2, scope: !870)
!889 = !DILocation(line: 73, column: 18, scope: !870)
!890 = !DILocation(line: 73, column: 4, scope: !870)
!891 = !DILocation(line: 73, column: 16, scope: !870)
!892 = !DILocation(line: 74, column: 16, scope: !870)
!893 = !DILocation(line: 74, column: 22, scope: !870)
!894 = !DILocation(line: 74, column: 4, scope: !870)
!895 = !DILocation(line: 74, column: 10, scope: !870)
!896 = !DILocation(line: 76, column: 15, scope: !897)
!897 = distinct !DILexicalBlock(scope: !870, file: !1, line: 76, column: 6)
!898 = !DILocation(line: 76, column: 6, scope: !870)
!899 = !DILocation(line: 78, column: 13, scope: !900)
!900 = distinct !DILexicalBlock(scope: !897, file: !1, line: 77, column: 4)
!901 = !DILocation(line: 0, scope: !870)
!902 = !DILocation(line: 79, column: 28, scope: !900)
!903 = !DILocation(line: 79, column: 8, scope: !900)
!904 = !DILocation(line: 79, column: 26, scope: !900)
!905 = !DILocation(line: 80, column: 4, scope: !900)
!906 = !DILocation(line: 83, column: 13, scope: !907)
!907 = distinct !DILexicalBlock(scope: !897, file: !1, line: 82, column: 4)
!908 = !DILocation(line: 84, column: 28, scope: !907)
!909 = !DILocation(line: 84, column: 8, scope: !907)
!910 = !DILocation(line: 84, column: 26, scope: !907)
!911 = !DILocation(line: 0, scope: !897)
!912 = !DILocation(line: 87, column: 6, scope: !913)
!913 = distinct !DILexicalBlock(scope: !870, file: !1, line: 87, column: 6)
!914 = !DILocation(line: 87, column: 36, scope: !913)
!915 = !DILocation(line: 88, column: 6, scope: !913)
!916 = !DILocation(line: 88, column: 28, scope: !913)
!917 = !DILocation(line: 88, column: 26, scope: !913)
!918 = !DILocation(line: 88, column: 9, scope: !913)
!919 = !DILocation(line: 88, column: 55, scope: !913)
!920 = !DILocation(line: 88, column: 53, scope: !913)
!921 = !DILocation(line: 88, column: 50, scope: !913)
!922 = !DILocation(line: 87, column: 6, scope: !870)
!923 = !DILocation(line: 90, column: 6, scope: !924)
!924 = distinct !DILexicalBlock(scope: !913, file: !1, line: 89, column: 4)
!925 = !DILocation(line: 92, column: 6, scope: !924)
!926 = !DILocation(line: 94, column: 7, scope: !871)
!927 = !DILocation(line: 102, column: 7, scope: !871)
!928 = !DILocation(line: 104, column: 1, scope: !863)
!929 = distinct !DISubprogram(name: "cpp_write_pch_deps", scope: !1, file: !1, line: 307, type: !302, scopeLine: 308, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !930)
!930 = !{!931, !932, !933, !934, !935, !936, !937}
!931 = !DILocalVariable(name: "r", arg: 1, scope: !929, file: !1, line: 307, type: !304)
!932 = !DILocalVariable(name: "f", arg: 2, scope: !929, file: !1, line: 307, type: !205)
!933 = !DILocalVariable(name: "z", scope: !929, file: !1, line: 309, type: !872)
!934 = !DILocalVariable(name: "ss", scope: !929, file: !1, line: 310, type: !821)
!935 = !DILocalVariable(name: "definedstrs", scope: !929, file: !1, line: 311, type: !188)
!936 = !DILocalVariable(name: "i", scope: !929, file: !1, line: 312, type: !73)
!937 = !DILocalVariable(name: "len", scope: !938, file: !1, line: 333, type: !73)
!938 = distinct !DILexicalBlock(scope: !939, file: !1, line: 332, column: 5)
