; ModuleID = 'cpp_expr.bc'
source_filename = "cpp_expr.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.cpp_operator = type { i8, i8 }
%struct.cpp_reader = type { %struct.cpp_buffer*, %struct.cpp_buffer*, %struct.lexer_state, %struct.line_maps*, i32, %struct._cpp_buff*, %struct._cpp_buff*, %struct._cpp_buff*, %struct.cpp_context, %struct.cpp_context*, %struct.directive*, %struct.cpp_token, i32, i8, %struct.cpp_dir*, %struct.cpp_dir*, %struct.cpp_dir, %struct._cpp_file*, %struct._cpp_file*, %struct.htab*, %struct.htab*, %struct.file_hash_entry_pool*, %struct.htab*, %struct.obstack, i8, i8, %struct.cpp_hashnode*, %struct.cpp_hashnode*, i8, %struct.cpp_token*, %struct.tokenrun, %struct.tokenrun*, i32, i32, i8*, i32, %struct.cset_converter, %struct.cset_converter, %struct.cset_converter, %struct.cset_converter, %struct.cset_converter, i8*, i8*, %struct.cpp_token, %struct.cpp_token, %struct.deps*, %struct.obstack, %struct.obstack, %struct.pragma_entry*, %struct.cpp_callbacks, %struct.ht*, %struct.op*, %struct.op*, %struct.cpp_options, %struct.spec_nodes, i8, %struct.anon.2, i8*, i8*, i8*, %struct.cpp_savedstate*, i32, %struct.cpp_comment_table, %struct.def_pragma_macro* }
%struct.cpp_buffer = type { i8*, i8*, i8*, i8*, i8*, %struct._cpp_line_note*, i32, i32, i32, %struct.cpp_buffer*, %struct._cpp_file*, i8*, %struct.if_stack*, i8, i8, i8, %struct.cpp_dir, %struct.cset_converter }

!69 = !DIEnumerator(name: "CPP_DOT", value: 48, isUnsigned: true)
!70 = !DIEnumerator(name: "CPP_SCOPE", value: 49, isUnsigned: true)
!71 = !DIEnumerator(name: "CPP_DEREF_STAR", value: 50, isUnsigned: true)
!72 = !DIEnumerator(name: "CPP_DOT_STAR", value: 51, isUnsigned: true)
!73 = !DIEnumerator(name: "CPP_ATSIGN", value: 52, isUnsigned: true)
!74 = !DIEnumerator(name: "CPP_NAME", value: 53, isUnsigned: true)
!75 = !DIEnumerator(name: "CPP_AT_NAME", value: 54, isUnsigned: true)
!76 = !DIEnumerator(name: "CPP_NUMBER", value: 55, isUnsigned: true)
!77 = !DIEnumerator(name: "CPP_CHAR", value: 56, isUnsigned: true)
!78 = !DIEnumerator(name: "CPP_WCHAR", value: 57, isUnsigned: true)
!79 = !DIEnumerator(name: "CPP_CHAR16", value: 58, isUnsigned: true)
!80 = !DIEnumerator(name: "CPP_CHAR32", value: 59, isUnsigned: true)
!81 = !DIEnumerator(name: "CPP_OTHER", value: 60, isUnsigned: true)
!82 = !DIEnumerator(name: "CPP_STRING", value: 61, isUnsigned: true)
!83 = !DIEnumerator(name: "CPP_WSTRING", value: 62, isUnsigned: true)
!84 = !DIEnumerator(name: "CPP_STRING16", value: 63, isUnsigned: true)
!85 = !DIEnumerator(name: "CPP_STRING32", value: 64, isUnsigned: true)
!86 = !DIEnumerator(name: "CPP_UTF8STRING", value: 65, isUnsigned: true)
!87 = !DIEnumerator(name: "CPP_OBJC_STRING", value: 66, isUnsigned: true)
!88 = !DIEnumerator(name: "CPP_HEADER_NAME", value: 67, isUnsigned: true)
!89 = !DIEnumerator(name: "CPP_COMMENT", value: 68, isUnsigned: true)
!90 = !DIEnumerator(name: "CPP_MACRO_ARG", value: 69, isUnsigned: true)
!91 = !DIEnumerator(name: "CPP_PRAGMA", value: 70, isUnsigned: true)
!92 = !DIEnumerator(name: "CPP_PRAGMA_EOL", value: 71, isUnsigned: true)
!93 = !DIEnumerator(name: "CPP_PADDING", value: 72, isUnsigned: true)
!94 = !DIEnumerator(name: "N_TTYPES", value: 73, isUnsigned: true)
!95 = !DIEnumerator(name: "CPP_LAST_EQ", value: 13, isUnsigned: true)
!96 = !DIEnumerator(name: "CPP_FIRST_DIGRAPH", value: 37, isUnsigned: true)
!97 = !DIEnumerator(name: "CPP_LAST_PUNCTUATOR", value: 52, isUnsigned: true)
!98 = !DIEnumerator(name: "CPP_LAST_CPP_OP", value: 26, isUnsigned: true)
!99 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_lang", file: !6, line: 158, baseType: !7, size: 32, elements: !100)
!100 = !{!101, !102, !103, !104, !105, !106, !107, !108, !109, !110}
!101 = !DIEnumerator(name: "CLK_GNUC89", value: 0, isUnsigned: true)
!102 = !DIEnumerator(name: "CLK_GNUC99", value: 1, isUnsigned: true)
!103 = !DIEnumerator(name: "CLK_STDC89", value: 2, isUnsigned: true)
!104 = !DIEnumerator(name: "CLK_STDC94", value: 3, isUnsigned: true)
!105 = !DIEnumerator(name: "CLK_STDC99", value: 4, isUnsigned: true)
!106 = !DIEnumerator(name: "CLK_GNUCXX", value: 5, isUnsigned: true)
!107 = !DIEnumerator(name: "CLK_CXX98", value: 6, isUnsigned: true)
!108 = !DIEnumerator(name: "CLK_GNUCXX0X", value: 7, isUnsigned: true)
!109 = !DIEnumerator(name: "CLK_CXX0X", value: 8, isUnsigned: true)
!110 = !DIEnumerator(name: "CLK_ASM", value: 9, isUnsigned: true)
!111 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cpp_normalize_level", file: !6, line: 265, baseType: !7, size: 32, elements: !112)
!112 = !{!113, !114, !115, !116}
!113 = !DIEnumerator(name: "normalized_KC", value: 0, isUnsigned: true)
!114 = !DIEnumerator(name: "normalized_C", value: 1, isUnsigned: true)
!115 = !DIEnumerator(name: "normalized_identifier_C", value: 2, isUnsigned: true)
!116 = !DIEnumerator(name: "normalized_none", value: 3, isUnsigned: true)
!117 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cpp_deps_style", file: !6, line: 262, baseType: !7, size: 32, elements: !118)
!118 = !{!119, !120, !121}
!119 = !DIEnumerator(name: "DEPS_NONE", value: 0, isUnsigned: true)
!120 = !DIEnumerator(name: "DEPS_USER", value: 1, isUnsigned: true)
!121 = !DIEnumerator(name: "DEPS_SYSTEM", value: 2, isUnsigned: true)
!122 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !123, file: !3, line: 232, baseType: !7, size: 32, elements: !739)
!123 = distinct !DISubprogram(name: "cpp_classify_number", scope: !3, file: !3, line: 227, type: !124, scopeLine: 228, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !714)
!124 = !DISubroutineType(types: !125)
!125 = !{!7, !126, !298}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_reader", file: !6, line: 31, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_reader", file: !129, line: 322, size: 10432, elements: !130)
!129 = !DIFile(filename: "./internal.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!130 = !{!131, !217, !218, !235, !267, !268, !279, !280, !281, !391, !393, !397, !398, !399, !400, !401, !402, !403, !404, !405, !408, !409, !412, !413, !446, !447, !448, !451, !452, !453, !454, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !480, !481, !482, !485, !565, !591, !608, !609, !672, !679, !680, !687, !688, !689, !690, !693, !694, !707}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !128, file: !129, line: 325, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_buffer", file: !6, line: 32, baseType: !134)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_buffer", file: !129, line: 249, size: 1536, elements: !135)
!135 = !{!136, !140, !141, !142, !143, !144, !151, !152, !153, !154, !156, !159, !160, !163, !164, !165, !166, !167, !168, !199}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !134, file: !129, line: 251, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!139 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "line_base", scope: !134, file: !129, line: 252, baseType: !137, size: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "next_line", scope: !134, file: !129, line: 253, baseType: !137, size: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !134, file: !129, line: 255, baseType: !137, size: 64, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit", scope: !134, file: !129, line: 256, baseType: !137, size: 64, offset: 256)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "notes", scope: !134, file: !129, line: 258, baseType: !145, size: 64, offset: 320)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cpp_line_note", file: !129, line: 235, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_line_note", file: !129, line: 236, size: 128, elements: !148)
!148 = !{!149, !150}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !147, file: !129, line: 239, baseType: !137, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !147, file: !129, line: 245, baseType: !7, size: 32, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "cur_note", scope: !134, file: !129, line: 259, baseType: !7, size: 32, offset: 384)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "notes_used", scope: !134, file: !129, line: 260, baseType: !7, size: 32, offset: 416)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "notes_cap", scope: !134, file: !129, line: 261, baseType: !7, size: 32, offset: 448)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !134, file: !129, line: 263, baseType: !155, size: 64, offset: 512)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !134, file: !129, line: 267, baseType: !157, size: 64, offset: 576)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_file", file: !6, line: 42, flags: DIFlagFwdDecl)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !134, file: !129, line: 271, baseType: !137, size: 64, offset: 640)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "if_stack", scope: !134, file: !129, line: 275, baseType: !161, size: 64, offset: 704)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "if_stack", file: !129, line: 275, flags: DIFlagFwdDecl)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "need_line", scope: !134, file: !129, line: 278, baseType: !139, size: 8, offset: 768)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "warned_cplusplus_comments", scope: !134, file: !129, line: 284, baseType: !7, size: 1, offset: 776, flags: DIFlagBitField, extraData: i64 776)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "from_stage3", scope: !134, file: !129, line: 289, baseType: !7, size: 1, offset: 777, flags: DIFlagBitField, extraData: i64 776)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "return_at_eof", scope: !134, file: !129, line: 294, baseType: !7, size: 1, offset: 778, flags: DIFlagBitField, extraData: i64 776)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !134, file: !129, line: 298, baseType: !139, size: 8, offset: 784)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !134, file: !129, line: 302, baseType: !169, size: 512, offset: 832)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_dir", file: !6, line: 523, size: 512, elements: !170)
!170 = !{!171, !173, !176, !177, !178, !179, !180, !184, !190, !196}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !169, file: !6, line: 526, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !169, file: !6, line: 529, baseType: !174, size: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !169, file: !6, line: 530, baseType: !7, size: 32, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !169, file: !6, line: 534, baseType: !139, size: 8, offset: 160)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "user_supplied_p", scope: !169, file: !6, line: 537, baseType: !139, size: 8, offset: 168)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "canonical_name", scope: !169, file: !6, line: 541, baseType: !174, size: 64, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "name_map", scope: !169, file: !6, line: 545, baseType: !181, size: 64, offset: 256)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !175)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "construct", scope: !169, file: !6, line: 551, baseType: !185, size: 64, offset: 320)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!174, !182, !188}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_dir", file: !6, line: 39, baseType: !169)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !169, file: !6, line: 555, baseType: !191, size: 64, offset: 384)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !192, line: 47, baseType: !193)
!192 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !194, line: 148, baseType: !195)
!194 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!195 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !169, file: !6, line: 556, baseType: !197, size: 64, offset: 448)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !192, line: 59, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !194, line: 145, baseType: !195)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "input_cset_desc", scope: !134, file: !129, line: 306, baseType: !200, size: 192, offset: 1344)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cset_converter", file: !129, line: 47, size: 192, elements: !201)
!201 = !{!202, !214, !215}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !200, file: !129, line: 49, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "convert_f", file: !129, line: 45, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!139, !207, !137, !210, !212}
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "iconv_t", file: !208, line: 29, baseType: !209)
!208 = !DIFile(filename: "/usr/include/iconv.h", directory: "")
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !211, line: 46, baseType: !195)
!211 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_strbuf", file: !129, line: 43, flags: DIFlagFwdDecl)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "cd", scope: !200, file: !129, line: 50, baseType: !207, size: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !200, file: !129, line: 51, baseType: !216, size: 32, offset: 128)
!216 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "overlaid_buffer", scope: !128, file: !129, line: 328, baseType: !132, size: 64, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !128, file: !129, line: 331, baseType: !219, size: 160, offset: 128)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lexer_state", file: !129, line: 177, size: 160, elements: !220)
!220 = !{!221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "in_directive", scope: !219, file: !129, line: 180, baseType: !139, size: 8)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "directive_wants_padding", scope: !219, file: !129, line: 185, baseType: !139, size: 8, offset: 8)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "skipping", scope: !219, file: !129, line: 188, baseType: !139, size: 8, offset: 16)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "angled_headers", scope: !219, file: !129, line: 191, baseType: !139, size: 8, offset: 24)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "in_expression", scope: !219, file: !129, line: 194, baseType: !139, size: 8, offset: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "save_comments", scope: !219, file: !129, line: 198, baseType: !139, size: 8, offset: 40)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "va_args_ok", scope: !219, file: !129, line: 201, baseType: !139, size: 8, offset: 48)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "poisoned_ok", scope: !219, file: !129, line: 204, baseType: !139, size: 8, offset: 56)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "prevent_expansion", scope: !219, file: !129, line: 207, baseType: !139, size: 8, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "parsing_args", scope: !219, file: !129, line: 210, baseType: !139, size: 8, offset: 72)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "discarding_output", scope: !219, file: !129, line: 214, baseType: !139, size: 8, offset: 80)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "skip_eval", scope: !219, file: !129, line: 217, baseType: !7, size: 32, offset: 96)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "in_deferred_pragma", scope: !219, file: !129, line: 220, baseType: !139, size: 8, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "pragma_allow_expansion", scope: !219, file: !129, line: 223, baseType: !139, size: 8, offset: 136)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "line_table", scope: !128, file: !129, line: 334, baseType: !236, size: 64, offset: 320)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line_maps", file: !238, line: 74, size: 448, elements: !239)
!238 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!239 = !{!240, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "maps", scope: !237, file: !238, line: 75, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line_map", file: !238, line: 61, size: 192, elements: !243)
!243 = !{!244, !245, !247, !249, !250, !251, !252}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "to_file", scope: !242, file: !238, line: 62, baseType: !182, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "to_line", scope: !242, file: !238, line: 63, baseType: !246, size: 32, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "linenum_type", file: !238, line: 39, baseType: !7)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "start_location", scope: !242, file: !238, line: 64, baseType: !248, size: 32, offset: 96)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !238, line: 44, baseType: !7)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "included_from", scope: !242, file: !238, line: 65, baseType: !216, size: 32, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !242, file: !238, line: 66, baseType: !7, size: 8, offset: 160, flags: DIFlagBitField, extraData: i64 160)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !242, file: !238, line: 68, baseType: !139, size: 8, offset: 168)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "column_bits", scope: !242, file: !238, line: 70, baseType: !7, size: 8, offset: 176, flags: DIFlagBitField, extraData: i64 176)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !237, file: !238, line: 76, baseType: !7, size: 32, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !237, file: !238, line: 77, baseType: !7, size: 32, offset: 96)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !237, file: !238, line: 79, baseType: !7, size: 32, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "last_listed", scope: !237, file: !238, line: 84, baseType: !216, size: 32, offset: 160)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !237, file: !238, line: 87, baseType: !7, size: 32, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "trace_includes", scope: !237, file: !238, line: 90, baseType: !139, size: 8, offset: 224)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "highest_location", scope: !237, file: !238, line: 93, baseType: !248, size: 32, offset: 256)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "highest_line", scope: !237, file: !238, line: 96, baseType: !248, size: 32, offset: 288)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "max_column_hint", scope: !237, file: !238, line: 100, baseType: !7, size: 32, offset: 320)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "reallocator", scope: !237, file: !238, line: 104, baseType: !263, size: 64, offset: 384)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "line_map_realloc", file: !238, line: 47, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!209, !209, !210}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "directive_line", scope: !128, file: !129, line: 337, baseType: !248, size: 32, offset: 384)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "a_buff", scope: !128, file: !129, line: 340, baseType: !269, size: 64, offset: 448)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cpp_buff", file: !129, line: 99, baseType: !271)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_buff", file: !129, line: 100, size: 256, elements: !272)
!272 = !{!273, !275, !277, !278}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !271, file: !129, line: 102, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !271, file: !129, line: 103, baseType: !276, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !271, file: !129, line: 103, baseType: !276, size: 64, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !271, file: !129, line: 103, baseType: !276, size: 64, offset: 192)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "u_buff", scope: !128, file: !129, line: 341, baseType: !269, size: 64, offset: 512)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "free_buffs", scope: !128, file: !129, line: 342, baseType: !269, size: 64, offset: 576)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "base_context", scope: !128, file: !129, line: 345, baseType: !282, size: 448, offset: 640)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_context", file: !129, line: 142, size: 448, elements: !283)
!283 = !{!284, !287, !288, !388, !389, !390}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !282, file: !129, line: 145, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_context", file: !129, line: 141, baseType: !282)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !282, file: !129, line: 145, baseType: !285, size: 64, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !282, file: !129, line: 164, baseType: !289, size: 128, offset: 128)
!289 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !282, file: !129, line: 147, size: 128, elements: !290)
!290 = !{!291, !383}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "iso", scope: !289, file: !129, line: 156, baseType: !292, size: 128)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !289, file: !129, line: 152, size: 128, elements: !293)
!293 = !{!294, !382}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !292, file: !129, line: 154, baseType: !295, size: 64)
!295 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "utoken", file: !129, line: 121, size: 64, elements: !296)
!296 = !{!297, !380}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !295, file: !129, line: 123, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !300)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_token", file: !6, line: 34, baseType: !301)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_token", file: !6, line: 212, size: 192, elements: !302)
!302 = !{!303, !304, !305, !307}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "src_loc", scope: !301, file: !6, line: 213, baseType: !248, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !301, file: !6, line: 214, baseType: !7, size: 8, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !301, file: !6, line: 215, baseType: !306, size: 16, offset: 48)
!306 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !301, file: !6, line: 237, baseType: !308, size: 128, offset: 64)
!308 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cpp_token_u", file: !6, line: 217, size: 128, elements: !309)
!309 = !{!310, !368, !369, !374, !378, !379}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !308, file: !6, line: 220, baseType: !311, size: 64)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_identifier", file: !6, line: 201, size: 64, elements: !312)
!312 = !{!313}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !311, file: !6, line: 207, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_hashnode", file: !6, line: 36, baseType: !316)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_hashnode", file: !6, line: 644, size: 256, elements: !317)
!317 = !{!318, !325, !326, !327, !328, !329, !330}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !316, file: !6, line: 645, baseType: !319, size: 128)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !320, line: 31, size: 128, elements: !321)
!320 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!321 = !{!322, !323, !324}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !319, file: !320, line: 32, baseType: !137, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !319, file: !320, line: 33, baseType: !7, size: 32, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !319, file: !320, line: 34, baseType: !7, size: 32, offset: 96)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "is_directive", scope: !316, file: !6, line: 646, baseType: !7, size: 1, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "directive_index", scope: !316, file: !6, line: 647, baseType: !7, size: 7, offset: 129, flags: DIFlagBitField, extraData: i64 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "rid_code", scope: !316, file: !6, line: 650, baseType: !139, size: 8, offset: 136)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !316, file: !6, line: 651, baseType: !7, size: 6, offset: 144, flags: DIFlagBitField, extraData: i64 144)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !316, file: !6, line: 652, baseType: !7, size: 10, offset: 150, flags: DIFlagBitField, extraData: i64 144)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !316, file: !6, line: 654, baseType: !331, size: 64, offset: 192)
!331 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_cpp_hashnode_value", file: !6, line: 633, size: 64, elements: !332)
!332 = !{!333, !356, !366, !367}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !331, file: !6, line: 635, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_macro", file: !6, line: 37, baseType: !336)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_macro", file: !337, line: 36, size: 256, elements: !338)
!337 = !DIFile(filename: "./cpp-id-data.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!338 = !{!339, !341, !347, !348, !349, !350, !351, !352, !353, !354, !355}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !336, file: !337, line: 42, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !336, file: !337, line: 51, baseType: !342, size: 64, offset: 64)
!342 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cpp_macro_u", file: !337, line: 47, size: 64, elements: !343)
!343 = !{!344, !346}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tokens", scope: !342, file: !337, line: 49, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !342, file: !337, line: 50, baseType: !137, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !336, file: !337, line: 54, baseType: !248, size: 32, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !336, file: !337, line: 57, baseType: !7, size: 32, offset: 160)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "paramc", scope: !336, file: !337, line: 60, baseType: !306, size: 16, offset: 192)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "fun_like", scope: !336, file: !337, line: 63, baseType: !7, size: 1, offset: 208, flags: DIFlagBitField, extraData: i64 208)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "variadic", scope: !336, file: !337, line: 66, baseType: !7, size: 1, offset: 209, flags: DIFlagBitField, extraData: i64 208)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "syshdr", scope: !336, file: !337, line: 69, baseType: !7, size: 1, offset: 210, flags: DIFlagBitField, extraData: i64 208)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !336, file: !337, line: 72, baseType: !7, size: 1, offset: 211, flags: DIFlagBitField, extraData: i64 208)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "traditional", scope: !336, file: !337, line: 75, baseType: !7, size: 1, offset: 212, flags: DIFlagBitField, extraData: i64 208)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "extra_tokens", scope: !336, file: !337, line: 80, baseType: !7, size: 1, offset: 213, flags: DIFlagBitField, extraData: i64 208)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "answers", scope: !331, file: !6, line: 637, baseType: !357, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "answer", file: !337, line: 28, size: 320, elements: !359)
!359 = !{!360, !361, !362}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !358, file: !337, line: 29, baseType: !357, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !358, file: !337, line: 30, baseType: !7, size: 32, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !358, file: !337, line: 31, baseType: !363, size: 192, offset: 128)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !300, size: 192, elements: !364)
!364 = !{!365}
!365 = !DISubrange(count: 1)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "builtin", scope: !331, file: !6, line: 639, baseType: !5, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "arg_index", scope: !331, file: !6, line: 641, baseType: !306, size: 16)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !308, file: !6, line: 223, baseType: !345, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !308, file: !6, line: 226, baseType: !370, size: 128)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_string", file: !6, line: 162, size: 128, elements: !371)
!371 = !{!372, !373}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !370, file: !6, line: 163, baseType: !7, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !370, file: !6, line: 164, baseType: !137, size: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "macro_arg", scope: !308, file: !6, line: 229, baseType: !375, size: 32)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_macro_arg", file: !6, line: 195, size: 32, elements: !376)
!376 = !{!377}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "arg_no", scope: !375, file: !6, line: 197, baseType: !7, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "token_no", scope: !308, file: !6, line: 233, baseType: !7, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "pragma", scope: !308, file: !6, line: 236, baseType: !7, size: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ptoken", scope: !295, file: !129, line: 124, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !292, file: !129, line: 155, baseType: !295, size: 64, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "trad", scope: !289, file: !129, line: 163, baseType: !384, size: 128)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !289, file: !129, line: 159, size: 128, elements: !385)
!385 = !{!386, !387}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !384, file: !129, line: 161, baseType: !137, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit", scope: !384, file: !129, line: 162, baseType: !137, size: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !282, file: !129, line: 168, baseType: !269, size: 64, offset: 256)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !282, file: !129, line: 171, baseType: !314, size: 64, offset: 320)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "direct_p", scope: !282, file: !129, line: 174, baseType: !139, size: 8, offset: 384)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !128, file: !129, line: 346, baseType: !392, size: 64, offset: 1088)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "directive", scope: !128, file: !129, line: 349, baseType: !394, size: 64, offset: 1152)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !396)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "directive", file: !129, line: 40, flags: DIFlagFwdDecl)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "directive_result", scope: !128, file: !129, line: 352, baseType: !300, size: 192, offset: 1216)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "invocation_location", scope: !128, file: !129, line: 356, baseType: !248, size: 32, offset: 1408)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "set_invocation_location", scope: !128, file: !129, line: 360, baseType: !139, size: 8, offset: 1440)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "quote_include", scope: !128, file: !129, line: 363, baseType: !172, size: 64, offset: 1472)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "bracket_include", scope: !128, file: !129, line: 364, baseType: !172, size: 64, offset: 1536)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "no_search_path", scope: !128, file: !129, line: 365, baseType: !169, size: 512, offset: 1600)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "all_files", scope: !128, file: !129, line: 368, baseType: !157, size: 64, offset: 2112)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "main_file", scope: !128, file: !129, line: 370, baseType: !157, size: 64, offset: 2176)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "file_hash", scope: !128, file: !129, line: 373, baseType: !406, size: 64, offset: 2240)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !129, line: 373, flags: DIFlagFwdDecl)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "dir_hash", scope: !128, file: !129, line: 374, baseType: !406, size: 64, offset: 2304)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "file_hash_entries", scope: !128, file: !129, line: 375, baseType: !410, size: 64, offset: 2368)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "file_hash_entry_pool", file: !129, line: 375, flags: DIFlagFwdDecl)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "nonexistent_file_hash", scope: !128, file: !129, line: 378, baseType: !406, size: 64, offset: 2432)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "nonexistent_file_ob", scope: !128, file: !129, line: 379, baseType: !414, size: 704, offset: 2496)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !415, line: 164, size: 704, elements: !416)
!415 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!416 = !{!417, !419, !429, !430, !431, !432, !433, !434, !438, !442, !443, !444, !445}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !414, file: !415, line: 166, baseType: !418, size: 64)
!418 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !414, file: !415, line: 167, baseType: !420, size: 64, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !415, line: 157, size: 192, elements: !422)
!422 = !{!423, !424, !425}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !421, file: !415, line: 159, baseType: !174, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !421, file: !415, line: 160, baseType: !420, size: 64, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !421, file: !415, line: 161, baseType: !426, size: 32, offset: 128)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 32, elements: !427)
!427 = !{!428}
!428 = !DISubrange(count: 4)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !414, file: !415, line: 168, baseType: !174, size: 64, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !414, file: !415, line: 169, baseType: !174, size: 64, offset: 192)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !414, file: !415, line: 170, baseType: !174, size: 64, offset: 256)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !414, file: !415, line: 171, baseType: !418, size: 64, offset: 320)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !414, file: !415, line: 172, baseType: !216, size: 32, offset: 384)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !414, file: !415, line: 176, baseType: !435, size: 64, offset: 448)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!420, !209, !418}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !414, file: !415, line: 177, baseType: !439, size: 64, offset: 512)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{null, !209, !420}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !414, file: !415, line: 178, baseType: !209, size: 64, offset: 576)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !414, file: !415, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !414, file: !415, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !414, file: !415, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "quote_ignores_source_dir", scope: !128, file: !129, line: 383, baseType: !139, size: 8, offset: 3200)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "seen_once_only", scope: !128, file: !129, line: 387, baseType: !139, size: 8, offset: 3208)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "mi_cmacro", scope: !128, file: !129, line: 390, baseType: !449, size: 64, offset: 3264)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !315)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "mi_ind_cmacro", scope: !128, file: !129, line: 391, baseType: !449, size: 64, offset: 3328)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "mi_valid", scope: !128, file: !129, line: 392, baseType: !139, size: 8, offset: 3392)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "cur_token", scope: !128, file: !129, line: 395, baseType: !345, size: 64, offset: 3456)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "base_run", scope: !128, file: !129, line: 396, baseType: !455, size: 256, offset: 3520)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "tokenrun", file: !129, line: 128, baseType: !456)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tokenrun", file: !129, line: 129, size: 256, elements: !457)
!457 = !{!458, !460, !461, !462}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !456, file: !129, line: 131, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !456, file: !129, line: 131, baseType: !459, size: 64, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !456, file: !129, line: 132, baseType: !345, size: 64, offset: 128)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !456, file: !129, line: 132, baseType: !345, size: 64, offset: 192)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "cur_run", scope: !128, file: !129, line: 396, baseType: !459, size: 64, offset: 3776)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "lookaheads", scope: !128, file: !129, line: 397, baseType: !7, size: 32, offset: 3840)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "keep_tokens", scope: !128, file: !129, line: 400, baseType: !7, size: 32, offset: 3872)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "macro_buffer", scope: !128, file: !129, line: 403, baseType: !276, size: 64, offset: 3904)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "macro_buffer_len", scope: !128, file: !129, line: 404, baseType: !7, size: 32, offset: 3968)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "narrow_cset_desc", scope: !128, file: !129, line: 408, baseType: !200, size: 192, offset: 4032)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_cset_desc", scope: !128, file: !129, line: 412, baseType: !200, size: 192, offset: 4224)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "char16_cset_desc", scope: !128, file: !129, line: 416, baseType: !200, size: 192, offset: 4416)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "char32_cset_desc", scope: !128, file: !129, line: 420, baseType: !200, size: 192, offset: 4608)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "wide_cset_desc", scope: !128, file: !129, line: 424, baseType: !200, size: 192, offset: 4800)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !128, file: !129, line: 427, baseType: !137, size: 64, offset: 4992)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !128, file: !129, line: 428, baseType: !137, size: 64, offset: 5056)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "avoid_paste", scope: !128, file: !129, line: 431, baseType: !300, size: 192, offset: 5120)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !128, file: !129, line: 432, baseType: !300, size: 192, offset: 5312)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "deps", scope: !128, file: !129, line: 435, baseType: !478, size: 64, offset: 5504)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "deps", file: !6, line: 685, flags: DIFlagFwdDecl)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "hash_ob", scope: !128, file: !129, line: 439, baseType: !414, size: 704, offset: 5568)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_ob", scope: !128, file: !129, line: 443, baseType: !414, size: 704, offset: 6272)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "pragmas", scope: !128, file: !129, line: 447, baseType: !483, size: 64, offset: 6976)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: "pragma_entry", file: !129, line: 447, flags: DIFlagFwdDecl)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !128, file: !129, line: 450, baseType: !486, size: 1088, offset: 7040)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_callbacks", file: !6, line: 472, size: 1088, elements: !487)
!487 = !{!488, !492, !498, !502, !506, !510, !511, !518, !522, !526, !530, !536, !540, !555, !556, !557, !561}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "line_change", scope: !486, file: !6, line: 475, baseType: !489, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DISubroutineType(types: !491)
!491 = !{null, !126, !298, !216}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "file_change", scope: !486, file: !6, line: 481, baseType: !493, size: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DISubroutineType(types: !495)
!495 = !{null, !126, !496}
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !242)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "dir_change", scope: !486, file: !6, line: 483, baseType: !499, size: 64, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DISubroutineType(types: !501)
!501 = !{null, !126, !182}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "include", scope: !486, file: !6, line: 484, baseType: !503, size: 64, offset: 192)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{null, !126, !7, !137, !182, !216, !381}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "define", scope: !486, file: !6, line: 486, baseType: !507, size: 64, offset: 256)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DISubroutineType(types: !509)
!509 = !{null, !126, !7, !314}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "undef", scope: !486, file: !6, line: 487, baseType: !507, size: 64, offset: 320)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !486, file: !6, line: 488, baseType: !512, size: 64, offset: 384)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{null, !126, !7, !515}
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !517)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_string", file: !6, line: 35, baseType: !370)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "def_pragma", scope: !486, file: !6, line: 489, baseType: !519, size: 64, offset: 448)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DISubroutineType(types: !521)
!521 = !{null, !126, !7}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "valid_pch", scope: !486, file: !6, line: 490, baseType: !523, size: 64, offset: 512)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{!216, !126, !182, !216}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "read_pch", scope: !486, file: !6, line: 491, baseType: !527, size: 64, offset: 576)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{null, !126, !182, !216, !182}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "missing_header", scope: !486, file: !6, line: 492, baseType: !531, size: 64, offset: 640)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "missing_header_cb", file: !6, line: 469, baseType: !532)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{!182, !126, !182, !535}
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "macro_to_expand", scope: !486, file: !6, line: 496, baseType: !537, size: 64, offset: 704)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DISubroutineType(types: !539)
!539 = !{!314, !126, !298}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !486, file: !6, line: 500, baseType: !541, size: 64, offset: 768)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{!139, !126, !216, !248, !7, !182, !544}
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !546, line: 14, baseType: !547)
!546 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stdarg.h", directory: "")
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 216, baseType: !548)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !549, size: 192, elements: !364)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 216, size: 192, elements: !550)
!550 = !{!551, !552, !553, !554}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !549, file: !3, line: 216, baseType: !7, size: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !549, file: !3, line: 216, baseType: !7, size: 32, offset: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !549, file: !3, line: 216, baseType: !209, size: 64, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !549, file: !3, line: 216, baseType: !209, size: 64, offset: 128)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "used_define", scope: !486, file: !6, line: 506, baseType: !507, size: 64, offset: 832)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "used_undef", scope: !486, file: !6, line: 507, baseType: !507, size: 64, offset: 896)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "before_define", scope: !486, file: !6, line: 510, baseType: !558, size: 64, offset: 960)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DISubroutineType(types: !560)
!560 = !{null, !126}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !486, file: !6, line: 513, baseType: !562, size: 64, offset: 1024)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{null, !126, !248, !314}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "hash_table", scope: !128, file: !129, line: 453, baseType: !566, size: 64, offset: 8128)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht", file: !320, line: 46, size: 1152, elements: !568)
!568 = !{!569, !570, !574, !580, !584, !585, !586, !588, !589, !590}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !567, file: !320, line: 49, baseType: !414, size: 704)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !567, file: !320, line: 51, baseType: !571, size: 64, offset: 704)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashnode", file: !320, line: 41, baseType: !573)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_node", scope: !567, file: !320, line: 53, baseType: !575, size: 64, offset: 768)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DISubroutineType(types: !577)
!577 = !{!572, !578}
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_table", file: !320, line: 40, baseType: !567)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_subobject", scope: !567, file: !320, line: 56, baseType: !581, size: 64, offset: 832)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DISubroutineType(types: !583)
!583 = !{!209, !210}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "nslots", scope: !567, file: !320, line: 58, baseType: !7, size: 32, offset: 896)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "nelements", scope: !567, file: !320, line: 59, baseType: !7, size: 32, offset: 928)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "pfile", scope: !567, file: !320, line: 62, baseType: !587, size: 64, offset: 960)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !567, file: !320, line: 65, baseType: !7, size: 32, offset: 1024)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !567, file: !320, line: 66, baseType: !7, size: 32, offset: 1056)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "entries_owned", scope: !567, file: !320, line: 69, baseType: !139, size: 8, offset: 1088)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "op_stack", scope: !128, file: !129, line: 456, baseType: !592, size: 64, offset: 8192)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "op", file: !3, line: 31, size: 320, elements: !594)
!594 = !{!595, !596, !606, !607}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !593, file: !3, line: 33, baseType: !298, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !593, file: !3, line: 34, baseType: !597, size: 192, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_num", file: !6, line: 771, baseType: !598)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_num", file: !6, line: 772, size: 192, elements: !599)
!599 = !{!600, !603, !604, !605}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !598, file: !6, line: 774, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_num_part", file: !6, line: 770, baseType: !602)
!602 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !598, file: !6, line: 775, baseType: !601, size: 64, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "unsignedp", scope: !598, file: !6, line: 776, baseType: !139, size: 8, offset: 128)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "overflow", scope: !598, file: !6, line: 777, baseType: !139, size: 8, offset: 136)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !593, file: !3, line: 35, baseType: !248, size: 32, offset: 256)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !593, file: !3, line: 36, baseType: !19, size: 32, offset: 288)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "op_limit", scope: !128, file: !129, line: 456, baseType: !592, size: 64, offset: 8256)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !128, file: !129, line: 459, baseType: !610, size: 1024, offset: 8320)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_options", file: !6, line: 279, size: 1024, elements: !611)
!611 = !{!612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !663, !664, !665, !666, !667, !668, !669, !670, !671}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "tabstop", scope: !610, file: !6, line: 282, baseType: !7, size: 32)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "lang", scope: !610, file: !6, line: 285, baseType: !99, size: 32, offset: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "cplusplus", scope: !610, file: !6, line: 288, baseType: !139, size: 8, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "cplusplus_comments", scope: !610, file: !6, line: 291, baseType: !139, size: 8, offset: 72)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "objc", scope: !610, file: !6, line: 296, baseType: !139, size: 8, offset: 80)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "discard_comments", scope: !610, file: !6, line: 299, baseType: !139, size: 8, offset: 88)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "discard_comments_in_macro_exp", scope: !610, file: !6, line: 303, baseType: !139, size: 8, offset: 96)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "trigraphs", scope: !610, file: !6, line: 306, baseType: !139, size: 8, offset: 104)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "digraphs", scope: !610, file: !6, line: 309, baseType: !139, size: 8, offset: 112)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "extended_numbers", scope: !610, file: !6, line: 312, baseType: !139, size: 8, offset: 120)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "uliterals", scope: !610, file: !6, line: 315, baseType: !139, size: 8, offset: 128)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "print_include_names", scope: !610, file: !6, line: 318, baseType: !139, size: 8, offset: 136)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "warn_deprecated", scope: !610, file: !6, line: 321, baseType: !139, size: 8, offset: 144)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "warn_comments", scope: !610, file: !6, line: 324, baseType: !139, size: 8, offset: 152)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "warn_missing_include_dirs", scope: !610, file: !6, line: 328, baseType: !139, size: 8, offset: 160)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "warn_trigraphs", scope: !610, file: !6, line: 331, baseType: !139, size: 8, offset: 168)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "warn_multichar", scope: !610, file: !6, line: 334, baseType: !139, size: 8, offset: 176)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "warn_traditional", scope: !610, file: !6, line: 338, baseType: !139, size: 8, offset: 184)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "warn_long_long", scope: !610, file: !6, line: 341, baseType: !139, size: 8, offset: 192)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "warn_endif_labels", scope: !610, file: !6, line: 344, baseType: !139, size: 8, offset: 200)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "warn_num_sign_change", scope: !610, file: !6, line: 348, baseType: !139, size: 8, offset: 208)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "warn_variadic_macros", scope: !610, file: !6, line: 352, baseType: !139, size: 8, offset: 216)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "warn_builtin_macro_redefined", scope: !610, file: !6, line: 356, baseType: !139, size: 8, offset: 224)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !610, file: !6, line: 360, baseType: !139, size: 8, offset: 232)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "dollars_in_ident", scope: !610, file: !6, line: 363, baseType: !139, size: 8, offset: 240)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "extended_identifiers", scope: !610, file: !6, line: 366, baseType: !139, size: 8, offset: 248)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "warn_dollars", scope: !610, file: !6, line: 370, baseType: !139, size: 8, offset: 256)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "warn_undef", scope: !610, file: !6, line: 373, baseType: !139, size: 8, offset: 264)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "warn_unused_macros", scope: !610, file: !6, line: 376, baseType: !139, size: 8, offset: 272)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "c99", scope: !610, file: !6, line: 379, baseType: !139, size: 8, offset: 280)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "std", scope: !610, file: !6, line: 382, baseType: !139, size: 8, offset: 288)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "pedantic", scope: !610, file: !6, line: 385, baseType: !139, size: 8, offset: 296)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "preprocessed", scope: !610, file: !6, line: 389, baseType: !139, size: 8, offset: 304)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "show_column", scope: !610, file: !6, line: 392, baseType: !139, size: 8, offset: 312)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "operator_names", scope: !610, file: !6, line: 395, baseType: !139, size: 8, offset: 320)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "warn_cxx_operator_names", scope: !610, file: !6, line: 398, baseType: !139, size: 8, offset: 328)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "traditional", scope: !610, file: !6, line: 401, baseType: !139, size: 8, offset: 336)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "narrow_charset", scope: !610, file: !6, line: 404, baseType: !182, size: 64, offset: 384)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "wide_charset", scope: !610, file: !6, line: 407, baseType: !182, size: 64, offset: 448)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "input_charset", scope: !610, file: !6, line: 410, baseType: !182, size: 64, offset: 512)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "warn_normalize", scope: !610, file: !6, line: 414, baseType: !111, size: 32, offset: 576)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "warn_invalid_pch", scope: !610, file: !6, line: 417, baseType: !139, size: 8, offset: 608)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "restore_pch_deps", scope: !610, file: !6, line: 420, baseType: !139, size: 8, offset: 616)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "deps", scope: !610, file: !6, line: 441, baseType: !656, size: 64, offset: 640)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !610, file: !6, line: 423, size: 64, elements: !657)
!657 = !{!658, !659, !660, !661, !662}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !656, file: !6, line: 426, baseType: !117, size: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "missing_files", scope: !656, file: !6, line: 429, baseType: !139, size: 8, offset: 32)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "phony_targets", scope: !656, file: !6, line: 433, baseType: !139, size: 8, offset: 40)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_main_file", scope: !656, file: !6, line: 436, baseType: !139, size: 8, offset: 48)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "need_preprocessor_output", scope: !656, file: !6, line: 440, baseType: !139, size: 8, offset: 56)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !610, file: !6, line: 447, baseType: !210, size: 64, offset: 704)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "char_precision", scope: !610, file: !6, line: 447, baseType: !210, size: 64, offset: 768)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "int_precision", scope: !610, file: !6, line: 447, baseType: !210, size: 64, offset: 832)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "wchar_precision", scope: !610, file: !6, line: 447, baseType: !210, size: 64, offset: 896)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_char", scope: !610, file: !6, line: 450, baseType: !139, size: 8, offset: 960)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_wchar", scope: !610, file: !6, line: 450, baseType: !139, size: 8, offset: 968)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_big_endian", scope: !610, file: !6, line: 454, baseType: !139, size: 8, offset: 976)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "stdc_0_in_system_headers", scope: !610, file: !6, line: 457, baseType: !139, size: 8, offset: 984)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "directives_only", scope: !610, file: !6, line: 460, baseType: !139, size: 8, offset: 992)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "spec_nodes", scope: !128, file: !129, line: 463, baseType: !673, size: 256, offset: 9344)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spec_nodes", file: !129, line: 227, size: 256, elements: !674)
!674 = !{!675, !676, !677, !678}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "n_defined", scope: !673, file: !129, line: 229, baseType: !314, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "n_true", scope: !673, file: !129, line: 230, baseType: !314, size: 64, offset: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "n_false", scope: !673, file: !129, line: 231, baseType: !314, size: 64, offset: 128)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "n__VA_ARGS__", scope: !673, file: !129, line: 232, baseType: !314, size: 64, offset: 192)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "our_hashtable", scope: !128, file: !129, line: 466, baseType: !139, size: 8, offset: 9600)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !128, file: !129, line: 475, baseType: !681, size: 256, offset: 9664)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !128, file: !129, line: 469, size: 256, elements: !682)
!682 = !{!683, !684, !685, !686}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !681, file: !129, line: 471, baseType: !276, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !681, file: !129, line: 472, baseType: !276, size: 64, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !681, file: !129, line: 473, baseType: !276, size: 64, offset: 128)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "first_line", scope: !681, file: !129, line: 474, baseType: !248, size: 32, offset: 192)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "saved_cur", scope: !128, file: !129, line: 478, baseType: !137, size: 64, offset: 9920)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "saved_rlimit", scope: !128, file: !129, line: 478, baseType: !137, size: 64, offset: 9984)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "saved_line_base", scope: !128, file: !129, line: 478, baseType: !137, size: 64, offset: 10048)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "savedstate", scope: !128, file: !129, line: 482, baseType: !691, size: 64, offset: 10112)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_savedstate", file: !129, line: 482, flags: DIFlagFwdDecl)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !128, file: !129, line: 485, baseType: !7, size: 32, offset: 10176)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "comments", scope: !128, file: !129, line: 488, baseType: !695, size: 128, offset: 10240)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_comment_table", file: !6, line: 901, baseType: !696)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 891, size: 128, elements: !697)
!697 = !{!698, !705, !706}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !696, file: !6, line: 894, baseType: !699, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_comment", file: !6, line: 887, baseType: !701)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 880, size: 128, elements: !702)
!702 = !{!703, !704}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !701, file: !6, line: 883, baseType: !174, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "sloc", scope: !701, file: !6, line: 886, baseType: !248, size: 32, offset: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !696, file: !6, line: 897, baseType: !216, size: 32, offset: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !696, file: !6, line: 900, baseType: !216, size: 32, offset: 96)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "pushed_macros", scope: !128, file: !129, line: 491, baseType: !708, size: 64, offset: 10368)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_pragma_macro", file: !129, line: 310, size: 192, elements: !710)
!710 = !{!711, !712, !713}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !709, file: !129, line: 312, baseType: !708, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !709, file: !129, line: 314, baseType: !174, size: 64, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !709, file: !129, line: 316, baseType: !334, size: 64, offset: 128)
!714 = !{!715, !716, !717, !721, !722, !723, !724, !725, !726, !727, !731, !736, !737, !738}
!715 = !DILocalVariable(name: "pfile", arg: 1, scope: !123, file: !3, line: 227, type: !126)
!716 = !DILocalVariable(name: "token", arg: 2, scope: !123, file: !3, line: 227, type: !298)
!717 = !DILocalVariable(name: "str", scope: !123, file: !3, line: 229, type: !718)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !720)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !337, line: 22, baseType: !139)
!721 = !DILocalVariable(name: "limit", scope: !123, file: !3, line: 230, type: !718)
!722 = !DILocalVariable(name: "max_digit", scope: !123, file: !3, line: 231, type: !7)
!723 = !DILocalVariable(name: "result", scope: !123, file: !3, line: 231, type: !7)
!724 = !DILocalVariable(name: "radix", scope: !123, file: !3, line: 231, type: !7)
!725 = !DILocalVariable(name: "float_flag", scope: !123, file: !3, line: 232, type: !122)
!726 = !DILocalVariable(name: "seen_digit", scope: !123, file: !3, line: 233, type: !139)
!727 = !DILocalVariable(name: "c", scope: !728, file: !3, line: 269, type: !7)
!728 = distinct !DILexicalBlock(scope: !729, file: !3, line: 268, column: 5)
!729 = distinct !DILexicalBlock(scope: !730, file: !3, line: 267, column: 3)
!730 = distinct !DILexicalBlock(scope: !123, file: !3, line: 267, column: 3)
!731 = !DILocalVariable(name: "u_or_i", scope: !732, file: !3, line: 420, type: !216)
!732 = distinct !DILexicalBlock(scope: !733, file: !3, line: 419, column: 2)
!733 = distinct !DILexicalBlock(scope: !734, file: !3, line: 418, column: 11)
!734 = distinct !DILexicalBlock(scope: !735, file: !3, line: 406, column: 5)
!735 = distinct !DILexicalBlock(scope: !123, file: !3, line: 330, column: 7)
!736 = !DILocalVariable(name: "large", scope: !732, file: !3, line: 421, type: !216)
!737 = !DILabel(scope: !123, name: "syntax_ok", file: !3, line: 440)
!738 = !DILabel(scope: !123, name: "syntax_error", file: !3, line: 459)
!739 = !{!740, !741, !742}
!740 = !DIEnumerator(name: "NOT_FLOAT", value: 0, isUnsigned: true)
!741 = !DIEnumerator(name: "AFTER_POINT", value: 1, isUnsigned: true)
!742 = !DIEnumerator(name: "AFTER_EXPON", value: 2, isUnsigned: true)
!743 = !{!306, !7, !139, !216, !601, !19, !210, !592, !209, !744}
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "cppchar_signed_t", file: !6, line: 259, baseType: !216)
!745 = !{!0}
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !747, size: 464, elements: !752)
!747 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !748)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_operator", file: !3, line: 856, size: 16, elements: !749)
!749 = !{!750, !751}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !748, file: !3, line: 858, baseType: !720, size: 8)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !748, file: !3, line: 859, baseType: !720, size: 8, offset: 8)
!752 = !{!753}
!753 = !DISubrange(count: 29)
!754 = !{i32 2, !"Dwarf Version", i32 4}
!755 = !{i32 2, !"Debug Info Version", i32 3}
!756 = !{i32 1, !"wchar_size", i32 4}
!757 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!758 = distinct !DISubprogram(name: "tolower", scope: !759, file: !759, line: 207, type: !760, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !762)
!759 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!760 = !DISubroutineType(types: !761)
!761 = !{!216, !216}
!762 = !{!763}
!763 = !DILocalVariable(name: "__c", arg: 1, scope: !758, file: !759, line: 207, type: !216)
!764 = !DILocation(line: 0, scope: !758)
!765 = !DILocation(line: 209, column: 22, scope: !758)
!766 = !DILocation(line: 209, column: 39, scope: !758)
!767 = !DILocation(line: 209, column: 38, scope: !758)
!768 = !DILocation(line: 209, column: 37, scope: !758)
!769 = !DILocation(line: 209, column: 10, scope: !758)
!770 = !DILocation(line: 209, column: 3, scope: !758)
!771 = distinct !DISubprogram(name: "toupper", scope: !759, file: !759, line: 213, type: !760, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !772)
!772 = !{!773}
!773 = !DILocalVariable(name: "__c", arg: 1, scope: !771, file: !759, line: 213, type: !216)
!774 = !DILocation(line: 0, scope: !771)
!775 = !DILocation(line: 215, column: 22, scope: !771)
!776 = !DILocation(line: 215, column: 39, scope: !771)
!777 = !DILocation(line: 215, column: 38, scope: !771)
!778 = !DILocation(line: 215, column: 37, scope: !771)
!779 = !DILocation(line: 215, column: 10, scope: !771)
!780 = !DILocation(line: 215, column: 3, scope: !771)
!781 = !DILocation(line: 0, scope: !123)
!782 = !DILocation(line: 229, column: 37, scope: !123)
!783 = !DILocation(line: 237, column: 22, scope: !784)
!784 = distinct !DILexicalBlock(scope: !123, file: !3, line: 237, column: 7)
!785 = !DILocation(line: 237, column: 26, scope: !784)
!786 = !DILocation(line: 237, column: 7, scope: !123)
!787 = !DILocation(line: 240, column: 15, scope: !123)
!788 = !DILocation(line: 247, column: 7, scope: !789)
!789 = distinct !DILexicalBlock(scope: !123, file: !3, line: 247, column: 7)
!790 = !DILocation(line: 247, column: 12, scope: !789)
!791 = !DILocation(line: 247, column: 7, scope: !123)
!792 = !DILocation(line: 250, column: 10, scope: !793)
!793 = distinct !DILexicalBlock(scope: !789, file: !3, line: 248, column: 5)
!794 = !DILocation(line: 253, column: 12, scope: !795)
!795 = distinct !DILexicalBlock(scope: !793, file: !3, line: 253, column: 11)
!796 = !DILocation(line: 253, column: 17, scope: !795)
!797 = !DILocation(line: 253, column: 24, scope: !795)
!798 = !DILocation(line: 253, column: 32, scope: !795)
!799 = !DILocation(line: 254, column: 4, scope: !795)
!800 = !DILocation(line: 254, column: 8, scope: !795)
!801 = !DILocation(line: 254, column: 15, scope: !795)
!802 = !DILocation(line: 254, column: 22, scope: !795)
!803 = !DILocation(line: 254, column: 25, scope: !795)
!804 = !DILocation(line: 253, column: 11, scope: !793)
!805 = !DILocation(line: 258, column: 2, scope: !806)
!806 = distinct !DILexicalBlock(scope: !795, file: !3, line: 255, column: 2)
!807 = !DILocation(line: 259, column: 22, scope: !808)
!808 = distinct !DILexicalBlock(scope: !795, file: !3, line: 259, column: 16)
!809 = !DILocation(line: 259, column: 29, scope: !808)
!810 = !DILocation(line: 259, column: 37, scope: !808)
!811 = !DILocation(line: 259, column: 45, scope: !808)
!812 = !DILocation(line: 259, column: 49, scope: !808)
!813 = !DILocation(line: 259, column: 56, scope: !808)
!814 = !DILocation(line: 259, column: 63, scope: !808)
!815 = !DILocation(line: 259, column: 73, scope: !808)
!816 = !DILocation(line: 259, column: 16, scope: !795)
