; ModuleID = 'cpp_init.bc'
source_filename = "cpp_init.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lang_flags = type { i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.builtin_operator = type { i8*, i16, i16 }
%struct.builtin_macro = type { i8*, i16, i16, i8 }
%struct.cpp_reader = type { %struct.cpp_buffer*, %struct.cpp_buffer*, %struct.lexer_state, %struct.line_maps*, i32, %struct._cpp_buff*, %struct._cpp_buff*, %struct._cpp_buff*, %struct.cpp_context, %struct.cpp_context*, %struct.directive*, %struct.cpp_token, i32, i8, %struct.cpp_dir*, %struct.cpp_dir*, %struct.cpp_dir, %struct._cpp_file*, %struct._cpp_file*, %struct.htab*, %struct.htab*, %struct.file_hash_entry_pool*, %struct.htab*, %struct.obstack, i8, i8, %struct.cpp_hashnode*, %struct.cpp_hashnode*, i8, %struct.cpp_token*, %struct.tokenrun, %struct.tokenrun*, i32, i32, i8*, i32, %struct.cset_converter, %struct.cset_converter, %struct.cset_converter, %struct.cset_converter, %struct.cset_converter, i8*, i8*, %struct.cpp_token, %struct.cpp_token, %struct.deps*, %struct.obstack, %struct.obstack, %struct.pragma_entry*, %struct.cpp_callbacks, %struct.ht*, %struct.op*, %struct.op*, %struct.cpp_options, %struct.spec_nodes, i8, %struct.anon.2, i8*, i8*, i8*, %struct.cpp_savedstate*, i32, %struct.cpp_comment_table, %struct.def_pragma_macro* }

!63 = !DIEnumerator(name: "CPP_COMMA", value: 19, isUnsigned: true)
!64 = !DIEnumerator(name: "CPP_OPEN_PAREN", value: 20, isUnsigned: true)
!65 = !DIEnumerator(name: "CPP_CLOSE_PAREN", value: 21, isUnsigned: true)
!66 = !DIEnumerator(name: "CPP_EOF", value: 22, isUnsigned: true)
!67 = !DIEnumerator(name: "CPP_EQ_EQ", value: 23, isUnsigned: true)
!68 = !DIEnumerator(name: "CPP_NOT_EQ", value: 24, isUnsigned: true)
!69 = !DIEnumerator(name: "CPP_GREATER_EQ", value: 25, isUnsigned: true)
!70 = !DIEnumerator(name: "CPP_LESS_EQ", value: 26, isUnsigned: true)
!71 = !DIEnumerator(name: "CPP_PLUS_EQ", value: 27, isUnsigned: true)
!72 = !DIEnumerator(name: "CPP_MINUS_EQ", value: 28, isUnsigned: true)
!73 = !DIEnumerator(name: "CPP_MULT_EQ", value: 29, isUnsigned: true)
!74 = !DIEnumerator(name: "CPP_DIV_EQ", value: 30, isUnsigned: true)
!75 = !DIEnumerator(name: "CPP_MOD_EQ", value: 31, isUnsigned: true)
!76 = !DIEnumerator(name: "CPP_AND_EQ", value: 32, isUnsigned: true)
!77 = !DIEnumerator(name: "CPP_OR_EQ", value: 33, isUnsigned: true)
!78 = !DIEnumerator(name: "CPP_XOR_EQ", value: 34, isUnsigned: true)
!79 = !DIEnumerator(name: "CPP_RSHIFT_EQ", value: 35, isUnsigned: true)
!80 = !DIEnumerator(name: "CPP_LSHIFT_EQ", value: 36, isUnsigned: true)
!81 = !DIEnumerator(name: "CPP_HASH", value: 37, isUnsigned: true)
!82 = !DIEnumerator(name: "CPP_PASTE", value: 38, isUnsigned: true)
!83 = !DIEnumerator(name: "CPP_OPEN_SQUARE", value: 39, isUnsigned: true)
!84 = !DIEnumerator(name: "CPP_CLOSE_SQUARE", value: 40, isUnsigned: true)
!85 = !DIEnumerator(name: "CPP_OPEN_BRACE", value: 41, isUnsigned: true)
!86 = !DIEnumerator(name: "CPP_CLOSE_BRACE", value: 42, isUnsigned: true)
!87 = !DIEnumerator(name: "CPP_SEMICOLON", value: 43, isUnsigned: true)
!88 = !DIEnumerator(name: "CPP_ELLIPSIS", value: 44, isUnsigned: true)
!89 = !DIEnumerator(name: "CPP_PLUS_PLUS", value: 45, isUnsigned: true)
!90 = !DIEnumerator(name: "CPP_MINUS_MINUS", value: 46, isUnsigned: true)
!91 = !DIEnumerator(name: "CPP_DEREF", value: 47, isUnsigned: true)
!92 = !DIEnumerator(name: "CPP_DOT", value: 48, isUnsigned: true)
!93 = !DIEnumerator(name: "CPP_SCOPE", value: 49, isUnsigned: true)
!94 = !DIEnumerator(name: "CPP_DEREF_STAR", value: 50, isUnsigned: true)
!95 = !DIEnumerator(name: "CPP_DOT_STAR", value: 51, isUnsigned: true)
!96 = !DIEnumerator(name: "CPP_ATSIGN", value: 52, isUnsigned: true)
!97 = !DIEnumerator(name: "CPP_NAME", value: 53, isUnsigned: true)
!98 = !DIEnumerator(name: "CPP_AT_NAME", value: 54, isUnsigned: true)
!99 = !DIEnumerator(name: "CPP_NUMBER", value: 55, isUnsigned: true)
!100 = !DIEnumerator(name: "CPP_CHAR", value: 56, isUnsigned: true)
!101 = !DIEnumerator(name: "CPP_WCHAR", value: 57, isUnsigned: true)
!102 = !DIEnumerator(name: "CPP_CHAR16", value: 58, isUnsigned: true)
!103 = !DIEnumerator(name: "CPP_CHAR32", value: 59, isUnsigned: true)
!104 = !DIEnumerator(name: "CPP_OTHER", value: 60, isUnsigned: true)
!105 = !DIEnumerator(name: "CPP_STRING", value: 61, isUnsigned: true)
!106 = !DIEnumerator(name: "CPP_WSTRING", value: 62, isUnsigned: true)
!107 = !DIEnumerator(name: "CPP_STRING16", value: 63, isUnsigned: true)
!108 = !DIEnumerator(name: "CPP_STRING32", value: 64, isUnsigned: true)
!109 = !DIEnumerator(name: "CPP_UTF8STRING", value: 65, isUnsigned: true)
!110 = !DIEnumerator(name: "CPP_OBJC_STRING", value: 66, isUnsigned: true)
!111 = !DIEnumerator(name: "CPP_HEADER_NAME", value: 67, isUnsigned: true)
!112 = !DIEnumerator(name: "CPP_COMMENT", value: 68, isUnsigned: true)
!113 = !DIEnumerator(name: "CPP_MACRO_ARG", value: 69, isUnsigned: true)
!114 = !DIEnumerator(name: "CPP_PRAGMA", value: 70, isUnsigned: true)
!115 = !DIEnumerator(name: "CPP_PRAGMA_EOL", value: 71, isUnsigned: true)
!116 = !DIEnumerator(name: "CPP_PADDING", value: 72, isUnsigned: true)
!117 = !DIEnumerator(name: "N_TTYPES", value: 73, isUnsigned: true)
!118 = !DIEnumerator(name: "CPP_LAST_EQ", value: 13, isUnsigned: true)
!119 = !DIEnumerator(name: "CPP_FIRST_DIGRAPH", value: 37, isUnsigned: true)
!120 = !DIEnumerator(name: "CPP_LAST_PUNCTUATOR", value: 52, isUnsigned: true)
!121 = !DIEnumerator(name: "CPP_LAST_CPP_OP", value: 26, isUnsigned: true)
!122 = !{!123, !124, !172, !697, !700, !207, !703, !180, !5}
!123 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_reader", file: !6, line: 31, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_reader", file: !127, line: 322, size: 10432, elements: !128)
!127 = !DIFile(filename: "./internal.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!128 = !{!129, !214, !215, !232, !264, !265, !276, !277, !278, !388, !390, !394, !395, !396, !397, !398, !399, !400, !401, !402, !405, !406, !409, !410, !443, !444, !445, !448, !449, !450, !451, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !477, !478, !479, !482, !562, !588, !591, !592, !655, !662, !663, !670, !671, !672, !673, !676, !677, !690}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !126, file: !127, line: 325, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_buffer", file: !6, line: 32, baseType: !132)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_buffer", file: !127, line: 249, size: 1536, elements: !133)
!133 = !{!134, !138, !139, !140, !141, !142, !149, !150, !151, !152, !154, !157, !158, !161, !162, !163, !164, !165, !166, !197}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !132, file: !127, line: 251, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !137)
!137 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "line_base", scope: !132, file: !127, line: 252, baseType: !135, size: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "next_line", scope: !132, file: !127, line: 253, baseType: !135, size: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !132, file: !127, line: 255, baseType: !135, size: 64, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit", scope: !132, file: !127, line: 256, baseType: !135, size: 64, offset: 256)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "notes", scope: !132, file: !127, line: 258, baseType: !143, size: 64, offset: 320)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cpp_line_note", file: !127, line: 235, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_line_note", file: !127, line: 236, size: 128, elements: !146)
!146 = !{!147, !148}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !145, file: !127, line: 239, baseType: !135, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !145, file: !127, line: 245, baseType: !7, size: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "cur_note", scope: !132, file: !127, line: 259, baseType: !7, size: 32, offset: 384)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "notes_used", scope: !132, file: !127, line: 260, baseType: !7, size: 32, offset: 416)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "notes_cap", scope: !132, file: !127, line: 261, baseType: !7, size: 32, offset: 448)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !132, file: !127, line: 263, baseType: !153, size: 64, offset: 512)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !132, file: !127, line: 267, baseType: !155, size: 64, offset: 576)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_file", file: !6, line: 42, flags: DIFlagFwdDecl)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !132, file: !127, line: 271, baseType: !135, size: 64, offset: 640)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "if_stack", scope: !132, file: !127, line: 275, baseType: !159, size: 64, offset: 704)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "if_stack", file: !127, line: 275, flags: DIFlagFwdDecl)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "need_line", scope: !132, file: !127, line: 278, baseType: !137, size: 8, offset: 768)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "warned_cplusplus_comments", scope: !132, file: !127, line: 284, baseType: !7, size: 1, offset: 776, flags: DIFlagBitField, extraData: i64 776)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "from_stage3", scope: !132, file: !127, line: 289, baseType: !7, size: 1, offset: 777, flags: DIFlagBitField, extraData: i64 776)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "return_at_eof", scope: !132, file: !127, line: 294, baseType: !7, size: 1, offset: 778, flags: DIFlagBitField, extraData: i64 776)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !132, file: !127, line: 298, baseType: !137, size: 8, offset: 784)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !132, file: !127, line: 302, baseType: !167, size: 512, offset: 832)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_dir", file: !6, line: 523, size: 512, elements: !168)
!168 = !{!169, !171, !174, !175, !176, !177, !178, !182, !188, !194}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !167, file: !6, line: 526, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !167, file: !6, line: 529, baseType: !172, size: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !167, file: !6, line: 530, baseType: !7, size: 32, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !167, file: !6, line: 534, baseType: !137, size: 8, offset: 160)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "user_supplied_p", scope: !167, file: !6, line: 537, baseType: !137, size: 8, offset: 168)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "canonical_name", scope: !167, file: !6, line: 541, baseType: !172, size: 64, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "name_map", scope: !167, file: !6, line: 545, baseType: !179, size: 64, offset: 256)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "construct", scope: !167, file: !6, line: 551, baseType: !183, size: 64, offset: 320)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!172, !180, !186}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_dir", file: !6, line: 39, baseType: !167)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !167, file: !6, line: 555, baseType: !189, size: 64, offset: 384)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !190, line: 47, baseType: !191)
!190 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !192, line: 148, baseType: !193)
!192 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!193 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !167, file: !6, line: 556, baseType: !195, size: 64, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !190, line: 59, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !192, line: 145, baseType: !193)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "input_cset_desc", scope: !132, file: !127, line: 306, baseType: !198, size: 192, offset: 1344)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cset_converter", file: !127, line: 47, size: 192, elements: !199)
!199 = !{!200, !212, !213}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !198, file: !127, line: 49, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "convert_f", file: !127, line: 45, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!137, !205, !135, !208, !210}
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "iconv_t", file: !206, line: 29, baseType: !207)
!206 = !DIFile(filename: "/usr/include/iconv.h", directory: "")
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !209, line: 46, baseType: !193)
!209 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_strbuf", file: !127, line: 43, flags: DIFlagFwdDecl)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "cd", scope: !198, file: !127, line: 50, baseType: !205, size: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !198, file: !127, line: 51, baseType: !123, size: 32, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "overlaid_buffer", scope: !126, file: !127, line: 328, baseType: !130, size: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !126, file: !127, line: 331, baseType: !216, size: 160, offset: 128)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lexer_state", file: !127, line: 177, size: 160, elements: !217)
!217 = !{!218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "in_directive", scope: !216, file: !127, line: 180, baseType: !137, size: 8)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "directive_wants_padding", scope: !216, file: !127, line: 185, baseType: !137, size: 8, offset: 8)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "skipping", scope: !216, file: !127, line: 188, baseType: !137, size: 8, offset: 16)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "angled_headers", scope: !216, file: !127, line: 191, baseType: !137, size: 8, offset: 24)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "in_expression", scope: !216, file: !127, line: 194, baseType: !137, size: 8, offset: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "save_comments", scope: !216, file: !127, line: 198, baseType: !137, size: 8, offset: 40)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "va_args_ok", scope: !216, file: !127, line: 201, baseType: !137, size: 8, offset: 48)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "poisoned_ok", scope: !216, file: !127, line: 204, baseType: !137, size: 8, offset: 56)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "prevent_expansion", scope: !216, file: !127, line: 207, baseType: !137, size: 8, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "parsing_args", scope: !216, file: !127, line: 210, baseType: !137, size: 8, offset: 72)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "discarding_output", scope: !216, file: !127, line: 214, baseType: !137, size: 8, offset: 80)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "skip_eval", scope: !216, file: !127, line: 217, baseType: !7, size: 32, offset: 96)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "in_deferred_pragma", scope: !216, file: !127, line: 220, baseType: !137, size: 8, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "pragma_allow_expansion", scope: !216, file: !127, line: 223, baseType: !137, size: 8, offset: 136)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "line_table", scope: !126, file: !127, line: 334, baseType: !233, size: 64, offset: 320)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line_maps", file: !235, line: 74, size: 448, elements: !236)
!235 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!236 = !{!237, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "maps", scope: !234, file: !235, line: 75, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line_map", file: !235, line: 61, size: 192, elements: !240)
!240 = !{!241, !242, !244, !246, !247, !248, !249}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "to_file", scope: !239, file: !235, line: 62, baseType: !180, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "to_line", scope: !239, file: !235, line: 63, baseType: !243, size: 32, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "linenum_type", file: !235, line: 39, baseType: !7)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "start_location", scope: !239, file: !235, line: 64, baseType: !245, size: 32, offset: 96)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !235, line: 44, baseType: !7)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "included_from", scope: !239, file: !235, line: 65, baseType: !123, size: 32, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !239, file: !235, line: 66, baseType: !7, size: 8, offset: 160, flags: DIFlagBitField, extraData: i64 160)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !239, file: !235, line: 68, baseType: !137, size: 8, offset: 168)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "column_bits", scope: !239, file: !235, line: 70, baseType: !7, size: 8, offset: 176, flags: DIFlagBitField, extraData: i64 176)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !234, file: !235, line: 76, baseType: !7, size: 32, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !234, file: !235, line: 77, baseType: !7, size: 32, offset: 96)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !234, file: !235, line: 79, baseType: !7, size: 32, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "last_listed", scope: !234, file: !235, line: 84, baseType: !123, size: 32, offset: 160)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !234, file: !235, line: 87, baseType: !7, size: 32, offset: 192)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "trace_includes", scope: !234, file: !235, line: 90, baseType: !137, size: 8, offset: 224)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "highest_location", scope: !234, file: !235, line: 93, baseType: !245, size: 32, offset: 256)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "highest_line", scope: !234, file: !235, line: 96, baseType: !245, size: 32, offset: 288)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "max_column_hint", scope: !234, file: !235, line: 100, baseType: !7, size: 32, offset: 320)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "reallocator", scope: !234, file: !235, line: 104, baseType: !260, size: 64, offset: 384)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "line_map_realloc", file: !235, line: 47, baseType: !261)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{!207, !207, !208}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "directive_line", scope: !126, file: !127, line: 337, baseType: !245, size: 32, offset: 384)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "a_buff", scope: !126, file: !127, line: 340, baseType: !266, size: 64, offset: 448)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cpp_buff", file: !127, line: 99, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_buff", file: !127, line: 100, size: 256, elements: !269)
!269 = !{!270, !272, !274, !275}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !268, file: !127, line: 102, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !268, file: !127, line: 103, baseType: !273, size: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !268, file: !127, line: 103, baseType: !273, size: 64, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !268, file: !127, line: 103, baseType: !273, size: 64, offset: 192)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "u_buff", scope: !126, file: !127, line: 341, baseType: !266, size: 64, offset: 512)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "free_buffs", scope: !126, file: !127, line: 342, baseType: !266, size: 64, offset: 576)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "base_context", scope: !126, file: !127, line: 345, baseType: !279, size: 448, offset: 640)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_context", file: !127, line: 142, size: 448, elements: !280)
!280 = !{!281, !284, !285, !385, !386, !387}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !279, file: !127, line: 145, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_context", file: !127, line: 141, baseType: !279)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !279, file: !127, line: 145, baseType: !282, size: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !279, file: !127, line: 164, baseType: !286, size: 128, offset: 128)
!286 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !279, file: !127, line: 147, size: 128, elements: !287)
!287 = !{!288, !380}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "iso", scope: !286, file: !127, line: 156, baseType: !289, size: 128)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !286, file: !127, line: 152, size: 128, elements: !290)
!290 = !{!291, !379}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !289, file: !127, line: 154, baseType: !292, size: 64)
!292 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "utoken", file: !127, line: 121, size: 64, elements: !293)
!293 = !{!294, !377}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !292, file: !127, line: 123, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !297)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_token", file: !6, line: 34, baseType: !298)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_token", file: !6, line: 212, size: 192, elements: !299)
!299 = !{!300, !301, !302, !304}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "src_loc", scope: !298, file: !6, line: 213, baseType: !245, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !298, file: !6, line: 214, baseType: !7, size: 8, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !298, file: !6, line: 215, baseType: !303, size: 16, offset: 48)
!303 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !298, file: !6, line: 237, baseType: !305, size: 128, offset: 64)
!305 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cpp_token_u", file: !6, line: 217, size: 128, elements: !306)
!306 = !{!307, !365, !366, !371, !375, !376}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !305, file: !6, line: 220, baseType: !308, size: 64)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_identifier", file: !6, line: 201, size: 64, elements: !309)
!309 = !{!310}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !308, file: !6, line: 207, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_hashnode", file: !6, line: 36, baseType: !313)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_hashnode", file: !6, line: 644, size: 256, elements: !314)
!314 = !{!315, !322, !323, !324, !325, !326, !327}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !313, file: !6, line: 645, baseType: !316, size: 128)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !317, line: 31, size: 128, elements: !318)
!317 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!318 = !{!319, !320, !321}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !316, file: !317, line: 32, baseType: !135, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !316, file: !317, line: 33, baseType: !7, size: 32, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !316, file: !317, line: 34, baseType: !7, size: 32, offset: 96)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "is_directive", scope: !313, file: !6, line: 646, baseType: !7, size: 1, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "directive_index", scope: !313, file: !6, line: 647, baseType: !7, size: 7, offset: 129, flags: DIFlagBitField, extraData: i64 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "rid_code", scope: !313, file: !6, line: 650, baseType: !137, size: 8, offset: 136)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !313, file: !6, line: 651, baseType: !7, size: 6, offset: 144, flags: DIFlagBitField, extraData: i64 144)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !313, file: !6, line: 652, baseType: !7, size: 10, offset: 150, flags: DIFlagBitField, extraData: i64 144)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !313, file: !6, line: 654, baseType: !328, size: 64, offset: 192)
!328 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_cpp_hashnode_value", file: !6, line: 633, size: 64, elements: !329)
!329 = !{!330, !353, !363, !364}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !328, file: !6, line: 635, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_macro", file: !6, line: 37, baseType: !333)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_macro", file: !334, line: 36, size: 256, elements: !335)
!334 = !DIFile(filename: "./cpp-id-data.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!335 = !{!336, !338, !344, !345, !346, !347, !348, !349, !350, !351, !352}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !333, file: !334, line: 42, baseType: !337, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !333, file: !334, line: 51, baseType: !339, size: 64, offset: 64)
!339 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cpp_macro_u", file: !334, line: 47, size: 64, elements: !340)
!340 = !{!341, !343}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tokens", scope: !339, file: !334, line: 49, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !339, file: !334, line: 50, baseType: !135, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !333, file: !334, line: 54, baseType: !245, size: 32, offset: 128)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !333, file: !334, line: 57, baseType: !7, size: 32, offset: 160)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "paramc", scope: !333, file: !334, line: 60, baseType: !303, size: 16, offset: 192)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "fun_like", scope: !333, file: !334, line: 63, baseType: !7, size: 1, offset: 208, flags: DIFlagBitField, extraData: i64 208)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "variadic", scope: !333, file: !334, line: 66, baseType: !7, size: 1, offset: 209, flags: DIFlagBitField, extraData: i64 208)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "syshdr", scope: !333, file: !334, line: 69, baseType: !7, size: 1, offset: 210, flags: DIFlagBitField, extraData: i64 208)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !333, file: !334, line: 72, baseType: !7, size: 1, offset: 211, flags: DIFlagBitField, extraData: i64 208)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "traditional", scope: !333, file: !334, line: 75, baseType: !7, size: 1, offset: 212, flags: DIFlagBitField, extraData: i64 208)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "extra_tokens", scope: !333, file: !334, line: 80, baseType: !7, size: 1, offset: 213, flags: DIFlagBitField, extraData: i64 208)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "answers", scope: !328, file: !6, line: 637, baseType: !354, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "answer", file: !334, line: 28, size: 320, elements: !356)
!356 = !{!357, !358, !359}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !355, file: !334, line: 29, baseType: !354, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !355, file: !334, line: 30, baseType: !7, size: 32, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !355, file: !334, line: 31, baseType: !360, size: 192, offset: 128)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !297, size: 192, elements: !361)
!361 = !{!362}
!362 = !DISubrange(count: 1)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "builtin", scope: !328, file: !6, line: 639, baseType: !5, size: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "arg_index", scope: !328, file: !6, line: 641, baseType: !303, size: 16)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !305, file: !6, line: 223, baseType: !342, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !305, file: !6, line: 226, baseType: !367, size: 128)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_string", file: !6, line: 162, size: 128, elements: !368)
!368 = !{!369, !370}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !367, file: !6, line: 163, baseType: !7, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !367, file: !6, line: 164, baseType: !135, size: 64, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "macro_arg", scope: !305, file: !6, line: 229, baseType: !372, size: 32)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_macro_arg", file: !6, line: 195, size: 32, elements: !373)
!373 = !{!374}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "arg_no", scope: !372, file: !6, line: 197, baseType: !7, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "token_no", scope: !305, file: !6, line: 233, baseType: !7, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "pragma", scope: !305, file: !6, line: 236, baseType: !7, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "ptoken", scope: !292, file: !127, line: 124, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !289, file: !127, line: 155, baseType: !292, size: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "trad", scope: !286, file: !127, line: 163, baseType: !381, size: 128)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !286, file: !127, line: 159, size: 128, elements: !382)
!382 = !{!383, !384}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !381, file: !127, line: 161, baseType: !135, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit", scope: !381, file: !127, line: 162, baseType: !135, size: 64, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !279, file: !127, line: 168, baseType: !266, size: 64, offset: 256)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !279, file: !127, line: 171, baseType: !311, size: 64, offset: 320)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "direct_p", scope: !279, file: !127, line: 174, baseType: !137, size: 8, offset: 384)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !126, file: !127, line: 346, baseType: !389, size: 64, offset: 1088)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "directive", scope: !126, file: !127, line: 349, baseType: !391, size: 64, offset: 1152)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !393)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "directive", file: !127, line: 40, flags: DIFlagFwdDecl)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "directive_result", scope: !126, file: !127, line: 352, baseType: !297, size: 192, offset: 1216)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "invocation_location", scope: !126, file: !127, line: 356, baseType: !245, size: 32, offset: 1408)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "set_invocation_location", scope: !126, file: !127, line: 360, baseType: !137, size: 8, offset: 1440)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "quote_include", scope: !126, file: !127, line: 363, baseType: !170, size: 64, offset: 1472)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "bracket_include", scope: !126, file: !127, line: 364, baseType: !170, size: 64, offset: 1536)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "no_search_path", scope: !126, file: !127, line: 365, baseType: !167, size: 512, offset: 1600)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "all_files", scope: !126, file: !127, line: 368, baseType: !155, size: 64, offset: 2112)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "main_file", scope: !126, file: !127, line: 370, baseType: !155, size: 64, offset: 2176)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "file_hash", scope: !126, file: !127, line: 373, baseType: !403, size: 64, offset: 2240)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !127, line: 373, flags: DIFlagFwdDecl)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "dir_hash", scope: !126, file: !127, line: 374, baseType: !403, size: 64, offset: 2304)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "file_hash_entries", scope: !126, file: !127, line: 375, baseType: !407, size: 64, offset: 2368)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "file_hash_entry_pool", file: !127, line: 375, flags: DIFlagFwdDecl)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "nonexistent_file_hash", scope: !126, file: !127, line: 378, baseType: !403, size: 64, offset: 2432)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "nonexistent_file_ob", scope: !126, file: !127, line: 379, baseType: !411, size: 704, offset: 2496)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !412, line: 164, size: 704, elements: !413)
!412 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!413 = !{!414, !416, !426, !427, !428, !429, !430, !431, !435, !439, !440, !441, !442}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !411, file: !412, line: 166, baseType: !415, size: 64)
!415 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !411, file: !412, line: 167, baseType: !417, size: 64, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !412, line: 157, size: 192, elements: !419)
!419 = !{!420, !421, !422}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !418, file: !412, line: 159, baseType: !172, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !418, file: !412, line: 160, baseType: !417, size: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !418, file: !412, line: 161, baseType: !423, size: 32, offset: 128)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 32, elements: !424)
!424 = !{!425}
!425 = !DISubrange(count: 4)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !411, file: !412, line: 168, baseType: !172, size: 64, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !411, file: !412, line: 169, baseType: !172, size: 64, offset: 192)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !411, file: !412, line: 170, baseType: !172, size: 64, offset: 256)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !411, file: !412, line: 171, baseType: !415, size: 64, offset: 320)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !411, file: !412, line: 172, baseType: !123, size: 32, offset: 384)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !411, file: !412, line: 176, baseType: !432, size: 64, offset: 448)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!417, !207, !415}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !411, file: !412, line: 177, baseType: !436, size: 64, offset: 512)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{null, !207, !417}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !411, file: !412, line: 178, baseType: !207, size: 64, offset: 576)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !411, file: !412, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !411, file: !412, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !411, file: !412, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "quote_ignores_source_dir", scope: !126, file: !127, line: 383, baseType: !137, size: 8, offset: 3200)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "seen_once_only", scope: !126, file: !127, line: 387, baseType: !137, size: 8, offset: 3208)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "mi_cmacro", scope: !126, file: !127, line: 390, baseType: !446, size: 64, offset: 3264)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !312)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "mi_ind_cmacro", scope: !126, file: !127, line: 391, baseType: !446, size: 64, offset: 3328)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "mi_valid", scope: !126, file: !127, line: 392, baseType: !137, size: 8, offset: 3392)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "cur_token", scope: !126, file: !127, line: 395, baseType: !342, size: 64, offset: 3456)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "base_run", scope: !126, file: !127, line: 396, baseType: !452, size: 256, offset: 3520)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "tokenrun", file: !127, line: 128, baseType: !453)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tokenrun", file: !127, line: 129, size: 256, elements: !454)
!454 = !{!455, !457, !458, !459}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !453, file: !127, line: 131, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !453, file: !127, line: 131, baseType: !456, size: 64, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !453, file: !127, line: 132, baseType: !342, size: 64, offset: 128)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !453, file: !127, line: 132, baseType: !342, size: 64, offset: 192)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "cur_run", scope: !126, file: !127, line: 396, baseType: !456, size: 64, offset: 3776)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "lookaheads", scope: !126, file: !127, line: 397, baseType: !7, size: 32, offset: 3840)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "keep_tokens", scope: !126, file: !127, line: 400, baseType: !7, size: 32, offset: 3872)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "macro_buffer", scope: !126, file: !127, line: 403, baseType: !273, size: 64, offset: 3904)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "macro_buffer_len", scope: !126, file: !127, line: 404, baseType: !7, size: 32, offset: 3968)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "narrow_cset_desc", scope: !126, file: !127, line: 408, baseType: !198, size: 192, offset: 4032)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_cset_desc", scope: !126, file: !127, line: 412, baseType: !198, size: 192, offset: 4224)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "char16_cset_desc", scope: !126, file: !127, line: 416, baseType: !198, size: 192, offset: 4416)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "char32_cset_desc", scope: !126, file: !127, line: 420, baseType: !198, size: 192, offset: 4608)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "wide_cset_desc", scope: !126, file: !127, line: 424, baseType: !198, size: 192, offset: 4800)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !126, file: !127, line: 427, baseType: !135, size: 64, offset: 4992)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !126, file: !127, line: 428, baseType: !135, size: 64, offset: 5056)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "avoid_paste", scope: !126, file: !127, line: 431, baseType: !297, size: 192, offset: 5120)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !126, file: !127, line: 432, baseType: !297, size: 192, offset: 5312)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "deps", scope: !126, file: !127, line: 435, baseType: !475, size: 64, offset: 5504)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DICompositeType(tag: DW_TAG_structure_type, name: "deps", file: !6, line: 685, flags: DIFlagFwdDecl)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "hash_ob", scope: !126, file: !127, line: 439, baseType: !411, size: 704, offset: 5568)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_ob", scope: !126, file: !127, line: 443, baseType: !411, size: 704, offset: 6272)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "pragmas", scope: !126, file: !127, line: 447, baseType: !480, size: 64, offset: 6976)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DICompositeType(tag: DW_TAG_structure_type, name: "pragma_entry", file: !127, line: 447, flags: DIFlagFwdDecl)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !126, file: !127, line: 450, baseType: !483, size: 1088, offset: 7040)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_callbacks", file: !6, line: 472, size: 1088, elements: !484)
!484 = !{!485, !489, !495, !499, !503, !507, !508, !515, !519, !523, !527, !533, !537, !552, !553, !554, !558}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "line_change", scope: !483, file: !6, line: 475, baseType: !486, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{null, !124, !295, !123}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "file_change", scope: !483, file: !6, line: 481, baseType: !490, size: 64, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DISubroutineType(types: !492)
!492 = !{null, !124, !493}
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !239)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "dir_change", scope: !483, file: !6, line: 483, baseType: !496, size: 64, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DISubroutineType(types: !498)
!498 = !{null, !124, !180}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "include", scope: !483, file: !6, line: 484, baseType: !500, size: 64, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DISubroutineType(types: !502)
!502 = !{null, !124, !7, !135, !180, !123, !378}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "define", scope: !483, file: !6, line: 486, baseType: !504, size: 64, offset: 256)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{null, !124, !7, !311}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "undef", scope: !483, file: !6, line: 487, baseType: !504, size: 64, offset: 320)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !483, file: !6, line: 488, baseType: !509, size: 64, offset: 384)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DISubroutineType(types: !511)
!511 = !{null, !124, !7, !512}
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !514)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_string", file: !6, line: 35, baseType: !367)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "def_pragma", scope: !483, file: !6, line: 489, baseType: !516, size: 64, offset: 448)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DISubroutineType(types: !518)
!518 = !{null, !124, !7}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "valid_pch", scope: !483, file: !6, line: 490, baseType: !520, size: 64, offset: 512)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{!123, !124, !180, !123}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "read_pch", scope: !483, file: !6, line: 491, baseType: !524, size: 64, offset: 576)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{null, !124, !180, !123, !180}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "missing_header", scope: !483, file: !6, line: 492, baseType: !528, size: 64, offset: 640)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "missing_header_cb", file: !6, line: 469, baseType: !529)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{!180, !124, !180, !532}
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "macro_to_expand", scope: !483, file: !6, line: 496, baseType: !534, size: 64, offset: 704)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{!311, !124, !295}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !483, file: !6, line: 500, baseType: !538, size: 64, offset: 768)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DISubroutineType(types: !540)
!540 = !{!137, !124, !123, !245, !7, !180, !541}
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !543, line: 14, baseType: !544)
!543 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stdarg.h", directory: "")
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 60, baseType: !545)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 192, elements: !361)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 60, size: 192, elements: !547)
!547 = !{!548, !549, !550, !551}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !546, file: !3, line: 60, baseType: !7, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !546, file: !3, line: 60, baseType: !7, size: 32, offset: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !546, file: !3, line: 60, baseType: !207, size: 64, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !546, file: !3, line: 60, baseType: !207, size: 64, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "used_define", scope: !483, file: !6, line: 506, baseType: !504, size: 64, offset: 832)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "used_undef", scope: !483, file: !6, line: 507, baseType: !504, size: 64, offset: 896)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "before_define", scope: !483, file: !6, line: 510, baseType: !555, size: 64, offset: 960)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DISubroutineType(types: !557)
!557 = !{null, !124}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !483, file: !6, line: 513, baseType: !559, size: 64, offset: 1024)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DISubroutineType(types: !561)
!561 = !{null, !124, !245, !311}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "hash_table", scope: !126, file: !127, line: 453, baseType: !563, size: 64, offset: 8128)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht", file: !317, line: 46, size: 1152, elements: !565)
!565 = !{!566, !567, !571, !577, !581, !582, !583, !585, !586, !587}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !564, file: !317, line: 49, baseType: !411, size: 704)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !564, file: !317, line: 51, baseType: !568, size: 64, offset: 704)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashnode", file: !317, line: 41, baseType: !570)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_node", scope: !564, file: !317, line: 53, baseType: !572, size: 64, offset: 768)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DISubroutineType(types: !574)
!574 = !{!569, !575}
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_table", file: !317, line: 40, baseType: !564)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_subobject", scope: !564, file: !317, line: 56, baseType: !578, size: 64, offset: 832)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{!207, !208}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "nslots", scope: !564, file: !317, line: 58, baseType: !7, size: 32, offset: 896)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "nelements", scope: !564, file: !317, line: 59, baseType: !7, size: 32, offset: 928)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "pfile", scope: !564, file: !317, line: 62, baseType: !584, size: 64, offset: 960)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !564, file: !317, line: 65, baseType: !7, size: 32, offset: 1024)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !564, file: !317, line: 66, baseType: !7, size: 32, offset: 1056)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "entries_owned", scope: !564, file: !317, line: 69, baseType: !137, size: 8, offset: 1088)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "op_stack", scope: !126, file: !127, line: 456, baseType: !589, size: 64, offset: 8192)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DICompositeType(tag: DW_TAG_structure_type, name: "op", file: !127, line: 42, flags: DIFlagFwdDecl)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "op_limit", scope: !126, file: !127, line: 456, baseType: !589, size: 64, offset: 8256)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !126, file: !127, line: 459, baseType: !593, size: 1024, offset: 8320)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_options", file: !6, line: 279, size: 1024, elements: !594)
!594 = !{!595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !646, !647, !648, !649, !650, !651, !652, !653, !654}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "tabstop", scope: !593, file: !6, line: 282, baseType: !7, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "lang", scope: !593, file: !6, line: 285, baseType: !19, size: 32, offset: 32)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "cplusplus", scope: !593, file: !6, line: 288, baseType: !137, size: 8, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "cplusplus_comments", scope: !593, file: !6, line: 291, baseType: !137, size: 8, offset: 72)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "objc", scope: !593, file: !6, line: 296, baseType: !137, size: 8, offset: 80)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "discard_comments", scope: !593, file: !6, line: 299, baseType: !137, size: 8, offset: 88)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "discard_comments_in_macro_exp", scope: !593, file: !6, line: 303, baseType: !137, size: 8, offset: 96)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "trigraphs", scope: !593, file: !6, line: 306, baseType: !137, size: 8, offset: 104)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "digraphs", scope: !593, file: !6, line: 309, baseType: !137, size: 8, offset: 112)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "extended_numbers", scope: !593, file: !6, line: 312, baseType: !137, size: 8, offset: 120)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "uliterals", scope: !593, file: !6, line: 315, baseType: !137, size: 8, offset: 128)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "print_include_names", scope: !593, file: !6, line: 318, baseType: !137, size: 8, offset: 136)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "warn_deprecated", scope: !593, file: !6, line: 321, baseType: !137, size: 8, offset: 144)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "warn_comments", scope: !593, file: !6, line: 324, baseType: !137, size: 8, offset: 152)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "warn_missing_include_dirs", scope: !593, file: !6, line: 328, baseType: !137, size: 8, offset: 160)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "warn_trigraphs", scope: !593, file: !6, line: 331, baseType: !137, size: 8, offset: 168)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "warn_multichar", scope: !593, file: !6, line: 334, baseType: !137, size: 8, offset: 176)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "warn_traditional", scope: !593, file: !6, line: 338, baseType: !137, size: 8, offset: 184)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "warn_long_long", scope: !593, file: !6, line: 341, baseType: !137, size: 8, offset: 192)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "warn_endif_labels", scope: !593, file: !6, line: 344, baseType: !137, size: 8, offset: 200)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "warn_num_sign_change", scope: !593, file: !6, line: 348, baseType: !137, size: 8, offset: 208)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "warn_variadic_macros", scope: !593, file: !6, line: 352, baseType: !137, size: 8, offset: 216)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "warn_builtin_macro_redefined", scope: !593, file: !6, line: 356, baseType: !137, size: 8, offset: 224)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !593, file: !6, line: 360, baseType: !137, size: 8, offset: 232)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "dollars_in_ident", scope: !593, file: !6, line: 363, baseType: !137, size: 8, offset: 240)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "extended_identifiers", scope: !593, file: !6, line: 366, baseType: !137, size: 8, offset: 248)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "warn_dollars", scope: !593, file: !6, line: 370, baseType: !137, size: 8, offset: 256)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "warn_undef", scope: !593, file: !6, line: 373, baseType: !137, size: 8, offset: 264)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "warn_unused_macros", scope: !593, file: !6, line: 376, baseType: !137, size: 8, offset: 272)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "c99", scope: !593, file: !6, line: 379, baseType: !137, size: 8, offset: 280)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "std", scope: !593, file: !6, line: 382, baseType: !137, size: 8, offset: 288)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "pedantic", scope: !593, file: !6, line: 385, baseType: !137, size: 8, offset: 296)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "preprocessed", scope: !593, file: !6, line: 389, baseType: !137, size: 8, offset: 304)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "show_column", scope: !593, file: !6, line: 392, baseType: !137, size: 8, offset: 312)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "operator_names", scope: !593, file: !6, line: 395, baseType: !137, size: 8, offset: 320)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "warn_cxx_operator_names", scope: !593, file: !6, line: 398, baseType: !137, size: 8, offset: 328)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "traditional", scope: !593, file: !6, line: 401, baseType: !137, size: 8, offset: 336)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "narrow_charset", scope: !593, file: !6, line: 404, baseType: !180, size: 64, offset: 384)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "wide_charset", scope: !593, file: !6, line: 407, baseType: !180, size: 64, offset: 448)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "input_charset", scope: !593, file: !6, line: 410, baseType: !180, size: 64, offset: 512)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "warn_normalize", scope: !593, file: !6, line: 414, baseType: !31, size: 32, offset: 576)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "warn_invalid_pch", scope: !593, file: !6, line: 417, baseType: !137, size: 8, offset: 608)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "restore_pch_deps", scope: !593, file: !6, line: 420, baseType: !137, size: 8, offset: 616)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "deps", scope: !593, file: !6, line: 441, baseType: !639, size: 64, offset: 640)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !593, file: !6, line: 423, size: 64, elements: !640)
!640 = !{!641, !642, !643, !644, !645}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !639, file: !6, line: 426, baseType: !37, size: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "missing_files", scope: !639, file: !6, line: 429, baseType: !137, size: 8, offset: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "phony_targets", scope: !639, file: !6, line: 433, baseType: !137, size: 8, offset: 40)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_main_file", scope: !639, file: !6, line: 436, baseType: !137, size: 8, offset: 48)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "need_preprocessor_output", scope: !639, file: !6, line: 440, baseType: !137, size: 8, offset: 56)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !593, file: !6, line: 447, baseType: !208, size: 64, offset: 704)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "char_precision", scope: !593, file: !6, line: 447, baseType: !208, size: 64, offset: 768)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "int_precision", scope: !593, file: !6, line: 447, baseType: !208, size: 64, offset: 832)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "wchar_precision", scope: !593, file: !6, line: 447, baseType: !208, size: 64, offset: 896)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_char", scope: !593, file: !6, line: 450, baseType: !137, size: 8, offset: 960)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_wchar", scope: !593, file: !6, line: 450, baseType: !137, size: 8, offset: 968)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_big_endian", scope: !593, file: !6, line: 454, baseType: !137, size: 8, offset: 976)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "stdc_0_in_system_headers", scope: !593, file: !6, line: 457, baseType: !137, size: 8, offset: 984)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "directives_only", scope: !593, file: !6, line: 460, baseType: !137, size: 8, offset: 992)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "spec_nodes", scope: !126, file: !127, line: 463, baseType: !656, size: 256, offset: 9344)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spec_nodes", file: !127, line: 227, size: 256, elements: !657)
!657 = !{!658, !659, !660, !661}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "n_defined", scope: !656, file: !127, line: 229, baseType: !311, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "n_true", scope: !656, file: !127, line: 230, baseType: !311, size: 64, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "n_false", scope: !656, file: !127, line: 231, baseType: !311, size: 64, offset: 128)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "n__VA_ARGS__", scope: !656, file: !127, line: 232, baseType: !311, size: 64, offset: 192)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "our_hashtable", scope: !126, file: !127, line: 466, baseType: !137, size: 8, offset: 9600)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !126, file: !127, line: 475, baseType: !664, size: 256, offset: 9664)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !126, file: !127, line: 469, size: 256, elements: !665)
!665 = !{!666, !667, !668, !669}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !664, file: !127, line: 471, baseType: !273, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !664, file: !127, line: 472, baseType: !273, size: 64, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !664, file: !127, line: 473, baseType: !273, size: 64, offset: 128)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "first_line", scope: !664, file: !127, line: 474, baseType: !245, size: 32, offset: 192)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "saved_cur", scope: !126, file: !127, line: 478, baseType: !135, size: 64, offset: 9920)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "saved_rlimit", scope: !126, file: !127, line: 478, baseType: !135, size: 64, offset: 9984)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "saved_line_base", scope: !126, file: !127, line: 478, baseType: !135, size: 64, offset: 10048)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "savedstate", scope: !126, file: !127, line: 482, baseType: !674, size: 64, offset: 10112)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_savedstate", file: !127, line: 482, flags: DIFlagFwdDecl)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !126, file: !127, line: 485, baseType: !7, size: 32, offset: 10176)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "comments", scope: !126, file: !127, line: 488, baseType: !678, size: 128, offset: 10240)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_comment_table", file: !6, line: 901, baseType: !679)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 891, size: 128, elements: !680)
!680 = !{!681, !688, !689}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !679, file: !6, line: 894, baseType: !682, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_comment", file: !6, line: 887, baseType: !684)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 880, size: 128, elements: !685)
!685 = !{!686, !687}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !684, file: !6, line: 883, baseType: !172, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "sloc", scope: !684, file: !6, line: 886, baseType: !245, size: 32, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !679, file: !6, line: 897, baseType: !123, size: 32, offset: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !679, file: !6, line: 900, baseType: !123, size: 32, offset: 96)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "pushed_macros", scope: !126, file: !127, line: 491, baseType: !691, size: 64, offset: 10368)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_pragma_macro", file: !127, line: 310, size: 192, elements: !693)
!693 = !{!694, !695, !696}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !692, file: !127, line: 312, baseType: !691, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !692, file: !127, line: 314, baseType: !172, size: 64, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !692, file: !127, line: 316, baseType: !331, size: 64, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DISubroutineType(types: !699)
!699 = !{!207, !415}
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{null, !207}
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !209, line: 35, baseType: !415)
!704 = !{!0, !705, !721, !727, !743}
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(name: "lang_defaults", scope: !2, file: !3, line: 84, type: !707, isLocal: true, isDefinition: true)
!707 = !DICompositeType(tag: DW_TAG_array_type, baseType: !708, size: 640, elements: !719)
!708 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !709)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lang_flags", file: !3, line: 72, size: 64, elements: !710)
!710 = !{!711, !712, !713, !714, !715, !716, !717, !718}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "c99", scope: !709, file: !3, line: 74, baseType: !173, size: 8)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "cplusplus", scope: !709, file: !3, line: 75, baseType: !173, size: 8, offset: 8)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "extended_numbers", scope: !709, file: !3, line: 76, baseType: !173, size: 8, offset: 16)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "extended_identifiers", scope: !709, file: !3, line: 77, baseType: !173, size: 8, offset: 24)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "std", scope: !709, file: !3, line: 78, baseType: !173, size: 8, offset: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "cplusplus_comments", scope: !709, file: !3, line: 79, baseType: !173, size: 8, offset: 40)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "digraphs", scope: !709, file: !3, line: 80, baseType: !173, size: 8, offset: 48)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "uliterals", scope: !709, file: !3, line: 81, baseType: !173, size: 8, offset: 56)
!719 = !{!720}
!720 = !DISubrange(count: 10)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(name: "initialized", scope: !723, file: !3, line: 125, type: !123, isLocal: true, isDefinition: true)
!723 = distinct !DISubprogram(name: "init_library", scope: !3, file: !3, line: 123, type: !724, scopeLine: 124, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !726)
!724 = !DISubroutineType(types: !725)
!725 = !{null}
!726 = !{}
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(name: "operator_array", scope: !2, file: !3, line: 367, type: !729, isLocal: true, isDefinition: true)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !730, size: 1408, elements: !741)
!730 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !731)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "builtin_operator", file: !3, line: 359, size: 128, elements: !732)
!732 = !{!733, !738, !740}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !731, file: !3, line: 361, baseType: !734, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !735)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !737)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !334, line: 22, baseType: !137)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !731, file: !3, line: 362, baseType: !739, size: 16, offset: 64)
!739 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !303)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !731, file: !3, line: 363, baseType: !739, size: 16, offset: 80)
!741 = !{!742}
!742 = !DISubrange(count: 11)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(name: "builtin_array", scope: !2, file: !3, line: 342, type: !745, isLocal: true, isDefinition: true)
!745 = !DICompositeType(tag: DW_TAG_array_type, baseType: !746, size: 1280, elements: !719)
!746 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !747)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "builtin_macro", file: !3, line: 333, size: 128, elements: !748)
!748 = !{!749, !750, !751, !752}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !747, file: !3, line: 335, baseType: !734, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !747, file: !3, line: 336, baseType: !739, size: 16, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !747, file: !3, line: 337, baseType: !739, size: 16, offset: 80)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "always_warn_if_redefined", scope: !747, file: !3, line: 338, baseType: !136, size: 8, offset: 96)
!753 = !DICompositeType(tag: DW_TAG_array_type, baseType: !736, size: 2048, elements: !754)
!754 = !{!755}
!755 = !DISubrange(count: 256)
!756 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!757 = !{i32 2, !"Dwarf Version", i32 4}
!758 = !{i32 2, !"Debug Info Version", i32 3}
!759 = !{i32 1, !"wchar_size", i32 4}
!760 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!761 = distinct !DISubprogram(name: "tolower", scope: !762, file: !762, line: 207, type: !763, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !765)
!762 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!763 = !DISubroutineType(types: !764)
!764 = !{!123, !123}
!765 = !{!766}
!766 = !DILocalVariable(name: "__c", arg: 1, scope: !761, file: !762, line: 207, type: !123)
!767 = !DILocation(line: 0, scope: !761)
!768 = !DILocation(line: 209, column: 22, scope: !761)
!769 = !DILocation(line: 209, column: 39, scope: !761)
!770 = !DILocation(line: 209, column: 38, scope: !761)
!771 = !DILocation(line: 209, column: 37, scope: !761)
!772 = !DILocation(line: 209, column: 10, scope: !761)
!773 = !DILocation(line: 209, column: 3, scope: !761)
!774 = distinct !DISubprogram(name: "toupper", scope: !762, file: !762, line: 213, type: !763, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !775)
!775 = !{!776}
!776 = !DILocalVariable(name: "__c", arg: 1, scope: !774, file: !762, line: 213, type: !123)
!777 = !DILocation(line: 0, scope: !774)
!778 = !DILocation(line: 215, column: 22, scope: !774)
!779 = !DILocation(line: 215, column: 39, scope: !774)
!780 = !DILocation(line: 215, column: 38, scope: !774)
!781 = !DILocation(line: 215, column: 37, scope: !774)
!782 = !DILocation(line: 215, column: 10, scope: !774)
!783 = !DILocation(line: 215, column: 3, scope: !774)
!784 = distinct !DISubprogram(name: "cpp_set_lang", scope: !3, file: !3, line: 104, type: !785, scopeLine: 105, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !787)
!785 = !DISubroutineType(types: !786)
!786 = !{null, !124, !19}
!787 = !{!788, !789, !790}
!788 = !DILocalVariable(name: "pfile", arg: 1, scope: !784, file: !3, line: 104, type: !124)
!789 = !DILocalVariable(name: "lang", arg: 2, scope: !784, file: !3, line: 104, type: !19)
!790 = !DILocalVariable(name: "l", scope: !784, file: !3, line: 106, type: !791)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!792 = !DILocation(line: 0, scope: !784)
!793 = !DILocation(line: 106, column: 33, scope: !784)
!794 = !DILocation(line: 108, column: 3, scope: !784)
!795 = !DILocation(line: 108, column: 28, scope: !784)
!796 = !DILocation(line: 110, column: 35, scope: !784)
!797 = !DILocation(line: 110, column: 3, scope: !784)
!798 = !DILocation(line: 110, column: 30, scope: !784)
!799 = !DILocation(line: 111, column: 41, scope: !784)
!800 = !DILocation(line: 111, column: 3, scope: !784)
!801 = !DILocation(line: 111, column: 36, scope: !784)
!802 = !DILocation(line: 112, column: 47, scope: !784)
!803 = !DILocation(line: 112, column: 3, scope: !784)
!804 = !DILocation(line: 112, column: 42, scope: !784)
!805 = !DILocation(line: 113, column: 50, scope: !784)
!806 = !DILocation(line: 113, column: 3, scope: !784)
!807 = !DILocation(line: 113, column: 45, scope: !784)
!808 = !DILocation(line: 114, column: 35, scope: !784)
!809 = !DILocation(line: 114, column: 3, scope: !784)
!810 = !DILocation(line: 114, column: 30, scope: !784)
!811 = !DILocation(line: 115, column: 3, scope: !784)
!812 = !DILocation(line: 115, column: 36, scope: !784)
!813 = !DILocation(line: 116, column: 48, scope: !784)
!814 = !DILocation(line: 116, column: 3, scope: !784)
!815 = !DILocation(line: 116, column: 43, scope: !784)
!816 = !DILocation(line: 117, column: 40, scope: !784)
!817 = !DILocation(line: 117, column: 3, scope: !784)
!818 = !DILocation(line: 117, column: 35, scope: !784)
!819 = !DILocation(line: 118, column: 41, scope: !784)
!820 = !DILocation(line: 118, column: 3, scope: !784)
!821 = !DILocation(line: 118, column: 36, scope: !784)
!822 = !DILocation(line: 119, column: 1, scope: !784)
!823 = distinct !DISubprogram(name: "cpp_create_reader", scope: !3, file: !3, line: 144, type: !824, scopeLine: 146, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !826)
!824 = !DISubroutineType(types: !825)
!825 = !{!124, !19, !575, !233}
!826 = !{!827, !828, !829, !830}
!827 = !DILocalVariable(name: "lang", arg: 1, scope: !823, file: !3, line: 144, type: !19)
!828 = !DILocalVariable(name: "table", arg: 2, scope: !823, file: !3, line: 144, type: !575)
!829 = !DILocalVariable(name: "line_table", arg: 3, scope: !823, file: !3, line: 145, type: !233)
!830 = !DILocalVariable(name: "pfile", scope: !823, file: !3, line: 147, type: !124)
!831 = !DILocation(line: 0, scope: !823)
!832 = !DILocation(line: 150, column: 3, scope: !823)
!833 = !DILocation(line: 152, column: 11, scope: !823)
!834 = !DILocation(line: 154, column: 3, scope: !823)
!835 = !DILocation(line: 155, column: 3, scope: !823)
!836 = !DILocation(line: 155, column: 38, scope: !823)
!837 = !DILocation(line: 156, column: 3, scope: !823)
!838 = !DILocation(line: 156, column: 40, scope: !823)
!839 = !DILocation(line: 157, column: 3, scope: !823)
!840 = !DILocation(line: 157, column: 53, scope: !823)
!841 = !DILocation(line: 158, column: 3, scope: !823)
!842 = !DILocation(line: 158, column: 35, scope: !823)
!843 = !DILocation(line: 159, column: 3, scope: !823)
!844 = !DILocation(line: 159, column: 31, scope: !823)
!845 = !DILocation(line: 160, column: 3, scope: !823)
!846 = !DILocation(line: 160, column: 38, scope: !823)
!847 = !DILocation(line: 161, column: 3, scope: !823)
!848 = !DILocation(line: 161, column: 38, scope: !823)
!849 = !DILocation(line: 162, column: 3, scope: !823)
!850 = !DILocation(line: 162, column: 41, scope: !823)
!851 = !DILocation(line: 163, column: 3, scope: !823)
!852 = !DILocation(line: 163, column: 39, scope: !823)
!853 = !DILocation(line: 164, column: 3, scope: !823)
!854 = !DILocation(line: 164, column: 38, scope: !823)
!855 = !DILocation(line: 165, column: 3, scope: !823)
!856 = !DILocation(line: 165, column: 40, scope: !823)
!857 = !DILocation(line: 166, column: 3, scope: !823)
!858 = !DILocation(line: 166, column: 36, scope: !823)
!859 = !DILocation(line: 167, column: 3, scope: !823)
!860 = !DILocation(line: 167, column: 44, scope: !823)
!861 = !DILocation(line: 168, column: 3, scope: !823)
!862 = !DILocation(line: 168, column: 52, scope: !823)
!863 = !DILocation(line: 169, column: 3, scope: !823)
!864 = !DILocation(line: 169, column: 38, scope: !823)
!865 = !DILocation(line: 173, column: 3, scope: !823)
!866 = !DILocation(line: 173, column: 33, scope: !823)
!867 = !DILocation(line: 174, column: 3, scope: !823)
!868 = !DILocation(line: 174, column: 38, scope: !823)
!869 = !DILocation(line: 175, column: 3, scope: !823)
!870 = !DILocation(line: 175, column: 39, scope: !823)
!871 = !DILocation(line: 176, column: 3, scope: !823)
!872 = !DILocation(line: 176, column: 37, scope: !823)
!873 = !DILocation(line: 177, column: 3, scope: !823)
!874 = !DILocation(line: 177, column: 37, scope: !823)
!875 = !DILocation(line: 178, column: 3, scope: !823)
!876 = !DILocation(line: 178, column: 38, scope: !823)
!877 = !DILocation(line: 179, column: 3, scope: !823)
!878 = !DILocation(line: 179, column: 40, scope: !823)
!879 = !DILocation(line: 182, column: 40, scope: !823)
!880 = !DILocation(line: 182, column: 3, scope: !823)
!881 = !DILocation(line: 182, column: 38, scope: !823)
!882 = !DILocation(line: 183, column: 3, scope: !823)
!883 = !DILocation(line: 183, column: 36, scope: !823)
!884 = !DILocation(line: 186, column: 39, scope: !823)
!885 = !DILocation(line: 186, column: 3, scope: !823)
!886 = !DILocation(line: 186, column: 37, scope: !823)
!887 = !DILocation(line: 192, column: 25, scope: !823)
!888 = !DILocation(line: 192, column: 30, scope: !823)
!889 = !DILocation(line: 195, column: 10, scope: !823)
!890 = !DILocation(line: 195, column: 21, scope: !823)
!891 = !DILocation(line: 198, column: 34, scope: !823)
!892 = !DILocation(line: 198, column: 32, scope: !823)
!893 = !DILocation(line: 198, column: 16, scope: !823)
!894 = !DILocation(line: 198, column: 30, scope: !823)
!895 = !DILocation(line: 201, column: 22, scope: !823)
!896 = !DILocation(line: 201, column: 27, scope: !823)
!897 = !DILocation(line: 202, column: 22, scope: !823)
!898 = !DILocation(line: 202, column: 26, scope: !823)
!899 = !DILocation(line: 202, column: 33, scope: !823)
!900 = !DILocation(line: 203, column: 14, scope: !823)
!901 = !DILocation(line: 203, column: 19, scope: !823)
!902 = !DILocation(line: 204, column: 14, scope: !823)
!903 = !DILocation(line: 204, column: 20, scope: !823)
!904 = !DILocation(line: 207, column: 31, scope: !823)
!905 = !DILocation(line: 207, column: 3, scope: !823)
!906 = !DILocation(line: 208, column: 10, scope: !823)
!907 = !DILocation(line: 208, column: 18, scope: !823)
!908 = !DILocation(line: 209, column: 38, scope: !823)
!909 = !DILocation(line: 209, column: 10, scope: !823)
!910 = !DILocation(line: 209, column: 20, scope: !823)
!911 = !DILocation(line: 212, column: 28, scope: !823)
!912 = !DILocation(line: 212, column: 10, scope: !823)
!913 = !DILocation(line: 212, column: 18, scope: !823)
!914 = !DILocation(line: 213, column: 23, scope: !823)
!915 = !DILocation(line: 213, column: 29, scope: !823)
!916 = !DILocation(line: 214, column: 50, scope: !823)
!917 = !DILocation(line: 214, column: 55, scope: !823)
!918 = !DILocation(line: 214, column: 23, scope: !823)
!919 = !DILocation(line: 214, column: 28, scope: !823)
!920 = !DILocation(line: 217, column: 19, scope: !823)
!921 = !DILocation(line: 217, column: 10, scope: !823)
!922 = !DILocation(line: 217, column: 17, scope: !823)
!923 = !DILocation(line: 218, column: 19, scope: !823)
!924 = !DILocation(line: 218, column: 10, scope: !823)
!925 = !DILocation(line: 218, column: 17, scope: !823)
!926 = !DILocation(line: 221, column: 10, scope: !823)
!927 = !DILocation(line: 221, column: 24, scope: !823)
!928 = !DILocation(line: 224, column: 3, scope: !823)
!929 = !DILocation(line: 227, column: 27, scope: !823)
!930 = !DILocation(line: 227, column: 3, scope: !823)
!931 = !DILocation(line: 231, column: 3, scope: !823)
!932 = !DILocation(line: 233, column: 3, scope: !823)
!933 = !DILocation(line: 235, column: 3, scope: !823)
!934 = !DILocation(line: 127, column: 9, scope: !935)
!935 = distinct !DILexicalBlock(scope: !723, file: !3, line: 127, column: 7)
!936 = !DILocation(line: 127, column: 7, scope: !723)
!937 = !DILocation(line: 129, column: 19, scope: !938)
!938 = distinct !DILexicalBlock(scope: !935, file: !3, line: 128, column: 5)
!939 = !DILocation(line: 139, column: 5, scope: !938)
!940 = !DILocation(line: 140, column: 1, scope: !723)
!941 = distinct !DISubprogram(name: "cpp_set_line_map", scope: !3, file: !3, line: 241, type: !942, scopeLine: 242, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !944)
!942 = !DISubroutineType(types: !943)
!943 = !{null, !124, !233}
!944 = !{!945, !946}
!945 = !DILocalVariable(name: "pfile", arg: 1, scope: !941, file: !3, line: 241, type: !124)
!946 = !DILocalVariable(name: "line_table", arg: 2, scope: !941, file: !3, line: 241, type: !233)
!947 = !DILocation(line: 0, scope: !941)
!948 = !DILocation(line: 243, column: 10, scope: !941)
!949 = !DILocation(line: 243, column: 21, scope: !941)
!950 = !DILocation(line: 244, column: 1, scope: !941)
!951 = distinct !DISubprogram(name: "cpp_destroy", scope: !3, file: !3, line: 249, type: !556, scopeLine: 250, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !952)
!952 = !{!953, !954, !955, !956, !957, !958, !959}
!953 = !DILocalVariable(name: "pfile", arg: 1, scope: !951, file: !3, line: 249, type: !124)
!954 = !DILocalVariable(name: "context", scope: !951, file: !3, line: 251, type: !282)
!955 = !DILocalVariable(name: "contextn", scope: !951, file: !3, line: 251, type: !282)
!956 = !DILocalVariable(name: "pmacro", scope: !951, file: !3, line: 252, type: !691)
!957 = !DILocalVariable(name: "run", scope: !951, file: !3, line: 253, type: !456)
!958 = !DILocalVariable(name: "runn", scope: !951, file: !3, line: 253, type: !456)
!959 = !DILocalVariable(name: "i", scope: !951, file: !3, line: 254, type: !123)
!960 = !DILocation(line: 0, scope: !951)
!961 = !DILocation(line: 256, column: 16, scope: !951)
!962 = !DILocation(line: 256, column: 3, scope: !951)
!963 = !DILocation(line: 258, column: 3, scope: !951)
!964 = !DILocation(line: 258, column: 10, scope: !951)
!965 = !DILocation(line: 258, column: 29, scope: !951)
!966 = !DILocation(line: 259, column: 5, scope: !951)
!967 = distinct !{!967, !963, !968}
!968 = !DILocation(line: 259, column: 27, scope: !951)
!969 = !DILocation(line: 261, column: 18, scope: !970)
!970 = distinct !DILexicalBlock(scope: !951, file: !3, line: 261, column: 7)
!971 = !DILocation(line: 261, column: 7, scope: !970)
!972 = !DILocation(line: 261, column: 7, scope: !951)
!973 = !DILocation(line: 262, column: 5, scope: !970)
!974 = !DILocation(line: 264, column: 14, scope: !975)
!975 = distinct !DILexicalBlock(scope: !951, file: !3, line: 264, column: 7)
!976 = !DILocation(line: 264, column: 7, scope: !975)
!977 = !DILocation(line: 264, column: 7, scope: !951)
!978 = !DILocation(line: 266, column: 7, scope: !979)
!979 = distinct !DILexicalBlock(scope: !975, file: !3, line: 265, column: 5)
!980 = !DILocation(line: 267, column: 27, scope: !979)
!981 = !DILocation(line: 268, column: 14, scope: !979)
!982 = !DILocation(line: 268, column: 31, scope: !979)
!983 = !DILocation(line: 269, column: 5, scope: !979)
!984 = !DILocation(line: 271, column: 14, scope: !985)
!985 = distinct !DILexicalBlock(scope: !951, file: !3, line: 271, column: 7)
!986 = !DILocation(line: 271, column: 7, scope: !985)
!987 = !DILocation(line: 271, column: 7, scope: !951)
!988 = !DILocation(line: 272, column: 5, scope: !985)
!989 = !DILocation(line: 273, column: 3, scope: !951)
!990 = !DILocation(line: 275, column: 3, scope: !951)
!991 = !DILocation(line: 276, column: 3, scope: !951)
!992 = !DILocation(line: 277, column: 3, scope: !951)
!993 = !DILocation(line: 279, column: 26, scope: !951)
!994 = !DILocation(line: 279, column: 3, scope: !951)
!995 = !DILocation(line: 280, column: 26, scope: !951)
!996 = !DILocation(line: 280, column: 3, scope: !951)
!997 = !DILocation(line: 281, column: 26, scope: !951)
!998 = !DILocation(line: 281, column: 3, scope: !951)
!999 = !DILocation(line: 283, column: 22, scope: !1000)
!1000 = distinct !DILexicalBlock(scope: !951, file: !3, line: 283, column: 3)
!1001 = !DILocation(line: 283, column: 8, scope: !1000)
!1002 = !DILocation(line: 0, scope: !1000)
!1003 = !DILocation(line: 283, column: 3, scope: !1000)
!1004 = !DILocation(line: 285, column: 19, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !1006, file: !3, line: 284, column: 5)
!1006 = distinct !DILexicalBlock(scope: !1000, file: !3, line: 283, column: 3)
!1007 = !DILocation(line: 286, column: 18, scope: !1005)
!1008 = !DILocation(line: 286, column: 7, scope: !1005)
!1009 = !DILocation(line: 287, column: 15, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !1005, file: !3, line: 287, column: 11)
!1011 = !DILocation(line: 287, column: 11, scope: !1005)
!1012 = !DILocation(line: 288, column: 8, scope: !1010)
!1013 = !DILocation(line: 288, column: 2, scope: !1010)
!1014 = !DILocation(line: 283, column: 3, scope: !1006)
!1015 = distinct !{!1015, !1003, !1016}
!1016 = !DILocation(line: 289, column: 5, scope: !1000)
!1017 = !DILocation(line: 291, column: 38, scope: !1018)
!1018 = distinct !DILexicalBlock(scope: !951, file: !3, line: 291, column: 3)
!1019 = !DILocation(line: 291, column: 8, scope: !1018)
!1020 = !DILocation(line: 0, scope: !1018)
!1021 = !DILocation(line: 291, column: 3, scope: !1018)
!1022 = !DILocation(line: 293, column: 27, scope: !1023)
!1023 = distinct !DILexicalBlock(scope: !1024, file: !3, line: 292, column: 5)
!1024 = distinct !DILexicalBlock(scope: !1018, file: !3, line: 291, column: 3)
!1025 = !DILocation(line: 294, column: 7, scope: !1023)
!1026 = !DILocation(line: 291, column: 3, scope: !1024)
!1027 = distinct !{!1027, !1021, !1028}
!1028 = !DILocation(line: 295, column: 5, scope: !1018)
!1029 = !DILocation(line: 297, column: 23, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !951, file: !3, line: 297, column: 7)
!1031 = !DILocation(line: 297, column: 7, scope: !1030)
!1032 = !DILocation(line: 297, column: 7, scope: !951)
!1033 = !DILocation(line: 0, scope: !1034)
!1034 = distinct !DILexicalBlock(scope: !1035, file: !3, line: 299, column: 7)
!1035 = distinct !DILexicalBlock(scope: !1036, file: !3, line: 299, column: 7)
!1036 = distinct !DILexicalBlock(scope: !1030, file: !3, line: 298, column: 5)
!1037 = !DILocation(line: 299, column: 7, scope: !1035)
!1038 = !DILocation(line: 0, scope: !1036)
!1039 = !DILocation(line: 299, column: 39, scope: !1034)
!1040 = !DILocation(line: 299, column: 21, scope: !1034)
!1041 = !DILocation(line: 300, column: 35, scope: !1034)
!1042 = !DILocation(line: 300, column: 2, scope: !1034)
!1043 = !DILocation(line: 299, column: 47, scope: !1034)
!1044 = !DILocation(line: 299, column: 7, scope: !1034)
!1045 = distinct !{!1045, !1037, !1046}
!1046 = !DILocation(line: 300, column: 42, scope: !1035)
!1047 = !DILocation(line: 302, column: 13, scope: !1036)
!1048 = !DILocation(line: 302, column: 7, scope: !1036)
!1049 = !DILocation(line: 303, column: 5, scope: !1036)
!1050 = !DILocation(line: 304, column: 14, scope: !1051)
!1051 = distinct !DILexicalBlock(scope: !951, file: !3, line: 304, column: 7)
!1052 = !DILocation(line: 304, column: 7, scope: !1051)
!1053 = !DILocation(line: 304, column: 7, scope: !951)
!1054 = !DILocation(line: 0, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !1056, file: !3, line: 307, column: 2)
!1056 = distinct !DILexicalBlock(scope: !1051, file: !3, line: 305, column: 5)
!1057 = !DILocation(line: 306, column: 7, scope: !1056)
!1058 = !DILocation(line: 308, column: 20, scope: !1055)
!1059 = !DILocation(line: 309, column: 35, scope: !1055)
!1060 = !DILocation(line: 309, column: 25, scope: !1055)
!1061 = !DILocation(line: 310, column: 18, scope: !1055)
!1062 = !DILocation(line: 310, column: 4, scope: !1055)
!1063 = !DILocation(line: 311, column: 10, scope: !1055)
!1064 = !DILocation(line: 311, column: 4, scope: !1055)
!1065 = !DILocation(line: 313, column: 21, scope: !1056)
!1066 = !DILocation(line: 312, column: 2, scope: !1055)
!1067 = distinct !{!1067, !1057, !1068}
!1068 = !DILocation(line: 313, column: 34, scope: !1056)
!1069 = !DILocation(line: 316, column: 9, scope: !951)
!1070 = !DILocation(line: 316, column: 3, scope: !951)
!1071 = !DILocation(line: 317, column: 1, scope: !951)
!1072 = distinct !DISubprogram(name: "cpp_named_operator2name", scope: !3, file: !3, line: 403, type: !1073, scopeLine: 404, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1075)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{!180, !42}
!1075 = !{!1076, !1077}
!1076 = !DILocalVariable(name: "type", arg: 1, scope: !1072, file: !3, line: 403, type: !42)
!1077 = !DILocalVariable(name: "b", scope: !1072, file: !3, line: 405, type: !1078)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!1079 = !DILocation(line: 0, scope: !1072)
!1080 = !DILocation(line: 407, column: 8, scope: !1081)
!1081 = distinct !DILexicalBlock(scope: !1072, file: !3, line: 407, column: 3)
!1082 = !DILocation(line: 0, scope: !1081)
!1083 = !DILocation(line: 408, column: 10, scope: !1084)
!1084 = distinct !DILexicalBlock(scope: !1081, file: !3, line: 407, column: 3)
!1085 = !DILocation(line: 407, column: 3, scope: !1081)
!1086 = !DILocation(line: 411, column: 22, scope: !1087)
!1087 = distinct !DILexicalBlock(scope: !1088, file: !3, line: 411, column: 11)
!1088 = distinct !DILexicalBlock(scope: !1084, file: !3, line: 410, column: 5)
!1089 = !DILocation(line: 411, column: 19, scope: !1087)
!1090 = !DILocation(line: 411, column: 16, scope: !1087)
!1091 = !DILocation(line: 411, column: 11, scope: !1088)
!1092 = !DILocation(line: 412, column: 27, scope: !1087)
!1093 = !DILocation(line: 412, column: 2, scope: !1087)
!1094 = !DILocation(line: 409, column: 9, scope: !1084)
!1095 = !DILocation(line: 407, column: 3, scope: !1084)
!1096 = distinct !{!1096, !1085, !1097}
!1097 = !DILocation(line: 413, column: 5, scope: !1081)
!1098 = !DILocation(line: 416, column: 1, scope: !1072)
!1099 = distinct !DISubprogram(name: "cpp_init_special_builtins", scope: !3, file: !3, line: 419, type: !556, scopeLine: 420, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1100)
!1100 = !{!1101, !1102, !1104, !1105}
!1101 = !DILocalVariable(name: "pfile", arg: 1, scope: !1099, file: !3, line: 419, type: !124)
!1102 = !DILocalVariable(name: "b", scope: !1099, file: !3, line: 421, type: !1103)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!1104 = !DILocalVariable(name: "n", scope: !1099, file: !3, line: 422, type: !208)
!1105 = !DILocalVariable(name: "hp", scope: !1106, file: !3, line: 432, type: !311)
!1106 = distinct !DILexicalBlock(scope: !1107, file: !3, line: 431, column: 5)
!1107 = distinct !DILexicalBlock(scope: !1108, file: !3, line: 430, column: 3)
!1108 = distinct !DILexicalBlock(scope: !1099, file: !3, line: 430, column: 3)
!1109 = !DILocation(line: 0, scope: !1099)
!1110 = !DILocation(line: 424, column: 7, scope: !1111)
!1111 = distinct !DILexicalBlock(scope: !1099, file: !3, line: 424, column: 7)
!1112 = !DILocation(line: 424, column: 7, scope: !1099)
!1113 = !DILocation(line: 425, column: 5, scope: !1111)
!1114 = !DILocation(line: 426, column: 14, scope: !1115)
!1115 = distinct !DILexicalBlock(scope: !1111, file: !3, line: 426, column: 12)
!1116 = !DILocation(line: 427, column: 5, scope: !1115)
!1117 = !DILocation(line: 427, column: 8, scope: !1115)
!1118 = !DILocation(line: 426, column: 12, scope: !1111)
!1119 = !DILocation(line: 428, column: 5, scope: !1115)
!1120 = !DILocation(line: 0, scope: !1111)
!1121 = !DILocation(line: 0, scope: !1107)
!1122 = !DILocation(line: 0, scope: !1123)
!1123 = distinct !DILexicalBlock(scope: !1106, file: !3, line: 435, column: 11)
!1124 = !DILocation(line: 430, column: 8, scope: !1108)
!1125 = !DILocation(line: 0, scope: !1108)
!1126 = !DILocation(line: 430, column: 29, scope: !1107)
!1127 = !DILocation(line: 430, column: 3, scope: !1108)
!1128 = !DILocation(line: 432, column: 48, scope: !1106)
!1129 = !DILocation(line: 432, column: 57, scope: !1106)
!1130 = !DILocation(line: 432, column: 54, scope: !1106)
!1131 = !DILocation(line: 432, column: 26, scope: !1106)
!1132 = !DILocation(line: 0, scope: !1106)
!1133 = !DILocation(line: 433, column: 11, scope: !1106)
!1134 = !DILocation(line: 433, column: 16, scope: !1106)
!1135 = !DILocation(line: 434, column: 17, scope: !1106)
!1136 = !DILocation(line: 435, column: 14, scope: !1123)
!1137 = !DILocation(line: 435, column: 11, scope: !1123)
!1138 = !DILocation(line: 436, column: 11, scope: !1123)
!1139 = !DILocation(line: 436, column: 14, scope: !1123)
!1140 = !DILocation(line: 435, column: 11, scope: !1106)
!1141 = !DILocation(line: 437, column: 12, scope: !1123)
!1142 = !DILocation(line: 437, column: 2, scope: !1123)
!1143 = !DILocation(line: 438, column: 54, scope: !1106)
!1144 = !DILocation(line: 438, column: 27, scope: !1106)
!1145 = !DILocation(line: 438, column: 11, scope: !1106)
!1146 = !DILocation(line: 438, column: 17, scope: !1106)
!1147 = !DILocation(line: 438, column: 25, scope: !1106)
!1148 = !DILocation(line: 430, column: 51, scope: !1107)
!1149 = !DILocation(line: 430, column: 3, scope: !1107)
!1150 = distinct !{!1150, !1127, !1151}
!1151 = !DILocation(line: 439, column: 5, scope: !1108)
!1152 = !DILocation(line: 440, column: 1, scope: !1099)
!1153 = distinct !DISubprogram(name: "cpp_init_builtins", scope: !3, file: !3, line: 446, type: !1154, scopeLine: 447, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1156)
!1154 = !DISubroutineType(types: !1155)
!1155 = !{null, !124, !123}
!1156 = !{!1157, !1158}
!1157 = !DILocalVariable(name: "pfile", arg: 1, scope: !1153, file: !3, line: 446, type: !124)
!1158 = !DILocalVariable(name: "hosted", arg: 2, scope: !1153, file: !3, line: 446, type: !123)
!1159 = !DILocation(line: 0, scope: !1153)
!1160 = !DILocation(line: 448, column: 3, scope: !1153)
!1161 = !DILocation(line: 450, column: 8, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !1153, file: !3, line: 450, column: 7)
!1163 = !DILocation(line: 451, column: 7, scope: !1162)
!1164 = !DILocation(line: 451, column: 13, scope: !1162)
!1165 = !DILocation(line: 452, column: 4, scope: !1162)
!1166 = !DILocation(line: 452, column: 7, scope: !1162)
!1167 = !DILocation(line: 450, column: 7, scope: !1153)
!1168 = !DILocation(line: 453, column: 5, scope: !1162)
!1169 = !DILocation(line: 455, column: 7, scope: !1170)
!1170 = distinct !DILexicalBlock(scope: !1153, file: !3, line: 455, column: 7)
!1171 = !DILocation(line: 455, column: 7, scope: !1153)
!1172 = !DILocation(line: 456, column: 5, scope: !1170)
!1173 = !DILocation(line: 457, column: 12, scope: !1174)
!1174 = distinct !DILexicalBlock(scope: !1170, file: !3, line: 457, column: 12)
!1175 = !DILocation(line: 457, column: 37, scope: !1174)
!1176 = !DILocation(line: 457, column: 12, scope: !1170)
!1177 = !DILocation(line: 458, column: 5, scope: !1174)
!1178 = !DILocation(line: 459, column: 37, scope: !1179)
!1179 = distinct !DILexicalBlock(scope: !1174, file: !3, line: 459, column: 12)
!1180 = !DILocation(line: 459, column: 12, scope: !1174)
!1181 = !DILocation(line: 460, column: 5, scope: !1179)
!1182 = !DILocation(line: 461, column: 12, scope: !1183)
