; ModuleID = 'cpp_lex.bc'
source_filename = "cpp_lex.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.token_spelling = type { i32, i8* }
%struct.cpp_token = type { i32, i8, i16, %union.cpp_token_u }
%union.cpp_token_u = type { %struct.cpp_string }
%struct.cpp_string = type { i32, i8* }
%struct.cpp_hashnode = type { %struct.ht_identifier, i8, i8, i16, %union._cpp_hashnode_value }
%struct.ht_identifier = type { i8*, i32, i32 }
%union._cpp_hashnode_value = type { %struct.cpp_macro* }
%struct.cpp_macro = type { %struct.cpp_hashnode**, %union.cpp_macro_u, i32, i32, i16, i8 }
%union.cpp_macro_u = type { %struct.cpp_token* }

!76 = !DIEnumerator(name: "CPP_AND_EQ", value: 32, isUnsigned: true)
!77 = !DIEnumerator(name: "CPP_OR_EQ", value: 33, isUnsigned: true)
!78 = !DIEnumerator(name: "CPP_XOR_EQ", value: 34, isUnsigned: true)
!79 = !DIEnumerator(name: "CPP_RSHIFT_EQ", value: 35, isUnsigned: true)
!80 = !DIEnumerator(name: "CPP_LSHIFT_EQ", value: 36, isUnsigned: true)
!81 = !DIEnumerator(name: "CPP_HASH", value: 37, isUnsigned: true)
!82 = !DIEnumerator(name: "CPP_PASTE", value: 38, isUnsigned: true)
!83 = !DIEnumerator(name: "CPP_OPEN_SQUARE", value: 39, isUnsigned: true)
!84 = !DIEnumerator(name: "CPP_CLOSE_SQUARE", value: 40, isUnsigned: true)
!85 = !DIEnumerator(name: "CPP_OPEN_BRACE", value: 41, isUnsigned: true)
!86 = !DIEnumerator(name: "CPP_CLOSE_BRACE", value: 42, isUnsigned: true)
!87 = !DIEnumerator(name: "CPP_SEMICOLON", value: 43, isUnsigned: true)
!88 = !DIEnumerator(name: "CPP_ELLIPSIS", value: 44, isUnsigned: true)
!89 = !DIEnumerator(name: "CPP_PLUS_PLUS", value: 45, isUnsigned: true)
!90 = !DIEnumerator(name: "CPP_MINUS_MINUS", value: 46, isUnsigned: true)
!91 = !DIEnumerator(name: "CPP_DEREF", value: 47, isUnsigned: true)
!92 = !DIEnumerator(name: "CPP_DOT", value: 48, isUnsigned: true)
!93 = !DIEnumerator(name: "CPP_SCOPE", value: 49, isUnsigned: true)
!94 = !DIEnumerator(name: "CPP_DEREF_STAR", value: 50, isUnsigned: true)
!95 = !DIEnumerator(name: "CPP_DOT_STAR", value: 51, isUnsigned: true)
!96 = !DIEnumerator(name: "CPP_ATSIGN", value: 52, isUnsigned: true)
!97 = !DIEnumerator(name: "CPP_NAME", value: 53, isUnsigned: true)
!98 = !DIEnumerator(name: "CPP_AT_NAME", value: 54, isUnsigned: true)
!99 = !DIEnumerator(name: "CPP_NUMBER", value: 55, isUnsigned: true)
!100 = !DIEnumerator(name: "CPP_CHAR", value: 56, isUnsigned: true)
!101 = !DIEnumerator(name: "CPP_WCHAR", value: 57, isUnsigned: true)
!102 = !DIEnumerator(name: "CPP_CHAR16", value: 58, isUnsigned: true)
!103 = !DIEnumerator(name: "CPP_CHAR32", value: 59, isUnsigned: true)
!104 = !DIEnumerator(name: "CPP_OTHER", value: 60, isUnsigned: true)
!105 = !DIEnumerator(name: "CPP_STRING", value: 61, isUnsigned: true)
!106 = !DIEnumerator(name: "CPP_WSTRING", value: 62, isUnsigned: true)
!107 = !DIEnumerator(name: "CPP_STRING16", value: 63, isUnsigned: true)
!108 = !DIEnumerator(name: "CPP_STRING32", value: 64, isUnsigned: true)
!109 = !DIEnumerator(name: "CPP_UTF8STRING", value: 65, isUnsigned: true)
!110 = !DIEnumerator(name: "CPP_OBJC_STRING", value: 66, isUnsigned: true)
!111 = !DIEnumerator(name: "CPP_HEADER_NAME", value: 67, isUnsigned: true)
!112 = !DIEnumerator(name: "CPP_COMMENT", value: 68, isUnsigned: true)
!113 = !DIEnumerator(name: "CPP_MACRO_ARG", value: 69, isUnsigned: true)
!114 = !DIEnumerator(name: "CPP_PRAGMA", value: 70, isUnsigned: true)
!115 = !DIEnumerator(name: "CPP_PRAGMA_EOL", value: 71, isUnsigned: true)
!116 = !DIEnumerator(name: "CPP_PADDING", value: 72, isUnsigned: true)
!117 = !DIEnumerator(name: "N_TTYPES", value: 73, isUnsigned: true)
!118 = !DIEnumerator(name: "CPP_LAST_EQ", value: 13, isUnsigned: true)
!119 = !DIEnumerator(name: "CPP_FIRST_DIGRAPH", value: 37, isUnsigned: true)
!120 = !DIEnumerator(name: "CPP_LAST_PUNCTUATOR", value: 52, isUnsigned: true)
!121 = !DIEnumerator(name: "CPP_LAST_CPP_OP", value: 26, isUnsigned: true)
!122 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cpp_token_fld_kind", file: !6, line: 184, baseType: !7, size: 32, elements: !123)
!123 = !{!124, !125, !126, !127, !128, !129, !130}
!124 = !DIEnumerator(name: "CPP_TOKEN_FLD_NODE", value: 0, isUnsigned: true)
!125 = !DIEnumerator(name: "CPP_TOKEN_FLD_SOURCE", value: 1, isUnsigned: true)
!126 = !DIEnumerator(name: "CPP_TOKEN_FLD_STR", value: 2, isUnsigned: true)
!127 = !DIEnumerator(name: "CPP_TOKEN_FLD_ARG_NO", value: 3, isUnsigned: true)
!128 = !DIEnumerator(name: "CPP_TOKEN_FLD_TOKEN_NO", value: 4, isUnsigned: true)
!129 = !DIEnumerator(name: "CPP_TOKEN_FLD_PRAGMA", value: 5, isUnsigned: true)
!130 = !DIEnumerator(name: "CPP_TOKEN_FLD_NONE", value: 6, isUnsigned: true)
!131 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "spell_type", file: !3, line: 29, baseType: !7, size: 32, elements: !132)
!132 = !{!133, !134, !135, !136}
!133 = !DIEnumerator(name: "SPELL_OPERATOR", value: 0, isUnsigned: true)
!134 = !DIEnumerator(name: "SPELL_IDENT", value: 1, isUnsigned: true)
!135 = !DIEnumerator(name: "SPELL_LITERAL", value: 2, isUnsigned: true)
!136 = !DIEnumerator(name: "SPELL_NONE", value: 3, isUnsigned: true)
!137 = !{!138, !143, !144, !145, !146, !147, !229, !42, !232, !235, !236, !237, !239, !163, !246, !254, !260}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !141, line: 22, baseType: !142)
!141 = !DIFile(filename: "./cpp-id-data.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!142 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!145 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!146 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_token", file: !6, line: 34, baseType: !149)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_token", file: !6, line: 212, size: 192, elements: !150)
!150 = !{!151, !154, !155, !156}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "src_loc", scope: !149, file: !6, line: 213, baseType: !152, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !153, line: 44, baseType: !7)
!153 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!154 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !149, file: !6, line: 214, baseType: !7, size: 8, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !149, file: !6, line: 215, baseType: !145, size: 16, offset: 48)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !149, file: !6, line: 237, baseType: !157, size: 128, offset: 64)
!157 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cpp_token_u", file: !6, line: 217, size: 128, elements: !158)
!158 = !{!159, !217, !218, !223, !227, !228}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !157, file: !6, line: 220, baseType: !160, size: 64)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_identifier", file: !6, line: 201, size: 64, elements: !161)
!161 = !{!162}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !160, file: !6, line: 207, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_hashnode", file: !6, line: 36, baseType: !165)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_hashnode", file: !6, line: 644, size: 256, elements: !166)
!166 = !{!167, !176, !177, !178, !179, !180, !181}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !165, file: !6, line: 645, baseType: !168, size: 128)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !169, line: 31, size: 128, elements: !170)
!169 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!170 = !{!171, !174, !175}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !168, file: !169, line: 32, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !168, file: !169, line: 33, baseType: !7, size: 32, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !168, file: !169, line: 34, baseType: !7, size: 32, offset: 96)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "is_directive", scope: !165, file: !6, line: 646, baseType: !7, size: 1, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "directive_index", scope: !165, file: !6, line: 647, baseType: !7, size: 7, offset: 129, flags: DIFlagBitField, extraData: i64 128)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "rid_code", scope: !165, file: !6, line: 650, baseType: !142, size: 8, offset: 136)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !165, file: !6, line: 651, baseType: !7, size: 6, offset: 144, flags: DIFlagBitField, extraData: i64 144)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !165, file: !6, line: 652, baseType: !7, size: 10, offset: 150, flags: DIFlagBitField, extraData: i64 144)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !165, file: !6, line: 654, baseType: !182, size: 64, offset: 192)
!182 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_cpp_hashnode_value", file: !6, line: 633, size: 64, elements: !183)
!183 = !{!184, !205, !215, !216}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !182, file: !6, line: 635, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_macro", file: !6, line: 37, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_macro", file: !141, line: 36, size: 256, elements: !188)
!188 = !{!189, !191, !196, !197, !198, !199, !200, !201, !202, !203, !204}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !187, file: !141, line: 42, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !187, file: !141, line: 51, baseType: !192, size: 64, offset: 64)
!192 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cpp_macro_u", file: !141, line: 47, size: 64, elements: !193)
!193 = !{!194, !195}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "tokens", scope: !192, file: !141, line: 49, baseType: !147, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !192, file: !141, line: 50, baseType: !172, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !187, file: !141, line: 54, baseType: !152, size: 32, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !187, file: !141, line: 57, baseType: !7, size: 32, offset: 160)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "paramc", scope: !187, file: !141, line: 60, baseType: !145, size: 16, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "fun_like", scope: !187, file: !141, line: 63, baseType: !7, size: 1, offset: 208, flags: DIFlagBitField, extraData: i64 208)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "variadic", scope: !187, file: !141, line: 66, baseType: !7, size: 1, offset: 209, flags: DIFlagBitField, extraData: i64 208)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "syshdr", scope: !187, file: !141, line: 69, baseType: !7, size: 1, offset: 210, flags: DIFlagBitField, extraData: i64 208)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !187, file: !141, line: 72, baseType: !7, size: 1, offset: 211, flags: DIFlagBitField, extraData: i64 208)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "traditional", scope: !187, file: !141, line: 75, baseType: !7, size: 1, offset: 212, flags: DIFlagBitField, extraData: i64 208)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "extra_tokens", scope: !187, file: !141, line: 80, baseType: !7, size: 1, offset: 213, flags: DIFlagBitField, extraData: i64 208)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "answers", scope: !182, file: !6, line: 637, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "answer", file: !141, line: 28, size: 320, elements: !208)
!208 = !{!209, !210, !211}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !207, file: !141, line: 29, baseType: !206, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !207, file: !141, line: 30, baseType: !7, size: 32, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !207, file: !141, line: 31, baseType: !212, size: 192, offset: 128)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 192, elements: !213)
!213 = !{!214}
!214 = !DISubrange(count: 1)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "builtin", scope: !182, file: !6, line: 639, baseType: !5, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "arg_index", scope: !182, file: !6, line: 641, baseType: !145, size: 16)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !157, file: !6, line: 223, baseType: !147, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !157, file: !6, line: 226, baseType: !219, size: 128)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_string", file: !6, line: 162, size: 128, elements: !220)
!220 = !{!221, !222}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !219, file: !6, line: 163, baseType: !7, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !219, file: !6, line: 164, baseType: !172, size: 64, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "macro_arg", scope: !157, file: !6, line: 229, baseType: !224, size: 32)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_macro_arg", file: !6, line: 195, size: 32, elements: !225)
!225 = !{!226}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "arg_no", scope: !224, file: !6, line: 197, baseType: !7, size: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "token_no", scope: !157, file: !6, line: 233, baseType: !7, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "pragma", scope: !157, file: !6, line: 236, baseType: !7, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !230, line: 35, baseType: !231)
!230 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!231 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !234)
!234 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !230, line: 46, baseType: !238)
!238 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cpp_line_note", file: !241, line: 235, baseType: !242)
!241 = !DIFile(filename: "./internal.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_line_note", file: !241, line: 236, size: 128, elements: !243)
!243 = !{!244, !245}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !242, file: !241, line: 239, baseType: !172, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !242, file: !241, line: 245, baseType: !7, size: 32, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "tokenrun", file: !241, line: 128, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tokenrun", file: !241, line: 129, size: 256, elements: !249)
!249 = !{!250, !251, !252, !253}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !248, file: !241, line: 131, baseType: !246, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !248, file: !241, line: 131, baseType: !246, size: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !248, file: !241, line: 132, baseType: !147, size: 64, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !248, file: !241, line: 132, baseType: !147, size: 64, offset: 192)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_comment", file: !6, line: 887, baseType: !256)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 880, size: 128, elements: !257)
!257 = !{!258, !259}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !256, file: !6, line: 883, baseType: !236, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "sloc", scope: !256, file: !6, line: 886, baseType: !152, size: 32, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cpp_buff", file: !241, line: 99, baseType: !262)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_buff", file: !241, line: 100, size: 256, elements: !263)
!263 = !{!264, !266, !267, !268}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !262, file: !241, line: 102, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !262, file: !241, line: 103, baseType: !235, size: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !262, file: !241, line: 103, baseType: !235, size: 64, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !262, file: !241, line: 103, baseType: !235, size: 64, offset: 192)
!269 = !{!0, !270}
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "digraph_spellings", scope: !2, file: !3, line: 43, type: !272, isLocal: true, isDefinition: true)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !273, size: 384, elements: !274)
!273 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !172)
!274 = !{!275}
!275 = !DISubrange(count: 6)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 9344, elements: !282)
!277 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !278)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "token_spelling", file: !3, line: 37, size: 128, elements: !279)
!279 = !{!280, !281}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !278, file: !3, line: 39, baseType: !131, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !278, file: !3, line: 40, baseType: !172, size: 64, offset: 64)
!282 = !{!283}
!283 = !DISubrange(count: 73)
!284 = !{i32 2, !"Dwarf Version", i32 4}
!285 = !{i32 2, !"Debug Info Version", i32 3}
!286 = !{i32 1, !"wchar_size", i32 4}
!287 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!288 = distinct !DISubprogram(name: "tolower", scope: !289, file: !289, line: 207, type: !290, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !292)
!289 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!290 = !DISubroutineType(types: !291)
!291 = !{!146, !146}
!292 = !{!293}
!293 = !DILocalVariable(name: "__c", arg: 1, scope: !288, file: !289, line: 207, type: !146)
!294 = !DILocation(line: 0, scope: !288)
!295 = !DILocation(line: 209, column: 22, scope: !288)
!296 = !DILocation(line: 209, column: 39, scope: !288)
!297 = !DILocation(line: 209, column: 38, scope: !288)
!298 = !DILocation(line: 209, column: 37, scope: !288)
!299 = !DILocation(line: 209, column: 10, scope: !288)
!300 = !DILocation(line: 209, column: 3, scope: !288)
!301 = distinct !DISubprogram(name: "toupper", scope: !289, file: !289, line: 213, type: !290, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !302)
!302 = !{!303}
!303 = !DILocalVariable(name: "__c", arg: 1, scope: !301, file: !289, line: 213, type: !146)
!304 = !DILocation(line: 0, scope: !301)
!305 = !DILocation(line: 215, column: 22, scope: !301)
!306 = !DILocation(line: 215, column: 39, scope: !301)
!307 = !DILocation(line: 215, column: 38, scope: !301)
!308 = !DILocation(line: 215, column: 37, scope: !301)
!309 = !DILocation(line: 215, column: 10, scope: !301)
!310 = !DILocation(line: 215, column: 3, scope: !301)
!311 = distinct !DISubprogram(name: "cpp_ideq", scope: !3, file: !3, line: 75, type: !312, scopeLine: 76, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !316)
!312 = !DISubroutineType(types: !313)
!313 = !{!146, !314, !232}
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!316 = !{!317, !318}
!317 = !DILocalVariable(name: "token", arg: 1, scope: !311, file: !3, line: 75, type: !314)
!318 = !DILocalVariable(name: "string", arg: 2, scope: !311, file: !3, line: 75, type: !232)
!319 = !DILocation(line: 0, scope: !311)
!320 = !DILocation(line: 77, column: 14, scope: !321)
!321 = distinct !DILexicalBlock(scope: !311, file: !3, line: 77, column: 7)
!322 = !DILocation(line: 77, column: 19, scope: !321)
!323 = !DILocation(line: 77, column: 7, scope: !311)
!324 = !DILocation(line: 80, column: 20, scope: !311)
!325 = !DILocation(line: 80, column: 11, scope: !311)
!326 = !DILocation(line: 80, column: 10, scope: !311)
!327 = !DILocation(line: 80, column: 3, scope: !311)
!328 = !DILocation(line: 81, column: 1, scope: !311)
!329 = distinct !DISubprogram(name: "ustrcmp", scope: !241, file: !241, line: 687, type: !330, scopeLine: 688, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !332)
!330 = !DISubroutineType(types: !331)
!331 = !{!146, !172, !172}
!332 = !{!333, !334}
!333 = !DILocalVariable(name: "s1", arg: 1, scope: !329, file: !241, line: 687, type: !172)
!334 = !DILocalVariable(name: "s2", arg: 2, scope: !329, file: !241, line: 687, type: !172)
!335 = !DILocation(line: 0, scope: !329)
!336 = !DILocation(line: 689, column: 10, scope: !329)
!337 = !DILocation(line: 689, column: 3, scope: !329)
!338 = distinct !DISubprogram(name: "_cpp_clean_line", scope: !3, file: !3, line: 103, type: !339, scopeLine: 104, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !785)
!339 = !DISubroutineType(types: !340)
!340 = !{null, !341}
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_reader", file: !6, line: 31, baseType: !343)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_reader", file: !241, line: 322, size: 10432, elements: !344)
!344 = !{!345, !413, !414, !431, !461, !462, !463, !464, !465, !493, !495, !499, !500, !501, !502, !503, !504, !505, !506, !507, !510, !511, !514, !515, !547, !548, !549, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !573, !574, !575, !578, !656, !682, !685, !686, !749, !756, !757, !764, !765, !766, !767, !770, !771, !778}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !343, file: !241, line: 325, baseType: !346, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_buffer", file: !6, line: 32, baseType: !348)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_buffer", file: !241, line: 249, size: 1536, elements: !349)
!349 = !{!350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !361, !364, !365, !368, !369, !370, !371, !372, !373, !399}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !348, file: !241, line: 251, baseType: !172, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "line_base", scope: !348, file: !241, line: 252, baseType: !172, size: 64, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "next_line", scope: !348, file: !241, line: 253, baseType: !172, size: 64, offset: 128)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !348, file: !241, line: 255, baseType: !172, size: 64, offset: 192)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit", scope: !348, file: !241, line: 256, baseType: !172, size: 64, offset: 256)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "notes", scope: !348, file: !241, line: 258, baseType: !239, size: 64, offset: 320)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "cur_note", scope: !348, file: !241, line: 259, baseType: !7, size: 32, offset: 384)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "notes_used", scope: !348, file: !241, line: 260, baseType: !7, size: 32, offset: 416)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "notes_cap", scope: !348, file: !241, line: 261, baseType: !7, size: 32, offset: 448)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !348, file: !241, line: 263, baseType: !360, size: 64, offset: 512)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !348, file: !241, line: 267, baseType: !362, size: 64, offset: 576)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_file", file: !6, line: 42, flags: DIFlagFwdDecl)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !348, file: !241, line: 271, baseType: !172, size: 64, offset: 640)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "if_stack", scope: !348, file: !241, line: 275, baseType: !366, size: 64, offset: 704)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "if_stack", file: !241, line: 275, flags: DIFlagFwdDecl)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "need_line", scope: !348, file: !241, line: 278, baseType: !142, size: 8, offset: 768)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "warned_cplusplus_comments", scope: !348, file: !241, line: 284, baseType: !7, size: 1, offset: 776, flags: DIFlagBitField, extraData: i64 776)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "from_stage3", scope: !348, file: !241, line: 289, baseType: !7, size: 1, offset: 777, flags: DIFlagBitField, extraData: i64 776)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "return_at_eof", scope: !348, file: !241, line: 294, baseType: !7, size: 1, offset: 778, flags: DIFlagBitField, extraData: i64 776)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !348, file: !241, line: 298, baseType: !142, size: 8, offset: 784)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !348, file: !241, line: 302, baseType: !374, size: 512, offset: 832)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_dir", file: !6, line: 523, size: 512, elements: !375)
!375 = !{!376, !378, !379, !380, !381, !382, !383, !385, !391, !396}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !374, file: !6, line: 526, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !374, file: !6, line: 529, baseType: !236, size: 64, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !374, file: !6, line: 530, baseType: !7, size: 32, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !374, file: !6, line: 534, baseType: !142, size: 8, offset: 160)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "user_supplied_p", scope: !374, file: !6, line: 537, baseType: !142, size: 8, offset: 168)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "canonical_name", scope: !374, file: !6, line: 541, baseType: !236, size: 64, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "name_map", scope: !374, file: !6, line: 545, baseType: !384, size: 64, offset: 256)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "construct", scope: !374, file: !6, line: 551, baseType: !386, size: 64, offset: 320)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!236, !232, !389}
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_dir", file: !6, line: 39, baseType: !374)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !374, file: !6, line: 555, baseType: !392, size: 64, offset: 384)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !393, line: 47, baseType: !394)
!393 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !395, line: 148, baseType: !238)
!395 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!396 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !374, file: !6, line: 556, baseType: !397, size: 64, offset: 448)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !393, line: 59, baseType: !398)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !395, line: 145, baseType: !238)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "input_cset_desc", scope: !348, file: !241, line: 306, baseType: !400, size: 192, offset: 1344)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cset_converter", file: !241, line: 47, size: 192, elements: !401)
!401 = !{!402, !411, !412}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !400, file: !241, line: 49, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "convert_f", file: !241, line: 45, baseType: !404)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!142, !407, !172, !237, !409}
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "iconv_t", file: !408, line: 29, baseType: !144)
!408 = !DIFile(filename: "/usr/include/iconv.h", directory: "")
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_strbuf", file: !241, line: 43, flags: DIFlagFwdDecl)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "cd", scope: !400, file: !241, line: 50, baseType: !407, size: 64, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !400, file: !241, line: 51, baseType: !146, size: 32, offset: 128)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "overlaid_buffer", scope: !343, file: !241, line: 328, baseType: !346, size: 64, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !343, file: !241, line: 331, baseType: !415, size: 160, offset: 128)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lexer_state", file: !241, line: 177, size: 160, elements: !416)
!416 = !{!417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "in_directive", scope: !415, file: !241, line: 180, baseType: !142, size: 8)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "directive_wants_padding", scope: !415, file: !241, line: 185, baseType: !142, size: 8, offset: 8)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "skipping", scope: !415, file: !241, line: 188, baseType: !142, size: 8, offset: 16)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "angled_headers", scope: !415, file: !241, line: 191, baseType: !142, size: 8, offset: 24)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "in_expression", scope: !415, file: !241, line: 194, baseType: !142, size: 8, offset: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "save_comments", scope: !415, file: !241, line: 198, baseType: !142, size: 8, offset: 40)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "va_args_ok", scope: !415, file: !241, line: 201, baseType: !142, size: 8, offset: 48)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "poisoned_ok", scope: !415, file: !241, line: 204, baseType: !142, size: 8, offset: 56)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "prevent_expansion", scope: !415, file: !241, line: 207, baseType: !142, size: 8, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "parsing_args", scope: !415, file: !241, line: 210, baseType: !142, size: 8, offset: 72)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "discarding_output", scope: !415, file: !241, line: 214, baseType: !142, size: 8, offset: 80)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "skip_eval", scope: !415, file: !241, line: 217, baseType: !7, size: 32, offset: 96)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "in_deferred_pragma", scope: !415, file: !241, line: 220, baseType: !142, size: 8, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "pragma_allow_expansion", scope: !415, file: !241, line: 223, baseType: !142, size: 8, offset: 136)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "line_table", scope: !343, file: !241, line: 334, baseType: !432, size: 64, offset: 320)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line_maps", file: !153, line: 74, size: 448, elements: !434)
!434 = !{!435, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "maps", scope: !433, file: !153, line: 75, baseType: !436, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line_map", file: !153, line: 61, size: 192, elements: !438)
!438 = !{!439, !440, !442, !443, !444, !445, !446}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "to_file", scope: !437, file: !153, line: 62, baseType: !232, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "to_line", scope: !437, file: !153, line: 63, baseType: !441, size: 32, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "linenum_type", file: !153, line: 39, baseType: !7)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "start_location", scope: !437, file: !153, line: 64, baseType: !152, size: 32, offset: 96)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "included_from", scope: !437, file: !153, line: 65, baseType: !146, size: 32, offset: 128)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !437, file: !153, line: 66, baseType: !7, size: 8, offset: 160, flags: DIFlagBitField, extraData: i64 160)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !437, file: !153, line: 68, baseType: !142, size: 8, offset: 168)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "column_bits", scope: !437, file: !153, line: 70, baseType: !7, size: 8, offset: 176, flags: DIFlagBitField, extraData: i64 176)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !433, file: !153, line: 76, baseType: !7, size: 32, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !433, file: !153, line: 77, baseType: !7, size: 32, offset: 96)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !433, file: !153, line: 79, baseType: !7, size: 32, offset: 128)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "last_listed", scope: !433, file: !153, line: 84, baseType: !146, size: 32, offset: 160)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !433, file: !153, line: 87, baseType: !7, size: 32, offset: 192)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "trace_includes", scope: !433, file: !153, line: 90, baseType: !142, size: 8, offset: 224)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "highest_location", scope: !433, file: !153, line: 93, baseType: !152, size: 32, offset: 256)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "highest_line", scope: !433, file: !153, line: 96, baseType: !152, size: 32, offset: 288)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "max_column_hint", scope: !433, file: !153, line: 100, baseType: !7, size: 32, offset: 320)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "reallocator", scope: !433, file: !153, line: 104, baseType: !457, size: 64, offset: 384)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "line_map_realloc", file: !153, line: 47, baseType: !458)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{!144, !144, !237}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "directive_line", scope: !343, file: !241, line: 337, baseType: !152, size: 32, offset: 384)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "a_buff", scope: !343, file: !241, line: 340, baseType: !260, size: 64, offset: 448)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "u_buff", scope: !343, file: !241, line: 341, baseType: !260, size: 64, offset: 512)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "free_buffs", scope: !343, file: !241, line: 342, baseType: !260, size: 64, offset: 576)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "base_context", scope: !343, file: !241, line: 345, baseType: !466, size: 448, offset: 640)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_context", file: !241, line: 142, size: 448, elements: !467)
!467 = !{!468, !471, !472, !490, !491, !492}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !466, file: !241, line: 145, baseType: !469, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_context", file: !241, line: 141, baseType: !466)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !466, file: !241, line: 145, baseType: !469, size: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !466, file: !241, line: 164, baseType: !473, size: 128, offset: 128)
!473 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !466, file: !241, line: 147, size: 128, elements: !474)
!474 = !{!475, !485}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "iso", scope: !473, file: !241, line: 156, baseType: !476, size: 128)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !473, file: !241, line: 152, size: 128, elements: !477)
!477 = !{!478, !484}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !476, file: !241, line: 154, baseType: !479, size: 64)
!479 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "utoken", file: !241, line: 121, size: 64, elements: !480)
!480 = !{!481, !482}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !479, file: !241, line: 123, baseType: !314, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "ptoken", scope: !479, file: !241, line: 124, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !476, file: !241, line: 155, baseType: !479, size: 64, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "trad", scope: !473, file: !241, line: 163, baseType: !486, size: 128)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !473, file: !241, line: 159, size: 128, elements: !487)
!487 = !{!488, !489}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !486, file: !241, line: 161, baseType: !172, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit", scope: !486, file: !241, line: 162, baseType: !172, size: 64, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !466, file: !241, line: 168, baseType: !260, size: 64, offset: 256)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !466, file: !241, line: 171, baseType: !163, size: 64, offset: 320)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "direct_p", scope: !466, file: !241, line: 174, baseType: !142, size: 8, offset: 384)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !343, file: !241, line: 346, baseType: !494, size: 64, offset: 1088)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "directive", scope: !343, file: !241, line: 349, baseType: !496, size: 64, offset: 1152)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !498)
!498 = !DICompositeType(tag: DW_TAG_structure_type, name: "directive", file: !241, line: 40, flags: DIFlagFwdDecl)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "directive_result", scope: !343, file: !241, line: 352, baseType: !148, size: 192, offset: 1216)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "invocation_location", scope: !343, file: !241, line: 356, baseType: !152, size: 32, offset: 1408)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "set_invocation_location", scope: !343, file: !241, line: 360, baseType: !142, size: 8, offset: 1440)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "quote_include", scope: !343, file: !241, line: 363, baseType: !377, size: 64, offset: 1472)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "bracket_include", scope: !343, file: !241, line: 364, baseType: !377, size: 64, offset: 1536)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "no_search_path", scope: !343, file: !241, line: 365, baseType: !374, size: 512, offset: 1600)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "all_files", scope: !343, file: !241, line: 368, baseType: !362, size: 64, offset: 2112)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "main_file", scope: !343, file: !241, line: 370, baseType: !362, size: 64, offset: 2176)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "file_hash", scope: !343, file: !241, line: 373, baseType: !508, size: 64, offset: 2240)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !241, line: 373, flags: DIFlagFwdDecl)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "dir_hash", scope: !343, file: !241, line: 374, baseType: !508, size: 64, offset: 2304)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "file_hash_entries", scope: !343, file: !241, line: 375, baseType: !512, size: 64, offset: 2368)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DICompositeType(tag: DW_TAG_structure_type, name: "file_hash_entry_pool", file: !241, line: 375, flags: DIFlagFwdDecl)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "nonexistent_file_hash", scope: !343, file: !241, line: 378, baseType: !508, size: 64, offset: 2432)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "nonexistent_file_ob", scope: !343, file: !241, line: 379, baseType: !516, size: 704, offset: 2496)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !517, line: 164, size: 704, elements: !518)
!517 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!518 = !{!519, !520, !530, !531, !532, !533, !534, !535, !539, !543, !544, !545, !546}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !516, file: !517, line: 166, baseType: !231, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !516, file: !517, line: 167, baseType: !521, size: 64, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !517, line: 157, size: 192, elements: !523)
!523 = !{!524, !525, !526}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !522, file: !517, line: 159, baseType: !236, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !522, file: !517, line: 160, baseType: !521, size: 64, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !522, file: !517, line: 161, baseType: !527, size: 32, offset: 128)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 32, elements: !528)
!528 = !{!529}
!529 = !DISubrange(count: 4)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !516, file: !517, line: 168, baseType: !236, size: 64, offset: 128)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !516, file: !517, line: 169, baseType: !236, size: 64, offset: 192)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !516, file: !517, line: 170, baseType: !236, size: 64, offset: 256)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !516, file: !517, line: 171, baseType: !231, size: 64, offset: 320)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !516, file: !517, line: 172, baseType: !146, size: 32, offset: 384)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !516, file: !517, line: 176, baseType: !536, size: 64, offset: 448)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{!521, !144, !231}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !516, file: !517, line: 177, baseType: !540, size: 64, offset: 512)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DISubroutineType(types: !542)
!542 = !{null, !144, !521}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !516, file: !517, line: 178, baseType: !144, size: 64, offset: 576)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !516, file: !517, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !516, file: !517, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !516, file: !517, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "quote_ignores_source_dir", scope: !343, file: !241, line: 383, baseType: !142, size: 8, offset: 3200)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "seen_once_only", scope: !343, file: !241, line: 387, baseType: !142, size: 8, offset: 3208)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "mi_cmacro", scope: !343, file: !241, line: 390, baseType: !550, size: 64, offset: 3264)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !164)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "mi_ind_cmacro", scope: !343, file: !241, line: 391, baseType: !550, size: 64, offset: 3328)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "mi_valid", scope: !343, file: !241, line: 392, baseType: !142, size: 8, offset: 3392)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "cur_token", scope: !343, file: !241, line: 395, baseType: !147, size: 64, offset: 3456)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "base_run", scope: !343, file: !241, line: 396, baseType: !247, size: 256, offset: 3520)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "cur_run", scope: !343, file: !241, line: 396, baseType: !246, size: 64, offset: 3776)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "lookaheads", scope: !343, file: !241, line: 397, baseType: !7, size: 32, offset: 3840)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "keep_tokens", scope: !343, file: !241, line: 400, baseType: !7, size: 32, offset: 3872)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "macro_buffer", scope: !343, file: !241, line: 403, baseType: !235, size: 64, offset: 3904)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "macro_buffer_len", scope: !343, file: !241, line: 404, baseType: !7, size: 32, offset: 3968)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "narrow_cset_desc", scope: !343, file: !241, line: 408, baseType: !400, size: 192, offset: 4032)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_cset_desc", scope: !343, file: !241, line: 412, baseType: !400, size: 192, offset: 4224)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "char16_cset_desc", scope: !343, file: !241, line: 416, baseType: !400, size: 192, offset: 4416)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "char32_cset_desc", scope: !343, file: !241, line: 420, baseType: !400, size: 192, offset: 4608)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "wide_cset_desc", scope: !343, file: !241, line: 424, baseType: !400, size: 192, offset: 4800)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !343, file: !241, line: 427, baseType: !172, size: 64, offset: 4992)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !343, file: !241, line: 428, baseType: !172, size: 64, offset: 5056)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "avoid_paste", scope: !343, file: !241, line: 431, baseType: !148, size: 192, offset: 5120)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !343, file: !241, line: 432, baseType: !148, size: 192, offset: 5312)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "deps", scope: !343, file: !241, line: 435, baseType: !571, size: 64, offset: 5504)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DICompositeType(tag: DW_TAG_structure_type, name: "deps", file: !6, line: 685, flags: DIFlagFwdDecl)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "hash_ob", scope: !343, file: !241, line: 439, baseType: !516, size: 704, offset: 5568)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_ob", scope: !343, file: !241, line: 443, baseType: !516, size: 704, offset: 6272)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "pragmas", scope: !343, file: !241, line: 447, baseType: !576, size: 64, offset: 6976)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DICompositeType(tag: DW_TAG_structure_type, name: "pragma_entry", file: !241, line: 447, flags: DIFlagFwdDecl)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !343, file: !241, line: 450, baseType: !579, size: 1088, offset: 7040)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_callbacks", file: !6, line: 472, size: 1088, elements: !580)
!580 = !{!581, !585, !591, !595, !599, !603, !604, !611, !615, !619, !623, !629, !633, !648, !649, !650, !652}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "line_change", scope: !579, file: !6, line: 475, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{null, !341, !314, !146}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "file_change", scope: !579, file: !6, line: 481, baseType: !586, size: 64, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DISubroutineType(types: !588)
!588 = !{null, !341, !589}
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !437)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "dir_change", scope: !579, file: !6, line: 483, baseType: !592, size: 64, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DISubroutineType(types: !594)
!594 = !{null, !341, !232}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "include", scope: !579, file: !6, line: 484, baseType: !596, size: 64, offset: 192)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DISubroutineType(types: !598)
!598 = !{null, !341, !7, !172, !232, !146, !483}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "define", scope: !579, file: !6, line: 486, baseType: !600, size: 64, offset: 256)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DISubroutineType(types: !602)
!602 = !{null, !341, !7, !163}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "undef", scope: !579, file: !6, line: 487, baseType: !600, size: 64, offset: 320)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !579, file: !6, line: 488, baseType: !605, size: 64, offset: 384)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DISubroutineType(types: !607)
!607 = !{null, !341, !7, !608}
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !610)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_string", file: !6, line: 35, baseType: !219)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "def_pragma", scope: !579, file: !6, line: 489, baseType: !612, size: 64, offset: 448)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DISubroutineType(types: !614)
!614 = !{null, !341, !7}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "valid_pch", scope: !579, file: !6, line: 490, baseType: !616, size: 64, offset: 512)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DISubroutineType(types: !618)
!618 = !{!146, !341, !232, !146}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "read_pch", scope: !579, file: !6, line: 491, baseType: !620, size: 64, offset: 576)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{null, !341, !232, !146, !232}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "missing_header", scope: !579, file: !6, line: 492, baseType: !624, size: 64, offset: 640)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "missing_header_cb", file: !6, line: 469, baseType: !625)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!232, !341, !232, !628}
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "macro_to_expand", scope: !579, file: !6, line: 496, baseType: !630, size: 64, offset: 704)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{!163, !341, !314}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !579, file: !6, line: 500, baseType: !634, size: 64, offset: 768)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!142, !341, !146, !152, !7, !232, !637}
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !639, line: 14, baseType: !640)
!639 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stdarg.h", directory: "")
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 81, baseType: !641)
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !642, size: 192, elements: !213)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 81, size: 192, elements: !643)
!643 = !{!644, !645, !646, !647}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !642, file: !3, line: 81, baseType: !7, size: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !642, file: !3, line: 81, baseType: !7, size: 32, offset: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !642, file: !3, line: 81, baseType: !144, size: 64, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !642, file: !3, line: 81, baseType: !144, size: 64, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "used_define", scope: !579, file: !6, line: 506, baseType: !600, size: 64, offset: 832)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "used_undef", scope: !579, file: !6, line: 507, baseType: !600, size: 64, offset: 896)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "before_define", scope: !579, file: !6, line: 510, baseType: !651, size: 64, offset: 960)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !579, file: !6, line: 513, baseType: !653, size: 64, offset: 1024)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DISubroutineType(types: !655)
!655 = !{null, !341, !152, !163}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "hash_table", scope: !343, file: !241, line: 453, baseType: !657, size: 64, offset: 8128)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht", file: !169, line: 46, size: 1152, elements: !659)
!659 = !{!660, !661, !665, !671, !675, !676, !677, !679, !680, !681}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !658, file: !169, line: 49, baseType: !516, size: 704)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !658, file: !169, line: 51, baseType: !662, size: 64, offset: 704)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashnode", file: !169, line: 41, baseType: !664)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_node", scope: !658, file: !169, line: 53, baseType: !666, size: 64, offset: 768)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DISubroutineType(types: !668)
!668 = !{!663, !669}
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_table", file: !169, line: 40, baseType: !658)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_subobject", scope: !658, file: !169, line: 56, baseType: !672, size: 64, offset: 832)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DISubroutineType(types: !674)
!674 = !{!144, !237}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "nslots", scope: !658, file: !169, line: 58, baseType: !7, size: 32, offset: 896)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "nelements", scope: !658, file: !169, line: 59, baseType: !7, size: 32, offset: 928)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "pfile", scope: !658, file: !169, line: 62, baseType: !678, size: 64, offset: 960)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !658, file: !169, line: 65, baseType: !7, size: 32, offset: 1024)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !658, file: !169, line: 66, baseType: !7, size: 32, offset: 1056)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "entries_owned", scope: !658, file: !169, line: 69, baseType: !142, size: 8, offset: 1088)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "op_stack", scope: !343, file: !241, line: 456, baseType: !683, size: 64, offset: 8192)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DICompositeType(tag: DW_TAG_structure_type, name: "op", file: !241, line: 42, flags: DIFlagFwdDecl)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "op_limit", scope: !343, file: !241, line: 456, baseType: !683, size: 64, offset: 8256)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !343, file: !241, line: 459, baseType: !687, size: 1024, offset: 8320)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_options", file: !6, line: 279, size: 1024, elements: !688)
!688 = !{!689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !740, !741, !742, !743, !744, !745, !746, !747, !748}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "tabstop", scope: !687, file: !6, line: 282, baseType: !7, size: 32)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "lang", scope: !687, file: !6, line: 285, baseType: !19, size: 32, offset: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "cplusplus", scope: !687, file: !6, line: 288, baseType: !142, size: 8, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "cplusplus_comments", scope: !687, file: !6, line: 291, baseType: !142, size: 8, offset: 72)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "objc", scope: !687, file: !6, line: 296, baseType: !142, size: 8, offset: 80)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "discard_comments", scope: !687, file: !6, line: 299, baseType: !142, size: 8, offset: 88)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "discard_comments_in_macro_exp", scope: !687, file: !6, line: 303, baseType: !142, size: 8, offset: 96)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "trigraphs", scope: !687, file: !6, line: 306, baseType: !142, size: 8, offset: 104)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "digraphs", scope: !687, file: !6, line: 309, baseType: !142, size: 8, offset: 112)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "extended_numbers", scope: !687, file: !6, line: 312, baseType: !142, size: 8, offset: 120)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "uliterals", scope: !687, file: !6, line: 315, baseType: !142, size: 8, offset: 128)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "print_include_names", scope: !687, file: !6, line: 318, baseType: !142, size: 8, offset: 136)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "warn_deprecated", scope: !687, file: !6, line: 321, baseType: !142, size: 8, offset: 144)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "warn_comments", scope: !687, file: !6, line: 324, baseType: !142, size: 8, offset: 152)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "warn_missing_include_dirs", scope: !687, file: !6, line: 328, baseType: !142, size: 8, offset: 160)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "warn_trigraphs", scope: !687, file: !6, line: 331, baseType: !142, size: 8, offset: 168)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "warn_multichar", scope: !687, file: !6, line: 334, baseType: !142, size: 8, offset: 176)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "warn_traditional", scope: !687, file: !6, line: 338, baseType: !142, size: 8, offset: 184)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "warn_long_long", scope: !687, file: !6, line: 341, baseType: !142, size: 8, offset: 192)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "warn_endif_labels", scope: !687, file: !6, line: 344, baseType: !142, size: 8, offset: 200)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "warn_num_sign_change", scope: !687, file: !6, line: 348, baseType: !142, size: 8, offset: 208)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "warn_variadic_macros", scope: !687, file: !6, line: 352, baseType: !142, size: 8, offset: 216)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "warn_builtin_macro_redefined", scope: !687, file: !6, line: 356, baseType: !142, size: 8, offset: 224)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !687, file: !6, line: 360, baseType: !142, size: 8, offset: 232)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "dollars_in_ident", scope: !687, file: !6, line: 363, baseType: !142, size: 8, offset: 240)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "extended_identifiers", scope: !687, file: !6, line: 366, baseType: !142, size: 8, offset: 248)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "warn_dollars", scope: !687, file: !6, line: 370, baseType: !142, size: 8, offset: 256)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "warn_undef", scope: !687, file: !6, line: 373, baseType: !142, size: 8, offset: 264)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "warn_unused_macros", scope: !687, file: !6, line: 376, baseType: !142, size: 8, offset: 272)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "c99", scope: !687, file: !6, line: 379, baseType: !142, size: 8, offset: 280)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "std", scope: !687, file: !6, line: 382, baseType: !142, size: 8, offset: 288)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "pedantic", scope: !687, file: !6, line: 385, baseType: !142, size: 8, offset: 296)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "preprocessed", scope: !687, file: !6, line: 389, baseType: !142, size: 8, offset: 304)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "show_column", scope: !687, file: !6, line: 392, baseType: !142, size: 8, offset: 312)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "operator_names", scope: !687, file: !6, line: 395, baseType: !142, size: 8, offset: 320)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "warn_cxx_operator_names", scope: !687, file: !6, line: 398, baseType: !142, size: 8, offset: 328)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "traditional", scope: !687, file: !6, line: 401, baseType: !142, size: 8, offset: 336)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "narrow_charset", scope: !687, file: !6, line: 404, baseType: !232, size: 64, offset: 384)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "wide_charset", scope: !687, file: !6, line: 407, baseType: !232, size: 64, offset: 448)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "input_charset", scope: !687, file: !6, line: 410, baseType: !232, size: 64, offset: 512)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "warn_normalize", scope: !687, file: !6, line: 414, baseType: !31, size: 32, offset: 576)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "warn_invalid_pch", scope: !687, file: !6, line: 417, baseType: !142, size: 8, offset: 608)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "restore_pch_deps", scope: !687, file: !6, line: 420, baseType: !142, size: 8, offset: 616)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "deps", scope: !687, file: !6, line: 441, baseType: !733, size: 64, offset: 640)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !687, file: !6, line: 423, size: 64, elements: !734)
!734 = !{!735, !736, !737, !738, !739}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !733, file: !6, line: 426, baseType: !37, size: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "missing_files", scope: !733, file: !6, line: 429, baseType: !142, size: 8, offset: 32)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "phony_targets", scope: !733, file: !6, line: 433, baseType: !142, size: 8, offset: 40)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_main_file", scope: !733, file: !6, line: 436, baseType: !142, size: 8, offset: 48)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "need_preprocessor_output", scope: !733, file: !6, line: 440, baseType: !142, size: 8, offset: 56)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !687, file: !6, line: 447, baseType: !237, size: 64, offset: 704)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "char_precision", scope: !687, file: !6, line: 447, baseType: !237, size: 64, offset: 768)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "int_precision", scope: !687, file: !6, line: 447, baseType: !237, size: 64, offset: 832)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "wchar_precision", scope: !687, file: !6, line: 447, baseType: !237, size: 64, offset: 896)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_char", scope: !687, file: !6, line: 450, baseType: !142, size: 8, offset: 960)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_wchar", scope: !687, file: !6, line: 450, baseType: !142, size: 8, offset: 968)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_big_endian", scope: !687, file: !6, line: 454, baseType: !142, size: 8, offset: 976)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "stdc_0_in_system_headers", scope: !687, file: !6, line: 457, baseType: !142, size: 8, offset: 984)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "directives_only", scope: !687, file: !6, line: 460, baseType: !142, size: 8, offset: 992)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "spec_nodes", scope: !343, file: !241, line: 463, baseType: !750, size: 256, offset: 9344)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spec_nodes", file: !241, line: 227, size: 256, elements: !751)
!751 = !{!752, !753, !754, !755}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "n_defined", scope: !750, file: !241, line: 229, baseType: !163, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "n_true", scope: !750, file: !241, line: 230, baseType: !163, size: 64, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "n_false", scope: !750, file: !241, line: 231, baseType: !163, size: 64, offset: 128)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "n__VA_ARGS__", scope: !750, file: !241, line: 232, baseType: !163, size: 64, offset: 192)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "our_hashtable", scope: !343, file: !241, line: 466, baseType: !142, size: 8, offset: 9600)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !343, file: !241, line: 475, baseType: !758, size: 256, offset: 9664)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !343, file: !241, line: 469, size: 256, elements: !759)
!759 = !{!760, !761, !762, !763}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !758, file: !241, line: 471, baseType: !235, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !758, file: !241, line: 472, baseType: !235, size: 64, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !758, file: !241, line: 473, baseType: !235, size: 64, offset: 128)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "first_line", scope: !758, file: !241, line: 474, baseType: !152, size: 32, offset: 192)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "saved_cur", scope: !343, file: !241, line: 478, baseType: !172, size: 64, offset: 9920)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "saved_rlimit", scope: !343, file: !241, line: 478, baseType: !172, size: 64, offset: 9984)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "saved_line_base", scope: !343, file: !241, line: 478, baseType: !172, size: 64, offset: 10048)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "savedstate", scope: !343, file: !241, line: 482, baseType: !768, size: 64, offset: 10112)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_savedstate", file: !241, line: 482, flags: DIFlagFwdDecl)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !343, file: !241, line: 485, baseType: !7, size: 32, offset: 10176)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "comments", scope: !343, file: !241, line: 488, baseType: !772, size: 128, offset: 10240)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_comment_table", file: !6, line: 901, baseType: !773)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 891, size: 128, elements: !774)
!774 = !{!775, !776, !777}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !773, file: !6, line: 894, baseType: !254, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !773, file: !6, line: 897, baseType: !146, size: 32, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !773, file: !6, line: 900, baseType: !146, size: 32, offset: 96)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "pushed_macros", scope: !343, file: !241, line: 491, baseType: !779, size: 64, offset: 10368)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_pragma_macro", file: !241, line: 310, size: 192, elements: !781)
!781 = !{!782, !783, !784}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !780, file: !241, line: 312, baseType: !779, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !780, file: !241, line: 314, baseType: !236, size: 64, offset: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !780, file: !241, line: 316, baseType: !185, size: 64, offset: 128)
!785 = !{!786, !787, !788, !789, !790, !791, !792, !795}
!786 = !DILocalVariable(name: "pfile", arg: 1, scope: !338, file: !3, line: 103, type: !341)
!787 = !DILocalVariable(name: "buffer", scope: !338, file: !3, line: 105, type: !346)
!788 = !DILocalVariable(name: "s", scope: !338, file: !3, line: 106, type: !138)
!789 = !DILocalVariable(name: "c", scope: !338, file: !3, line: 107, type: !140)
!790 = !DILocalVariable(name: "d", scope: !338, file: !3, line: 107, type: !143)
!791 = !DILocalVariable(name: "p", scope: !338, file: !3, line: 107, type: !143)
!792 = !DILocalVariable(name: "pbackslash", scope: !793, file: !3, line: 117, type: !138)
!793 = distinct !DILexicalBlock(scope: !794, file: !3, line: 116, column: 5)
!794 = distinct !DILexicalBlock(scope: !338, file: !3, line: 115, column: 7)
!795 = !DILabel(scope: !338, name: "done", file: !3, line: 229)
!796 = !DILocation(line: 0, scope: !338)
!797 = !DILocation(line: 109, column: 19, scope: !338)
!798 = !DILocation(line: 110, column: 30, scope: !338)
!799 = !DILocation(line: 110, column: 41, scope: !338)
!800 = !DILocation(line: 110, column: 11, scope: !338)
!801 = !DILocation(line: 110, column: 20, scope: !338)
!802 = !DILocation(line: 111, column: 45, scope: !338)
!803 = !DILocation(line: 111, column: 25, scope: !338)
!804 = !DILocation(line: 111, column: 35, scope: !338)
!805 = !DILocation(line: 111, column: 15, scope: !338)
!806 = !DILocation(line: 112, column: 11, scope: !338)
!807 = !DILocation(line: 112, column: 21, scope: !338)
!808 = !DILocation(line: 113, column: 15, scope: !338)
!809 = !DILocation(line: 113, column: 25, scope: !338)
!810 = !DILocation(line: 115, column: 16, scope: !794)
!811 = !DILocation(line: 115, column: 8, scope: !794)
!812 = !DILocation(line: 115, column: 7, scope: !338)
!813 = !DILocation(line: 219, column: 7, scope: !814)
!814 = distinct !DILexicalBlock(scope: !794, file: !3, line: 218, column: 5)
!815 = !DILocation(line: 0, scope: !816)
!816 = distinct !DILexicalBlock(scope: !817, file: !3, line: 168, column: 12)
!817 = distinct !DILexicalBlock(scope: !818, file: !3, line: 164, column: 6)
!818 = distinct !DILexicalBlock(scope: !819, file: !3, line: 161, column: 13)
!819 = distinct !DILexicalBlock(scope: !820, file: !3, line: 159, column: 8)
!820 = distinct !DILexicalBlock(scope: !821, file: !3, line: 123, column: 2)
!821 = distinct !DILexicalBlock(scope: !822, file: !3, line: 122, column: 7)
!822 = distinct !DILexicalBlock(scope: !793, file: !3, line: 122, column: 7)
!823 = !DILocation(line: 122, column: 7, scope: !822)
!824 = !DILocation(line: 0, scope: !793)
!825 = !DILocation(line: 124, column: 8, scope: !820)
!826 = !DILocation(line: 125, column: 8, scope: !827)
!827 = distinct !DILexicalBlock(scope: !820, file: !3, line: 125, column: 8)
!828 = !DILocation(line: 126, column: 11, scope: !827)
!829 = !DILocation(line: 126, column: 8, scope: !827)
!830 = !DILocation(line: 130, column: 12, scope: !831)
!831 = distinct !DILexicalBlock(scope: !832, file: !3, line: 130, column: 12)
!832 = distinct !DILexicalBlock(scope: !827, file: !3, line: 127, column: 6)
!833 = !DILocation(line: 130, column: 12, scope: !832)
!834 = !DILocation(line: 135, column: 5, scope: !835)
!835 = distinct !DILexicalBlock(scope: !832, file: !3, line: 134, column: 12)
!836 = !DILocation(line: 135, column: 8, scope: !835)
!837 = !DILocation(line: 135, column: 13, scope: !835)
!838 = !DILocation(line: 134, column: 12, scope: !832)
!839 = !DILocation(line: 138, column: 11, scope: !840)
!840 = distinct !DILexicalBlock(scope: !841, file: !3, line: 138, column: 9)
!841 = distinct !DILexicalBlock(scope: !835, file: !3, line: 136, column: 3)
!842 = !DILocation(line: 138, column: 9, scope: !841)
!843 = !DILocation(line: 0, scope: !820)
!844 = !DILocation(line: 142, column: 12, scope: !845)
!845 = distinct !DILexicalBlock(scope: !832, file: !3, line: 142, column: 12)
!846 = !DILocation(line: 142, column: 12, scope: !832)
!847 = !DILocation(line: 147, column: 8, scope: !832)
!848 = !DILocation(line: 147, column: 15, scope: !832)
!849 = !DILocation(line: 148, column: 4, scope: !832)
!850 = distinct !{!850, !847, !849}
!851 = !DILocation(line: 149, column: 18, scope: !852)
!852 = distinct !DILexicalBlock(scope: !832, file: !3, line: 149, column: 12)
!853 = !DILocation(line: 149, column: 12, scope: !832)
!854 = !DILocation(line: 154, column: 40, scope: !832)
!855 = !DILocation(line: 154, column: 38, scope: !832)
!856 = !DILocation(line: 154, column: 8, scope: !832)
!857 = !DILocation(line: 155, column: 14, scope: !832)
!858 = !DILocation(line: 156, column: 26, scope: !832)
!859 = !DILocation(line: 157, column: 8, scope: !832)
!860 = !DILocation(line: 159, column: 8, scope: !819)
!861 = !DILocation(line: 159, column: 8, scope: !820)
!862 = !DILocation(line: 161, column: 13, scope: !818)
!863 = !DILocation(line: 162, column: 6, scope: !818)
!864 = !DILocation(line: 162, column: 9, scope: !818)
!865 = !DILocation(line: 163, column: 6, scope: !818)
!866 = !DILocation(line: 163, column: 27, scope: !818)
!867 = !DILocation(line: 163, column: 9, scope: !818)
!868 = !DILocation(line: 161, column: 13, scope: !819)
!869 = !DILocation(line: 167, column: 34, scope: !817)
!870 = !DILocation(line: 167, column: 8, scope: !817)
!871 = !DILocation(line: 168, column: 12, scope: !816)
!872 = !DILocation(line: 168, column: 12, scope: !817)
!873 = !DILocation(line: 173, column: 28, scope: !874)
!874 = distinct !DILexicalBlock(scope: !816, file: !3, line: 169, column: 3)
!875 = !DILocation(line: 173, column: 10, scope: !874)
!876 = !DILocation(line: 173, column: 8, scope: !874)
!877 = !DILocation(line: 175, column: 5, scope: !874)
!878 = !DILocation(line: 122, column: 7, scope: !821)
!879 = distinct !{!879, !823, !880}
!880 = !DILocation(line: 178, column: 2, scope: !822)
!881 = !DILocation(line: 0, scope: !882)
!882 = distinct !DILexicalBlock(scope: !883, file: !3, line: 189, column: 12)
!883 = distinct !DILexicalBlock(scope: !884, file: !3, line: 187, column: 6)
!884 = distinct !DILexicalBlock(scope: !885, file: !3, line: 186, column: 8)
!885 = distinct !DILexicalBlock(scope: !886, file: !3, line: 182, column: 2)
!886 = distinct !DILexicalBlock(scope: !887, file: !3, line: 181, column: 7)
!887 = distinct !DILexicalBlock(scope: !793, file: !3, line: 181, column: 7)
!888 = !DILocation(line: 181, column: 7, scope: !793)
!889 = !DILocation(line: 183, column: 9, scope: !885)
!890 = !DILocation(line: 183, column: 8, scope: !885)
!891 = !DILocation(line: 184, column: 9, scope: !885)
!892 = !DILocation(line: 186, column: 10, scope: !884)
!893 = !DILocation(line: 186, column: 23, scope: !884)
!894 = !DILocation(line: 186, column: 18, scope: !884)
!895 = !DILocation(line: 189, column: 22, scope: !882)
!896 = !DILocation(line: 191, column: 25, scope: !897)
!897 = distinct !DILexicalBlock(scope: !883, file: !3, line: 191, column: 12)
!898 = !DILocation(line: 189, column: 38, scope: !882)
!899 = !DILocation(line: 189, column: 27, scope: !882)
!900 = !DILocation(line: 189, column: 45, scope: !882)
!901 = !DILocation(line: 189, column: 48, scope: !882)
!902 = !DILocation(line: 189, column: 53, scope: !882)
!903 = !DILocation(line: 189, column: 12, scope: !883)
!904 = !DILocation(line: 0, scope: !885)
!905 = !DILocation(line: 191, column: 14, scope: !897)
!906 = !DILocation(line: 191, column: 12, scope: !883)
!907 = !DILocation(line: 0, scope: !883)
!908 = !DILocation(line: 196, column: 8, scope: !883)
!909 = !DILocation(line: 196, column: 17, scope: !883)
!910 = !DILocation(line: 196, column: 38, scope: !883)
!911 = !DILocation(line: 196, column: 41, scope: !883)
!912 = !DILocation(line: 197, column: 4, scope: !883)
!913 = distinct !{!913, !908, !912}
!914 = !DILocation(line: 198, column: 35, scope: !915)
!915 = distinct !DILexicalBlock(scope: !883, file: !3, line: 198, column: 12)
!916 = !DILocation(line: 198, column: 38, scope: !915)
!917 = !DILocation(line: 198, column: 44, scope: !915)
!918 = !DILocation(line: 198, column: 12, scope: !883)
!919 = !DILocation(line: 201, column: 40, scope: !883)
!920 = !DILocation(line: 201, column: 38, scope: !883)
!921 = !DILocation(line: 201, column: 8, scope: !883)
!922 = !DILocation(line: 202, column: 14, scope: !883)
!923 = !DILocation(line: 203, column: 26, scope: !883)
!924 = !DILocation(line: 204, column: 6, scope: !883)
!925 = !DILocation(line: 205, column: 15, scope: !926)
!926 = distinct !DILexicalBlock(scope: !884, file: !3, line: 205, column: 13)
!927 = !DILocation(line: 205, column: 22, scope: !926)
!928 = !DILocation(line: 205, column: 25, scope: !926)
!929 = !DILocation(line: 205, column: 30, scope: !926)
!930 = !DILocation(line: 205, column: 37, scope: !926)
!931 = !DILocation(line: 205, column: 58, scope: !926)
!932 = !DILocation(line: 205, column: 40, scope: !926)
!933 = !DILocation(line: 205, column: 13, scope: !884)
!934 = !DILocation(line: 208, column: 34, scope: !935)
!935 = distinct !DILexicalBlock(scope: !926, file: !3, line: 206, column: 6)
!936 = !DILocation(line: 208, column: 8, scope: !935)
!937 = !DILocation(line: 209, column: 12, scope: !938)
!938 = distinct !DILexicalBlock(scope: !935, file: !3, line: 209, column: 12)
!939 = !DILocation(line: 209, column: 12, scope: !935)
!940 = !DILocation(line: 211, column: 28, scope: !941)
!941 = distinct !DILexicalBlock(scope: !938, file: !3, line: 210, column: 3)
!942 = !DILocation(line: 211, column: 10, scope: !941)
!943 = !DILocation(line: 211, column: 8, scope: !941)
!944 = !DILocation(line: 213, column: 3, scope: !941)
!945 = !DILocation(line: 0, scope: !884)
!946 = !DILocation(line: 181, column: 7, scope: !886)
!947 = distinct !{!947, !948, !949}
!948 = !DILocation(line: 181, column: 7, scope: !887)
!949 = !DILocation(line: 215, column: 2, scope: !887)
!950 = !DILocation(line: 220, column: 3, scope: !814)
!951 = !DILocation(line: 221, column: 14, scope: !814)
!952 = !DILocation(line: 221, column: 17, scope: !814)
!953 = !DILocation(line: 221, column: 31, scope: !814)
!954 = !DILocation(line: 221, column: 25, scope: !814)
!955 = distinct !{!955, !813, !956}
!956 = !DILocation(line: 221, column: 38, scope: !814)
!957 = !DILocation(line: 225, column: 14, scope: !958)
!958 = distinct !DILexicalBlock(scope: !814, file: !3, line: 225, column: 11)
!959 = !DILocation(line: 225, column: 22, scope: !958)
!960 = !DILocation(line: 225, column: 38, scope: !958)
!961 = !DILocation(line: 225, column: 27, scope: !958)
!962 = !DILocation(line: 225, column: 45, scope: !958)
!963 = !DILocation(line: 225, column: 48, scope: !958)
!964 = !DILocation(line: 225, column: 53, scope: !958)
!965 = !DILocation(line: 225, column: 11, scope: !814)
!966 = !DILocation(line: 230, column: 6, scope: !338)
!967 = !DILocation(line: 0, scope: !794)
!968 = !DILocation(line: 229, column: 2, scope: !338)
!969 = !DILocation(line: 232, column: 28, scope: !338)
!970 = !DILocation(line: 232, column: 3, scope: !338)
!971 = !DILocation(line: 233, column: 25, scope: !338)
!972 = !DILocation(line: 233, column: 21, scope: !338)
!973 = !DILocation(line: 234, column: 1, scope: !338)
!974 = distinct !DISubprogram(name: "add_line_note", scope: !3, file: !3, line: 86, type: !975, scopeLine: 87, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !977)
!975 = !DISubroutineType(types: !976)
!976 = !{null, !346, !138, !7}
!977 = !{!978, !979, !980}
!978 = !DILocalVariable(name: "buffer", arg: 1, scope: !974, file: !3, line: 86, type: !346)
!979 = !DILocalVariable(name: "pos", arg: 2, scope: !974, file: !3, line: 86, type: !138)
!980 = !DILocalVariable(name: "type", arg: 3, scope: !974, file: !3, line: 86, type: !7)
!981 = !DILocation(line: 0, scope: !974)
!982 = !DILocation(line: 88, column: 15, scope: !983)
!983 = distinct !DILexicalBlock(scope: !974, file: !3, line: 88, column: 7)
!984 = !DILocation(line: 88, column: 37, scope: !983)
!985 = !DILocation(line: 88, column: 26, scope: !983)
!986 = !DILocation(line: 88, column: 7, scope: !974)
!987 = !DILocation(line: 95, column: 11, scope: !974)
!988 = !DILocation(line: 90, column: 45, scope: !989)
!989 = distinct !DILexicalBlock(scope: !983, file: !3, line: 89, column: 5)
!990 = !DILocation(line: 90, column: 49, scope: !989)
!991 = !DILocation(line: 90, column: 25, scope: !989)
!992 = !DILocation(line: 91, column: 23, scope: !989)
!993 = !DILocation(line: 91, column: 21, scope: !989)
!994 = !DILocation(line: 93, column: 5, scope: !989)
!995 = !DILocation(line: 95, column: 25, scope: !974)
!996 = !DILocation(line: 95, column: 3, scope: !974)
!997 = !DILocation(line: 95, column: 37, scope: !974)
!998 = !DILocation(line: 95, column: 41, scope: !974)
!999 = !DILocation(line: 96, column: 11, scope: !974)
!1000 = !DILocation(line: 96, column: 25, scope: !974)
!1001 = !DILocation(line: 96, column: 3, scope: !974)
!1002 = !DILocation(line: 96, column: 37, scope: !974)
!1003 = !DILocation(line: 96, column: 42, scope: !974)
!1004 = !DILocation(line: 97, column: 21, scope: !974)
!1005 = !DILocation(line: 98, column: 1, scope: !974)
!1006 = distinct !DISubprogram(name: "_cpp_process_line_notes", scope: !3, file: !3, line: 267, type: !1007, scopeLine: 268, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1009)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{null, !341, !146}
!1009 = !{!1010, !1011, !1012, !1013, !1017, !1018, !1024, !1025}
!1010 = !DILocalVariable(name: "pfile", arg: 1, scope: !1006, file: !3, line: 267, type: !341)
!1011 = !DILocalVariable(name: "in_comment", arg: 2, scope: !1006, file: !3, line: 267, type: !146)
!1012 = !DILocalVariable(name: "buffer", scope: !1006, file: !3, line: 269, type: !346)
!1013 = !DILocalVariable(name: "note", scope: !1014, file: !3, line: 273, type: !239)
!1014 = distinct !DILexicalBlock(scope: !1015, file: !3, line: 272, column: 5)
!1015 = distinct !DILexicalBlock(scope: !1016, file: !3, line: 271, column: 3)
!1016 = distinct !DILexicalBlock(scope: !1006, file: !3, line: 271, column: 3)
!1017 = !DILocalVariable(name: "col", scope: !1014, file: !3, line: 274, type: !7)
!1018 = !DILocalVariable(name: "line_table", scope: !1019, file: !3, line: 297, type: !1022)
!1019 = distinct !DILexicalBlock(scope: !1020, file: !3, line: 297, column: 4)
!1020 = distinct !DILexicalBlock(scope: !1021, file: !3, line: 283, column: 2)
!1021 = distinct !DILexicalBlock(scope: !1014, file: !3, line: 282, column: 11)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !433)
!1024 = !DILocalVariable(name: "map", scope: !1019, file: !3, line: 297, type: !589)
!1025 = !DILocalVariable(name: "line", scope: !1019, file: !3, line: 297, type: !441)
!1026 = !DILocation(line: 0, scope: !1006)
!1027 = !DILocation(line: 269, column: 31, scope: !1006)
!1028 = !DILocation(line: 0, scope: !1014)
!1029 = !DILocation(line: 0, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !1014, file: !3, line: 276, column: 11)
!1031 = !DILocation(line: 0, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !1033, file: !3, line: 301, column: 8)
!1033 = distinct !DILexicalBlock(scope: !1034, file: !3, line: 300, column: 2)
!1034 = distinct !DILexicalBlock(scope: !1021, file: !3, line: 299, column: 16)
!1035 = !DILocation(line: 0, scope: !1036)
!1036 = distinct !DILexicalBlock(scope: !1037, file: !3, line: 304, column: 12)
!1037 = distinct !DILexicalBlock(scope: !1032, file: !3, line: 303, column: 6)
!1038 = !DILocation(line: 0, scope: !1039)
!1039 = distinct !DILexicalBlock(scope: !1020, file: !3, line: 284, column: 8)
!1040 = !DILocation(line: 0, scope: !1041)
!1041 = distinct !DILexicalBlock(scope: !1020, file: !3, line: 288, column: 8)
!1042 = !DILocation(line: 0, scope: !1043)
!1043 = distinct !DILexicalBlock(scope: !1041, file: !3, line: 289, column: 6)
!1044 = !DILocation(line: 271, column: 3, scope: !1006)
!1045 = !DILocation(line: 273, column: 39, scope: !1014)
!1046 = !DILocation(line: 273, column: 53, scope: !1014)
!1047 = !DILocation(line: 273, column: 31, scope: !1014)
!1048 = !DILocation(line: 276, column: 17, scope: !1030)
!1049 = !DILocation(line: 276, column: 31, scope: !1030)
!1050 = !DILocation(line: 276, column: 21, scope: !1030)
!1051 = !DILocation(line: 276, column: 11, scope: !1014)
!1052 = !DILocation(line: 279, column: 23, scope: !1014)
!1053 = !DILocation(line: 280, column: 13, scope: !1014)
!1054 = !DILocation(line: 282, column: 17, scope: !1021)
!1055 = !DILocation(line: 282, column: 22, scope: !1021)
!1056 = !DILocation(line: 282, column: 30, scope: !1021)
!1057 = !DILocation(line: 282, column: 44, scope: !1021)
!1058 = !DILocation(line: 282, column: 11, scope: !1014)
!1059 = !DILocation(line: 284, column: 19, scope: !1039)
!1060 = !DILocation(line: 284, column: 26, scope: !1039)
!1061 = !DILocation(line: 285, column: 57, scope: !1039)
!1062 = !DILocation(line: 285, column: 69, scope: !1039)
!1063 = !DILocation(line: 285, column: 6, scope: !1039)
!1064 = !DILocation(line: 288, column: 16, scope: !1041)
!1065 = !DILocation(line: 288, column: 36, scope: !1041)
!1066 = !DILocation(line: 288, column: 26, scope: !1041)
!1067 = !DILocation(line: 288, column: 8, scope: !1020)
!1068 = !DILocation(line: 290, column: 59, scope: !1043)
!1069 = !DILocation(line: 290, column: 71, scope: !1043)
!1070 = !DILocation(line: 290, column: 8, scope: !1043)
!1071 = !DILocation(line: 293, column: 36, scope: !1043)
!1072 = !DILocation(line: 293, column: 26, scope: !1043)
!1073 = !DILocation(line: 294, column: 6, scope: !1043)
!1074 = !DILocation(line: 296, column: 30, scope: !1020)
!1075 = !DILocation(line: 296, column: 22, scope: !1020)
!1076 = !DILocation(line: 297, column: 4, scope: !1019)
!1077 = !DILocation(line: 0, scope: !1019)
!1078 = !DILocation(line: 298, column: 2, scope: !1020)
!1079 = !DILocation(line: 299, column: 16, scope: !1034)
!1080 = !DILocation(line: 299, column: 16, scope: !1021)
!1081 = !DILocation(line: 301, column: 8, scope: !1032)
!1082 = !DILocation(line: 302, column: 8, scope: !1032)
!1083 = !DILocation(line: 302, column: 24, scope: !1032)
!1084 = !DILocation(line: 302, column: 27, scope: !1032)
!1085 = !DILocation(line: 301, column: 8, scope: !1033)
!1086 = !DILocation(line: 304, column: 12, scope: !1036)
!1087 = !DILocation(line: 304, column: 12, scope: !1037)
!1088 = !DILocation(line: 308, column: 16, scope: !1036)
!1089 = !DILocation(line: 308, column: 10, scope: !1036)
!1090 = !DILocation(line: 305, column: 3, scope: !1036)
!1091 = !DILocation(line: 311, column: 5, scope: !1092)
!1092 = distinct !DILexicalBlock(scope: !1036, file: !3, line: 310, column: 3)
!1093 = !DILocation(line: 318, column: 27, scope: !1094)
!1094 = distinct !DILexicalBlock(scope: !1034, file: !3, line: 318, column: 16)
!1095 = !DILocation(line: 318, column: 16, scope: !1034)
!1096 = !DILocation(line: 321, column: 2, scope: !1094)
!1097 = distinct !{!1097, !1098, !1099}
!1098 = !DILocation(line: 271, column: 3, scope: !1016)
!1099 = !DILocation(line: 322, column: 5, scope: !1016)
!1100 = !DILocation(line: 323, column: 1, scope: !1006)
!1101 = distinct !DISubprogram(name: "warn_in_comment", scope: !3, file: !3, line: 239, type: !1102, scopeLine: 240, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1104)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!142, !341, !239}
!1104 = !{!1105, !1106, !1107}
!1105 = !DILocalVariable(name: "pfile", arg: 1, scope: !1101, file: !3, line: 239, type: !341)
!1106 = !DILocalVariable(name: "note", arg: 2, scope: !1101, file: !3, line: 239, type: !239)
!1107 = !DILocalVariable(name: "p", scope: !1101, file: !3, line: 241, type: !138)
!1108 = !DILocation(line: 0, scope: !1101)
!1109 = !DILocation(line: 246, column: 13, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !1101, file: !3, line: 246, column: 7)
!1111 = !DILocation(line: 246, column: 18, scope: !1110)
!1112 = !DILocation(line: 246, column: 7, scope: !1101)
!1113 = !DILocation(line: 251, column: 7, scope: !1114)
!1114 = distinct !DILexicalBlock(scope: !1101, file: !3, line: 251, column: 7)
!1115 = !DILocation(line: 251, column: 7, scope: !1101)
!1116 = !DILocation(line: 252, column: 20, scope: !1114)
!1117 = !DILocation(line: 252, column: 33, scope: !1114)
!1118 = !DILocation(line: 252, column: 24, scope: !1114)
!1119 = !DILocation(line: 252, column: 12, scope: !1114)
!1120 = !DILocation(line: 252, column: 5, scope: !1114)
!1121 = !DILocation(line: 255, column: 13, scope: !1101)
!1122 = !DILocation(line: 255, column: 17, scope: !1101)
!1123 = !DILocation(line: 256, column: 3, scope: !1101)
!1124 = !DILocation(line: 256, column: 10, scope: !1101)
!1125 = !DILocation(line: 257, column: 6, scope: !1101)
!1126 = distinct !{!1126, !1123, !1125}
!1127 = !DILocation(line: 261, column: 14, scope: !1101)
!1128 = !DILocation(line: 261, column: 22, scope: !1101)
!1129 = !DILocation(line: 261, column: 37, scope: !1101)
!1130 = !DILocation(line: 261, column: 27, scope: !1101)
!1131 = !DILocation(line: 261, column: 3, scope: !1101)
!1132 = !DILocation(line: 262, column: 1, scope: !1101)
!1133 = distinct !DISubprogram(name: "_cpp_skip_block_comment", scope: !3, file: !3, line: 331, type: !1134, scopeLine: 332, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1136)
!1134 = !DISubroutineType(types: !1135)
!1135 = !{!142, !341}
!1136 = !{!1137, !1138, !1139, !1140, !1141, !1148, !1150, !1151}
!1137 = !DILocalVariable(name: "pfile", arg: 1, scope: !1133, file: !3, line: 331, type: !341)
!1138 = !DILocalVariable(name: "buffer", scope: !1133, file: !3, line: 333, type: !346)
!1139 = !DILocalVariable(name: "cur", scope: !1133, file: !3, line: 334, type: !138)
!1140 = !DILocalVariable(name: "c", scope: !1133, file: !3, line: 335, type: !140)
!1141 = !DILocalVariable(name: "cols", scope: !1142, file: !3, line: 366, type: !7)
!1142 = distinct !DILexicalBlock(scope: !1143, file: !3, line: 365, column: 2)
!1143 = distinct !DILexicalBlock(scope: !1144, file: !3, line: 364, column: 16)
!1144 = distinct !DILexicalBlock(scope: !1145, file: !3, line: 347, column: 11)
!1145 = distinct !DILexicalBlock(scope: !1146, file: !3, line: 342, column: 5)
!1146 = distinct !DILexicalBlock(scope: !1147, file: !3, line: 341, column: 3)
!1147 = distinct !DILexicalBlock(scope: !1133, file: !3, line: 341, column: 3)
!1148 = !DILocalVariable(name: "line_table", scope: !1149, file: !3, line: 374, type: !1022)
!1149 = distinct !DILexicalBlock(scope: !1142, file: !3, line: 374, column: 4)
!1150 = !DILocalVariable(name: "map", scope: !1149, file: !3, line: 374, type: !589)
!1151 = !DILocalVariable(name: "line", scope: !1149, file: !3, line: 374, type: !441)
!1152 = !DILocation(line: 0, scope: !1133)
!1153 = !DILocation(line: 333, column: 31, scope: !1133)
!1154 = !DILocation(line: 334, column: 30, scope: !1133)
!1155 = !DILocation(line: 337, column: 6, scope: !1133)
!1156 = !DILocation(line: 338, column: 7, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !1133, file: !3, line: 338, column: 7)
!1158 = !DILocation(line: 338, column: 12, scope: !1157)
!1159 = !DILocation(line: 339, column: 8, scope: !1157)
!1160 = !DILocation(line: 338, column: 7, scope: !1133)
!1161 = !DILocation(line: 0, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !1142, file: !3, line: 369, column: 8)
!1163 = !DILocation(line: 0, scope: !1142)
!1164 = !DILocation(line: 0, scope: !1149)
!1165 = !DILocation(line: 0, scope: !1166)
!1166 = distinct !DILexicalBlock(scope: !1167, file: !3, line: 355, column: 8)
!1167 = distinct !DILexicalBlock(scope: !1144, file: !3, line: 348, column: 2)
!1168 = !DILocation(line: 341, column: 3, scope: !1133)
!1169 = !DILocation(line: 345, column: 15, scope: !1145)
!1170 = !DILocation(line: 345, column: 11, scope: !1145)
!1171 = !DILocation(line: 347, column: 13, scope: !1144)
!1172 = !DILocation(line: 347, column: 11, scope: !1145)
!1173 = !DILocation(line: 349, column: 8, scope: !1174)
!1174 = distinct !DILexicalBlock(scope: !1167, file: !3, line: 349, column: 8)
!1175 = !DILocation(line: 349, column: 16, scope: !1174)
!1176 = !DILocation(line: 349, column: 8, scope: !1167)
!1177 = !DILocation(line: 355, column: 8, scope: !1166)
!1178 = !DILocation(line: 356, column: 8, scope: !1166)
!1179 = !DILocation(line: 356, column: 11, scope: !1166)
!1180 = !DILocation(line: 356, column: 18, scope: !1166)
!1181 = !DILocation(line: 356, column: 25, scope: !1166)
!1182 = !DILocation(line: 356, column: 28, scope: !1166)
!1183 = !DILocation(line: 356, column: 35, scope: !1166)
!1184 = !DILocation(line: 355, column: 8, scope: !1167)
!1185 = !DILocation(line: 358, column: 20, scope: !1186)
!1186 = distinct !DILexicalBlock(scope: !1166, file: !3, line: 357, column: 6)
!1187 = !DILocation(line: 360, column: 15, scope: !1186)
!1188 = !DILocation(line: 360, column: 27, scope: !1186)
!1189 = !DILocation(line: 360, column: 41, scope: !1186)
!1190 = !DILocation(line: 359, column: 8, scope: !1186)
!1191 = !DILocation(line: 362, column: 6, scope: !1186)
!1192 = !DILocation(line: 364, column: 18, scope: !1143)
!1193 = !DILocation(line: 364, column: 16, scope: !1144)
!1194 = !DILocation(line: 367, column: 16, scope: !1142)
!1195 = !DILocation(line: 368, column: 4, scope: !1142)
!1196 = !DILocation(line: 369, column: 16, scope: !1162)
!1197 = !DILocation(line: 369, column: 37, scope: !1162)
!1198 = !DILocation(line: 369, column: 26, scope: !1162)
!1199 = !DILocation(line: 369, column: 8, scope: !1142)
!1200 = !DILocation(line: 371, column: 4, scope: !1142)
!1201 = !DILocation(line: 373, column: 19, scope: !1142)
!1202 = !DILocation(line: 373, column: 39, scope: !1142)
!1203 = !DILocation(line: 373, column: 29, scope: !1142)
!1204 = !DILocation(line: 373, column: 11, scope: !1142)
!1205 = !DILocation(line: 374, column: 4, scope: !1149)
!1206 = !DILocation(line: 376, column: 18, scope: !1142)
!1207 = !DILocation(line: 377, column: 2, scope: !1143)
!1208 = !DILocation(line: 0, scope: !1145)
!1209 = !DILocation(line: 341, column: 3, scope: !1146)
!1210 = distinct !{!1210, !1211, !1212}
!1211 = !DILocation(line: 341, column: 3, scope: !1147)
!1212 = !DILocation(line: 378, column: 5, scope: !1147)
!1213 = !DILocation(line: 380, column: 15, scope: !1133)
!1214 = !DILocation(line: 381, column: 3, scope: !1133)
