; ModuleID = 'cpp_traditional.bc'
source_filename = "cpp_traditional.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.cpp_reader = type { %struct.cpp_buffer*, %struct.cpp_buffer*, %struct.lexer_state, %struct.line_maps*, i32, %struct._cpp_buff*, %struct._cpp_buff*, %struct._cpp_buff*, %struct.cpp_context, %struct.cpp_context*, %struct.directive*, %struct.cpp_token, i32, i8, %struct.cpp_dir*, %struct.cpp_dir*, %struct.cpp_dir, %struct._cpp_file*, %struct._cpp_file*, %struct.htab*, %struct.htab*, %struct.file_hash_entry_pool*, %struct.htab*, %struct.obstack, i8, i8, %struct.cpp_hashnode*, %struct.cpp_hashnode*, i8, %struct.cpp_token*, %struct.tokenrun, %struct.tokenrun*, i32, i32, i8*, i32, %struct.cset_converter, %struct.cset_converter, %struct.cset_converter, %struct.cset_converter, %struct.cset_converter, i8*, i8*, %struct.cpp_token, %struct.cpp_token, %struct.deps*, %struct.obstack, %struct.obstack, %struct.pragma_entry*, %struct.cpp_callbacks, %struct.ht*, %struct.op*, %struct.op*, %struct.cpp_options, %struct.spec_nodes, i8, %struct.anon.2, i8*, i8*, i8*, %struct.cpp_savedstate*, i32, %struct.cpp_comment_table, %struct.def_pragma_macro* }
%struct.cpp_buffer = type { i8*, i8*, i8*, i8*, i8*, %struct._cpp_line_note*, i32, i32, i32, %struct.cpp_buffer*, %struct._cpp_file*, i8*, %struct.if_stack*, i8, i8, i8, %struct.cpp_dir, %struct.cset_converter }
%struct._cpp_line_note = type { i8*, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !50, nameTableKind: None)
!1 = !DIFile(filename: "cpp_traditional.c", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2 = !{!3, !17, !29, !35, !40}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cpp_builtin_type", file: !4, line: 593, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "./cpplib.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16}
!7 = !DIEnumerator(name: "BT_SPECLINE", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "BT_DATE", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "BT_FILE", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "BT_BASE_FILE", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "BT_INCLUDE_LEVEL", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "BT_TIME", value: 5, isUnsigned: true)
!13 = !DIEnumerator(name: "BT_STDC", value: 6, isUnsigned: true)
!14 = !DIEnumerator(name: "BT_PRAGMA", value: 7, isUnsigned: true)
!15 = !DIEnumerator(name: "BT_TIMESTAMP", value: 8, isUnsigned: true)
!16 = !DIEnumerator(name: "BT_COUNTER", value: 9, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_lang", file: !4, line: 158, baseType: !5, size: 32, elements: !18)
!18 = !{!19, !20, !21, !22, !23, !24, !25, !26, !27, !28}
!19 = !DIEnumerator(name: "CLK_GNUC89", value: 0, isUnsigned: true)
!20 = !DIEnumerator(name: "CLK_GNUC99", value: 1, isUnsigned: true)
!21 = !DIEnumerator(name: "CLK_STDC89", value: 2, isUnsigned: true)
!22 = !DIEnumerator(name: "CLK_STDC94", value: 3, isUnsigned: true)
!23 = !DIEnumerator(name: "CLK_STDC99", value: 4, isUnsigned: true)
!24 = !DIEnumerator(name: "CLK_GNUCXX", value: 5, isUnsigned: true)
!25 = !DIEnumerator(name: "CLK_CXX98", value: 6, isUnsigned: true)
!26 = !DIEnumerator(name: "CLK_GNUCXX0X", value: 7, isUnsigned: true)
!27 = !DIEnumerator(name: "CLK_CXX0X", value: 8, isUnsigned: true)
!28 = !DIEnumerator(name: "CLK_ASM", value: 9, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cpp_normalize_level", file: !4, line: 265, baseType: !5, size: 32, elements: !30)
!30 = !{!31, !32, !33, !34}
!31 = !DIEnumerator(name: "normalized_KC", value: 0, isUnsigned: true)
!32 = !DIEnumerator(name: "normalized_C", value: 1, isUnsigned: true)
!33 = !DIEnumerator(name: "normalized_identifier_C", value: 2, isUnsigned: true)
!34 = !DIEnumerator(name: "normalized_none", value: 3, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cpp_deps_style", file: !4, line: 262, baseType: !5, size: 32, elements: !36)
!36 = !{!37, !38, !39}
!37 = !DIEnumerator(name: "DEPS_NONE", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "DEPS_USER", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "DEPS_SYSTEM", value: 2, isUnsigned: true)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ls", file: !1, line: 72, baseType: !5, size: 32, elements: !41)
!41 = !{!42, !43, !44, !45, !46, !47, !48, !49}
!42 = !DIEnumerator(name: "ls_none", value: 0, isUnsigned: true)
!43 = !DIEnumerator(name: "ls_fun_open", value: 1, isUnsigned: true)
!44 = !DIEnumerator(name: "ls_fun_close", value: 2, isUnsigned: true)
!45 = !DIEnumerator(name: "ls_defined", value: 3, isUnsigned: true)
!46 = !DIEnumerator(name: "ls_defined_close", value: 4, isUnsigned: true)
!47 = !DIEnumerator(name: "ls_hash", value: 5, isUnsigned: true)
!48 = !DIEnumerator(name: "ls_predicate", value: 6, isUnsigned: true)
!49 = !DIEnumerator(name: "ls_answer", value: 7, isUnsigned: true)
!50 = !{!51, !52, !53, !65, !145, !146, !149, !66, !150, !151}
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!52 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block", file: !1, line: 35, size: 64, elements: !55)
!55 = !{!56, !57, !58}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "text_len", scope: !54, file: !1, line: 37, baseType: !5, size: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "arg_index", scope: !54, file: !1, line: 38, baseType: !52, size: 16, offset: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !54, file: !1, line: 39, baseType: !59, size: 8, offset: 48)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 8, elements: !63)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !61, line: 22, baseType: !62)
!61 = !DIFile(filename: "./cpp-id-data.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!62 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!63 = !{!64}
!64 = !DISubrange(count: 1)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_hashnode", file: !4, line: 36, baseType: !68)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_hashnode", file: !4, line: 644, size: 256, elements: !69)
!69 = !{!70, !79, !80, !81, !82, !83, !84}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !68, file: !4, line: 645, baseType: !71, size: 128)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !72, line: 31, size: 128, elements: !73)
!72 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!73 = !{!74, !77, !78}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !71, file: !72, line: 32, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !71, file: !72, line: 33, baseType: !5, size: 32, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !71, file: !72, line: 34, baseType: !5, size: 32, offset: 96)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "is_directive", scope: !68, file: !4, line: 646, baseType: !5, size: 1, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "directive_index", scope: !68, file: !4, line: 647, baseType: !5, size: 7, offset: 129, flags: DIFlagBitField, extraData: i64 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "rid_code", scope: !68, file: !4, line: 650, baseType: !62, size: 8, offset: 136)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !68, file: !4, line: 651, baseType: !5, size: 6, offset: 144, flags: DIFlagBitField, extraData: i64 144)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !68, file: !4, line: 652, baseType: !5, size: 10, offset: 150, flags: DIFlagBitField, extraData: i64 144)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !68, file: !4, line: 654, baseType: !85, size: 64, offset: 192)
!85 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_cpp_hashnode_value", file: !4, line: 633, size: 64, elements: !86)
!86 = !{!87, !135, !143, !144}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !85, file: !4, line: 635, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_macro", file: !4, line: 37, baseType: !90)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_macro", file: !61, line: 36, size: 256, elements: !91)
!91 = !{!92, !93, !126, !127, !128, !129, !130, !131, !132, !133, !134}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !90, file: !61, line: 42, baseType: !65, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !90, file: !61, line: 51, baseType: !94, size: 64, offset: 64)
!94 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cpp_macro_u", file: !61, line: 47, size: 64, elements: !95)
!95 = !{!96, !125}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "tokens", scope: !94, file: !61, line: 49, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_token", file: !4, line: 34, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_token", file: !4, line: 212, size: 192, elements: !100)
!100 = !{!101, !104, !105, !106}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "src_loc", scope: !99, file: !4, line: 213, baseType: !102, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !103, line: 44, baseType: !5)
!103 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!104 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !99, file: !4, line: 214, baseType: !5, size: 8, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !99, file: !4, line: 215, baseType: !52, size: 16, offset: 48)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !99, file: !4, line: 237, baseType: !107, size: 128, offset: 64)
!107 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cpp_token_u", file: !4, line: 217, size: 128, elements: !108)
!108 = !{!109, !113, !114, !119, !123, !124}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !107, file: !4, line: 220, baseType: !110, size: 64)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_identifier", file: !4, line: 201, size: 64, elements: !111)
!111 = !{!112}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !110, file: !4, line: 207, baseType: !66, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !107, file: !4, line: 223, baseType: !97, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !107, file: !4, line: 226, baseType: !115, size: 128)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_string", file: !4, line: 162, size: 128, elements: !116)
!116 = !{!117, !118}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !115, file: !4, line: 163, baseType: !5, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !115, file: !4, line: 164, baseType: !75, size: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "macro_arg", scope: !107, file: !4, line: 229, baseType: !120, size: 32)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_macro_arg", file: !4, line: 195, size: 32, elements: !121)
!121 = !{!122}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "arg_no", scope: !120, file: !4, line: 197, baseType: !5, size: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "token_no", scope: !107, file: !4, line: 233, baseType: !5, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "pragma", scope: !107, file: !4, line: 236, baseType: !5, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !94, file: !61, line: 50, baseType: !75, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !90, file: !61, line: 54, baseType: !102, size: 32, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !90, file: !61, line: 57, baseType: !5, size: 32, offset: 160)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "paramc", scope: !90, file: !61, line: 60, baseType: !52, size: 16, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "fun_like", scope: !90, file: !61, line: 63, baseType: !5, size: 1, offset: 208, flags: DIFlagBitField, extraData: i64 208)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "variadic", scope: !90, file: !61, line: 66, baseType: !5, size: 1, offset: 209, flags: DIFlagBitField, extraData: i64 208)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "syshdr", scope: !90, file: !61, line: 69, baseType: !5, size: 1, offset: 210, flags: DIFlagBitField, extraData: i64 208)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !90, file: !61, line: 72, baseType: !5, size: 1, offset: 211, flags: DIFlagBitField, extraData: i64 208)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "traditional", scope: !90, file: !61, line: 75, baseType: !5, size: 1, offset: 212, flags: DIFlagBitField, extraData: i64 208)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "extra_tokens", scope: !90, file: !61, line: 80, baseType: !5, size: 1, offset: 213, flags: DIFlagBitField, extraData: i64 208)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "answers", scope: !85, file: !4, line: 637, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "answer", file: !61, line: 28, size: 320, elements: !138)
!138 = !{!139, !140, !141}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !137, file: !61, line: 29, baseType: !136, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !137, file: !61, line: 30, baseType: !5, size: 32, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !137, file: !61, line: 31, baseType: !142, size: 192, offset: 128)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 192, elements: !63)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "builtin", scope: !85, file: !4, line: 639, baseType: !3, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "arg_index", scope: !85, file: !4, line: 641, baseType: !52, size: 16)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !147, line: 46, baseType: !148)
!147 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!148 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !153)
!153 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!154 = !{i32 2, !"Dwarf Version", i32 4}
!155 = !{i32 2, !"Debug Info Version", i32 3}
!156 = !{i32 1, !"wchar_size", i32 4}
!157 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!158 = distinct !DISubprogram(name: "tolower", scope: !159, file: !159, line: 207, type: !160, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !163)
!159 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!160 = !DISubroutineType(types: !161)
!161 = !{!162, !162}
!162 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!163 = !{!164}
!164 = !DILocalVariable(name: "__c", arg: 1, scope: !158, file: !159, line: 207, type: !162)
!165 = !DILocation(line: 0, scope: !158)
!166 = !DILocation(line: 209, column: 22, scope: !158)
!167 = !DILocation(line: 209, column: 39, scope: !158)
!168 = !DILocation(line: 209, column: 38, scope: !158)
!169 = !DILocation(line: 209, column: 37, scope: !158)
!170 = !DILocation(line: 209, column: 10, scope: !158)
!171 = !DILocation(line: 209, column: 3, scope: !158)
!172 = distinct !DISubprogram(name: "toupper", scope: !159, file: !159, line: 213, type: !160, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !173)
!173 = !{!174}
!174 = !DILocalVariable(name: "__c", arg: 1, scope: !172, file: !159, line: 213, type: !162)
!175 = !DILocation(line: 0, scope: !172)
!176 = !DILocation(line: 215, column: 22, scope: !172)
!177 = !DILocation(line: 215, column: 39, scope: !172)
!178 = !DILocation(line: 215, column: 38, scope: !172)
!179 = !DILocation(line: 215, column: 37, scope: !172)
!180 = !DILocation(line: 215, column: 10, scope: !172)
!181 = !DILocation(line: 215, column: 3, scope: !172)
!182 = distinct !DISubprogram(name: "_cpp_overlay_buffer", scope: !1, file: !1, line: 268, type: !183, scopeLine: 269, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !667)
!183 = !DISubroutineType(types: !184)
!184 = !{null, !185, !665, !146}
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_reader", file: !4, line: 31, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_reader", file: !188, line: 322, size: 10432, elements: !189)
!188 = !DIFile(filename: "./internal.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!189 = !{!190, !265, !266, !283, !313, !314, !324, !325, !326, !356, !358, !362, !363, !364, !365, !366, !367, !368, !369, !370, !373, !374, !377, !378, !411, !412, !413, !416, !417, !418, !419, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !445, !446, !447, !450, !530, !556, !559, !560, !623, !630, !631, !638, !639, !640, !641, !644, !645, !658}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !187, file: !188, line: 325, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_buffer", file: !4, line: 32, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_buffer", file: !188, line: 249, size: 1536, elements: !194)
!194 = !{!195, !196, !197, !198, !199, !200, !207, !208, !209, !210, !212, !215, !216, !219, !220, !221, !222, !223, !224, !251}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !193, file: !188, line: 251, baseType: !75, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "line_base", scope: !193, file: !188, line: 252, baseType: !75, size: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "next_line", scope: !193, file: !188, line: 253, baseType: !75, size: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !193, file: !188, line: 255, baseType: !75, size: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit", scope: !193, file: !188, line: 256, baseType: !75, size: 64, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "notes", scope: !193, file: !188, line: 258, baseType: !201, size: 64, offset: 320)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cpp_line_note", file: !188, line: 235, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_line_note", file: !188, line: 236, size: 128, elements: !204)
!204 = !{!205, !206}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !203, file: !188, line: 239, baseType: !75, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !203, file: !188, line: 245, baseType: !5, size: 32, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "cur_note", scope: !193, file: !188, line: 259, baseType: !5, size: 32, offset: 384)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "notes_used", scope: !193, file: !188, line: 260, baseType: !5, size: 32, offset: 416)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "notes_cap", scope: !193, file: !188, line: 261, baseType: !5, size: 32, offset: 448)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !193, file: !188, line: 263, baseType: !211, size: 64, offset: 512)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !193, file: !188, line: 267, baseType: !213, size: 64, offset: 576)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_file", file: !4, line: 42, flags: DIFlagFwdDecl)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !193, file: !188, line: 271, baseType: !75, size: 64, offset: 640)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "if_stack", scope: !193, file: !188, line: 275, baseType: !217, size: 64, offset: 704)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "if_stack", file: !188, line: 275, flags: DIFlagFwdDecl)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "need_line", scope: !193, file: !188, line: 278, baseType: !62, size: 8, offset: 768)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "warned_cplusplus_comments", scope: !193, file: !188, line: 284, baseType: !5, size: 1, offset: 776, flags: DIFlagBitField, extraData: i64 776)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "from_stage3", scope: !193, file: !188, line: 289, baseType: !5, size: 1, offset: 777, flags: DIFlagBitField, extraData: i64 776)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "return_at_eof", scope: !193, file: !188, line: 294, baseType: !5, size: 1, offset: 778, flags: DIFlagBitField, extraData: i64 776)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !193, file: !188, line: 298, baseType: !62, size: 8, offset: 784)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !193, file: !188, line: 302, baseType: !225, size: 512, offset: 832)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_dir", file: !4, line: 523, size: 512, elements: !226)
!226 = !{!227, !229, !231, !232, !233, !234, !235, !237, !243, !248}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !225, file: !4, line: 526, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !225, file: !4, line: 529, baseType: !230, size: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !225, file: !4, line: 530, baseType: !5, size: 32, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !225, file: !4, line: 534, baseType: !62, size: 8, offset: 160)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "user_supplied_p", scope: !225, file: !4, line: 537, baseType: !62, size: 8, offset: 168)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "canonical_name", scope: !225, file: !4, line: 541, baseType: !230, size: 64, offset: 192)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "name_map", scope: !225, file: !4, line: 545, baseType: !236, size: 64, offset: 256)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "construct", scope: !225, file: !4, line: 551, baseType: !238, size: 64, offset: 320)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{!230, !151, !241}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_dir", file: !4, line: 39, baseType: !225)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !225, file: !4, line: 555, baseType: !244, size: 64, offset: 384)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !245, line: 47, baseType: !246)
!245 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !247, line: 148, baseType: !148)
!247 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!248 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !225, file: !4, line: 556, baseType: !249, size: 64, offset: 448)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !245, line: 59, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !247, line: 145, baseType: !148)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "input_cset_desc", scope: !193, file: !188, line: 306, baseType: !252, size: 192, offset: 1344)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cset_converter", file: !188, line: 47, size: 192, elements: !253)
!253 = !{!254, !263, !264}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !252, file: !188, line: 49, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "convert_f", file: !188, line: 45, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{!62, !259, !75, !146, !261}
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "iconv_t", file: !260, line: 29, baseType: !51)
!260 = !DIFile(filename: "/usr/include/iconv.h", directory: "")
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_strbuf", file: !188, line: 43, flags: DIFlagFwdDecl)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "cd", scope: !252, file: !188, line: 50, baseType: !259, size: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !252, file: !188, line: 51, baseType: !162, size: 32, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "overlaid_buffer", scope: !187, file: !188, line: 328, baseType: !191, size: 64, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !187, file: !188, line: 331, baseType: !267, size: 160, offset: 128)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lexer_state", file: !188, line: 177, size: 160, elements: !268)
!268 = !{!269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "in_directive", scope: !267, file: !188, line: 180, baseType: !62, size: 8)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "directive_wants_padding", scope: !267, file: !188, line: 185, baseType: !62, size: 8, offset: 8)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "skipping", scope: !267, file: !188, line: 188, baseType: !62, size: 8, offset: 16)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "angled_headers", scope: !267, file: !188, line: 191, baseType: !62, size: 8, offset: 24)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "in_expression", scope: !267, file: !188, line: 194, baseType: !62, size: 8, offset: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "save_comments", scope: !267, file: !188, line: 198, baseType: !62, size: 8, offset: 40)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "va_args_ok", scope: !267, file: !188, line: 201, baseType: !62, size: 8, offset: 48)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "poisoned_ok", scope: !267, file: !188, line: 204, baseType: !62, size: 8, offset: 56)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "prevent_expansion", scope: !267, file: !188, line: 207, baseType: !62, size: 8, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "parsing_args", scope: !267, file: !188, line: 210, baseType: !62, size: 8, offset: 72)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "discarding_output", scope: !267, file: !188, line: 214, baseType: !62, size: 8, offset: 80)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "skip_eval", scope: !267, file: !188, line: 217, baseType: !5, size: 32, offset: 96)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "in_deferred_pragma", scope: !267, file: !188, line: 220, baseType: !62, size: 8, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "pragma_allow_expansion", scope: !267, file: !188, line: 223, baseType: !62, size: 8, offset: 136)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "line_table", scope: !187, file: !188, line: 334, baseType: !284, size: 64, offset: 320)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line_maps", file: !103, line: 74, size: 448, elements: !286)
!286 = !{!287, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "maps", scope: !285, file: !103, line: 75, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line_map", file: !103, line: 61, size: 192, elements: !290)
!290 = !{!291, !292, !294, !295, !296, !297, !298}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "to_file", scope: !289, file: !103, line: 62, baseType: !151, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "to_line", scope: !289, file: !103, line: 63, baseType: !293, size: 32, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "linenum_type", file: !103, line: 39, baseType: !5)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "start_location", scope: !289, file: !103, line: 64, baseType: !102, size: 32, offset: 96)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "included_from", scope: !289, file: !103, line: 65, baseType: !162, size: 32, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !289, file: !103, line: 66, baseType: !5, size: 8, offset: 160, flags: DIFlagBitField, extraData: i64 160)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !289, file: !103, line: 68, baseType: !62, size: 8, offset: 168)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "column_bits", scope: !289, file: !103, line: 70, baseType: !5, size: 8, offset: 176, flags: DIFlagBitField, extraData: i64 176)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !285, file: !103, line: 76, baseType: !5, size: 32, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !285, file: !103, line: 77, baseType: !5, size: 32, offset: 96)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !285, file: !103, line: 79, baseType: !5, size: 32, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "last_listed", scope: !285, file: !103, line: 84, baseType: !162, size: 32, offset: 160)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !285, file: !103, line: 87, baseType: !5, size: 32, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "trace_includes", scope: !285, file: !103, line: 90, baseType: !62, size: 8, offset: 224)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "highest_location", scope: !285, file: !103, line: 93, baseType: !102, size: 32, offset: 256)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "highest_line", scope: !285, file: !103, line: 96, baseType: !102, size: 32, offset: 288)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "max_column_hint", scope: !285, file: !103, line: 100, baseType: !5, size: 32, offset: 320)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "reallocator", scope: !285, file: !103, line: 104, baseType: !309, size: 64, offset: 384)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "line_map_realloc", file: !103, line: 47, baseType: !310)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DISubroutineType(types: !312)
!312 = !{!51, !51, !146}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "directive_line", scope: !187, file: !188, line: 337, baseType: !102, size: 32, offset: 384)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "a_buff", scope: !187, file: !188, line: 340, baseType: !315, size: 64, offset: 448)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cpp_buff", file: !188, line: 99, baseType: !317)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_buff", file: !188, line: 100, size: 256, elements: !318)
!318 = !{!319, !321, !322, !323}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !317, file: !188, line: 102, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !317, file: !188, line: 103, baseType: !149, size: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !317, file: !188, line: 103, baseType: !149, size: 64, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !317, file: !188, line: 103, baseType: !149, size: 64, offset: 192)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "u_buff", scope: !187, file: !188, line: 341, baseType: !315, size: 64, offset: 512)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "free_buffs", scope: !187, file: !188, line: 342, baseType: !315, size: 64, offset: 576)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "base_context", scope: !187, file: !188, line: 345, baseType: !327, size: 448, offset: 640)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_context", file: !188, line: 142, size: 448, elements: !328)
!328 = !{!329, !332, !333, !353, !354, !355}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !327, file: !188, line: 145, baseType: !330, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_context", file: !188, line: 141, baseType: !327)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !327, file: !188, line: 145, baseType: !330, size: 64, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !327, file: !188, line: 164, baseType: !334, size: 128, offset: 128)
!334 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !327, file: !188, line: 147, size: 128, elements: !335)
!335 = !{!336, !348}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "iso", scope: !334, file: !188, line: 156, baseType: !337, size: 128)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !334, file: !188, line: 152, size: 128, elements: !338)
!338 = !{!339, !347}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !337, file: !188, line: 154, baseType: !340, size: 64)
!340 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "utoken", file: !188, line: 121, size: 64, elements: !341)
!341 = !{!342, !345}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !340, file: !188, line: 123, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "ptoken", scope: !340, file: !188, line: 124, baseType: !346, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !337, file: !188, line: 155, baseType: !340, size: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "trad", scope: !334, file: !188, line: 163, baseType: !349, size: 128)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !334, file: !188, line: 159, size: 128, elements: !350)
!350 = !{!351, !352}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !349, file: !188, line: 161, baseType: !75, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit", scope: !349, file: !188, line: 162, baseType: !75, size: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !327, file: !188, line: 168, baseType: !315, size: 64, offset: 256)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !327, file: !188, line: 171, baseType: !66, size: 64, offset: 320)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "direct_p", scope: !327, file: !188, line: 174, baseType: !62, size: 8, offset: 384)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !187, file: !188, line: 346, baseType: !357, size: 64, offset: 1088)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "directive", scope: !187, file: !188, line: 349, baseType: !359, size: 64, offset: 1152)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !361)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "directive", file: !188, line: 40, flags: DIFlagFwdDecl)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "directive_result", scope: !187, file: !188, line: 352, baseType: !98, size: 192, offset: 1216)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "invocation_location", scope: !187, file: !188, line: 356, baseType: !102, size: 32, offset: 1408)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "set_invocation_location", scope: !187, file: !188, line: 360, baseType: !62, size: 8, offset: 1440)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "quote_include", scope: !187, file: !188, line: 363, baseType: !228, size: 64, offset: 1472)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "bracket_include", scope: !187, file: !188, line: 364, baseType: !228, size: 64, offset: 1536)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "no_search_path", scope: !187, file: !188, line: 365, baseType: !225, size: 512, offset: 1600)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "all_files", scope: !187, file: !188, line: 368, baseType: !213, size: 64, offset: 2112)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "main_file", scope: !187, file: !188, line: 370, baseType: !213, size: 64, offset: 2176)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "file_hash", scope: !187, file: !188, line: 373, baseType: !371, size: 64, offset: 2240)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !188, line: 373, flags: DIFlagFwdDecl)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "dir_hash", scope: !187, file: !188, line: 374, baseType: !371, size: 64, offset: 2304)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "file_hash_entries", scope: !187, file: !188, line: 375, baseType: !375, size: 64, offset: 2368)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "file_hash_entry_pool", file: !188, line: 375, flags: DIFlagFwdDecl)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "nonexistent_file_hash", scope: !187, file: !188, line: 378, baseType: !371, size: 64, offset: 2432)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "nonexistent_file_ob", scope: !187, file: !188, line: 379, baseType: !379, size: 704, offset: 2496)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !380, line: 164, size: 704, elements: !381)
!380 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!381 = !{!382, !384, !394, !395, !396, !397, !398, !399, !403, !407, !408, !409, !410}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !379, file: !380, line: 166, baseType: !383, size: 64)
!383 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !379, file: !380, line: 167, baseType: !385, size: 64, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !380, line: 157, size: 192, elements: !387)
!387 = !{!388, !389, !390}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !386, file: !380, line: 159, baseType: !230, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !386, file: !380, line: 160, baseType: !385, size: 64, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !386, file: !380, line: 161, baseType: !391, size: 32, offset: 128)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 32, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 4)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !379, file: !380, line: 168, baseType: !230, size: 64, offset: 128)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !379, file: !380, line: 169, baseType: !230, size: 64, offset: 192)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !379, file: !380, line: 170, baseType: !230, size: 64, offset: 256)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !379, file: !380, line: 171, baseType: !383, size: 64, offset: 320)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !379, file: !380, line: 172, baseType: !162, size: 32, offset: 384)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !379, file: !380, line: 176, baseType: !400, size: 64, offset: 448)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{!385, !51, !383}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !379, file: !380, line: 177, baseType: !404, size: 64, offset: 512)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{null, !51, !385}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !379, file: !380, line: 178, baseType: !51, size: 64, offset: 576)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !379, file: !380, line: 179, baseType: !5, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !379, file: !380, line: 180, baseType: !5, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !379, file: !380, line: 184, baseType: !5, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "quote_ignores_source_dir", scope: !187, file: !188, line: 383, baseType: !62, size: 8, offset: 3200)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "seen_once_only", scope: !187, file: !188, line: 387, baseType: !62, size: 8, offset: 3208)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "mi_cmacro", scope: !187, file: !188, line: 390, baseType: !414, size: 64, offset: 3264)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !67)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "mi_ind_cmacro", scope: !187, file: !188, line: 391, baseType: !414, size: 64, offset: 3328)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "mi_valid", scope: !187, file: !188, line: 392, baseType: !62, size: 8, offset: 3392)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "cur_token", scope: !187, file: !188, line: 395, baseType: !97, size: 64, offset: 3456)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "base_run", scope: !187, file: !188, line: 396, baseType: !420, size: 256, offset: 3520)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "tokenrun", file: !188, line: 128, baseType: !421)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tokenrun", file: !188, line: 129, size: 256, elements: !422)
!422 = !{!423, !425, !426, !427}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !421, file: !188, line: 131, baseType: !424, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !421, file: !188, line: 131, baseType: !424, size: 64, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !421, file: !188, line: 132, baseType: !97, size: 64, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !421, file: !188, line: 132, baseType: !97, size: 64, offset: 192)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "cur_run", scope: !187, file: !188, line: 396, baseType: !424, size: 64, offset: 3776)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "lookaheads", scope: !187, file: !188, line: 397, baseType: !5, size: 32, offset: 3840)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "keep_tokens", scope: !187, file: !188, line: 400, baseType: !5, size: 32, offset: 3872)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "macro_buffer", scope: !187, file: !188, line: 403, baseType: !149, size: 64, offset: 3904)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "macro_buffer_len", scope: !187, file: !188, line: 404, baseType: !5, size: 32, offset: 3968)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "narrow_cset_desc", scope: !187, file: !188, line: 408, baseType: !252, size: 192, offset: 4032)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_cset_desc", scope: !187, file: !188, line: 412, baseType: !252, size: 192, offset: 4224)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "char16_cset_desc", scope: !187, file: !188, line: 416, baseType: !252, size: 192, offset: 4416)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "char32_cset_desc", scope: !187, file: !188, line: 420, baseType: !252, size: 192, offset: 4608)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "wide_cset_desc", scope: !187, file: !188, line: 424, baseType: !252, size: 192, offset: 4800)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !187, file: !188, line: 427, baseType: !75, size: 64, offset: 4992)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !187, file: !188, line: 428, baseType: !75, size: 64, offset: 5056)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "avoid_paste", scope: !187, file: !188, line: 431, baseType: !98, size: 192, offset: 5120)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !187, file: !188, line: 432, baseType: !98, size: 192, offset: 5312)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "deps", scope: !187, file: !188, line: 435, baseType: !443, size: 64, offset: 5504)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "deps", file: !4, line: 685, flags: DIFlagFwdDecl)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "hash_ob", scope: !187, file: !188, line: 439, baseType: !379, size: 704, offset: 5568)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_ob", scope: !187, file: !188, line: 443, baseType: !379, size: 704, offset: 6272)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "pragmas", scope: !187, file: !188, line: 447, baseType: !448, size: 64, offset: 6976)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: "pragma_entry", file: !188, line: 447, flags: DIFlagFwdDecl)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !187, file: !188, line: 450, baseType: !451, size: 1088, offset: 7040)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_callbacks", file: !4, line: 472, size: 1088, elements: !452)
!452 = !{!453, !457, !463, !467, !471, !475, !476, !483, !487, !491, !495, !501, !505, !520, !521, !522, !526}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "line_change", scope: !451, file: !4, line: 475, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{null, !185, !343, !162}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "file_change", scope: !451, file: !4, line: 481, baseType: !458, size: 64, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{null, !185, !461}
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !289)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "dir_change", scope: !451, file: !4, line: 483, baseType: !464, size: 64, offset: 128)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DISubroutineType(types: !466)
!466 = !{null, !185, !151}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "include", scope: !451, file: !4, line: 484, baseType: !468, size: 64, offset: 192)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{null, !185, !5, !75, !151, !162, !346}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "define", scope: !451, file: !4, line: 486, baseType: !472, size: 64, offset: 256)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{null, !185, !5, !66}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "undef", scope: !451, file: !4, line: 487, baseType: !472, size: 64, offset: 320)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !451, file: !4, line: 488, baseType: !477, size: 64, offset: 384)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DISubroutineType(types: !479)
!479 = !{null, !185, !5, !480}
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !482)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_string", file: !4, line: 35, baseType: !115)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "def_pragma", scope: !451, file: !4, line: 489, baseType: !484, size: 64, offset: 448)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{null, !185, !5}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "valid_pch", scope: !451, file: !4, line: 490, baseType: !488, size: 64, offset: 512)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DISubroutineType(types: !490)
!490 = !{!162, !185, !151, !162}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "read_pch", scope: !451, file: !4, line: 491, baseType: !492, size: 64, offset: 576)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DISubroutineType(types: !494)
!494 = !{null, !185, !151, !162, !151}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "missing_header", scope: !451, file: !4, line: 492, baseType: !496, size: 64, offset: 640)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "missing_header_cb", file: !4, line: 469, baseType: !497)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DISubroutineType(types: !499)
!499 = !{!151, !185, !151, !500}
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "macro_to_expand", scope: !451, file: !4, line: 496, baseType: !502, size: 64, offset: 704)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DISubroutineType(types: !504)
!504 = !{!66, !185, !343}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !451, file: !4, line: 500, baseType: !506, size: 64, offset: 768)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DISubroutineType(types: !508)
!508 = !{!62, !185, !162, !102, !5, !151, !509}
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !511, line: 14, baseType: !512)
!511 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stdarg.h", directory: "")
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 216, baseType: !513)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, size: 192, elements: !63)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 216, size: 192, elements: !515)
!515 = !{!516, !517, !518, !519}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !514, file: !1, line: 216, baseType: !5, size: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !514, file: !1, line: 216, baseType: !5, size: 32, offset: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !514, file: !1, line: 216, baseType: !51, size: 64, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !514, file: !1, line: 216, baseType: !51, size: 64, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "used_define", scope: !451, file: !4, line: 506, baseType: !472, size: 64, offset: 832)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "used_undef", scope: !451, file: !4, line: 507, baseType: !472, size: 64, offset: 896)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "before_define", scope: !451, file: !4, line: 510, baseType: !523, size: 64, offset: 960)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{null, !185}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !451, file: !4, line: 513, baseType: !527, size: 64, offset: 1024)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{null, !185, !102, !66}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "hash_table", scope: !187, file: !188, line: 453, baseType: !531, size: 64, offset: 8128)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht", file: !72, line: 46, size: 1152, elements: !533)
!533 = !{!534, !535, !539, !545, !549, !550, !551, !553, !554, !555}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !532, file: !72, line: 49, baseType: !379, size: 704)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !532, file: !72, line: 51, baseType: !536, size: 64, offset: 704)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashnode", file: !72, line: 41, baseType: !538)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_node", scope: !532, file: !72, line: 53, baseType: !540, size: 64, offset: 768)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DISubroutineType(types: !542)
!542 = !{!537, !543}
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_table", file: !72, line: 40, baseType: !532)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_subobject", scope: !532, file: !72, line: 56, baseType: !546, size: 64, offset: 832)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DISubroutineType(types: !548)
!548 = !{!51, !146}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "nslots", scope: !532, file: !72, line: 58, baseType: !5, size: 32, offset: 896)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "nelements", scope: !532, file: !72, line: 59, baseType: !5, size: 32, offset: 928)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "pfile", scope: !532, file: !72, line: 62, baseType: !552, size: 64, offset: 960)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !532, file: !72, line: 65, baseType: !5, size: 32, offset: 1024)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !532, file: !72, line: 66, baseType: !5, size: 32, offset: 1056)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "entries_owned", scope: !532, file: !72, line: 69, baseType: !62, size: 8, offset: 1088)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "op_stack", scope: !187, file: !188, line: 456, baseType: !557, size: 64, offset: 8192)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DICompositeType(tag: DW_TAG_structure_type, name: "op", file: !188, line: 42, flags: DIFlagFwdDecl)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "op_limit", scope: !187, file: !188, line: 456, baseType: !557, size: 64, offset: 8256)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !187, file: !188, line: 459, baseType: !561, size: 1024, offset: 8320)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_options", file: !4, line: 279, size: 1024, elements: !562)
!562 = !{!563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !614, !615, !616, !617, !618, !619, !620, !621, !622}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "tabstop", scope: !561, file: !4, line: 282, baseType: !5, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "lang", scope: !561, file: !4, line: 285, baseType: !17, size: 32, offset: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "cplusplus", scope: !561, file: !4, line: 288, baseType: !62, size: 8, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "cplusplus_comments", scope: !561, file: !4, line: 291, baseType: !62, size: 8, offset: 72)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "objc", scope: !561, file: !4, line: 296, baseType: !62, size: 8, offset: 80)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "discard_comments", scope: !561, file: !4, line: 299, baseType: !62, size: 8, offset: 88)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "discard_comments_in_macro_exp", scope: !561, file: !4, line: 303, baseType: !62, size: 8, offset: 96)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "trigraphs", scope: !561, file: !4, line: 306, baseType: !62, size: 8, offset: 104)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "digraphs", scope: !561, file: !4, line: 309, baseType: !62, size: 8, offset: 112)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "extended_numbers", scope: !561, file: !4, line: 312, baseType: !62, size: 8, offset: 120)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "uliterals", scope: !561, file: !4, line: 315, baseType: !62, size: 8, offset: 128)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "print_include_names", scope: !561, file: !4, line: 318, baseType: !62, size: 8, offset: 136)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "warn_deprecated", scope: !561, file: !4, line: 321, baseType: !62, size: 8, offset: 144)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "warn_comments", scope: !561, file: !4, line: 324, baseType: !62, size: 8, offset: 152)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "warn_missing_include_dirs", scope: !561, file: !4, line: 328, baseType: !62, size: 8, offset: 160)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "warn_trigraphs", scope: !561, file: !4, line: 331, baseType: !62, size: 8, offset: 168)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "warn_multichar", scope: !561, file: !4, line: 334, baseType: !62, size: 8, offset: 176)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "warn_traditional", scope: !561, file: !4, line: 338, baseType: !62, size: 8, offset: 184)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "warn_long_long", scope: !561, file: !4, line: 341, baseType: !62, size: 8, offset: 192)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "warn_endif_labels", scope: !561, file: !4, line: 344, baseType: !62, size: 8, offset: 200)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "warn_num_sign_change", scope: !561, file: !4, line: 348, baseType: !62, size: 8, offset: 208)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "warn_variadic_macros", scope: !561, file: !4, line: 352, baseType: !62, size: 8, offset: 216)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "warn_builtin_macro_redefined", scope: !561, file: !4, line: 356, baseType: !62, size: 8, offset: 224)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !561, file: !4, line: 360, baseType: !62, size: 8, offset: 232)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "dollars_in_ident", scope: !561, file: !4, line: 363, baseType: !62, size: 8, offset: 240)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "extended_identifiers", scope: !561, file: !4, line: 366, baseType: !62, size: 8, offset: 248)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "warn_dollars", scope: !561, file: !4, line: 370, baseType: !62, size: 8, offset: 256)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "warn_undef", scope: !561, file: !4, line: 373, baseType: !62, size: 8, offset: 264)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "warn_unused_macros", scope: !561, file: !4, line: 376, baseType: !62, size: 8, offset: 272)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "c99", scope: !561, file: !4, line: 379, baseType: !62, size: 8, offset: 280)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "std", scope: !561, file: !4, line: 382, baseType: !62, size: 8, offset: 288)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "pedantic", scope: !561, file: !4, line: 385, baseType: !62, size: 8, offset: 296)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "preprocessed", scope: !561, file: !4, line: 389, baseType: !62, size: 8, offset: 304)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "show_column", scope: !561, file: !4, line: 392, baseType: !62, size: 8, offset: 312)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "operator_names", scope: !561, file: !4, line: 395, baseType: !62, size: 8, offset: 320)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "warn_cxx_operator_names", scope: !561, file: !4, line: 398, baseType: !62, size: 8, offset: 328)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "traditional", scope: !561, file: !4, line: 401, baseType: !62, size: 8, offset: 336)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "narrow_charset", scope: !561, file: !4, line: 404, baseType: !151, size: 64, offset: 384)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "wide_charset", scope: !561, file: !4, line: 407, baseType: !151, size: 64, offset: 448)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "input_charset", scope: !561, file: !4, line: 410, baseType: !151, size: 64, offset: 512)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "warn_normalize", scope: !561, file: !4, line: 414, baseType: !29, size: 32, offset: 576)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "warn_invalid_pch", scope: !561, file: !4, line: 417, baseType: !62, size: 8, offset: 608)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "restore_pch_deps", scope: !561, file: !4, line: 420, baseType: !62, size: 8, offset: 616)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "deps", scope: !561, file: !4, line: 441, baseType: !607, size: 64, offset: 640)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !561, file: !4, line: 423, size: 64, elements: !608)
!608 = !{!609, !610, !611, !612, !613}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !607, file: !4, line: 426, baseType: !35, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "missing_files", scope: !607, file: !4, line: 429, baseType: !62, size: 8, offset: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "phony_targets", scope: !607, file: !4, line: 433, baseType: !62, size: 8, offset: 40)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_main_file", scope: !607, file: !4, line: 436, baseType: !62, size: 8, offset: 48)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "need_preprocessor_output", scope: !607, file: !4, line: 440, baseType: !62, size: 8, offset: 56)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !561, file: !4, line: 447, baseType: !146, size: 64, offset: 704)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "char_precision", scope: !561, file: !4, line: 447, baseType: !146, size: 64, offset: 768)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "int_precision", scope: !561, file: !4, line: 447, baseType: !146, size: 64, offset: 832)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "wchar_precision", scope: !561, file: !4, line: 447, baseType: !146, size: 64, offset: 896)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_char", scope: !561, file: !4, line: 450, baseType: !62, size: 8, offset: 960)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_wchar", scope: !561, file: !4, line: 450, baseType: !62, size: 8, offset: 968)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_big_endian", scope: !561, file: !4, line: 454, baseType: !62, size: 8, offset: 976)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "stdc_0_in_system_headers", scope: !561, file: !4, line: 457, baseType: !62, size: 8, offset: 984)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "directives_only", scope: !561, file: !4, line: 460, baseType: !62, size: 8, offset: 992)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "spec_nodes", scope: !187, file: !188, line: 463, baseType: !624, size: 256, offset: 9344)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spec_nodes", file: !188, line: 227, size: 256, elements: !625)
!625 = !{!626, !627, !628, !629}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "n_defined", scope: !624, file: !188, line: 229, baseType: !66, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "n_true", scope: !624, file: !188, line: 230, baseType: !66, size: 64, offset: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "n_false", scope: !624, file: !188, line: 231, baseType: !66, size: 64, offset: 128)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "n__VA_ARGS__", scope: !624, file: !188, line: 232, baseType: !66, size: 64, offset: 192)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "our_hashtable", scope: !187, file: !188, line: 466, baseType: !62, size: 8, offset: 9600)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !187, file: !188, line: 475, baseType: !632, size: 256, offset: 9664)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !187, file: !188, line: 469, size: 256, elements: !633)
!633 = !{!634, !635, !636, !637}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !632, file: !188, line: 471, baseType: !149, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !632, file: !188, line: 472, baseType: !149, size: 64, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !632, file: !188, line: 473, baseType: !149, size: 64, offset: 128)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "first_line", scope: !632, file: !188, line: 474, baseType: !102, size: 32, offset: 192)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "saved_cur", scope: !187, file: !188, line: 478, baseType: !75, size: 64, offset: 9920)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "saved_rlimit", scope: !187, file: !188, line: 478, baseType: !75, size: 64, offset: 9984)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "saved_line_base", scope: !187, file: !188, line: 478, baseType: !75, size: 64, offset: 10048)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "savedstate", scope: !187, file: !188, line: 482, baseType: !642, size: 64, offset: 10112)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_savedstate", file: !188, line: 482, flags: DIFlagFwdDecl)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !187, file: !188, line: 485, baseType: !5, size: 32, offset: 10176)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "comments", scope: !187, file: !188, line: 488, baseType: !646, size: 128, offset: 10240)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_comment_table", file: !4, line: 901, baseType: !647)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 891, size: 128, elements: !648)
!648 = !{!649, !656, !657}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !647, file: !4, line: 894, baseType: !650, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_comment", file: !4, line: 887, baseType: !652)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 880, size: 128, elements: !653)
!653 = !{!654, !655}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !652, file: !4, line: 883, baseType: !230, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "sloc", scope: !652, file: !4, line: 886, baseType: !102, size: 32, offset: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !647, file: !4, line: 897, baseType: !162, size: 32, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !647, file: !4, line: 900, baseType: !162, size: 32, offset: 96)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "pushed_macros", scope: !187, file: !188, line: 491, baseType: !659, size: 64, offset: 10368)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_pragma_macro", file: !188, line: 310, size: 192, elements: !661)
!661 = !{!662, !663, !664}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !660, file: !188, line: 312, baseType: !659, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !660, file: !188, line: 314, baseType: !230, size: 64, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !660, file: !188, line: 316, baseType: !88, size: 64, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!667 = !{!668, !669, !670, !671}
!668 = !DILocalVariable(name: "pfile", arg: 1, scope: !182, file: !1, line: 268, type: !185)
!669 = !DILocalVariable(name: "start", arg: 2, scope: !182, file: !1, line: 268, type: !665)
!670 = !DILocalVariable(name: "len", arg: 3, scope: !182, file: !1, line: 268, type: !146)
!671 = !DILocalVariable(name: "buffer", scope: !182, file: !1, line: 270, type: !191)
!672 = !DILocation(line: 0, scope: !182)
!673 = !DILocation(line: 270, column: 31, scope: !182)
!674 = !DILocation(line: 272, column: 10, scope: !182)
!675 = !DILocation(line: 272, column: 26, scope: !182)
!676 = !DILocation(line: 273, column: 30, scope: !182)
!677 = !DILocation(line: 273, column: 10, scope: !182)
!678 = !DILocation(line: 273, column: 20, scope: !182)
!679 = !DILocation(line: 274, column: 33, scope: !182)
!680 = !DILocation(line: 274, column: 10, scope: !182)
!681 = !DILocation(line: 274, column: 23, scope: !182)
!682 = !DILocation(line: 275, column: 36, scope: !182)
!683 = !DILocation(line: 275, column: 10, scope: !182)
!684 = !DILocation(line: 275, column: 26, scope: !182)
!685 = !DILocation(line: 276, column: 11, scope: !182)
!686 = !DILocation(line: 276, column: 21, scope: !182)
!687 = !DILocation(line: 278, column: 11, scope: !182)
!688 = !DILocation(line: 278, column: 15, scope: !182)
!689 = !DILocation(line: 279, column: 11, scope: !182)
!690 = !DILocation(line: 279, column: 21, scope: !182)
!691 = !DILocation(line: 280, column: 26, scope: !182)
!692 = !DILocation(line: 280, column: 18, scope: !182)
!693 = !DILocation(line: 281, column: 1, scope: !182)
!694 = distinct !DISubprogram(name: "_cpp_remove_overlay", scope: !1, file: !1, line: 285, type: !524, scopeLine: 286, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !695)
!695 = !{!696, !697}
!696 = !DILocalVariable(name: "pfile", arg: 1, scope: !694, file: !1, line: 285, type: !185)
!697 = !DILocalVariable(name: "buffer", scope: !694, file: !1, line: 287, type: !191)
!698 = !DILocation(line: 0, scope: !694)
!699 = !DILocation(line: 287, column: 31, scope: !694)
!700 = !DILocation(line: 289, column: 24, scope: !694)
!701 = !DILocation(line: 289, column: 15, scope: !694)
!702 = !DILocation(line: 290, column: 27, scope: !694)
!703 = !DILocation(line: 290, column: 11, scope: !694)
!704 = !DILocation(line: 290, column: 18, scope: !694)
!705 = !DILocation(line: 291, column: 30, scope: !694)
!706 = !DILocation(line: 291, column: 11, scope: !694)
!707 = !DILocation(line: 291, column: 21, scope: !694)
!708 = !DILocation(line: 292, column: 11, scope: !694)
!709 = !DILocation(line: 292, column: 21, scope: !694)
!710 = !DILocation(line: 294, column: 26, scope: !694)
!711 = !DILocation(line: 295, column: 1, scope: !694)
!712 = distinct !DISubprogram(name: "_cpp_read_logical_line_trad", scope: !1, file: !1, line: 300, type: !713, scopeLine: 301, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !715)
!713 = !DISubroutineType(types: !714)
!714 = !{!62, !185}
!715 = !{!716}
!716 = !DILocalVariable(name: "pfile", arg: 1, scope: !712, file: !1, line: 300, type: !185)
!717 = !DILocation(line: 0, scope: !712)
!718 = !DILocation(line: 0, scope: !719)
!719 = distinct !DILexicalBlock(scope: !720, file: !1, line: 304, column: 11)
!720 = distinct !DILexicalBlock(scope: !712, file: !1, line: 303, column: 5)
!721 = !DILocation(line: 302, column: 3, scope: !712)
!722 = !DILocation(line: 304, column: 18, scope: !719)
!723 = !DILocation(line: 304, column: 26, scope: !719)
!724 = !DILocation(line: 304, column: 11, scope: !719)
!725 = !DILocation(line: 304, column: 36, scope: !719)
!726 = !DILocation(line: 304, column: 40, scope: !719)
!727 = !DILocation(line: 304, column: 11, scope: !720)
!728 = !DILocation(line: 307, column: 11, scope: !712)
!729 = !DILocation(line: 307, column: 52, scope: !712)
!730 = distinct !{!730, !721, !731}
!731 = !DILocation(line: 307, column: 76, scope: !712)
!732 = !DILocation(line: 307, column: 68, scope: !712)
!733 = !DILocation(line: 306, column: 5, scope: !720)
!734 = !DILocation(line: 309, column: 17, scope: !712)
!735 = !DILocation(line: 309, column: 24, scope: !712)
!736 = !DILocation(line: 309, column: 10, scope: !712)
!737 = !DILocation(line: 309, column: 3, scope: !712)
!738 = !DILocation(line: 310, column: 1, scope: !712)
!739 = distinct !DISubprogram(name: "_cpp_scan_out_logical_line", scope: !1, file: !1, line: 345, type: !740, scopeLine: 346, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !742)
!740 = !DISubroutineType(types: !741)
!741 = !{!62, !185, !88}
!742 = !{!743, !744, !745, !746, !747, !748, !749, !758, !759, !760, !761, !762, !763, !764, !772, !773, !774, !777, !778, !783, !789, !790, !791, !793, !794}
!743 = !DILocalVariable(name: "pfile", arg: 1, scope: !739, file: !1, line: 345, type: !185)
!744 = !DILocalVariable(name: "macro", arg: 2, scope: !739, file: !1, line: 345, type: !88)
!745 = !DILocalVariable(name: "result", scope: !739, file: !1, line: 347, type: !62)
!746 = !DILocalVariable(name: "context", scope: !739, file: !1, line: 348, type: !330)
!747 = !DILocalVariable(name: "cur", scope: !739, file: !1, line: 349, type: !665)
!748 = !DILocalVariable(name: "out", scope: !739, file: !1, line: 350, type: !145)
!749 = !DILocalVariable(name: "fmacro", scope: !739, file: !1, line: 351, type: !750)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fun_macro", file: !1, line: 47, size: 320, elements: !751)
!751 = !{!752, !753, !754, !755, !756, !757}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !750, file: !1, line: 50, baseType: !315, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !750, file: !1, line: 56, baseType: !150, size: 64, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !750, file: !1, line: 59, baseType: !66, size: 64, offset: 128)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !750, file: !1, line: 62, baseType: !146, size: 64, offset: 192)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !750, file: !1, line: 65, baseType: !102, size: 32, offset: 256)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !750, file: !1, line: 68, baseType: !5, size: 32, offset: 288)
!758 = !DILocalVariable(name: "c", scope: !739, file: !1, line: 352, type: !5)
!759 = !DILocalVariable(name: "paren_depth", scope: !739, file: !1, line: 352, type: !5)
!760 = !DILocalVariable(name: "quote", scope: !739, file: !1, line: 352, type: !5)
!761 = !DILocalVariable(name: "lex_state", scope: !739, file: !1, line: 353, type: !40)
!762 = !DILocalVariable(name: "header_ok", scope: !739, file: !1, line: 354, type: !62)
!763 = !DILocalVariable(name: "start_of_input_line", scope: !739, file: !1, line: 355, type: !665)
!764 = !DILocalVariable(name: "line_table", scope: !765, file: !1, line: 414, type: !770)
!765 = distinct !DILexicalBlock(scope: !766, file: !1, line: 414, column: 4)
!766 = distinct !DILexicalBlock(scope: !767, file: !1, line: 393, column: 2)
!767 = distinct !DILexicalBlock(scope: !768, file: !1, line: 380, column: 5)
!768 = distinct !DILexicalBlock(scope: !769, file: !1, line: 379, column: 3)
!769 = distinct !DILexicalBlock(scope: !739, file: !1, line: 379, column: 3)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !285)
!772 = !DILocalVariable(name: "map", scope: !765, file: !1, line: 414, type: !461)
!773 = !DILocalVariable(name: "line", scope: !765, file: !1, line: 414, type: !293)
!774 = !DILocalVariable(name: "node", scope: !775, file: !1, line: 477, type: !66)
!775 = distinct !DILexicalBlock(scope: !776, file: !1, line: 476, column: 6)
!776 = distinct !DILexicalBlock(scope: !766, file: !1, line: 475, column: 8)
!777 = !DILocalVariable(name: "out_start", scope: !775, file: !1, line: 478, type: !145)
!778 = !DILocalVariable(name: "m", scope: !779, file: !1, line: 566, type: !88)
!779 = distinct !DILexicalBlock(scope: !780, file: !1, line: 565, column: 3)
!780 = distinct !DILexicalBlock(scope: !781, file: !1, line: 564, column: 12)
!781 = distinct !DILexicalBlock(scope: !782, file: !1, line: 562, column: 6)
!782 = distinct !DILexicalBlock(scope: !766, file: !1, line: 561, column: 8)
!783 = !DILocalVariable(name: "line_table", scope: !784, file: !1, line: 615, type: !770)
!784 = distinct !DILexicalBlock(scope: !785, file: !1, line: 615, column: 5)
!785 = distinct !DILexicalBlock(scope: !786, file: !1, line: 611, column: 3)
!786 = distinct !DILexicalBlock(scope: !787, file: !1, line: 610, column: 12)
!787 = distinct !DILexicalBlock(scope: !788, file: !1, line: 599, column: 6)
!788 = distinct !DILexicalBlock(scope: !766, file: !1, line: 595, column: 8)
!789 = !DILocalVariable(name: "map", scope: !784, file: !1, line: 615, type: !461)
!790 = !DILocalVariable(name: "line", scope: !784, file: !1, line: 615, type: !293)
!791 = !DILocalVariable(name: "do_it", scope: !792, file: !1, line: 621, type: !62)
!792 = distinct !DILexicalBlock(scope: !786, file: !1, line: 620, column: 3)
!793 = !DILabel(scope: !739, name: "new_context", file: !1, line: 373)
!794 = !DILabel(scope: !739, name: "done", file: !1, line: 676)
!795 = !DILocation(line: 0, scope: !739)
!796 = !DILocation(line: 351, column: 3, scope: !739)
!797 = !DILocation(line: 357, column: 10, scope: !739)
!798 = !DILocation(line: 357, column: 15, scope: !739)
!799 = !DILocation(line: 358, column: 10, scope: !739)
!800 = !DILocation(line: 358, column: 15, scope: !739)
!801 = !DILocation(line: 359, column: 10, scope: !739)
!802 = !DILocation(line: 359, column: 15, scope: !739)
!803 = !DILocation(line: 360, column: 10, scope: !739)
!804 = !DILocation(line: 360, column: 17, scope: !739)
!805 = !DILocation(line: 361, column: 10, scope: !739)
!806 = !DILocation(line: 361, column: 15, scope: !739)
!807 = !DILocation(line: 362, column: 10, scope: !739)
!808 = !DILocation(line: 362, column: 15, scope: !739)
!809 = !DILocation(line: 365, column: 28, scope: !739)
!810 = !DILocation(line: 366, column: 33, scope: !739)
!811 = !DILocation(line: 366, column: 41, scope: !739)
