; ModuleID = 'cpp_files.bc'
source_filename = "cpp_files.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.pchf_data = type { i64, i8, [1 x %struct.pchf_entry] }
%struct.pchf_entry = type { i64, [16 x i8], i8 }
%struct._cpp_file = type { i8*, i8*, i8*, i8*, %struct._cpp_file*, i8*, i8*, %struct.cpp_hashnode*, %struct.cpp_dir*, %struct.stat, i32, i32, i16, i8, i8, i8, i8 }
%struct.cpp_hashnode = type { %struct.ht_identifier, i8, i8, i16, %union._cpp_hashnode_value }
%struct.ht_identifier = type { i8*, i32, i32 }
%union._cpp_hashnode_value = type { %struct.cpp_macro* }
%struct.cpp_macro = type { %struct.cpp_hashnode**, %union.cpp_macro_u, i32, i32, i16, i8 }
%union.cpp_macro_u = type { %struct.cpp_token* }
%struct.cpp_token = type { i32, i8, i16, %union.cpp_token_u }
%union.cpp_token_u = type { %struct.cpp_string }
%struct.cpp_string = type { i32, i8* }
%struct.cpp_dir = type { %struct.cpp_dir*, i8*, i32, i8, i8, i8*, i8**, i8* (i8*, %struct.cpp_dir*)*, i64, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "pchf", scope: !2, file: !3, line: 1677, type: !252, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !56, globals: !298, nameTableKind: None)
!3 = !DIFile(filename: "cpp_files.c", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!4 = !{!5, !19, !31, !37, !42, !49}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cpp_builtin_type", file: !6, line: 593, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./cpplib.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!9 = !DIEnumerator(name: "BT_SPECLINE", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "BT_DATE", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "BT_FILE", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "BT_BASE_FILE", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "BT_INCLUDE_LEVEL", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "BT_TIME", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "BT_STDC", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "BT_PRAGMA", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "BT_TIMESTAMP", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "BT_COUNTER", value: 9, isUnsigned: true)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_lang", file: !6, line: 158, baseType: !7, size: 32, elements: !20)
!20 = !{!21, !22, !23, !24, !25, !26, !27, !28, !29, !30}
!21 = !DIEnumerator(name: "CLK_GNUC89", value: 0, isUnsigned: true)
!22 = !DIEnumerator(name: "CLK_GNUC99", value: 1, isUnsigned: true)
!23 = !DIEnumerator(name: "CLK_STDC89", value: 2, isUnsigned: true)
!24 = !DIEnumerator(name: "CLK_STDC94", value: 3, isUnsigned: true)
!25 = !DIEnumerator(name: "CLK_STDC99", value: 4, isUnsigned: true)
!26 = !DIEnumerator(name: "CLK_GNUCXX", value: 5, isUnsigned: true)
!27 = !DIEnumerator(name: "CLK_CXX98", value: 6, isUnsigned: true)
!28 = !DIEnumerator(name: "CLK_GNUCXX0X", value: 7, isUnsigned: true)
!29 = !DIEnumerator(name: "CLK_CXX0X", value: 8, isUnsigned: true)
!30 = !DIEnumerator(name: "CLK_ASM", value: 9, isUnsigned: true)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cpp_normalize_level", file: !6, line: 265, baseType: !7, size: 32, elements: !32)
!32 = !{!33, !34, !35, !36}
!33 = !DIEnumerator(name: "normalized_KC", value: 0, isUnsigned: true)
!34 = !DIEnumerator(name: "normalized_C", value: 1, isUnsigned: true)
!35 = !DIEnumerator(name: "normalized_identifier_C", value: 2, isUnsigned: true)
!36 = !DIEnumerator(name: "normalized_none", value: 3, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cpp_deps_style", file: !6, line: 262, baseType: !7, size: 32, elements: !38)
!38 = !{!39, !40, !41}
!39 = !DIEnumerator(name: "DEPS_NONE", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "DEPS_USER", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "DEPS_SYSTEM", value: 2, isUnsigned: true)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "include_type", file: !43, line: 119, baseType: !7, size: 32, elements: !44)
!43 = !DIFile(filename: "./internal.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!44 = !{!45, !46, !47, !48}
!45 = !DIEnumerator(name: "IT_INCLUDE", value: 0, isUnsigned: true)
!46 = !DIEnumerator(name: "IT_INCLUDE_NEXT", value: 1, isUnsigned: true)
!47 = !DIEnumerator(name: "IT_IMPORT", value: 2, isUnsigned: true)
!48 = !DIEnumerator(name: "IT_CMDLINE", value: 3, isUnsigned: true)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "lc_reason", file: !50, line: 36, baseType: !7, size: 32, elements: !51)
!50 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!51 = !{!52, !53, !54, !55}
!52 = !DIEnumerator(name: "LC_ENTER", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "LC_LEAVE", value: 1, isUnsigned: true)
!54 = !DIEnumerator(name: "LC_RENAME", value: 2, isUnsigned: true)
!55 = !DIEnumerator(name: "LC_RENAME_VERBATIM", value: 3, isUnsigned: true)
!56 = !{!57, !58, !71, !59, !244, !247, !250, !252, !80, !79, !156, !64, !269, !271, !272, !274, !101, !282, !291, !296}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_hash_entry", file: !3, line: 157, size: 256, elements: !61)
!61 = !{!62, !63, !95, !97}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !60, file: !3, line: 159, baseType: !59, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "start_dir", scope: !60, file: !3, line: 160, baseType: !64, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_dir", file: !6, line: 39, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_dir", file: !6, line: 523, size: 512, elements: !67)
!67 = !{!68, !70, !73, !74, !76, !77, !78, !82, !86, !92}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !66, file: !6, line: 526, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !66, file: !6, line: 529, baseType: !71, size: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !66, file: !6, line: 530, baseType: !7, size: 32, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !66, file: !6, line: 534, baseType: !75, size: 8, offset: 160)
!75 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "user_supplied_p", scope: !66, file: !6, line: 537, baseType: !75, size: 8, offset: 168)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "canonical_name", scope: !66, file: !6, line: 541, baseType: !71, size: 64, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "name_map", scope: !66, file: !6, line: 545, baseType: !79, size: 64, offset: 256)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "construct", scope: !66, file: !6, line: 551, baseType: !83, size: 64, offset: 320)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{!71, !80, !64}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !66, file: !6, line: 555, baseType: !87, size: 64, offset: 384)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !88, line: 47, baseType: !89)
!88 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !90, line: 148, baseType: !91)
!90 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!91 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !66, file: !6, line: 556, baseType: !93, size: 64, offset: 448)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !88, line: 59, baseType: !94)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !90, line: 145, baseType: !91)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !60, file: !3, line: 161, baseType: !96, size: 32, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !50, line: 44, baseType: !7)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !60, file: !3, line: 166, baseType: !98, size: 64, offset: 192)
!98 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !60, file: !3, line: 162, size: 64, elements: !99)
!99 = !{!100, !243}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !98, file: !3, line: 164, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cpp_file", file: !43, line: 560, baseType: !103)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_file", file: !3, line: 71, size: 1856, elements: !104)
!104 = !{!105, !106, !107, !108, !109, !111, !114, !115, !198, !199, !236, !237, !238, !239, !240, !241, !242}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !103, file: !3, line: 74, baseType: !80, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !103, file: !3, line: 77, baseType: !80, size: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "pchname", scope: !103, file: !3, line: 80, baseType: !80, size: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "dir_name", scope: !103, file: !3, line: 84, baseType: !80, size: 64, offset: 192)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "next_file", scope: !103, file: !3, line: 87, baseType: !110, size: 64, offset: 256)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !103, file: !3, line: 90, baseType: !112, size: 64, offset: 320)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !103, file: !3, line: 94, baseType: !112, size: 64, offset: 384)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "cmacro", scope: !103, file: !3, line: 97, baseType: !116, size: 64, offset: 448)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_hashnode", file: !6, line: 36, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_hashnode", file: !6, line: 644, size: 256, elements: !120)
!120 = !{!121, !128, !129, !130, !131, !132, !133}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !119, file: !6, line: 645, baseType: !122, size: 128)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !123, line: 31, size: 128, elements: !124)
!123 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!124 = !{!125, !126, !127}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !122, file: !123, line: 32, baseType: !112, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !122, file: !123, line: 33, baseType: !7, size: 32, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !122, file: !123, line: 34, baseType: !7, size: 32, offset: 96)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "is_directive", scope: !119, file: !6, line: 646, baseType: !7, size: 1, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "directive_index", scope: !119, file: !6, line: 647, baseType: !7, size: 7, offset: 129, flags: DIFlagBitField, extraData: i64 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "rid_code", scope: !119, file: !6, line: 650, baseType: !75, size: 8, offset: 136)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !119, file: !6, line: 651, baseType: !7, size: 6, offset: 144, flags: DIFlagBitField, extraData: i64 144)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !119, file: !6, line: 652, baseType: !7, size: 10, offset: 150, flags: DIFlagBitField, extraData: i64 144)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !119, file: !6, line: 654, baseType: !134, size: 64, offset: 192)
!134 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_cpp_hashnode_value", file: !6, line: 633, size: 64, elements: !135)
!135 = !{!136, !186, !196, !197}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !134, file: !6, line: 635, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_macro", file: !6, line: 37, baseType: !139)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_macro", file: !140, line: 36, size: 256, elements: !141)
!140 = !DIFile(filename: "./cpp-id-data.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!141 = !{!142, !145, !177, !178, !179, !180, !181, !182, !183, !184, !185}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !139, file: !140, line: 42, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !139, file: !140, line: 51, baseType: !146, size: 64, offset: 64)
!146 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cpp_macro_u", file: !140, line: 47, size: 64, elements: !147)
!147 = !{!148, !176}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "tokens", scope: !146, file: !140, line: 49, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_token", file: !6, line: 34, baseType: !151)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_token", file: !6, line: 212, size: 192, elements: !152)
!152 = !{!153, !154, !155, !157}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "src_loc", scope: !151, file: !6, line: 213, baseType: !96, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !151, file: !6, line: 214, baseType: !7, size: 8, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !151, file: !6, line: 215, baseType: !156, size: 16, offset: 48)
!156 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !151, file: !6, line: 237, baseType: !158, size: 128, offset: 64)
!158 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cpp_token_u", file: !6, line: 217, size: 128, elements: !159)
!159 = !{!160, !164, !165, !170, !174, !175}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !158, file: !6, line: 220, baseType: !161, size: 64)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_identifier", file: !6, line: 201, size: 64, elements: !162)
!162 = !{!163}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !161, file: !6, line: 207, baseType: !144, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !158, file: !6, line: 223, baseType: !149, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !158, file: !6, line: 226, baseType: !166, size: 128)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_string", file: !6, line: 162, size: 128, elements: !167)
!167 = !{!168, !169}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !166, file: !6, line: 163, baseType: !7, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !166, file: !6, line: 164, baseType: !112, size: 64, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "macro_arg", scope: !158, file: !6, line: 229, baseType: !171, size: 32)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_macro_arg", file: !6, line: 195, size: 32, elements: !172)
!172 = !{!173}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "arg_no", scope: !171, file: !6, line: 197, baseType: !7, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "token_no", scope: !158, file: !6, line: 233, baseType: !7, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "pragma", scope: !158, file: !6, line: 236, baseType: !7, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !146, file: !140, line: 50, baseType: !112, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !139, file: !140, line: 54, baseType: !96, size: 32, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !139, file: !140, line: 57, baseType: !7, size: 32, offset: 160)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "paramc", scope: !139, file: !140, line: 60, baseType: !156, size: 16, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "fun_like", scope: !139, file: !140, line: 63, baseType: !7, size: 1, offset: 208, flags: DIFlagBitField, extraData: i64 208)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "variadic", scope: !139, file: !140, line: 66, baseType: !7, size: 1, offset: 209, flags: DIFlagBitField, extraData: i64 208)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "syshdr", scope: !139, file: !140, line: 69, baseType: !7, size: 1, offset: 210, flags: DIFlagBitField, extraData: i64 208)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !139, file: !140, line: 72, baseType: !7, size: 1, offset: 211, flags: DIFlagBitField, extraData: i64 208)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "traditional", scope: !139, file: !140, line: 75, baseType: !7, size: 1, offset: 212, flags: DIFlagBitField, extraData: i64 208)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "extra_tokens", scope: !139, file: !140, line: 80, baseType: !7, size: 1, offset: 213, flags: DIFlagBitField, extraData: i64 208)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "answers", scope: !134, file: !6, line: 637, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "answer", file: !140, line: 28, size: 320, elements: !189)
!189 = !{!190, !191, !192}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !188, file: !140, line: 29, baseType: !187, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !188, file: !140, line: 30, baseType: !7, size: 32, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !188, file: !140, line: 31, baseType: !193, size: 192, offset: 128)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 192, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 1)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "builtin", scope: !134, file: !6, line: 639, baseType: !5, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "arg_index", scope: !134, file: !6, line: 641, baseType: !156, size: 16)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !103, file: !3, line: 102, baseType: !64, size: 64, offset: 512)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !103, file: !3, line: 105, baseType: !200, size: 1152, offset: 576)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !201, line: 46, size: 1152, elements: !202)
!201 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!202 = !{!203, !204, !205, !207, !209, !211, !213, !215, !216, !219, !221, !223, !225, !227, !228, !229, !230, !231}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !200, file: !201, line: 48, baseType: !94, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !200, file: !201, line: 53, baseType: !89, size: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !200, file: !201, line: 61, baseType: !206, size: 64, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !90, line: 151, baseType: !91)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !200, file: !201, line: 62, baseType: !208, size: 32, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !90, line: 150, baseType: !7)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !200, file: !201, line: 64, baseType: !210, size: 32, offset: 224)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !90, line: 146, baseType: !7)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !200, file: !201, line: 65, baseType: !212, size: 32, offset: 256)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !90, line: 147, baseType: !7)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !200, file: !201, line: 67, baseType: !214, size: 32, offset: 288)
!214 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !200, file: !201, line: 69, baseType: !94, size: 64, offset: 320)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !200, file: !201, line: 74, baseType: !217, size: 64, offset: 384)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !90, line: 152, baseType: !218)
!218 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !200, file: !201, line: 78, baseType: !220, size: 64, offset: 448)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !90, line: 174, baseType: !218)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !200, file: !201, line: 80, baseType: !222, size: 64, offset: 512)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !90, line: 179, baseType: !218)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "st_atime", scope: !200, file: !201, line: 98, baseType: !224, size: 64, offset: 576)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !90, line: 160, baseType: !218)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "st_atimensec", scope: !200, file: !201, line: 99, baseType: !226, size: 64, offset: 640)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_ulong_t", file: !90, line: 198, baseType: !91)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtime", scope: !200, file: !201, line: 100, baseType: !224, size: 64, offset: 704)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtimensec", scope: !200, file: !201, line: 101, baseType: !226, size: 64, offset: 768)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctime", scope: !200, file: !201, line: 102, baseType: !224, size: 64, offset: 832)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctimensec", scope: !200, file: !201, line: 103, baseType: !226, size: 64, offset: 896)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !200, file: !201, line: 106, baseType: !232, size: 192, offset: 960)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 192, elements: !234)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !90, line: 196, baseType: !218)
!234 = !{!235}
!235 = !DISubrange(count: 3)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !103, file: !3, line: 108, baseType: !214, size: 32, offset: 1728)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "err_no", scope: !103, file: !3, line: 112, baseType: !214, size: 32, offset: 1760)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "stack_count", scope: !103, file: !3, line: 115, baseType: !156, size: 16, offset: 1792)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "once_only", scope: !103, file: !3, line: 118, baseType: !75, size: 8, offset: 1808)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "dont_read", scope: !103, file: !3, line: 121, baseType: !75, size: 8, offset: 1816)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "main_file", scope: !103, file: !3, line: 124, baseType: !75, size: 8, offset: 1824)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_valid", scope: !103, file: !3, line: 127, baseType: !75, size: 8, offset: 1832)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !98, file: !3, line: 165, baseType: !64, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{!57, !218}
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{null, !57}
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !251, line: 35, baseType: !218)
!251 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pchf_data", file: !3, line: 1665, size: 384, elements: !254)
!254 = !{!255, !257, !258}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !253, file: !3, line: 1667, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !251, line: 46, baseType: !91)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "have_once_only", scope: !253, file: !3, line: 1672, baseType: !75, size: 8, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !253, file: !3, line: 1674, baseType: !259, size: 256, offset: 128)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 256, elements: !194)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pchf_entry", file: !3, line: 1655, size: 256, elements: !261)
!261 = !{!262, !264, !268}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !260, file: !3, line: 1658, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !88, line: 85, baseType: !217)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "sum", scope: !260, file: !3, line: 1660, baseType: !265, size: 128, offset: 64)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 128, elements: !266)
!266 = !{!267}
!267 = !DISubrange(count: 16)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "once_only", scope: !260, file: !3, line: 1662, baseType: !75, size: 8, offset: 192)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !88, line: 108, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !90, line: 193, baseType: !218)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !260)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pchf_compare_data", file: !3, line: 1781, size: 320, elements: !276)
!276 = !{!277, !278, !279, !280, !281}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !275, file: !3, line: 1784, baseType: !263, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "sum", scope: !275, file: !3, line: 1787, baseType: !265, size: 128, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "sum_computed", scope: !275, file: !3, line: 1790, baseType: !75, size: 8, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "check_included", scope: !275, file: !3, line: 1793, baseType: !75, size: 8, offset: 200)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !275, file: !3, line: 1796, baseType: !101, size: 64, offset: 256)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_hash_entry_pool", file: !3, line: 174, size: 32640, elements: !284)
!284 = !{!285, !286, !287}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "file_hash_entries_used", scope: !283, file: !3, line: 177, baseType: !7, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !283, file: !3, line: 179, baseType: !282, size: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !283, file: !3, line: 181, baseType: !288, size: 32512, offset: 128)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 32512, elements: !289)
!289 = !{!290}
!290 = !DISubrange(count: 127)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "report_missing_guard_data", file: !3, line: 1259, size: 128, elements: !293)
!293 = !{!294, !295}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !292, file: !3, line: 1261, baseType: !79, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !292, file: !3, line: 1262, baseType: !256, size: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !80)
!298 = !{!0, !299, !369}
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "FILE_NAME_MAP_FILE", scope: !301, file: !3, line: 1475, type: !366, isLocal: true, isDefinition: true)
!301 = distinct !DISubprogram(name: "read_name_map", scope: !3, file: !3, line: 1473, type: !302, scopeLine: 1474, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !304)
!302 = !DISubroutineType(types: !303)
!303 = !{null, !64}
!304 = !{!305, !306, !307, !358, !359, !360, !361, !364}
!305 = !DILocalVariable(name: "dir", arg: 1, scope: !301, file: !3, line: 1473, type: !64)
!306 = !DILocalVariable(name: "name", scope: !301, file: !3, line: 1476, type: !71)
!307 = !DILocalVariable(name: "f", scope: !301, file: !3, line: 1477, type: !308)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !310, line: 7, baseType: !311)
!310 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !312, line: 49, size: 1728, elements: !313)
!312 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!313 = !{!314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !329, !331, !332, !333, !334, !335, !337, !339, !342, !344, !347, !350, !351, !352, !353, !354}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !311, file: !312, line: 51, baseType: !214, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !311, file: !312, line: 54, baseType: !71, size: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !311, file: !312, line: 55, baseType: !71, size: 64, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !311, file: !312, line: 56, baseType: !71, size: 64, offset: 192)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !311, file: !312, line: 57, baseType: !71, size: 64, offset: 256)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !311, file: !312, line: 58, baseType: !71, size: 64, offset: 320)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !311, file: !312, line: 59, baseType: !71, size: 64, offset: 384)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !311, file: !312, line: 60, baseType: !71, size: 64, offset: 448)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !311, file: !312, line: 61, baseType: !71, size: 64, offset: 512)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !311, file: !312, line: 64, baseType: !71, size: 64, offset: 576)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !311, file: !312, line: 65, baseType: !71, size: 64, offset: 640)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !311, file: !312, line: 66, baseType: !71, size: 64, offset: 704)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !311, file: !312, line: 68, baseType: !327, size: 64, offset: 768)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !312, line: 36, flags: DIFlagFwdDecl)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !311, file: !312, line: 70, baseType: !330, size: 64, offset: 832)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !311, file: !312, line: 72, baseType: !214, size: 32, offset: 896)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !311, file: !312, line: 73, baseType: !214, size: 32, offset: 928)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !311, file: !312, line: 74, baseType: !217, size: 64, offset: 960)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !311, file: !312, line: 77, baseType: !156, size: 16, offset: 1024)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !311, file: !312, line: 78, baseType: !336, size: 8, offset: 1040)
!336 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !311, file: !312, line: 79, baseType: !338, size: 8, offset: 1048)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 8, elements: !194)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !311, file: !312, line: 81, baseType: !340, size: 64, offset: 1088)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !312, line: 43, baseType: null)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !311, file: !312, line: 89, baseType: !343, size: 64, offset: 1152)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !90, line: 153, baseType: !218)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !311, file: !312, line: 91, baseType: !345, size: 64, offset: 1216)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !312, line: 37, flags: DIFlagFwdDecl)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !311, file: !312, line: 92, baseType: !348, size: 64, offset: 1280)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !312, line: 38, flags: DIFlagFwdDecl)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !311, file: !312, line: 93, baseType: !330, size: 64, offset: 1344)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !311, file: !312, line: 94, baseType: !57, size: 64, offset: 1408)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !311, file: !312, line: 95, baseType: !256, size: 64, offset: 1472)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !311, file: !312, line: 96, baseType: !214, size: 32, offset: 1536)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !311, file: !312, line: 98, baseType: !355, size: 160, offset: 1568)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 160, elements: !356)
!356 = !{!357}
!357 = !DISubrange(count: 20)
!358 = !DILocalVariable(name: "len", scope: !301, file: !3, line: 1478, type: !256)
!359 = !DILocalVariable(name: "count", scope: !301, file: !3, line: 1478, type: !256)
!360 = !DILocalVariable(name: "room", scope: !301, file: !3, line: 1478, type: !256)
!361 = !DILocalVariable(name: "ch", scope: !362, file: !3, line: 1493, type: !214)
!362 = distinct !DILexicalBlock(scope: !363, file: !3, line: 1492, column: 5)
!363 = distinct !DILexicalBlock(scope: !301, file: !3, line: 1491, column: 7)
!364 = !DILocalVariable(name: "to", scope: !365, file: !3, line: 1497, type: !71)
!365 = distinct !DILexicalBlock(scope: !362, file: !3, line: 1496, column: 2)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 88, elements: !367)
!367 = !{!368}
!368 = !DISubrange(count: 11)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "extension", scope: !371, file: !3, line: 295, type: !895, isLocal: true, isDefinition: true)
!371 = distinct !DISubprogram(name: "pch_open_file", scope: !3, file: !3, line: 293, type: !372, scopeLine: 294, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !863)
!372 = !DISubroutineType(types: !373)
!373 = !{!75, !374, !101, !271}
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_reader", file: !6, line: 31, baseType: !376)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_reader", file: !43, line: 322, size: 10432, elements: !377)
!377 = !{!378, !425, !426, !443, !473, !474, !484, !485, !486, !516, !518, !522, !523, !524, !525, !526, !527, !528, !529, !530, !576, !577, !578, !579, !611, !612, !613, !614, !615, !616, !617, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !643, !644, !645, !648, !728, !754, !757, !758, !821, !828, !829, !836, !837, !838, !839, !842, !843, !856}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !376, file: !43, line: 325, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_buffer", file: !6, line: 32, baseType: !381)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_buffer", file: !43, line: 249, size: 1536, elements: !382)
!382 = !{!383, !384, !385, !386, !387, !388, !395, !396, !397, !398, !400, !401, !402, !405, !406, !407, !408, !409, !410, !411}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !381, file: !43, line: 251, baseType: !112, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "line_base", scope: !381, file: !43, line: 252, baseType: !112, size: 64, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "next_line", scope: !381, file: !43, line: 253, baseType: !112, size: 64, offset: 128)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !381, file: !43, line: 255, baseType: !112, size: 64, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit", scope: !381, file: !43, line: 256, baseType: !112, size: 64, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "notes", scope: !381, file: !43, line: 258, baseType: !389, size: 64, offset: 320)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cpp_line_note", file: !43, line: 235, baseType: !391)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_line_note", file: !43, line: 236, size: 128, elements: !392)
!392 = !{!393, !394}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !391, file: !43, line: 239, baseType: !112, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !391, file: !43, line: 245, baseType: !7, size: 32, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "cur_note", scope: !381, file: !43, line: 259, baseType: !7, size: 32, offset: 384)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "notes_used", scope: !381, file: !43, line: 260, baseType: !7, size: 32, offset: 416)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "notes_cap", scope: !381, file: !43, line: 261, baseType: !7, size: 32, offset: 448)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !381, file: !43, line: 263, baseType: !399, size: 64, offset: 512)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !381, file: !43, line: 267, baseType: !110, size: 64, offset: 576)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !381, file: !43, line: 271, baseType: !112, size: 64, offset: 640)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "if_stack", scope: !381, file: !43, line: 275, baseType: !403, size: 64, offset: 704)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "if_stack", file: !43, line: 275, flags: DIFlagFwdDecl)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "need_line", scope: !381, file: !43, line: 278, baseType: !75, size: 8, offset: 768)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "warned_cplusplus_comments", scope: !381, file: !43, line: 284, baseType: !7, size: 1, offset: 776, flags: DIFlagBitField, extraData: i64 776)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "from_stage3", scope: !381, file: !43, line: 289, baseType: !7, size: 1, offset: 777, flags: DIFlagBitField, extraData: i64 776)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "return_at_eof", scope: !381, file: !43, line: 294, baseType: !7, size: 1, offset: 778, flags: DIFlagBitField, extraData: i64 776)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !381, file: !43, line: 298, baseType: !75, size: 8, offset: 784)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !381, file: !43, line: 302, baseType: !66, size: 512, offset: 832)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "input_cset_desc", scope: !381, file: !43, line: 306, baseType: !412, size: 192, offset: 1344)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cset_converter", file: !43, line: 47, size: 192, elements: !413)
!413 = !{!414, !423, !424}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !412, file: !43, line: 49, baseType: !415, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "convert_f", file: !43, line: 45, baseType: !416)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{!75, !419, !112, !256, !421}
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "iconv_t", file: !420, line: 29, baseType: !57)
!420 = !DIFile(filename: "/usr/include/iconv.h", directory: "")
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_strbuf", file: !43, line: 43, flags: DIFlagFwdDecl)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "cd", scope: !412, file: !43, line: 50, baseType: !419, size: 64, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !412, file: !43, line: 51, baseType: !214, size: 32, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "overlaid_buffer", scope: !376, file: !43, line: 328, baseType: !379, size: 64, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !376, file: !43, line: 331, baseType: !427, size: 160, offset: 128)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lexer_state", file: !43, line: 177, size: 160, elements: !428)
!428 = !{!429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "in_directive", scope: !427, file: !43, line: 180, baseType: !75, size: 8)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "directive_wants_padding", scope: !427, file: !43, line: 185, baseType: !75, size: 8, offset: 8)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "skipping", scope: !427, file: !43, line: 188, baseType: !75, size: 8, offset: 16)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "angled_headers", scope: !427, file: !43, line: 191, baseType: !75, size: 8, offset: 24)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "in_expression", scope: !427, file: !43, line: 194, baseType: !75, size: 8, offset: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "save_comments", scope: !427, file: !43, line: 198, baseType: !75, size: 8, offset: 40)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "va_args_ok", scope: !427, file: !43, line: 201, baseType: !75, size: 8, offset: 48)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "poisoned_ok", scope: !427, file: !43, line: 204, baseType: !75, size: 8, offset: 56)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "prevent_expansion", scope: !427, file: !43, line: 207, baseType: !75, size: 8, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "parsing_args", scope: !427, file: !43, line: 210, baseType: !75, size: 8, offset: 72)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "discarding_output", scope: !427, file: !43, line: 214, baseType: !75, size: 8, offset: 80)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "skip_eval", scope: !427, file: !43, line: 217, baseType: !7, size: 32, offset: 96)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "in_deferred_pragma", scope: !427, file: !43, line: 220, baseType: !75, size: 8, offset: 128)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "pragma_allow_expansion", scope: !427, file: !43, line: 223, baseType: !75, size: 8, offset: 136)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "line_table", scope: !376, file: !43, line: 334, baseType: !444, size: 64, offset: 320)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line_maps", file: !50, line: 74, size: 448, elements: !446)
!446 = !{!447, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "maps", scope: !445, file: !50, line: 75, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line_map", file: !50, line: 61, size: 192, elements: !450)
!450 = !{!451, !452, !454, !455, !456, !457, !458}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "to_file", scope: !449, file: !50, line: 62, baseType: !80, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "to_line", scope: !449, file: !50, line: 63, baseType: !453, size: 32, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "linenum_type", file: !50, line: 39, baseType: !7)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "start_location", scope: !449, file: !50, line: 64, baseType: !96, size: 32, offset: 96)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "included_from", scope: !449, file: !50, line: 65, baseType: !214, size: 32, offset: 128)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !449, file: !50, line: 66, baseType: !7, size: 8, offset: 160, flags: DIFlagBitField, extraData: i64 160)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !449, file: !50, line: 68, baseType: !75, size: 8, offset: 168)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "column_bits", scope: !449, file: !50, line: 70, baseType: !7, size: 8, offset: 176, flags: DIFlagBitField, extraData: i64 176)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !445, file: !50, line: 76, baseType: !7, size: 32, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !445, file: !50, line: 77, baseType: !7, size: 32, offset: 96)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !445, file: !50, line: 79, baseType: !7, size: 32, offset: 128)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "last_listed", scope: !445, file: !50, line: 84, baseType: !214, size: 32, offset: 160)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !445, file: !50, line: 87, baseType: !7, size: 32, offset: 192)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "trace_includes", scope: !445, file: !50, line: 90, baseType: !75, size: 8, offset: 224)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "highest_location", scope: !445, file: !50, line: 93, baseType: !96, size: 32, offset: 256)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "highest_line", scope: !445, file: !50, line: 96, baseType: !96, size: 32, offset: 288)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "max_column_hint", scope: !445, file: !50, line: 100, baseType: !7, size: 32, offset: 320)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "reallocator", scope: !445, file: !50, line: 104, baseType: !469, size: 64, offset: 384)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "line_map_realloc", file: !50, line: 47, baseType: !470)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{!57, !57, !256}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "directive_line", scope: !376, file: !43, line: 337, baseType: !96, size: 32, offset: 384)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "a_buff", scope: !376, file: !43, line: 340, baseType: !475, size: 64, offset: 448)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cpp_buff", file: !43, line: 99, baseType: !477)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_buff", file: !43, line: 100, size: 256, elements: !478)
!478 = !{!479, !481, !482, !483}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !477, file: !43, line: 102, baseType: !480, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !477, file: !43, line: 103, baseType: !271, size: 64, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !477, file: !43, line: 103, baseType: !271, size: 64, offset: 128)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !477, file: !43, line: 103, baseType: !271, size: 64, offset: 192)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "u_buff", scope: !376, file: !43, line: 341, baseType: !475, size: 64, offset: 512)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "free_buffs", scope: !376, file: !43, line: 342, baseType: !475, size: 64, offset: 576)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "base_context", scope: !376, file: !43, line: 345, baseType: !487, size: 448, offset: 640)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_context", file: !43, line: 142, size: 448, elements: !488)
!488 = !{!489, !492, !493, !513, !514, !515}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !487, file: !43, line: 145, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_context", file: !43, line: 141, baseType: !487)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !487, file: !43, line: 145, baseType: !490, size: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !487, file: !43, line: 164, baseType: !494, size: 128, offset: 128)
!494 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !487, file: !43, line: 147, size: 128, elements: !495)
!495 = !{!496, !508}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "iso", scope: !494, file: !43, line: 156, baseType: !497, size: 128)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !494, file: !43, line: 152, size: 128, elements: !498)
!498 = !{!499, !507}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !497, file: !43, line: 154, baseType: !500, size: 64)
!500 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "utoken", file: !43, line: 121, size: 64, elements: !501)
!501 = !{!502, !505}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !500, file: !43, line: 123, baseType: !503, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ptoken", scope: !500, file: !43, line: 124, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !497, file: !43, line: 155, baseType: !500, size: 64, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "trad", scope: !494, file: !43, line: 163, baseType: !509, size: 128)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !494, file: !43, line: 159, size: 128, elements: !510)
!510 = !{!511, !512}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !509, file: !43, line: 161, baseType: !112, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit", scope: !509, file: !43, line: 162, baseType: !112, size: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !487, file: !43, line: 168, baseType: !475, size: 64, offset: 256)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !487, file: !43, line: 171, baseType: !144, size: 64, offset: 320)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "direct_p", scope: !487, file: !43, line: 174, baseType: !75, size: 8, offset: 384)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !376, file: !43, line: 346, baseType: !517, size: 64, offset: 1088)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "directive", scope: !376, file: !43, line: 349, baseType: !519, size: 64, offset: 1152)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !521)
!521 = !DICompositeType(tag: DW_TAG_structure_type, name: "directive", file: !43, line: 40, flags: DIFlagFwdDecl)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "directive_result", scope: !376, file: !43, line: 352, baseType: !150, size: 192, offset: 1216)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "invocation_location", scope: !376, file: !43, line: 356, baseType: !96, size: 32, offset: 1408)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "set_invocation_location", scope: !376, file: !43, line: 360, baseType: !75, size: 8, offset: 1440)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "quote_include", scope: !376, file: !43, line: 363, baseType: !69, size: 64, offset: 1472)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "bracket_include", scope: !376, file: !43, line: 364, baseType: !69, size: 64, offset: 1536)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "no_search_path", scope: !376, file: !43, line: 365, baseType: !66, size: 512, offset: 1600)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "all_files", scope: !376, file: !43, line: 368, baseType: !110, size: 64, offset: 2112)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "main_file", scope: !376, file: !43, line: 370, baseType: !110, size: 64, offset: 2176)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "file_hash", scope: !376, file: !43, line: 373, baseType: !531, size: 64, offset: 2240)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !533, line: 100, size: 896, elements: !534)
!533 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!534 = !{!535, !543, !548, !550, !552, !553, !554, !555, !556, !557, !562, !564, !565, !570, !575}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !532, file: !533, line: 102, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !533, line: 52, baseType: !537)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DISubroutineType(types: !539)
!539 = !{!540, !541}
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !533, line: 47, baseType: !7)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !532, file: !533, line: 105, baseType: !544, size: 64, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !533, line: 59, baseType: !545)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DISubroutineType(types: !547)
!547 = !{!214, !541, !541}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !532, file: !533, line: 108, baseType: !549, size: 64, offset: 128)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !533, line: 63, baseType: !247)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !532, file: !533, line: 111, baseType: !551, size: 64, offset: 192)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !532, file: !533, line: 114, baseType: !256, size: 64, offset: 256)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !532, file: !533, line: 117, baseType: !256, size: 64, offset: 320)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !532, file: !533, line: 120, baseType: !256, size: 64, offset: 384)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !532, file: !533, line: 124, baseType: !7, size: 32, offset: 448)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !532, file: !533, line: 128, baseType: !7, size: 32, offset: 480)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !532, file: !533, line: 131, baseType: !558, size: 64, offset: 512)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !533, line: 75, baseType: !559)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DISubroutineType(types: !561)
!561 = !{!57, !256, !256}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !532, file: !533, line: 132, baseType: !563, size: 64, offset: 576)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !533, line: 78, baseType: !247)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !532, file: !533, line: 135, baseType: !57, size: 64, offset: 640)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !532, file: !533, line: 136, baseType: !566, size: 64, offset: 704)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !533, line: 82, baseType: !567)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{!57, !57, !256, !256}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !532, file: !533, line: 137, baseType: !571, size: 64, offset: 768)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !533, line: 83, baseType: !572)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DISubroutineType(types: !574)
!574 = !{null, !57, !57}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !532, file: !533, line: 141, baseType: !7, size: 32, offset: 832)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "dir_hash", scope: !376, file: !43, line: 374, baseType: !531, size: 64, offset: 2304)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "file_hash_entries", scope: !376, file: !43, line: 375, baseType: !282, size: 64, offset: 2368)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "nonexistent_file_hash", scope: !376, file: !43, line: 378, baseType: !531, size: 64, offset: 2432)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "nonexistent_file_ob", scope: !376, file: !43, line: 379, baseType: !580, size: 704, offset: 2496)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !581, line: 164, size: 704, elements: !582)
!581 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!582 = !{!583, !584, !594, !595, !596, !597, !598, !599, !603, !607, !608, !609, !610}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !580, file: !581, line: 166, baseType: !218, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !580, file: !581, line: 167, baseType: !585, size: 64, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !581, line: 157, size: 192, elements: !587)
!587 = !{!588, !589, !590}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !586, file: !581, line: 159, baseType: !71, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !586, file: !581, line: 160, baseType: !585, size: 64, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !586, file: !581, line: 161, baseType: !591, size: 32, offset: 128)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !592)
!592 = !{!593}
!593 = !DISubrange(count: 4)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !580, file: !581, line: 168, baseType: !71, size: 64, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !580, file: !581, line: 169, baseType: !71, size: 64, offset: 192)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !580, file: !581, line: 170, baseType: !71, size: 64, offset: 256)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !580, file: !581, line: 171, baseType: !218, size: 64, offset: 320)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !580, file: !581, line: 172, baseType: !214, size: 32, offset: 384)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !580, file: !581, line: 176, baseType: !600, size: 64, offset: 448)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DISubroutineType(types: !602)
!602 = !{!585, !57, !218}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !580, file: !581, line: 177, baseType: !604, size: 64, offset: 512)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{null, !57, !585}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !580, file: !581, line: 178, baseType: !57, size: 64, offset: 576)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !580, file: !581, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !580, file: !581, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !580, file: !581, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "quote_ignores_source_dir", scope: !376, file: !43, line: 383, baseType: !75, size: 8, offset: 3200)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "seen_once_only", scope: !376, file: !43, line: 387, baseType: !75, size: 8, offset: 3208)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "mi_cmacro", scope: !376, file: !43, line: 390, baseType: !116, size: 64, offset: 3264)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "mi_ind_cmacro", scope: !376, file: !43, line: 391, baseType: !116, size: 64, offset: 3328)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "mi_valid", scope: !376, file: !43, line: 392, baseType: !75, size: 8, offset: 3392)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "cur_token", scope: !376, file: !43, line: 395, baseType: !149, size: 64, offset: 3456)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "base_run", scope: !376, file: !43, line: 396, baseType: !618, size: 256, offset: 3520)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "tokenrun", file: !43, line: 128, baseType: !619)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tokenrun", file: !43, line: 129, size: 256, elements: !620)
!620 = !{!621, !623, !624, !625}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !619, file: !43, line: 131, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !619, file: !43, line: 131, baseType: !622, size: 64, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !619, file: !43, line: 132, baseType: !149, size: 64, offset: 128)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !619, file: !43, line: 132, baseType: !149, size: 64, offset: 192)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "cur_run", scope: !376, file: !43, line: 396, baseType: !622, size: 64, offset: 3776)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "lookaheads", scope: !376, file: !43, line: 397, baseType: !7, size: 32, offset: 3840)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "keep_tokens", scope: !376, file: !43, line: 400, baseType: !7, size: 32, offset: 3872)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "macro_buffer", scope: !376, file: !43, line: 403, baseType: !271, size: 64, offset: 3904)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "macro_buffer_len", scope: !376, file: !43, line: 404, baseType: !7, size: 32, offset: 3968)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "narrow_cset_desc", scope: !376, file: !43, line: 408, baseType: !412, size: 192, offset: 4032)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_cset_desc", scope: !376, file: !43, line: 412, baseType: !412, size: 192, offset: 4224)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "char16_cset_desc", scope: !376, file: !43, line: 416, baseType: !412, size: 192, offset: 4416)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "char32_cset_desc", scope: !376, file: !43, line: 420, baseType: !412, size: 192, offset: 4608)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "wide_cset_desc", scope: !376, file: !43, line: 424, baseType: !412, size: 192, offset: 4800)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !376, file: !43, line: 427, baseType: !112, size: 64, offset: 4992)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !376, file: !43, line: 428, baseType: !112, size: 64, offset: 5056)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "avoid_paste", scope: !376, file: !43, line: 431, baseType: !150, size: 192, offset: 5120)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !376, file: !43, line: 432, baseType: !150, size: 192, offset: 5312)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "deps", scope: !376, file: !43, line: 435, baseType: !641, size: 64, offset: 5504)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DICompositeType(tag: DW_TAG_structure_type, name: "deps", file: !6, line: 685, flags: DIFlagFwdDecl)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "hash_ob", scope: !376, file: !43, line: 439, baseType: !580, size: 704, offset: 5568)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_ob", scope: !376, file: !43, line: 443, baseType: !580, size: 704, offset: 6272)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "pragmas", scope: !376, file: !43, line: 447, baseType: !646, size: 64, offset: 6976)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DICompositeType(tag: DW_TAG_structure_type, name: "pragma_entry", file: !43, line: 447, flags: DIFlagFwdDecl)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !376, file: !43, line: 450, baseType: !649, size: 1088, offset: 7040)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_callbacks", file: !6, line: 472, size: 1088, elements: !650)
!650 = !{!651, !655, !661, !665, !669, !673, !674, !681, !685, !689, !693, !699, !703, !718, !719, !720, !724}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "line_change", scope: !649, file: !6, line: 475, baseType: !652, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{null, !374, !503, !214}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "file_change", scope: !649, file: !6, line: 481, baseType: !656, size: 64, offset: 64)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{null, !374, !659}
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !449)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "dir_change", scope: !649, file: !6, line: 483, baseType: !662, size: 64, offset: 128)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DISubroutineType(types: !664)
!664 = !{null, !374, !80}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "include", scope: !649, file: !6, line: 484, baseType: !666, size: 64, offset: 192)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DISubroutineType(types: !668)
!668 = !{null, !374, !7, !112, !80, !214, !506}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "define", scope: !649, file: !6, line: 486, baseType: !670, size: 64, offset: 256)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{null, !374, !7, !144}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "undef", scope: !649, file: !6, line: 487, baseType: !670, size: 64, offset: 320)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !649, file: !6, line: 488, baseType: !675, size: 64, offset: 384)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DISubroutineType(types: !677)
!677 = !{null, !374, !7, !678}
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !680)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_string", file: !6, line: 35, baseType: !166)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "def_pragma", scope: !649, file: !6, line: 489, baseType: !682, size: 64, offset: 448)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{null, !374, !7}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "valid_pch", scope: !649, file: !6, line: 490, baseType: !686, size: 64, offset: 512)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DISubroutineType(types: !688)
!688 = !{!214, !374, !80, !214}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "read_pch", scope: !649, file: !6, line: 491, baseType: !690, size: 64, offset: 576)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DISubroutineType(types: !692)
!692 = !{null, !374, !80, !214, !80}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "missing_header", scope: !649, file: !6, line: 492, baseType: !694, size: 64, offset: 640)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "missing_header_cb", file: !6, line: 469, baseType: !695)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DISubroutineType(types: !697)
!697 = !{!80, !374, !80, !698}
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "macro_to_expand", scope: !649, file: !6, line: 496, baseType: !700, size: 64, offset: 704)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{!144, !374, !503}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !649, file: !6, line: 500, baseType: !704, size: 64, offset: 768)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DISubroutineType(types: !706)
!706 = !{!75, !374, !214, !96, !7, !80, !707}
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !709, line: 14, baseType: !710)
!709 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stdarg.h", directory: "")
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 450, baseType: !711)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !712, size: 192, elements: !194)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 450, size: 192, elements: !713)
!713 = !{!714, !715, !716, !717}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !712, file: !3, line: 450, baseType: !7, size: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !712, file: !3, line: 450, baseType: !7, size: 32, offset: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !712, file: !3, line: 450, baseType: !57, size: 64, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !712, file: !3, line: 450, baseType: !57, size: 64, offset: 128)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "used_define", scope: !649, file: !6, line: 506, baseType: !670, size: 64, offset: 832)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "used_undef", scope: !649, file: !6, line: 507, baseType: !670, size: 64, offset: 896)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "before_define", scope: !649, file: !6, line: 510, baseType: !721, size: 64, offset: 960)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DISubroutineType(types: !723)
!723 = !{null, !374}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !649, file: !6, line: 513, baseType: !725, size: 64, offset: 1024)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DISubroutineType(types: !727)
!727 = !{null, !374, !96, !144}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "hash_table", scope: !376, file: !43, line: 453, baseType: !729, size: 64, offset: 8128)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht", file: !123, line: 46, size: 1152, elements: !731)
!731 = !{!732, !733, !737, !743, !747, !748, !749, !751, !752, !753}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !730, file: !123, line: 49, baseType: !580, size: 704)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !730, file: !123, line: 51, baseType: !734, size: 64, offset: 704)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashnode", file: !123, line: 41, baseType: !736)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_node", scope: !730, file: !123, line: 53, baseType: !738, size: 64, offset: 768)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{!735, !741}
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_table", file: !123, line: 40, baseType: !730)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_subobject", scope: !730, file: !123, line: 56, baseType: !744, size: 64, offset: 832)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{!57, !256}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "nslots", scope: !730, file: !123, line: 58, baseType: !7, size: 32, offset: 896)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "nelements", scope: !730, file: !123, line: 59, baseType: !7, size: 32, offset: 928)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "pfile", scope: !730, file: !123, line: 62, baseType: !750, size: 64, offset: 960)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !730, file: !123, line: 65, baseType: !7, size: 32, offset: 1024)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !730, file: !123, line: 66, baseType: !7, size: 32, offset: 1056)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "entries_owned", scope: !730, file: !123, line: 69, baseType: !75, size: 8, offset: 1088)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "op_stack", scope: !376, file: !43, line: 456, baseType: !755, size: 64, offset: 8192)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DICompositeType(tag: DW_TAG_structure_type, name: "op", file: !43, line: 42, flags: DIFlagFwdDecl)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "op_limit", scope: !376, file: !43, line: 456, baseType: !755, size: 64, offset: 8256)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !376, file: !43, line: 459, baseType: !759, size: 1024, offset: 8320)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_options", file: !6, line: 279, size: 1024, elements: !760)
!760 = !{!761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !812, !813, !814, !815, !816, !817, !818, !819, !820}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "tabstop", scope: !759, file: !6, line: 282, baseType: !7, size: 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "lang", scope: !759, file: !6, line: 285, baseType: !19, size: 32, offset: 32)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "cplusplus", scope: !759, file: !6, line: 288, baseType: !75, size: 8, offset: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "cplusplus_comments", scope: !759, file: !6, line: 291, baseType: !75, size: 8, offset: 72)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "objc", scope: !759, file: !6, line: 296, baseType: !75, size: 8, offset: 80)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "discard_comments", scope: !759, file: !6, line: 299, baseType: !75, size: 8, offset: 88)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "discard_comments_in_macro_exp", scope: !759, file: !6, line: 303, baseType: !75, size: 8, offset: 96)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "trigraphs", scope: !759, file: !6, line: 306, baseType: !75, size: 8, offset: 104)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "digraphs", scope: !759, file: !6, line: 309, baseType: !75, size: 8, offset: 112)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "extended_numbers", scope: !759, file: !6, line: 312, baseType: !75, size: 8, offset: 120)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "uliterals", scope: !759, file: !6, line: 315, baseType: !75, size: 8, offset: 128)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "print_include_names", scope: !759, file: !6, line: 318, baseType: !75, size: 8, offset: 136)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "warn_deprecated", scope: !759, file: !6, line: 321, baseType: !75, size: 8, offset: 144)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "warn_comments", scope: !759, file: !6, line: 324, baseType: !75, size: 8, offset: 152)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "warn_missing_include_dirs", scope: !759, file: !6, line: 328, baseType: !75, size: 8, offset: 160)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "warn_trigraphs", scope: !759, file: !6, line: 331, baseType: !75, size: 8, offset: 168)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "warn_multichar", scope: !759, file: !6, line: 334, baseType: !75, size: 8, offset: 176)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "warn_traditional", scope: !759, file: !6, line: 338, baseType: !75, size: 8, offset: 184)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "warn_long_long", scope: !759, file: !6, line: 341, baseType: !75, size: 8, offset: 192)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "warn_endif_labels", scope: !759, file: !6, line: 344, baseType: !75, size: 8, offset: 200)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "warn_num_sign_change", scope: !759, file: !6, line: 348, baseType: !75, size: 8, offset: 208)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "warn_variadic_macros", scope: !759, file: !6, line: 352, baseType: !75, size: 8, offset: 216)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "warn_builtin_macro_redefined", scope: !759, file: !6, line: 356, baseType: !75, size: 8, offset: 224)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !759, file: !6, line: 360, baseType: !75, size: 8, offset: 232)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "dollars_in_ident", scope: !759, file: !6, line: 363, baseType: !75, size: 8, offset: 240)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "extended_identifiers", scope: !759, file: !6, line: 366, baseType: !75, size: 8, offset: 248)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "warn_dollars", scope: !759, file: !6, line: 370, baseType: !75, size: 8, offset: 256)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "warn_undef", scope: !759, file: !6, line: 373, baseType: !75, size: 8, offset: 264)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "warn_unused_macros", scope: !759, file: !6, line: 376, baseType: !75, size: 8, offset: 272)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "c99", scope: !759, file: !6, line: 379, baseType: !75, size: 8, offset: 280)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "std", scope: !759, file: !6, line: 382, baseType: !75, size: 8, offset: 288)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "pedantic", scope: !759, file: !6, line: 385, baseType: !75, size: 8, offset: 296)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "preprocessed", scope: !759, file: !6, line: 389, baseType: !75, size: 8, offset: 304)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "show_column", scope: !759, file: !6, line: 392, baseType: !75, size: 8, offset: 312)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "operator_names", scope: !759, file: !6, line: 395, baseType: !75, size: 8, offset: 320)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "warn_cxx_operator_names", scope: !759, file: !6, line: 398, baseType: !75, size: 8, offset: 328)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "traditional", scope: !759, file: !6, line: 401, baseType: !75, size: 8, offset: 336)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "narrow_charset", scope: !759, file: !6, line: 404, baseType: !80, size: 64, offset: 384)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "wide_charset", scope: !759, file: !6, line: 407, baseType: !80, size: 64, offset: 448)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "input_charset", scope: !759, file: !6, line: 410, baseType: !80, size: 64, offset: 512)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "warn_normalize", scope: !759, file: !6, line: 414, baseType: !31, size: 32, offset: 576)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "warn_invalid_pch", scope: !759, file: !6, line: 417, baseType: !75, size: 8, offset: 608)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "restore_pch_deps", scope: !759, file: !6, line: 420, baseType: !75, size: 8, offset: 616)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "deps", scope: !759, file: !6, line: 441, baseType: !805, size: 64, offset: 640)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !759, file: !6, line: 423, size: 64, elements: !806)
!806 = !{!807, !808, !809, !810, !811}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !805, file: !6, line: 426, baseType: !37, size: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "missing_files", scope: !805, file: !6, line: 429, baseType: !75, size: 8, offset: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "phony_targets", scope: !805, file: !6, line: 433, baseType: !75, size: 8, offset: 40)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_main_file", scope: !805, file: !6, line: 436, baseType: !75, size: 8, offset: 48)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "need_preprocessor_output", scope: !805, file: !6, line: 440, baseType: !75, size: 8, offset: 56)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !759, file: !6, line: 447, baseType: !256, size: 64, offset: 704)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "char_precision", scope: !759, file: !6, line: 447, baseType: !256, size: 64, offset: 768)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "int_precision", scope: !759, file: !6, line: 447, baseType: !256, size: 64, offset: 832)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "wchar_precision", scope: !759, file: !6, line: 447, baseType: !256, size: 64, offset: 896)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_char", scope: !759, file: !6, line: 450, baseType: !75, size: 8, offset: 960)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_wchar", scope: !759, file: !6, line: 450, baseType: !75, size: 8, offset: 968)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_big_endian", scope: !759, file: !6, line: 454, baseType: !75, size: 8, offset: 976)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "stdc_0_in_system_headers", scope: !759, file: !6, line: 457, baseType: !75, size: 8, offset: 984)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "directives_only", scope: !759, file: !6, line: 460, baseType: !75, size: 8, offset: 992)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "spec_nodes", scope: !376, file: !43, line: 463, baseType: !822, size: 256, offset: 9344)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spec_nodes", file: !43, line: 227, size: 256, elements: !823)
!823 = !{!824, !825, !826, !827}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "n_defined", scope: !822, file: !43, line: 229, baseType: !144, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "n_true", scope: !822, file: !43, line: 230, baseType: !144, size: 64, offset: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "n_false", scope: !822, file: !43, line: 231, baseType: !144, size: 64, offset: 128)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "n__VA_ARGS__", scope: !822, file: !43, line: 232, baseType: !144, size: 64, offset: 192)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "our_hashtable", scope: !376, file: !43, line: 466, baseType: !75, size: 8, offset: 9600)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !376, file: !43, line: 475, baseType: !830, size: 256, offset: 9664)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !376, file: !43, line: 469, size: 256, elements: !831)
!831 = !{!832, !833, !834, !835}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !830, file: !43, line: 471, baseType: !271, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !830, file: !43, line: 472, baseType: !271, size: 64, offset: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !830, file: !43, line: 473, baseType: !271, size: 64, offset: 128)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "first_line", scope: !830, file: !43, line: 474, baseType: !96, size: 32, offset: 192)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "saved_cur", scope: !376, file: !43, line: 478, baseType: !112, size: 64, offset: 9920)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "saved_rlimit", scope: !376, file: !43, line: 478, baseType: !112, size: 64, offset: 9984)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "saved_line_base", scope: !376, file: !43, line: 478, baseType: !112, size: 64, offset: 10048)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "savedstate", scope: !376, file: !43, line: 482, baseType: !840, size: 64, offset: 10112)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_savedstate", file: !43, line: 482, flags: DIFlagFwdDecl)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !376, file: !43, line: 485, baseType: !7, size: 32, offset: 10176)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "comments", scope: !376, file: !43, line: 488, baseType: !844, size: 128, offset: 10240)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_comment_table", file: !6, line: 901, baseType: !845)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 891, size: 128, elements: !846)
!846 = !{!847, !854, !855}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !845, file: !6, line: 894, baseType: !848, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_comment", file: !6, line: 887, baseType: !850)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 880, size: 128, elements: !851)
!851 = !{!852, !853}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !850, file: !6, line: 883, baseType: !71, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "sloc", scope: !850, file: !6, line: 886, baseType: !96, size: 32, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !845, file: !6, line: 897, baseType: !214, size: 32, offset: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !845, file: !6, line: 900, baseType: !214, size: 32, offset: 96)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "pushed_macros", scope: !376, file: !43, line: 491, baseType: !857, size: 64, offset: 10368)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_pragma_macro", file: !43, line: 310, size: 192, elements: !859)
!859 = !{!860, !861, !862}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !858, file: !43, line: 312, baseType: !857, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !858, file: !43, line: 314, baseType: !71, size: 64, offset: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !858, file: !43, line: 316, baseType: !137, size: 64, offset: 128)
!863 = !{!864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !880, !893, !894}
!864 = !DILocalVariable(name: "pfile", arg: 1, scope: !371, file: !3, line: 293, type: !374)
!865 = !DILocalVariable(name: "file", arg: 2, scope: !371, file: !3, line: 293, type: !101)
!866 = !DILocalVariable(name: "invalid_pch", arg: 3, scope: !371, file: !3, line: 293, type: !271)
!867 = !DILocalVariable(name: "path", scope: !371, file: !3, line: 296, type: !80)
!868 = !DILocalVariable(name: "len", scope: !371, file: !3, line: 297, type: !256)
!869 = !DILocalVariable(name: "flen", scope: !371, file: !3, line: 297, type: !256)
!870 = !DILocalVariable(name: "pchname", scope: !371, file: !3, line: 298, type: !71)
!871 = !DILocalVariable(name: "st", scope: !371, file: !3, line: 299, type: !200)
!872 = !DILocalVariable(name: "valid", scope: !371, file: !3, line: 300, type: !75)
!873 = !DILocalVariable(name: "pchdir", scope: !874, file: !3, line: 320, type: !876)
!874 = distinct !DILexicalBlock(scope: !875, file: !3, line: 319, column: 5)
!875 = distinct !DILexicalBlock(scope: !371, file: !3, line: 318, column: 7)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !878, line: 127, baseType: !879)
!878 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!879 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !878, line: 127, flags: DIFlagFwdDecl)
!880 = !DILocalVariable(name: "d", scope: !874, file: !3, line: 321, type: !881)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !883, line: 22, size: 2240, elements: !884)
!883 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "")
!884 = !{!885, !886, !887, !888, !889}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !882, file: !883, line: 25, baseType: !89, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !882, file: !883, line: 26, baseType: !217, size: 64, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !882, file: !883, line: 31, baseType: !156, size: 16, offset: 128)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !882, file: !883, line: 32, baseType: !75, size: 8, offset: 144)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !882, file: !883, line: 33, baseType: !890, size: 2048, offset: 152)
!890 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 2048, elements: !891)
!891 = !{!892}
!892 = !DISubrange(count: 256)
!893 = !DILocalVariable(name: "dlen", scope: !874, file: !3, line: 322, type: !256)
!894 = !DILocalVariable(name: "plen", scope: !874, file: !3, line: 322, type: !256)
!895 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 40, elements: !896)
!896 = !{!897}
!897 = !DISubrange(count: 5)
!898 = !{i32 2, !"Dwarf Version", i32 4}
!899 = !{i32 2, !"Debug Info Version", i32 3}
!900 = !{i32 1, !"wchar_size", i32 4}
!901 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!902 = distinct !DISubprogram(name: "tolower", scope: !903, file: !903, line: 207, type: !904, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !906)
!903 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!904 = !DISubroutineType(types: !905)
!905 = !{!214, !214}
!906 = !{!907}
!907 = !DILocalVariable(name: "__c", arg: 1, scope: !902, file: !903, line: 207, type: !214)
!908 = !DILocation(line: 0, scope: !902)
!909 = !DILocation(line: 209, column: 22, scope: !902)
!910 = !DILocation(line: 209, column: 39, scope: !902)
!911 = !DILocation(line: 209, column: 38, scope: !902)
!912 = !DILocation(line: 209, column: 37, scope: !902)
!913 = !DILocation(line: 209, column: 10, scope: !902)
!914 = !DILocation(line: 209, column: 3, scope: !902)
!915 = distinct !DISubprogram(name: "toupper", scope: !903, file: !903, line: 213, type: !904, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !916)
!916 = !{!917}
!917 = !DILocalVariable(name: "__c", arg: 1, scope: !915, file: !903, line: 213, type: !214)
!918 = !DILocation(line: 0, scope: !915)
!919 = !DILocation(line: 215, column: 22, scope: !915)
!920 = !DILocation(line: 215, column: 39, scope: !915)
!921 = !DILocation(line: 215, column: 38, scope: !915)
!922 = !DILocation(line: 215, column: 37, scope: !915)
!923 = !DILocation(line: 215, column: 10, scope: !915)
!924 = !DILocation(line: 215, column: 3, scope: !915)
!925 = distinct !DISubprogram(name: "_cpp_find_failed", scope: !3, file: !3, line: 447, type: !926, scopeLine: 448, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !928)
!926 = !DISubroutineType(types: !927)
!927 = !{!75, !101}
!928 = !{!929}
!929 = !DILocalVariable(name: "file", arg: 1, scope: !925, file: !3, line: 447, type: !101)
!930 = !DILocation(line: 0, scope: !925)
!931 = !DILocation(line: 449, column: 16, scope: !925)
!932 = !DILocation(line: 449, column: 23, scope: !925)
!933 = !DILocation(line: 449, column: 10, scope: !925)
!934 = !DILocation(line: 449, column: 3, scope: !925)
!935 = distinct !DISubprogram(name: "_cpp_find_file", scope: !3, file: !3, line: 467, type: !936, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !938)
!936 = !DISubroutineType(types: !937)
!937 = !{!101, !374, !80, !64, !75, !214}
!938 = !{!939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950}
!939 = !DILocalVariable(name: "pfile", arg: 1, scope: !935, file: !3, line: 467, type: !374)
!940 = !DILocalVariable(name: "fname", arg: 2, scope: !935, file: !3, line: 467, type: !80)
!941 = !DILocalVariable(name: "start_dir", arg: 3, scope: !935, file: !3, line: 467, type: !64)
!942 = !DILocalVariable(name: "fake", arg: 4, scope: !935, file: !3, line: 467, type: !75)
!943 = !DILocalVariable(name: "angle_brackets", arg: 5, scope: !935, file: !3, line: 467, type: !214)
!944 = !DILocalVariable(name: "entry", scope: !935, file: !3, line: 469, type: !59)
!945 = !DILocalVariable(name: "hash_slot", scope: !935, file: !3, line: 469, type: !58)
