; ModuleID = 'cpp_charset.bc'
source_filename = "cpp_charset.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.conversion = type { i8*, i8 (i8*, i8*, i64, %struct._cpp_strbuf*)*, i8* }
%struct._cpp_strbuf = type { i8*, i64, i64 }
%struct.anon.3 = type { i8, i8, i16 }
%struct.cpp_reader = type { %struct.cpp_buffer*, %struct.cpp_buffer*, %struct.lexer_state, %struct.line_maps*, i32, %struct._cpp_buff*, %struct._cpp_buff*, %struct._cpp_buff*, %struct.cpp_context, %struct.cpp_context*, %struct.directive*, %struct.cpp_token, i32, i8, %struct.cpp_dir*, %struct.cpp_dir*, %struct.cpp_dir, %struct._cpp_file*, %struct._cpp_file*, %struct.htab*, %struct.htab*, %struct.file_hash_entry_pool*, %struct.htab*, %struct.obstack, i8, i8, %struct.cpp_hashnode*, %struct.cpp_hashnode*, i8, %struct.cpp_token*, %struct.tokenrun, %struct.tokenrun*, i32, i32, i8*, i32, %struct.cset_converter, %struct.cset_converter, %struct.cset_converter, %struct.cset_converter, %struct.cset_converter, i8*, i8*, %struct.cpp_token, %struct.cpp_token, %struct.deps*, %struct.obstack, %struct.obstack, %struct.pragma_entry*, %struct.cpp_callbacks, %struct.ht*, %struct.op*, %struct.op*, %struct.cpp_options, %struct.spec_nodes, i8, %struct.anon.2, i8*, i8*, i8*, %struct.cpp_savedstate*, i32, %struct.cpp_comment_table, %struct.def_pragma_macro* }

!68 = !DIEnumerator(name: "CPP_NOT_EQ", value: 24, isUnsigned: true)
!69 = !DIEnumerator(name: "CPP_GREATER_EQ", value: 25, isUnsigned: true)
!70 = !DIEnumerator(name: "CPP_LESS_EQ", value: 26, isUnsigned: true)
!71 = !DIEnumerator(name: "CPP_PLUS_EQ", value: 27, isUnsigned: true)
!72 = !DIEnumerator(name: "CPP_MINUS_EQ", value: 28, isUnsigned: true)
!73 = !DIEnumerator(name: "CPP_MULT_EQ", value: 29, isUnsigned: true)
!74 = !DIEnumerator(name: "CPP_DIV_EQ", value: 30, isUnsigned: true)
!75 = !DIEnumerator(name: "CPP_MOD_EQ", value: 31, isUnsigned: true)
!76 = !DIEnumerator(name: "CPP_AND_EQ", value: 32, isUnsigned: true)
!77 = !DIEnumerator(name: "CPP_OR_EQ", value: 33, isUnsigned: true)
!78 = !DIEnumerator(name: "CPP_XOR_EQ", value: 34, isUnsigned: true)
!79 = !DIEnumerator(name: "CPP_RSHIFT_EQ", value: 35, isUnsigned: true)
!80 = !DIEnumerator(name: "CPP_LSHIFT_EQ", value: 36, isUnsigned: true)
!81 = !DIEnumerator(name: "CPP_HASH", value: 37, isUnsigned: true)
!82 = !DIEnumerator(name: "CPP_PASTE", value: 38, isUnsigned: true)
!83 = !DIEnumerator(name: "CPP_OPEN_SQUARE", value: 39, isUnsigned: true)
!84 = !DIEnumerator(name: "CPP_CLOSE_SQUARE", value: 40, isUnsigned: true)
!85 = !DIEnumerator(name: "CPP_OPEN_BRACE", value: 41, isUnsigned: true)
!86 = !DIEnumerator(name: "CPP_CLOSE_BRACE", value: 42, isUnsigned: true)
!87 = !DIEnumerator(name: "CPP_SEMICOLON", value: 43, isUnsigned: true)
!88 = !DIEnumerator(name: "CPP_ELLIPSIS", value: 44, isUnsigned: true)
!89 = !DIEnumerator(name: "CPP_PLUS_PLUS", value: 45, isUnsigned: true)
!90 = !DIEnumerator(name: "CPP_MINUS_MINUS", value: 46, isUnsigned: true)
!91 = !DIEnumerator(name: "CPP_DEREF", value: 47, isUnsigned: true)
!92 = !DIEnumerator(name: "CPP_DOT", value: 48, isUnsigned: true)
!93 = !DIEnumerator(name: "CPP_SCOPE", value: 49, isUnsigned: true)
!94 = !DIEnumerator(name: "CPP_DEREF_STAR", value: 50, isUnsigned: true)
!95 = !DIEnumerator(name: "CPP_DOT_STAR", value: 51, isUnsigned: true)
!96 = !DIEnumerator(name: "CPP_ATSIGN", value: 52, isUnsigned: true)
!97 = !DIEnumerator(name: "CPP_NAME", value: 53, isUnsigned: true)
!98 = !DIEnumerator(name: "CPP_AT_NAME", value: 54, isUnsigned: true)
!99 = !DIEnumerator(name: "CPP_NUMBER", value: 55, isUnsigned: true)
!100 = !DIEnumerator(name: "CPP_CHAR", value: 56, isUnsigned: true)
!101 = !DIEnumerator(name: "CPP_WCHAR", value: 57, isUnsigned: true)
!102 = !DIEnumerator(name: "CPP_CHAR16", value: 58, isUnsigned: true)
!103 = !DIEnumerator(name: "CPP_CHAR32", value: 59, isUnsigned: true)
!104 = !DIEnumerator(name: "CPP_OTHER", value: 60, isUnsigned: true)
!105 = !DIEnumerator(name: "CPP_STRING", value: 61, isUnsigned: true)
!106 = !DIEnumerator(name: "CPP_WSTRING", value: 62, isUnsigned: true)
!107 = !DIEnumerator(name: "CPP_STRING16", value: 63, isUnsigned: true)
!108 = !DIEnumerator(name: "CPP_STRING32", value: 64, isUnsigned: true)
!109 = !DIEnumerator(name: "CPP_UTF8STRING", value: 65, isUnsigned: true)
!110 = !DIEnumerator(name: "CPP_OBJC_STRING", value: 66, isUnsigned: true)
!111 = !DIEnumerator(name: "CPP_HEADER_NAME", value: 67, isUnsigned: true)
!112 = !DIEnumerator(name: "CPP_COMMENT", value: 68, isUnsigned: true)
!113 = !DIEnumerator(name: "CPP_MACRO_ARG", value: 69, isUnsigned: true)
!114 = !DIEnumerator(name: "CPP_PRAGMA", value: 70, isUnsigned: true)
!115 = !DIEnumerator(name: "CPP_PRAGMA_EOL", value: 71, isUnsigned: true)
!116 = !DIEnumerator(name: "CPP_PADDING", value: 72, isUnsigned: true)
!117 = !DIEnumerator(name: "N_TTYPES", value: 73, isUnsigned: true)
!118 = !DIEnumerator(name: "CPP_LAST_EQ", value: 13, isUnsigned: true)
!119 = !DIEnumerator(name: "CPP_FIRST_DIGRAPH", value: 37, isUnsigned: true)
!120 = !DIEnumerator(name: "CPP_LAST_PUNCTUATOR", value: 52, isUnsigned: true)
!121 = !DIEnumerator(name: "CPP_LAST_CPP_OP", value: 26, isUnsigned: true)
!122 = !{!123, !124, !128, !129, !7, !127, !130, !131, !133, !135, !217, !219}
!123 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !126, line: 22, baseType: !127)
!126 = !DIFile(filename: "./cpp-id-data.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!127 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!128 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!129 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "iconv_t", file: !132, line: 29, baseType: !130)
!132 = !DIFile(filename: "/usr/include/iconv.h", directory: "")
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !134, line: 46, baseType: !123)
!134 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_hashnode", file: !6, line: 36, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_hashnode", file: !6, line: 644, size: 256, elements: !138)
!138 = !{!139, !148, !149, !150, !151, !152, !153}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !137, file: !6, line: 645, baseType: !140, size: 128)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !141, line: 31, size: 128, elements: !142)
!141 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!142 = !{!143, !146, !147}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !140, file: !141, line: 32, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !127)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !140, file: !141, line: 33, baseType: !7, size: 32, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !140, file: !141, line: 34, baseType: !7, size: 32, offset: 96)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "is_directive", scope: !137, file: !6, line: 646, baseType: !7, size: 1, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "directive_index", scope: !137, file: !6, line: 647, baseType: !7, size: 7, offset: 129, flags: DIFlagBitField, extraData: i64 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "rid_code", scope: !137, file: !6, line: 650, baseType: !127, size: 8, offset: 136)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !137, file: !6, line: 651, baseType: !7, size: 6, offset: 144, flags: DIFlagBitField, extraData: i64 144)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !137, file: !6, line: 652, baseType: !7, size: 10, offset: 150, flags: DIFlagBitField, extraData: i64 144)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !137, file: !6, line: 654, baseType: !154, size: 64, offset: 192)
!154 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_cpp_hashnode_value", file: !6, line: 633, size: 64, elements: !155)
!155 = !{!156, !205, !215, !216}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !154, file: !6, line: 635, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_macro", file: !6, line: 37, baseType: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_macro", file: !126, line: 36, size: 256, elements: !160)
!160 = !{!161, !163, !196, !197, !198, !199, !200, !201, !202, !203, !204}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !159, file: !126, line: 42, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !159, file: !126, line: 51, baseType: !164, size: 64, offset: 64)
!164 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cpp_macro_u", file: !126, line: 47, size: 64, elements: !165)
!165 = !{!166, !195}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "tokens", scope: !164, file: !126, line: 49, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_token", file: !6, line: 34, baseType: !169)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_token", file: !6, line: 212, size: 192, elements: !170)
!170 = !{!171, !174, !175, !176}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "src_loc", scope: !169, file: !6, line: 213, baseType: !172, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !173, line: 44, baseType: !7)
!173 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!174 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !169, file: !6, line: 214, baseType: !7, size: 8, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !169, file: !6, line: 215, baseType: !129, size: 16, offset: 48)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !169, file: !6, line: 237, baseType: !177, size: 128, offset: 64)
!177 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cpp_token_u", file: !6, line: 217, size: 128, elements: !178)
!178 = !{!179, !183, !184, !189, !193, !194}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !177, file: !6, line: 220, baseType: !180, size: 64)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_identifier", file: !6, line: 201, size: 64, elements: !181)
!181 = !{!182}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !180, file: !6, line: 207, baseType: !135, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !177, file: !6, line: 223, baseType: !167, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !177, file: !6, line: 226, baseType: !185, size: 128)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_string", file: !6, line: 162, size: 128, elements: !186)
!186 = !{!187, !188}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !185, file: !6, line: 163, baseType: !7, size: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !185, file: !6, line: 164, baseType: !144, size: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "macro_arg", scope: !177, file: !6, line: 229, baseType: !190, size: 32)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_macro_arg", file: !6, line: 195, size: 32, elements: !191)
!191 = !{!192}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "arg_no", scope: !190, file: !6, line: 197, baseType: !7, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "token_no", scope: !177, file: !6, line: 233, baseType: !7, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "pragma", scope: !177, file: !6, line: 236, baseType: !7, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !164, file: !126, line: 50, baseType: !144, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !159, file: !126, line: 54, baseType: !172, size: 32, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !159, file: !126, line: 57, baseType: !7, size: 32, offset: 160)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "paramc", scope: !159, file: !126, line: 60, baseType: !129, size: 16, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "fun_like", scope: !159, file: !126, line: 63, baseType: !7, size: 1, offset: 208, flags: DIFlagBitField, extraData: i64 208)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "variadic", scope: !159, file: !126, line: 66, baseType: !7, size: 1, offset: 209, flags: DIFlagBitField, extraData: i64 208)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "syshdr", scope: !159, file: !126, line: 69, baseType: !7, size: 1, offset: 210, flags: DIFlagBitField, extraData: i64 208)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !159, file: !126, line: 72, baseType: !7, size: 1, offset: 211, flags: DIFlagBitField, extraData: i64 208)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "traditional", scope: !159, file: !126, line: 75, baseType: !7, size: 1, offset: 212, flags: DIFlagBitField, extraData: i64 208)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "extra_tokens", scope: !159, file: !126, line: 80, baseType: !7, size: 1, offset: 213, flags: DIFlagBitField, extraData: i64 208)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "answers", scope: !154, file: !6, line: 637, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "answer", file: !126, line: 28, size: 320, elements: !208)
!208 = !{!209, !210, !211}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !207, file: !126, line: 29, baseType: !206, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !207, file: !126, line: 30, baseType: !7, size: 32, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !207, file: !126, line: 31, baseType: !212, size: 192, offset: 128)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 192, elements: !213)
!213 = !{!214}
!214 = !DISubrange(count: 1)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "builtin", scope: !154, file: !6, line: 639, baseType: !5, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "arg_index", scope: !154, file: !6, line: 641, baseType: !129, size: 16)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "cppchar_t", file: !6, line: 258, baseType: !7)
!220 = !{!0, !221, !247, !249, !260, !767, !782}
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(name: "masks", scope: !223, file: !3, line: 173, type: !244, isLocal: true, isDefinition: true)
!223 = distinct !DISubprogram(name: "one_utf8_to_cppchar", scope: !3, file: !3, line: 170, type: !224, scopeLine: 172, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !231)
!224 = !DISubroutineType(types: !225)
!225 = !{!128, !226, !229, !230}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!231 = !{!232, !233, !234, !235, !236, !237, !238, !239, !243}
!232 = !DILocalVariable(name: "inbufp", arg: 1, scope: !223, file: !3, line: 170, type: !226)
!233 = !DILocalVariable(name: "inbytesleftp", arg: 2, scope: !223, file: !3, line: 170, type: !229)
!234 = !DILocalVariable(name: "cp", arg: 3, scope: !223, file: !3, line: 171, type: !230)
!235 = !DILocalVariable(name: "c", scope: !223, file: !3, line: 176, type: !219)
!236 = !DILocalVariable(name: "inbuf", scope: !223, file: !3, line: 177, type: !227)
!237 = !DILocalVariable(name: "nbytes", scope: !223, file: !3, line: 178, type: !133)
!238 = !DILocalVariable(name: "i", scope: !223, file: !3, line: 178, type: !133)
!239 = !DILocalVariable(name: "n", scope: !240, file: !3, line: 207, type: !219)
!240 = distinct !DILexicalBlock(scope: !241, file: !3, line: 206, column: 5)
!241 = distinct !DILexicalBlock(scope: !242, file: !3, line: 205, column: 3)
!242 = distinct !DILexicalBlock(scope: !223, file: !3, line: 205, column: 3)
!243 = !DILabel(scope: !223, name: "found", file: !3, line: 198)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 48, elements: !245)
!245 = !{!246}
!246 = !DISubrange(count: 6)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(name: "patns", scope: !223, file: !3, line: 174, type: !244, isLocal: true, isDefinition: true)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(name: "ucnranges", scope: !2, file: !3, line: 857, type: !251, isLocal: true, isDefinition: true)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 23904, elements: !258)
!252 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 850, size: 32, elements: !254)
!254 = !{!255, !256, !257}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !253, file: !3, line: 852, baseType: !127, size: 8)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "combine", scope: !253, file: !3, line: 854, baseType: !127, size: 8, offset: 8)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !253, file: !3, line: 856, baseType: !129, size: 16, offset: 16)
!258 = !{!259}
!259 = !DISubrange(count: 747)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "charconsts", scope: !262, file: !3, line: 1264, type: !764, isLocal: true, isDefinition: true)
!262 = distinct !DISubprogram(name: "convert_escape", scope: !3, file: !3, line: 1259, type: !263, scopeLine: 1261, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !749)
!263 = !DISubroutineType(types: !264)
!264 = !{!227, !265, !227, !227, !340, !333}
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_reader", file: !6, line: 31, baseType: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_reader", file: !268, line: 322, size: 10432, elements: !269)
!268 = !DIFile(filename: "./internal.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!269 = !{!270, !348, !349, !366, !396, !397, !408, !409, !410, !440, !442, !446, !447, !448, !449, !450, !451, !452, !453, !454, !457, !458, !461, !462, !495, !496, !497, !500, !501, !502, !503, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !529, !530, !531, !534, !614, !640, !643, !644, !707, !714, !715, !722, !723, !724, !725, !728, !729, !742}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !267, file: !268, line: 325, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_buffer", file: !6, line: 32, baseType: !273)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_buffer", file: !268, line: 249, size: 1536, elements: !274)
!274 = !{!275, !276, !277, !278, !279, !280, !287, !288, !289, !290, !292, !295, !296, !299, !300, !301, !302, !303, !304, !332}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !273, file: !268, line: 251, baseType: !144, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "line_base", scope: !273, file: !268, line: 252, baseType: !144, size: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "next_line", scope: !273, file: !268, line: 253, baseType: !144, size: 64, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !273, file: !268, line: 255, baseType: !144, size: 64, offset: 192)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit", scope: !273, file: !268, line: 256, baseType: !144, size: 64, offset: 256)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "notes", scope: !273, file: !268, line: 258, baseType: !281, size: 64, offset: 320)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cpp_line_note", file: !268, line: 235, baseType: !283)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_line_note", file: !268, line: 236, size: 128, elements: !284)
!284 = !{!285, !286}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !283, file: !268, line: 239, baseType: !144, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !283, file: !268, line: 245, baseType: !7, size: 32, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "cur_note", scope: !273, file: !268, line: 259, baseType: !7, size: 32, offset: 384)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "notes_used", scope: !273, file: !268, line: 260, baseType: !7, size: 32, offset: 416)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "notes_cap", scope: !273, file: !268, line: 261, baseType: !7, size: 32, offset: 448)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !273, file: !268, line: 263, baseType: !291, size: 64, offset: 512)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !273, file: !268, line: 267, baseType: !293, size: 64, offset: 576)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_file", file: !6, line: 42, flags: DIFlagFwdDecl)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !273, file: !268, line: 271, baseType: !144, size: 64, offset: 640)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "if_stack", scope: !273, file: !268, line: 275, baseType: !297, size: 64, offset: 704)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "if_stack", file: !268, line: 275, flags: DIFlagFwdDecl)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "need_line", scope: !273, file: !268, line: 278, baseType: !127, size: 8, offset: 768)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "warned_cplusplus_comments", scope: !273, file: !268, line: 284, baseType: !7, size: 1, offset: 776, flags: DIFlagBitField, extraData: i64 776)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "from_stage3", scope: !273, file: !268, line: 289, baseType: !7, size: 1, offset: 777, flags: DIFlagBitField, extraData: i64 776)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "return_at_eof", scope: !273, file: !268, line: 294, baseType: !7, size: 1, offset: 778, flags: DIFlagBitField, extraData: i64 776)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !273, file: !268, line: 298, baseType: !127, size: 8, offset: 784)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !273, file: !268, line: 302, baseType: !305, size: 512, offset: 832)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_dir", file: !6, line: 523, size: 512, elements: !306)
!306 = !{!307, !309, !310, !311, !312, !313, !314, !318, !324, !329}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !305, file: !6, line: 526, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !305, file: !6, line: 529, baseType: !217, size: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !305, file: !6, line: 530, baseType: !7, size: 32, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !305, file: !6, line: 534, baseType: !127, size: 8, offset: 160)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "user_supplied_p", scope: !305, file: !6, line: 537, baseType: !127, size: 8, offset: 168)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "canonical_name", scope: !305, file: !6, line: 541, baseType: !217, size: 64, offset: 192)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "name_map", scope: !305, file: !6, line: 545, baseType: !315, size: 64, offset: 256)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !218)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "construct", scope: !305, file: !6, line: 551, baseType: !319, size: 64, offset: 320)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!217, !316, !322}
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_dir", file: !6, line: 39, baseType: !305)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !305, file: !6, line: 555, baseType: !325, size: 64, offset: 384)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !326, line: 47, baseType: !327)
!326 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !328, line: 148, baseType: !123)
!328 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!329 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !305, file: !6, line: 556, baseType: !330, size: 64, offset: 448)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !326, line: 59, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !328, line: 145, baseType: !123)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "input_cset_desc", scope: !273, file: !268, line: 306, baseType: !333, size: 192, offset: 1344)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cset_converter", file: !268, line: 47, size: 192, elements: !334)
!334 = !{!335, !346, !347}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !333, file: !268, line: 49, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "convert_f", file: !268, line: 45, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{!127, !131, !144, !133, !340}
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_strbuf", file: !3, line: 99, size: 192, elements: !342)
!342 = !{!343, !344, !345}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !341, file: !3, line: 101, baseType: !124, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "asize", scope: !341, file: !3, line: 102, baseType: !133, size: 64, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !341, file: !3, line: 103, baseType: !133, size: 64, offset: 128)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "cd", scope: !333, file: !268, line: 50, baseType: !131, size: 64, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !333, file: !268, line: 51, baseType: !128, size: 32, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "overlaid_buffer", scope: !267, file: !268, line: 328, baseType: !271, size: 64, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !267, file: !268, line: 331, baseType: !350, size: 160, offset: 128)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lexer_state", file: !268, line: 177, size: 160, elements: !351)
!351 = !{!352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "in_directive", scope: !350, file: !268, line: 180, baseType: !127, size: 8)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "directive_wants_padding", scope: !350, file: !268, line: 185, baseType: !127, size: 8, offset: 8)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "skipping", scope: !350, file: !268, line: 188, baseType: !127, size: 8, offset: 16)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "angled_headers", scope: !350, file: !268, line: 191, baseType: !127, size: 8, offset: 24)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "in_expression", scope: !350, file: !268, line: 194, baseType: !127, size: 8, offset: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "save_comments", scope: !350, file: !268, line: 198, baseType: !127, size: 8, offset: 40)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "va_args_ok", scope: !350, file: !268, line: 201, baseType: !127, size: 8, offset: 48)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "poisoned_ok", scope: !350, file: !268, line: 204, baseType: !127, size: 8, offset: 56)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "prevent_expansion", scope: !350, file: !268, line: 207, baseType: !127, size: 8, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "parsing_args", scope: !350, file: !268, line: 210, baseType: !127, size: 8, offset: 72)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "discarding_output", scope: !350, file: !268, line: 214, baseType: !127, size: 8, offset: 80)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "skip_eval", scope: !350, file: !268, line: 217, baseType: !7, size: 32, offset: 96)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "in_deferred_pragma", scope: !350, file: !268, line: 220, baseType: !127, size: 8, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "pragma_allow_expansion", scope: !350, file: !268, line: 223, baseType: !127, size: 8, offset: 136)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "line_table", scope: !267, file: !268, line: 334, baseType: !367, size: 64, offset: 320)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line_maps", file: !173, line: 74, size: 448, elements: !369)
!369 = !{!370, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "maps", scope: !368, file: !173, line: 75, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line_map", file: !173, line: 61, size: 192, elements: !373)
!373 = !{!374, !375, !377, !378, !379, !380, !381}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "to_file", scope: !372, file: !173, line: 62, baseType: !316, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "to_line", scope: !372, file: !173, line: 63, baseType: !376, size: 32, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "linenum_type", file: !173, line: 39, baseType: !7)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "start_location", scope: !372, file: !173, line: 64, baseType: !172, size: 32, offset: 96)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "included_from", scope: !372, file: !173, line: 65, baseType: !128, size: 32, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !372, file: !173, line: 66, baseType: !7, size: 8, offset: 160, flags: DIFlagBitField, extraData: i64 160)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !372, file: !173, line: 68, baseType: !127, size: 8, offset: 168)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "column_bits", scope: !372, file: !173, line: 70, baseType: !7, size: 8, offset: 176, flags: DIFlagBitField, extraData: i64 176)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !368, file: !173, line: 76, baseType: !7, size: 32, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !368, file: !173, line: 77, baseType: !7, size: 32, offset: 96)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !368, file: !173, line: 79, baseType: !7, size: 32, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "last_listed", scope: !368, file: !173, line: 84, baseType: !128, size: 32, offset: 160)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !368, file: !173, line: 87, baseType: !7, size: 32, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "trace_includes", scope: !368, file: !173, line: 90, baseType: !127, size: 8, offset: 224)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "highest_location", scope: !368, file: !173, line: 93, baseType: !172, size: 32, offset: 256)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "highest_line", scope: !368, file: !173, line: 96, baseType: !172, size: 32, offset: 288)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "max_column_hint", scope: !368, file: !173, line: 100, baseType: !7, size: 32, offset: 320)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "reallocator", scope: !368, file: !173, line: 104, baseType: !392, size: 64, offset: 384)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "line_map_realloc", file: !173, line: 47, baseType: !393)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!130, !130, !133}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "directive_line", scope: !267, file: !268, line: 337, baseType: !172, size: 32, offset: 384)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "a_buff", scope: !267, file: !268, line: 340, baseType: !398, size: 64, offset: 448)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cpp_buff", file: !268, line: 99, baseType: !400)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_buff", file: !268, line: 100, size: 256, elements: !401)
!401 = !{!402, !404, !406, !407}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !400, file: !268, line: 102, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !400, file: !268, line: 103, baseType: !405, size: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !400, file: !268, line: 103, baseType: !405, size: 64, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !400, file: !268, line: 103, baseType: !405, size: 64, offset: 192)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "u_buff", scope: !267, file: !268, line: 341, baseType: !398, size: 64, offset: 512)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "free_buffs", scope: !267, file: !268, line: 342, baseType: !398, size: 64, offset: 576)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "base_context", scope: !267, file: !268, line: 345, baseType: !411, size: 448, offset: 640)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_context", file: !268, line: 142, size: 448, elements: !412)
!412 = !{!413, !416, !417, !437, !438, !439}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !411, file: !268, line: 145, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_context", file: !268, line: 141, baseType: !411)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !411, file: !268, line: 145, baseType: !414, size: 64, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !411, file: !268, line: 164, baseType: !418, size: 128, offset: 128)
!418 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !411, file: !268, line: 147, size: 128, elements: !419)
!419 = !{!420, !432}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "iso", scope: !418, file: !268, line: 156, baseType: !421, size: 128)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !418, file: !268, line: 152, size: 128, elements: !422)
!422 = !{!423, !431}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !421, file: !268, line: 154, baseType: !424, size: 64)
!424 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "utoken", file: !268, line: 121, size: 64, elements: !425)
!425 = !{!426, !429}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !424, file: !268, line: 123, baseType: !427, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !168)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ptoken", scope: !424, file: !268, line: 124, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !421, file: !268, line: 155, baseType: !424, size: 64, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "trad", scope: !418, file: !268, line: 163, baseType: !433, size: 128)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !418, file: !268, line: 159, size: 128, elements: !434)
!434 = !{!435, !436}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !433, file: !268, line: 161, baseType: !144, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit", scope: !433, file: !268, line: 162, baseType: !144, size: 64, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !411, file: !268, line: 168, baseType: !398, size: 64, offset: 256)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !411, file: !268, line: 171, baseType: !135, size: 64, offset: 320)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "direct_p", scope: !411, file: !268, line: 174, baseType: !127, size: 8, offset: 384)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !267, file: !268, line: 346, baseType: !441, size: 64, offset: 1088)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "directive", scope: !267, file: !268, line: 349, baseType: !443, size: 64, offset: 1152)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !445)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "directive", file: !268, line: 40, flags: DIFlagFwdDecl)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "directive_result", scope: !267, file: !268, line: 352, baseType: !168, size: 192, offset: 1216)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "invocation_location", scope: !267, file: !268, line: 356, baseType: !172, size: 32, offset: 1408)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "set_invocation_location", scope: !267, file: !268, line: 360, baseType: !127, size: 8, offset: 1440)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "quote_include", scope: !267, file: !268, line: 363, baseType: !308, size: 64, offset: 1472)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "bracket_include", scope: !267, file: !268, line: 364, baseType: !308, size: 64, offset: 1536)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "no_search_path", scope: !267, file: !268, line: 365, baseType: !305, size: 512, offset: 1600)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "all_files", scope: !267, file: !268, line: 368, baseType: !293, size: 64, offset: 2112)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "main_file", scope: !267, file: !268, line: 370, baseType: !293, size: 64, offset: 2176)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "file_hash", scope: !267, file: !268, line: 373, baseType: !455, size: 64, offset: 2240)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !268, line: 373, flags: DIFlagFwdDecl)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "dir_hash", scope: !267, file: !268, line: 374, baseType: !455, size: 64, offset: 2304)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "file_hash_entries", scope: !267, file: !268, line: 375, baseType: !459, size: 64, offset: 2368)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "file_hash_entry_pool", file: !268, line: 375, flags: DIFlagFwdDecl)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "nonexistent_file_hash", scope: !267, file: !268, line: 378, baseType: !455, size: 64, offset: 2432)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "nonexistent_file_ob", scope: !267, file: !268, line: 379, baseType: !463, size: 704, offset: 2496)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !464, line: 164, size: 704, elements: !465)
!464 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!465 = !{!466, !468, !478, !479, !480, !481, !482, !483, !487, !491, !492, !493, !494}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !463, file: !464, line: 166, baseType: !467, size: 64)
!467 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !463, file: !464, line: 167, baseType: !469, size: 64, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !464, line: 157, size: 192, elements: !471)
!471 = !{!472, !473, !474}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !470, file: !464, line: 159, baseType: !217, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !470, file: !464, line: 160, baseType: !469, size: 64, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !470, file: !464, line: 161, baseType: !475, size: 32, offset: 128)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 32, elements: !476)
!476 = !{!477}
!477 = !DISubrange(count: 4)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !463, file: !464, line: 168, baseType: !217, size: 64, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !463, file: !464, line: 169, baseType: !217, size: 64, offset: 192)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !463, file: !464, line: 170, baseType: !217, size: 64, offset: 256)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !463, file: !464, line: 171, baseType: !467, size: 64, offset: 320)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !463, file: !464, line: 172, baseType: !128, size: 32, offset: 384)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !463, file: !464, line: 176, baseType: !484, size: 64, offset: 448)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{!469, !130, !467}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !463, file: !464, line: 177, baseType: !488, size: 64, offset: 512)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DISubroutineType(types: !490)
!490 = !{null, !130, !469}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !463, file: !464, line: 178, baseType: !130, size: 64, offset: 576)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !463, file: !464, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !463, file: !464, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !463, file: !464, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "quote_ignores_source_dir", scope: !267, file: !268, line: 383, baseType: !127, size: 8, offset: 3200)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "seen_once_only", scope: !267, file: !268, line: 387, baseType: !127, size: 8, offset: 3208)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "mi_cmacro", scope: !267, file: !268, line: 390, baseType: !498, size: 64, offset: 3264)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "mi_ind_cmacro", scope: !267, file: !268, line: 391, baseType: !498, size: 64, offset: 3328)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "mi_valid", scope: !267, file: !268, line: 392, baseType: !127, size: 8, offset: 3392)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "cur_token", scope: !267, file: !268, line: 395, baseType: !167, size: 64, offset: 3456)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "base_run", scope: !267, file: !268, line: 396, baseType: !504, size: 256, offset: 3520)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "tokenrun", file: !268, line: 128, baseType: !505)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tokenrun", file: !268, line: 129, size: 256, elements: !506)
!506 = !{!507, !509, !510, !511}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !505, file: !268, line: 131, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !505, file: !268, line: 131, baseType: !508, size: 64, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !505, file: !268, line: 132, baseType: !167, size: 64, offset: 128)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !505, file: !268, line: 132, baseType: !167, size: 64, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "cur_run", scope: !267, file: !268, line: 396, baseType: !508, size: 64, offset: 3776)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "lookaheads", scope: !267, file: !268, line: 397, baseType: !7, size: 32, offset: 3840)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "keep_tokens", scope: !267, file: !268, line: 400, baseType: !7, size: 32, offset: 3872)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "macro_buffer", scope: !267, file: !268, line: 403, baseType: !405, size: 64, offset: 3904)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "macro_buffer_len", scope: !267, file: !268, line: 404, baseType: !7, size: 32, offset: 3968)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "narrow_cset_desc", scope: !267, file: !268, line: 408, baseType: !333, size: 192, offset: 4032)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_cset_desc", scope: !267, file: !268, line: 412, baseType: !333, size: 192, offset: 4224)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "char16_cset_desc", scope: !267, file: !268, line: 416, baseType: !333, size: 192, offset: 4416)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "char32_cset_desc", scope: !267, file: !268, line: 420, baseType: !333, size: 192, offset: 4608)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "wide_cset_desc", scope: !267, file: !268, line: 424, baseType: !333, size: 192, offset: 4800)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !267, file: !268, line: 427, baseType: !144, size: 64, offset: 4992)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !267, file: !268, line: 428, baseType: !144, size: 64, offset: 5056)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "avoid_paste", scope: !267, file: !268, line: 431, baseType: !168, size: 192, offset: 5120)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !267, file: !268, line: 432, baseType: !168, size: 192, offset: 5312)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "deps", scope: !267, file: !268, line: 435, baseType: !527, size: 64, offset: 5504)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DICompositeType(tag: DW_TAG_structure_type, name: "deps", file: !6, line: 685, flags: DIFlagFwdDecl)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "hash_ob", scope: !267, file: !268, line: 439, baseType: !463, size: 704, offset: 5568)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_ob", scope: !267, file: !268, line: 443, baseType: !463, size: 704, offset: 6272)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "pragmas", scope: !267, file: !268, line: 447, baseType: !532, size: 64, offset: 6976)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DICompositeType(tag: DW_TAG_structure_type, name: "pragma_entry", file: !268, line: 447, flags: DIFlagFwdDecl)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !267, file: !268, line: 450, baseType: !535, size: 1088, offset: 7040)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_callbacks", file: !6, line: 472, size: 1088, elements: !536)
!536 = !{!537, !541, !547, !551, !555, !559, !560, !567, !571, !575, !579, !585, !589, !604, !605, !606, !610}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "line_change", scope: !535, file: !6, line: 475, baseType: !538, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DISubroutineType(types: !540)
!540 = !{null, !265, !427, !128}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "file_change", scope: !535, file: !6, line: 481, baseType: !542, size: 64, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{null, !265, !545}
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !372)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "dir_change", scope: !535, file: !6, line: 483, baseType: !548, size: 64, offset: 128)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DISubroutineType(types: !550)
!550 = !{null, !265, !316}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "include", scope: !535, file: !6, line: 484, baseType: !552, size: 64, offset: 192)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DISubroutineType(types: !554)
!554 = !{null, !265, !7, !144, !316, !128, !430}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "define", scope: !535, file: !6, line: 486, baseType: !556, size: 64, offset: 256)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DISubroutineType(types: !558)
!558 = !{null, !265, !7, !135}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "undef", scope: !535, file: !6, line: 487, baseType: !556, size: 64, offset: 320)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !535, file: !6, line: 488, baseType: !561, size: 64, offset: 384)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DISubroutineType(types: !563)
!563 = !{null, !265, !7, !564}
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !566)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_string", file: !6, line: 35, baseType: !185)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "def_pragma", scope: !535, file: !6, line: 489, baseType: !568, size: 64, offset: 448)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DISubroutineType(types: !570)
!570 = !{null, !265, !7}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "valid_pch", scope: !535, file: !6, line: 490, baseType: !572, size: 64, offset: 512)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DISubroutineType(types: !574)
!574 = !{!128, !265, !316, !128}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "read_pch", scope: !535, file: !6, line: 491, baseType: !576, size: 64, offset: 576)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{null, !265, !316, !128, !316}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "missing_header", scope: !535, file: !6, line: 492, baseType: !580, size: 64, offset: 640)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "missing_header_cb", file: !6, line: 469, baseType: !581)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DISubroutineType(types: !583)
!583 = !{!316, !265, !316, !584}
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "macro_to_expand", scope: !535, file: !6, line: 496, baseType: !586, size: 64, offset: 704)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DISubroutineType(types: !588)
!588 = !{!135, !265, !427}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !535, file: !6, line: 500, baseType: !590, size: 64, offset: 768)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{!127, !265, !128, !172, !7, !316, !593}
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !595, line: 14, baseType: !596)
!595 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stdarg.h", directory: "")
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 216, baseType: !597)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !598, size: 192, elements: !213)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 216, size: 192, elements: !599)
!599 = !{!600, !601, !602, !603}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !598, file: !3, line: 216, baseType: !7, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !598, file: !3, line: 216, baseType: !7, size: 32, offset: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !598, file: !3, line: 216, baseType: !130, size: 64, offset: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !598, file: !3, line: 216, baseType: !130, size: 64, offset: 128)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "used_define", scope: !535, file: !6, line: 506, baseType: !556, size: 64, offset: 832)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "used_undef", scope: !535, file: !6, line: 507, baseType: !556, size: 64, offset: 896)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "before_define", scope: !535, file: !6, line: 510, baseType: !607, size: 64, offset: 960)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DISubroutineType(types: !609)
!609 = !{null, !265}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !535, file: !6, line: 513, baseType: !611, size: 64, offset: 1024)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{null, !265, !172, !135}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "hash_table", scope: !267, file: !268, line: 453, baseType: !615, size: 64, offset: 8128)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht", file: !141, line: 46, size: 1152, elements: !617)
!617 = !{!618, !619, !623, !629, !633, !634, !635, !637, !638, !639}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !616, file: !141, line: 49, baseType: !463, size: 704)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !616, file: !141, line: 51, baseType: !620, size: 64, offset: 704)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashnode", file: !141, line: 41, baseType: !622)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_node", scope: !616, file: !141, line: 53, baseType: !624, size: 64, offset: 768)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DISubroutineType(types: !626)
!626 = !{!621, !627}
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_table", file: !141, line: 40, baseType: !616)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_subobject", scope: !616, file: !141, line: 56, baseType: !630, size: 64, offset: 832)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{!130, !133}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "nslots", scope: !616, file: !141, line: 58, baseType: !7, size: 32, offset: 896)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "nelements", scope: !616, file: !141, line: 59, baseType: !7, size: 32, offset: 928)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "pfile", scope: !616, file: !141, line: 62, baseType: !636, size: 64, offset: 960)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !616, file: !141, line: 65, baseType: !7, size: 32, offset: 1024)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !616, file: !141, line: 66, baseType: !7, size: 32, offset: 1056)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "entries_owned", scope: !616, file: !141, line: 69, baseType: !127, size: 8, offset: 1088)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "op_stack", scope: !267, file: !268, line: 456, baseType: !641, size: 64, offset: 8192)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DICompositeType(tag: DW_TAG_structure_type, name: "op", file: !268, line: 42, flags: DIFlagFwdDecl)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "op_limit", scope: !267, file: !268, line: 456, baseType: !641, size: 64, offset: 8256)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !267, file: !268, line: 459, baseType: !645, size: 1024, offset: 8320)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_options", file: !6, line: 279, size: 1024, elements: !646)
!646 = !{!647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !698, !699, !700, !701, !702, !703, !704, !705, !706}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "tabstop", scope: !645, file: !6, line: 282, baseType: !7, size: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "lang", scope: !645, file: !6, line: 285, baseType: !19, size: 32, offset: 32)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "cplusplus", scope: !645, file: !6, line: 288, baseType: !127, size: 8, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "cplusplus_comments", scope: !645, file: !6, line: 291, baseType: !127, size: 8, offset: 72)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "objc", scope: !645, file: !6, line: 296, baseType: !127, size: 8, offset: 80)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "discard_comments", scope: !645, file: !6, line: 299, baseType: !127, size: 8, offset: 88)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "discard_comments_in_macro_exp", scope: !645, file: !6, line: 303, baseType: !127, size: 8, offset: 96)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "trigraphs", scope: !645, file: !6, line: 306, baseType: !127, size: 8, offset: 104)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "digraphs", scope: !645, file: !6, line: 309, baseType: !127, size: 8, offset: 112)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "extended_numbers", scope: !645, file: !6, line: 312, baseType: !127, size: 8, offset: 120)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "uliterals", scope: !645, file: !6, line: 315, baseType: !127, size: 8, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "print_include_names", scope: !645, file: !6, line: 318, baseType: !127, size: 8, offset: 136)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "warn_deprecated", scope: !645, file: !6, line: 321, baseType: !127, size: 8, offset: 144)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "warn_comments", scope: !645, file: !6, line: 324, baseType: !127, size: 8, offset: 152)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "warn_missing_include_dirs", scope: !645, file: !6, line: 328, baseType: !127, size: 8, offset: 160)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "warn_trigraphs", scope: !645, file: !6, line: 331, baseType: !127, size: 8, offset: 168)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "warn_multichar", scope: !645, file: !6, line: 334, baseType: !127, size: 8, offset: 176)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "warn_traditional", scope: !645, file: !6, line: 338, baseType: !127, size: 8, offset: 184)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "warn_long_long", scope: !645, file: !6, line: 341, baseType: !127, size: 8, offset: 192)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "warn_endif_labels", scope: !645, file: !6, line: 344, baseType: !127, size: 8, offset: 200)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "warn_num_sign_change", scope: !645, file: !6, line: 348, baseType: !127, size: 8, offset: 208)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "warn_variadic_macros", scope: !645, file: !6, line: 352, baseType: !127, size: 8, offset: 216)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "warn_builtin_macro_redefined", scope: !645, file: !6, line: 356, baseType: !127, size: 8, offset: 224)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !645, file: !6, line: 360, baseType: !127, size: 8, offset: 232)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "dollars_in_ident", scope: !645, file: !6, line: 363, baseType: !127, size: 8, offset: 240)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "extended_identifiers", scope: !645, file: !6, line: 366, baseType: !127, size: 8, offset: 248)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "warn_dollars", scope: !645, file: !6, line: 370, baseType: !127, size: 8, offset: 256)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "warn_undef", scope: !645, file: !6, line: 373, baseType: !127, size: 8, offset: 264)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "warn_unused_macros", scope: !645, file: !6, line: 376, baseType: !127, size: 8, offset: 272)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "c99", scope: !645, file: !6, line: 379, baseType: !127, size: 8, offset: 280)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "std", scope: !645, file: !6, line: 382, baseType: !127, size: 8, offset: 288)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "pedantic", scope: !645, file: !6, line: 385, baseType: !127, size: 8, offset: 296)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "preprocessed", scope: !645, file: !6, line: 389, baseType: !127, size: 8, offset: 304)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "show_column", scope: !645, file: !6, line: 392, baseType: !127, size: 8, offset: 312)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "operator_names", scope: !645, file: !6, line: 395, baseType: !127, size: 8, offset: 320)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "warn_cxx_operator_names", scope: !645, file: !6, line: 398, baseType: !127, size: 8, offset: 328)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "traditional", scope: !645, file: !6, line: 401, baseType: !127, size: 8, offset: 336)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "narrow_charset", scope: !645, file: !6, line: 404, baseType: !316, size: 64, offset: 384)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "wide_charset", scope: !645, file: !6, line: 407, baseType: !316, size: 64, offset: 448)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "input_charset", scope: !645, file: !6, line: 410, baseType: !316, size: 64, offset: 512)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "warn_normalize", scope: !645, file: !6, line: 414, baseType: !31, size: 32, offset: 576)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "warn_invalid_pch", scope: !645, file: !6, line: 417, baseType: !127, size: 8, offset: 608)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "restore_pch_deps", scope: !645, file: !6, line: 420, baseType: !127, size: 8, offset: 616)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "deps", scope: !645, file: !6, line: 441, baseType: !691, size: 64, offset: 640)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !645, file: !6, line: 423, size: 64, elements: !692)
!692 = !{!693, !694, !695, !696, !697}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !691, file: !6, line: 426, baseType: !37, size: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "missing_files", scope: !691, file: !6, line: 429, baseType: !127, size: 8, offset: 32)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "phony_targets", scope: !691, file: !6, line: 433, baseType: !127, size: 8, offset: 40)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_main_file", scope: !691, file: !6, line: 436, baseType: !127, size: 8, offset: 48)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "need_preprocessor_output", scope: !691, file: !6, line: 440, baseType: !127, size: 8, offset: 56)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !645, file: !6, line: 447, baseType: !133, size: 64, offset: 704)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "char_precision", scope: !645, file: !6, line: 447, baseType: !133, size: 64, offset: 768)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "int_precision", scope: !645, file: !6, line: 447, baseType: !133, size: 64, offset: 832)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "wchar_precision", scope: !645, file: !6, line: 447, baseType: !133, size: 64, offset: 896)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_char", scope: !645, file: !6, line: 450, baseType: !127, size: 8, offset: 960)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_wchar", scope: !645, file: !6, line: 450, baseType: !127, size: 8, offset: 968)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_big_endian", scope: !645, file: !6, line: 454, baseType: !127, size: 8, offset: 976)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "stdc_0_in_system_headers", scope: !645, file: !6, line: 457, baseType: !127, size: 8, offset: 984)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "directives_only", scope: !645, file: !6, line: 460, baseType: !127, size: 8, offset: 992)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "spec_nodes", scope: !267, file: !268, line: 463, baseType: !708, size: 256, offset: 9344)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spec_nodes", file: !268, line: 227, size: 256, elements: !709)
!709 = !{!710, !711, !712, !713}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "n_defined", scope: !708, file: !268, line: 229, baseType: !135, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "n_true", scope: !708, file: !268, line: 230, baseType: !135, size: 64, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "n_false", scope: !708, file: !268, line: 231, baseType: !135, size: 64, offset: 128)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "n__VA_ARGS__", scope: !708, file: !268, line: 232, baseType: !135, size: 64, offset: 192)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "our_hashtable", scope: !267, file: !268, line: 466, baseType: !127, size: 8, offset: 9600)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !267, file: !268, line: 475, baseType: !716, size: 256, offset: 9664)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !267, file: !268, line: 469, size: 256, elements: !717)
!717 = !{!718, !719, !720, !721}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !716, file: !268, line: 471, baseType: !405, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !716, file: !268, line: 472, baseType: !405, size: 64, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !716, file: !268, line: 473, baseType: !405, size: 64, offset: 128)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "first_line", scope: !716, file: !268, line: 474, baseType: !172, size: 32, offset: 192)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "saved_cur", scope: !267, file: !268, line: 478, baseType: !144, size: 64, offset: 9920)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "saved_rlimit", scope: !267, file: !268, line: 478, baseType: !144, size: 64, offset: 9984)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "saved_line_base", scope: !267, file: !268, line: 478, baseType: !144, size: 64, offset: 10048)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "savedstate", scope: !267, file: !268, line: 482, baseType: !726, size: 64, offset: 10112)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_savedstate", file: !268, line: 482, flags: DIFlagFwdDecl)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !267, file: !268, line: 485, baseType: !7, size: 32, offset: 10176)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "comments", scope: !267, file: !268, line: 488, baseType: !730, size: 128, offset: 10240)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_comment_table", file: !6, line: 901, baseType: !731)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 891, size: 128, elements: !732)
!732 = !{!733, !740, !741}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !731, file: !6, line: 894, baseType: !734, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_comment", file: !6, line: 887, baseType: !736)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 880, size: 128, elements: !737)
!737 = !{!738, !739}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !736, file: !6, line: 883, baseType: !217, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "sloc", scope: !736, file: !6, line: 886, baseType: !172, size: 32, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !731, file: !6, line: 897, baseType: !128, size: 32, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !731, file: !6, line: 900, baseType: !128, size: 32, offset: 96)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "pushed_macros", scope: !267, file: !268, line: 491, baseType: !743, size: 64, offset: 10368)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_pragma_macro", file: !268, line: 310, size: 192, elements: !745)
!745 = !{!746, !747, !748}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !744, file: !268, line: 312, baseType: !743, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !744, file: !268, line: 314, baseType: !217, size: 64, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !744, file: !268, line: 316, baseType: !157, size: 64, offset: 128)
!749 = !{!750, !751, !752, !753, !754, !755, !756, !763}
!750 = !DILocalVariable(name: "pfile", arg: 1, scope: !262, file: !3, line: 1259, type: !265)
!751 = !DILocalVariable(name: "from", arg: 2, scope: !262, file: !3, line: 1259, type: !227)
!752 = !DILocalVariable(name: "limit", arg: 3, scope: !262, file: !3, line: 1259, type: !227)
!753 = !DILocalVariable(name: "tbuf", arg: 4, scope: !262, file: !3, line: 1260, type: !340)
!754 = !DILocalVariable(name: "cvt", arg: 5, scope: !262, file: !3, line: 1260, type: !333)
!755 = !DILocalVariable(name: "c", scope: !262, file: !3, line: 1271, type: !125)
!756 = !DILocalVariable(name: "buf", scope: !757, file: !3, line: 1331, type: !760)
!757 = distinct !DILexicalBlock(scope: !758, file: !3, line: 1328, column: 2)
!758 = distinct !DILexicalBlock(scope: !759, file: !3, line: 1324, column: 11)
!759 = distinct !DILexicalBlock(scope: !262, file: !3, line: 1275, column: 5)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 256, elements: !761)
!761 = !{!762}
!762 = !DISubrange(count: 32)
!763 = !DILabel(scope: !759, name: "unknown", file: !3, line: 1323)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 64, elements: !765)
!765 = !{!766}
!766 = !DISubrange(count: 8)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(name: "masks", scope: !769, file: !3, line: 232, type: !244, isLocal: true, isDefinition: true)
!769 = distinct !DISubprogram(name: "one_cppchar_to_utf8", scope: !3, file: !3, line: 230, type: !770, scopeLine: 231, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !773)
!770 = !DISubroutineType(types: !771)
!771 = !{!128, !219, !772, !229}
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!773 = !{!774, !775, !776, !777, !778, !780, !781}
!774 = !DILocalVariable(name: "c", arg: 1, scope: !769, file: !3, line: 230, type: !219)
!775 = !DILocalVariable(name: "outbufp", arg: 2, scope: !769, file: !3, line: 230, type: !772)
!776 = !DILocalVariable(name: "outbytesleftp", arg: 3, scope: !769, file: !3, line: 230, type: !229)
!777 = !DILocalVariable(name: "nbytes", scope: !769, file: !3, line: 234, type: !133)
!778 = !DILocalVariable(name: "buf", scope: !769, file: !3, line: 235, type: !779)
!779 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 48, elements: !245)
!780 = !DILocalVariable(name: "p", scope: !769, file: !3, line: 235, type: !124)
!781 = !DILocalVariable(name: "outbuf", scope: !769, file: !3, line: 236, type: !124)
!782 = !DIGlobalVariableExpression(var: !783, expr: !DIExpression())
!783 = distinct !DIGlobalVariable(name: "limits", scope: !769, file: !3, line: 233, type: !244, isLocal: true, isDefinition: true)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !785, size: 1536, elements: !765)
!785 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !786)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conversion", file: !3, line: 617, size: 192, elements: !787)
!787 = !{!788, !789, !790}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "pair", scope: !786, file: !3, line: 619, baseType: !316, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !786, file: !3, line: 620, baseType: !336, size: 64, offset: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "fake_cd", scope: !786, file: !3, line: 621, baseType: !131, size: 64, offset: 128)
!791 = !{i32 2, !"Dwarf Version", i32 4}
!792 = !{i32 2, !"Debug Info Version", i32 3}
!793 = !{i32 1, !"wchar_size", i32 4}
!794 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!795 = distinct !DISubprogram(name: "tolower", scope: !796, file: !796, line: 207, type: !797, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !799)
!796 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!797 = !DISubroutineType(types: !798)
!798 = !{!128, !128}
!799 = !{!800}
!800 = !DILocalVariable(name: "__c", arg: 1, scope: !795, file: !796, line: 207, type: !128)
!801 = !DILocation(line: 0, scope: !795)
!802 = !DILocation(line: 209, column: 22, scope: !795)
!803 = !DILocation(line: 209, column: 39, scope: !795)
!804 = !DILocation(line: 209, column: 38, scope: !795)
!805 = !DILocation(line: 209, column: 37, scope: !795)
!806 = !DILocation(line: 209, column: 10, scope: !795)
!807 = !DILocation(line: 209, column: 3, scope: !795)
!808 = distinct !DISubprogram(name: "toupper", scope: !796, file: !796, line: 213, type: !797, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !809)
!809 = !{!810}
!810 = !DILocalVariable(name: "__c", arg: 1, scope: !808, file: !796, line: 213, type: !128)
!811 = !DILocation(line: 0, scope: !808)
!812 = !DILocation(line: 215, column: 22, scope: !808)
!813 = !DILocation(line: 215, column: 39, scope: !808)
!814 = !DILocation(line: 215, column: 38, scope: !808)
!815 = !DILocation(line: 215, column: 37, scope: !808)
!816 = !DILocation(line: 215, column: 10, scope: !808)
!817 = !DILocation(line: 215, column: 3, scope: !808)
!818 = distinct !DISubprogram(name: "cpp_init_iconv", scope: !3, file: !3, line: 705, type: !608, scopeLine: 706, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !819)
!819 = !{!820, !821, !822, !823, !824}
!820 = !DILocalVariable(name: "pfile", arg: 1, scope: !818, file: !3, line: 705, type: !265)
!821 = !DILocalVariable(name: "ncset", scope: !818, file: !3, line: 707, type: !316)
!822 = !DILocalVariable(name: "wcset", scope: !818, file: !3, line: 708, type: !316)
!823 = !DILocalVariable(name: "default_wcset", scope: !818, file: !3, line: 709, type: !316)
!824 = !DILocalVariable(name: "be", scope: !818, file: !3, line: 711, type: !127)
!825 = !DILocation(line: 0, scope: !818)
!826 = !DILocation(line: 707, column: 23, scope: !818)
!827 = !DILocation(line: 708, column: 23, scope: !818)
!828 = !DILocation(line: 711, column: 13, scope: !818)
!829 = !DILocation(line: 713, column: 7, scope: !830)
!830 = distinct !DILexicalBlock(scope: !818, file: !3, line: 713, column: 7)
!831 = !DILocation(line: 713, column: 43, scope: !830)
!832 = !DILocation(line: 713, column: 7, scope: !818)
!833 = !DILocation(line: 714, column: 21, scope: !830)
!834 = !DILocation(line: 714, column: 5, scope: !830)
!835 = !DILocation(line: 715, column: 48, scope: !836)
!836 = distinct !DILexicalBlock(scope: !830, file: !3, line: 715, column: 12)
!837 = !DILocation(line: 715, column: 12, scope: !830)
!838 = !DILocation(line: 716, column: 21, scope: !836)
!839 = !DILocation(line: 716, column: 5, scope: !836)
!840 = !DILocation(line: 0, scope: !830)
!841 = !DILocation(line: 722, column: 8, scope: !842)
!842 = distinct !DILexicalBlock(scope: !818, file: !3, line: 722, column: 7)
!843 = !DILocation(line: 722, column: 7, scope: !818)
!844 = !DILocation(line: 724, column: 8, scope: !845)
!845 = distinct !DILexicalBlock(scope: !818, file: !3, line: 724, column: 7)
!846 = !DILocation(line: 724, column: 7, scope: !818)
!847 = !DILocation(line: 727, column: 10, scope: !818)
!848 = !DILocation(line: 727, column: 29, scope: !818)
!849 = !DILocation(line: 728, column: 35, scope: !818)
!850 = !DILocation(line: 728, column: 27, scope: !818)
!851 = !DILocation(line: 728, column: 33, scope: !818)
!852 = !DILocation(line: 729, column: 10, scope: !818)
!853 = !DILocation(line: 729, column: 27, scope: !818)
!854 = !DILocation(line: 730, column: 33, scope: !818)
!855 = !DILocation(line: 730, column: 25, scope: !818)
!856 = !DILocation(line: 730, column: 31, scope: !818)
!857 = !DILocation(line: 731, column: 10, scope: !818)
!858 = !DILocation(line: 731, column: 29, scope: !818)
!859 = !DILocation(line: 732, column: 11, scope: !818)
!860 = !DILocation(line: 734, column: 27, scope: !818)
!861 = !DILocation(line: 734, column: 33, scope: !818)
!862 = !DILocation(line: 735, column: 10, scope: !818)
!863 = !DILocation(line: 735, column: 29, scope: !818)
!864 = !DILocation(line: 736, column: 11, scope: !818)
!865 = !DILocation(line: 738, column: 27, scope: !818)
!866 = !DILocation(line: 738, column: 33, scope: !818)
!867 = !DILocation(line: 739, column: 10, scope: !818)
!868 = !DILocation(line: 739, column: 27, scope: !818)
!869 = !DILocation(line: 740, column: 33, scope: !818)
!870 = !DILocation(line: 740, column: 25, scope: !818)
!871 = !DILocation(line: 740, column: 31, scope: !818)
!872 = !DILocation(line: 741, column: 1, scope: !818)
!873 = distinct !DISubprogram(name: "init_iconv_desc", scope: !3, file: !3, line: 640, type: !874, scopeLine: 641, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !876)
!874 = !DISubroutineType(types: !875)
!875 = !{!333, !265, !316, !316}
!876 = !{!877, !878, !879, !880, !881, !882}
!877 = !DILocalVariable(name: "pfile", arg: 1, scope: !873, file: !3, line: 640, type: !265)
!878 = !DILocalVariable(name: "to", arg: 2, scope: !873, file: !3, line: 640, type: !316)
!879 = !DILocalVariable(name: "from", arg: 3, scope: !873, file: !3, line: 640, type: !316)
!880 = !DILocalVariable(name: "ret", scope: !873, file: !3, line: 642, type: !333)
!881 = !DILocalVariable(name: "pair", scope: !873, file: !3, line: 643, type: !217)
!882 = !DILocalVariable(name: "i", scope: !873, file: !3, line: 644, type: !133)
!883 = !DILocation(line: 0, scope: !873)
!884 = !DILocation(line: 642, column: 25, scope: !873)
!885 = !DILocation(line: 646, column: 8, scope: !886)
!886 = distinct !DILexicalBlock(scope: !873, file: !3, line: 646, column: 7)
!887 = !DILocation(line: 646, column: 7, scope: !873)
!888 = !DILocation(line: 648, column: 11, scope: !889)
!889 = distinct !DILexicalBlock(scope: !886, file: !3, line: 647, column: 5)
!890 = !DILocation(line: 648, column: 16, scope: !889)
!891 = !DILocation(line: 649, column: 11, scope: !889)
!892 = !DILocation(line: 649, column: 14, scope: !889)
!893 = !DILocation(line: 650, column: 11, scope: !889)
!894 = !DILocation(line: 650, column: 17, scope: !889)
!895 = !DILocation(line: 651, column: 7, scope: !889)
!896 = !DILocation(line: 654, column: 19, scope: !873)
!897 = !DILocation(line: 656, column: 3, scope: !873)
!898 = !DILocation(line: 657, column: 3, scope: !873)
!899 = !DILocation(line: 658, column: 3, scope: !873)
!900 = !DILocation(line: 659, column: 8, scope: !901)
!901 = distinct !DILexicalBlock(scope: !873, file: !3, line: 659, column: 3)
!902 = !DILocation(line: 0, scope: !901)
!903 = !DILocation(line: 659, column: 17, scope: !904)
!904 = distinct !DILexicalBlock(scope: !901, file: !3, line: 659, column: 3)
!905 = !DILocation(line: 659, column: 3, scope: !901)
!906 = !DILocation(line: 660, column: 46, scope: !907)
!907 = distinct !DILexicalBlock(scope: !904, file: !3, line: 660, column: 9)
!908 = !DILocation(line: 660, column: 10, scope: !907)
!909 = !DILocation(line: 660, column: 9, scope: !904)
!910 = !DILocation(line: 662, column: 31, scope: !911)
!911 = distinct !DILexicalBlock(scope: !907, file: !3, line: 661, column: 7)
!912 = !DILocation(line: 662, column: 11, scope: !911)
!913 = !DILocation(line: 663, column: 29, scope: !911)
!914 = !DILocation(line: 663, column: 6, scope: !911)
!915 = !DILocation(line: 663, column: 9, scope: !911)
!916 = !DILocation(line: 664, column: 6, scope: !911)
!917 = !DILocation(line: 664, column: 12, scope: !911)
!918 = !DILocation(line: 665, column: 2, scope: !911)
!919 = !DILocation(line: 659, column: 49, scope: !904)
!920 = !DILocation(line: 659, column: 3, scope: !904)
!921 = distinct !{!921, !905, !922}
!922 = !DILocation(line: 666, column: 7, scope: !901)
!923 = !DILocation(line: 671, column: 11, scope: !924)
!924 = distinct !DILexicalBlock(scope: !925, file: !3, line: 670, column: 5)
!925 = distinct !DILexicalBlock(scope: !873, file: !3, line: 669, column: 7)
!926 = !DILocation(line: 671, column: 16, scope: !924)
!927 = !DILocation(line: 672, column: 16, scope: !924)
!928 = !DILocation(line: 672, column: 11, scope: !924)
!929 = !DILocation(line: 672, column: 14, scope: !924)
!930 = !DILocation(line: 673, column: 11, scope: !924)
!931 = !DILocation(line: 673, column: 17, scope: !924)
!932 = !DILocation(line: 677, column: 8, scope: !933)
!933 = distinct !DILexicalBlock(scope: !934, file: !3, line: 676, column: 2)
!934 = distinct !DILexicalBlock(scope: !924, file: !3, line: 675, column: 11)
!935 = !DILocation(line: 678, column: 6, scope: !936)
!936 = distinct !DILexicalBlock(scope: !933, file: !3, line: 677, column: 8)
!937 = !DILocation(line: 684, column: 13, scope: !933)
!938 = !DILocation(line: 685, column: 2, scope: !933)
!939 = !DILocation(line: 697, column: 1, scope: !873)
!940 = distinct !DISubprogram(name: "_cpp_destroy_iconv", scope: !3, file: !3, line: 745, type: !608, scopeLine: 746, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !941)
!941 = !{!942}
!942 = !DILocalVariable(name: "pfile", arg: 1, scope: !940, file: !3, line: 745, type: !265)
!943 = !DILocation(line: 0, scope: !940)
!944 = !DILocation(line: 760, column: 1, scope: !940)
!945 = distinct !DISubprogram(name: "convert_using_iconv", scope: !3, file: !3, line: 562, type: !946, scopeLine: 564, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !948)
!946 = !DISubroutineType(types: !947)
!947 = !{!127, !131, !227, !133, !340}
!948 = !{!949, !950, !951, !952, !953, !954, !955, !956}
!949 = !DILocalVariable(name: "cd", arg: 1, scope: !945, file: !3, line: 562, type: !131)
!950 = !DILocalVariable(name: "from", arg: 2, scope: !945, file: !3, line: 562, type: !227)
!951 = !DILocalVariable(name: "flen", arg: 3, scope: !945, file: !3, line: 562, type: !133)
!952 = !DILocalVariable(name: "to", arg: 4, scope: !945, file: !3, line: 563, type: !340)
!953 = !DILocalVariable(name: "inbuf", scope: !945, file: !3, line: 565, type: !217)
!954 = !DILocalVariable(name: "outbuf", scope: !945, file: !3, line: 566, type: !217)
!955 = !DILocalVariable(name: "inbytesleft", scope: !945, file: !3, line: 567, type: !133)
!956 = !DILocalVariable(name: "outbytesleft", scope: !945, file: !3, line: 567, type: !133)
!957 = !DILocation(line: 0, scope: !945)
!958 = !DILocation(line: 570, column: 7, scope: !959)
!959 = distinct !DILexicalBlock(scope: !945, file: !3, line: 570, column: 7)
!960 = !DILocation(line: 606, column: 1, scope: !945)
!961 = distinct !DISubprogram(name: "cpp_host_to_exec_charset", scope: !3, file: !3, line: 775, type: !962, scopeLine: 776, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !964)
!962 = !DISubroutineType(types: !963)
!963 = !{!219, !265, !219}
!964 = !{!965, !966, !967, !969}
!965 = !DILocalVariable(name: "pfile", arg: 1, scope: !961, file: !3, line: 775, type: !265)
!966 = !DILocalVariable(name: "c", arg: 2, scope: !961, file: !3, line: 775, type: !219)
!967 = !DILocalVariable(name: "sbuf", scope: !961, file: !3, line: 777, type: !968)
!968 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 8, elements: !213)
!969 = !DILocalVariable(name: "tbuf", scope: !961, file: !3, line: 778, type: !341)
!970 = !DILocation(line: 0, scope: !961)
!971 = !DILocation(line: 777, column: 3, scope: !961)
!972 = !DILocation(line: 777, column: 9, scope: !961)
!973 = !DILocation(line: 778, column: 3, scope: !961)
!974 = !DILocation(line: 783, column: 9, scope: !975)
!975 = distinct !DILexicalBlock(scope: !961, file: !3, line: 783, column: 7)
!976 = !DILocation(line: 783, column: 7, scope: !961)
!977 = !DILocation(line: 787, column: 4, scope: !978)
!978 = distinct !DILexicalBlock(scope: !975, file: !3, line: 784, column: 5)
!979 = !DILocation(line: 785, column: 7, scope: !978)
!980 = !DILocation(line: 788, column: 7, scope: !978)
!981 = !DILocation(line: 794, column: 13, scope: !961)
!982 = !DILocation(line: 794, column: 11, scope: !961)
!983 = !DILocation(line: 797, column: 8, scope: !961)
!984 = !DILocation(line: 797, column: 14, scope: !961)
!985 = !DILocation(line: 798, column: 15, scope: !961)
!986 = !DILocation(line: 798, column: 8, scope: !961)
!987 = !DILocation(line: 798, column: 13, scope: !961)
!988 = !DILocation(line: 799, column: 8, scope: !961)
!989 = !DILocation(line: 799, column: 12, scope: !961)
!990 = !DILocation(line: 801, column: 8, scope: !991)
!991 = distinct !DILexicalBlock(scope: !961, file: !3, line: 801, column: 7)
!992 = !DILocation(line: 801, column: 7, scope: !961)
!993 = !DILocation(line: 803, column: 7, scope: !994)
!994 = distinct !DILexicalBlock(scope: !991, file: !3, line: 802, column: 5)
!995 = !DILocation(line: 804, column: 7, scope: !994)
!996 = !DILocation(line: 806, column: 12, scope: !997)
!997 = distinct !DILexicalBlock(scope: !961, file: !3, line: 806, column: 7)
!998 = !DILocation(line: 806, column: 16, scope: !997)
!999 = !DILocation(line: 806, column: 7, scope: !961)
!1000 = !DILocation(line: 810, column: 4, scope: !1001)
!1001 = distinct !DILexicalBlock(scope: !997, file: !3, line: 807, column: 5)
!1002 = !DILocation(line: 808, column: 7, scope: !1001)
!1003 = !DILocation(line: 811, column: 7, scope: !1001)
!1004 = !DILocation(line: 813, column: 12, scope: !961)
!1005 = !DILocation(line: 813, column: 7, scope: !961)
!1006 = !DILocation(line: 814, column: 3, scope: !961)
!1007 = !DILocation(line: 815, column: 3, scope: !961)
!1008 = !DILocation(line: 816, column: 1, scope: !961)
!1009 = distinct !DISubprogram(name: "_cpp_valid_ucn", scope: !3, file: !3, line: 988, type: !1010, scopeLine: 991, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1018)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!219, !265, !226, !227, !128, !1012}
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "normalize_state", file: !268, line: 641, size: 96, elements: !1014)
!1014 = !{!1015, !1016, !1017}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !1013, file: !268, line: 644, baseType: !219, size: 32)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "prev_class", scope: !1013, file: !268, line: 646, baseType: !127, size: 8, offset: 32)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1013, file: !268, line: 648, baseType: !31, size: 32, offset: 64)
!1018 = !{!1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029}
!1019 = !DILocalVariable(name: "pfile", arg: 1, scope: !1009, file: !3, line: 988, type: !265)
!1020 = !DILocalVariable(name: "pstr", arg: 2, scope: !1009, file: !3, line: 988, type: !226)
!1021 = !DILocalVariable(name: "limit", arg: 3, scope: !1009, file: !3, line: 989, type: !227)
!1022 = !DILocalVariable(name: "identifier_pos", arg: 4, scope: !1009, file: !3, line: 989, type: !128)
!1023 = !DILocalVariable(name: "nst", arg: 5, scope: !1009, file: !3, line: 990, type: !1012)
!1024 = !DILocalVariable(name: "result", scope: !1009, file: !3, line: 992, type: !219)
!1025 = !DILocalVariable(name: "c", scope: !1009, file: !3, line: 992, type: !219)
!1026 = !DILocalVariable(name: "length", scope: !1009, file: !3, line: 993, type: !7)
!1027 = !DILocalVariable(name: "str", scope: !1009, file: !3, line: 994, type: !227)
!1028 = !DILocalVariable(name: "base", scope: !1009, file: !3, line: 995, type: !227)
!1029 = !DILocalVariable(name: "validity", scope: !1030, file: !3, line: 1067, type: !128)
!1030 = distinct !DILexicalBlock(scope: !1031, file: !3, line: 1066, column: 5)
!1031 = distinct !DILexicalBlock(scope: !1032, file: !3, line: 1065, column: 12)
!1032 = distinct !DILexicalBlock(scope: !1033, file: !3, line: 1055, column: 12)
!1033 = distinct !DILexicalBlock(scope: !1034, file: !3, line: 1044, column: 12)
!1034 = distinct !DILexicalBlock(scope: !1009, file: !3, line: 1033, column: 7)
!1035 = !DILocation(line: 0, scope: !1009)
!1036 = !DILocation(line: 994, column: 22, scope: !1009)
!1037 = !DILocation(line: 995, column: 27, scope: !1009)
!1038 = !DILocation(line: 997, column: 8, scope: !1039)
!1039 = distinct !DILexicalBlock(scope: !1009, file: !3, line: 997, column: 7)
!1040 = !DILocation(line: 997, column: 38, scope: !1039)
!1041 = !DILocation(line: 997, column: 42, scope: !1039)
!1042 = !DILocation(line: 997, column: 7, scope: !1009)
!1043 = !DILocation(line: 998, column: 5, scope: !1039)
!1044 = !DILocation(line: 1000, column: 12, scope: !1045)
!1045 = distinct !DILexicalBlock(scope: !1039, file: !3, line: 1000, column: 12)
!1046 = !DILocation(line: 1000, column: 55, scope: !1045)
!1047 = !DILocation(line: 1000, column: 37, scope: !1045)
!1048 = !DILocation(line: 1003, column: 15, scope: !1045)
!1049 = !DILocation(line: 1003, column: 9, scope: !1045)
!1050 = !DILocation(line: 1001, column: 5, scope: !1045)
!1051 = !DILocation(line: 1005, column: 7, scope: !1052)
!1052 = distinct !DILexicalBlock(scope: !1009, file: !3, line: 1005, column: 7)
!1053 = !DILocation(line: 1005, column: 15, scope: !1052)
!1054 = !DILocation(line: 1005, column: 7, scope: !1009)
!1055 = !DILocation(line: 1007, column: 20, scope: !1056)
!1056 = distinct !DILexicalBlock(scope: !1052, file: !3, line: 1007, column: 12)
!1057 = !DILocation(line: 1007, column: 12, scope: !1052)
!1058 = !DILocation(line: 1011, column: 7, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !1056, file: !3, line: 1010, column: 5)
!1060 = !DILocation(line: 0, scope: !1052)
!1061 = !DILocation(line: 1016, column: 3, scope: !1009)
!1062 = !DILocation(line: 1018, column: 11, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !1009, file: !3, line: 1017, column: 5)
!1064 = !DILocation(line: 1019, column: 12, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !1063, file: !3, line: 1019, column: 11)
!1066 = !DILocation(line: 1019, column: 11, scope: !1063)
!1067 = !DILocation(line: 1021, column: 10, scope: !1063)
!1068 = !DILocation(line: 1022, column: 24, scope: !1063)
!1069 = !DILocation(line: 1022, column: 32, scope: !1063)
!1070 = !DILocation(line: 1022, column: 30, scope: !1063)
!1071 = !DILocation(line: 1024, column: 10, scope: !1009)
!1072 = !DILocation(line: 1024, column: 19, scope: !1009)
!1073 = !DILocation(line: 1023, column: 5, scope: !1063)
