; ModuleID = 'cpp_line-map.bc'
source_filename = "cpp_line-map.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.line_maps = type { %struct.line_map*, i32, i32, i32, i32, i32, i8, i32, i32, i32, i8* (i8*, i64)* }
%struct.line_map = type { i8*, i32, i32, i32, i8, i8, i8 }

@stderr = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [44 x i8] c"line-map.c: file \22%s\22 entered but not left\0A\00", align 1
@.str.1 = private unnamed_addr constant [8 x i8] c"<stdin>\00", align 1
@.str.2 = private unnamed_addr constant [44 x i8] c"line-map.c: file \22%s\22 left but not entered\0A\00", align 1
@.str.3 = private unnamed_addr constant [5 x i8] c" %s\0A\00", align 1

; Function Attrs: inlinehint nounwind uwtable
define dso_local i32 @tolower(i32 %__c) local_unnamed_addr #0 !dbg !34 {
entry:
  call void @llvm.dbg.value(metadata i32 %__c, metadata !39, metadata !DIExpression()), !dbg !40
  %__c.off = add i32 %__c, 128, !dbg !41
  %0 = icmp ult i32 %__c.off, 384, !dbg !41

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !11, nameTableKind: None)
!1 = !DIFile(filename: "cpp_line-map.c", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "lc_reason", file: !4, line: 36, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10}
!7 = !DIEnumerator(name: "LC_ENTER", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "LC_LEAVE", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "LC_RENAME", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "LC_RENAME_VERBATIM", value: 3, isUnsigned: true)
!11 = !{!12, !29, !24}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line_map", file: !4, line: 61, size: 192, elements: !14)
!14 = !{!15, !19, !21, !23, !25, !26, !28}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "to_file", scope: !13, file: !4, line: 62, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!18 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "to_line", scope: !13, file: !4, line: 63, baseType: !20, size: 32, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "linenum_type", file: !4, line: 39, baseType: !5)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "start_location", scope: !13, file: !4, line: 64, baseType: !22, size: 32, offset: 96)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !4, line: 44, baseType: !5)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "included_from", scope: !13, file: !4, line: 65, baseType: !24, size: 32, offset: 128)
!24 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !13, file: !4, line: 66, baseType: !5, size: 8, offset: 160, flags: DIFlagBitField, extraData: i64 160)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !13, file: !4, line: 68, baseType: !27, size: 8, offset: 168)
!27 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "column_bits", scope: !13, file: !4, line: 70, baseType: !5, size: 8, offset: 176, flags: DIFlagBitField, extraData: i64 176)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!30 = !{i32 2, !"Dwarf Version", i32 4}
!31 = !{i32 2, !"Debug Info Version", i32 3}
!32 = !{i32 1, !"wchar_size", i32 4}
!33 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!34 = distinct !DISubprogram(name: "tolower", scope: !35, file: !35, line: 207, type: !36, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !38)
!35 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!36 = !DISubroutineType(types: !37)
!37 = !{!24, !24}
!38 = !{!39}
!39 = !DILocalVariable(name: "__c", arg: 1, scope: !34, file: !35, line: 207, type: !24)
!40 = !DILocation(line: 0, scope: !34)
!41 = !DILocation(line: 209, column: 22, scope: !34)
!42 = !DILocation(line: 209, column: 39, scope: !34)
!43 = !DILocation(line: 209, column: 38, scope: !34)
!44 = !DILocation(line: 209, column: 37, scope: !34)
!45 = !DILocation(line: 209, column: 10, scope: !34)
!46 = !DILocation(line: 209, column: 3, scope: !34)
!47 = distinct !DISubprogram(name: "toupper", scope: !35, file: !35, line: 213, type: !36, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !48)
!48 = !{!49}
!49 = !DILocalVariable(name: "__c", arg: 1, scope: !47, file: !35, line: 213, type: !24)
!50 = !DILocation(line: 0, scope: !47)
!51 = !DILocation(line: 215, column: 22, scope: !47)
!52 = !DILocation(line: 215, column: 39, scope: !47)
!53 = !DILocation(line: 215, column: 38, scope: !47)
!54 = !DILocation(line: 215, column: 37, scope: !47)
!55 = !DILocation(line: 215, column: 10, scope: !47)
!56 = !DILocation(line: 215, column: 3, scope: !47)
!57 = distinct !DISubprogram(name: "linemap_init", scope: !1, file: !1, line: 33, type: !58, scopeLine: 34, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !81)
!58 = !DISubroutineType(types: !59)
!59 = !{null, !60}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line_maps", file: !4, line: 74, size: 448, elements: !62)
!62 = !{!63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "maps", scope: !61, file: !4, line: 75, baseType: !12, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !61, file: !4, line: 76, baseType: !5, size: 32, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !61, file: !4, line: 77, baseType: !5, size: 32, offset: 96)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !61, file: !4, line: 79, baseType: !5, size: 32, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "last_listed", scope: !61, file: !4, line: 84, baseType: !24, size: 32, offset: 160)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !61, file: !4, line: 87, baseType: !5, size: 32, offset: 192)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "trace_includes", scope: !61, file: !4, line: 90, baseType: !27, size: 8, offset: 224)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "highest_location", scope: !61, file: !4, line: 93, baseType: !22, size: 32, offset: 256)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "highest_line", scope: !61, file: !4, line: 96, baseType: !22, size: 32, offset: 288)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "max_column_hint", scope: !61, file: !4, line: 100, baseType: !5, size: 32, offset: 320)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "reallocator", scope: !61, file: !4, line: 104, baseType: !74, size: 64, offset: 384)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "line_map_realloc", file: !4, line: 47, baseType: !75)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!29, !29, !78}
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !79, line: 46, baseType: !80)
!79 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!80 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!81 = !{!82}
!82 = !DILocalVariable(name: "set", arg: 1, scope: !57, file: !1, line: 33, type: !60)
!83 = !DILocation(line: 0, scope: !57)
!84 = !DILocation(line: 35, column: 8, scope: !57)
!85 = !DILocation(line: 35, column: 13, scope: !57)
!86 = !DILocation(line: 36, column: 8, scope: !57)
!87 = !DILocation(line: 36, column: 18, scope: !57)
!88 = !DILocation(line: 37, column: 8, scope: !57)
!89 = !DILocation(line: 37, column: 13, scope: !57)
!90 = !DILocation(line: 38, column: 8, scope: !57)
!91 = !DILocation(line: 38, column: 20, scope: !57)
!92 = !DILocation(line: 39, column: 8, scope: !57)
!93 = !DILocation(line: 39, column: 23, scope: !57)
!94 = !DILocation(line: 40, column: 8, scope: !57)
!95 = !DILocation(line: 40, column: 14, scope: !57)
!96 = !DILocation(line: 41, column: 8, scope: !57)
!97 = !DILocation(line: 41, column: 14, scope: !57)
!98 = !DILocation(line: 42, column: 8, scope: !57)
!99 = !DILocation(line: 42, column: 25, scope: !57)
!100 = !DILocation(line: 43, column: 8, scope: !57)
!101 = !DILocation(line: 43, column: 21, scope: !57)
!102 = !DILocation(line: 44, column: 8, scope: !57)
!103 = !DILocation(line: 44, column: 24, scope: !57)
!104 = !DILocation(line: 45, column: 8, scope: !57)
!105 = !DILocation(line: 45, column: 20, scope: !57)
!106 = !DILocation(line: 46, column: 1, scope: !57)
!107 = distinct !DISubprogram(name: "linemap_check_files_exited", scope: !1, file: !1, line: 51, type: !58, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !108)
!108 = !{!109, !110}
!109 = !DILocalVariable(name: "set", arg: 1, scope: !107, file: !1, line: 51, type: !60)
!110 = !DILocalVariable(name: "map", scope: !107, file: !1, line: 53, type: !12)
!111 = !DILocation(line: 0, scope: !107)
!112 = !DILocation(line: 56, column: 20, scope: !113)
!113 = distinct !DILexicalBlock(scope: !107, file: !1, line: 56, column: 3)
!114 = !DILocation(line: 56, column: 30, scope: !113)
!115 = !DILocation(line: 56, column: 35, scope: !113)
!116 = !DILocation(line: 56, column: 15, scope: !113)
!117 = !DILocation(line: 56, column: 8, scope: !113)
!118 = !DILocation(line: 0, scope: !113)
!119 = !DILocation(line: 56, column: 43, scope: !120)
!120 = distinct !DILexicalBlock(scope: !113, file: !1, line: 56, column: 3)
!121 = !DILocation(line: 56, column: 3, scope: !113)
!122 = !DILocation(line: 58, column: 14, scope: !120)
!123 = !DILocation(line: 59, column: 12, scope: !120)
!124 = !DILocation(line: 58, column: 5, scope: !120)
!125 = !DILocation(line: 57, column: 14, scope: !120)
!126 = !DILocation(line: 56, column: 3, scope: !120)
!127 = distinct !{!127, !121, !128}
!128 = !DILocation(line: 59, column: 19, scope: !113)
!129 = !DILocation(line: 60, column: 1, scope: !107)
!130 = distinct !DISubprogram(name: "linemap_free", scope: !1, file: !1, line: 65, type: !58, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !131)
!131 = !{!132}
!132 = !DILocalVariable(name: "set", arg: 1, scope: !130, file: !1, line: 65, type: !60)
!133 = !DILocation(line: 0, scope: !130)
!134 = !DILocation(line: 67, column: 12, scope: !135)
!135 = distinct !DILexicalBlock(scope: !130, file: !1, line: 67, column: 7)
!136 = !DILocation(line: 67, column: 7, scope: !135)
!137 = !DILocation(line: 67, column: 7, scope: !130)
