; ModuleID = 'cse.bc'
source_filename = "cse.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.rtx_def = type { i32, %union.u }
%union.u = type { %struct.block_symbol }
%struct.block_symbol = type { [3 x %union.rtunion_def], %struct.object_block*, i64 }
%union.rtunion_def = type { i8* }
%struct.object_block = type { %union.section*, i32, i64, %struct.VEC_rtx_gc*, %struct.VEC_rtx_gc* }
%union.section = type { %struct.unnamed_section }
%struct.unnamed_section = type { %struct.section_common, void (i8*)*, i8*, %union.section* }
%struct.section_common = type { i32 }
%struct.VEC_rtx_gc = type { %struct.VEC_rtx_base }
%struct.VEC_rtx_base = type { i32, i32, [1 x %struct.rtx_def*] }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }

!707 = !DIEnumerator(name: "TV_IRA", value: 148, isUnsigned: true)
!708 = !DIEnumerator(name: "TV_RELOAD", value: 149, isUnsigned: true)
!709 = !DIEnumerator(name: "TV_RELOAD_CSE_REGS", value: 150, isUnsigned: true)
!710 = !DIEnumerator(name: "TV_SEQABSTR", value: 151, isUnsigned: true)
!711 = !DIEnumerator(name: "TV_GCSE_AFTER_RELOAD", value: 152, isUnsigned: true)
!712 = !DIEnumerator(name: "TV_THREAD_PROLOGUE_AND_EPILOGUE", value: 153, isUnsigned: true)
!713 = !DIEnumerator(name: "TV_IFCVT2", value: 154, isUnsigned: true)
!714 = !DIEnumerator(name: "TV_COMBINE_STACK_ADJUST", value: 155, isUnsigned: true)
!715 = !DIEnumerator(name: "TV_PEEPHOLE2", value: 156, isUnsigned: true)
!716 = !DIEnumerator(name: "TV_RENAME_REGISTERS", value: 157, isUnsigned: true)
!717 = !DIEnumerator(name: "TV_CPROP_REGISTERS", value: 158, isUnsigned: true)
!718 = !DIEnumerator(name: "TV_SCHED2", value: 159, isUnsigned: true)
!719 = !DIEnumerator(name: "TV_MACH_DEP", value: 160, isUnsigned: true)
!720 = !DIEnumerator(name: "TV_DBR_SCHED", value: 161, isUnsigned: true)
!721 = !DIEnumerator(name: "TV_REORDER_BLOCKS", value: 162, isUnsigned: true)
!722 = !DIEnumerator(name: "TV_SHORTEN_BRANCH", value: 163, isUnsigned: true)
!723 = !DIEnumerator(name: "TV_REG_STACK", value: 164, isUnsigned: true)
!724 = !DIEnumerator(name: "TV_FINAL", value: 165, isUnsigned: true)
!725 = !DIEnumerator(name: "TV_SYMOUT", value: 166, isUnsigned: true)
!726 = !DIEnumerator(name: "TV_VAR_TRACKING", value: 167, isUnsigned: true)
!727 = !DIEnumerator(name: "TV_TREE_IFCOMBINE", value: 168, isUnsigned: true)
!728 = !DIEnumerator(name: "TV_PLUGIN_INIT", value: 169, isUnsigned: true)
!729 = !DIEnumerator(name: "TV_PLUGIN_RUN", value: 170, isUnsigned: true)
!730 = !DIEnumerator(name: "TV_REST_OF_COMPILATION", value: 171, isUnsigned: true)
!731 = !DIEnumerator(name: "TIMEVAR_LAST", value: 172, isUnsigned: true)
!732 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "reg_note", file: !385, line: 836, baseType: !7, size: 32, elements: !733)
!733 = !{!734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765}
!734 = !DIEnumerator(name: "REG_DEP_TRUE", value: 0, isUnsigned: true)
!735 = !DIEnumerator(name: "REG_DEAD", value: 1, isUnsigned: true)
!736 = !DIEnumerator(name: "REG_INC", value: 2, isUnsigned: true)
!737 = !DIEnumerator(name: "REG_EQUIV", value: 3, isUnsigned: true)
!738 = !DIEnumerator(name: "REG_EQUAL", value: 4, isUnsigned: true)
!739 = !DIEnumerator(name: "REG_NONNEG", value: 5, isUnsigned: true)
!740 = !DIEnumerator(name: "REG_UNUSED", value: 6, isUnsigned: true)
!741 = !DIEnumerator(name: "REG_CC_SETTER", value: 7, isUnsigned: true)
!742 = !DIEnumerator(name: "REG_CC_USER", value: 8, isUnsigned: true)
!743 = !DIEnumerator(name: "REG_LABEL_TARGET", value: 9, isUnsigned: true)
!744 = !DIEnumerator(name: "REG_LABEL_OPERAND", value: 10, isUnsigned: true)
!745 = !DIEnumerator(name: "REG_DEP_OUTPUT", value: 11, isUnsigned: true)
!746 = !DIEnumerator(name: "REG_DEP_ANTI", value: 12, isUnsigned: true)
!747 = !DIEnumerator(name: "REG_BR_PROB", value: 13, isUnsigned: true)
!748 = !DIEnumerator(name: "REG_VALUE_PROFILE", value: 14, isUnsigned: true)
!749 = !DIEnumerator(name: "REG_NOALIAS", value: 15, isUnsigned: true)
!750 = !DIEnumerator(name: "REG_BR_PRED", value: 16, isUnsigned: true)
!751 = !DIEnumerator(name: "REG_FRAME_RELATED_EXPR", value: 17, isUnsigned: true)
!752 = !DIEnumerator(name: "REG_CFA_DEF_CFA", value: 18, isUnsigned: true)
!753 = !DIEnumerator(name: "REG_CFA_ADJUST_CFA", value: 19, isUnsigned: true)
!754 = !DIEnumerator(name: "REG_CFA_OFFSET", value: 20, isUnsigned: true)
!755 = !DIEnumerator(name: "REG_CFA_REGISTER", value: 21, isUnsigned: true)
!756 = !DIEnumerator(name: "REG_CFA_RESTORE", value: 22, isUnsigned: true)
!757 = !DIEnumerator(name: "REG_CFA_SET_VDRAP", value: 23, isUnsigned: true)
!758 = !DIEnumerator(name: "REG_EH_CONTEXT", value: 24, isUnsigned: true)
!759 = !DIEnumerator(name: "REG_EH_REGION", value: 25, isUnsigned: true)
!760 = !DIEnumerator(name: "REG_SAVE_NOTE", value: 26, isUnsigned: true)
!761 = !DIEnumerator(name: "REG_NORETURN", value: 27, isUnsigned: true)
!762 = !DIEnumerator(name: "REG_NON_LOCAL_GOTO", value: 28, isUnsigned: true)
!763 = !DIEnumerator(name: "REG_CROSSING_JUMP", value: 29, isUnsigned: true)
!764 = !DIEnumerator(name: "REG_SETJMP", value: 30, isUnsigned: true)
!765 = !DIEnumerator(name: "REG_NOTE_MAX", value: 31, isUnsigned: true)
!766 = !{!767, !768, !769, !770, !773, !774, !384, !527, !5, !7, !776, !792, !806, !808, !809, !1953, !845, !1958, !789, !1966, !1977, !1979, !2046, !732, !2052, !2085, !804, !2058, !2032, !2086}
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!769 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !772)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !778)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !779, line: 52, size: 256, elements: !780)
!779 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!780 = !{!781, !782, !783, !784, !785, !786, !787}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !778, file: !779, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !778, file: !779, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !778, file: !779, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !778, file: !779, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !778, file: !779, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !778, file: !779, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !778, file: !779, line: 62, baseType: !788, size: 192, offset: 64)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !789, size: 192, elements: !790)
!789 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!790 = !{!791}
!791 = !DISubrange(count: 3)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !794)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !795, line: 27, size: 192, elements: !796)
!795 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!796 = !{!797, !805}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !794, file: !795, line: 29, baseType: !798, size: 128)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !799, line: 58, baseType: !800)
!799 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !799, line: 54, size: 128, elements: !801)
!801 = !{!802, !803}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !800, file: !799, line: 56, baseType: !789, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !800, file: !799, line: 57, baseType: !804, size: 64, offset: 64)
!804 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !794, file: !795, line: 30, baseType: !5, size: 32, offset: 128)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !768)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "branch_path", file: !3, line: 527, size: 64, elements: !811)
!811 = !{!812}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !810, file: !3, line: 530, baseType: !813, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !814, line: 111, baseType: !815)
!814 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !142, line: 217, size: 832, elements: !817)
!817 = !{!818, !1918, !1919, !1920, !1923, !1927, !1928, !1929, !1947, !1948, !1949, !1950, !1951, !1952}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !816, file: !142, line: 219, baseType: !819, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !142, line: 151, baseType: !821)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !142, line: 151, size: 128, elements: !822)
!822 = !{!823}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !821, file: !142, line: 151, baseType: !824, size: 128)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !142, line: 150, baseType: !825)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !142, line: 150, size: 128, elements: !826)
!826 = !{!827, !828, !829}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !825, file: !142, line: 150, baseType: !7, size: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !825, file: !142, line: 150, baseType: !7, size: 32, offset: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !825, file: !142, line: 150, baseType: !830, size: 64, offset: 64)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !831, size: 64, elements: !879)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !814, line: 108, baseType: !832)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !142, line: 122, size: 512, elements: !834)
!834 = !{!835, !836, !837, !1910, !1911, !1912, !1913, !1914, !1915, !1916}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !833, file: !142, line: 124, baseType: !815, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !833, file: !142, line: 125, baseType: !815, size: 64, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !833, file: !142, line: 131, baseType: !838, size: 64, offset: 128)
!838 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !142, line: 128, size: 64, elements: !839)
!839 = !{!840, !844}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !838, file: !142, line: 129, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !814, line: 66, baseType: !842)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !814, line: 65, flags: DIFlagFwdDecl)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !838, file: !142, line: 130, baseType: !845, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !814, line: 50, baseType: !846)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !385, line: 240, size: 384, elements: !848)
!848 = !{!849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !847, file: !385, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !847, file: !385, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !847, file: !385, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !847, file: !385, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !847, file: !385, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !847, file: !385, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !847, file: !385, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !847, file: !385, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !847, file: !385, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !847, file: !385, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !847, file: !385, line: 321, baseType: !860, size: 320, offset: 64)
!860 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !385, line: 315, size: 320, elements: !861)
!861 = !{!862, !1845, !1847, !1908, !1909}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !860, file: !385, line: 316, baseType: !863, size: 64)
!863 = !DICompositeType(tag: DW_TAG_array_type, baseType: !864, size: 64, elements: !879)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !385, line: 183, baseType: !865)
!865 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !385, line: 166, size: 64, elements: !866)
!866 = !{!867, !868, !869, !870, !871, !881, !882, !894, !897, !957, !1823, !1824, !1835, !1842}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !865, file: !385, line: 168, baseType: !769, size: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !865, file: !385, line: 169, baseType: !7, size: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !865, file: !385, line: 170, baseType: !774, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !865, file: !385, line: 171, baseType: !845, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !865, file: !385, line: 172, baseType: !872, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !814, line: 53, baseType: !873)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !385, line: 359, size: 128, elements: !875)
!875 = !{!876, !877}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !874, file: !385, line: 360, baseType: !769, size: 32)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !874, file: !385, line: 361, baseType: !878, size: 64, offset: 64)
!878 = !DICompositeType(tag: DW_TAG_array_type, baseType: !845, size: 64, elements: !879)
!879 = !{!880}
!880 = !DISubrange(count: 1)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !865, file: !385, line: 173, baseType: !5, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !865, file: !385, line: 174, baseType: !883, size: 32)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !385, line: 133, baseType: !884)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !385, line: 115, size: 32, elements: !885)
!885 = !{!886, !887, !888, !889, !890, !891, !892, !893}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !884, file: !385, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !884, file: !385, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !884, file: !385, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !884, file: !385, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !884, file: !385, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !884, file: !385, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !884, file: !385, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !884, file: !385, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !865, file: !385, line: 175, baseType: !895, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !385, line: 175, flags: DIFlagFwdDecl)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !865, file: !385, line: 176, baseType: !898, size: 64)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !900, line: 75, size: 256, elements: !901)
!900 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!901 = !{!902, !916, !917, !918}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !899, file: !900, line: 76, baseType: !903, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !900, line: 68, baseType: !905)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !900, line: 63, size: 320, elements: !906)
!906 = !{!907, !909, !910, !911}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !905, file: !900, line: 64, baseType: !908, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !905, file: !900, line: 65, baseType: !908, size: 64, offset: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !905, file: !900, line: 66, baseType: !7, size: 32, offset: 128)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !905, file: !900, line: 67, baseType: !912, size: 128, offset: 192)
!912 = !DICompositeType(tag: DW_TAG_array_type, baseType: !913, size: 128, elements: !914)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !900, line: 29, baseType: !789)
!914 = !{!915}
!915 = !DISubrange(count: 2)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !899, file: !900, line: 77, baseType: !903, size: 64, offset: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !899, file: !900, line: 78, baseType: !7, size: 32, offset: 128)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !899, file: !900, line: 79, baseType: !919, size: 64, offset: 192)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !900, line: 49, baseType: !921)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !900, line: 45, size: 832, elements: !922)
!922 = !{!923, !924, !925}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !921, file: !900, line: 46, baseType: !908, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !921, file: !900, line: 47, baseType: !898, size: 64, offset: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !921, file: !900, line: 48, baseType: !926, size: 704, offset: 128)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !927, line: 164, size: 704, elements: !928)
!927 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!928 = !{!929, !930, !940, !941, !942, !943, !944, !945, !949, !953, !954, !955, !956}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !926, file: !927, line: 166, baseType: !804, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !926, file: !927, line: 167, baseType: !931, size: 64, offset: 64)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !927, line: 157, size: 192, elements: !933)
!933 = !{!934, !935, !936}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !932, file: !927, line: 159, baseType: !771, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !932, file: !927, line: 160, baseType: !931, size: 64, offset: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !932, file: !927, line: 161, baseType: !937, size: 32, offset: 128)
!937 = !DICompositeType(tag: DW_TAG_array_type, baseType: !772, size: 32, elements: !938)
!938 = !{!939}
!939 = !DISubrange(count: 4)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !926, file: !927, line: 168, baseType: !771, size: 64, offset: 128)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !926, file: !927, line: 169, baseType: !771, size: 64, offset: 192)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !926, file: !927, line: 170, baseType: !771, size: 64, offset: 256)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !926, file: !927, line: 171, baseType: !804, size: 64, offset: 320)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !926, file: !927, line: 172, baseType: !769, size: 32, offset: 384)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !926, file: !927, line: 176, baseType: !946, size: 64, offset: 448)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DISubroutineType(types: !948)
!948 = !{!931, !773, !804}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !926, file: !927, line: 177, baseType: !950, size: 64, offset: 512)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DISubroutineType(types: !952)
!952 = !{null, !773, !931}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !926, file: !927, line: 178, baseType: !773, size: 64, offset: 576)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !926, file: !927, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !926, file: !927, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !926, file: !927, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !865, file: !385, line: 177, baseType: !958, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !814, line: 56, baseType: !959)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !158, line: 3371, size: 1792, elements: !961)
!961 = !{!962, !995, !1001, !1006, !1012, !1018, !1023, !1030, !1036, !1047, !1059, !1097, !1102, !1130, !1138, !1139, !1144, !1153, !1159, !1164, !1168, !1172, !1459, !1508, !1514, !1520, !1527, !1553, !1567, !1584, !1596, !1618, !1633, !1805}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !960, file: !158, line: 3372, baseType: !963, size: 64)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !158, line: 360, size: 64, elements: !964)
!964 = !{!965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !963, file: !158, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !963, file: !158, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !963, file: !158, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !963, file: !158, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !963, file: !158, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !963, file: !158, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !963, file: !158, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !963, file: !158, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !963, file: !158, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !963, file: !158, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !963, file: !158, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !963, file: !158, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !963, file: !158, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !963, file: !158, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !963, file: !158, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !963, file: !158, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !963, file: !158, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !963, file: !158, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !963, file: !158, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !963, file: !158, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !963, file: !158, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !963, file: !158, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !963, file: !158, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !963, file: !158, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !963, file: !158, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !963, file: !158, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !963, file: !158, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !963, file: !158, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !963, file: !158, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !963, file: !158, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !960, file: !158, line: 3373, baseType: !996, size: 192)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !158, line: 402, size: 192, elements: !997)
!997 = !{!998, !999, !1000}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !996, file: !158, line: 403, baseType: !963, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !996, file: !158, line: 404, baseType: !958, size: 64, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !996, file: !158, line: 405, baseType: !958, size: 64, offset: 128)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !960, file: !158, line: 3374, baseType: !1002, size: 320)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !158, line: 1384, size: 320, elements: !1003)
!1003 = !{!1004, !1005}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1002, file: !158, line: 1385, baseType: !996, size: 192)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1002, file: !158, line: 1386, baseType: !798, size: 128, offset: 192)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !960, file: !158, line: 3375, baseType: !1007, size: 256)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !158, line: 1397, size: 256, elements: !1008)
!1008 = !{!1009, !1010}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1007, file: !158, line: 1398, baseType: !996, size: 192)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !1007, file: !158, line: 1399, baseType: !1011, size: 64, offset: 192)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !960, file: !158, line: 3376, baseType: !1013, size: 256)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !158, line: 1408, size: 256, elements: !1014)
!1014 = !{!1015, !1016}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1013, file: !158, line: 1409, baseType: !996, size: 192)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !1013, file: !158, line: 1410, baseType: !1017, size: 64, offset: 192)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !960, file: !158, line: 3377, baseType: !1019, size: 256)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !158, line: 1437, size: 256, elements: !1020)
!1020 = !{!1021, !1022}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1019, file: !158, line: 1438, baseType: !996, size: 192)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1019, file: !158, line: 1439, baseType: !958, size: 64, offset: 192)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !960, file: !158, line: 3378, baseType: !1024, size: 256)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !158, line: 1418, size: 256, elements: !1025)
!1025 = !{!1026, !1027, !1028}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1024, file: !158, line: 1419, baseType: !996, size: 192)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1024, file: !158, line: 1420, baseType: !769, size: 32, offset: 192)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1024, file: !158, line: 1421, baseType: !1029, size: 8, offset: 224)
!1029 = !DICompositeType(tag: DW_TAG_array_type, baseType: !772, size: 8, elements: !879)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !960, file: !158, line: 3379, baseType: !1031, size: 320)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !158, line: 1428, size: 320, elements: !1032)
!1032 = !{!1033, !1034, !1035}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1031, file: !158, line: 1429, baseType: !996, size: 192)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !1031, file: !158, line: 1430, baseType: !958, size: 64, offset: 192)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !1031, file: !158, line: 1431, baseType: !958, size: 64, offset: 256)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !960, file: !158, line: 3380, baseType: !1037, size: 320)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !158, line: 1460, size: 320, elements: !1038)
!1038 = !{!1039, !1040}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1037, file: !158, line: 1461, baseType: !996, size: 192)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1037, file: !158, line: 1462, baseType: !1041, size: 128, offset: 192)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1042, line: 31, size: 128, elements: !1043)
!1042 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1043 = !{!1044, !1045, !1046}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1041, file: !1042, line: 32, baseType: !806, size: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1041, file: !1042, line: 33, baseType: !7, size: 32, offset: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1041, file: !1042, line: 34, baseType: !7, size: 32, offset: 96)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !960, file: !158, line: 3381, baseType: !1048, size: 384)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !158, line: 2507, size: 384, elements: !1049)
!1049 = !{!1050, !1051, !1056, !1057, !1058}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1048, file: !158, line: 2508, baseType: !996, size: 192)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1048, file: !158, line: 2509, baseType: !1052, size: 32, offset: 192)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1053, line: 58, baseType: !1054)
!1053 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1055, line: 44, baseType: !7)
!1055 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1048, file: !158, line: 2510, baseType: !7, size: 32, offset: 224)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1048, file: !158, line: 2511, baseType: !958, size: 64, offset: 256)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1048, file: !158, line: 2512, baseType: !958, size: 64, offset: 320)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !960, file: !158, line: 3382, baseType: !1060, size: 896)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !158, line: 2652, size: 896, elements: !1061)
!1061 = !{!1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1060, file: !158, line: 2653, baseType: !1048, size: 384)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1060, file: !158, line: 2654, baseType: !958, size: 64, offset: 384)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1060, file: !158, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1060, file: !158, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1060, file: !158, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1060, file: !158, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1060, file: !158, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1060, file: !158, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1060, file: !158, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1060, file: !158, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1060, file: !158, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1060, file: !158, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1060, file: !158, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1060, file: !158, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1060, file: !158, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1060, file: !158, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1060, file: !158, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1060, file: !158, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1060, file: !158, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1060, file: !158, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1060, file: !158, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1060, file: !158, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1060, file: !158, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1060, file: !158, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1060, file: !158, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1060, file: !158, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1060, file: !158, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1060, file: !158, line: 2703, baseType: !7, size: 32, offset: 512)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1060, file: !158, line: 2705, baseType: !958, size: 64, offset: 576)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1060, file: !158, line: 2706, baseType: !958, size: 64, offset: 640)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1060, file: !158, line: 2707, baseType: !958, size: 64, offset: 704)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1060, file: !158, line: 2708, baseType: !958, size: 64, offset: 768)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1060, file: !158, line: 2711, baseType: !1095, size: 64, offset: 832)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1096 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !158, line: 2711, flags: DIFlagFwdDecl)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !960, file: !158, line: 3383, baseType: !1098, size: 960)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !158, line: 2756, size: 960, elements: !1099)
!1099 = !{!1100, !1101}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1098, file: !158, line: 2757, baseType: !1060, size: 896)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1098, file: !158, line: 2758, baseType: !845, size: 64, offset: 896)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !960, file: !158, line: 3384, baseType: !1103, size: 1472)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !158, line: 3114, size: 1472, elements: !1104)
!1104 = !{!1105, !1126, !1127, !1128, !1129}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1103, file: !158, line: 3115, baseType: !1106, size: 1216)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !158, line: 2984, size: 1216, elements: !1107)
!1107 = !{!1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1106, file: !158, line: 2985, baseType: !1098, size: 960)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1106, file: !158, line: 2986, baseType: !958, size: 64, offset: 960)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1106, file: !158, line: 2987, baseType: !958, size: 64, offset: 1024)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1106, file: !158, line: 2988, baseType: !958, size: 64, offset: 1088)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1106, file: !158, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1106, file: !158, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1106, file: !158, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1106, file: !158, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1106, file: !158, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1106, file: !158, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1106, file: !158, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1106, file: !158, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1106, file: !158, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1106, file: !158, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1106, file: !158, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1106, file: !158, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1106, file: !158, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1106, file: !158, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1103, file: !158, line: 3117, baseType: !958, size: 64, offset: 1216)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1103, file: !158, line: 3119, baseType: !958, size: 64, offset: 1280)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1103, file: !158, line: 3121, baseType: !958, size: 64, offset: 1344)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1103, file: !158, line: 3123, baseType: !958, size: 64, offset: 1408)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !960, file: !158, line: 3385, baseType: !1131, size: 1088)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !158, line: 2874, size: 1088, elements: !1132)
!1132 = !{!1133, !1134, !1135}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1131, file: !158, line: 2875, baseType: !1098, size: 960)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1131, file: !158, line: 2876, baseType: !845, size: 64, offset: 960)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1131, file: !158, line: 2877, baseType: !1136, size: 64, offset: 1024)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1137 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !158, line: 2856, flags: DIFlagFwdDecl)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !960, file: !158, line: 3386, baseType: !1106, size: 1216)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !960, file: !158, line: 3387, baseType: !1140, size: 1280)
!1140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !158, line: 3093, size: 1280, elements: !1141)
!1141 = !{!1142, !1143}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1140, file: !158, line: 3094, baseType: !1106, size: 1216)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1140, file: !158, line: 3095, baseType: !1136, size: 64, offset: 1216)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !960, file: !158, line: 3388, baseType: !1145, size: 1216)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !158, line: 2824, size: 1216, elements: !1146)
!1146 = !{!1147, !1148, !1149, !1150, !1151, !1152}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1145, file: !158, line: 2825, baseType: !1060, size: 896)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1145, file: !158, line: 2827, baseType: !958, size: 64, offset: 896)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1145, file: !158, line: 2828, baseType: !958, size: 64, offset: 960)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1145, file: !158, line: 2829, baseType: !958, size: 64, offset: 1024)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1145, file: !158, line: 2830, baseType: !958, size: 64, offset: 1088)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1145, file: !158, line: 2831, baseType: !958, size: 64, offset: 1152)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !960, file: !158, line: 3389, baseType: !1154, size: 1024)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !158, line: 2850, size: 1024, elements: !1155)
!1155 = !{!1156, !1157, !1158}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1154, file: !158, line: 2851, baseType: !1098, size: 960)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1154, file: !158, line: 2852, baseType: !769, size: 32, offset: 960)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1154, file: !158, line: 2853, baseType: !769, size: 32, offset: 992)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !960, file: !158, line: 3390, baseType: !1160, size: 1024)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !158, line: 2857, size: 1024, elements: !1161)
!1161 = !{!1162, !1163}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1160, file: !158, line: 2858, baseType: !1098, size: 960)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1160, file: !158, line: 2859, baseType: !1136, size: 64, offset: 960)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !960, file: !158, line: 3391, baseType: !1165, size: 960)
!1165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !158, line: 2862, size: 960, elements: !1166)
!1166 = !{!1167}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1165, file: !158, line: 2863, baseType: !1098, size: 960)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !960, file: !158, line: 3392, baseType: !1169, size: 1472)
!1169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !158, line: 3304, size: 1472, elements: !1170)
!1170 = !{!1171}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1169, file: !158, line: 3305, baseType: !1103, size: 1472)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !960, file: !158, line: 3393, baseType: !1173, size: 1792)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !158, line: 3248, size: 1792, elements: !1174)
!1174 = !{!1175, !1176, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1173, file: !158, line: 3249, baseType: !1103, size: 1472)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1173, file: !158, line: 3251, baseType: !1177, size: 64, offset: 1472)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64)
!1178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1179, line: 463, size: 1152, elements: !1180)
!1179 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1180 = !{!1181, !1345, !1375, !1376, !1379, !1382, !1383, !1384, !1385, !1386, !1387, !1411, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1178, file: !1179, line: 464, baseType: !1182, size: 64)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64)
!1183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !135, line: 194, size: 384, elements: !1184)
!1184 = !{!1185, !1234, !1247, !1261, !1313, !1326}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !1183, file: !135, line: 197, baseType: !1186, size: 64)
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !135, line: 182, baseType: !1187)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64)
!1188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !135, line: 116, size: 704, elements: !1189)
!1189 = !{!1190, !1191, !1192, !1193, !1194, !1195, !1222, !1231, !1232, !1233}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !1188, file: !135, line: 119, baseType: !1187, size: 64)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1188, file: !135, line: 122, baseType: !1187, size: 64, offset: 64)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !1188, file: !135, line: 123, baseType: !1187, size: 64, offset: 128)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1188, file: !135, line: 126, baseType: !769, size: 32, offset: 192)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1188, file: !135, line: 129, baseType: !134, size: 32, offset: 224)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1188, file: !135, line: 165, baseType: !1196, size: 192, offset: 256)
!1196 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !135, line: 132, size: 192, elements: !1197)
!1197 = !{!1198, !1211, !1217}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !1196, file: !135, line: 137, baseType: !1199, size: 128)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !135, line: 133, size: 128, elements: !1200)
!1200 = !{!1201, !1210}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !1199, file: !135, line: 135, baseType: !1202, size: 64)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64)
!1203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !135, line: 93, size: 320, elements: !1204)
!1204 = !{!1205, !1206, !1207, !1208, !1209}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !1203, file: !135, line: 96, baseType: !1202, size: 64)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !1203, file: !135, line: 97, baseType: !1202, size: 64, offset: 64)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1203, file: !135, line: 101, baseType: !958, size: 64, offset: 128)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !1203, file: !135, line: 106, baseType: !958, size: 64, offset: 192)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1203, file: !135, line: 111, baseType: !958, size: 64, offset: 256)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !1199, file: !135, line: 136, baseType: !1202, size: 64, offset: 64)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !1196, file: !135, line: 151, baseType: !1212, size: 192)
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !135, line: 139, size: 192, elements: !1213)
!1213 = !{!1214, !1215, !1216}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1212, file: !135, line: 141, baseType: !958, size: 64)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1212, file: !135, line: 145, baseType: !958, size: 64, offset: 64)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1212, file: !135, line: 150, baseType: !769, size: 32, offset: 128)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !1196, file: !135, line: 164, baseType: !1218, size: 128)
!1218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !135, line: 153, size: 128, elements: !1219)
!1219 = !{!1220, !1221}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !1218, file: !135, line: 161, baseType: !958, size: 64)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !1218, file: !135, line: 163, baseType: !1052, size: 32, offset: 64)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !1188, file: !135, line: 168, baseType: !1223, size: 64, offset: 448)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64)
!1224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !135, line: 67, size: 320, elements: !1225)
!1225 = !{!1226, !1227, !1228, !1229, !1230}
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !1224, file: !135, line: 70, baseType: !1223, size: 64)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1224, file: !135, line: 73, baseType: !1187, size: 64, offset: 64)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !1224, file: !135, line: 78, baseType: !958, size: 64, offset: 128)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !1224, file: !135, line: 85, baseType: !845, size: 64, offset: 192)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1224, file: !135, line: 88, baseType: !769, size: 32, offset: 256)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !1188, file: !135, line: 173, baseType: !845, size: 64, offset: 512)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !1188, file: !135, line: 173, baseType: !845, size: 64, offset: 576)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !1188, file: !135, line: 177, baseType: !768, size: 8, offset: 640)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !1183, file: !135, line: 200, baseType: !1235, size: 64, offset: 64)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64)
!1236 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !135, line: 185, baseType: !1237)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !135, line: 185, size: 128, elements: !1238)
!1238 = !{!1239}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1237, file: !135, line: 185, baseType: !1240, size: 128)
!1240 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !135, line: 184, baseType: !1241)
!1241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !135, line: 184, size: 128, elements: !1242)
!1242 = !{!1243, !1244, !1245}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1241, file: !135, line: 184, baseType: !7, size: 32)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1241, file: !135, line: 184, baseType: !7, size: 32, offset: 32)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1241, file: !135, line: 184, baseType: !1246, size: 64, offset: 64)
!1246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1186, size: 64, elements: !879)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !1183, file: !135, line: 203, baseType: !1248, size: 64, offset: 128)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64)
!1249 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, baseType: !1250)
!1250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, size: 128, elements: !1251)
!1251 = !{!1252}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1250, file: !135, line: 189, baseType: !1253, size: 128)
!1253 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !135, line: 188, baseType: !1254)
!1254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !135, line: 188, size: 128, elements: !1255)
!1255 = !{!1256, !1257, !1258}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1254, file: !135, line: 188, baseType: !7, size: 32)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1254, file: !135, line: 188, baseType: !7, size: 32, offset: 32)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1254, file: !135, line: 188, baseType: !1259, size: 64, offset: 64)
!1259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1260, size: 64, elements: !879)
!1260 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !135, line: 180, baseType: !1223)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !1183, file: !135, line: 207, baseType: !1262, size: 64, offset: 192)
!1262 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1263, line: 144, baseType: !1264)
!1263 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64)
!1265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1263, line: 100, size: 896, elements: !1266)
!1266 = !{!1267, !1275, !1280, !1285, !1287, !1290, !1291, !1292, !1293, !1294, !1299, !1301, !1302, !1307, !1312}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1265, file: !1263, line: 102, baseType: !1268, size: 64)
!1268 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1263, line: 52, baseType: !1269)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64)
!1270 = !DISubroutineType(types: !1271)
!1271 = !{!1272, !1273}
!1272 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1263, line: 47, baseType: !7)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64)
!1274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1265, file: !1263, line: 105, baseType: !1276, size: 64, offset: 64)
!1276 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1263, line: 59, baseType: !1277)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64)
!1278 = !DISubroutineType(types: !1279)
!1279 = !{!769, !1273, !1273}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1265, file: !1263, line: 108, baseType: !1281, size: 64, offset: 128)
!1281 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1263, line: 63, baseType: !1282)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64)
!1283 = !DISubroutineType(types: !1284)
!1284 = !{null, !773}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1265, file: !1263, line: 111, baseType: !1286, size: 64, offset: 192)
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1265, file: !1263, line: 114, baseType: !1288, size: 64, offset: 256)
!1288 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1289, line: 46, baseType: !789)
!1289 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1265, file: !1263, line: 117, baseType: !1288, size: 64, offset: 320)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1265, file: !1263, line: 120, baseType: !1288, size: 64, offset: 384)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1265, file: !1263, line: 124, baseType: !7, size: 32, offset: 448)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1265, file: !1263, line: 128, baseType: !7, size: 32, offset: 480)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1265, file: !1263, line: 131, baseType: !1295, size: 64, offset: 512)
!1295 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1263, line: 75, baseType: !1296)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64)
!1297 = !DISubroutineType(types: !1298)
!1298 = !{!773, !1288, !1288}
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1265, file: !1263, line: 132, baseType: !1300, size: 64, offset: 576)
!1300 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1263, line: 78, baseType: !1282)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1265, file: !1263, line: 135, baseType: !773, size: 64, offset: 640)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1265, file: !1263, line: 136, baseType: !1303, size: 64, offset: 704)
!1303 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1263, line: 82, baseType: !1304)
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64)
!1305 = !DISubroutineType(types: !1306)
!1306 = !{!773, !773, !1288, !1288}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1265, file: !1263, line: 137, baseType: !1308, size: 64, offset: 768)
!1308 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1263, line: 83, baseType: !1309)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64)
!1310 = !DISubroutineType(types: !1311)
!1311 = !{null, !773, !773}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1265, file: !1263, line: 141, baseType: !7, size: 32, offset: 832)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !1183, file: !135, line: 211, baseType: !1314, size: 64, offset: 256)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64)
!1315 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !158, line: 183, baseType: !1316)
!1316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !158, line: 183, size: 128, elements: !1317)
!1317 = !{!1318}
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1316, file: !158, line: 183, baseType: !1319, size: 128)
!1319 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !158, line: 182, baseType: !1320)
!1320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !158, line: 182, size: 128, elements: !1321)
!1321 = !{!1322, !1323, !1324}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1320, file: !158, line: 182, baseType: !7, size: 32)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1320, file: !158, line: 182, baseType: !7, size: 32, offset: 32)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1320, file: !158, line: 182, baseType: !1325, size: 64, offset: 64)
!1325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !958, size: 64, elements: !879)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !1183, file: !135, line: 220, baseType: !1327, size: 64, offset: 320)
!1327 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !135, line: 217, size: 64, elements: !1328)
!1328 = !{!1329, !1330}
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !1327, file: !135, line: 218, baseType: !1314, size: 64)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !1327, file: !135, line: 219, baseType: !1331, size: 64)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64)
!1332 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !1333, line: 29, baseType: !1334)
!1333 = !DIFile(filename: "./vecprim.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !1333, line: 29, size: 96, elements: !1335)
!1335 = !{!1336}
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1334, file: !1333, line: 29, baseType: !1337, size: 96)
!1337 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !1333, line: 27, baseType: !1338)
!1338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !1333, line: 27, size: 96, elements: !1339)
!1339 = !{!1340, !1341, !1342}
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1338, file: !1333, line: 27, baseType: !7, size: 32)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1338, file: !1333, line: 27, baseType: !7, size: 32, offset: 32)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1338, file: !1333, line: 27, baseType: !1343, size: 8, offset: 64)
!1343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1344, size: 8, elements: !879)
!1344 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !1333, line: 26, baseType: !768)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1178, file: !1179, line: 467, baseType: !1346, size: 64, offset: 64)
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1347, size: 64)
!1347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !142, line: 374, size: 640, elements: !1348)
!1348 = !{!1349, !1350, !1351, !1364, !1365, !1366, !1367, !1368, !1369, !1371, !1373, !1374}
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1347, file: !142, line: 377, baseType: !813, size: 64)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1347, file: !142, line: 378, baseType: !813, size: 64, offset: 64)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1347, file: !142, line: 381, baseType: !1352, size: 64, offset: 128)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64)
!1353 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !142, line: 282, baseType: !1354)
!1354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !142, line: 282, size: 128, elements: !1355)
!1355 = !{!1356}
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1354, file: !142, line: 282, baseType: !1357, size: 128)
!1357 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !142, line: 281, baseType: !1358)
!1358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !142, line: 281, size: 128, elements: !1359)
!1359 = !{!1360, !1361, !1362}
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1358, file: !142, line: 281, baseType: !7, size: 32)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1358, file: !142, line: 281, baseType: !7, size: 32, offset: 32)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1358, file: !142, line: 281, baseType: !1363, size: 64, offset: 64)
!1363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !813, size: 64, elements: !879)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1347, file: !142, line: 384, baseType: !769, size: 32, offset: 192)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1347, file: !142, line: 387, baseType: !769, size: 32, offset: 224)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1347, file: !142, line: 390, baseType: !769, size: 32, offset: 256)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1347, file: !142, line: 394, baseType: !1352, size: 64, offset: 320)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1347, file: !142, line: 396, baseType: !141, size: 32, offset: 384)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1347, file: !142, line: 399, baseType: !1370, size: 64, offset: 416)
!1370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 64, elements: !914)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1347, file: !142, line: 402, baseType: !1372, size: 64, offset: 480)
!1372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !914)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1347, file: !142, line: 406, baseType: !769, size: 32, offset: 544)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1347, file: !142, line: 409, baseType: !769, size: 32, offset: 576)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1178, file: !1179, line: 470, baseType: !842, size: 64, offset: 128)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1178, file: !1179, line: 473, baseType: !1377, size: 64, offset: 192)
!1377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1378, size: 64)
!1378 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1179, line: 166, flags: DIFlagFwdDecl)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1178, file: !1179, line: 476, baseType: !1380, size: 64, offset: 256)
!1380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1381, size: 64)
!1381 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1179, line: 476, flags: DIFlagFwdDecl)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1178, file: !1179, line: 479, baseType: !1262, size: 64, offset: 320)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1178, file: !1179, line: 484, baseType: !958, size: 64, offset: 384)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1178, file: !1179, line: 488, baseType: !958, size: 64, offset: 448)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1178, file: !1179, line: 493, baseType: !958, size: 64, offset: 512)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1178, file: !1179, line: 496, baseType: !958, size: 64, offset: 576)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1178, file: !1179, line: 501, baseType: !1388, size: 64, offset: 640)
!1388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1389, size: 64)
!1389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !153, line: 2355, size: 576, elements: !1390)
!1390 = !{!1391, !1394, !1395, !1396, !1397, !1399, !1400, !1405, !1406, !1407, !1408, !1409, !1410}
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1389, file: !153, line: 2356, baseType: !1392, size: 64)
!1392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1393, size: 64)
!1393 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !153, line: 2356, flags: DIFlagFwdDecl)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1389, file: !153, line: 2357, baseType: !774, size: 64, offset: 64)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1389, file: !153, line: 2358, baseType: !769, size: 32, offset: 128)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1389, file: !153, line: 2359, baseType: !769, size: 32, offset: 160)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1389, file: !153, line: 2360, baseType: !1398, size: 128, offset: 192)
!1398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 128, elements: !938)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1389, file: !153, line: 2364, baseType: !769, size: 32, offset: 320)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1389, file: !153, line: 2367, baseType: !1401, size: 128, offset: 384)
!1401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !153, line: 2349, size: 128, elements: !1402)
!1402 = !{!1403, !1404}
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1401, file: !153, line: 2351, baseType: !845, size: 64)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1401, file: !153, line: 2352, baseType: !804, size: 64, offset: 64)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1389, file: !153, line: 2371, baseType: !152, size: 32, offset: 512)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1389, file: !153, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1389, file: !153, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1389, file: !153, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1389, file: !153, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1389, file: !153, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1178, file: !1179, line: 504, baseType: !1412, size: 64, offset: 704)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1413, size: 64)
!1413 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1179, line: 504, flags: DIFlagFwdDecl)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1178, file: !1179, line: 507, baseType: !1262, size: 64, offset: 768)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1178, file: !1179, line: 510, baseType: !769, size: 32, offset: 832)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1178, file: !1179, line: 513, baseType: !769, size: 32, offset: 864)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1178, file: !1179, line: 516, baseType: !1052, size: 32, offset: 896)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1178, file: !1179, line: 519, baseType: !1052, size: 32, offset: 928)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1178, file: !1179, line: 522, baseType: !7, size: 32, offset: 960)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1178, file: !1179, line: 523, baseType: !7, size: 32, offset: 992)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1178, file: !1179, line: 528, baseType: !774, size: 64, offset: 1024)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1178, file: !1179, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1178, file: !1179, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1178, file: !1179, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1178, file: !1179, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1178, file: !1179, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1178, file: !1179, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1178, file: !1179, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1178, file: !1179, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1178, file: !1179, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1178, file: !1179, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1178, file: !1179, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1178, file: !1179, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1178, file: !1179, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1178, file: !1179, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1178, file: !1179, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1178, file: !1179, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1173, file: !158, line: 3254, baseType: !958, size: 64, offset: 1536)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1173, file: !158, line: 3257, baseType: !958, size: 64, offset: 1600)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1173, file: !158, line: 3258, baseType: !958, size: 64, offset: 1664)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1173, file: !158, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1173, file: !158, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1173, file: !158, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1173, file: !158, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1173, file: !158, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1173, file: !158, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1173, file: !158, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1173, file: !158, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1173, file: !158, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1173, file: !158, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1173, file: !158, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1173, file: !158, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1173, file: !158, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1173, file: !158, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1173, file: !158, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1173, file: !158, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1173, file: !158, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1173, file: !158, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !960, file: !158, line: 3394, baseType: !1460, size: 1344)
!1460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !158, line: 2279, size: 1344, elements: !1461)
!1461 = !{!1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1487, !1488, !1489, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505}
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1460, file: !158, line: 2280, baseType: !996, size: 192)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1460, file: !158, line: 2281, baseType: !958, size: 64, offset: 192)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1460, file: !158, line: 2282, baseType: !958, size: 64, offset: 256)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1460, file: !158, line: 2283, baseType: !958, size: 64, offset: 320)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1460, file: !158, line: 2284, baseType: !958, size: 64, offset: 384)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1460, file: !158, line: 2285, baseType: !7, size: 32, offset: 448)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1460, file: !158, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1460, file: !158, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1460, file: !158, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1460, file: !158, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1460, file: !158, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1460, file: !158, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1460, file: !158, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1460, file: !158, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1460, file: !158, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1460, file: !158, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1460, file: !158, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1460, file: !158, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1460, file: !158, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1460, file: !158, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1460, file: !158, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1460, file: !158, line: 2305, baseType: !7, size: 32, offset: 512)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1460, file: !158, line: 2306, baseType: !1485, size: 32, offset: 544)
!1485 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1486, line: 31, baseType: !769)
!1486 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1460, file: !158, line: 2307, baseType: !958, size: 64, offset: 576)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1460, file: !158, line: 2308, baseType: !958, size: 64, offset: 640)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1460, file: !158, line: 2314, baseType: !1490, size: 64, offset: 704)
!1490 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !158, line: 2309, size: 64, elements: !1491)
!1491 = !{!1492, !1493, !1494}
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1490, file: !158, line: 2310, baseType: !769, size: 32)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1490, file: !158, line: 2311, baseType: !774, size: 64)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1490, file: !158, line: 2312, baseType: !1495, size: 64)
!1495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1496, size: 64)
!1496 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !158, line: 2277, flags: DIFlagFwdDecl)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1460, file: !158, line: 2315, baseType: !958, size: 64, offset: 768)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1460, file: !158, line: 2316, baseType: !958, size: 64, offset: 832)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1460, file: !158, line: 2317, baseType: !958, size: 64, offset: 896)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1460, file: !158, line: 2318, baseType: !958, size: 64, offset: 960)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1460, file: !158, line: 2319, baseType: !958, size: 64, offset: 1024)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1460, file: !158, line: 2320, baseType: !958, size: 64, offset: 1088)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1460, file: !158, line: 2321, baseType: !958, size: 64, offset: 1152)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1460, file: !158, line: 2322, baseType: !958, size: 64, offset: 1216)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1460, file: !158, line: 2324, baseType: !1506, size: 64, offset: 1280)
!1506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1507, size: 64)
!1507 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !158, line: 2324, flags: DIFlagFwdDecl)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !960, file: !158, line: 3395, baseType: !1509, size: 320)
!1509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !158, line: 1469, size: 320, elements: !1510)
!1510 = !{!1511, !1512, !1513}
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1509, file: !158, line: 1470, baseType: !996, size: 192)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1509, file: !158, line: 1471, baseType: !958, size: 64, offset: 192)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1509, file: !158, line: 1472, baseType: !958, size: 64, offset: 256)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !960, file: !158, line: 3396, baseType: !1515, size: 320)
!1515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !158, line: 1482, size: 320, elements: !1516)
!1516 = !{!1517, !1518, !1519}
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1515, file: !158, line: 1483, baseType: !996, size: 192)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1515, file: !158, line: 1484, baseType: !769, size: 32, offset: 192)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1515, file: !158, line: 1485, baseType: !1325, size: 64, offset: 256)
