; ModuleID = 'cselib.bc'
source_filename = "cselib.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.cselib_val_struct = type { i32, i32, %struct.rtx_def*, %struct.elt_loc_list*, %struct.elt_list*, %struct.cselib_val_struct* }
%struct.rtx_def = type { i32, %union.u }
%union.u = type { %struct.block_symbol }
%struct.block_symbol = type { [3 x %union.rtunion_def], %struct.object_block*, i64 }
%union.rtunion_def = type { i8* }
%struct.object_block = type { %union.section*, i32, i64, %struct.VEC_rtx_gc*, %struct.VEC_rtx_gc* }
%union.section = type { %struct.unnamed_section }
%struct.unnamed_section = type { %struct.section_common, void (i8*)*, i8*, %union.section* }
%struct.section_common = type { i32 }
%struct.VEC_rtx_gc = type { %struct.VEC_rtx_base }
%struct.VEC_rtx_base = type { i32, i32, [1 x %struct.rtx_def*] }
%struct.elt_loc_list = type { %struct.elt_loc_list*, %struct.rtx_def*, %struct.rtx_def* }
%struct.elt_list = type { %struct.elt_list*, %struct.cselib_val_struct* }

!481 = !DIEnumerator(name: "FLOAT_EXTEND", value: 101, isUnsigned: true)
!482 = !DIEnumerator(name: "FLOAT_TRUNCATE", value: 102, isUnsigned: true)
!483 = !DIEnumerator(name: "FLOAT", value: 103, isUnsigned: true)
!484 = !DIEnumerator(name: "FIX", value: 104, isUnsigned: true)
!485 = !DIEnumerator(name: "UNSIGNED_FLOAT", value: 105, isUnsigned: true)
!486 = !DIEnumerator(name: "UNSIGNED_FIX", value: 106, isUnsigned: true)
!487 = !DIEnumerator(name: "FRACT_CONVERT", value: 107, isUnsigned: true)
!488 = !DIEnumerator(name: "UNSIGNED_FRACT_CONVERT", value: 108, isUnsigned: true)
!489 = !DIEnumerator(name: "SAT_FRACT", value: 109, isUnsigned: true)
!490 = !DIEnumerator(name: "UNSIGNED_SAT_FRACT", value: 110, isUnsigned: true)
!491 = !DIEnumerator(name: "ABS", value: 111, isUnsigned: true)
!492 = !DIEnumerator(name: "SQRT", value: 112, isUnsigned: true)
!493 = !DIEnumerator(name: "BSWAP", value: 113, isUnsigned: true)
!494 = !DIEnumerator(name: "FFS", value: 114, isUnsigned: true)
!495 = !DIEnumerator(name: "CLZ", value: 115, isUnsigned: true)
!496 = !DIEnumerator(name: "CTZ", value: 116, isUnsigned: true)
!497 = !DIEnumerator(name: "POPCOUNT", value: 117, isUnsigned: true)
!498 = !DIEnumerator(name: "PARITY", value: 118, isUnsigned: true)
!499 = !DIEnumerator(name: "SIGN_EXTRACT", value: 119, isUnsigned: true)
!500 = !DIEnumerator(name: "ZERO_EXTRACT", value: 120, isUnsigned: true)
!501 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!502 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!503 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!504 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!505 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!506 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!507 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!508 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!509 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!510 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!511 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!512 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!513 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!514 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!515 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!516 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!517 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!518 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!519 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!520 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mode_class", file: !521, line: 36, baseType: !7, size: 32, elements: !522)
!521 = !DIFile(filename: "./machmode.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!522 = !{!523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541}
!523 = !DIEnumerator(name: "MODE_RANDOM", value: 0, isUnsigned: true)
!524 = !DIEnumerator(name: "MODE_CC", value: 1, isUnsigned: true)
!525 = !DIEnumerator(name: "MODE_INT", value: 2, isUnsigned: true)
!526 = !DIEnumerator(name: "MODE_PARTIAL_INT", value: 3, isUnsigned: true)
!527 = !DIEnumerator(name: "MODE_FRACT", value: 4, isUnsigned: true)
!528 = !DIEnumerator(name: "MODE_UFRACT", value: 5, isUnsigned: true)
!529 = !DIEnumerator(name: "MODE_ACCUM", value: 6, isUnsigned: true)
!530 = !DIEnumerator(name: "MODE_UACCUM", value: 7, isUnsigned: true)
!531 = !DIEnumerator(name: "MODE_FLOAT", value: 8, isUnsigned: true)
!532 = !DIEnumerator(name: "MODE_DECIMAL_FLOAT", value: 9, isUnsigned: true)
!533 = !DIEnumerator(name: "MODE_COMPLEX_INT", value: 10, isUnsigned: true)
!534 = !DIEnumerator(name: "MODE_COMPLEX_FLOAT", value: 11, isUnsigned: true)
!535 = !DIEnumerator(name: "MODE_VECTOR_INT", value: 12, isUnsigned: true)
!536 = !DIEnumerator(name: "MODE_VECTOR_FRACT", value: 13, isUnsigned: true)
!537 = !DIEnumerator(name: "MODE_VECTOR_UFRACT", value: 14, isUnsigned: true)
!538 = !DIEnumerator(name: "MODE_VECTOR_ACCUM", value: 15, isUnsigned: true)
!539 = !DIEnumerator(name: "MODE_VECTOR_UACCUM", value: 16, isUnsigned: true)
!540 = !DIEnumerator(name: "MODE_VECTOR_FLOAT", value: 17, isUnsigned: true)
!541 = !DIEnumerator(name: "MAX_MODE_CLASS", value: 18, isUnsigned: true)
!542 = !{!543, !544, !545, !546, !549, !550, !5, !377, !552, !7, !1643, !1644, !623, !520, !618, !611, !1645, !1647, !800, !1649, !554, !1651, !1653, !1654}
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!545 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !548)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !553, line: 50, baseType: !554)
!553 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !378, line: 240, size: 384, elements: !556)
!556 = !{!557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !555, file: !378, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !555, file: !378, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !555, file: !378, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !555, file: !378, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !555, file: !378, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !555, file: !378, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !555, file: !378, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !555, file: !378, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !555, file: !378, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !555, file: !378, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !555, file: !378, line: 321, baseType: !568, size: 320, offset: 64)
!568 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !378, line: 315, size: 320, elements: !569)
!569 = !{!570, !1578, !1580, !1641, !1642}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !568, file: !378, line: 316, baseType: !571, size: 64)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !572, size: 64, elements: !587)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !378, line: 183, baseType: !573)
!573 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !378, line: 166, size: 64, elements: !574)
!574 = !{!575, !576, !577, !578, !579, !589, !590, !602, !626, !688, !1556, !1557, !1568, !1575}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !573, file: !378, line: 168, baseType: !545, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !573, file: !378, line: 169, baseType: !7, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !573, file: !378, line: 170, baseType: !550, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !573, file: !378, line: 171, baseType: !552, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !573, file: !378, line: 172, baseType: !580, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !553, line: 53, baseType: !581)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !378, line: 359, size: 128, elements: !583)
!583 = !{!584, !585}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !582, file: !378, line: 360, baseType: !545, size: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !582, file: !378, line: 361, baseType: !586, size: 64, offset: 64)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !552, size: 64, elements: !587)
!587 = !{!588}
!588 = !DISubrange(count: 1)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !573, file: !378, line: 173, baseType: !5, size: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !573, file: !378, line: 174, baseType: !591, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !378, line: 133, baseType: !592)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !378, line: 115, size: 32, elements: !593)
!593 = !{!594, !595, !596, !597, !598, !599, !600, !601}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !592, file: !378, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !592, file: !378, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !592, file: !378, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !592, file: !378, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !592, file: !378, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !592, file: !378, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !592, file: !378, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !592, file: !378, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !573, file: !378, line: 175, baseType: !603, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !605, line: 23, size: 320, elements: !606)
!605 = !DIFile(filename: "./cselib.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!606 = !{!607, !608, !609, !610, !617, !625}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !604, file: !605, line: 25, baseType: !7, size: 32)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !604, file: !605, line: 28, baseType: !545, size: 32, offset: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "val_rtx", scope: !604, file: !605, line: 31, baseType: !552, size: 64, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "locs", scope: !604, file: !605, line: 35, baseType: !611, size: 64, offset: 128)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "elt_loc_list", file: !605, line: 45, size: 192, elements: !613)
!613 = !{!614, !615, !616}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !612, file: !605, line: 47, baseType: !611, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !612, file: !605, line: 49, baseType: !552, size: 64, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "setting_insn", scope: !612, file: !605, line: 51, baseType: !552, size: 64, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "addr_list", scope: !604, file: !605, line: 39, baseType: !618, size: 64, offset: 192)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "elt_list", file: !605, line: 55, size: 128, elements: !620)
!620 = !{!621, !622}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !619, file: !605, line: 56, baseType: !618, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "elt", scope: !619, file: !605, line: 57, baseType: !623, size: 64, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "cselib_val", file: !605, line: 42, baseType: !604)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "next_containing_mem", scope: !604, file: !605, line: 41, baseType: !603, size: 64, offset: 256)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !573, file: !378, line: 176, baseType: !627, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !629, line: 75, size: 256, elements: !630)
!629 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!630 = !{!631, !646, !647, !648}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !628, file: !629, line: 76, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !629, line: 68, baseType: !634)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !629, line: 63, size: 320, elements: !635)
!635 = !{!636, !638, !639, !640}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !634, file: !629, line: 64, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !634, file: !629, line: 65, baseType: !637, size: 64, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !634, file: !629, line: 66, baseType: !7, size: 32, offset: 128)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !634, file: !629, line: 67, baseType: !641, size: 128, offset: 192)
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !642, size: 128, elements: !644)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !629, line: 29, baseType: !643)
!643 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!644 = !{!645}
!645 = !DISubrange(count: 2)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !628, file: !629, line: 77, baseType: !632, size: 64, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !628, file: !629, line: 78, baseType: !7, size: 32, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !628, file: !629, line: 79, baseType: !649, size: 64, offset: 192)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !629, line: 49, baseType: !651)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !629, line: 45, size: 832, elements: !652)
!652 = !{!653, !654, !655}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !651, file: !629, line: 46, baseType: !637, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !651, file: !629, line: 47, baseType: !627, size: 64, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !651, file: !629, line: 48, baseType: !656, size: 704, offset: 128)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !657, line: 164, size: 704, elements: !658)
!657 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!658 = !{!659, !661, !671, !672, !673, !674, !675, !676, !680, !684, !685, !686, !687}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !656, file: !657, line: 166, baseType: !660, size: 64)
!660 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !656, file: !657, line: 167, baseType: !662, size: 64, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !657, line: 157, size: 192, elements: !664)
!664 = !{!665, !666, !667}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !663, file: !657, line: 159, baseType: !547, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !663, file: !657, line: 160, baseType: !662, size: 64, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !663, file: !657, line: 161, baseType: !668, size: 32, offset: 128)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !548, size: 32, elements: !669)
!669 = !{!670}
!670 = !DISubrange(count: 4)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !656, file: !657, line: 168, baseType: !547, size: 64, offset: 128)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !656, file: !657, line: 169, baseType: !547, size: 64, offset: 192)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !656, file: !657, line: 170, baseType: !547, size: 64, offset: 256)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !656, file: !657, line: 171, baseType: !660, size: 64, offset: 320)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !656, file: !657, line: 172, baseType: !545, size: 32, offset: 384)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !656, file: !657, line: 176, baseType: !677, size: 64, offset: 448)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{!662, !549, !660}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !656, file: !657, line: 177, baseType: !681, size: 64, offset: 512)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DISubroutineType(types: !683)
!683 = !{null, !549, !662}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !656, file: !657, line: 178, baseType: !549, size: 64, offset: 576)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !656, file: !657, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !656, file: !657, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !656, file: !657, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !573, file: !378, line: 177, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !553, line: 56, baseType: !690)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !151, line: 3371, size: 1792, elements: !692)
!692 = !{!693, !726, !732, !743, !762, !773, !778, !785, !791, !804, !816, !854, !859, !887, !895, !896, !901, !910, !916, !921, !925, !929, !1180, !1229, !1235, !1242, !1249, !1275, !1300, !1317, !1329, !1351, !1366, !1538}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !691, file: !151, line: 3372, baseType: !694, size: 64)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !151, line: 360, size: 64, elements: !695)
!695 = !{!696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !694, file: !151, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !694, file: !151, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !694, file: !151, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !694, file: !151, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !694, file: !151, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !694, file: !151, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !694, file: !151, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !694, file: !151, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !694, file: !151, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !694, file: !151, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !694, file: !151, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !694, file: !151, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !694, file: !151, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !694, file: !151, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !694, file: !151, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !694, file: !151, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !694, file: !151, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !694, file: !151, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !694, file: !151, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !694, file: !151, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !694, file: !151, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !694, file: !151, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !694, file: !151, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !694, file: !151, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !694, file: !151, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !694, file: !151, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !694, file: !151, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !694, file: !151, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !694, file: !151, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !694, file: !151, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !691, file: !151, line: 3373, baseType: !727, size: 192)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !151, line: 402, size: 192, elements: !728)
!728 = !{!729, !730, !731}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !727, file: !151, line: 403, baseType: !694, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !727, file: !151, line: 404, baseType: !689, size: 64, offset: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !727, file: !151, line: 405, baseType: !689, size: 64, offset: 128)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !691, file: !151, line: 3374, baseType: !733, size: 320)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !151, line: 1384, size: 320, elements: !734)
!734 = !{!735, !736}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !733, file: !151, line: 1385, baseType: !727, size: 192)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !733, file: !151, line: 1386, baseType: !737, size: 128, offset: 192)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !738, line: 58, baseType: !739)
!738 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !738, line: 54, size: 128, elements: !740)
!740 = !{!741, !742}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !739, file: !738, line: 56, baseType: !643, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !739, file: !738, line: 57, baseType: !660, size: 64, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !691, file: !151, line: 3375, baseType: !744, size: 256)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !151, line: 1397, size: 256, elements: !745)
!745 = !{!746, !747}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !744, file: !151, line: 1398, baseType: !727, size: 192)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !744, file: !151, line: 1399, baseType: !748, size: 64, offset: 192)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !750, line: 52, size: 256, elements: !751)
!750 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!751 = !{!752, !753, !754, !755, !756, !757, !758}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !749, file: !750, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !749, file: !750, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !749, file: !750, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !749, file: !750, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !749, file: !750, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !749, file: !750, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !749, file: !750, line: 62, baseType: !759, size: 192, offset: 64)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !643, size: 192, elements: !760)
!760 = !{!761}
!761 = !DISubrange(count: 3)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !691, file: !151, line: 3376, baseType: !763, size: 256)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !151, line: 1408, size: 256, elements: !764)
!764 = !{!765, !766}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !763, file: !151, line: 1409, baseType: !727, size: 192)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !763, file: !151, line: 1410, baseType: !767, size: 64, offset: 192)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !769, line: 27, size: 192, elements: !770)
!769 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!770 = !{!771, !772}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !768, file: !769, line: 29, baseType: !737, size: 128)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !768, file: !769, line: 30, baseType: !5, size: 32, offset: 128)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !691, file: !151, line: 3377, baseType: !774, size: 256)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !151, line: 1437, size: 256, elements: !775)
!775 = !{!776, !777}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !774, file: !151, line: 1438, baseType: !727, size: 192)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !774, file: !151, line: 1439, baseType: !689, size: 64, offset: 192)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !691, file: !151, line: 3378, baseType: !779, size: 256)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !151, line: 1418, size: 256, elements: !780)
!780 = !{!781, !782, !783}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !779, file: !151, line: 1419, baseType: !727, size: 192)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !779, file: !151, line: 1420, baseType: !545, size: 32, offset: 192)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !779, file: !151, line: 1421, baseType: !784, size: 8, offset: 224)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !548, size: 8, elements: !587)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !691, file: !151, line: 3379, baseType: !786, size: 320)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !151, line: 1428, size: 320, elements: !787)
!787 = !{!788, !789, !790}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !786, file: !151, line: 1429, baseType: !727, size: 192)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !786, file: !151, line: 1430, baseType: !689, size: 64, offset: 192)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !786, file: !151, line: 1431, baseType: !689, size: 64, offset: 256)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !691, file: !151, line: 3380, baseType: !792, size: 320)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !151, line: 1460, size: 320, elements: !793)
!793 = !{!794, !795}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !792, file: !151, line: 1461, baseType: !727, size: 192)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !792, file: !151, line: 1462, baseType: !796, size: 128, offset: 192)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !797, line: 31, size: 128, elements: !798)
!797 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!798 = !{!799, !802, !803}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !796, file: !797, line: 32, baseType: !800, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !544)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !796, file: !797, line: 33, baseType: !7, size: 32, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !796, file: !797, line: 34, baseType: !7, size: 32, offset: 96)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !691, file: !151, line: 3381, baseType: !805, size: 384)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !151, line: 2507, size: 384, elements: !806)
!806 = !{!807, !808, !813, !814, !815}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !805, file: !151, line: 2508, baseType: !727, size: 192)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !805, file: !151, line: 2509, baseType: !809, size: 32, offset: 192)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !810, line: 58, baseType: !811)
!810 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !812, line: 44, baseType: !7)
!812 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!813 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !805, file: !151, line: 2510, baseType: !7, size: 32, offset: 224)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !805, file: !151, line: 2511, baseType: !689, size: 64, offset: 256)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !805, file: !151, line: 2512, baseType: !689, size: 64, offset: 320)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !691, file: !151, line: 3382, baseType: !817, size: 896)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !151, line: 2652, size: 896, elements: !818)
!818 = !{!819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !817, file: !151, line: 2653, baseType: !805, size: 384)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !817, file: !151, line: 2654, baseType: !689, size: 64, offset: 384)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !817, file: !151, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !817, file: !151, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !817, file: !151, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !817, file: !151, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !817, file: !151, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !817, file: !151, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !817, file: !151, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !817, file: !151, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !817, file: !151, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !817, file: !151, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !817, file: !151, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !817, file: !151, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !817, file: !151, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !817, file: !151, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !817, file: !151, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !817, file: !151, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !817, file: !151, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !817, file: !151, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !817, file: !151, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !817, file: !151, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !817, file: !151, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !817, file: !151, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !817, file: !151, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !817, file: !151, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !817, file: !151, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !817, file: !151, line: 2703, baseType: !7, size: 32, offset: 512)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !817, file: !151, line: 2705, baseType: !689, size: 64, offset: 576)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !817, file: !151, line: 2706, baseType: !689, size: 64, offset: 640)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !817, file: !151, line: 2707, baseType: !689, size: 64, offset: 704)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !817, file: !151, line: 2708, baseType: !689, size: 64, offset: 768)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !817, file: !151, line: 2711, baseType: !852, size: 64, offset: 832)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !151, line: 2711, flags: DIFlagFwdDecl)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !691, file: !151, line: 3383, baseType: !855, size: 960)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !151, line: 2756, size: 960, elements: !856)
!856 = !{!857, !858}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !855, file: !151, line: 2757, baseType: !817, size: 896)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !855, file: !151, line: 2758, baseType: !552, size: 64, offset: 896)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !691, file: !151, line: 3384, baseType: !860, size: 1472)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !151, line: 3114, size: 1472, elements: !861)
!861 = !{!862, !883, !884, !885, !886}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !860, file: !151, line: 3115, baseType: !863, size: 1216)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !151, line: 2984, size: 1216, elements: !864)
!864 = !{!865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !863, file: !151, line: 2985, baseType: !855, size: 960)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !863, file: !151, line: 2986, baseType: !689, size: 64, offset: 960)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !863, file: !151, line: 2987, baseType: !689, size: 64, offset: 1024)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !863, file: !151, line: 2988, baseType: !689, size: 64, offset: 1088)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !863, file: !151, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !863, file: !151, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !863, file: !151, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !863, file: !151, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !863, file: !151, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !863, file: !151, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !863, file: !151, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !863, file: !151, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !863, file: !151, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !863, file: !151, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !863, file: !151, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !863, file: !151, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !863, file: !151, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !863, file: !151, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !860, file: !151, line: 3117, baseType: !689, size: 64, offset: 1216)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !860, file: !151, line: 3119, baseType: !689, size: 64, offset: 1280)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !860, file: !151, line: 3121, baseType: !689, size: 64, offset: 1344)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !860, file: !151, line: 3123, baseType: !689, size: 64, offset: 1408)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !691, file: !151, line: 3385, baseType: !888, size: 1088)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !151, line: 2874, size: 1088, elements: !889)
!889 = !{!890, !891, !892}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !888, file: !151, line: 2875, baseType: !855, size: 960)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !888, file: !151, line: 2876, baseType: !552, size: 64, offset: 960)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !888, file: !151, line: 2877, baseType: !893, size: 64, offset: 1024)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !151, line: 2856, flags: DIFlagFwdDecl)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !691, file: !151, line: 3386, baseType: !863, size: 1216)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !691, file: !151, line: 3387, baseType: !897, size: 1280)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !151, line: 3093, size: 1280, elements: !898)
!898 = !{!899, !900}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !897, file: !151, line: 3094, baseType: !863, size: 1216)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !897, file: !151, line: 3095, baseType: !893, size: 64, offset: 1216)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !691, file: !151, line: 3388, baseType: !902, size: 1216)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !151, line: 2824, size: 1216, elements: !903)
!903 = !{!904, !905, !906, !907, !908, !909}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !902, file: !151, line: 2825, baseType: !817, size: 896)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !902, file: !151, line: 2827, baseType: !689, size: 64, offset: 896)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !902, file: !151, line: 2828, baseType: !689, size: 64, offset: 960)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !902, file: !151, line: 2829, baseType: !689, size: 64, offset: 1024)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !902, file: !151, line: 2830, baseType: !689, size: 64, offset: 1088)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !902, file: !151, line: 2831, baseType: !689, size: 64, offset: 1152)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !691, file: !151, line: 3389, baseType: !911, size: 1024)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !151, line: 2850, size: 1024, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !911, file: !151, line: 2851, baseType: !855, size: 960)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !911, file: !151, line: 2852, baseType: !545, size: 32, offset: 960)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !911, file: !151, line: 2853, baseType: !545, size: 32, offset: 992)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !691, file: !151, line: 3390, baseType: !917, size: 1024)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !151, line: 2857, size: 1024, elements: !918)
!918 = !{!919, !920}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !917, file: !151, line: 2858, baseType: !855, size: 960)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !917, file: !151, line: 2859, baseType: !893, size: 64, offset: 960)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !691, file: !151, line: 3391, baseType: !922, size: 960)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !151, line: 2862, size: 960, elements: !923)
!923 = !{!924}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !922, file: !151, line: 2863, baseType: !855, size: 960)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !691, file: !151, line: 3392, baseType: !926, size: 1472)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !151, line: 3304, size: 1472, elements: !927)
!927 = !{!928}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !926, file: !151, line: 3305, baseType: !860, size: 1472)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !691, file: !151, line: 3393, baseType: !930, size: 1792)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !151, line: 3248, size: 1792, elements: !931)
!931 = !{!932, !933, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !930, file: !151, line: 3249, baseType: !860, size: 1472)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !930, file: !151, line: 3251, baseType: !934, size: 64, offset: 1472)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !936, line: 463, size: 1152, elements: !937)
!936 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!937 = !{!938, !941, !1045, !1046, !1049, !1052, !1104, !1105, !1106, !1107, !1108, !1132, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !935, file: !936, line: 464, baseType: !939, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !936, line: 464, flags: DIFlagFwdDecl)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !935, file: !936, line: 467, baseType: !942, size: 64, offset: 64)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !135, line: 374, size: 640, elements: !944)
!944 = !{!945, !1020, !1021, !1034, !1035, !1036, !1037, !1038, !1039, !1041, !1043, !1044}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !943, file: !135, line: 377, baseType: !946, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !553, line: 111, baseType: !947)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !135, line: 217, size: 832, elements: !949)
!949 = !{!950, !985, !986, !987, !990, !994, !995, !996, !1014, !1015, !1016, !1017, !1018, !1019}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !948, file: !135, line: 219, baseType: !951, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !135, line: 151, baseType: !953)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !135, line: 151, size: 128, elements: !954)
!954 = !{!955}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !953, file: !135, line: 151, baseType: !956, size: 128)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !135, line: 150, baseType: !957)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !135, line: 150, size: 128, elements: !958)
!958 = !{!959, !960, !961}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !957, file: !135, line: 150, baseType: !7, size: 32)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !957, file: !135, line: 150, baseType: !7, size: 32, offset: 32)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !957, file: !135, line: 150, baseType: !962, size: 64, offset: 64)
!962 = !DICompositeType(tag: DW_TAG_array_type, baseType: !963, size: 64, elements: !587)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !553, line: 108, baseType: !964)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !135, line: 122, size: 512, elements: !966)
!966 = !{!967, !968, !969, !977, !978, !979, !980, !981, !982, !983}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !965, file: !135, line: 124, baseType: !947, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !965, file: !135, line: 125, baseType: !947, size: 64, offset: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !965, file: !135, line: 131, baseType: !970, size: 64, offset: 128)
!970 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !135, line: 128, size: 64, elements: !971)
!971 = !{!972, !976}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !970, file: !135, line: 129, baseType: !973, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !553, line: 66, baseType: !974)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !553, line: 65, flags: DIFlagFwdDecl)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !970, file: !135, line: 130, baseType: !552, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !965, file: !135, line: 134, baseType: !549, size: 64, offset: 192)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !965, file: !135, line: 137, baseType: !689, size: 64, offset: 256)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !965, file: !135, line: 138, baseType: !809, size: 32, offset: 320)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !965, file: !135, line: 142, baseType: !7, size: 32, offset: 352)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !965, file: !135, line: 144, baseType: !545, size: 32, offset: 384)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !965, file: !135, line: 145, baseType: !545, size: 32, offset: 416)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !965, file: !135, line: 146, baseType: !984, size: 64, offset: 448)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !135, line: 119, baseType: !660)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !948, file: !135, line: 220, baseType: !951, size: 64, offset: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !948, file: !135, line: 223, baseType: !549, size: 64, offset: 128)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !948, file: !135, line: 226, baseType: !988, size: 64, offset: 192)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !135, line: 185, flags: DIFlagFwdDecl)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !948, file: !135, line: 229, baseType: !991, size: 128, offset: 256)
!991 = !DICompositeType(tag: DW_TAG_array_type, baseType: !992, size: 128, elements: !644)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !135, line: 229, flags: DIFlagFwdDecl)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !948, file: !135, line: 232, baseType: !947, size: 64, offset: 384)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !948, file: !135, line: 233, baseType: !947, size: 64, offset: 448)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !948, file: !135, line: 238, baseType: !997, size: 64, offset: 512)
!997 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !135, line: 235, size: 64, elements: !998)
!998 = !{!999, !1005}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !997, file: !135, line: 236, baseType: !1000, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !135, line: 273, size: 128, elements: !1002)
!1002 = !{!1003, !1004}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1001, file: !135, line: 275, baseType: !973, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1001, file: !135, line: 278, baseType: !973, size: 64, offset: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !997, file: !135, line: 237, baseType: !1006, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !135, line: 259, size: 320, elements: !1008)
!1008 = !{!1009, !1010, !1011, !1012, !1013}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1007, file: !135, line: 261, baseType: !552, size: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1007, file: !135, line: 262, baseType: !552, size: 64, offset: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1007, file: !135, line: 266, baseType: !552, size: 64, offset: 128)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1007, file: !135, line: 267, baseType: !552, size: 64, offset: 192)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1007, file: !135, line: 270, baseType: !545, size: 32, offset: 256)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !948, file: !135, line: 241, baseType: !984, size: 64, offset: 576)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !948, file: !135, line: 244, baseType: !545, size: 32, offset: 640)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !948, file: !135, line: 247, baseType: !545, size: 32, offset: 672)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !948, file: !135, line: 250, baseType: !545, size: 32, offset: 704)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !948, file: !135, line: 253, baseType: !545, size: 32, offset: 736)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !948, file: !135, line: 256, baseType: !545, size: 32, offset: 768)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !943, file: !135, line: 378, baseType: !946, size: 64, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !943, file: !135, line: 381, baseType: !1022, size: 64, offset: 128)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !135, line: 282, baseType: !1024)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !135, line: 282, size: 128, elements: !1025)
!1025 = !{!1026}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1024, file: !135, line: 282, baseType: !1027, size: 128)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !135, line: 281, baseType: !1028)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !135, line: 281, size: 128, elements: !1029)
!1029 = !{!1030, !1031, !1032}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1028, file: !135, line: 281, baseType: !7, size: 32)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1028, file: !135, line: 281, baseType: !7, size: 32, offset: 32)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1028, file: !135, line: 281, baseType: !1033, size: 64, offset: 64)
!1033 = !DICompositeType(tag: DW_TAG_array_type, baseType: !946, size: 64, elements: !587)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !943, file: !135, line: 384, baseType: !545, size: 32, offset: 192)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !943, file: !135, line: 387, baseType: !545, size: 32, offset: 224)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !943, file: !135, line: 390, baseType: !545, size: 32, offset: 256)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !943, file: !135, line: 394, baseType: !1022, size: 64, offset: 320)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !943, file: !135, line: 396, baseType: !134, size: 32, offset: 384)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !943, file: !135, line: 399, baseType: !1040, size: 64, offset: 416)
!1040 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 64, elements: !644)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !943, file: !135, line: 402, baseType: !1042, size: 64, offset: 480)
!1042 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !644)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !943, file: !135, line: 406, baseType: !545, size: 32, offset: 544)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !943, file: !135, line: 409, baseType: !545, size: 32, offset: 576)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !935, file: !936, line: 470, baseType: !974, size: 64, offset: 128)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !935, file: !936, line: 473, baseType: !1047, size: 64, offset: 192)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !936, line: 166, flags: DIFlagFwdDecl)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !935, file: !936, line: 476, baseType: !1050, size: 64, offset: 256)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !936, line: 476, flags: DIFlagFwdDecl)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !935, file: !936, line: 479, baseType: !1053, size: 64, offset: 320)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1054, line: 144, baseType: !1055)
!1054 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1054, line: 100, size: 896, elements: !1057)
!1057 = !{!1058, !1066, !1071, !1076, !1078, !1081, !1082, !1083, !1084, !1085, !1090, !1092, !1093, !1098, !1103}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1056, file: !1054, line: 102, baseType: !1059, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1054, line: 52, baseType: !1060)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!1063, !1064}
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1054, line: 47, baseType: !7)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1056, file: !1054, line: 105, baseType: !1067, size: 64, offset: 64)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1054, line: 59, baseType: !1068)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{!545, !1064, !1064}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1056, file: !1054, line: 108, baseType: !1072, size: 64, offset: 128)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1054, line: 63, baseType: !1073)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = !DISubroutineType(types: !1075)
!1075 = !{null, !549}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1056, file: !1054, line: 111, baseType: !1077, size: 64, offset: 192)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1056, file: !1054, line: 114, baseType: !1079, size: 64, offset: 256)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1080, line: 46, baseType: !643)
!1080 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1056, file: !1054, line: 117, baseType: !1079, size: 64, offset: 320)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1056, file: !1054, line: 120, baseType: !1079, size: 64, offset: 384)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1056, file: !1054, line: 124, baseType: !7, size: 32, offset: 448)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1056, file: !1054, line: 128, baseType: !7, size: 32, offset: 480)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1056, file: !1054, line: 131, baseType: !1086, size: 64, offset: 512)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1054, line: 75, baseType: !1087)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{!549, !1079, !1079}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1056, file: !1054, line: 132, baseType: !1091, size: 64, offset: 576)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1054, line: 78, baseType: !1073)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1056, file: !1054, line: 135, baseType: !549, size: 64, offset: 640)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1056, file: !1054, line: 136, baseType: !1094, size: 64, offset: 704)
!1094 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1054, line: 82, baseType: !1095)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1096 = !DISubroutineType(types: !1097)
!1097 = !{!549, !549, !1079, !1079}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1056, file: !1054, line: 137, baseType: !1099, size: 64, offset: 768)
!1099 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1054, line: 83, baseType: !1100)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64)
!1101 = !DISubroutineType(types: !1102)
!1102 = !{null, !549, !549}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1056, file: !1054, line: 141, baseType: !7, size: 32, offset: 832)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !935, file: !936, line: 484, baseType: !689, size: 64, offset: 384)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !935, file: !936, line: 488, baseType: !689, size: 64, offset: 448)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !935, file: !936, line: 493, baseType: !689, size: 64, offset: 512)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !935, file: !936, line: 496, baseType: !689, size: 64, offset: 576)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !935, file: !936, line: 501, baseType: !1109, size: 64, offset: 640)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !146, line: 2355, size: 576, elements: !1111)
!1111 = !{!1112, !1115, !1116, !1117, !1118, !1120, !1121, !1126, !1127, !1128, !1129, !1130, !1131}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1110, file: !146, line: 2356, baseType: !1113, size: 64)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1114 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !146, line: 2356, flags: DIFlagFwdDecl)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1110, file: !146, line: 2357, baseType: !550, size: 64, offset: 64)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1110, file: !146, line: 2358, baseType: !545, size: 32, offset: 128)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1110, file: !146, line: 2359, baseType: !545, size: 32, offset: 160)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1110, file: !146, line: 2360, baseType: !1119, size: 128, offset: 192)
!1119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !545, size: 128, elements: !669)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1110, file: !146, line: 2364, baseType: !545, size: 32, offset: 320)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1110, file: !146, line: 2367, baseType: !1122, size: 128, offset: 384)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !146, line: 2349, size: 128, elements: !1123)
!1123 = !{!1124, !1125}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1122, file: !146, line: 2351, baseType: !552, size: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1122, file: !146, line: 2352, baseType: !660, size: 64, offset: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1110, file: !146, line: 2371, baseType: !145, size: 32, offset: 512)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1110, file: !146, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1110, file: !146, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1110, file: !146, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1110, file: !146, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1110, file: !146, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !935, file: !936, line: 504, baseType: !1133, size: 64, offset: 704)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64)
!1134 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !936, line: 504, flags: DIFlagFwdDecl)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !935, file: !936, line: 507, baseType: !1053, size: 64, offset: 768)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !935, file: !936, line: 510, baseType: !545, size: 32, offset: 832)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !935, file: !936, line: 513, baseType: !545, size: 32, offset: 864)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !935, file: !936, line: 516, baseType: !809, size: 32, offset: 896)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !935, file: !936, line: 519, baseType: !809, size: 32, offset: 928)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !935, file: !936, line: 522, baseType: !7, size: 32, offset: 960)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !935, file: !936, line: 523, baseType: !7, size: 32, offset: 992)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !935, file: !936, line: 528, baseType: !550, size: 64, offset: 1024)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !935, file: !936, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !935, file: !936, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !935, file: !936, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !935, file: !936, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !935, file: !936, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !935, file: !936, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !935, file: !936, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !935, file: !936, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !935, file: !936, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !935, file: !936, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !935, file: !936, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !935, file: !936, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !935, file: !936, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !935, file: !936, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !935, file: !936, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !935, file: !936, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !930, file: !151, line: 3254, baseType: !689, size: 64, offset: 1536)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !930, file: !151, line: 3257, baseType: !689, size: 64, offset: 1600)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !930, file: !151, line: 3258, baseType: !689, size: 64, offset: 1664)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !930, file: !151, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !930, file: !151, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !930, file: !151, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !930, file: !151, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !930, file: !151, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !930, file: !151, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !930, file: !151, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !930, file: !151, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !930, file: !151, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !930, file: !151, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !930, file: !151, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !930, file: !151, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !930, file: !151, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !930, file: !151, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !930, file: !151, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !930, file: !151, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !930, file: !151, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !930, file: !151, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !691, file: !151, line: 3394, baseType: !1181, size: 1344)
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !151, line: 2279, size: 1344, elements: !1182)
!1182 = !{!1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1208, !1209, !1210, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1181, file: !151, line: 2280, baseType: !727, size: 192)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1181, file: !151, line: 2281, baseType: !689, size: 64, offset: 192)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1181, file: !151, line: 2282, baseType: !689, size: 64, offset: 256)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1181, file: !151, line: 2283, baseType: !689, size: 64, offset: 320)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1181, file: !151, line: 2284, baseType: !689, size: 64, offset: 384)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1181, file: !151, line: 2285, baseType: !7, size: 32, offset: 448)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1181, file: !151, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1181, file: !151, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1181, file: !151, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1181, file: !151, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1181, file: !151, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1181, file: !151, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1181, file: !151, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1181, file: !151, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1181, file: !151, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1181, file: !151, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1181, file: !151, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1181, file: !151, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1181, file: !151, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1181, file: !151, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1181, file: !151, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1181, file: !151, line: 2305, baseType: !7, size: 32, offset: 512)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1181, file: !151, line: 2306, baseType: !1206, size: 32, offset: 544)
!1206 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1207, line: 31, baseType: !545)
!1207 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1181, file: !151, line: 2307, baseType: !689, size: 64, offset: 576)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1181, file: !151, line: 2308, baseType: !689, size: 64, offset: 640)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1181, file: !151, line: 2314, baseType: !1211, size: 64, offset: 704)
!1211 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !151, line: 2309, size: 64, elements: !1212)
!1212 = !{!1213, !1214, !1215}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1211, file: !151, line: 2310, baseType: !545, size: 32)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1211, file: !151, line: 2311, baseType: !550, size: 64)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1211, file: !151, line: 2312, baseType: !1216, size: 64)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1217 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !151, line: 2277, flags: DIFlagFwdDecl)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1181, file: !151, line: 2315, baseType: !689, size: 64, offset: 768)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1181, file: !151, line: 2316, baseType: !689, size: 64, offset: 832)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1181, file: !151, line: 2317, baseType: !689, size: 64, offset: 896)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1181, file: !151, line: 2318, baseType: !689, size: 64, offset: 960)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1181, file: !151, line: 2319, baseType: !689, size: 64, offset: 1024)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1181, file: !151, line: 2320, baseType: !689, size: 64, offset: 1088)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1181, file: !151, line: 2321, baseType: !689, size: 64, offset: 1152)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1181, file: !151, line: 2322, baseType: !689, size: 64, offset: 1216)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1181, file: !151, line: 2324, baseType: !1227, size: 64, offset: 1280)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64)
!1228 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !151, line: 2324, flags: DIFlagFwdDecl)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !691, file: !151, line: 3395, baseType: !1230, size: 320)
!1230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !151, line: 1469, size: 320, elements: !1231)
!1231 = !{!1232, !1233, !1234}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1230, file: !151, line: 1470, baseType: !727, size: 192)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1230, file: !151, line: 1471, baseType: !689, size: 64, offset: 192)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1230, file: !151, line: 1472, baseType: !689, size: 64, offset: 256)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !691, file: !151, line: 3396, baseType: !1236, size: 320)
!1236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !151, line: 1482, size: 320, elements: !1237)
!1237 = !{!1238, !1239, !1240}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1236, file: !151, line: 1483, baseType: !727, size: 192)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1236, file: !151, line: 1484, baseType: !545, size: 32, offset: 192)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1236, file: !151, line: 1485, baseType: !1241, size: 64, offset: 256)
!1241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !689, size: 64, elements: !587)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !691, file: !151, line: 3397, baseType: !1243, size: 384)
!1243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !151, line: 1829, size: 384, elements: !1244)
!1244 = !{!1245, !1246, !1247, !1248}
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1243, file: !151, line: 1830, baseType: !727, size: 192)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1243, file: !151, line: 1831, baseType: !809, size: 32, offset: 192)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1243, file: !151, line: 1832, baseType: !689, size: 64, offset: 256)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1243, file: !151, line: 1835, baseType: !1241, size: 64, offset: 320)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !691, file: !151, line: 3398, baseType: !1250, size: 704)
!1250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !151, line: 1898, size: 704, elements: !1251)
!1251 = !{!1252, !1253, !1254, !1258, !1259, !1262}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1250, file: !151, line: 1899, baseType: !727, size: 192)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1250, file: !151, line: 1902, baseType: !689, size: 64, offset: 192)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1250, file: !151, line: 1905, baseType: !1255, size: 64, offset: 256)
!1255 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !553, line: 58, baseType: !1256)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64)
!1257 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !553, line: 57, flags: DIFlagFwdDecl)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1250, file: !151, line: 1908, baseType: !7, size: 32, offset: 320)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1250, file: !151, line: 1911, baseType: !1260, size: 64, offset: 384)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64)
!1261 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !151, line: 1876, flags: DIFlagFwdDecl)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1250, file: !151, line: 1914, baseType: !1263, size: 256, offset: 448)
!1263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !151, line: 1883, size: 256, elements: !1264)
!1264 = !{!1265, !1267, !1268, !1273}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1263, file: !151, line: 1884, baseType: !1266, size: 64)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1263, file: !151, line: 1885, baseType: !1266, size: 64, offset: 64)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1263, file: !151, line: 1891, baseType: !1269, size: 64, offset: 128)
!1269 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1263, file: !151, line: 1891, size: 64, elements: !1270)
!1270 = !{!1271, !1272}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1269, file: !151, line: 1891, baseType: !1255, size: 64)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1269, file: !151, line: 1891, baseType: !689, size: 64)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1263, file: !151, line: 1892, baseType: !1274, size: 64, offset: 192)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !691, file: !151, line: 3399, baseType: !1276, size: 704)
!1276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !151, line: 2008, size: 704, elements: !1277)
!1277 = !{!1278, !1279, !1280, !1281, !1282, !1283, !1295, !1296, !1297, !1298, !1299}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1276, file: !151, line: 2009, baseType: !727, size: 192)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1276, file: !151, line: 2011, baseType: !7, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !1276, file: !151, line: 2012, baseType: !7, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1276, file: !151, line: 2014, baseType: !809, size: 32, offset: 224)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1276, file: !151, line: 2016, baseType: !689, size: 64, offset: 256)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !1276, file: !151, line: 2017, baseType: !1284, size: 64, offset: 320)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64)
!1285 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !151, line: 183, baseType: !1286)
!1286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !151, line: 183, size: 128, elements: !1287)
!1287 = !{!1288}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1286, file: !151, line: 183, baseType: !1289, size: 128)
!1289 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !151, line: 182, baseType: !1290)
!1290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !151, line: 182, size: 128, elements: !1291)
!1291 = !{!1292, !1293, !1294}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1290, file: !151, line: 182, baseType: !7, size: 32)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1290, file: !151, line: 182, baseType: !7, size: 32, offset: 32)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1290, file: !151, line: 182, baseType: !1241, size: 64, offset: 64)
