; ModuleID = 'dbgcnt.bc'
source_filename = "dbgcnt.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.string2counter_map = type { i8*, i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.stat64 = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }

@stdout = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@stdin = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@count = internal unnamed_addr global [38 x i32] zeroinitializer, align 16, !dbg !0

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "count", scope: !2, file: !3, line: 52, type: !61, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !48, globals: !58, nameTableKind: None)
!3 = !DIFile(filename: "dbgcnt.c", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "debug_counter", file: !6, line: 27, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./dbgcnt.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47}
!9 = !DIEnumerator(name: "auto_inc_dec", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "ccp", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "cfg_cleanup", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "cse2_move2add", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "cprop", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "dce", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "dce_fast", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "dce_ud", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "delete_trivial_dead", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "df_byte_scan", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "dse", value: 10, isUnsigned: true)
!20 = !DIEnumerator(name: "dse1", value: 11, isUnsigned: true)
!21 = !DIEnumerator(name: "dse2", value: 12, isUnsigned: true)
!22 = !DIEnumerator(name: "gcse2_delete", value: 13, isUnsigned: true)
!23 = !DIEnumerator(name: "global_alloc_at_func", value: 14, isUnsigned: true)
!24 = !DIEnumerator(name: "global_alloc_at_reg", value: 15, isUnsigned: true)
!25 = !DIEnumerator(name: "hoist", value: 16, isUnsigned: true)
!26 = !DIEnumerator(name: "ia64_sched2", value: 17, isUnsigned: true)
!27 = !DIEnumerator(name: "if_conversion", value: 18, isUnsigned: true)
!28 = !DIEnumerator(name: "if_after_combine", value: 19, isUnsigned: true)
!29 = !DIEnumerator(name: "if_after_reload", value: 20, isUnsigned: true)
!30 = !DIEnumerator(name: "local_alloc_for_sched", value: 21, isUnsigned: true)
!31 = !DIEnumerator(name: "postreload_cse", value: 22, isUnsigned: true)
!32 = !DIEnumerator(name: "pre", value: 23, isUnsigned: true)
!33 = !DIEnumerator(name: "pre_insn", value: 24, isUnsigned: true)
!34 = !DIEnumerator(name: "treepre_insert", value: 25, isUnsigned: true)
!35 = !DIEnumerator(name: "sched2_func", value: 26, isUnsigned: true)
!36 = !DIEnumerator(name: "sched_block", value: 27, isUnsigned: true)
!37 = !DIEnumerator(name: "sched_func", value: 28, isUnsigned: true)
!38 = !DIEnumerator(name: "sched_insn", value: 29, isUnsigned: true)
!39 = !DIEnumerator(name: "sched_region", value: 30, isUnsigned: true)
!40 = !DIEnumerator(name: "sel_sched_cnt", value: 31, isUnsigned: true)
!41 = !DIEnumerator(name: "sel_sched_region_cnt", value: 32, isUnsigned: true)
!42 = !DIEnumerator(name: "sel_sched_insn_cnt", value: 33, isUnsigned: true)
!43 = !DIEnumerator(name: "sms_sched_loop", value: 34, isUnsigned: true)
!44 = !DIEnumerator(name: "store_motion", value: 35, isUnsigned: true)
!45 = !DIEnumerator(name: "split_for_sched2", value: 36, isUnsigned: true)
!46 = !DIEnumerator(name: "tail_call", value: 37, isUnsigned: true)
!47 = !DIEnumerator(name: "debug_counter_number_of_counters", value: 38, isUnsigned: true)
!48 = !{!49, !50, !51, !52, !55, !56, !53, !5}
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!51 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!58 = !{!0, !59, !64}
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "limit", scope: !2, file: !3, line: 46, type: !61, isLocal: true, isDefinition: true)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 1216, elements: !62)
!62 = !{!63}
!63 = !DISubrange(count: 38)
!64 = !DIGlobalVariableExpression(var: !65, expr: !DIExpression())
!65 = distinct !DIGlobalVariable(name: "map", scope: !2, file: !3, line: 39, type: !66, isLocal: true, isDefinition: true)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 4864, elements: !62)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "string2counter_map", file: !3, line: 32, size: 128, elements: !68)
!68 = !{!69, !70}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !67, file: !3, line: 33, baseType: !56, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !67, file: !3, line: 34, baseType: !5, size: 32, offset: 64)
!71 = !{i32 2, !"Dwarf Version", i32 4}
!72 = !{i32 2, !"Debug Info Version", i32 3}
!73 = !{i32 1, !"wchar_size", i32 4}
!74 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!75 = distinct !DISubprogram(name: "vprintf", scope: !76, file: !76, line: 39, type: !77, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !87)
!76 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!77 = !DISubroutineType(types: !78)
!78 = !{!51, !79, !80}
!79 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !56)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, size: 192, elements: !82)
!82 = !{!83, !84, !85, !86}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !81, file: !3, baseType: !7, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !81, file: !3, baseType: !7, size: 32, offset: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !81, file: !3, baseType: !55, size: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !81, file: !3, baseType: !55, size: 64, offset: 128)
!87 = !{!88, !89}
!88 = !DILocalVariable(name: "__fmt", arg: 1, scope: !75, file: !76, line: 39, type: !79)
!89 = !DILocalVariable(name: "__arg", arg: 2, scope: !75, file: !76, line: 39, type: !80)
!90 = !DILocation(line: 0, scope: !75)
!91 = !DILocation(line: 41, column: 20, scope: !75)
!92 = !DILocation(line: 41, column: 10, scope: !75)
!93 = !DILocation(line: 41, column: 3, scope: !75)
!94 = distinct !DISubprogram(name: "getchar", scope: !76, file: !76, line: 47, type: !95, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !97)
!95 = !DISubroutineType(types: !96)
!96 = !{!51}
!97 = !{}
!98 = !DILocation(line: 49, column: 16, scope: !94)
!99 = !DILocation(line: 49, column: 10, scope: !94)
!100 = !DILocation(line: 49, column: 3, scope: !94)
!101 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !76, file: !76, line: 56, type: !102, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !163)
!102 = !DISubroutineType(types: !103)
!103 = !{!51, !104}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !106, line: 7, baseType: !107)
!106 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !108, line: 49, size: 1728, elements: !109)
!108 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!109 = !{!110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !125, !127, !128, !129, !133, !135, !137, !141, !144, !146, !149, !152, !153, !154, !158, !159}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !107, file: !108, line: 51, baseType: !51, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !107, file: !108, line: 54, baseType: !53, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !107, file: !108, line: 55, baseType: !53, size: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !107, file: !108, line: 56, baseType: !53, size: 64, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !107, file: !108, line: 57, baseType: !53, size: 64, offset: 256)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !107, file: !108, line: 58, baseType: !53, size: 64, offset: 320)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !107, file: !108, line: 59, baseType: !53, size: 64, offset: 384)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !107, file: !108, line: 60, baseType: !53, size: 64, offset: 448)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !107, file: !108, line: 61, baseType: !53, size: 64, offset: 512)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !107, file: !108, line: 64, baseType: !53, size: 64, offset: 576)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !107, file: !108, line: 65, baseType: !53, size: 64, offset: 640)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !107, file: !108, line: 66, baseType: !53, size: 64, offset: 704)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !107, file: !108, line: 68, baseType: !123, size: 64, offset: 768)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !108, line: 36, flags: DIFlagFwdDecl)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !107, file: !108, line: 70, baseType: !126, size: 64, offset: 832)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !107, file: !108, line: 72, baseType: !51, size: 32, offset: 896)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !107, file: !108, line: 73, baseType: !51, size: 32, offset: 928)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !107, file: !108, line: 74, baseType: !130, size: 64, offset: 960)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !131, line: 152, baseType: !132)
!131 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!132 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !107, file: !108, line: 77, baseType: !134, size: 16, offset: 1024)
!134 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !107, file: !108, line: 78, baseType: !136, size: 8, offset: 1040)
!136 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !107, file: !108, line: 79, baseType: !138, size: 8, offset: 1048)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 8, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 1)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !107, file: !108, line: 81, baseType: !142, size: 64, offset: 1088)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !108, line: 43, baseType: null)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !107, file: !108, line: 89, baseType: !145, size: 64, offset: 1152)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !131, line: 153, baseType: !132)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !107, file: !108, line: 91, baseType: !147, size: 64, offset: 1216)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !108, line: 37, flags: DIFlagFwdDecl)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !107, file: !108, line: 92, baseType: !150, size: 64, offset: 1280)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !108, line: 38, flags: DIFlagFwdDecl)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !107, file: !108, line: 93, baseType: !126, size: 64, offset: 1344)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !107, file: !108, line: 94, baseType: !55, size: 64, offset: 1408)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !107, file: !108, line: 95, baseType: !155, size: 64, offset: 1472)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !156, line: 46, baseType: !157)
!156 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!157 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !107, file: !108, line: 96, baseType: !51, size: 32, offset: 1536)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !107, file: !108, line: 98, baseType: !160, size: 160, offset: 1568)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 160, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 20)
!163 = !{!164}
!164 = !DILocalVariable(name: "__fp", arg: 1, scope: !101, file: !76, line: 56, type: !104)
!165 = !DILocation(line: 0, scope: !101)
!166 = !DILocation(line: 58, column: 10, scope: !101)
!167 = !DILocation(line: 58, column: 3, scope: !101)
!168 = distinct !DISubprogram(name: "getc_unlocked", scope: !76, file: !76, line: 66, type: !102, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !169)
!169 = !{!170}
!170 = !DILocalVariable(name: "__fp", arg: 1, scope: !168, file: !76, line: 66, type: !104)
!171 = !DILocation(line: 0, scope: !168)
!172 = !DILocation(line: 68, column: 10, scope: !168)
!173 = !DILocation(line: 68, column: 3, scope: !168)
!174 = distinct !DISubprogram(name: "getchar_unlocked", scope: !76, file: !76, line: 73, type: !95, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !97)
!175 = !DILocation(line: 75, column: 10, scope: !174)
!176 = !DILocation(line: 75, column: 3, scope: !174)
!177 = distinct !DISubprogram(name: "putchar", scope: !76, file: !76, line: 82, type: !178, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !180)
!178 = !DISubroutineType(types: !179)
!179 = !{!51, !51}
!180 = !{!181}
!181 = !DILocalVariable(name: "__c", arg: 1, scope: !177, file: !76, line: 82, type: !51)
!182 = !DILocation(line: 0, scope: !177)
!183 = !DILocation(line: 84, column: 21, scope: !177)
!184 = !DILocation(line: 84, column: 10, scope: !177)
!185 = !DILocation(line: 84, column: 3, scope: !177)
!186 = distinct !DISubprogram(name: "fputc_unlocked", scope: !76, file: !76, line: 91, type: !187, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !189)
!187 = !DISubroutineType(types: !188)
!188 = !{!51, !51, !104}
!189 = !{!190, !191}
!190 = !DILocalVariable(name: "__c", arg: 1, scope: !186, file: !76, line: 91, type: !51)
!191 = !DILocalVariable(name: "__stream", arg: 2, scope: !186, file: !76, line: 91, type: !104)
!192 = !DILocation(line: 0, scope: !186)
!193 = !DILocation(line: 93, column: 10, scope: !186)
!194 = !DILocation(line: 93, column: 3, scope: !186)
!195 = distinct !DISubprogram(name: "putc_unlocked", scope: !76, file: !76, line: 101, type: !187, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !196)
!196 = !{!197, !198}
!197 = !DILocalVariable(name: "__c", arg: 1, scope: !195, file: !76, line: 101, type: !51)
!198 = !DILocalVariable(name: "__stream", arg: 2, scope: !195, file: !76, line: 101, type: !104)
!199 = !DILocation(line: 0, scope: !195)
!200 = !DILocation(line: 103, column: 10, scope: !195)
!201 = !DILocation(line: 103, column: 3, scope: !195)
!202 = distinct !DISubprogram(name: "putchar_unlocked", scope: !76, file: !76, line: 108, type: !178, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !203)
!203 = !{!204}
!204 = !DILocalVariable(name: "__c", arg: 1, scope: !202, file: !76, line: 108, type: !51)
!205 = !DILocation(line: 0, scope: !202)
!206 = !DILocation(line: 110, column: 10, scope: !202)
!207 = !DILocation(line: 110, column: 3, scope: !202)
!208 = distinct !DISubprogram(name: "getline", scope: !76, file: !76, line: 118, type: !209, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !213)
!209 = !DISubroutineType(types: !210)
!210 = !{!211, !52, !212, !104}
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !131, line: 193, baseType: !132)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!213 = !{!214, !215, !216}
!214 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !208, file: !76, line: 118, type: !52)
!215 = !DILocalVariable(name: "__n", arg: 2, scope: !208, file: !76, line: 118, type: !212)
!216 = !DILocalVariable(name: "__stream", arg: 3, scope: !208, file: !76, line: 118, type: !104)
!217 = !DILocation(line: 0, scope: !208)
!218 = !DILocation(line: 120, column: 10, scope: !208)
!219 = !DILocation(line: 120, column: 3, scope: !208)
!220 = distinct !DISubprogram(name: "feof_unlocked", scope: !76, file: !76, line: 128, type: !102, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !221)
!221 = !{!222}
!222 = !DILocalVariable(name: "__stream", arg: 1, scope: !220, file: !76, line: 128, type: !104)
!223 = !DILocation(line: 0, scope: !220)
!224 = !DILocation(line: 130, column: 10, scope: !220)
!225 = !DILocation(line: 130, column: 3, scope: !220)
!226 = distinct !DISubprogram(name: "ferror_unlocked", scope: !76, file: !76, line: 135, type: !102, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !227)
!227 = !{!228}
!228 = !DILocalVariable(name: "__stream", arg: 1, scope: !226, file: !76, line: 135, type: !104)
!229 = !DILocation(line: 0, scope: !226)
!230 = !DILocation(line: 137, column: 10, scope: !226)
!231 = !DILocation(line: 137, column: 3, scope: !226)
!232 = distinct !DISubprogram(name: "tolower", scope: !233, file: !233, line: 207, type: !178, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !234)
!233 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!234 = !{!235}
!235 = !DILocalVariable(name: "__c", arg: 1, scope: !232, file: !233, line: 207, type: !51)
!236 = !DILocation(line: 0, scope: !232)
!237 = !DILocation(line: 209, column: 22, scope: !232)
!238 = !DILocation(line: 209, column: 39, scope: !232)
!239 = !DILocation(line: 209, column: 38, scope: !232)
!240 = !DILocation(line: 209, column: 37, scope: !232)
!241 = !DILocation(line: 209, column: 10, scope: !232)
!242 = !DILocation(line: 209, column: 3, scope: !232)
!243 = distinct !DISubprogram(name: "toupper", scope: !233, file: !233, line: 213, type: !178, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !244)
!244 = !{!245}
!245 = !DILocalVariable(name: "__c", arg: 1, scope: !243, file: !233, line: 213, type: !51)
!246 = !DILocation(line: 0, scope: !243)
!247 = !DILocation(line: 215, column: 22, scope: !243)
!248 = !DILocation(line: 215, column: 39, scope: !243)
!249 = !DILocation(line: 215, column: 38, scope: !243)
!250 = !DILocation(line: 215, column: 37, scope: !243)
!251 = !DILocation(line: 215, column: 10, scope: !243)
!252 = !DILocation(line: 215, column: 3, scope: !243)
!253 = distinct !DISubprogram(name: "atoi", scope: !254, file: !254, line: 361, type: !255, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !257)
!254 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!255 = !DISubroutineType(types: !256)
!256 = !{!51, !56}
!257 = !{!258}
!258 = !DILocalVariable(name: "__nptr", arg: 1, scope: !253, file: !254, line: 361, type: !56)
!259 = !DILocation(line: 0, scope: !253)
!260 = !DILocation(line: 363, column: 16, scope: !253)
!261 = !DILocation(line: 363, column: 10, scope: !253)
!262 = !DILocation(line: 363, column: 3, scope: !253)
!263 = distinct !DISubprogram(name: "atol", scope: !254, file: !254, line: 366, type: !264, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !266)
!264 = !DISubroutineType(types: !265)
!265 = !{!132, !56}
!266 = !{!267}
!267 = !DILocalVariable(name: "__nptr", arg: 1, scope: !263, file: !254, line: 366, type: !56)
!268 = !DILocation(line: 0, scope: !263)
!269 = !DILocation(line: 368, column: 10, scope: !263)
!270 = !DILocation(line: 368, column: 3, scope: !263)
!271 = distinct !DISubprogram(name: "atoll", scope: !254, file: !254, line: 373, type: !272, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !275)
!272 = !DISubroutineType(types: !273)
!273 = !{!274, !56}
!274 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!275 = !{!276}
!276 = !DILocalVariable(name: "__nptr", arg: 1, scope: !271, file: !254, line: 373, type: !56)
!277 = !DILocation(line: 0, scope: !271)
!278 = !DILocation(line: 375, column: 10, scope: !271)
!279 = !DILocation(line: 375, column: 3, scope: !271)
!280 = distinct !DISubprogram(name: "bsearch", scope: !281, file: !281, line: 20, type: !282, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !290)
!281 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!282 = !DISubroutineType(types: !283)
!283 = !{!55, !284, !284, !155, !155, !286}
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !254, line: 808, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{!51, !284, !284}
!290 = !{!291, !292, !293, !294, !295, !296, !297, !298, !299, !300}
!291 = !DILocalVariable(name: "__key", arg: 1, scope: !280, file: !281, line: 20, type: !284)
!292 = !DILocalVariable(name: "__base", arg: 2, scope: !280, file: !281, line: 20, type: !284)
!293 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !280, file: !281, line: 20, type: !155)
!294 = !DILocalVariable(name: "__size", arg: 4, scope: !280, file: !281, line: 20, type: !155)
!295 = !DILocalVariable(name: "__compar", arg: 5, scope: !280, file: !281, line: 21, type: !286)
!296 = !DILocalVariable(name: "__l", scope: !280, file: !281, line: 23, type: !155)
!297 = !DILocalVariable(name: "__u", scope: !280, file: !281, line: 23, type: !155)
!298 = !DILocalVariable(name: "__idx", scope: !280, file: !281, line: 23, type: !155)
!299 = !DILocalVariable(name: "__p", scope: !280, file: !281, line: 24, type: !284)
!300 = !DILocalVariable(name: "__comparison", scope: !280, file: !281, line: 25, type: !51)
!301 = !DILocation(line: 0, scope: !280)
!302 = !DILocation(line: 29, column: 3, scope: !280)
!303 = !DILocation(line: 27, column: 7, scope: !280)
!304 = !DILocation(line: 29, column: 14, scope: !280)
!305 = !DILocation(line: 31, column: 20, scope: !306)
!306 = distinct !DILexicalBlock(scope: !280, file: !281, line: 30, column: 5)
!307 = !DILocation(line: 31, column: 27, scope: !306)
!308 = !DILocation(line: 32, column: 56, scope: !306)
!309 = !DILocation(line: 32, column: 47, scope: !306)
!310 = !DILocation(line: 33, column: 22, scope: !306)
!311 = !DILocation(line: 34, column: 24, scope: !312)
!312 = distinct !DILexicalBlock(scope: !306, file: !281, line: 34, column: 11)
!313 = !DILocation(line: 34, column: 11, scope: !306)
!314 = !DILocation(line: 36, column: 29, scope: !315)
!315 = distinct !DILexicalBlock(scope: !312, file: !281, line: 36, column: 16)
!316 = !DILocation(line: 36, column: 16, scope: !312)
!317 = !DILocation(line: 37, column: 14, scope: !315)
!318 = distinct !{!318, !302, !319}
!319 = !DILocation(line: 40, column: 5, scope: !280)
!320 = !DILocation(line: 43, column: 1, scope: !280)
!321 = distinct !DISubprogram(name: "atof", scope: !322, file: !322, line: 25, type: !323, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !326)
!322 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!323 = !DISubroutineType(types: !324)
!324 = !{!325, !56}
!325 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!326 = !{!327}
!327 = !DILocalVariable(name: "__nptr", arg: 1, scope: !321, file: !322, line: 25, type: !56)
!328 = !DILocation(line: 0, scope: !321)
!329 = !DILocation(line: 27, column: 10, scope: !321)
!330 = !DILocation(line: 27, column: 3, scope: !321)
!331 = distinct !DISubprogram(name: "strtoimax", scope: !332, file: !332, line: 324, type: !333, scopeLine: 326, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !339)
!332 = !DIFile(filename: "/usr/include/inttypes.h", directory: "")
!333 = !DISubroutineType(types: !334)
!334 = !{!335, !79, !338, !51}
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !336, line: 101, baseType: !337)
!336 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !131, line: 72, baseType: !132)
!338 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !52)
!339 = !{!340, !341, !342}
!340 = !DILocalVariable(name: "nptr", arg: 1, scope: !331, file: !332, line: 324, type: !79)
!341 = !DILocalVariable(name: "endptr", arg: 2, scope: !331, file: !332, line: 324, type: !338)
!342 = !DILocalVariable(name: "base", arg: 3, scope: !331, file: !332, line: 324, type: !51)
!343 = !DILocation(line: 0, scope: !331)
!344 = !DILocation(line: 327, column: 10, scope: !331)
!345 = !DILocation(line: 327, column: 3, scope: !331)
!346 = distinct !DISubprogram(name: "strtoumax", scope: !332, file: !332, line: 336, type: !347, scopeLine: 338, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !351)
!347 = !DISubroutineType(types: !348)
!348 = !{!349, !79, !338, !51}
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !336, line: 102, baseType: !350)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !131, line: 73, baseType: !157)
!351 = !{!352, !353, !354}
!352 = !DILocalVariable(name: "nptr", arg: 1, scope: !346, file: !332, line: 336, type: !79)
!353 = !DILocalVariable(name: "endptr", arg: 2, scope: !346, file: !332, line: 336, type: !338)
!354 = !DILocalVariable(name: "base", arg: 3, scope: !346, file: !332, line: 336, type: !51)
!355 = !DILocation(line: 0, scope: !346)
!356 = !DILocation(line: 339, column: 10, scope: !346)
!357 = !DILocation(line: 339, column: 3, scope: !346)
!358 = distinct !DISubprogram(name: "wcstoimax", scope: !332, file: !332, line: 348, type: !359, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !368)
!359 = !DISubroutineType(types: !360)
!360 = !{!335, !361, !365, !51}
!361 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gwchar_t", file: !332, line: 34, baseType: !51)
!365 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !366)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!368 = !{!369, !370, !371}
!369 = !DILocalVariable(name: "nptr", arg: 1, scope: !358, file: !332, line: 348, type: !361)
!370 = !DILocalVariable(name: "endptr", arg: 2, scope: !358, file: !332, line: 348, type: !365)
!371 = !DILocalVariable(name: "base", arg: 3, scope: !358, file: !332, line: 348, type: !51)
!372 = !DILocation(line: 0, scope: !358)
!373 = !DILocation(line: 351, column: 10, scope: !358)
!374 = !DILocation(line: 351, column: 3, scope: !358)
!375 = distinct !DISubprogram(name: "wcstoumax", scope: !332, file: !332, line: 362, type: !376, scopeLine: 364, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !378)
!376 = !DISubroutineType(types: !377)
!377 = !{!349, !361, !365, !51}
!378 = !{!379, !380, !381}
!379 = !DILocalVariable(name: "nptr", arg: 1, scope: !375, file: !332, line: 362, type: !361)
!380 = !DILocalVariable(name: "endptr", arg: 2, scope: !375, file: !332, line: 362, type: !365)
!381 = !DILocalVariable(name: "base", arg: 3, scope: !375, file: !332, line: 362, type: !51)
!382 = !DILocation(line: 0, scope: !375)
!383 = !DILocation(line: 365, column: 10, scope: !375)
!384 = !DILocation(line: 365, column: 3, scope: !375)
!385 = distinct !DISubprogram(name: "stat", scope: !386, file: !386, line: 453, type: !387, scopeLine: 454, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !426)
!386 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "")
!387 = !DISubroutineType(types: !388)
!388 = !{!51, !56, !389}
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !391, line: 46, size: 1152, elements: !392)
!391 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!392 = !{!393, !395, !397, !399, !401, !403, !405, !406, !407, !408, !410, !412, !420, !421, !422}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !390, file: !391, line: 48, baseType: !394, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !131, line: 145, baseType: !157)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !390, file: !391, line: 53, baseType: !396, size: 64, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !131, line: 148, baseType: !157)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !390, file: !391, line: 61, baseType: !398, size: 64, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !131, line: 151, baseType: !157)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !390, file: !391, line: 62, baseType: !400, size: 32, offset: 192)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !131, line: 150, baseType: !7)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !390, file: !391, line: 64, baseType: !402, size: 32, offset: 224)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !131, line: 146, baseType: !7)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !390, file: !391, line: 65, baseType: !404, size: 32, offset: 256)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !131, line: 147, baseType: !7)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !390, file: !391, line: 67, baseType: !51, size: 32, offset: 288)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !390, file: !391, line: 69, baseType: !394, size: 64, offset: 320)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !390, file: !391, line: 74, baseType: !130, size: 64, offset: 384)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !390, file: !391, line: 78, baseType: !409, size: 64, offset: 448)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !131, line: 174, baseType: !132)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !390, file: !391, line: 80, baseType: !411, size: 64, offset: 512)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !131, line: 179, baseType: !132)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !390, file: !391, line: 91, baseType: !413, size: 128, offset: 576)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !414, line: 10, size: 128, elements: !415)
!414 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!415 = !{!416, !418}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !413, file: !414, line: 12, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !131, line: 160, baseType: !132)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !413, file: !414, line: 16, baseType: !419, size: 64, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !131, line: 196, baseType: !132)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !390, file: !391, line: 92, baseType: !413, size: 128, offset: 704)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !390, file: !391, line: 93, baseType: !413, size: 128, offset: 832)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !390, file: !391, line: 106, baseType: !423, size: 192, offset: 960)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !419, size: 192, elements: !424)
!424 = !{!425}
!425 = !DISubrange(count: 3)
!426 = !{!427, !428}
!427 = !DILocalVariable(name: "__path", arg: 1, scope: !385, file: !386, line: 453, type: !56)
!428 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !385, file: !386, line: 453, type: !389)
!429 = !DILocation(line: 0, scope: !385)
!430 = !DILocation(line: 455, column: 10, scope: !385)
!431 = !DILocation(line: 455, column: 3, scope: !385)
!432 = distinct !DISubprogram(name: "lstat", scope: !386, file: !386, line: 460, type: !387, scopeLine: 461, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !433)
!433 = !{!434, !435}
!434 = !DILocalVariable(name: "__path", arg: 1, scope: !432, file: !386, line: 460, type: !56)
!435 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !432, file: !386, line: 460, type: !389)
!436 = !DILocation(line: 0, scope: !432)
!437 = !DILocation(line: 462, column: 10, scope: !432)
!438 = !DILocation(line: 462, column: 3, scope: !432)
!439 = distinct !DISubprogram(name: "fstat", scope: !386, file: !386, line: 467, type: !440, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !442)
!440 = !DISubroutineType(types: !441)
!441 = !{!51, !51, !389}
!442 = !{!443, !444}
!443 = !DILocalVariable(name: "__fd", arg: 1, scope: !439, file: !386, line: 467, type: !51)
!444 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !439, file: !386, line: 467, type: !389)
!445 = !DILocation(line: 0, scope: !439)
!446 = !DILocation(line: 469, column: 10, scope: !439)
!447 = !DILocation(line: 469, column: 3, scope: !439)
!448 = distinct !DISubprogram(name: "fstatat", scope: !386, file: !386, line: 474, type: !449, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !451)
!449 = !DISubroutineType(types: !450)
!450 = !{!51, !51, !56, !389, !51}
!451 = !{!452, !453, !454, !455}
!452 = !DILocalVariable(name: "__fd", arg: 1, scope: !448, file: !386, line: 474, type: !51)
!453 = !DILocalVariable(name: "__filename", arg: 2, scope: !448, file: !386, line: 474, type: !56)
!454 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !448, file: !386, line: 474, type: !389)
!455 = !DILocalVariable(name: "__flag", arg: 4, scope: !448, file: !386, line: 474, type: !51)
!456 = !DILocation(line: 0, scope: !448)
!457 = !DILocation(line: 477, column: 10, scope: !448)
!458 = !DILocation(line: 477, column: 3, scope: !448)
!459 = distinct !DISubprogram(name: "mknod", scope: !386, file: !386, line: 483, type: !460, scopeLine: 484, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !462)
!460 = !DISubroutineType(types: !461)
!461 = !{!51, !56, !400, !394}
!462 = !{!463, !464, !465}
!463 = !DILocalVariable(name: "__path", arg: 1, scope: !459, file: !386, line: 483, type: !56)
!464 = !DILocalVariable(name: "__mode", arg: 2, scope: !459, file: !386, line: 483, type: !400)
!465 = !DILocalVariable(name: "__dev", arg: 3, scope: !459, file: !386, line: 483, type: !394)
!466 = !DILocation(line: 0, scope: !459)
!467 = !DILocation(line: 485, column: 10, scope: !459)
!468 = !DILocation(line: 485, column: 3, scope: !459)
!469 = distinct !DISubprogram(name: "mknodat", scope: !386, file: !386, line: 491, type: !470, scopeLine: 493, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !472)
!470 = !DISubroutineType(types: !471)
!471 = !{!51, !51, !56, !400, !394}
!472 = !{!473, !474, !475, !476}
!473 = !DILocalVariable(name: "__fd", arg: 1, scope: !469, file: !386, line: 491, type: !51)
!474 = !DILocalVariable(name: "__path", arg: 2, scope: !469, file: !386, line: 491, type: !56)
!475 = !DILocalVariable(name: "__mode", arg: 3, scope: !469, file: !386, line: 491, type: !400)
!476 = !DILocalVariable(name: "__dev", arg: 4, scope: !469, file: !386, line: 491, type: !394)
!477 = !DILocation(line: 0, scope: !469)
!478 = !DILocation(line: 494, column: 10, scope: !469)
!479 = !DILocation(line: 494, column: 3, scope: !469)
!480 = distinct !DISubprogram(name: "stat64", scope: !386, file: !386, line: 502, type: !481, scopeLine: 503, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !503)
!481 = !DISubroutineType(types: !482)
!482 = !{!51, !56, !483}
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !391, line: 119, size: 1152, elements: !485)
!485 = !{!486, !487, !489, !490, !491, !492, !493, !494, !495, !496, !497, !499, !500, !501, !502}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !484, file: !391, line: 121, baseType: !394, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !484, file: !391, line: 123, baseType: !488, size: 64, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !131, line: 149, baseType: !157)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !484, file: !391, line: 124, baseType: !398, size: 64, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !484, file: !391, line: 125, baseType: !400, size: 32, offset: 192)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !484, file: !391, line: 132, baseType: !402, size: 32, offset: 224)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !484, file: !391, line: 133, baseType: !404, size: 32, offset: 256)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !484, file: !391, line: 135, baseType: !51, size: 32, offset: 288)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !484, file: !391, line: 136, baseType: !394, size: 64, offset: 320)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !484, file: !391, line: 137, baseType: !130, size: 64, offset: 384)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !484, file: !391, line: 143, baseType: !409, size: 64, offset: 448)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !484, file: !391, line: 144, baseType: !498, size: 64, offset: 512)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !131, line: 180, baseType: !132)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !484, file: !391, line: 152, baseType: !413, size: 128, offset: 576)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !484, file: !391, line: 153, baseType: !413, size: 128, offset: 704)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !484, file: !391, line: 154, baseType: !413, size: 128, offset: 832)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !484, file: !391, line: 164, baseType: !423, size: 192, offset: 960)
!503 = !{!504, !505}
!504 = !DILocalVariable(name: "__path", arg: 1, scope: !480, file: !386, line: 502, type: !56)
!505 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !480, file: !386, line: 502, type: !483)
!506 = !DILocation(line: 0, scope: !480)
!507 = !DILocation(line: 504, column: 10, scope: !480)
!508 = !DILocation(line: 504, column: 3, scope: !480)
!509 = distinct !DISubprogram(name: "lstat64", scope: !386, file: !386, line: 509, type: !481, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !510)
!510 = !{!511, !512}
!511 = !DILocalVariable(name: "__path", arg: 1, scope: !509, file: !386, line: 509, type: !56)
!512 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !509, file: !386, line: 509, type: !483)
!513 = !DILocation(line: 0, scope: !509)
!514 = !DILocation(line: 511, column: 10, scope: !509)
!515 = !DILocation(line: 511, column: 3, scope: !509)
!516 = distinct !DISubprogram(name: "fstat64", scope: !386, file: !386, line: 516, type: !517, scopeLine: 517, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !519)
!517 = !DISubroutineType(types: !518)
!518 = !{!51, !51, !483}
!519 = !{!520, !521}
!520 = !DILocalVariable(name: "__fd", arg: 1, scope: !516, file: !386, line: 516, type: !51)
!521 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !516, file: !386, line: 516, type: !483)
!522 = !DILocation(line: 0, scope: !516)
!523 = !DILocation(line: 518, column: 10, scope: !516)
!524 = !DILocation(line: 518, column: 3, scope: !516)
!525 = distinct !DISubprogram(name: "fstatat64", scope: !386, file: !386, line: 523, type: !526, scopeLine: 525, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !528)
!526 = !DISubroutineType(types: !527)
!527 = !{!51, !51, !56, !483, !51}
!528 = !{!529, !530, !531, !532}
!529 = !DILocalVariable(name: "__fd", arg: 1, scope: !525, file: !386, line: 523, type: !51)
!530 = !DILocalVariable(name: "__filename", arg: 2, scope: !525, file: !386, line: 523, type: !56)
!531 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !525, file: !386, line: 523, type: !483)
!532 = !DILocalVariable(name: "__flag", arg: 4, scope: !525, file: !386, line: 523, type: !51)
!533 = !DILocation(line: 0, scope: !525)
!534 = !DILocation(line: 526, column: 10, scope: !525)
!535 = !DILocation(line: 526, column: 3, scope: !525)
!536 = distinct !DISubprogram(name: "dbg_cnt_is_enabled", scope: !3, file: !3, line: 55, type: !537, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !539)
!537 = !DISubroutineType(types: !538)
!538 = !{!50, !5}
!539 = !{!540}
!540 = !DILocalVariable(name: "index", arg: 1, scope: !536, file: !3, line: 55, type: !5)
!541 = !DILocation(line: 0, scope: !536)
!542 = !DILocation(line: 57, column: 10, scope: !536)
!543 = !DILocation(line: 57, column: 26, scope: !536)
!544 = !DILocation(line: 57, column: 23, scope: !536)
!545 = !DILocation(line: 57, column: 3, scope: !536)
!546 = distinct !DISubprogram(name: "dbg_cnt", scope: !3, file: !3, line: 61, type: !537, scopeLine: 62, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !547)
!547 = !{!548}
!548 = !DILocalVariable(name: "index", arg: 1, scope: !546, file: !3, line: 61, type: !5)
!549 = !DILocation(line: 0, scope: !546)
!550 = !DILocation(line: 63, column: 3, scope: !546)
!551 = !DILocation(line: 63, column: 15, scope: !546)
!552 = !DILocation(line: 64, column: 7, scope: !553)
!553 = distinct !DILexicalBlock(scope: !546, file: !3, line: 64, column: 7)
!554 = !DILocation(line: 64, column: 17, scope: !553)
!555 = !DILocation(line: 64, column: 36, scope: !553)
!556 = !DILocation(line: 64, column: 33, scope: !553)
