; ModuleID = 'dbxout.bc'
source_filename = "dbxout.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.gcc_debug_hooks = type { void (i8*)*, void (i8*)*, void ()*, void (i32, i8*)*, void (i32, i8*)*, void (i32, i8*)*, void (i32)*, void (i32, i32)*, void (i32, i32)*, i8 (%union.tree_node*)*, void (i32, i8*, i32, i8)*, void (i32, i8*)*, void (i32, i8*)*, void (i32, i8*)*, void (%union.tree_node*)*, void (i32)*, void (%union.tree_node*)*, void (%union.tree_node*)*, void (%union.tree_node*, i32)*, void (%union.tree_node*, %union.tree_node*, %union.tree_node*, i8)*, void (%union.tree_node*)*, void (%union.tree_node*)*, void (%struct.rtx_def*)*, void (i32)*, void (%struct.rtx_def*)*, void ()*, void (%union.tree_node*)*, void (%union.tree_node*, i32)*, void (%struct.rtx_def*, %struct.rtx_def*)*, void (i32)*, void (%union.tree_node*, %union.tree_node*)*, i32 }
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }

!487 = !DIEnumerator(name: "FRACT_CONVERT", value: 107, isUnsigned: true)
!488 = !DIEnumerator(name: "UNSIGNED_FRACT_CONVERT", value: 108, isUnsigned: true)
!489 = !DIEnumerator(name: "SAT_FRACT", value: 109, isUnsigned: true)
!490 = !DIEnumerator(name: "UNSIGNED_SAT_FRACT", value: 110, isUnsigned: true)
!491 = !DIEnumerator(name: "ABS", value: 111, isUnsigned: true)
!492 = !DIEnumerator(name: "SQRT", value: 112, isUnsigned: true)
!493 = !DIEnumerator(name: "BSWAP", value: 113, isUnsigned: true)
!494 = !DIEnumerator(name: "FFS", value: 114, isUnsigned: true)
!495 = !DIEnumerator(name: "CLZ", value: 115, isUnsigned: true)
!496 = !DIEnumerator(name: "CTZ", value: 116, isUnsigned: true)
!497 = !DIEnumerator(name: "POPCOUNT", value: 117, isUnsigned: true)
!498 = !DIEnumerator(name: "PARITY", value: 118, isUnsigned: true)
!499 = !DIEnumerator(name: "SIGN_EXTRACT", value: 119, isUnsigned: true)
!500 = !DIEnumerator(name: "ZERO_EXTRACT", value: 120, isUnsigned: true)
!501 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!502 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!503 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!504 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!505 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!506 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!507 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!508 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!509 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!510 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!511 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!512 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!513 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!514 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!515 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!516 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!517 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!518 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!519 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!520 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "typestatus", file: !3, line: 165, baseType: !7, size: 32, elements: !521)
!521 = !{!522, !523, !524}
!522 = !DIEnumerator(name: "TYPE_UNSEEN", value: 0, isUnsigned: true)
!523 = !DIEnumerator(name: "TYPE_XREF", value: 1, isUnsigned: true)
!524 = !DIEnumerator(name: "TYPE_DEFINED", value: 2, isUnsigned: true)
!525 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "binclstatus", file: !3, line: 203, baseType: !7, size: 32, elements: !526)
!526 = !{!527, !528, !529}
!527 = !DIEnumerator(name: "BINCL_NOT_REQUIRED", value: 0, isUnsigned: true)
!528 = !DIEnumerator(name: "BINCL_PENDING", value: 1, isUnsigned: true)
!529 = !DIEnumerator(name: "BINCL_PROCESSED", value: 2, isUnsigned: true)
!530 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "expand_modifier", file: !531, line: 52, baseType: !7, size: 32, elements: !532)
!531 = !DIFile(filename: "./expr.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!532 = !{!533, !534, !535, !536, !537, !538, !539}
!533 = !DIEnumerator(name: "EXPAND_NORMAL", value: 0, isUnsigned: true)
!534 = !DIEnumerator(name: "EXPAND_STACK_PARM", value: 1, isUnsigned: true)
!535 = !DIEnumerator(name: "EXPAND_SUM", value: 2, isUnsigned: true)
!536 = !DIEnumerator(name: "EXPAND_CONST_ADDRESS", value: 3, isUnsigned: true)
!537 = !DIEnumerator(name: "EXPAND_INITIALIZER", value: 4, isUnsigned: true)
!538 = !DIEnumerator(name: "EXPAND_WRITE", value: 5, isUnsigned: true)
!539 = !DIEnumerator(name: "EXPAND_MEMORY", value: 6, isUnsigned: true)
!540 = !{!541, !542, !543, !544, !547, !548, !7, !550, !183, !377, !725, !1620, !1626, !1139, !1629, !1638, !1643, !1644, !606, !604, !545, !1646, !1145}
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!543 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !546)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !551, line: 56, baseType: !552)
!551 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !151, line: 3371, size: 1792, elements: !554)
!554 = !{!555, !588, !594, !607, !626, !637, !642, !651, !657, !670, !682, !720, !1000, !1028, !1036, !1037, !1042, !1051, !1057, !1062, !1066, !1070, !1246, !1293, !1299, !1306, !1313, !1339, !1364, !1381, !1393, !1415, !1430, !1602}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !553, file: !151, line: 3372, baseType: !556, size: 64)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !151, line: 360, size: 64, elements: !557)
!557 = !{!558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !556, file: !151, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !556, file: !151, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !556, file: !151, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !556, file: !151, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !556, file: !151, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !556, file: !151, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !556, file: !151, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !556, file: !151, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !556, file: !151, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !556, file: !151, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !556, file: !151, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !556, file: !151, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !556, file: !151, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !556, file: !151, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !556, file: !151, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !556, file: !151, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !556, file: !151, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !556, file: !151, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !556, file: !151, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !556, file: !151, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !556, file: !151, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !556, file: !151, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !556, file: !151, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !556, file: !151, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !556, file: !151, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !556, file: !151, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !556, file: !151, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !556, file: !151, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !556, file: !151, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !556, file: !151, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !553, file: !151, line: 3373, baseType: !589, size: 192)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !151, line: 402, size: 192, elements: !590)
!590 = !{!591, !592, !593}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !589, file: !151, line: 403, baseType: !556, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !589, file: !151, line: 404, baseType: !550, size: 64, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !589, file: !151, line: 405, baseType: !550, size: 64, offset: 128)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !553, file: !151, line: 3374, baseType: !595, size: 320)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !151, line: 1384, size: 320, elements: !596)
!596 = !{!597, !598}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !595, file: !151, line: 1385, baseType: !589, size: 192)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !595, file: !151, line: 1386, baseType: !599, size: 128, offset: 192)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !600, line: 58, baseType: !601)
!600 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !600, line: 54, size: 128, elements: !602)
!602 = !{!603, !605}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !601, file: !600, line: 56, baseType: !604, size: 64)
!604 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !601, file: !600, line: 57, baseType: !606, size: 64, offset: 64)
!606 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !553, file: !151, line: 3375, baseType: !608, size: 256)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !151, line: 1397, size: 256, elements: !609)
!609 = !{!610, !611}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !608, file: !151, line: 1398, baseType: !589, size: 192)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !608, file: !151, line: 1399, baseType: !612, size: 64, offset: 192)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !614, line: 52, size: 256, elements: !615)
!614 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!615 = !{!616, !617, !618, !619, !620, !621, !622}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !613, file: !614, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !613, file: !614, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !613, file: !614, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !613, file: !614, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !613, file: !614, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !613, file: !614, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !613, file: !614, line: 62, baseType: !623, size: 192, offset: 64)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !604, size: 192, elements: !624)
!624 = !{!625}
!625 = !DISubrange(count: 3)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !553, file: !151, line: 3376, baseType: !627, size: 256)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !151, line: 1408, size: 256, elements: !628)
!628 = !{!629, !630}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !627, file: !151, line: 1409, baseType: !589, size: 192)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !627, file: !151, line: 1410, baseType: !631, size: 64, offset: 192)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !633, line: 27, size: 192, elements: !634)
!633 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!634 = !{!635, !636}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !632, file: !633, line: 29, baseType: !599, size: 128)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !632, file: !633, line: 30, baseType: !5, size: 32, offset: 128)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !553, file: !151, line: 3377, baseType: !638, size: 256)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !151, line: 1437, size: 256, elements: !639)
!639 = !{!640, !641}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !638, file: !151, line: 1438, baseType: !589, size: 192)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !638, file: !151, line: 1439, baseType: !550, size: 64, offset: 192)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !553, file: !151, line: 3378, baseType: !643, size: 256)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !151, line: 1418, size: 256, elements: !644)
!644 = !{!645, !646, !647}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !643, file: !151, line: 1419, baseType: !589, size: 192)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !643, file: !151, line: 1420, baseType: !543, size: 32, offset: 192)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !643, file: !151, line: 1421, baseType: !648, size: 8, offset: 224)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 8, elements: !649)
!649 = !{!650}
!650 = !DISubrange(count: 1)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !553, file: !151, line: 3379, baseType: !652, size: 320)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !151, line: 1428, size: 320, elements: !653)
!653 = !{!654, !655, !656}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !652, file: !151, line: 1429, baseType: !589, size: 192)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !652, file: !151, line: 1430, baseType: !550, size: 64, offset: 192)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !652, file: !151, line: 1431, baseType: !550, size: 64, offset: 256)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !553, file: !151, line: 3380, baseType: !658, size: 320)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !151, line: 1460, size: 320, elements: !659)
!659 = !{!660, !661}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !658, file: !151, line: 1461, baseType: !589, size: 192)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !658, file: !151, line: 1462, baseType: !662, size: 128, offset: 192)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !663, line: 31, size: 128, elements: !664)
!663 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!664 = !{!665, !668, !669}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !662, file: !663, line: 32, baseType: !666, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !542)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !662, file: !663, line: 33, baseType: !7, size: 32, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !662, file: !663, line: 34, baseType: !7, size: 32, offset: 96)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !553, file: !151, line: 3381, baseType: !671, size: 384)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !151, line: 2507, size: 384, elements: !672)
!672 = !{!673, !674, !679, !680, !681}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !671, file: !151, line: 2508, baseType: !589, size: 192)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !671, file: !151, line: 2509, baseType: !675, size: 32, offset: 192)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !676, line: 58, baseType: !677)
!676 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !678, line: 44, baseType: !7)
!678 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!679 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !671, file: !151, line: 2510, baseType: !7, size: 32, offset: 224)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !671, file: !151, line: 2511, baseType: !550, size: 64, offset: 256)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !671, file: !151, line: 2512, baseType: !550, size: 64, offset: 320)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !553, file: !151, line: 3382, baseType: !683, size: 896)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !151, line: 2652, size: 896, elements: !684)
!684 = !{!685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !683, file: !151, line: 2653, baseType: !671, size: 384)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !683, file: !151, line: 2654, baseType: !550, size: 64, offset: 384)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !683, file: !151, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !683, file: !151, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !683, file: !151, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !683, file: !151, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !683, file: !151, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !683, file: !151, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !683, file: !151, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !683, file: !151, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !683, file: !151, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !683, file: !151, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !683, file: !151, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !683, file: !151, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !683, file: !151, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !683, file: !151, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !683, file: !151, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !683, file: !151, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !683, file: !151, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !683, file: !151, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !683, file: !151, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !683, file: !151, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !683, file: !151, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !683, file: !151, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !683, file: !151, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !683, file: !151, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !683, file: !151, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !683, file: !151, line: 2703, baseType: !7, size: 32, offset: 512)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !683, file: !151, line: 2705, baseType: !550, size: 64, offset: 576)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !683, file: !151, line: 2706, baseType: !550, size: 64, offset: 640)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !683, file: !151, line: 2707, baseType: !550, size: 64, offset: 704)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !683, file: !151, line: 2708, baseType: !550, size: 64, offset: 768)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !683, file: !151, line: 2711, baseType: !718, size: 64, offset: 832)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !151, line: 2711, flags: DIFlagFwdDecl)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !553, file: !151, line: 3383, baseType: !721, size: 960)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !151, line: 2756, size: 960, elements: !722)
!722 = !{!723, !724}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !721, file: !151, line: 2757, baseType: !683, size: 896)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !721, file: !151, line: 2758, baseType: !725, size: 64, offset: 896)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !551, line: 50, baseType: !726)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !378, line: 240, size: 384, elements: !728)
!728 = !{!729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !727, file: !378, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !727, file: !378, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !727, file: !378, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !727, file: !378, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !727, file: !378, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !727, file: !378, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !727, file: !378, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !727, file: !378, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !727, file: !378, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !727, file: !378, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !727, file: !378, line: 321, baseType: !740, size: 320, offset: 64)
!740 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !378, line: 315, size: 320, elements: !741)
!741 = !{!742, !933, !935, !998, !999}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !740, file: !378, line: 316, baseType: !743, size: 64)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !744, size: 64, elements: !649)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !378, line: 183, baseType: !745)
!745 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !378, line: 166, size: 64, elements: !746)
!746 = !{!747, !748, !749, !750, !751, !759, !760, !772, !775, !835, !836, !910, !923, !930}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !745, file: !378, line: 168, baseType: !543, size: 32)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !745, file: !378, line: 169, baseType: !7, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !745, file: !378, line: 170, baseType: !548, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !745, file: !378, line: 171, baseType: !725, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !745, file: !378, line: 172, baseType: !752, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !551, line: 53, baseType: !753)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !378, line: 359, size: 128, elements: !755)
!755 = !{!756, !757}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !754, file: !378, line: 360, baseType: !543, size: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !754, file: !378, line: 361, baseType: !758, size: 64, offset: 64)
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !725, size: 64, elements: !649)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !745, file: !378, line: 173, baseType: !5, size: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !745, file: !378, line: 174, baseType: !761, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !378, line: 133, baseType: !762)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !378, line: 115, size: 32, elements: !763)
!763 = !{!764, !765, !766, !767, !768, !769, !770, !771}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !762, file: !378, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !762, file: !378, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !762, file: !378, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !762, file: !378, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !762, file: !378, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !762, file: !378, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !762, file: !378, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !762, file: !378, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !745, file: !378, line: 175, baseType: !773, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !378, line: 175, flags: DIFlagFwdDecl)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !745, file: !378, line: 176, baseType: !776, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !778, line: 75, size: 256, elements: !779)
!778 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!779 = !{!780, !794, !795, !796}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !777, file: !778, line: 76, baseType: !781, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !778, line: 68, baseType: !783)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !778, line: 63, size: 320, elements: !784)
!784 = !{!785, !787, !788, !789}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !783, file: !778, line: 64, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !783, file: !778, line: 65, baseType: !786, size: 64, offset: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !783, file: !778, line: 66, baseType: !7, size: 32, offset: 128)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !783, file: !778, line: 67, baseType: !790, size: 128, offset: 192)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !791, size: 128, elements: !792)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !778, line: 29, baseType: !604)
!792 = !{!793}
!793 = !DISubrange(count: 2)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !777, file: !778, line: 77, baseType: !781, size: 64, offset: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !777, file: !778, line: 78, baseType: !7, size: 32, offset: 128)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !777, file: !778, line: 79, baseType: !797, size: 64, offset: 192)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !778, line: 49, baseType: !799)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !778, line: 45, size: 832, elements: !800)
!800 = !{!801, !802, !803}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !799, file: !778, line: 46, baseType: !786, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !799, file: !778, line: 47, baseType: !776, size: 64, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !799, file: !778, line: 48, baseType: !804, size: 704, offset: 128)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !805, line: 164, size: 704, elements: !806)
!805 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!806 = !{!807, !808, !818, !819, !820, !821, !822, !823, !827, !831, !832, !833, !834}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !804, file: !805, line: 166, baseType: !606, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !804, file: !805, line: 167, baseType: !809, size: 64, offset: 64)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !805, line: 157, size: 192, elements: !811)
!811 = !{!812, !813, !814}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !810, file: !805, line: 159, baseType: !545, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !810, file: !805, line: 160, baseType: !809, size: 64, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !810, file: !805, line: 161, baseType: !815, size: 32, offset: 128)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 32, elements: !816)
!816 = !{!817}
!817 = !DISubrange(count: 4)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !804, file: !805, line: 168, baseType: !545, size: 64, offset: 128)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !804, file: !805, line: 169, baseType: !545, size: 64, offset: 192)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !804, file: !805, line: 170, baseType: !545, size: 64, offset: 256)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !804, file: !805, line: 171, baseType: !606, size: 64, offset: 320)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !804, file: !805, line: 172, baseType: !543, size: 32, offset: 384)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !804, file: !805, line: 176, baseType: !824, size: 64, offset: 448)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DISubroutineType(types: !826)
!826 = !{!809, !547, !606}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !804, file: !805, line: 177, baseType: !828, size: 64, offset: 512)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DISubroutineType(types: !830)
!830 = !{null, !547, !809}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !804, file: !805, line: 178, baseType: !547, size: 64, offset: 576)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !804, file: !805, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !804, file: !805, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !804, file: !805, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !745, file: !378, line: 177, baseType: !550, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !745, file: !378, line: 178, baseType: !837, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !135, line: 217, size: 832, elements: !839)
!839 = !{!840, !875, !876, !877, !880, !884, !885, !886, !904, !905, !906, !907, !908, !909}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !838, file: !135, line: 219, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !135, line: 151, baseType: !843)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !135, line: 151, size: 128, elements: !844)
!844 = !{!845}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !843, file: !135, line: 151, baseType: !846, size: 128)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !135, line: 150, baseType: !847)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !135, line: 150, size: 128, elements: !848)
!848 = !{!849, !850, !851}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !847, file: !135, line: 150, baseType: !7, size: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !847, file: !135, line: 150, baseType: !7, size: 32, offset: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !847, file: !135, line: 150, baseType: !852, size: 64, offset: 64)
!852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !853, size: 64, elements: !649)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !551, line: 108, baseType: !854)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !135, line: 122, size: 512, elements: !856)
!856 = !{!857, !858, !859, !867, !868, !869, !870, !871, !872, !873}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !855, file: !135, line: 124, baseType: !837, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !855, file: !135, line: 125, baseType: !837, size: 64, offset: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !855, file: !135, line: 131, baseType: !860, size: 64, offset: 128)
!860 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !135, line: 128, size: 64, elements: !861)
!861 = !{!862, !866}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !860, file: !135, line: 129, baseType: !863, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !551, line: 66, baseType: !864)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !551, line: 65, flags: DIFlagFwdDecl)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !860, file: !135, line: 130, baseType: !725, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !855, file: !135, line: 134, baseType: !547, size: 64, offset: 192)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !855, file: !135, line: 137, baseType: !550, size: 64, offset: 256)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !855, file: !135, line: 138, baseType: !675, size: 32, offset: 320)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !855, file: !135, line: 142, baseType: !7, size: 32, offset: 352)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !855, file: !135, line: 144, baseType: !543, size: 32, offset: 384)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !855, file: !135, line: 145, baseType: !543, size: 32, offset: 416)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !855, file: !135, line: 146, baseType: !874, size: 64, offset: 448)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !135, line: 119, baseType: !606)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !838, file: !135, line: 220, baseType: !841, size: 64, offset: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !838, file: !135, line: 223, baseType: !547, size: 64, offset: 128)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !838, file: !135, line: 226, baseType: !878, size: 64, offset: 192)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !135, line: 185, flags: DIFlagFwdDecl)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !838, file: !135, line: 229, baseType: !881, size: 128, offset: 256)
!881 = !DICompositeType(tag: DW_TAG_array_type, baseType: !882, size: 128, elements: !792)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !135, line: 229, flags: DIFlagFwdDecl)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !838, file: !135, line: 232, baseType: !837, size: 64, offset: 384)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !838, file: !135, line: 233, baseType: !837, size: 64, offset: 448)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !838, file: !135, line: 238, baseType: !887, size: 64, offset: 512)
!887 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !135, line: 235, size: 64, elements: !888)
!888 = !{!889, !895}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !887, file: !135, line: 236, baseType: !890, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !135, line: 273, size: 128, elements: !892)
!892 = !{!893, !894}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !891, file: !135, line: 275, baseType: !863, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !891, file: !135, line: 278, baseType: !863, size: 64, offset: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !887, file: !135, line: 237, baseType: !896, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !135, line: 259, size: 320, elements: !898)
!898 = !{!899, !900, !901, !902, !903}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !897, file: !135, line: 261, baseType: !725, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !897, file: !135, line: 262, baseType: !725, size: 64, offset: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !897, file: !135, line: 266, baseType: !725, size: 64, offset: 128)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !897, file: !135, line: 267, baseType: !725, size: 64, offset: 192)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !897, file: !135, line: 270, baseType: !543, size: 32, offset: 256)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !838, file: !135, line: 241, baseType: !874, size: 64, offset: 576)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !838, file: !135, line: 244, baseType: !543, size: 32, offset: 640)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !838, file: !135, line: 247, baseType: !543, size: 32, offset: 672)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !838, file: !135, line: 250, baseType: !543, size: 32, offset: 704)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !838, file: !135, line: 253, baseType: !543, size: 32, offset: 736)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !838, file: !135, line: 256, baseType: !543, size: 32, offset: 768)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !745, file: !378, line: 179, baseType: !911, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !378, line: 150, baseType: !913)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !378, line: 142, size: 320, elements: !914)
!914 = !{!915, !916, !917, !918, !921, !922}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !913, file: !378, line: 144, baseType: !550, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !913, file: !378, line: 145, baseType: !725, size: 64, offset: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !913, file: !378, line: 146, baseType: !725, size: 64, offset: 128)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !913, file: !378, line: 147, baseType: !919, size: 32, offset: 192)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !920, line: 31, baseType: !543)
!920 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!921 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !913, file: !378, line: 148, baseType: !7, size: 32, offset: 224)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !913, file: !378, line: 149, baseType: !542, size: 8, offset: 256)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !745, file: !378, line: 180, baseType: !924, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !378, line: 162, baseType: !926)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !378, line: 159, size: 128, elements: !927)
!927 = !{!928, !929}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !926, file: !378, line: 160, baseType: !550, size: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !926, file: !378, line: 161, baseType: !606, size: 64, offset: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !745, file: !378, line: 181, baseType: !931, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !378, line: 181, flags: DIFlagFwdDecl)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !740, file: !378, line: 317, baseType: !934, size: 64)
!934 = !DICompositeType(tag: DW_TAG_array_type, baseType: !606, size: 64, elements: !649)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !740, file: !378, line: 318, baseType: !936, size: 320)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !378, line: 188, size: 320, elements: !937)
!937 = !{!938, !940, !997}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !936, file: !378, line: 190, baseType: !939, size: 192)
!939 = !DICompositeType(tag: DW_TAG_array_type, baseType: !744, size: 192, elements: !624)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !936, file: !378, line: 193, baseType: !941, size: 64, offset: 192)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !378, line: 206, size: 320, elements: !943)
!943 = !{!944, !982, !983, !984, !996}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !942, file: !378, line: 208, baseType: !945, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !551, line: 62, baseType: !947)
!947 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !948, line: 538, size: 256, elements: !949)
!948 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!949 = !{!950, !954, !960, !973}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !947, file: !948, line: 539, baseType: !951, size: 32)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !948, line: 482, size: 32, elements: !952)
!952 = !{!953}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !951, file: !948, line: 484, baseType: !7, size: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !947, file: !948, line: 540, baseType: !955, size: 192)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !948, line: 488, size: 192, elements: !956)
!956 = !{!957, !958, !959}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !955, file: !948, line: 489, baseType: !951, size: 32)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !955, file: !948, line: 492, baseType: !548, size: 64, offset: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !955, file: !948, line: 496, baseType: !550, size: 64, offset: 128)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !947, file: !948, line: 541, baseType: !961, size: 256)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !948, line: 504, size: 256, elements: !962)
!962 = !{!963, !964, !971, !972}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !961, file: !948, line: 505, baseType: !951, size: 32)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !961, file: !948, line: 509, baseType: !965, size: 64, offset: 64)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !948, line: 501, baseType: !966)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{null, !969}
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !961, file: !948, line: 510, baseType: !969, size: 64, offset: 128)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !961, file: !948, line: 513, baseType: !945, size: 64, offset: 192)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !947, file: !948, line: 542, baseType: !974, size: 128)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !948, line: 530, size: 128, elements: !975)
!975 = !{!976, !977}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !974, file: !948, line: 531, baseType: !951, size: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !974, file: !948, line: 534, baseType: !978, size: 64, offset: 64)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !948, line: 525, baseType: !979)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!542, !550, !548, !604, !604}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !942, file: !378, line: 211, baseType: !7, size: 32, offset: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !942, file: !378, line: 214, baseType: !606, size: 64, offset: 128)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !942, file: !378, line: 224, baseType: !985, size: 64, offset: 192)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !378, line: 202, baseType: !987)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !378, line: 202, size: 128, elements: !988)
!988 = !{!989}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !987, file: !378, line: 202, baseType: !990, size: 128)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !378, line: 200, baseType: !991)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !378, line: 200, size: 128, elements: !992)
!992 = !{!993, !994, !995}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !991, file: !378, line: 200, baseType: !7, size: 32)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !991, file: !378, line: 200, baseType: !7, size: 32, offset: 32)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !991, file: !378, line: 200, baseType: !758, size: 64, offset: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !942, file: !378, line: 234, baseType: !985, size: 64, offset: 256)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !936, file: !378, line: 197, baseType: !606, size: 64, offset: 256)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !740, file: !378, line: 319, baseType: !613, size: 256)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !740, file: !378, line: 320, baseType: !632, size: 192)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !553, file: !151, line: 3384, baseType: !1001, size: 1472)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !151, line: 3114, size: 1472, elements: !1002)
!1002 = !{!1003, !1024, !1025, !1026, !1027}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1001, file: !151, line: 3115, baseType: !1004, size: 1216)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !151, line: 2984, size: 1216, elements: !1005)
!1005 = !{!1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1004, file: !151, line: 2985, baseType: !721, size: 960)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1004, file: !151, line: 2986, baseType: !550, size: 64, offset: 960)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1004, file: !151, line: 2987, baseType: !550, size: 64, offset: 1024)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1004, file: !151, line: 2988, baseType: !550, size: 64, offset: 1088)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1004, file: !151, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1004, file: !151, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1004, file: !151, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1004, file: !151, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1004, file: !151, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1004, file: !151, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1004, file: !151, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1004, file: !151, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1004, file: !151, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1004, file: !151, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1004, file: !151, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1004, file: !151, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1004, file: !151, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1004, file: !151, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1001, file: !151, line: 3117, baseType: !550, size: 64, offset: 1216)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1001, file: !151, line: 3119, baseType: !550, size: 64, offset: 1280)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1001, file: !151, line: 3121, baseType: !550, size: 64, offset: 1344)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1001, file: !151, line: 3123, baseType: !550, size: 64, offset: 1408)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !553, file: !151, line: 3385, baseType: !1029, size: 1088)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !151, line: 2874, size: 1088, elements: !1030)
!1030 = !{!1031, !1032, !1033}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1029, file: !151, line: 2875, baseType: !721, size: 960)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1029, file: !151, line: 2876, baseType: !725, size: 64, offset: 960)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1029, file: !151, line: 2877, baseType: !1034, size: 64, offset: 1024)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !151, line: 2856, flags: DIFlagFwdDecl)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !553, file: !151, line: 3386, baseType: !1004, size: 1216)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !553, file: !151, line: 3387, baseType: !1038, size: 1280)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !151, line: 3093, size: 1280, elements: !1039)
!1039 = !{!1040, !1041}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1038, file: !151, line: 3094, baseType: !1004, size: 1216)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1038, file: !151, line: 3095, baseType: !1034, size: 64, offset: 1216)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !553, file: !151, line: 3388, baseType: !1043, size: 1216)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !151, line: 2824, size: 1216, elements: !1044)
!1044 = !{!1045, !1046, !1047, !1048, !1049, !1050}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1043, file: !151, line: 2825, baseType: !683, size: 896)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1043, file: !151, line: 2827, baseType: !550, size: 64, offset: 896)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1043, file: !151, line: 2828, baseType: !550, size: 64, offset: 960)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1043, file: !151, line: 2829, baseType: !550, size: 64, offset: 1024)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1043, file: !151, line: 2830, baseType: !550, size: 64, offset: 1088)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1043, file: !151, line: 2831, baseType: !550, size: 64, offset: 1152)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !553, file: !151, line: 3389, baseType: !1052, size: 1024)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !151, line: 2850, size: 1024, elements: !1053)
!1053 = !{!1054, !1055, !1056}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1052, file: !151, line: 2851, baseType: !721, size: 960)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1052, file: !151, line: 2852, baseType: !543, size: 32, offset: 960)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1052, file: !151, line: 2853, baseType: !543, size: 32, offset: 992)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !553, file: !151, line: 3390, baseType: !1058, size: 1024)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !151, line: 2857, size: 1024, elements: !1059)
!1059 = !{!1060, !1061}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1058, file: !151, line: 2858, baseType: !721, size: 960)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1058, file: !151, line: 2859, baseType: !1034, size: 64, offset: 960)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !553, file: !151, line: 3391, baseType: !1063, size: 960)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !151, line: 2862, size: 960, elements: !1064)
!1064 = !{!1065}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1063, file: !151, line: 2863, baseType: !721, size: 960)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !553, file: !151, line: 3392, baseType: !1067, size: 1472)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !151, line: 3304, size: 1472, elements: !1068)
!1068 = !{!1069}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1067, file: !151, line: 3305, baseType: !1001, size: 1472)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !553, file: !151, line: 3393, baseType: !1071, size: 1792)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !151, line: 3248, size: 1792, elements: !1072)
!1072 = !{!1073, !1074, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1071, file: !151, line: 3249, baseType: !1001, size: 1472)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1071, file: !151, line: 3251, baseType: !1075, size: 64, offset: 1472)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1077, line: 463, size: 1152, elements: !1078)
!1077 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1078 = !{!1079, !1082, !1113, !1114, !1117, !1120, !1170, !1171, !1172, !1173, !1174, !1198, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1076, file: !1077, line: 464, baseType: !1080, size: 64)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1077, line: 464, flags: DIFlagFwdDecl)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1076, file: !1077, line: 467, baseType: !1083, size: 64, offset: 64)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64)
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !135, line: 374, size: 640, elements: !1085)
!1085 = !{!1086, !1088, !1089, !1102, !1103, !1104, !1105, !1106, !1107, !1109, !1111, !1112}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1084, file: !135, line: 377, baseType: !1087, size: 64)
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !551, line: 111, baseType: !837)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1084, file: !135, line: 378, baseType: !1087, size: 64, offset: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1084, file: !135, line: 381, baseType: !1090, size: 64, offset: 128)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !135, line: 282, baseType: !1092)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !135, line: 282, size: 128, elements: !1093)
!1093 = !{!1094}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1092, file: !135, line: 282, baseType: !1095, size: 128)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !135, line: 281, baseType: !1096)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !135, line: 281, size: 128, elements: !1097)
!1097 = !{!1098, !1099, !1100}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1096, file: !135, line: 281, baseType: !7, size: 32)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1096, file: !135, line: 281, baseType: !7, size: 32, offset: 32)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1096, file: !135, line: 281, baseType: !1101, size: 64, offset: 64)
!1101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1087, size: 64, elements: !649)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1084, file: !135, line: 384, baseType: !543, size: 32, offset: 192)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1084, file: !135, line: 387, baseType: !543, size: 32, offset: 224)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1084, file: !135, line: 390, baseType: !543, size: 32, offset: 256)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1084, file: !135, line: 394, baseType: !1090, size: 64, offset: 320)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1084, file: !135, line: 396, baseType: !134, size: 32, offset: 384)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1084, file: !135, line: 399, baseType: !1108, size: 64, offset: 416)
!1108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 64, elements: !792)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1084, file: !135, line: 402, baseType: !1110, size: 64, offset: 480)
!1110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !792)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1084, file: !135, line: 406, baseType: !543, size: 32, offset: 544)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1084, file: !135, line: 409, baseType: !543, size: 32, offset: 576)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1076, file: !1077, line: 470, baseType: !864, size: 64, offset: 128)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1076, file: !1077, line: 473, baseType: !1115, size: 64, offset: 192)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1077, line: 166, flags: DIFlagFwdDecl)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1076, file: !1077, line: 476, baseType: !1118, size: 64, offset: 256)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64)
!1119 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1077, line: 476, flags: DIFlagFwdDecl)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1076, file: !1077, line: 479, baseType: !1121, size: 64, offset: 320)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1122, line: 144, baseType: !1123)
!1122 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1122, line: 100, size: 896, elements: !1125)
!1125 = !{!1126, !1132, !1137, !1142, !1144, !1147, !1148, !1149, !1150, !1151, !1156, !1158, !1159, !1164, !1169}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1124, file: !1122, line: 102, baseType: !1127, size: 64)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1122, line: 52, baseType: !1128)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64)
!1129 = !DISubroutineType(types: !1130)
!1130 = !{!1131, !969}
!1131 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1122, line: 47, baseType: !7)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1124, file: !1122, line: 105, baseType: !1133, size: 64, offset: 64)
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1122, line: 59, baseType: !1134)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64)
!1135 = !DISubroutineType(types: !1136)
!1136 = !{!543, !969, !969}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1124, file: !1122, line: 108, baseType: !1138, size: 64, offset: 128)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1122, line: 63, baseType: !1139)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64)
!1140 = !DISubroutineType(types: !1141)
!1141 = !{null, !547}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1124, file: !1122, line: 111, baseType: !1143, size: 64, offset: 192)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1124, file: !1122, line: 114, baseType: !1145, size: 64, offset: 256)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1146, line: 46, baseType: !604)
!1146 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1124, file: !1122, line: 117, baseType: !1145, size: 64, offset: 320)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1124, file: !1122, line: 120, baseType: !1145, size: 64, offset: 384)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1124, file: !1122, line: 124, baseType: !7, size: 32, offset: 448)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1124, file: !1122, line: 128, baseType: !7, size: 32, offset: 480)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1124, file: !1122, line: 131, baseType: !1152, size: 64, offset: 512)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1122, line: 75, baseType: !1153)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64)
!1154 = !DISubroutineType(types: !1155)
!1155 = !{!547, !1145, !1145}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1124, file: !1122, line: 132, baseType: !1157, size: 64, offset: 576)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1122, line: 78, baseType: !1139)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1124, file: !1122, line: 135, baseType: !547, size: 64, offset: 640)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1124, file: !1122, line: 136, baseType: !1160, size: 64, offset: 704)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1122, line: 82, baseType: !1161)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64)
!1162 = !DISubroutineType(types: !1163)
!1163 = !{!547, !547, !1145, !1145}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1124, file: !1122, line: 137, baseType: !1165, size: 64, offset: 768)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1122, line: 83, baseType: !1166)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64)
!1167 = !DISubroutineType(types: !1168)
!1168 = !{null, !547, !547}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1124, file: !1122, line: 141, baseType: !7, size: 32, offset: 832)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1076, file: !1077, line: 484, baseType: !550, size: 64, offset: 384)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1076, file: !1077, line: 488, baseType: !550, size: 64, offset: 448)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1076, file: !1077, line: 493, baseType: !550, size: 64, offset: 512)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1076, file: !1077, line: 496, baseType: !550, size: 64, offset: 576)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1076, file: !1077, line: 501, baseType: !1175, size: 64, offset: 640)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !146, line: 2355, size: 576, elements: !1177)
!1177 = !{!1178, !1181, !1182, !1183, !1184, !1186, !1187, !1192, !1193, !1194, !1195, !1196, !1197}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1176, file: !146, line: 2356, baseType: !1179, size: 64)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64)
!1180 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !146, line: 2356, flags: DIFlagFwdDecl)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1176, file: !146, line: 2357, baseType: !548, size: 64, offset: 64)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1176, file: !146, line: 2358, baseType: !543, size: 32, offset: 128)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1176, file: !146, line: 2359, baseType: !543, size: 32, offset: 160)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1176, file: !146, line: 2360, baseType: !1185, size: 128, offset: 192)
!1185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 128, elements: !816)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1176, file: !146, line: 2364, baseType: !543, size: 32, offset: 320)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1176, file: !146, line: 2367, baseType: !1188, size: 128, offset: 384)
!1188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !146, line: 2349, size: 128, elements: !1189)
!1189 = !{!1190, !1191}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1188, file: !146, line: 2351, baseType: !725, size: 64)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1188, file: !146, line: 2352, baseType: !606, size: 64, offset: 64)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1176, file: !146, line: 2371, baseType: !145, size: 32, offset: 512)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1176, file: !146, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1176, file: !146, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1176, file: !146, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1176, file: !146, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1176, file: !146, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1076, file: !1077, line: 504, baseType: !1199, size: 64, offset: 704)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64)
!1200 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1077, line: 504, flags: DIFlagFwdDecl)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1076, file: !1077, line: 507, baseType: !1121, size: 64, offset: 768)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1076, file: !1077, line: 510, baseType: !543, size: 32, offset: 832)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1076, file: !1077, line: 513, baseType: !543, size: 32, offset: 864)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1076, file: !1077, line: 516, baseType: !675, size: 32, offset: 896)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1076, file: !1077, line: 519, baseType: !675, size: 32, offset: 928)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1076, file: !1077, line: 522, baseType: !7, size: 32, offset: 960)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1076, file: !1077, line: 523, baseType: !7, size: 32, offset: 992)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1076, file: !1077, line: 528, baseType: !548, size: 64, offset: 1024)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1076, file: !1077, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1076, file: !1077, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1076, file: !1077, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1076, file: !1077, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1076, file: !1077, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1076, file: !1077, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1076, file: !1077, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1076, file: !1077, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1076, file: !1077, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1076, file: !1077, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1076, file: !1077, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1076, file: !1077, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1076, file: !1077, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1076, file: !1077, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1076, file: !1077, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1076, file: !1077, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1071, file: !151, line: 3254, baseType: !550, size: 64, offset: 1536)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1071, file: !151, line: 3257, baseType: !550, size: 64, offset: 1600)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1071, file: !151, line: 3258, baseType: !550, size: 64, offset: 1664)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1071, file: !151, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1071, file: !151, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1071, file: !151, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1071, file: !151, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1071, file: !151, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1071, file: !151, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1071, file: !151, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1071, file: !151, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1071, file: !151, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1071, file: !151, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1071, file: !151, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1071, file: !151, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1071, file: !151, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1071, file: !151, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1071, file: !151, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1071, file: !151, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1071, file: !151, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1071, file: !151, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !553, file: !151, line: 3394, baseType: !1247, size: 1344)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !151, line: 2279, size: 1344, elements: !1248)
!1248 = !{!1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1247, file: !151, line: 2280, baseType: !589, size: 192)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1247, file: !151, line: 2281, baseType: !550, size: 64, offset: 192)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1247, file: !151, line: 2282, baseType: !550, size: 64, offset: 256)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1247, file: !151, line: 2283, baseType: !550, size: 64, offset: 320)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1247, file: !151, line: 2284, baseType: !550, size: 64, offset: 384)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1247, file: !151, line: 2285, baseType: !7, size: 32, offset: 448)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1247, file: !151, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1247, file: !151, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1247, file: !151, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1247, file: !151, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1247, file: !151, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1247, file: !151, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1247, file: !151, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1247, file: !151, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1247, file: !151, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1247, file: !151, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1247, file: !151, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1247, file: !151, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1247, file: !151, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1247, file: !151, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1247, file: !151, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1247, file: !151, line: 2305, baseType: !7, size: 32, offset: 512)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1247, file: !151, line: 2306, baseType: !919, size: 32, offset: 544)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1247, file: !151, line: 2307, baseType: !550, size: 64, offset: 576)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1247, file: !151, line: 2308, baseType: !550, size: 64, offset: 640)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1247, file: !151, line: 2314, baseType: !1275, size: 64, offset: 704)
!1275 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !151, line: 2309, size: 64, elements: !1276)
!1276 = !{!1277, !1278, !1279}
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1275, file: !151, line: 2310, baseType: !543, size: 32)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1275, file: !151, line: 2311, baseType: !548, size: 64)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1275, file: !151, line: 2312, baseType: !1280, size: 64)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64)
!1281 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !151, line: 2277, flags: DIFlagFwdDecl)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1247, file: !151, line: 2315, baseType: !550, size: 64, offset: 768)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1247, file: !151, line: 2316, baseType: !550, size: 64, offset: 832)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1247, file: !151, line: 2317, baseType: !550, size: 64, offset: 896)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1247, file: !151, line: 2318, baseType: !550, size: 64, offset: 960)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1247, file: !151, line: 2319, baseType: !550, size: 64, offset: 1024)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1247, file: !151, line: 2320, baseType: !550, size: 64, offset: 1088)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1247, file: !151, line: 2321, baseType: !550, size: 64, offset: 1152)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1247, file: !151, line: 2322, baseType: !550, size: 64, offset: 1216)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1247, file: !151, line: 2324, baseType: !1291, size: 64, offset: 1280)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64)
!1292 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !151, line: 2324, flags: DIFlagFwdDecl)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !553, file: !151, line: 3395, baseType: !1294, size: 320)
!1294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !151, line: 1469, size: 320, elements: !1295)
!1295 = !{!1296, !1297, !1298}
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1294, file: !151, line: 1470, baseType: !589, size: 192)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1294, file: !151, line: 1471, baseType: !550, size: 64, offset: 192)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1294, file: !151, line: 1472, baseType: !550, size: 64, offset: 256)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !553, file: !151, line: 3396, baseType: !1300, size: 320)
!1300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !151, line: 1482, size: 320, elements: !1301)
!1301 = !{!1302, !1303, !1304}
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1300, file: !151, line: 1483, baseType: !589, size: 192)
