; ModuleID = 'dce.bc'
source_filename = "dce.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.rtl_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.VEC_rtx_heap = type { %struct.VEC_rtx_base }
%struct.VEC_rtx_base = type { i32, i32, [1 x %struct.rtx_def*] }
%struct.rtx_def = type { i32, %union.u }
%union.u = type { %struct.block_symbol }
%struct.block_symbol = type { [3 x %union.rtunion_def], %struct.object_block*, i64 }
%union.rtunion_def = type { i8* }
%struct.object_block = type { %union.section*, i32, i64, %struct.VEC_rtx_gc*, %struct.VEC_rtx_gc* }
%union.section = type opaque
%struct.VEC_rtx_gc = type { %struct.VEC_rtx_base }

!652 = !DIEnumerator(name: "GE", value: 82, isUnsigned: true)
!653 = !DIEnumerator(name: "GT", value: 83, isUnsigned: true)
!654 = !DIEnumerator(name: "LE", value: 84, isUnsigned: true)
!655 = !DIEnumerator(name: "LT", value: 85, isUnsigned: true)
!656 = !DIEnumerator(name: "GEU", value: 86, isUnsigned: true)
!657 = !DIEnumerator(name: "GTU", value: 87, isUnsigned: true)
!658 = !DIEnumerator(name: "LEU", value: 88, isUnsigned: true)
!659 = !DIEnumerator(name: "LTU", value: 89, isUnsigned: true)
!660 = !DIEnumerator(name: "UNORDERED", value: 90, isUnsigned: true)
!661 = !DIEnumerator(name: "ORDERED", value: 91, isUnsigned: true)
!662 = !DIEnumerator(name: "UNEQ", value: 92, isUnsigned: true)
!663 = !DIEnumerator(name: "UNGE", value: 93, isUnsigned: true)
!664 = !DIEnumerator(name: "UNGT", value: 94, isUnsigned: true)
!665 = !DIEnumerator(name: "UNLE", value: 95, isUnsigned: true)
!666 = !DIEnumerator(name: "UNLT", value: 96, isUnsigned: true)
!667 = !DIEnumerator(name: "LTGT", value: 97, isUnsigned: true)
!668 = !DIEnumerator(name: "SIGN_EXTEND", value: 98, isUnsigned: true)
!669 = !DIEnumerator(name: "ZERO_EXTEND", value: 99, isUnsigned: true)
!670 = !DIEnumerator(name: "TRUNCATE", value: 100, isUnsigned: true)
!671 = !DIEnumerator(name: "FLOAT_EXTEND", value: 101, isUnsigned: true)
!672 = !DIEnumerator(name: "FLOAT_TRUNCATE", value: 102, isUnsigned: true)
!673 = !DIEnumerator(name: "FLOAT", value: 103, isUnsigned: true)
!674 = !DIEnumerator(name: "FIX", value: 104, isUnsigned: true)
!675 = !DIEnumerator(name: "UNSIGNED_FLOAT", value: 105, isUnsigned: true)
!676 = !DIEnumerator(name: "UNSIGNED_FIX", value: 106, isUnsigned: true)
!677 = !DIEnumerator(name: "FRACT_CONVERT", value: 107, isUnsigned: true)
!678 = !DIEnumerator(name: "UNSIGNED_FRACT_CONVERT", value: 108, isUnsigned: true)
!679 = !DIEnumerator(name: "SAT_FRACT", value: 109, isUnsigned: true)
!680 = !DIEnumerator(name: "UNSIGNED_SAT_FRACT", value: 110, isUnsigned: true)
!681 = !DIEnumerator(name: "ABS", value: 111, isUnsigned: true)
!682 = !DIEnumerator(name: "SQRT", value: 112, isUnsigned: true)
!683 = !DIEnumerator(name: "BSWAP", value: 113, isUnsigned: true)
!684 = !DIEnumerator(name: "FFS", value: 114, isUnsigned: true)
!685 = !DIEnumerator(name: "CLZ", value: 115, isUnsigned: true)
!686 = !DIEnumerator(name: "CTZ", value: 116, isUnsigned: true)
!687 = !DIEnumerator(name: "POPCOUNT", value: 117, isUnsigned: true)
!688 = !DIEnumerator(name: "PARITY", value: 118, isUnsigned: true)
!689 = !DIEnumerator(name: "SIGN_EXTRACT", value: 119, isUnsigned: true)
!690 = !DIEnumerator(name: "ZERO_EXTRACT", value: 120, isUnsigned: true)
!691 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!692 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!693 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!694 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!695 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!696 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!697 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!698 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!699 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!700 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!701 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!702 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!703 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!704 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!705 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!706 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!707 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!708 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!709 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!710 = !{!711, !712, !713, !714, !717, !718, !567, !720, !755, !189, !783, !784, !7, !1879, !738, !1884, !1951, !1958}
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!713 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !721, line: 47, baseType: !722)
!721 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !724, line: 75, size: 256, elements: !725)
!724 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!725 = !{!726, !741, !742, !743}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !723, file: !724, line: 76, baseType: !727, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !724, line: 68, baseType: !729)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !724, line: 63, size: 320, elements: !730)
!730 = !{!731, !733, !734, !735}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !729, file: !724, line: 64, baseType: !732, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !729, file: !724, line: 65, baseType: !732, size: 64, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !729, file: !724, line: 66, baseType: !7, size: 32, offset: 128)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !729, file: !724, line: 67, baseType: !736, size: 128, offset: 192)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !737, size: 128, elements: !739)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !724, line: 29, baseType: !738)
!738 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!739 = !{!740}
!740 = !DISubrange(count: 2)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !723, file: !724, line: 77, baseType: !727, size: 64, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !723, file: !724, line: 78, baseType: !7, size: 32, offset: 128)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !723, file: !724, line: 79, baseType: !744, size: 64, offset: 192)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !724, line: 49, baseType: !746)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !724, line: 45, size: 832, elements: !747)
!747 = !{!748, !749, !750}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !746, file: !724, line: 46, baseType: !732, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !746, file: !724, line: 47, baseType: !722, size: 64, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !746, file: !724, line: 48, baseType: !751, size: 704, offset: 128)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !752, line: 164, size: 704, elements: !753)
!752 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!753 = !{!754, !756, !766, !767, !768, !769, !770, !771, !775, !779, !780, !781, !782}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !751, file: !752, line: 166, baseType: !755, size: 64)
!755 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !751, file: !752, line: 167, baseType: !757, size: 64, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !752, line: 157, size: 192, elements: !759)
!759 = !{!760, !761, !762}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !758, file: !752, line: 159, baseType: !715, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !758, file: !752, line: 160, baseType: !757, size: 64, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !758, file: !752, line: 161, baseType: !763, size: 32, offset: 128)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !716, size: 32, elements: !764)
!764 = !{!765}
!765 = !DISubrange(count: 4)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !751, file: !752, line: 168, baseType: !715, size: 64, offset: 128)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !751, file: !752, line: 169, baseType: !715, size: 64, offset: 192)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !751, file: !752, line: 170, baseType: !715, size: 64, offset: 256)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !751, file: !752, line: 171, baseType: !755, size: 64, offset: 320)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !751, file: !752, line: 172, baseType: !713, size: 32, offset: 384)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !751, file: !752, line: 176, baseType: !772, size: 64, offset: 448)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{!757, !717, !755}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !751, file: !752, line: 177, baseType: !776, size: 64, offset: 512)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DISubroutineType(types: !778)
!778 = !{null, !717, !757}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !751, file: !752, line: 178, baseType: !717, size: 64, offset: 576)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !751, file: !752, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !751, file: !752, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !751, file: !752, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!783 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !721, line: 50, baseType: !785)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !568, line: 240, size: 384, elements: !787)
!787 = !{!788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !786, file: !568, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !786, file: !568, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !786, file: !568, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !786, file: !568, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !786, file: !568, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !786, file: !568, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !786, file: !568, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !786, file: !568, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !786, file: !568, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !786, file: !568, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !786, file: !568, line: 321, baseType: !799, size: 320, offset: 64)
!799 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !568, line: 315, size: 320, elements: !800)
!800 = !{!801, !1846, !1848, !1877, !1878}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !799, file: !568, line: 316, baseType: !802, size: 64)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !803, size: 64, elements: !818)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !568, line: 183, baseType: !804)
!804 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !568, line: 166, size: 64, elements: !805)
!805 = !{!806, !807, !808, !809, !810, !820, !821, !833, !857, !858, !1824, !1825, !1836, !1843}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !804, file: !568, line: 168, baseType: !713, size: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !804, file: !568, line: 169, baseType: !7, size: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !804, file: !568, line: 170, baseType: !718, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !804, file: !568, line: 171, baseType: !784, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !804, file: !568, line: 172, baseType: !811, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !721, line: 53, baseType: !812)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !568, line: 359, size: 128, elements: !814)
!814 = !{!815, !816}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !813, file: !568, line: 360, baseType: !713, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !813, file: !568, line: 361, baseType: !817, size: 64, offset: 64)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !784, size: 64, elements: !818)
!818 = !{!819}
!819 = !DISubrange(count: 1)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !804, file: !568, line: 173, baseType: !189, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !804, file: !568, line: 174, baseType: !822, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !568, line: 133, baseType: !823)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !568, line: 115, size: 32, elements: !824)
!824 = !{!825, !826, !827, !828, !829, !830, !831, !832}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !823, file: !568, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !823, file: !568, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !823, file: !568, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !823, file: !568, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !823, file: !568, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !823, file: !568, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !823, file: !568, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !823, file: !568, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !804, file: !568, line: 175, baseType: !834, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !836, line: 23, size: 320, elements: !837)
!836 = !DIFile(filename: "./cselib.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!837 = !{!838, !839, !840, !841, !848, !856}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !835, file: !836, line: 25, baseType: !7, size: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !835, file: !836, line: 28, baseType: !713, size: 32, offset: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "val_rtx", scope: !835, file: !836, line: 31, baseType: !784, size: 64, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "locs", scope: !835, file: !836, line: 35, baseType: !842, size: 64, offset: 128)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "elt_loc_list", file: !836, line: 45, size: 192, elements: !844)
!844 = !{!845, !846, !847}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !843, file: !836, line: 47, baseType: !842, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !843, file: !836, line: 49, baseType: !784, size: 64, offset: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "setting_insn", scope: !843, file: !836, line: 51, baseType: !784, size: 64, offset: 128)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "addr_list", scope: !835, file: !836, line: 39, baseType: !849, size: 64, offset: 192)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "elt_list", file: !836, line: 55, size: 128, elements: !851)
!851 = !{!852, !853}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !850, file: !836, line: 56, baseType: !849, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "elt", scope: !850, file: !836, line: 57, baseType: !854, size: 64, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "cselib_val", file: !836, line: 42, baseType: !835)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "next_containing_mem", scope: !835, file: !836, line: 41, baseType: !834, size: 64, offset: 256)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !804, file: !568, line: 176, baseType: !722, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !804, file: !568, line: 177, baseType: !859, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !721, line: 56, baseType: !860)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !341, line: 3371, size: 1792, elements: !862)
!862 = !{!863, !896, !902, !913, !932, !943, !948, !955, !961, !974, !986, !1024, !1029, !1057, !1065, !1066, !1071, !1080, !1086, !1091, !1095, !1099, !1460, !1509, !1515, !1521, !1528, !1554, !1568, !1585, !1597, !1619, !1634, !1806}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !861, file: !341, line: 3372, baseType: !864, size: 64)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !341, line: 360, size: 64, elements: !865)
!865 = !{!866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !864, file: !341, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !864, file: !341, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !864, file: !341, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !864, file: !341, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !864, file: !341, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !864, file: !341, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !864, file: !341, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !864, file: !341, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !864, file: !341, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !864, file: !341, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !864, file: !341, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !864, file: !341, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !864, file: !341, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !864, file: !341, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !864, file: !341, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !864, file: !341, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !864, file: !341, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !864, file: !341, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !864, file: !341, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !864, file: !341, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !864, file: !341, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !864, file: !341, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !864, file: !341, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !864, file: !341, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !864, file: !341, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !864, file: !341, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !864, file: !341, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !864, file: !341, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !864, file: !341, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !864, file: !341, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !861, file: !341, line: 3373, baseType: !897, size: 192)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !341, line: 402, size: 192, elements: !898)
!898 = !{!899, !900, !901}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !897, file: !341, line: 403, baseType: !864, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !897, file: !341, line: 404, baseType: !859, size: 64, offset: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !897, file: !341, line: 405, baseType: !859, size: 64, offset: 128)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !861, file: !341, line: 3374, baseType: !903, size: 320)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !341, line: 1384, size: 320, elements: !904)
!904 = !{!905, !906}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !903, file: !341, line: 1385, baseType: !897, size: 192)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !903, file: !341, line: 1386, baseType: !907, size: 128, offset: 192)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !908, line: 58, baseType: !909)
!908 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !908, line: 54, size: 128, elements: !910)
!910 = !{!911, !912}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !909, file: !908, line: 56, baseType: !738, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !909, file: !908, line: 57, baseType: !755, size: 64, offset: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !861, file: !341, line: 3375, baseType: !914, size: 256)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !341, line: 1397, size: 256, elements: !915)
!915 = !{!916, !917}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !914, file: !341, line: 1398, baseType: !897, size: 192)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !914, file: !341, line: 1399, baseType: !918, size: 64, offset: 192)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !920, line: 52, size: 256, elements: !921)
!920 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!921 = !{!922, !923, !924, !925, !926, !927, !928}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !919, file: !920, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !919, file: !920, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !919, file: !920, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !919, file: !920, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !919, file: !920, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !919, file: !920, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !919, file: !920, line: 62, baseType: !929, size: 192, offset: 64)
!929 = !DICompositeType(tag: DW_TAG_array_type, baseType: !738, size: 192, elements: !930)
!930 = !{!931}
!931 = !DISubrange(count: 3)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !861, file: !341, line: 3376, baseType: !933, size: 256)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !341, line: 1408, size: 256, elements: !934)
!934 = !{!935, !936}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !933, file: !341, line: 1409, baseType: !897, size: 192)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !933, file: !341, line: 1410, baseType: !937, size: 64, offset: 192)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !939, line: 27, size: 192, elements: !940)
!939 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!940 = !{!941, !942}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !938, file: !939, line: 29, baseType: !907, size: 128)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !938, file: !939, line: 30, baseType: !189, size: 32, offset: 128)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !861, file: !341, line: 3377, baseType: !944, size: 256)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !341, line: 1437, size: 256, elements: !945)
!945 = !{!946, !947}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !944, file: !341, line: 1438, baseType: !897, size: 192)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !944, file: !341, line: 1439, baseType: !859, size: 64, offset: 192)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !861, file: !341, line: 3378, baseType: !949, size: 256)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !341, line: 1418, size: 256, elements: !950)
!950 = !{!951, !952, !953}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !949, file: !341, line: 1419, baseType: !897, size: 192)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !949, file: !341, line: 1420, baseType: !713, size: 32, offset: 192)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !949, file: !341, line: 1421, baseType: !954, size: 8, offset: 224)
!954 = !DICompositeType(tag: DW_TAG_array_type, baseType: !716, size: 8, elements: !818)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !861, file: !341, line: 3379, baseType: !956, size: 320)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !341, line: 1428, size: 320, elements: !957)
!957 = !{!958, !959, !960}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !956, file: !341, line: 1429, baseType: !897, size: 192)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !956, file: !341, line: 1430, baseType: !859, size: 64, offset: 192)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !956, file: !341, line: 1431, baseType: !859, size: 64, offset: 256)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !861, file: !341, line: 3380, baseType: !962, size: 320)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !341, line: 1460, size: 320, elements: !963)
!963 = !{!964, !965}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !962, file: !341, line: 1461, baseType: !897, size: 192)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !962, file: !341, line: 1462, baseType: !966, size: 128, offset: 192)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !967, line: 31, size: 128, elements: !968)
!967 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!968 = !{!969, !972, !973}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !966, file: !967, line: 32, baseType: !970, size: 64)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !712)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !966, file: !967, line: 33, baseType: !7, size: 32, offset: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !966, file: !967, line: 34, baseType: !7, size: 32, offset: 96)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !861, file: !341, line: 3381, baseType: !975, size: 384)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !341, line: 2507, size: 384, elements: !976)
!976 = !{!977, !978, !983, !984, !985}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !975, file: !341, line: 2508, baseType: !897, size: 192)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !975, file: !341, line: 2509, baseType: !979, size: 32, offset: 192)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !980, line: 58, baseType: !981)
!980 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !982, line: 44, baseType: !7)
!982 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!983 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !975, file: !341, line: 2510, baseType: !7, size: 32, offset: 224)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !975, file: !341, line: 2511, baseType: !859, size: 64, offset: 256)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !975, file: !341, line: 2512, baseType: !859, size: 64, offset: 320)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !861, file: !341, line: 3382, baseType: !987, size: 896)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !341, line: 2652, size: 896, elements: !988)
!988 = !{!989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !987, file: !341, line: 2653, baseType: !975, size: 384)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !987, file: !341, line: 2654, baseType: !859, size: 64, offset: 384)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !987, file: !341, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !987, file: !341, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !987, file: !341, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !987, file: !341, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !987, file: !341, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !987, file: !341, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !987, file: !341, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !987, file: !341, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !987, file: !341, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !987, file: !341, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !987, file: !341, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !987, file: !341, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !987, file: !341, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !987, file: !341, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !987, file: !341, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !987, file: !341, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !987, file: !341, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !987, file: !341, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !987, file: !341, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !987, file: !341, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !987, file: !341, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !987, file: !341, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !987, file: !341, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !987, file: !341, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !987, file: !341, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !987, file: !341, line: 2703, baseType: !7, size: 32, offset: 512)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !987, file: !341, line: 2705, baseType: !859, size: 64, offset: 576)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !987, file: !341, line: 2706, baseType: !859, size: 64, offset: 640)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !987, file: !341, line: 2707, baseType: !859, size: 64, offset: 704)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !987, file: !341, line: 2708, baseType: !859, size: 64, offset: 768)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !987, file: !341, line: 2711, baseType: !1022, size: 64, offset: 832)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !341, line: 2711, flags: DIFlagFwdDecl)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !861, file: !341, line: 3383, baseType: !1025, size: 960)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !341, line: 2756, size: 960, elements: !1026)
!1026 = !{!1027, !1028}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1025, file: !341, line: 2757, baseType: !987, size: 896)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1025, file: !341, line: 2758, baseType: !784, size: 64, offset: 896)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !861, file: !341, line: 3384, baseType: !1030, size: 1472)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !341, line: 3114, size: 1472, elements: !1031)
!1031 = !{!1032, !1053, !1054, !1055, !1056}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1030, file: !341, line: 3115, baseType: !1033, size: 1216)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !341, line: 2984, size: 1216, elements: !1034)
!1034 = !{!1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1033, file: !341, line: 2985, baseType: !1025, size: 960)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1033, file: !341, line: 2986, baseType: !859, size: 64, offset: 960)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1033, file: !341, line: 2987, baseType: !859, size: 64, offset: 1024)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1033, file: !341, line: 2988, baseType: !859, size: 64, offset: 1088)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1033, file: !341, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1033, file: !341, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1033, file: !341, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1033, file: !341, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1033, file: !341, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1033, file: !341, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1033, file: !341, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1033, file: !341, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1033, file: !341, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1033, file: !341, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1033, file: !341, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1033, file: !341, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1033, file: !341, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1033, file: !341, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1030, file: !341, line: 3117, baseType: !859, size: 64, offset: 1216)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1030, file: !341, line: 3119, baseType: !859, size: 64, offset: 1280)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1030, file: !341, line: 3121, baseType: !859, size: 64, offset: 1344)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1030, file: !341, line: 3123, baseType: !859, size: 64, offset: 1408)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !861, file: !341, line: 3385, baseType: !1058, size: 1088)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !341, line: 2874, size: 1088, elements: !1059)
!1059 = !{!1060, !1061, !1062}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1058, file: !341, line: 2875, baseType: !1025, size: 960)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1058, file: !341, line: 2876, baseType: !784, size: 64, offset: 960)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1058, file: !341, line: 2877, baseType: !1063, size: 64, offset: 1024)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !341, line: 2856, flags: DIFlagFwdDecl)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !861, file: !341, line: 3386, baseType: !1033, size: 1216)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !861, file: !341, line: 3387, baseType: !1067, size: 1280)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !341, line: 3093, size: 1280, elements: !1068)
!1068 = !{!1069, !1070}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1067, file: !341, line: 3094, baseType: !1033, size: 1216)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1067, file: !341, line: 3095, baseType: !1063, size: 64, offset: 1216)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !861, file: !341, line: 3388, baseType: !1072, size: 1216)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !341, line: 2824, size: 1216, elements: !1073)
!1073 = !{!1074, !1075, !1076, !1077, !1078, !1079}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1072, file: !341, line: 2825, baseType: !987, size: 896)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1072, file: !341, line: 2827, baseType: !859, size: 64, offset: 896)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1072, file: !341, line: 2828, baseType: !859, size: 64, offset: 960)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1072, file: !341, line: 2829, baseType: !859, size: 64, offset: 1024)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1072, file: !341, line: 2830, baseType: !859, size: 64, offset: 1088)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1072, file: !341, line: 2831, baseType: !859, size: 64, offset: 1152)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !861, file: !341, line: 3389, baseType: !1081, size: 1024)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !341, line: 2850, size: 1024, elements: !1082)
!1082 = !{!1083, !1084, !1085}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1081, file: !341, line: 2851, baseType: !1025, size: 960)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1081, file: !341, line: 2852, baseType: !713, size: 32, offset: 960)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1081, file: !341, line: 2853, baseType: !713, size: 32, offset: 992)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !861, file: !341, line: 3390, baseType: !1087, size: 1024)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !341, line: 2857, size: 1024, elements: !1088)
!1088 = !{!1089, !1090}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1087, file: !341, line: 2858, baseType: !1025, size: 960)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1087, file: !341, line: 2859, baseType: !1063, size: 64, offset: 960)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !861, file: !341, line: 3391, baseType: !1092, size: 960)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !341, line: 2862, size: 960, elements: !1093)
!1093 = !{!1094}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1092, file: !341, line: 2863, baseType: !1025, size: 960)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !861, file: !341, line: 3392, baseType: !1096, size: 1472)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !341, line: 3304, size: 1472, elements: !1097)
!1097 = !{!1098}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1096, file: !341, line: 3305, baseType: !1030, size: 1472)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !861, file: !341, line: 3393, baseType: !1100, size: 1792)
!1100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !341, line: 3248, size: 1792, elements: !1101)
!1101 = !{!1102, !1103, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1100, file: !341, line: 3249, baseType: !1030, size: 1472)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1100, file: !341, line: 3251, baseType: !1104, size: 64, offset: 1472)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1106, line: 463, size: 1152, elements: !1107)
!1106 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1107 = !{!1108, !1272, !1376, !1377, !1380, !1383, !1384, !1385, !1386, !1387, !1388, !1412, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1105, file: !1106, line: 464, baseType: !1109, size: 64)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !318, line: 194, size: 384, elements: !1111)
!1111 = !{!1112, !1161, !1174, !1188, !1240, !1253}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !1110, file: !318, line: 197, baseType: !1113, size: 64)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !318, line: 182, baseType: !1114)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !318, line: 116, size: 704, elements: !1116)
!1116 = !{!1117, !1118, !1119, !1120, !1121, !1122, !1149, !1158, !1159, !1160}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !1115, file: !318, line: 119, baseType: !1114, size: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1115, file: !318, line: 122, baseType: !1114, size: 64, offset: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !1115, file: !318, line: 123, baseType: !1114, size: 64, offset: 128)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1115, file: !318, line: 126, baseType: !713, size: 32, offset: 192)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1115, file: !318, line: 129, baseType: !317, size: 32, offset: 224)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1115, file: !318, line: 165, baseType: !1123, size: 192, offset: 256)
!1123 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !318, line: 132, size: 192, elements: !1124)
!1124 = !{!1125, !1138, !1144}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !1123, file: !318, line: 137, baseType: !1126, size: 128)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !318, line: 133, size: 128, elements: !1127)
!1127 = !{!1128, !1137}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !1126, file: !318, line: 135, baseType: !1129, size: 64)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64)
!1130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !318, line: 93, size: 320, elements: !1131)
!1131 = !{!1132, !1133, !1134, !1135, !1136}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !1130, file: !318, line: 96, baseType: !1129, size: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !1130, file: !318, line: 97, baseType: !1129, size: 64, offset: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1130, file: !318, line: 101, baseType: !859, size: 64, offset: 128)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !1130, file: !318, line: 106, baseType: !859, size: 64, offset: 192)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1130, file: !318, line: 111, baseType: !859, size: 64, offset: 256)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !1126, file: !318, line: 136, baseType: !1129, size: 64, offset: 64)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !1123, file: !318, line: 151, baseType: !1139, size: 192)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !318, line: 139, size: 192, elements: !1140)
!1140 = !{!1141, !1142, !1143}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1139, file: !318, line: 141, baseType: !859, size: 64)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1139, file: !318, line: 145, baseType: !859, size: 64, offset: 64)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1139, file: !318, line: 150, baseType: !713, size: 32, offset: 128)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !1123, file: !318, line: 164, baseType: !1145, size: 128)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !318, line: 153, size: 128, elements: !1146)
!1146 = !{!1147, !1148}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !1145, file: !318, line: 161, baseType: !859, size: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !1145, file: !318, line: 163, baseType: !979, size: 32, offset: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !1115, file: !318, line: 168, baseType: !1150, size: 64, offset: 448)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !318, line: 67, size: 320, elements: !1152)
!1152 = !{!1153, !1154, !1155, !1156, !1157}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !1151, file: !318, line: 70, baseType: !1150, size: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1151, file: !318, line: 73, baseType: !1114, size: 64, offset: 64)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !1151, file: !318, line: 78, baseType: !859, size: 64, offset: 128)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !1151, file: !318, line: 85, baseType: !784, size: 64, offset: 192)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1151, file: !318, line: 88, baseType: !713, size: 32, offset: 256)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !1115, file: !318, line: 173, baseType: !784, size: 64, offset: 512)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !1115, file: !318, line: 173, baseType: !784, size: 64, offset: 576)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !1115, file: !318, line: 177, baseType: !712, size: 8, offset: 640)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !1110, file: !318, line: 200, baseType: !1162, size: 64, offset: 64)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !318, line: 185, baseType: !1164)
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !318, line: 185, size: 128, elements: !1165)
!1165 = !{!1166}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1164, file: !318, line: 185, baseType: !1167, size: 128)
!1167 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !318, line: 184, baseType: !1168)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !318, line: 184, size: 128, elements: !1169)
!1169 = !{!1170, !1171, !1172}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1168, file: !318, line: 184, baseType: !7, size: 32)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1168, file: !318, line: 184, baseType: !7, size: 32, offset: 32)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1168, file: !318, line: 184, baseType: !1173, size: 64, offset: 64)
!1173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1113, size: 64, elements: !818)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !1110, file: !318, line: 203, baseType: !1175, size: 64, offset: 128)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !318, line: 189, baseType: !1177)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !318, line: 189, size: 128, elements: !1178)
!1178 = !{!1179}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1177, file: !318, line: 189, baseType: !1180, size: 128)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !318, line: 188, baseType: !1181)
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !318, line: 188, size: 128, elements: !1182)
!1182 = !{!1183, !1184, !1185}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1181, file: !318, line: 188, baseType: !7, size: 32)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1181, file: !318, line: 188, baseType: !7, size: 32, offset: 32)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1181, file: !318, line: 188, baseType: !1186, size: 64, offset: 64)
!1186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1187, size: 64, elements: !818)
!1187 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !318, line: 180, baseType: !1150)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !1110, file: !318, line: 207, baseType: !1189, size: 64, offset: 192)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1190, line: 144, baseType: !1191)
!1190 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64)
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1190, line: 100, size: 896, elements: !1193)
!1193 = !{!1194, !1202, !1207, !1212, !1214, !1217, !1218, !1219, !1220, !1221, !1226, !1228, !1229, !1234, !1239}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1192, file: !1190, line: 102, baseType: !1195, size: 64)
!1195 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1190, line: 52, baseType: !1196)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64)
!1197 = !DISubroutineType(types: !1198)
!1198 = !{!1199, !1200}
!1199 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1190, line: 47, baseType: !7)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64)
!1201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1192, file: !1190, line: 105, baseType: !1203, size: 64, offset: 64)
!1203 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1190, line: 59, baseType: !1204)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64)
!1205 = !DISubroutineType(types: !1206)
!1206 = !{!713, !1200, !1200}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1192, file: !1190, line: 108, baseType: !1208, size: 64, offset: 128)
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1190, line: 63, baseType: !1209)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64)
!1210 = !DISubroutineType(types: !1211)
!1211 = !{null, !717}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1192, file: !1190, line: 111, baseType: !1213, size: 64, offset: 192)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1192, file: !1190, line: 114, baseType: !1215, size: 64, offset: 256)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1216, line: 46, baseType: !738)
!1216 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1192, file: !1190, line: 117, baseType: !1215, size: 64, offset: 320)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1192, file: !1190, line: 120, baseType: !1215, size: 64, offset: 384)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1192, file: !1190, line: 124, baseType: !7, size: 32, offset: 448)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1192, file: !1190, line: 128, baseType: !7, size: 32, offset: 480)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1192, file: !1190, line: 131, baseType: !1222, size: 64, offset: 512)
!1222 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1190, line: 75, baseType: !1223)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64)
!1224 = !DISubroutineType(types: !1225)
!1225 = !{!717, !1215, !1215}
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1192, file: !1190, line: 132, baseType: !1227, size: 64, offset: 576)
!1227 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1190, line: 78, baseType: !1209)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1192, file: !1190, line: 135, baseType: !717, size: 64, offset: 640)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1192, file: !1190, line: 136, baseType: !1230, size: 64, offset: 704)
!1230 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1190, line: 82, baseType: !1231)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64)
!1232 = !DISubroutineType(types: !1233)
!1233 = !{!717, !717, !1215, !1215}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1192, file: !1190, line: 137, baseType: !1235, size: 64, offset: 768)
!1235 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1190, line: 83, baseType: !1236)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64)
!1237 = !DISubroutineType(types: !1238)
!1238 = !{null, !717, !717}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1192, file: !1190, line: 141, baseType: !7, size: 32, offset: 832)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !1110, file: !318, line: 211, baseType: !1241, size: 64, offset: 256)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64)
!1242 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !341, line: 183, baseType: !1243)
!1243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !341, line: 183, size: 128, elements: !1244)
!1244 = !{!1245}
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1243, file: !341, line: 183, baseType: !1246, size: 128)
!1246 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !341, line: 182, baseType: !1247)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !341, line: 182, size: 128, elements: !1248)
!1248 = !{!1249, !1250, !1251}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1247, file: !341, line: 182, baseType: !7, size: 32)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1247, file: !341, line: 182, baseType: !7, size: 32, offset: 32)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1247, file: !341, line: 182, baseType: !1252, size: 64, offset: 64)
!1252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !859, size: 64, elements: !818)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !1110, file: !318, line: 220, baseType: !1254, size: 64, offset: 320)
!1254 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !318, line: 217, size: 64, elements: !1255)
!1255 = !{!1256, !1257}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !1254, file: !318, line: 218, baseType: !1241, size: 64)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !1254, file: !318, line: 219, baseType: !1258, size: 64)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64)
!1259 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !1260, line: 29, baseType: !1261)
!1260 = !DIFile(filename: "./vecprim.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !1260, line: 29, size: 96, elements: !1262)
!1262 = !{!1263}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1261, file: !1260, line: 29, baseType: !1264, size: 96)
!1264 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !1260, line: 27, baseType: !1265)
!1265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !1260, line: 27, size: 96, elements: !1266)
!1266 = !{!1267, !1268, !1269}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1265, file: !1260, line: 27, baseType: !7, size: 32)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1265, file: !1260, line: 27, baseType: !7, size: 32, offset: 32)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1265, file: !1260, line: 27, baseType: !1270, size: 8, offset: 64)
!1270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1271, size: 8, elements: !818)
!1271 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !1260, line: 26, baseType: !712)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1105, file: !1106, line: 467, baseType: !1273, size: 64, offset: 64)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64)
!1274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !325, line: 374, size: 640, elements: !1275)
!1275 = !{!1276, !1351, !1352, !1365, !1366, !1367, !1368, !1369, !1370, !1372, !1374, !1375}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1274, file: !325, line: 377, baseType: !1277, size: 64)
!1277 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !721, line: 111, baseType: !1278)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64)
!1279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !325, line: 217, size: 832, elements: !1280)
!1280 = !{!1281, !1316, !1317, !1318, !1321, !1325, !1326, !1327, !1345, !1346, !1347, !1348, !1349, !1350}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1279, file: !325, line: 219, baseType: !1282, size: 64)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64)
!1283 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !325, line: 151, baseType: !1284)
!1284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !325, line: 151, size: 128, elements: !1285)
!1285 = !{!1286}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1284, file: !325, line: 151, baseType: !1287, size: 128)
!1287 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !325, line: 150, baseType: !1288)
!1288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !325, line: 150, size: 128, elements: !1289)
!1289 = !{!1290, !1291, !1292}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1288, file: !325, line: 150, baseType: !7, size: 32)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1288, file: !325, line: 150, baseType: !7, size: 32, offset: 32)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1288, file: !325, line: 150, baseType: !1293, size: 64, offset: 64)
!1293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1294, size: 64, elements: !818)
!1294 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !721, line: 108, baseType: !1295)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64)
!1296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !325, line: 122, size: 512, elements: !1297)
!1297 = !{!1298, !1299, !1300, !1308, !1309, !1310, !1311, !1312, !1313, !1314}
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1296, file: !325, line: 124, baseType: !1278, size: 64)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1296, file: !325, line: 125, baseType: !1278, size: 64, offset: 64)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1296, file: !325, line: 131, baseType: !1301, size: 64, offset: 128)
!1301 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !325, line: 128, size: 64, elements: !1302)
!1302 = !{!1303, !1307}
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1301, file: !325, line: 129, baseType: !1304, size: 64)
!1304 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !721, line: 66, baseType: !1305)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64)
!1306 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !721, line: 65, flags: DIFlagFwdDecl)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1301, file: !325, line: 130, baseType: !784, size: 64)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1296, file: !325, line: 134, baseType: !717, size: 64, offset: 192)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1296, file: !325, line: 137, baseType: !859, size: 64, offset: 256)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1296, file: !325, line: 138, baseType: !979, size: 32, offset: 320)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1296, file: !325, line: 142, baseType: !7, size: 32, offset: 352)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1296, file: !325, line: 144, baseType: !713, size: 32, offset: 384)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1296, file: !325, line: 145, baseType: !713, size: 32, offset: 416)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1296, file: !325, line: 146, baseType: !1315, size: 64, offset: 448)
!1315 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !325, line: 119, baseType: !755)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1279, file: !325, line: 220, baseType: !1282, size: 64, offset: 64)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1279, file: !325, line: 223, baseType: !717, size: 64, offset: 128)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1279, file: !325, line: 226, baseType: !1319, size: 64, offset: 192)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64)
!1320 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !325, line: 185, flags: DIFlagFwdDecl)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1279, file: !325, line: 229, baseType: !1322, size: 128, offset: 256)
!1322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1323, size: 128, elements: !739)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64)
!1324 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !325, line: 229, flags: DIFlagFwdDecl)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1279, file: !325, line: 232, baseType: !1278, size: 64, offset: 384)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1279, file: !325, line: 233, baseType: !1278, size: 64, offset: 448)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1279, file: !325, line: 238, baseType: !1328, size: 64, offset: 512)
!1328 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !325, line: 235, size: 64, elements: !1329)
!1329 = !{!1330, !1336}
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1328, file: !325, line: 236, baseType: !1331, size: 64)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64)
!1332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !325, line: 273, size: 128, elements: !1333)
!1333 = !{!1334, !1335}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1332, file: !325, line: 275, baseType: !1304, size: 64)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1332, file: !325, line: 278, baseType: !1304, size: 64, offset: 64)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1328, file: !325, line: 237, baseType: !1337, size: 64)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64)
!1338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !325, line: 259, size: 320, elements: !1339)
!1339 = !{!1340, !1341, !1342, !1343, !1344}
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1338, file: !325, line: 261, baseType: !784, size: 64)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1338, file: !325, line: 262, baseType: !784, size: 64, offset: 64)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1338, file: !325, line: 266, baseType: !784, size: 64, offset: 128)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1338, file: !325, line: 267, baseType: !784, size: 64, offset: 192)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1338, file: !325, line: 270, baseType: !713, size: 32, offset: 256)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1279, file: !325, line: 241, baseType: !1315, size: 64, offset: 576)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1279, file: !325, line: 244, baseType: !713, size: 32, offset: 640)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1279, file: !325, line: 247, baseType: !713, size: 32, offset: 672)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1279, file: !325, line: 250, baseType: !713, size: 32, offset: 704)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1279, file: !325, line: 253, baseType: !713, size: 32, offset: 736)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1279, file: !325, line: 256, baseType: !713, size: 32, offset: 768)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1274, file: !325, line: 378, baseType: !1277, size: 64, offset: 64)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1274, file: !325, line: 381, baseType: !1353, size: 64, offset: 128)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64)
!1354 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !325, line: 282, baseType: !1355)
!1355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !325, line: 282, size: 128, elements: !1356)
!1356 = !{!1357}
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1355, file: !325, line: 282, baseType: !1358, size: 128)
!1358 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !325, line: 281, baseType: !1359)
!1359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !325, line: 281, size: 128, elements: !1360)
!1360 = !{!1361, !1362, !1363}
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1359, file: !325, line: 281, baseType: !7, size: 32)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1359, file: !325, line: 281, baseType: !7, size: 32, offset: 32)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1359, file: !325, line: 281, baseType: !1364, size: 64, offset: 64)
!1364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1277, size: 64, elements: !818)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1274, file: !325, line: 384, baseType: !713, size: 32, offset: 192)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1274, file: !325, line: 387, baseType: !713, size: 32, offset: 224)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1274, file: !325, line: 390, baseType: !713, size: 32, offset: 256)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1274, file: !325, line: 394, baseType: !1353, size: 64, offset: 320)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1274, file: !325, line: 396, baseType: !324, size: 32, offset: 384)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1274, file: !325, line: 399, baseType: !1371, size: 64, offset: 416)
!1371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 64, elements: !739)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1274, file: !325, line: 402, baseType: !1373, size: 64, offset: 480)
!1373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !739)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1274, file: !325, line: 406, baseType: !713, size: 32, offset: 544)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1274, file: !325, line: 409, baseType: !713, size: 32, offset: 576)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1105, file: !1106, line: 470, baseType: !1305, size: 64, offset: 128)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1105, file: !1106, line: 473, baseType: !1378, size: 64, offset: 192)
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64)
!1379 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1106, line: 166, flags: DIFlagFwdDecl)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1105, file: !1106, line: 476, baseType: !1381, size: 64, offset: 256)
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1382, size: 64)
!1382 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1106, line: 476, flags: DIFlagFwdDecl)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1105, file: !1106, line: 479, baseType: !1189, size: 64, offset: 320)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1105, file: !1106, line: 484, baseType: !859, size: 64, offset: 384)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1105, file: !1106, line: 488, baseType: !859, size: 64, offset: 448)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1105, file: !1106, line: 493, baseType: !859, size: 64, offset: 512)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1105, file: !1106, line: 496, baseType: !859, size: 64, offset: 576)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1105, file: !1106, line: 501, baseType: !1389, size: 64, offset: 640)
!1389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1390, size: 64)
!1390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !336, line: 2355, size: 576, elements: !1391)
!1391 = !{!1392, !1395, !1396, !1397, !1398, !1400, !1401, !1406, !1407, !1408, !1409, !1410, !1411}
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1390, file: !336, line: 2356, baseType: !1393, size: 64)
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1394, size: 64)
!1394 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !336, line: 2356, flags: DIFlagFwdDecl)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1390, file: !336, line: 2357, baseType: !718, size: 64, offset: 64)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1390, file: !336, line: 2358, baseType: !713, size: 32, offset: 128)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1390, file: !336, line: 2359, baseType: !713, size: 32, offset: 160)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1390, file: !336, line: 2360, baseType: !1399, size: 128, offset: 192)
!1399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !713, size: 128, elements: !764)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1390, file: !336, line: 2364, baseType: !713, size: 32, offset: 320)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1390, file: !336, line: 2367, baseType: !1402, size: 128, offset: 384)
!1402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !336, line: 2349, size: 128, elements: !1403)
!1403 = !{!1404, !1405}
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1402, file: !336, line: 2351, baseType: !784, size: 64)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1402, file: !336, line: 2352, baseType: !755, size: 64, offset: 64)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1390, file: !336, line: 2371, baseType: !335, size: 32, offset: 512)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1390, file: !336, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1390, file: !336, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1390, file: !336, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1390, file: !336, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1390, file: !336, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1105, file: !1106, line: 504, baseType: !1413, size: 64, offset: 704)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64)
!1414 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1106, line: 504, flags: DIFlagFwdDecl)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1105, file: !1106, line: 507, baseType: !1189, size: 64, offset: 768)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1105, file: !1106, line: 510, baseType: !713, size: 32, offset: 832)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1105, file: !1106, line: 513, baseType: !713, size: 32, offset: 864)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1105, file: !1106, line: 516, baseType: !979, size: 32, offset: 896)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1105, file: !1106, line: 519, baseType: !979, size: 32, offset: 928)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1105, file: !1106, line: 522, baseType: !7, size: 32, offset: 960)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1105, file: !1106, line: 523, baseType: !7, size: 32, offset: 992)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1105, file: !1106, line: 528, baseType: !718, size: 64, offset: 1024)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1105, file: !1106, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1105, file: !1106, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1105, file: !1106, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1105, file: !1106, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1105, file: !1106, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1105, file: !1106, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1105, file: !1106, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1105, file: !1106, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1105, file: !1106, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1105, file: !1106, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1105, file: !1106, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1105, file: !1106, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1105, file: !1106, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1105, file: !1106, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1105, file: !1106, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1105, file: !1106, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1100, file: !341, line: 3254, baseType: !859, size: 64, offset: 1536)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1100, file: !341, line: 3257, baseType: !859, size: 64, offset: 1600)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1100, file: !341, line: 3258, baseType: !859, size: 64, offset: 1664)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1100, file: !341, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1100, file: !341, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1100, file: !341, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1100, file: !341, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1100, file: !341, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1100, file: !341, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1100, file: !341, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1100, file: !341, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1100, file: !341, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1100, file: !341, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1100, file: !341, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1100, file: !341, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1100, file: !341, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1100, file: !341, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1100, file: !341, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1100, file: !341, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1100, file: !341, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1100, file: !341, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !861, file: !341, line: 3394, baseType: !1461, size: 1344)
!1461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !341, line: 2279, size: 1344, elements: !1462)
!1462 = !{!1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1488, !1489, !1490, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506}
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1461, file: !341, line: 2280, baseType: !897, size: 192)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1461, file: !341, line: 2281, baseType: !859, size: 64, offset: 192)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1461, file: !341, line: 2282, baseType: !859, size: 64, offset: 256)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1461, file: !341, line: 2283, baseType: !859, size: 64, offset: 320)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1461, file: !341, line: 2284, baseType: !859, size: 64, offset: 384)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1461, file: !341, line: 2285, baseType: !7, size: 32, offset: 448)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1461, file: !341, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1461, file: !341, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1461, file: !341, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1461, file: !341, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1461, file: !341, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1461, file: !341, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1461, file: !341, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
