; ModuleID = 'ddg.bc'
source_filename = "ddg.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._dep_link = type { %struct._dep_node*, %struct._dep_link*, %struct._dep_link** }
%struct._dep_node = type { %struct._dep_link, %struct._dep, %struct._dep_link }
%struct._dep = type { %struct.rtx_def*, %struct.rtx_def*, i32, i32 }
%struct.rtx_def = type { i32, %union.u }
%union.u = type { %struct.block_symbol }
%struct.block_symbol = type { [3 x %union.rtunion_def], %struct.object_block*, i64 }
%union.rtunion_def = type { i8* }
%struct.object_block = type { %union.section*, i32, i64, %struct.VEC_rtx_gc*, %struct.VEC_rtx_gc* }
%union.section = type opaque
%struct.VEC_rtx_gc = type { %struct.VEC_rtx_base }
%struct.VEC_rtx_base = type { i32, i32, [1 x %struct.rtx_def*] }

!556 = !DIEnumerator(name: "post_call", value: 1, isUnsigned: true)
!557 = !DIEnumerator(name: "post_call_initial", value: 2, isUnsigned: true)
!558 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "reg_pending_barrier_mode", file: !553, line: 424, baseType: !7, size: 32, elements: !559)
!559 = !{!560, !561, !562}
!560 = !DIEnumerator(name: "NOT_A_BARRIER", value: 0, isUnsigned: true)
!561 = !DIEnumerator(name: "MOVE_BARRIER", value: 1, isUnsigned: true)
!562 = !DIEnumerator(name: "TRUE_BARRIER", value: 2, isUnsigned: true)
!563 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "reg_note", file: !410, line: 836, baseType: !7, size: 32, elements: !564)
!564 = !{!565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596}
!565 = !DIEnumerator(name: "REG_DEP_TRUE", value: 0, isUnsigned: true)
!566 = !DIEnumerator(name: "REG_DEAD", value: 1, isUnsigned: true)
!567 = !DIEnumerator(name: "REG_INC", value: 2, isUnsigned: true)
!568 = !DIEnumerator(name: "REG_EQUIV", value: 3, isUnsigned: true)
!569 = !DIEnumerator(name: "REG_EQUAL", value: 4, isUnsigned: true)
!570 = !DIEnumerator(name: "REG_NONNEG", value: 5, isUnsigned: true)
!571 = !DIEnumerator(name: "REG_UNUSED", value: 6, isUnsigned: true)
!572 = !DIEnumerator(name: "REG_CC_SETTER", value: 7, isUnsigned: true)
!573 = !DIEnumerator(name: "REG_CC_USER", value: 8, isUnsigned: true)
!574 = !DIEnumerator(name: "REG_LABEL_TARGET", value: 9, isUnsigned: true)
!575 = !DIEnumerator(name: "REG_LABEL_OPERAND", value: 10, isUnsigned: true)
!576 = !DIEnumerator(name: "REG_DEP_OUTPUT", value: 11, isUnsigned: true)
!577 = !DIEnumerator(name: "REG_DEP_ANTI", value: 12, isUnsigned: true)
!578 = !DIEnumerator(name: "REG_BR_PROB", value: 13, isUnsigned: true)
!579 = !DIEnumerator(name: "REG_VALUE_PROFILE", value: 14, isUnsigned: true)
!580 = !DIEnumerator(name: "REG_NOALIAS", value: 15, isUnsigned: true)
!581 = !DIEnumerator(name: "REG_BR_PRED", value: 16, isUnsigned: true)
!582 = !DIEnumerator(name: "REG_FRAME_RELATED_EXPR", value: 17, isUnsigned: true)
!583 = !DIEnumerator(name: "REG_CFA_DEF_CFA", value: 18, isUnsigned: true)
!584 = !DIEnumerator(name: "REG_CFA_ADJUST_CFA", value: 19, isUnsigned: true)
!585 = !DIEnumerator(name: "REG_CFA_OFFSET", value: 20, isUnsigned: true)
!586 = !DIEnumerator(name: "REG_CFA_REGISTER", value: 21, isUnsigned: true)
!587 = !DIEnumerator(name: "REG_CFA_RESTORE", value: 22, isUnsigned: true)
!588 = !DIEnumerator(name: "REG_CFA_SET_VDRAP", value: 23, isUnsigned: true)
!589 = !DIEnumerator(name: "REG_EH_CONTEXT", value: 24, isUnsigned: true)
!590 = !DIEnumerator(name: "REG_EH_REGION", value: 25, isUnsigned: true)
!591 = !DIEnumerator(name: "REG_SAVE_NOTE", value: 26, isUnsigned: true)
!592 = !DIEnumerator(name: "REG_NORETURN", value: 27, isUnsigned: true)
!593 = !DIEnumerator(name: "REG_NON_LOCAL_GOTO", value: 28, isUnsigned: true)
!594 = !DIEnumerator(name: "REG_CROSSING_JUMP", value: 29, isUnsigned: true)
!595 = !DIEnumerator(name: "REG_SETJMP", value: 30, isUnsigned: true)
!596 = !DIEnumerator(name: "REG_NOTE_MAX", value: 31, isUnsigned: true)
!597 = !{!598, !599, !600, !601, !604, !605, !607, !409, !1811, !644, !1861, !1819, !7, !1877, !1860, !713, !1867, !1866, !1104, !1887}
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!600 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !603)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "ddg_ptr", file: !398, line: 33, baseType: !608)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ddg", file: !398, line: 112, size: 448, elements: !610)
!610 = !{!611, !1806, !1807, !1808, !1809, !1810, !1856, !1857, !1858, !1859}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !609, file: !398, line: 115, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !613, line: 111, baseType: !614)
!613 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !142, line: 217, size: 832, elements: !616)
!616 = !{!617, !1773, !1774, !1775, !1776, !1780, !1781, !1782, !1800, !1801, !1802, !1803, !1804, !1805}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !615, file: !142, line: 219, baseType: !618, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !142, line: 151, baseType: !620)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !142, line: 151, size: 128, elements: !621)
!621 = !{!622}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !620, file: !142, line: 151, baseType: !623, size: 128)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !142, line: 150, baseType: !624)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !142, line: 150, size: 128, elements: !625)
!625 = !{!626, !627, !628}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !624, file: !142, line: 150, baseType: !7, size: 32)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !624, file: !142, line: 150, baseType: !7, size: 32, offset: 32)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !624, file: !142, line: 150, baseType: !629, size: 64, offset: 64)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !630, size: 64, elements: !678)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !613, line: 108, baseType: !631)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !142, line: 122, size: 512, elements: !633)
!633 = !{!634, !635, !636, !1765, !1766, !1767, !1768, !1769, !1770, !1771}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !632, file: !142, line: 124, baseType: !614, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !632, file: !142, line: 125, baseType: !614, size: 64, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !632, file: !142, line: 131, baseType: !637, size: 64, offset: 128)
!637 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !142, line: 128, size: 64, elements: !638)
!638 = !{!639, !643}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !637, file: !142, line: 129, baseType: !640, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !613, line: 66, baseType: !641)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !613, line: 65, flags: DIFlagFwdDecl)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !637, file: !142, line: 130, baseType: !644, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !613, line: 50, baseType: !645)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !410, line: 240, size: 384, elements: !647)
!647 = !{!648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !646, file: !410, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !646, file: !410, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !646, file: !410, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !646, file: !410, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !646, file: !410, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !646, file: !410, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !646, file: !410, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !646, file: !410, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !646, file: !410, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !646, file: !410, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !646, file: !410, line: 321, baseType: !659, size: 320, offset: 64)
!659 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !410, line: 315, size: 320, elements: !660)
!660 = !{!661, !1732, !1734, !1763, !1764}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !659, file: !410, line: 316, baseType: !662, size: 64)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !663, size: 64, elements: !678)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !410, line: 183, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !410, line: 166, size: 64, elements: !665)
!665 = !{!666, !667, !668, !669, !670, !680, !681, !693, !696, !758, !1710, !1711, !1722, !1729}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !664, file: !410, line: 168, baseType: !600, size: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !664, file: !410, line: 169, baseType: !7, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !664, file: !410, line: 170, baseType: !605, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !664, file: !410, line: 171, baseType: !644, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !664, file: !410, line: 172, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !613, line: 53, baseType: !672)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !410, line: 359, size: 128, elements: !674)
!674 = !{!675, !676}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !673, file: !410, line: 360, baseType: !600, size: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !673, file: !410, line: 361, baseType: !677, size: 64, offset: 64)
!677 = !DICompositeType(tag: DW_TAG_array_type, baseType: !644, size: 64, elements: !678)
!678 = !{!679}
!679 = !DISubrange(count: 1)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !664, file: !410, line: 173, baseType: !5, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !664, file: !410, line: 174, baseType: !682, size: 32)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !410, line: 133, baseType: !683)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !410, line: 115, size: 32, elements: !684)
!684 = !{!685, !686, !687, !688, !689, !690, !691, !692}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !683, file: !410, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !683, file: !410, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !683, file: !410, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !683, file: !410, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !683, file: !410, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !683, file: !410, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !683, file: !410, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !683, file: !410, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !664, file: !410, line: 175, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !410, line: 175, flags: DIFlagFwdDecl)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !664, file: !410, line: 176, baseType: !697, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !699, line: 75, size: 256, elements: !700)
!699 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!700 = !{!701, !716, !717, !718}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !698, file: !699, line: 76, baseType: !702, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !699, line: 68, baseType: !704)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !699, line: 63, size: 320, elements: !705)
!705 = !{!706, !708, !709, !710}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !704, file: !699, line: 64, baseType: !707, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !704, file: !699, line: 65, baseType: !707, size: 64, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !704, file: !699, line: 66, baseType: !7, size: 32, offset: 128)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !704, file: !699, line: 67, baseType: !711, size: 128, offset: 192)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !712, size: 128, elements: !714)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !699, line: 29, baseType: !713)
!713 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!714 = !{!715}
!715 = !DISubrange(count: 2)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !698, file: !699, line: 77, baseType: !702, size: 64, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !698, file: !699, line: 78, baseType: !7, size: 32, offset: 128)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !698, file: !699, line: 79, baseType: !719, size: 64, offset: 192)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !699, line: 49, baseType: !721)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !699, line: 45, size: 832, elements: !722)
!722 = !{!723, !724, !725}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !721, file: !699, line: 46, baseType: !707, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !721, file: !699, line: 47, baseType: !697, size: 64, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !721, file: !699, line: 48, baseType: !726, size: 704, offset: 128)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !727, line: 164, size: 704, elements: !728)
!727 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!728 = !{!729, !731, !741, !742, !743, !744, !745, !746, !750, !754, !755, !756, !757}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !726, file: !727, line: 166, baseType: !730, size: 64)
!730 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !726, file: !727, line: 167, baseType: !732, size: 64, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !727, line: 157, size: 192, elements: !734)
!734 = !{!735, !736, !737}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !733, file: !727, line: 159, baseType: !602, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !733, file: !727, line: 160, baseType: !732, size: 64, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !733, file: !727, line: 161, baseType: !738, size: 32, offset: 128)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !603, size: 32, elements: !739)
!739 = !{!740}
!740 = !DISubrange(count: 4)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !726, file: !727, line: 168, baseType: !602, size: 64, offset: 128)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !726, file: !727, line: 169, baseType: !602, size: 64, offset: 192)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !726, file: !727, line: 170, baseType: !602, size: 64, offset: 256)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !726, file: !727, line: 171, baseType: !730, size: 64, offset: 320)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !726, file: !727, line: 172, baseType: !600, size: 32, offset: 384)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !726, file: !727, line: 176, baseType: !747, size: 64, offset: 448)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DISubroutineType(types: !749)
!749 = !{!732, !604, !730}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !726, file: !727, line: 177, baseType: !751, size: 64, offset: 512)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{null, !604, !732}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !726, file: !727, line: 178, baseType: !604, size: 64, offset: 576)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !726, file: !727, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !726, file: !727, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !726, file: !727, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !664, file: !410, line: 177, baseType: !759, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !613, line: 56, baseType: !760)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !171, line: 3371, size: 1792, elements: !762)
!762 = !{!763, !796, !802, !813, !832, !843, !848, !855, !861, !874, !886, !924, !929, !957, !965, !966, !971, !980, !986, !991, !995, !999, !1349, !1398, !1404, !1410, !1417, !1440, !1454, !1471, !1483, !1505, !1520, !1692}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !761, file: !171, line: 3372, baseType: !764, size: 64)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !171, line: 360, size: 64, elements: !765)
!765 = !{!766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !764, file: !171, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !764, file: !171, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !764, file: !171, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !764, file: !171, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !764, file: !171, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !764, file: !171, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !764, file: !171, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !764, file: !171, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !764, file: !171, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !764, file: !171, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !764, file: !171, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !764, file: !171, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !764, file: !171, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !764, file: !171, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !764, file: !171, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !764, file: !171, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !764, file: !171, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !764, file: !171, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !764, file: !171, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !764, file: !171, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !764, file: !171, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !764, file: !171, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !764, file: !171, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !764, file: !171, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !764, file: !171, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !764, file: !171, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !764, file: !171, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !764, file: !171, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !764, file: !171, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !764, file: !171, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !761, file: !171, line: 3373, baseType: !797, size: 192)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !171, line: 402, size: 192, elements: !798)
!798 = !{!799, !800, !801}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !797, file: !171, line: 403, baseType: !764, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !797, file: !171, line: 404, baseType: !759, size: 64, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !797, file: !171, line: 405, baseType: !759, size: 64, offset: 128)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !761, file: !171, line: 3374, baseType: !803, size: 320)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !171, line: 1384, size: 320, elements: !804)
!804 = !{!805, !806}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !803, file: !171, line: 1385, baseType: !797, size: 192)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !803, file: !171, line: 1386, baseType: !807, size: 128, offset: 192)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !808, line: 58, baseType: !809)
!808 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !808, line: 54, size: 128, elements: !810)
!810 = !{!811, !812}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !809, file: !808, line: 56, baseType: !713, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !809, file: !808, line: 57, baseType: !730, size: 64, offset: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !761, file: !171, line: 3375, baseType: !814, size: 256)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !171, line: 1397, size: 256, elements: !815)
!815 = !{!816, !817}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !814, file: !171, line: 1398, baseType: !797, size: 192)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !814, file: !171, line: 1399, baseType: !818, size: 64, offset: 192)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !820, line: 52, size: 256, elements: !821)
!820 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!821 = !{!822, !823, !824, !825, !826, !827, !828}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !819, file: !820, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !819, file: !820, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !819, file: !820, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !819, file: !820, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !819, file: !820, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !819, file: !820, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !819, file: !820, line: 62, baseType: !829, size: 192, offset: 64)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !713, size: 192, elements: !830)
!830 = !{!831}
!831 = !DISubrange(count: 3)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !761, file: !171, line: 3376, baseType: !833, size: 256)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !171, line: 1408, size: 256, elements: !834)
!834 = !{!835, !836}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !833, file: !171, line: 1409, baseType: !797, size: 192)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !833, file: !171, line: 1410, baseType: !837, size: 64, offset: 192)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !839, line: 27, size: 192, elements: !840)
!839 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!840 = !{!841, !842}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !838, file: !839, line: 29, baseType: !807, size: 128)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !838, file: !839, line: 30, baseType: !5, size: 32, offset: 128)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !761, file: !171, line: 3377, baseType: !844, size: 256)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !171, line: 1437, size: 256, elements: !845)
!845 = !{!846, !847}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !844, file: !171, line: 1438, baseType: !797, size: 192)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !844, file: !171, line: 1439, baseType: !759, size: 64, offset: 192)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !761, file: !171, line: 3378, baseType: !849, size: 256)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !171, line: 1418, size: 256, elements: !850)
!850 = !{!851, !852, !853}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !849, file: !171, line: 1419, baseType: !797, size: 192)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !849, file: !171, line: 1420, baseType: !600, size: 32, offset: 192)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !849, file: !171, line: 1421, baseType: !854, size: 8, offset: 224)
!854 = !DICompositeType(tag: DW_TAG_array_type, baseType: !603, size: 8, elements: !678)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !761, file: !171, line: 3379, baseType: !856, size: 320)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !171, line: 1428, size: 320, elements: !857)
!857 = !{!858, !859, !860}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !856, file: !171, line: 1429, baseType: !797, size: 192)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !856, file: !171, line: 1430, baseType: !759, size: 64, offset: 192)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !856, file: !171, line: 1431, baseType: !759, size: 64, offset: 256)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !761, file: !171, line: 3380, baseType: !862, size: 320)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !171, line: 1460, size: 320, elements: !863)
!863 = !{!864, !865}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !862, file: !171, line: 1461, baseType: !797, size: 192)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !862, file: !171, line: 1462, baseType: !866, size: 128, offset: 192)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !867, line: 31, size: 128, elements: !868)
!867 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!868 = !{!869, !872, !873}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !866, file: !867, line: 32, baseType: !870, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !599)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !866, file: !867, line: 33, baseType: !7, size: 32, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !866, file: !867, line: 34, baseType: !7, size: 32, offset: 96)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !761, file: !171, line: 3381, baseType: !875, size: 384)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !171, line: 2507, size: 384, elements: !876)
!876 = !{!877, !878, !883, !884, !885}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !875, file: !171, line: 2508, baseType: !797, size: 192)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !875, file: !171, line: 2509, baseType: !879, size: 32, offset: 192)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !880, line: 58, baseType: !881)
!880 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !882, line: 44, baseType: !7)
!882 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!883 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !875, file: !171, line: 2510, baseType: !7, size: 32, offset: 224)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !875, file: !171, line: 2511, baseType: !759, size: 64, offset: 256)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !875, file: !171, line: 2512, baseType: !759, size: 64, offset: 320)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !761, file: !171, line: 3382, baseType: !887, size: 896)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !171, line: 2652, size: 896, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !887, file: !171, line: 2653, baseType: !875, size: 384)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !887, file: !171, line: 2654, baseType: !759, size: 64, offset: 384)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !887, file: !171, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !887, file: !171, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !887, file: !171, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !887, file: !171, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !887, file: !171, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !887, file: !171, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !887, file: !171, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !887, file: !171, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !887, file: !171, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !887, file: !171, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !887, file: !171, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !887, file: !171, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !887, file: !171, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !887, file: !171, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !887, file: !171, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !887, file: !171, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !887, file: !171, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !887, file: !171, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !887, file: !171, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !887, file: !171, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !887, file: !171, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !887, file: !171, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !887, file: !171, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !887, file: !171, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !887, file: !171, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !887, file: !171, line: 2703, baseType: !7, size: 32, offset: 512)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !887, file: !171, line: 2705, baseType: !759, size: 64, offset: 576)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !887, file: !171, line: 2706, baseType: !759, size: 64, offset: 640)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !887, file: !171, line: 2707, baseType: !759, size: 64, offset: 704)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !887, file: !171, line: 2708, baseType: !759, size: 64, offset: 768)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !887, file: !171, line: 2711, baseType: !922, size: 64, offset: 832)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !171, line: 2711, flags: DIFlagFwdDecl)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !761, file: !171, line: 3383, baseType: !925, size: 960)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !171, line: 2756, size: 960, elements: !926)
!926 = !{!927, !928}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !925, file: !171, line: 2757, baseType: !887, size: 896)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !925, file: !171, line: 2758, baseType: !644, size: 64, offset: 896)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !761, file: !171, line: 3384, baseType: !930, size: 1472)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !171, line: 3114, size: 1472, elements: !931)
!931 = !{!932, !953, !954, !955, !956}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !930, file: !171, line: 3115, baseType: !933, size: 1216)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !171, line: 2984, size: 1216, elements: !934)
!934 = !{!935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !933, file: !171, line: 2985, baseType: !925, size: 960)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !933, file: !171, line: 2986, baseType: !759, size: 64, offset: 960)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !933, file: !171, line: 2987, baseType: !759, size: 64, offset: 1024)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !933, file: !171, line: 2988, baseType: !759, size: 64, offset: 1088)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !933, file: !171, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !933, file: !171, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !933, file: !171, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !933, file: !171, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !933, file: !171, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !933, file: !171, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !933, file: !171, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !933, file: !171, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !933, file: !171, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !933, file: !171, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !933, file: !171, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !933, file: !171, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !933, file: !171, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !933, file: !171, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !930, file: !171, line: 3117, baseType: !759, size: 64, offset: 1216)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !930, file: !171, line: 3119, baseType: !759, size: 64, offset: 1280)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !930, file: !171, line: 3121, baseType: !759, size: 64, offset: 1344)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !930, file: !171, line: 3123, baseType: !759, size: 64, offset: 1408)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !761, file: !171, line: 3385, baseType: !958, size: 1088)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !171, line: 2874, size: 1088, elements: !959)
!959 = !{!960, !961, !962}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !958, file: !171, line: 2875, baseType: !925, size: 960)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !958, file: !171, line: 2876, baseType: !644, size: 64, offset: 960)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !958, file: !171, line: 2877, baseType: !963, size: 64, offset: 1024)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !171, line: 2856, flags: DIFlagFwdDecl)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !761, file: !171, line: 3386, baseType: !933, size: 1216)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !761, file: !171, line: 3387, baseType: !967, size: 1280)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !171, line: 3093, size: 1280, elements: !968)
!968 = !{!969, !970}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !967, file: !171, line: 3094, baseType: !933, size: 1216)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !967, file: !171, line: 3095, baseType: !963, size: 64, offset: 1216)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !761, file: !171, line: 3388, baseType: !972, size: 1216)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !171, line: 2824, size: 1216, elements: !973)
!973 = !{!974, !975, !976, !977, !978, !979}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !972, file: !171, line: 2825, baseType: !887, size: 896)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !972, file: !171, line: 2827, baseType: !759, size: 64, offset: 896)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !972, file: !171, line: 2828, baseType: !759, size: 64, offset: 960)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !972, file: !171, line: 2829, baseType: !759, size: 64, offset: 1024)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !972, file: !171, line: 2830, baseType: !759, size: 64, offset: 1088)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !972, file: !171, line: 2831, baseType: !759, size: 64, offset: 1152)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !761, file: !171, line: 3389, baseType: !981, size: 1024)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !171, line: 2850, size: 1024, elements: !982)
!982 = !{!983, !984, !985}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !981, file: !171, line: 2851, baseType: !925, size: 960)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !981, file: !171, line: 2852, baseType: !600, size: 32, offset: 960)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !981, file: !171, line: 2853, baseType: !600, size: 32, offset: 992)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !761, file: !171, line: 3390, baseType: !987, size: 1024)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !171, line: 2857, size: 1024, elements: !988)
!988 = !{!989, !990}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !987, file: !171, line: 2858, baseType: !925, size: 960)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !987, file: !171, line: 2859, baseType: !963, size: 64, offset: 960)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !761, file: !171, line: 3391, baseType: !992, size: 960)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !171, line: 2862, size: 960, elements: !993)
!993 = !{!994}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !992, file: !171, line: 2863, baseType: !925, size: 960)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !761, file: !171, line: 3392, baseType: !996, size: 1472)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !171, line: 3304, size: 1472, elements: !997)
!997 = !{!998}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !996, file: !171, line: 3305, baseType: !930, size: 1472)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !761, file: !171, line: 3393, baseType: !1000, size: 1792)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !171, line: 3248, size: 1792, elements: !1001)
!1001 = !{!1002, !1003, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1000, file: !171, line: 3249, baseType: !930, size: 1472)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1000, file: !171, line: 3251, baseType: !1004, size: 64, offset: 1472)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1006, line: 463, size: 1152, elements: !1007)
!1006 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1007 = !{!1008, !1172, !1202, !1203, !1206, !1272, !1273, !1274, !1275, !1276, !1277, !1301, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1005, file: !1006, line: 464, baseType: !1009, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !135, line: 194, size: 384, elements: !1011)
!1011 = !{!1012, !1061, !1074, !1088, !1140, !1153}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !1010, file: !135, line: 197, baseType: !1013, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !135, line: 182, baseType: !1014)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !135, line: 116, size: 704, elements: !1016)
!1016 = !{!1017, !1018, !1019, !1020, !1021, !1022, !1049, !1058, !1059, !1060}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !1015, file: !135, line: 119, baseType: !1014, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1015, file: !135, line: 122, baseType: !1014, size: 64, offset: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !1015, file: !135, line: 123, baseType: !1014, size: 64, offset: 128)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1015, file: !135, line: 126, baseType: !600, size: 32, offset: 192)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1015, file: !135, line: 129, baseType: !134, size: 32, offset: 224)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1015, file: !135, line: 165, baseType: !1023, size: 192, offset: 256)
!1023 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !135, line: 132, size: 192, elements: !1024)
!1024 = !{!1025, !1038, !1044}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !1023, file: !135, line: 137, baseType: !1026, size: 128)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !135, line: 133, size: 128, elements: !1027)
!1027 = !{!1028, !1037}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !1026, file: !135, line: 135, baseType: !1029, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !135, line: 93, size: 320, elements: !1031)
!1031 = !{!1032, !1033, !1034, !1035, !1036}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !1030, file: !135, line: 96, baseType: !1029, size: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !1030, file: !135, line: 97, baseType: !1029, size: 64, offset: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1030, file: !135, line: 101, baseType: !759, size: 64, offset: 128)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !1030, file: !135, line: 106, baseType: !759, size: 64, offset: 192)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1030, file: !135, line: 111, baseType: !759, size: 64, offset: 256)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !1026, file: !135, line: 136, baseType: !1029, size: 64, offset: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !1023, file: !135, line: 151, baseType: !1039, size: 192)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !135, line: 139, size: 192, elements: !1040)
!1040 = !{!1041, !1042, !1043}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1039, file: !135, line: 141, baseType: !759, size: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1039, file: !135, line: 145, baseType: !759, size: 64, offset: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1039, file: !135, line: 150, baseType: !600, size: 32, offset: 128)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !1023, file: !135, line: 164, baseType: !1045, size: 128)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !135, line: 153, size: 128, elements: !1046)
!1046 = !{!1047, !1048}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !1045, file: !135, line: 161, baseType: !759, size: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !1045, file: !135, line: 163, baseType: !879, size: 32, offset: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !1015, file: !135, line: 168, baseType: !1050, size: 64, offset: 448)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !135, line: 67, size: 320, elements: !1052)
!1052 = !{!1053, !1054, !1055, !1056, !1057}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !1051, file: !135, line: 70, baseType: !1050, size: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1051, file: !135, line: 73, baseType: !1014, size: 64, offset: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !1051, file: !135, line: 78, baseType: !759, size: 64, offset: 128)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !1051, file: !135, line: 85, baseType: !644, size: 64, offset: 192)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1051, file: !135, line: 88, baseType: !600, size: 32, offset: 256)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !1015, file: !135, line: 173, baseType: !644, size: 64, offset: 512)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !1015, file: !135, line: 173, baseType: !644, size: 64, offset: 576)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !1015, file: !135, line: 177, baseType: !599, size: 8, offset: 640)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !1010, file: !135, line: 200, baseType: !1062, size: 64, offset: 64)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !135, line: 185, baseType: !1064)
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !135, line: 185, size: 128, elements: !1065)
!1065 = !{!1066}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1064, file: !135, line: 185, baseType: !1067, size: 128)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !135, line: 184, baseType: !1068)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !135, line: 184, size: 128, elements: !1069)
!1069 = !{!1070, !1071, !1072}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1068, file: !135, line: 184, baseType: !7, size: 32)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1068, file: !135, line: 184, baseType: !7, size: 32, offset: 32)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1068, file: !135, line: 184, baseType: !1073, size: 64, offset: 64)
!1073 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1013, size: 64, elements: !678)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !1010, file: !135, line: 203, baseType: !1075, size: 64, offset: 128)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, baseType: !1077)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, size: 128, elements: !1078)
!1078 = !{!1079}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1077, file: !135, line: 189, baseType: !1080, size: 128)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !135, line: 188, baseType: !1081)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !135, line: 188, size: 128, elements: !1082)
!1082 = !{!1083, !1084, !1085}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1081, file: !135, line: 188, baseType: !7, size: 32)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1081, file: !135, line: 188, baseType: !7, size: 32, offset: 32)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1081, file: !135, line: 188, baseType: !1086, size: 64, offset: 64)
!1086 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1087, size: 64, elements: !678)
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !135, line: 180, baseType: !1050)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !1010, file: !135, line: 207, baseType: !1089, size: 64, offset: 192)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1090, line: 144, baseType: !1091)
!1090 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1090, line: 100, size: 896, elements: !1093)
!1093 = !{!1094, !1102, !1107, !1112, !1114, !1117, !1118, !1119, !1120, !1121, !1126, !1128, !1129, !1134, !1139}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1092, file: !1090, line: 102, baseType: !1095, size: 64)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1090, line: 52, baseType: !1096)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!1099, !1100}
!1099 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1090, line: 47, baseType: !7)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64)
!1101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1092, file: !1090, line: 105, baseType: !1103, size: 64, offset: 64)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1090, line: 59, baseType: !1104)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1105 = !DISubroutineType(types: !1106)
!1106 = !{!600, !1100, !1100}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1092, file: !1090, line: 108, baseType: !1108, size: 64, offset: 128)
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1090, line: 63, baseType: !1109)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = !DISubroutineType(types: !1111)
!1111 = !{null, !604}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1092, file: !1090, line: 111, baseType: !1113, size: 64, offset: 192)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1092, file: !1090, line: 114, baseType: !1115, size: 64, offset: 256)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1116, line: 46, baseType: !713)
!1116 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1092, file: !1090, line: 117, baseType: !1115, size: 64, offset: 320)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1092, file: !1090, line: 120, baseType: !1115, size: 64, offset: 384)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1092, file: !1090, line: 124, baseType: !7, size: 32, offset: 448)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1092, file: !1090, line: 128, baseType: !7, size: 32, offset: 480)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1092, file: !1090, line: 131, baseType: !1122, size: 64, offset: 512)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1090, line: 75, baseType: !1123)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = !DISubroutineType(types: !1125)
!1125 = !{!604, !1115, !1115}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1092, file: !1090, line: 132, baseType: !1127, size: 64, offset: 576)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1090, line: 78, baseType: !1109)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1092, file: !1090, line: 135, baseType: !604, size: 64, offset: 640)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1092, file: !1090, line: 136, baseType: !1130, size: 64, offset: 704)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1090, line: 82, baseType: !1131)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64)
!1132 = !DISubroutineType(types: !1133)
!1133 = !{!604, !604, !1115, !1115}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1092, file: !1090, line: 137, baseType: !1135, size: 64, offset: 768)
!1135 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1090, line: 83, baseType: !1136)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1137 = !DISubroutineType(types: !1138)
!1138 = !{null, !604, !604}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1092, file: !1090, line: 141, baseType: !7, size: 32, offset: 832)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !1010, file: !135, line: 211, baseType: !1141, size: 64, offset: 256)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !171, line: 183, baseType: !1143)
!1143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !171, line: 183, size: 128, elements: !1144)
!1144 = !{!1145}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1143, file: !171, line: 183, baseType: !1146, size: 128)
!1146 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !171, line: 182, baseType: !1147)
!1147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !171, line: 182, size: 128, elements: !1148)
!1148 = !{!1149, !1150, !1151}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1147, file: !171, line: 182, baseType: !7, size: 32)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1147, file: !171, line: 182, baseType: !7, size: 32, offset: 32)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1147, file: !171, line: 182, baseType: !1152, size: 64, offset: 64)
!1152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !759, size: 64, elements: !678)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !1010, file: !135, line: 220, baseType: !1154, size: 64, offset: 320)
!1154 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !135, line: 217, size: 64, elements: !1155)
!1155 = !{!1156, !1157}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !1154, file: !135, line: 218, baseType: !1141, size: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !1154, file: !135, line: 219, baseType: !1158, size: 64)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !1160, line: 29, baseType: !1161)
!1160 = !DIFile(filename: "./vecprim.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !1160, line: 29, size: 96, elements: !1162)
!1162 = !{!1163}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1161, file: !1160, line: 29, baseType: !1164, size: 96)
!1164 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !1160, line: 27, baseType: !1165)
!1165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !1160, line: 27, size: 96, elements: !1166)
!1166 = !{!1167, !1168, !1169}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1165, file: !1160, line: 27, baseType: !7, size: 32)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1165, file: !1160, line: 27, baseType: !7, size: 32, offset: 32)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1165, file: !1160, line: 27, baseType: !1170, size: 8, offset: 64)
!1170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1171, size: 8, elements: !678)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !1160, line: 26, baseType: !599)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1005, file: !1006, line: 467, baseType: !1173, size: 64, offset: 64)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64)
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !142, line: 374, size: 640, elements: !1175)
!1175 = !{!1176, !1177, !1178, !1191, !1192, !1193, !1194, !1195, !1196, !1198, !1200, !1201}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1174, file: !142, line: 377, baseType: !612, size: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1174, file: !142, line: 378, baseType: !612, size: 64, offset: 64)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1174, file: !142, line: 381, baseType: !1179, size: 64, offset: 128)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !142, line: 282, baseType: !1181)
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !142, line: 282, size: 128, elements: !1182)
!1182 = !{!1183}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1181, file: !142, line: 282, baseType: !1184, size: 128)
!1184 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !142, line: 281, baseType: !1185)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !142, line: 281, size: 128, elements: !1186)
!1186 = !{!1187, !1188, !1189}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1185, file: !142, line: 281, baseType: !7, size: 32)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1185, file: !142, line: 281, baseType: !7, size: 32, offset: 32)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1185, file: !142, line: 281, baseType: !1190, size: 64, offset: 64)
!1190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !612, size: 64, elements: !678)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1174, file: !142, line: 384, baseType: !600, size: 32, offset: 192)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1174, file: !142, line: 387, baseType: !600, size: 32, offset: 224)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1174, file: !142, line: 390, baseType: !600, size: 32, offset: 256)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1174, file: !142, line: 394, baseType: !1179, size: 64, offset: 320)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1174, file: !142, line: 396, baseType: !141, size: 32, offset: 384)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1174, file: !142, line: 399, baseType: !1197, size: 64, offset: 416)
!1197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 64, elements: !714)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1174, file: !142, line: 402, baseType: !1199, size: 64, offset: 480)
!1199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !714)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1174, file: !142, line: 406, baseType: !600, size: 32, offset: 544)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1174, file: !142, line: 409, baseType: !600, size: 32, offset: 576)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1005, file: !1006, line: 470, baseType: !641, size: 64, offset: 128)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1005, file: !1006, line: 473, baseType: !1204, size: 64, offset: 192)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64)
!1205 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1006, line: 166, flags: DIFlagFwdDecl)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1005, file: !1006, line: 476, baseType: !1207, size: 64, offset: 256)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !153, line: 187, size: 256, elements: !1209)
!1209 = !{!1210, !1211, !1270, !1271}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1208, file: !153, line: 189, baseType: !600, size: 32)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !1208, file: !153, line: 192, baseType: !1212, size: 64, offset: 64)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64)
!1213 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !153, line: 87, baseType: !1214)
!1214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !153, line: 87, size: 128, elements: !1215)
!1215 = !{!1216}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1214, file: !153, line: 87, baseType: !1217, size: 128)
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !153, line: 85, baseType: !1218)
!1218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !153, line: 85, size: 128, elements: !1219)
!1219 = !{!1220, !1221, !1222}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1218, file: !153, line: 85, baseType: !7, size: 32)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1218, file: !153, line: 85, baseType: !7, size: 32, offset: 32)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1218, file: !153, line: 85, baseType: !1223, size: 64, offset: 64)
!1223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1224, size: 64, elements: !678)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !153, line: 84, baseType: !1225)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64)
!1226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !153, line: 100, size: 1216, elements: !1227)
!1227 = !{!1228, !1229, !1230, !1231, !1232, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1260, !1268, !1269}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1226, file: !153, line: 102, baseType: !600, size: 32)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1226, file: !153, line: 105, baseType: !7, size: 32, offset: 32)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1226, file: !153, line: 108, baseType: !614, size: 64, offset: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1226, file: !153, line: 111, baseType: !614, size: 64, offset: 128)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1226, file: !153, line: 114, baseType: !1233, size: 64, offset: 192)
!1233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !153, line: 41, size: 64, elements: !1234)
!1234 = !{!1235, !1236}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1233, file: !153, line: 42, baseType: !152, size: 32)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1233, file: !153, line: 43, baseType: !7, size: 32, offset: 32)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1226, file: !153, line: 117, baseType: !7, size: 32, offset: 256)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1226, file: !153, line: 120, baseType: !7, size: 32, offset: 288)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1226, file: !153, line: 123, baseType: !1212, size: 64, offset: 320)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1226, file: !153, line: 126, baseType: !1225, size: 64, offset: 384)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1226, file: !153, line: 129, baseType: !1225, size: 64, offset: 448)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1226, file: !153, line: 132, baseType: !604, size: 64, offset: 512)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1226, file: !153, line: 139, baseType: !759, size: 64, offset: 576)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1226, file: !153, line: 143, baseType: !807, size: 128, offset: 640)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1226, file: !153, line: 146, baseType: !807, size: 128, offset: 768)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1226, file: !153, line: 148, baseType: !599, size: 8, offset: 896)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1226, file: !153, line: 149, baseType: !599, size: 8, offset: 904)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1226, file: !153, line: 153, baseType: !161, size: 32, offset: 928)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1226, file: !153, line: 156, baseType: !1250, size: 64, offset: 960)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64)
!1251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !153, line: 48, size: 320, elements: !1252)
!1252 = !{!1253, !1257, !1258, !1259}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1251, file: !153, line: 50, baseType: !1254, size: 64)
!1254 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !613, line: 58, baseType: !1255)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64)
!1256 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !613, line: 57, flags: DIFlagFwdDecl)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1251, file: !153, line: 59, baseType: !807, size: 128, offset: 64)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1251, file: !153, line: 64, baseType: !599, size: 8, offset: 192)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1251, file: !153, line: 67, baseType: !1250, size: 64, offset: 256)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1226, file: !153, line: 159, baseType: !1261, size: 64, offset: 1024)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64)
!1262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !153, line: 72, size: 256, elements: !1263)
!1263 = !{!1264, !1265, !1266, !1267}
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1262, file: !153, line: 74, baseType: !631, size: 64)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1262, file: !153, line: 77, baseType: !1261, size: 64, offset: 64)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1262, file: !153, line: 78, baseType: !1261, size: 64, offset: 128)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1262, file: !153, line: 81, baseType: !1261, size: 64, offset: 192)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1226, file: !153, line: 162, baseType: !599, size: 8, offset: 1088)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1226, file: !153, line: 166, baseType: !759, size: 64, offset: 1152)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1208, file: !153, line: 197, baseType: !1089, size: 64, offset: 128)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !1208, file: !153, line: 200, baseType: !1225, size: 64, offset: 192)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1005, file: !1006, line: 479, baseType: !1089, size: 64, offset: 320)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1005, file: !1006, line: 484, baseType: !759, size: 64, offset: 384)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1005, file: !1006, line: 488, baseType: !759, size: 64, offset: 448)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1005, file: !1006, line: 493, baseType: !759, size: 64, offset: 512)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1005, file: !1006, line: 496, baseType: !759, size: 64, offset: 576)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1005, file: !1006, line: 501, baseType: !1278, size: 64, offset: 640)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64)
!1279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !166, line: 2355, size: 576, elements: !1280)
!1280 = !{!1281, !1284, !1285, !1286, !1287, !1289, !1290, !1295, !1296, !1297, !1298, !1299, !1300}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1279, file: !166, line: 2356, baseType: !1282, size: 64)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64)
!1283 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !166, line: 2356, flags: DIFlagFwdDecl)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1279, file: !166, line: 2357, baseType: !605, size: 64, offset: 64)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1279, file: !166, line: 2358, baseType: !600, size: 32, offset: 128)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1279, file: !166, line: 2359, baseType: !600, size: 32, offset: 160)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1279, file: !166, line: 2360, baseType: !1288, size: 128, offset: 192)
!1288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !600, size: 128, elements: !739)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1279, file: !166, line: 2364, baseType: !600, size: 32, offset: 320)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1279, file: !166, line: 2367, baseType: !1291, size: 128, offset: 384)
!1291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !166, line: 2349, size: 128, elements: !1292)
!1292 = !{!1293, !1294}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1291, file: !166, line: 2351, baseType: !644, size: 64)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1291, file: !166, line: 2352, baseType: !730, size: 64, offset: 64)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1279, file: !166, line: 2371, baseType: !165, size: 32, offset: 512)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1279, file: !166, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1279, file: !166, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1279, file: !166, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1279, file: !166, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1279, file: !166, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1005, file: !1006, line: 504, baseType: !1302, size: 64, offset: 704)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64)
!1303 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1006, line: 504, flags: DIFlagFwdDecl)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1005, file: !1006, line: 507, baseType: !1089, size: 64, offset: 768)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1005, file: !1006, line: 510, baseType: !600, size: 32, offset: 832)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1005, file: !1006, line: 513, baseType: !600, size: 32, offset: 864)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1005, file: !1006, line: 516, baseType: !879, size: 32, offset: 896)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1005, file: !1006, line: 519, baseType: !879, size: 32, offset: 928)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1005, file: !1006, line: 522, baseType: !7, size: 32, offset: 960)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1005, file: !1006, line: 523, baseType: !7, size: 32, offset: 992)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1005, file: !1006, line: 528, baseType: !605, size: 64, offset: 1024)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1005, file: !1006, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1005, file: !1006, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1005, file: !1006, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1005, file: !1006, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1005, file: !1006, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1005, file: !1006, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1005, file: !1006, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1005, file: !1006, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1005, file: !1006, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1005, file: !1006, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1005, file: !1006, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1005, file: !1006, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1005, file: !1006, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1005, file: !1006, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1005, file: !1006, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1005, file: !1006, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1000, file: !171, line: 3254, baseType: !759, size: 64, offset: 1536)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1000, file: !171, line: 3257, baseType: !759, size: 64, offset: 1600)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1000, file: !171, line: 3258, baseType: !759, size: 64, offset: 1664)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1000, file: !171, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1000, file: !171, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1000, file: !171, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1000, file: !171, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1000, file: !171, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1000, file: !171, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1000, file: !171, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1000, file: !171, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1000, file: !171, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1000, file: !171, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1000, file: !171, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1000, file: !171, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1000, file: !171, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1000, file: !171, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1000, file: !171, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1000, file: !171, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1000, file: !171, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1000, file: !171, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !761, file: !171, line: 3394, baseType: !1350, size: 1344)
!1350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !171, line: 2279, size: 1344, elements: !1351)
!1351 = !{!1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1377, !1378, !1379, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395}
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1350, file: !171, line: 2280, baseType: !797, size: 192)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1350, file: !171, line: 2281, baseType: !759, size: 64, offset: 192)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1350, file: !171, line: 2282, baseType: !759, size: 64, offset: 256)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1350, file: !171, line: 2283, baseType: !759, size: 64, offset: 320)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1350, file: !171, line: 2284, baseType: !759, size: 64, offset: 384)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1350, file: !171, line: 2285, baseType: !7, size: 32, offset: 448)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1350, file: !171, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1350, file: !171, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1350, file: !171, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1350, file: !171, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1350, file: !171, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1350, file: !171, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1350, file: !171, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1350, file: !171, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1350, file: !171, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1350, file: !171, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1350, file: !171, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
