; ModuleID = 'decimal128.bc'
source_filename = "decimal128.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.decimal128 = type { [16 x i8] }
%struct.decNumber = type { i32, i32, i8, [12 x i16] }
%struct.decContext = type { i32, i32, i32, i32, i32, i32, i8 }
%union.anon = type { %struct.UINT128 }
%struct.UINT128 = type { [2 x i64] }
%union.anon.0 = type { %struct.UINT128 }

@COMBMSD = external dso_local local_unnamed_addr constant [32 x i32], align 16
@COMBEXP = external dso_local local_unnamed_addr constant [32 x i32], align 16
@.str = private unnamed_addr constant [4 x i8] c"Inf\00", align 1
@.str.1 = private unnamed_addr constant [6 x i8] c"inity\00", align 1
@.str.2 = private unnamed_addr constant [4 x i8] c"NaN\00", align 1
@BIN2CHAR = external dso_local constant [4001 x i8], align 16
@DPD2BIN = external dso_local local_unnamed_addr constant [1024 x i16], align 16

; Function Attrs: inlinehint nounwind uwtable
define dso_local i32 @atoi(i8* %__nptr) local_unnamed_addr #0 !dbg !35 {
entry:
  call void @llvm.dbg.value(metadata i8* %__nptr, metadata !40, metadata !DIExpression()), !dbg !41
  %call = tail call i64 @strtol(i8* %__nptr, i8** null, i32 10) #7, !dbg !42
  %conv = trunc i64 %call to i32, !dbg !43
  ret i32 %conv, !dbg !44
}

; Function Attrs: nounwind readnone speculatable
declare void @llvm.dbg.declare(metadata, metadata, metadata) #1


!56 = !{!57, !22}
!57 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!58 = !{!59}
!59 = !DILocalVariable(name: "__nptr", arg: 1, scope: !54, file: !36, line: 373, type: !22)
!60 = !DILocation(line: 0, scope: !54)
!61 = !DILocation(line: 375, column: 10, scope: !54)
!62 = !DILocation(line: 375, column: 3, scope: !54)
!63 = distinct !DISubprogram(name: "bsearch", scope: !64, file: !64, line: 20, type: !65, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !76)
!64 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!65 = !DISubroutineType(types: !66)
!66 = !{!21, !67, !67, !69, !69, !72}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !70, line: 46, baseType: !71)
!70 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!71 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !36, line: 808, baseType: !73)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{!17, !67, !67}
!76 = !{!77, !78, !79, !80, !81, !82, !83, !84, !85, !86}
!77 = !DILocalVariable(name: "__key", arg: 1, scope: !63, file: !64, line: 20, type: !67)
!78 = !DILocalVariable(name: "__base", arg: 2, scope: !63, file: !64, line: 20, type: !67)
!79 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !63, file: !64, line: 20, type: !69)
!80 = !DILocalVariable(name: "__size", arg: 4, scope: !63, file: !64, line: 20, type: !69)
!81 = !DILocalVariable(name: "__compar", arg: 5, scope: !63, file: !64, line: 21, type: !72)
!82 = !DILocalVariable(name: "__l", scope: !63, file: !64, line: 23, type: !69)
!83 = !DILocalVariable(name: "__u", scope: !63, file: !64, line: 23, type: !69)
!84 = !DILocalVariable(name: "__idx", scope: !63, file: !64, line: 23, type: !69)
!85 = !DILocalVariable(name: "__p", scope: !63, file: !64, line: 24, type: !67)
!86 = !DILocalVariable(name: "__comparison", scope: !63, file: !64, line: 25, type: !17)
!87 = !DILocation(line: 0, scope: !63)
!88 = !DILocation(line: 29, column: 3, scope: !63)
!89 = !DILocation(line: 27, column: 7, scope: !63)
!90 = !DILocation(line: 29, column: 14, scope: !63)
!91 = !DILocation(line: 31, column: 20, scope: !92)
!92 = distinct !DILexicalBlock(scope: !63, file: !64, line: 30, column: 5)
!93 = !DILocation(line: 31, column: 27, scope: !92)
!94 = !DILocation(line: 32, column: 56, scope: !92)
!95 = !DILocation(line: 32, column: 47, scope: !92)
!96 = !DILocation(line: 33, column: 22, scope: !92)
!97 = !DILocation(line: 34, column: 24, scope: !98)
!98 = distinct !DILexicalBlock(scope: !92, file: !64, line: 34, column: 11)
!99 = !DILocation(line: 34, column: 11, scope: !92)
!100 = !DILocation(line: 36, column: 29, scope: !101)
!101 = distinct !DILexicalBlock(scope: !98, file: !64, line: 36, column: 16)
!102 = !DILocation(line: 36, column: 16, scope: !98)
!103 = !DILocation(line: 37, column: 14, scope: !101)
!104 = distinct !{!104, !88, !105}
!105 = !DILocation(line: 40, column: 5, scope: !63)
!106 = !DILocation(line: 43, column: 1, scope: !63)
!107 = distinct !DISubprogram(name: "atof", scope: !108, file: !108, line: 25, type: !109, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !112)
!108 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!109 = !DISubroutineType(types: !110)
!110 = !{!111, !22}
!111 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!112 = !{!113}
!113 = !DILocalVariable(name: "__nptr", arg: 1, scope: !107, file: !108, line: 25, type: !22)
!114 = !DILocation(line: 0, scope: !107)
!115 = !DILocation(line: 27, column: 10, scope: !107)
!116 = !DILocation(line: 27, column: 3, scope: !107)
!117 = distinct !DISubprogram(name: "__dpd128FromNumber", scope: !1, file: !1, line: 115, type: !118, scopeLine: 116, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !159)
!118 = !DISubroutineType(types: !119)
!119 = !{!120, !120, !132, !148}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "decimal128", file: !122, line: 64, baseType: !123)
!122 = !DIFile(filename: "./decimal128.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !122, line: 62, size: 128, elements: !124)
!124 = !{!125}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !123, file: !122, line: 63, baseType: !126, size: 128)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 128, elements: !130)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !25, line: 24, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !27, line: 38, baseType: !129)
!129 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!130 = !{!131}
!131 = !DISubrange(count: 16)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "decNumber", file: !135, line: 84, baseType: !136)
!135 = !DIFile(filename: "./decNumber.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !135, line: 77, size: 288, elements: !137)
!137 = !{!138, !139, !140, !141}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "digits", scope: !136, file: !135, line: 78, baseType: !28, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "exponent", scope: !136, file: !135, line: 79, baseType: !28, size: 32, offset: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !136, file: !135, line: 81, baseType: !127, size: 8, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "lsu", scope: !136, file: !135, line: 83, baseType: !142, size: 192, offset: 80)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 192, elements: !146)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !25, line: 25, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !27, line: 40, baseType: !145)
!145 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!146 = !{!147}
!147 = !DISubrange(count: 12)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "decContext", file: !4, line: 93, baseType: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 82, size: 224, elements: !151)
!151 = !{!152, !153, !154, !155, !156, !157, !158}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "digits", scope: !150, file: !4, line: 83, baseType: !28, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "emax", scope: !150, file: !4, line: 84, baseType: !28, size: 32, offset: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "emin", scope: !150, file: !4, line: 85, baseType: !28, size: 32, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "round", scope: !150, file: !4, line: 86, baseType: !3, size: 32, offset: 96)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "traps", scope: !150, file: !4, line: 87, baseType: !24, size: 32, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !150, file: !4, line: 88, baseType: !24, size: 32, offset: 160)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "clamp", scope: !150, file: !4, line: 89, baseType: !127, size: 8, offset: 192)
!159 = !{!160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !174, !179}
!160 = !DILocalVariable(name: "d128", arg: 1, scope: !117, file: !1, line: 115, type: !120)
!161 = !DILocalVariable(name: "dn", arg: 2, scope: !117, file: !1, line: 115, type: !132)
!162 = !DILocalVariable(name: "set", arg: 3, scope: !117, file: !1, line: 116, type: !148)
!163 = !DILocalVariable(name: "status", scope: !117, file: !1, line: 117, type: !24)
!164 = !DILocalVariable(name: "ae", scope: !117, file: !1, line: 118, type: !28)
!165 = !DILocalVariable(name: "dw", scope: !117, file: !1, line: 119, type: !134)
!166 = !DILocalVariable(name: "dc", scope: !117, file: !1, line: 120, type: !149)
!167 = !DILocalVariable(name: "comb", scope: !117, file: !1, line: 121, type: !24)
!168 = !DILocalVariable(name: "exp", scope: !117, file: !1, line: 121, type: !24)
!169 = !DILocalVariable(name: "uiwork", scope: !117, file: !1, line: 122, type: !24)
!170 = !DILocalVariable(name: "targar", scope: !117, file: !1, line: 123, type: !171)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 128, elements: !172)
!172 = !{!173}
!173 = !DISubrange(count: 4)
!174 = !DILocalVariable(name: "msd", scope: !175, file: !1, line: 176, type: !24)
!175 = distinct !DILexicalBlock(scope: !176, file: !1, line: 175, column: 11)
!176 = distinct !DILexicalBlock(scope: !177, file: !1, line: 160, column: 9)
!177 = distinct !DILexicalBlock(scope: !178, file: !1, line: 159, column: 9)
!178 = distinct !DILexicalBlock(scope: !117, file: !1, line: 147, column: 7)
!179 = !DILocalVariable(name: "pad", scope: !175, file: !1, line: 177, type: !28)
!180 = !DILocation(line: 0, scope: !117)
!181 = !DILocation(line: 119, column: 3, scope: !117)
!182 = !DILocation(line: 120, column: 3, scope: !117)
!183 = !DILocation(line: 122, column: 3, scope: !117)
!184 = !DILocation(line: 123, column: 3, scope: !117)
!185 = !DILocation(line: 123, column: 8, scope: !117)
!186 = !DILocation(line: 134, column: 10, scope: !117)
!187 = !DILocation(line: 134, column: 23, scope: !117)
!188 = !DILocation(line: 134, column: 18, scope: !117)
!189 = !DILocation(line: 135, column: 17, scope: !190)
!190 = distinct !DILexicalBlock(scope: !117, file: !1, line: 135, column: 7)
!191 = !DILocation(line: 136, column: 4, scope: !190)
!192 = !DILocation(line: 0, scope: !178)
!193 = !DILocation(line: 147, column: 11, scope: !178)
!194 = !DILocation(line: 138, column: 5, scope: !195)
!195 = distinct !DILexicalBlock(scope: !190, file: !1, line: 137, column: 27)
!196 = !DILocation(line: 139, column: 19, scope: !195)
!197 = !DILocation(line: 139, column: 8, scope: !195)
!198 = !DILocation(line: 139, column: 13, scope: !195)
!199 = !DILocation(line: 140, column: 5, scope: !195)
!200 = !DILocation(line: 142, column: 18, scope: !195)
!201 = !DILocation(line: 142, column: 22, scope: !195)
!202 = !DILocation(line: 142, column: 8, scope: !195)
!203 = !DILocation(line: 142, column: 12, scope: !195)
!204 = !DILocation(line: 143, column: 15, scope: !195)
!205 = !DILocation(line: 145, column: 5, scope: !195)
!206 = !DILocation(line: 147, column: 15, scope: !178)
!207 = !DILocation(line: 147, column: 7, scope: !117)
!208 = !DILocation(line: 148, column: 17, scope: !209)
!209 = distinct !DILexicalBlock(scope: !210, file: !1, line: 148, column: 9)
!210 = distinct !DILexicalBlock(scope: !178, file: !1, line: 147, column: 28)
!211 = !DILocation(line: 148, column: 9, scope: !210)
!212 = !DILocation(line: 148, column: 26, scope: !209)
!213 = !DILocation(line: 148, column: 32, scope: !209)
!214 = !DILocation(line: 150, column: 12, scope: !215)
!215 = distinct !DILexicalBlock(scope: !216, file: !1, line: 150, column: 11)
!216 = distinct !DILexicalBlock(scope: !209, file: !1, line: 149, column: 11)
!217 = !DILocation(line: 150, column: 20, scope: !215)
!218 = !DILocation(line: 150, column: 24, scope: !215)
