; ModuleID = 'decimal64.bc'
source_filename = "decimal64.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.decimal64 = type { [8 x i8] }
%struct.decNumber = type { i32, i32, i8, [6 x i16] }
%struct.decContext = type { i32, i32, i32, i32, i32, i32, i8 }
%union.anon = type { i64 }
%union.anon.0 = type { i64 }


!92 = distinct !DISubprogram(name: "atoll", scope: !74, file: !74, line: 373, type: !93, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !96)
!93 = !DISubroutineType(types: !94)
!94 = !{!95, !24}
!95 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!96 = !{!97}
!97 = !DILocalVariable(name: "__nptr", arg: 1, scope: !92, file: !74, line: 373, type: !24)
!98 = !DILocation(line: 0, scope: !92)
!99 = !DILocation(line: 375, column: 10, scope: !92)
!100 = !DILocation(line: 375, column: 3, scope: !92)
!101 = distinct !DISubprogram(name: "bsearch", scope: !102, file: !102, line: 20, type: !103, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !114)
!102 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!103 = !DISubroutineType(types: !104)
!104 = !{!23, !105, !105, !107, !107, !110}
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !108, line: 46, baseType: !109)
!108 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!109 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !74, line: 808, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!19, !105, !105}
!114 = !{!115, !116, !117, !118, !119, !120, !121, !122, !123, !124}
!115 = !DILocalVariable(name: "__key", arg: 1, scope: !101, file: !102, line: 20, type: !105)
!116 = !DILocalVariable(name: "__base", arg: 2, scope: !101, file: !102, line: 20, type: !105)
!117 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !101, file: !102, line: 20, type: !107)
!118 = !DILocalVariable(name: "__size", arg: 4, scope: !101, file: !102, line: 20, type: !107)
!119 = !DILocalVariable(name: "__compar", arg: 5, scope: !101, file: !102, line: 21, type: !110)
!120 = !DILocalVariable(name: "__l", scope: !101, file: !102, line: 23, type: !107)
!121 = !DILocalVariable(name: "__u", scope: !101, file: !102, line: 23, type: !107)
!122 = !DILocalVariable(name: "__idx", scope: !101, file: !102, line: 23, type: !107)
!123 = !DILocalVariable(name: "__p", scope: !101, file: !102, line: 24, type: !105)
!124 = !DILocalVariable(name: "__comparison", scope: !101, file: !102, line: 25, type: !19)
!125 = !DILocation(line: 0, scope: !101)
!126 = !DILocation(line: 29, column: 3, scope: !101)
!127 = !DILocation(line: 27, column: 7, scope: !101)
!128 = !DILocation(line: 29, column: 14, scope: !101)
!129 = !DILocation(line: 31, column: 20, scope: !130)
!130 = distinct !DILexicalBlock(scope: !101, file: !102, line: 30, column: 5)
!131 = !DILocation(line: 31, column: 27, scope: !130)
!132 = !DILocation(line: 32, column: 56, scope: !130)
!133 = !DILocation(line: 32, column: 47, scope: !130)
!134 = !DILocation(line: 33, column: 22, scope: !130)
!135 = !DILocation(line: 34, column: 24, scope: !136)
!136 = distinct !DILexicalBlock(scope: !130, file: !102, line: 34, column: 11)
!137 = !DILocation(line: 34, column: 11, scope: !130)
!138 = !DILocation(line: 36, column: 29, scope: !139)
!139 = distinct !DILexicalBlock(scope: !136, file: !102, line: 36, column: 16)
!140 = !DILocation(line: 36, column: 16, scope: !136)
!141 = !DILocation(line: 37, column: 14, scope: !139)
!142 = distinct !{!142, !126, !143}
!143 = !DILocation(line: 40, column: 5, scope: !101)
!144 = !DILocation(line: 43, column: 1, scope: !101)
!145 = distinct !DISubprogram(name: "atof", scope: !146, file: !146, line: 25, type: !147, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !150)
!146 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!147 = !DISubroutineType(types: !148)
!148 = !{!149, !24}
!149 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!150 = !{!151}
!151 = !DILocalVariable(name: "__nptr", arg: 1, scope: !145, file: !146, line: 25, type: !24)
!152 = !DILocation(line: 0, scope: !145)
!153 = !DILocation(line: 27, column: 10, scope: !145)
!154 = !DILocation(line: 27, column: 3, scope: !145)
!155 = distinct !DISubprogram(name: "__dpd64FromNumber", scope: !3, file: !3, line: 121, type: !156, scopeLine: 122, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !191)
!156 = !DISubroutineType(types: !157)
!157 = !{!158, !158, !167, !180}
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "decimal64", file: !160, line: 66, baseType: !161)
!160 = !DIFile(filename: "./decimal64.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !160, line: 64, size: 64, elements: !162)
!162 = !{!163}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !161, file: !160, line: 65, baseType: !164, size: 64)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 64, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 8)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !169)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "decNumber", file: !170, line: 84, baseType: !171)
!170 = !DIFile(filename: "./decNumber.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !170, line: 77, size: 192, elements: !172)
!172 = !{!173, !174, !175, !176}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "digits", scope: !171, file: !170, line: 78, baseType: !30, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "exponent", scope: !171, file: !170, line: 79, baseType: !30, size: 32, offset: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !171, file: !170, line: 81, baseType: !48, size: 8, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "lsu", scope: !171, file: !170, line: 83, baseType: !177, size: 96, offset: 80)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 96, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 6)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "decContext", file: !6, line: 93, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 82, size: 224, elements: !183)
!183 = !{!184, !185, !186, !187, !188, !189, !190}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "digits", scope: !182, file: !6, line: 83, baseType: !30, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "emax", scope: !182, file: !6, line: 84, baseType: !30, size: 32, offset: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "emin", scope: !182, file: !6, line: 85, baseType: !30, size: 32, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "round", scope: !182, file: !6, line: 86, baseType: !5, size: 32, offset: 96)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "traps", scope: !182, file: !6, line: 87, baseType: !26, size: 32, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !182, file: !6, line: 88, baseType: !26, size: 32, offset: 160)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "clamp", scope: !182, file: !6, line: 89, baseType: !48, size: 8, offset: 192)
!191 = !{!192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !206, !211, !212, !216, !217}
!192 = !DILocalVariable(name: "d64", arg: 1, scope: !155, file: !3, line: 121, type: !158)
!193 = !DILocalVariable(name: "dn", arg: 2, scope: !155, file: !3, line: 121, type: !167)
!194 = !DILocalVariable(name: "set", arg: 3, scope: !155, file: !3, line: 122, type: !180)
!195 = !DILocalVariable(name: "status", scope: !155, file: !3, line: 123, type: !26)
!196 = !DILocalVariable(name: "ae", scope: !155, file: !3, line: 124, type: !30)
!197 = !DILocalVariable(name: "dw", scope: !155, file: !3, line: 125, type: !169)
!198 = !DILocalVariable(name: "dc", scope: !155, file: !3, line: 126, type: !181)
!199 = !DILocalVariable(name: "comb", scope: !155, file: !3, line: 127, type: !26)
!200 = !DILocalVariable(name: "exp", scope: !155, file: !3, line: 127, type: !26)
!201 = !DILocalVariable(name: "uiwork", scope: !155, file: !3, line: 128, type: !26)
!202 = !DILocalVariable(name: "targar", scope: !155, file: !3, line: 129, type: !203)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 64, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 2)
!206 = !DILocalVariable(name: "msd", scope: !207, file: !3, line: 180, type: !26)
!207 = distinct !DILexicalBlock(scope: !208, file: !3, line: 179, column: 11)
!208 = distinct !DILexicalBlock(scope: !209, file: !3, line: 164, column: 9)
!209 = distinct !DILexicalBlock(scope: !210, file: !3, line: 163, column: 9)
!210 = distinct !DILexicalBlock(scope: !155, file: !3, line: 151, column: 7)
!211 = !DILocalVariable(name: "pad", scope: !207, file: !3, line: 181, type: !30)
!212 = !DILocalVariable(name: "dpd", scope: !213, file: !3, line: 193, type: !215)
!213 = distinct !DILexicalBlock(scope: !214, file: !3, line: 192, column: 33)
!214 = distinct !DILexicalBlock(scope: !207, file: !3, line: 192, column: 11)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 192, elements: !178)
!216 = !DILocalVariable(name: "i", scope: !213, file: !3, line: 194, type: !26)
!217 = !DILocalVariable(name: "d", scope: !213, file: !3, line: 195, type: !30)
!218 = !DILocation(line: 0, scope: !155)
!219 = !DILocation(line: 125, column: 3, scope: !155)
!220 = !DILocation(line: 126, column: 3, scope: !155)
!221 = !DILocation(line: 128, column: 3, scope: !155)
!222 = !DILocation(line: 129, column: 3, scope: !155)
!223 = !DILocation(line: 129, column: 8, scope: !155)
!224 = !DILocation(line: 138, column: 10, scope: !155)
!225 = !DILocation(line: 138, column: 23, scope: !155)
!226 = !DILocation(line: 138, column: 18, scope: !155)
!227 = !DILocation(line: 139, column: 17, scope: !228)
!228 = distinct !DILexicalBlock(scope: !155, file: !3, line: 139, column: 7)
!229 = !DILocation(line: 140, column: 4, scope: !228)
!230 = !DILocation(line: 0, scope: !210)
!231 = !DILocation(line: 151, column: 11, scope: !210)
!232 = !DILocation(line: 142, column: 5, scope: !233)
!233 = distinct !DILexicalBlock(scope: !228, file: !3, line: 141, column: 26)
!234 = !DILocation(line: 143, column: 19, scope: !233)
!235 = !DILocation(line: 143, column: 8, scope: !233)
!236 = !DILocation(line: 143, column: 13, scope: !233)
!237 = !DILocation(line: 144, column: 5, scope: !233)
!238 = !DILocation(line: 146, column: 18, scope: !233)
!239 = !DILocation(line: 146, column: 22, scope: !233)
!240 = !DILocation(line: 146, column: 8, scope: !233)
!241 = !DILocation(line: 146, column: 12, scope: !233)
!242 = !DILocation(line: 147, column: 15, scope: !233)
!243 = !DILocation(line: 149, column: 5, scope: !233)
!244 = !DILocation(line: 151, column: 15, scope: !210)
!245 = !DILocation(line: 151, column: 7, scope: !155)
!246 = !DILocation(line: 152, column: 17, scope: !247)
!247 = distinct !DILexicalBlock(scope: !248, file: !3, line: 152, column: 9)
!248 = distinct !DILexicalBlock(scope: !210, file: !3, line: 151, column: 28)
