; ModuleID = 'df-byte-scan.bc'
source_filename = "df-byte-scan.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.stat64 = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%union.df_ref_d = type { %struct.df_extract_ref }
%struct.df_extract_ref = type { %struct.df_regular_ref, i32, i32, i32 }
%struct.df_regular_ref = type { %struct.df_base_ref, %struct.rtx_def** }
%struct.df_base_ref = type { i32, %struct.rtx_def*, %struct.df_link*, %struct.df_insn_info*, %union.df_ref_d*, %union.df_ref_d*, i32, i32, i32 }
%struct.rtx_def = type { i32, %union.u }
%union.u = type { %struct.block_symbol }
%struct.block_symbol = type { [3 x %union.rtunion_def], %struct.object_block*, i64 }
%union.rtunion_def = type { i8* }

!461 = !DIEnumerator(name: "PRE_MODIFY", value: 78, isUnsigned: true)
!462 = !DIEnumerator(name: "POST_MODIFY", value: 79, isUnsigned: true)
!463 = !DIEnumerator(name: "NE", value: 80, isUnsigned: true)
!464 = !DIEnumerator(name: "EQ", value: 81, isUnsigned: true)
!465 = !DIEnumerator(name: "GE", value: 82, isUnsigned: true)
!466 = !DIEnumerator(name: "GT", value: 83, isUnsigned: true)
!467 = !DIEnumerator(name: "LE", value: 84, isUnsigned: true)
!468 = !DIEnumerator(name: "LT", value: 85, isUnsigned: true)
!469 = !DIEnumerator(name: "GEU", value: 86, isUnsigned: true)
!470 = !DIEnumerator(name: "GTU", value: 87, isUnsigned: true)
!471 = !DIEnumerator(name: "LEU", value: 88, isUnsigned: true)
!472 = !DIEnumerator(name: "LTU", value: 89, isUnsigned: true)
!473 = !DIEnumerator(name: "UNORDERED", value: 90, isUnsigned: true)
!474 = !DIEnumerator(name: "ORDERED", value: 91, isUnsigned: true)
!475 = !DIEnumerator(name: "UNEQ", value: 92, isUnsigned: true)
!476 = !DIEnumerator(name: "UNGE", value: 93, isUnsigned: true)
!477 = !DIEnumerator(name: "UNGT", value: 94, isUnsigned: true)
!478 = !DIEnumerator(name: "UNLE", value: 95, isUnsigned: true)
!479 = !DIEnumerator(name: "UNLT", value: 96, isUnsigned: true)
!480 = !DIEnumerator(name: "LTGT", value: 97, isUnsigned: true)
!481 = !DIEnumerator(name: "SIGN_EXTEND", value: 98, isUnsigned: true)
!482 = !DIEnumerator(name: "ZERO_EXTEND", value: 99, isUnsigned: true)
!483 = !DIEnumerator(name: "TRUNCATE", value: 100, isUnsigned: true)
!484 = !DIEnumerator(name: "FLOAT_EXTEND", value: 101, isUnsigned: true)
!485 = !DIEnumerator(name: "FLOAT_TRUNCATE", value: 102, isUnsigned: true)
!486 = !DIEnumerator(name: "FLOAT", value: 103, isUnsigned: true)
!487 = !DIEnumerator(name: "FIX", value: 104, isUnsigned: true)
!488 = !DIEnumerator(name: "UNSIGNED_FLOAT", value: 105, isUnsigned: true)
!489 = !DIEnumerator(name: "UNSIGNED_FIX", value: 106, isUnsigned: true)
!490 = !DIEnumerator(name: "FRACT_CONVERT", value: 107, isUnsigned: true)
!491 = !DIEnumerator(name: "UNSIGNED_FRACT_CONVERT", value: 108, isUnsigned: true)
!492 = !DIEnumerator(name: "SAT_FRACT", value: 109, isUnsigned: true)
!493 = !DIEnumerator(name: "UNSIGNED_SAT_FRACT", value: 110, isUnsigned: true)
!494 = !DIEnumerator(name: "ABS", value: 111, isUnsigned: true)
!495 = !DIEnumerator(name: "SQRT", value: 112, isUnsigned: true)
!496 = !DIEnumerator(name: "BSWAP", value: 113, isUnsigned: true)
!497 = !DIEnumerator(name: "FFS", value: 114, isUnsigned: true)
!498 = !DIEnumerator(name: "CLZ", value: 115, isUnsigned: true)
!499 = !DIEnumerator(name: "CTZ", value: 116, isUnsigned: true)
!500 = !DIEnumerator(name: "POPCOUNT", value: 117, isUnsigned: true)
!501 = !DIEnumerator(name: "PARITY", value: 118, isUnsigned: true)
!502 = !DIEnumerator(name: "SIGN_EXTRACT", value: 119, isUnsigned: true)
!503 = !DIEnumerator(name: "ZERO_EXTRACT", value: 120, isUnsigned: true)
!504 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!505 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!506 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!507 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!508 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!509 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!510 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!511 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!512 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!513 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!514 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!515 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!516 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!517 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!518 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!519 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!520 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!521 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!522 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!523 = !{!524, !525, !526, !527, !530, !531, !380, !533, !3}
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!526 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !529)
!533 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!534 = !{i32 2, !"Dwarf Version", i32 4}
!535 = !{i32 2, !"Debug Info Version", i32 3}
!536 = !{i32 1, !"wchar_size", i32 4}
!537 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!538 = distinct !DISubprogram(name: "vprintf", scope: !539, file: !539, line: 39, type: !540, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !550)
!539 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!540 = !DISubroutineType(types: !541)
!541 = !{!526, !542, !543}
!542 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !531)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, elements: !545)
!545 = !{!546, !547, !548, !549}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !544, file: !1, baseType: !5, size: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !544, file: !1, baseType: !5, size: 32, offset: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !544, file: !1, baseType: !530, size: 64, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !544, file: !1, baseType: !530, size: 64, offset: 128)
!550 = !{!551, !552}
!551 = !DILocalVariable(name: "__fmt", arg: 1, scope: !538, file: !539, line: 39, type: !542)
!552 = !DILocalVariable(name: "__arg", arg: 2, scope: !538, file: !539, line: 39, type: !543)
!553 = !DILocation(line: 0, scope: !538)
!554 = !DILocation(line: 41, column: 20, scope: !538)
!555 = !DILocation(line: 41, column: 10, scope: !538)
!556 = !DILocation(line: 41, column: 3, scope: !538)
!557 = distinct !DISubprogram(name: "getchar", scope: !539, file: !539, line: 47, type: !558, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !560)
!558 = !DISubroutineType(types: !559)
!559 = !{!526}
!560 = !{}
!561 = !DILocation(line: 49, column: 16, scope: !557)
!562 = !DILocation(line: 49, column: 10, scope: !557)
!563 = !DILocation(line: 49, column: 3, scope: !557)
!564 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !539, file: !539, line: 56, type: !565, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !625)
!565 = !DISubroutineType(types: !566)
!566 = !{!526, !567}
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !569, line: 7, baseType: !570)
!569 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !571, line: 49, size: 1728, elements: !572)
!571 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!572 = !{!573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !588, !590, !591, !592, !596, !597, !599, !603, !606, !608, !611, !614, !615, !616, !620, !621}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !570, file: !571, line: 51, baseType: !526, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !570, file: !571, line: 54, baseType: !528, size: 64, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !570, file: !571, line: 55, baseType: !528, size: 64, offset: 128)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !570, file: !571, line: 56, baseType: !528, size: 64, offset: 192)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !570, file: !571, line: 57, baseType: !528, size: 64, offset: 256)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !570, file: !571, line: 58, baseType: !528, size: 64, offset: 320)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !570, file: !571, line: 59, baseType: !528, size: 64, offset: 384)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !570, file: !571, line: 60, baseType: !528, size: 64, offset: 448)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !570, file: !571, line: 61, baseType: !528, size: 64, offset: 512)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !570, file: !571, line: 64, baseType: !528, size: 64, offset: 576)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !570, file: !571, line: 65, baseType: !528, size: 64, offset: 640)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !570, file: !571, line: 66, baseType: !528, size: 64, offset: 704)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !570, file: !571, line: 68, baseType: !586, size: 64, offset: 768)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !571, line: 36, flags: DIFlagFwdDecl)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !570, file: !571, line: 70, baseType: !589, size: 64, offset: 832)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !570, file: !571, line: 72, baseType: !526, size: 32, offset: 896)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !570, file: !571, line: 73, baseType: !526, size: 32, offset: 928)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !570, file: !571, line: 74, baseType: !593, size: 64, offset: 960)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !594, line: 152, baseType: !595)
!594 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!595 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !570, file: !571, line: 77, baseType: !533, size: 16, offset: 1024)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !570, file: !571, line: 78, baseType: !598, size: 8, offset: 1040)
!598 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !570, file: !571, line: 79, baseType: !600, size: 8, offset: 1048)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !529, size: 8, elements: !601)
!601 = !{!602}
!602 = !DISubrange(count: 1)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !570, file: !571, line: 81, baseType: !604, size: 64, offset: 1088)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !571, line: 43, baseType: null)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !570, file: !571, line: 89, baseType: !607, size: 64, offset: 1152)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !594, line: 153, baseType: !595)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !570, file: !571, line: 91, baseType: !609, size: 64, offset: 1216)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !571, line: 37, flags: DIFlagFwdDecl)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !570, file: !571, line: 92, baseType: !612, size: 64, offset: 1280)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !571, line: 38, flags: DIFlagFwdDecl)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !570, file: !571, line: 93, baseType: !589, size: 64, offset: 1344)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !570, file: !571, line: 94, baseType: !530, size: 64, offset: 1408)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !570, file: !571, line: 95, baseType: !617, size: 64, offset: 1472)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !618, line: 46, baseType: !619)
!618 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!619 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !570, file: !571, line: 96, baseType: !526, size: 32, offset: 1536)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !570, file: !571, line: 98, baseType: !622, size: 160, offset: 1568)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !529, size: 160, elements: !623)
!623 = !{!624}
!624 = !DISubrange(count: 20)
!625 = !{!626}
!626 = !DILocalVariable(name: "__fp", arg: 1, scope: !564, file: !539, line: 56, type: !567)
!627 = !DILocation(line: 0, scope: !564)
!628 = !DILocation(line: 58, column: 10, scope: !564)
!629 = !DILocation(line: 58, column: 3, scope: !564)
!630 = distinct !DISubprogram(name: "getc_unlocked", scope: !539, file: !539, line: 66, type: !565, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !631)
!631 = !{!632}
!632 = !DILocalVariable(name: "__fp", arg: 1, scope: !630, file: !539, line: 66, type: !567)
!633 = !DILocation(line: 0, scope: !630)
!634 = !DILocation(line: 68, column: 10, scope: !630)
!635 = !DILocation(line: 68, column: 3, scope: !630)
!636 = distinct !DISubprogram(name: "getchar_unlocked", scope: !539, file: !539, line: 73, type: !558, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !560)
!637 = !DILocation(line: 75, column: 10, scope: !636)
!638 = !DILocation(line: 75, column: 3, scope: !636)
!639 = distinct !DISubprogram(name: "putchar", scope: !539, file: !539, line: 82, type: !640, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !642)
!640 = !DISubroutineType(types: !641)
!641 = !{!526, !526}
!642 = !{!643}
!643 = !DILocalVariable(name: "__c", arg: 1, scope: !639, file: !539, line: 82, type: !526)
!644 = !DILocation(line: 0, scope: !639)
!645 = !DILocation(line: 84, column: 21, scope: !639)
!646 = !DILocation(line: 84, column: 10, scope: !639)
!647 = !DILocation(line: 84, column: 3, scope: !639)
!648 = distinct !DISubprogram(name: "fputc_unlocked", scope: !539, file: !539, line: 91, type: !649, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !651)
!649 = !DISubroutineType(types: !650)
!650 = !{!526, !526, !567}
!651 = !{!652, !653}
!652 = !DILocalVariable(name: "__c", arg: 1, scope: !648, file: !539, line: 91, type: !526)
!653 = !DILocalVariable(name: "__stream", arg: 2, scope: !648, file: !539, line: 91, type: !567)
!654 = !DILocation(line: 0, scope: !648)
!655 = !DILocation(line: 93, column: 10, scope: !648)
!656 = !DILocation(line: 93, column: 3, scope: !648)
!657 = distinct !DISubprogram(name: "putc_unlocked", scope: !539, file: !539, line: 101, type: !649, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !658)
!658 = !{!659, !660}
!659 = !DILocalVariable(name: "__c", arg: 1, scope: !657, file: !539, line: 101, type: !526)
!660 = !DILocalVariable(name: "__stream", arg: 2, scope: !657, file: !539, line: 101, type: !567)
!661 = !DILocation(line: 0, scope: !657)
!662 = !DILocation(line: 103, column: 10, scope: !657)
!663 = !DILocation(line: 103, column: 3, scope: !657)
!664 = distinct !DISubprogram(name: "putchar_unlocked", scope: !539, file: !539, line: 108, type: !640, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !665)
!665 = !{!666}
!666 = !DILocalVariable(name: "__c", arg: 1, scope: !664, file: !539, line: 108, type: !526)
!667 = !DILocation(line: 0, scope: !664)
!668 = !DILocation(line: 110, column: 10, scope: !664)
!669 = !DILocation(line: 110, column: 3, scope: !664)
!670 = distinct !DISubprogram(name: "getline", scope: !539, file: !539, line: 118, type: !671, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !675)
!671 = !DISubroutineType(types: !672)
!672 = !{!673, !527, !674, !567}
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !594, line: 193, baseType: !595)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!675 = !{!676, !677, !678}
!676 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !670, file: !539, line: 118, type: !527)
!677 = !DILocalVariable(name: "__n", arg: 2, scope: !670, file: !539, line: 118, type: !674)
!678 = !DILocalVariable(name: "__stream", arg: 3, scope: !670, file: !539, line: 118, type: !567)
!679 = !DILocation(line: 0, scope: !670)
!680 = !DILocation(line: 120, column: 10, scope: !670)
!681 = !DILocation(line: 120, column: 3, scope: !670)
!682 = distinct !DISubprogram(name: "feof_unlocked", scope: !539, file: !539, line: 128, type: !565, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !683)
!683 = !{!684}
!684 = !DILocalVariable(name: "__stream", arg: 1, scope: !682, file: !539, line: 128, type: !567)
!685 = !DILocation(line: 0, scope: !682)
!686 = !DILocation(line: 130, column: 10, scope: !682)
!687 = !DILocation(line: 130, column: 3, scope: !682)
!688 = distinct !DISubprogram(name: "ferror_unlocked", scope: !539, file: !539, line: 135, type: !565, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !689)
!689 = !{!690}
!690 = !DILocalVariable(name: "__stream", arg: 1, scope: !688, file: !539, line: 135, type: !567)
!691 = !DILocation(line: 0, scope: !688)
!692 = !DILocation(line: 137, column: 10, scope: !688)
!693 = !DILocation(line: 137, column: 3, scope: !688)
!694 = distinct !DISubprogram(name: "tolower", scope: !695, file: !695, line: 207, type: !640, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !696)
!695 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!696 = !{!697}
!697 = !DILocalVariable(name: "__c", arg: 1, scope: !694, file: !695, line: 207, type: !526)
!698 = !DILocation(line: 0, scope: !694)
!699 = !DILocation(line: 209, column: 22, scope: !694)
!700 = !DILocation(line: 209, column: 39, scope: !694)
!701 = !DILocation(line: 209, column: 38, scope: !694)
!702 = !DILocation(line: 209, column: 37, scope: !694)
!703 = !DILocation(line: 209, column: 10, scope: !694)
!704 = !DILocation(line: 209, column: 3, scope: !694)
!705 = distinct !DISubprogram(name: "toupper", scope: !695, file: !695, line: 213, type: !640, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !706)
!706 = !{!707}
!707 = !DILocalVariable(name: "__c", arg: 1, scope: !705, file: !695, line: 213, type: !526)
!708 = !DILocation(line: 0, scope: !705)
!709 = !DILocation(line: 215, column: 22, scope: !705)
!710 = !DILocation(line: 215, column: 39, scope: !705)
!711 = !DILocation(line: 215, column: 38, scope: !705)
!712 = !DILocation(line: 215, column: 37, scope: !705)
!713 = !DILocation(line: 215, column: 10, scope: !705)
!714 = !DILocation(line: 215, column: 3, scope: !705)
!715 = distinct !DISubprogram(name: "atoi", scope: !716, file: !716, line: 361, type: !717, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !719)
!716 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!717 = !DISubroutineType(types: !718)
!718 = !{!526, !531}
!719 = !{!720}
!720 = !DILocalVariable(name: "__nptr", arg: 1, scope: !715, file: !716, line: 361, type: !531)
!721 = !DILocation(line: 0, scope: !715)
!722 = !DILocation(line: 363, column: 16, scope: !715)
!723 = !DILocation(line: 363, column: 10, scope: !715)
!724 = !DILocation(line: 363, column: 3, scope: !715)
!725 = distinct !DISubprogram(name: "atol", scope: !716, file: !716, line: 366, type: !726, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !728)
!726 = !DISubroutineType(types: !727)
!727 = !{!595, !531}
!728 = !{!729}
!729 = !DILocalVariable(name: "__nptr", arg: 1, scope: !725, file: !716, line: 366, type: !531)
!730 = !DILocation(line: 0, scope: !725)
!731 = !DILocation(line: 368, column: 10, scope: !725)
!732 = !DILocation(line: 368, column: 3, scope: !725)
!733 = distinct !DISubprogram(name: "atoll", scope: !716, file: !716, line: 373, type: !734, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !737)
!734 = !DISubroutineType(types: !735)
!735 = !{!736, !531}
!736 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!737 = !{!738}
!738 = !DILocalVariable(name: "__nptr", arg: 1, scope: !733, file: !716, line: 373, type: !531)
!739 = !DILocation(line: 0, scope: !733)
!740 = !DILocation(line: 375, column: 10, scope: !733)
!741 = !DILocation(line: 375, column: 3, scope: !733)
!742 = distinct !DISubprogram(name: "bsearch", scope: !743, file: !743, line: 20, type: !744, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !752)
!743 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!744 = !DISubroutineType(types: !745)
!745 = !{!530, !746, !746, !617, !617, !748}
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !716, line: 808, baseType: !749)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{!526, !746, !746}
!752 = !{!753, !754, !755, !756, !757, !758, !759, !760, !761, !762}
!753 = !DILocalVariable(name: "__key", arg: 1, scope: !742, file: !743, line: 20, type: !746)
!754 = !DILocalVariable(name: "__base", arg: 2, scope: !742, file: !743, line: 20, type: !746)
!755 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !742, file: !743, line: 20, type: !617)
!756 = !DILocalVariable(name: "__size", arg: 4, scope: !742, file: !743, line: 20, type: !617)
!757 = !DILocalVariable(name: "__compar", arg: 5, scope: !742, file: !743, line: 21, type: !748)
!758 = !DILocalVariable(name: "__l", scope: !742, file: !743, line: 23, type: !617)
!759 = !DILocalVariable(name: "__u", scope: !742, file: !743, line: 23, type: !617)
!760 = !DILocalVariable(name: "__idx", scope: !742, file: !743, line: 23, type: !617)
!761 = !DILocalVariable(name: "__p", scope: !742, file: !743, line: 24, type: !746)
!762 = !DILocalVariable(name: "__comparison", scope: !742, file: !743, line: 25, type: !526)
!763 = !DILocation(line: 0, scope: !742)
!764 = !DILocation(line: 29, column: 3, scope: !742)
!765 = !DILocation(line: 27, column: 7, scope: !742)
!766 = !DILocation(line: 29, column: 14, scope: !742)
!767 = !DILocation(line: 31, column: 20, scope: !768)
!768 = distinct !DILexicalBlock(scope: !742, file: !743, line: 30, column: 5)
!769 = !DILocation(line: 31, column: 27, scope: !768)
!770 = !DILocation(line: 32, column: 56, scope: !768)
!771 = !DILocation(line: 32, column: 47, scope: !768)
!772 = !DILocation(line: 33, column: 22, scope: !768)
!773 = !DILocation(line: 34, column: 24, scope: !774)
!774 = distinct !DILexicalBlock(scope: !768, file: !743, line: 34, column: 11)
!775 = !DILocation(line: 34, column: 11, scope: !768)
!776 = !DILocation(line: 36, column: 29, scope: !777)
!777 = distinct !DILexicalBlock(scope: !774, file: !743, line: 36, column: 16)
!778 = !DILocation(line: 36, column: 16, scope: !774)
!779 = !DILocation(line: 37, column: 14, scope: !777)
!780 = distinct !{!780, !764, !781}
!781 = !DILocation(line: 40, column: 5, scope: !742)
!782 = !DILocation(line: 43, column: 1, scope: !742)
!783 = distinct !DISubprogram(name: "atof", scope: !784, file: !784, line: 25, type: !785, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !788)
!784 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!785 = !DISubroutineType(types: !786)
!786 = !{!787, !531}
!787 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!788 = !{!789}
!789 = !DILocalVariable(name: "__nptr", arg: 1, scope: !783, file: !784, line: 25, type: !531)
!790 = !DILocation(line: 0, scope: !783)
!791 = !DILocation(line: 27, column: 10, scope: !783)
!792 = !DILocation(line: 27, column: 3, scope: !783)
!793 = distinct !DISubprogram(name: "strtoimax", scope: !794, file: !794, line: 324, type: !795, scopeLine: 326, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !801)
!794 = !DIFile(filename: "/usr/include/inttypes.h", directory: "")
!795 = !DISubroutineType(types: !796)
!796 = !{!797, !542, !800, !526}
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !798, line: 101, baseType: !799)
!798 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !594, line: 72, baseType: !595)
!800 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !527)
!801 = !{!802, !803, !804}
!802 = !DILocalVariable(name: "nptr", arg: 1, scope: !793, file: !794, line: 324, type: !542)
!803 = !DILocalVariable(name: "endptr", arg: 2, scope: !793, file: !794, line: 324, type: !800)
!804 = !DILocalVariable(name: "base", arg: 3, scope: !793, file: !794, line: 324, type: !526)
!805 = !DILocation(line: 0, scope: !793)
!806 = !DILocation(line: 327, column: 10, scope: !793)
!807 = !DILocation(line: 327, column: 3, scope: !793)
!808 = distinct !DISubprogram(name: "strtoumax", scope: !794, file: !794, line: 336, type: !809, scopeLine: 338, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !813)
!809 = !DISubroutineType(types: !810)
!810 = !{!811, !542, !800, !526}
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !798, line: 102, baseType: !812)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !594, line: 73, baseType: !619)
!813 = !{!814, !815, !816}
!814 = !DILocalVariable(name: "nptr", arg: 1, scope: !808, file: !794, line: 336, type: !542)
!815 = !DILocalVariable(name: "endptr", arg: 2, scope: !808, file: !794, line: 336, type: !800)
!816 = !DILocalVariable(name: "base", arg: 3, scope: !808, file: !794, line: 336, type: !526)
!817 = !DILocation(line: 0, scope: !808)
!818 = !DILocation(line: 339, column: 10, scope: !808)
!819 = !DILocation(line: 339, column: 3, scope: !808)
!820 = distinct !DISubprogram(name: "wcstoimax", scope: !794, file: !794, line: 348, type: !821, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !830)
!821 = !DISubroutineType(types: !822)
!822 = !{!797, !823, !827, !526}
!823 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !824)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !826)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gwchar_t", file: !794, line: 34, baseType: !526)
!827 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !828)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!830 = !{!831, !832, !833}
!831 = !DILocalVariable(name: "nptr", arg: 1, scope: !820, file: !794, line: 348, type: !823)
!832 = !DILocalVariable(name: "endptr", arg: 2, scope: !820, file: !794, line: 348, type: !827)
!833 = !DILocalVariable(name: "base", arg: 3, scope: !820, file: !794, line: 348, type: !526)
!834 = !DILocation(line: 0, scope: !820)
!835 = !DILocation(line: 351, column: 10, scope: !820)
!836 = !DILocation(line: 351, column: 3, scope: !820)
!837 = distinct !DISubprogram(name: "wcstoumax", scope: !794, file: !794, line: 362, type: !838, scopeLine: 364, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !840)
!838 = !DISubroutineType(types: !839)
!839 = !{!811, !823, !827, !526}
!840 = !{!841, !842, !843}
!841 = !DILocalVariable(name: "nptr", arg: 1, scope: !837, file: !794, line: 362, type: !823)
!842 = !DILocalVariable(name: "endptr", arg: 2, scope: !837, file: !794, line: 362, type: !827)
!843 = !DILocalVariable(name: "base", arg: 3, scope: !837, file: !794, line: 362, type: !526)
!844 = !DILocation(line: 0, scope: !837)
!845 = !DILocation(line: 365, column: 10, scope: !837)
!846 = !DILocation(line: 365, column: 3, scope: !837)
!847 = distinct !DISubprogram(name: "stat", scope: !848, file: !848, line: 453, type: !849, scopeLine: 454, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !888)
!848 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "")
!849 = !DISubroutineType(types: !850)
!850 = !{!526, !531, !851}
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !853, line: 46, size: 1152, elements: !854)
!853 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!854 = !{!855, !857, !859, !861, !863, !865, !867, !868, !869, !870, !872, !874, !882, !883, !884}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !852, file: !853, line: 48, baseType: !856, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !594, line: 145, baseType: !619)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !852, file: !853, line: 53, baseType: !858, size: 64, offset: 64)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !594, line: 148, baseType: !619)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !852, file: !853, line: 61, baseType: !860, size: 64, offset: 128)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !594, line: 151, baseType: !619)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !852, file: !853, line: 62, baseType: !862, size: 32, offset: 192)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !594, line: 150, baseType: !5)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !852, file: !853, line: 64, baseType: !864, size: 32, offset: 224)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !594, line: 146, baseType: !5)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !852, file: !853, line: 65, baseType: !866, size: 32, offset: 256)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !594, line: 147, baseType: !5)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !852, file: !853, line: 67, baseType: !526, size: 32, offset: 288)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !852, file: !853, line: 69, baseType: !856, size: 64, offset: 320)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !852, file: !853, line: 74, baseType: !593, size: 64, offset: 384)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !852, file: !853, line: 78, baseType: !871, size: 64, offset: 448)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !594, line: 174, baseType: !595)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !852, file: !853, line: 80, baseType: !873, size: 64, offset: 512)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !594, line: 179, baseType: !595)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !852, file: !853, line: 91, baseType: !875, size: 128, offset: 576)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !876, line: 10, size: 128, elements: !877)
!876 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!877 = !{!878, !880}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !875, file: !876, line: 12, baseType: !879, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !594, line: 160, baseType: !595)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !875, file: !876, line: 16, baseType: !881, size: 64, offset: 64)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !594, line: 196, baseType: !595)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !852, file: !853, line: 92, baseType: !875, size: 128, offset: 704)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !852, file: !853, line: 93, baseType: !875, size: 128, offset: 832)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !852, file: !853, line: 106, baseType: !885, size: 192, offset: 960)
!885 = !DICompositeType(tag: DW_TAG_array_type, baseType: !881, size: 192, elements: !886)
!886 = !{!887}
!887 = !DISubrange(count: 3)
!888 = !{!889, !890}
!889 = !DILocalVariable(name: "__path", arg: 1, scope: !847, file: !848, line: 453, type: !531)
!890 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !847, file: !848, line: 453, type: !851)
!891 = !DILocation(line: 0, scope: !847)
!892 = !DILocation(line: 455, column: 10, scope: !847)
!893 = !DILocation(line: 455, column: 3, scope: !847)
!894 = distinct !DISubprogram(name: "lstat", scope: !848, file: !848, line: 460, type: !849, scopeLine: 461, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !895)
!895 = !{!896, !897}
!896 = !DILocalVariable(name: "__path", arg: 1, scope: !894, file: !848, line: 460, type: !531)
!897 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !894, file: !848, line: 460, type: !851)
!898 = !DILocation(line: 0, scope: !894)
!899 = !DILocation(line: 462, column: 10, scope: !894)
!900 = !DILocation(line: 462, column: 3, scope: !894)
!901 = distinct !DISubprogram(name: "fstat", scope: !848, file: !848, line: 467, type: !902, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !904)
!902 = !DISubroutineType(types: !903)
!903 = !{!526, !526, !851}
!904 = !{!905, !906}
!905 = !DILocalVariable(name: "__fd", arg: 1, scope: !901, file: !848, line: 467, type: !526)
!906 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !901, file: !848, line: 467, type: !851)
!907 = !DILocation(line: 0, scope: !901)
!908 = !DILocation(line: 469, column: 10, scope: !901)
!909 = !DILocation(line: 469, column: 3, scope: !901)
!910 = distinct !DISubprogram(name: "fstatat", scope: !848, file: !848, line: 474, type: !911, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !913)
!911 = !DISubroutineType(types: !912)
!912 = !{!526, !526, !531, !851, !526}
!913 = !{!914, !915, !916, !917}
!914 = !DILocalVariable(name: "__fd", arg: 1, scope: !910, file: !848, line: 474, type: !526)
!915 = !DILocalVariable(name: "__filename", arg: 2, scope: !910, file: !848, line: 474, type: !531)
!916 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !910, file: !848, line: 474, type: !851)
!917 = !DILocalVariable(name: "__flag", arg: 4, scope: !910, file: !848, line: 474, type: !526)
!918 = !DILocation(line: 0, scope: !910)
!919 = !DILocation(line: 477, column: 10, scope: !910)
!920 = !DILocation(line: 477, column: 3, scope: !910)
!921 = distinct !DISubprogram(name: "mknod", scope: !848, file: !848, line: 483, type: !922, scopeLine: 484, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !924)
!922 = !DISubroutineType(types: !923)
!923 = !{!526, !531, !862, !856}
!924 = !{!925, !926, !927}
!925 = !DILocalVariable(name: "__path", arg: 1, scope: !921, file: !848, line: 483, type: !531)
!926 = !DILocalVariable(name: "__mode", arg: 2, scope: !921, file: !848, line: 483, type: !862)
!927 = !DILocalVariable(name: "__dev", arg: 3, scope: !921, file: !848, line: 483, type: !856)
!928 = !DILocation(line: 0, scope: !921)
!929 = !DILocation(line: 485, column: 10, scope: !921)
!930 = !DILocation(line: 485, column: 3, scope: !921)
!931 = distinct !DISubprogram(name: "mknodat", scope: !848, file: !848, line: 491, type: !932, scopeLine: 493, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !934)
!932 = !DISubroutineType(types: !933)
!933 = !{!526, !526, !531, !862, !856}
!934 = !{!935, !936, !937, !938}
!935 = !DILocalVariable(name: "__fd", arg: 1, scope: !931, file: !848, line: 491, type: !526)
!936 = !DILocalVariable(name: "__path", arg: 2, scope: !931, file: !848, line: 491, type: !531)
!937 = !DILocalVariable(name: "__mode", arg: 3, scope: !931, file: !848, line: 491, type: !862)
!938 = !DILocalVariable(name: "__dev", arg: 4, scope: !931, file: !848, line: 491, type: !856)
!939 = !DILocation(line: 0, scope: !931)
!940 = !DILocation(line: 494, column: 10, scope: !931)
!941 = !DILocation(line: 494, column: 3, scope: !931)
!942 = distinct !DISubprogram(name: "stat64", scope: !848, file: !848, line: 502, type: !943, scopeLine: 503, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !965)
!943 = !DISubroutineType(types: !944)
!944 = !{!526, !531, !945}
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !853, line: 119, size: 1152, elements: !947)
!947 = !{!948, !949, !951, !952, !953, !954, !955, !956, !957, !958, !959, !961, !962, !963, !964}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !946, file: !853, line: 121, baseType: !856, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !946, file: !853, line: 123, baseType: !950, size: 64, offset: 64)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !594, line: 149, baseType: !619)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !946, file: !853, line: 124, baseType: !860, size: 64, offset: 128)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !946, file: !853, line: 125, baseType: !862, size: 32, offset: 192)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !946, file: !853, line: 132, baseType: !864, size: 32, offset: 224)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !946, file: !853, line: 133, baseType: !866, size: 32, offset: 256)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !946, file: !853, line: 135, baseType: !526, size: 32, offset: 288)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !946, file: !853, line: 136, baseType: !856, size: 64, offset: 320)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !946, file: !853, line: 137, baseType: !593, size: 64, offset: 384)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !946, file: !853, line: 143, baseType: !871, size: 64, offset: 448)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !946, file: !853, line: 144, baseType: !960, size: 64, offset: 512)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !594, line: 180, baseType: !595)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !946, file: !853, line: 152, baseType: !875, size: 128, offset: 576)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !946, file: !853, line: 153, baseType: !875, size: 128, offset: 704)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !946, file: !853, line: 154, baseType: !875, size: 128, offset: 832)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !946, file: !853, line: 164, baseType: !885, size: 192, offset: 960)
!965 = !{!966, !967}
!966 = !DILocalVariable(name: "__path", arg: 1, scope: !942, file: !848, line: 502, type: !531)
!967 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !942, file: !848, line: 502, type: !945)
!968 = !DILocation(line: 0, scope: !942)
!969 = !DILocation(line: 504, column: 10, scope: !942)
!970 = !DILocation(line: 504, column: 3, scope: !942)
!971 = distinct !DISubprogram(name: "lstat64", scope: !848, file: !848, line: 509, type: !943, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !972)
!972 = !{!973, !974}
!973 = !DILocalVariable(name: "__path", arg: 1, scope: !971, file: !848, line: 509, type: !531)
!974 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !971, file: !848, line: 509, type: !945)
!975 = !DILocation(line: 0, scope: !971)
!976 = !DILocation(line: 511, column: 10, scope: !971)
!977 = !DILocation(line: 511, column: 3, scope: !971)
!978 = distinct !DISubprogram(name: "fstat64", scope: !848, file: !848, line: 516, type: !979, scopeLine: 517, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !981)
!979 = !DISubroutineType(types: !980)
!980 = !{!526, !526, !945}
!981 = !{!982, !983}
!982 = !DILocalVariable(name: "__fd", arg: 1, scope: !978, file: !848, line: 516, type: !526)
!983 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !978, file: !848, line: 516, type: !945)
!984 = !DILocation(line: 0, scope: !978)
!985 = !DILocation(line: 518, column: 10, scope: !978)
!986 = !DILocation(line: 518, column: 3, scope: !978)
!987 = distinct !DISubprogram(name: "fstatat64", scope: !848, file: !848, line: 523, type: !988, scopeLine: 525, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !990)
!988 = !DISubroutineType(types: !989)
!989 = !{!526, !526, !531, !945, !526}
!990 = !{!991, !992, !993, !994}
!991 = !DILocalVariable(name: "__fd", arg: 1, scope: !987, file: !848, line: 523, type: !526)
!992 = !DILocalVariable(name: "__filename", arg: 2, scope: !987, file: !848, line: 523, type: !531)
!993 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !987, file: !848, line: 523, type: !945)
!994 = !DILocalVariable(name: "__flag", arg: 4, scope: !987, file: !848, line: 523, type: !526)
!995 = !DILocation(line: 0, scope: !987)
!996 = !DILocation(line: 526, column: 10, scope: !987)
!997 = !DILocation(line: 526, column: 3, scope: !987)
!998 = distinct !DISubprogram(name: "df_compute_accessed_bytes", scope: !1, file: !1, line: 303, type: !999, scopeLine: 306, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !2118)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!525, !1001, !375, !2117, !2117}
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "df_ref", file: !376, line: 429, baseType: !1002)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "df_ref_d", file: !376, line: 422, size: 704, elements: !1004)
!1004 = !{!1005, !2099, !2105, !2110}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1003, file: !376, line: 424, baseType: !1006, size: 512)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "df_base_ref", file: !376, line: 356, size: 512, elements: !1007)
!1007 = !{!1008, !1009, !1010, !1011, !2067, !2073, !2094, !2095, !2096, !2097, !2098}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !1006, file: !376, line: 360, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1006, file: !376, line: 362, baseType: !5, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1006, file: !376, line: 364, baseType: !526, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1006, file: !376, line: 365, baseType: !1012, size: 64, offset: 64)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !1013, line: 50, baseType: !1014)
!1013 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !381, line: 240, size: 384, elements: !1016)
!1016 = !{!1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1015, file: !381, line: 242, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1015, file: !381, line: 245, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !1015, file: !381, line: 252, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !1015, file: !381, line: 257, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !1015, file: !381, line: 265, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !1015, file: !381, line: 277, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !1015, file: !381, line: 291, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1015, file: !381, line: 298, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !1015, file: !381, line: 305, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !1015, file: !381, line: 310, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1015, file: !381, line: 321, baseType: !1028, size: 320, offset: 64)
!1028 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !381, line: 315, size: 320, elements: !1029)
!1029 = !{!1030, !2002, !2004, !2065, !2066}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1028, file: !381, line: 316, baseType: !1031, size: 64)
!1031 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1032, size: 64, elements: !601)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !381, line: 183, baseType: !1033)
!1033 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !381, line: 166, size: 64, elements: !1034)
!1034 = !{!1035, !1036, !1037, !1038, !1039, !1047, !1048, !1060, !1063, !1123, !1980, !1981, !1992, !1999}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !1033, file: !381, line: 168, baseType: !526, size: 32)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !1033, file: !381, line: 169, baseType: !5, size: 32)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !1033, file: !381, line: 170, baseType: !531, size: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !1033, file: !381, line: 171, baseType: !1012, size: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !1033, file: !381, line: 172, baseType: !1040, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !1013, line: 53, baseType: !1041)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !381, line: 359, size: 128, elements: !1043)
!1043 = !{!1044, !1045}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !1042, file: !381, line: 360, baseType: !526, size: 32)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !1042, file: !381, line: 361, baseType: !1046, size: 64, offset: 64)
!1046 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1012, size: 64, elements: !601)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !1033, file: !381, line: 173, baseType: !3, size: 32)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !1033, file: !381, line: 174, baseType: !1049, size: 32)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !381, line: 133, baseType: !1050)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !381, line: 115, size: 32, elements: !1051)
!1051 = !{!1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !1050, file: !381, line: 118, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !1050, file: !381, line: 120, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !1050, file: !381, line: 121, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !1050, file: !381, line: 123, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !1050, file: !381, line: 125, baseType: !5, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !1050, file: !381, line: 127, baseType: !5, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !1050, file: !381, line: 130, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1050, file: !381, line: 132, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !1033, file: !381, line: 175, baseType: !1061, size: 64)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !381, line: 175, flags: DIFlagFwdDecl)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !1033, file: !381, line: 176, baseType: !1064, size: 64)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1066, line: 75, size: 256, elements: !1067)
!1066 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1067 = !{!1068, !1082, !1083, !1084}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1065, file: !1066, line: 76, baseType: !1069, size: 64)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1066, line: 68, baseType: !1071)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1066, line: 63, size: 320, elements: !1072)
!1072 = !{!1073, !1075, !1076, !1077}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1071, file: !1066, line: 64, baseType: !1074, size: 64)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1071, file: !1066, line: 65, baseType: !1074, size: 64, offset: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1071, file: !1066, line: 66, baseType: !5, size: 32, offset: 128)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1071, file: !1066, line: 67, baseType: !1078, size: 128, offset: 192)
!1078 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1079, size: 128, elements: !1080)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1066, line: 29, baseType: !619)
!1080 = !{!1081}
!1081 = !DISubrange(count: 2)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1065, file: !1066, line: 77, baseType: !1069, size: 64, offset: 64)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1065, file: !1066, line: 78, baseType: !5, size: 32, offset: 128)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1065, file: !1066, line: 79, baseType: !1085, size: 64, offset: 192)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1066, line: 49, baseType: !1087)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1066, line: 45, size: 832, elements: !1088)
!1088 = !{!1089, !1090, !1091}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1087, file: !1066, line: 46, baseType: !1074, size: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1087, file: !1066, line: 47, baseType: !1064, size: 64, offset: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1087, file: !1066, line: 48, baseType: !1092, size: 704, offset: 128)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1093, line: 164, size: 704, elements: !1094)
!1093 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1094 = !{!1095, !1096, !1106, !1107, !1108, !1109, !1110, !1111, !1115, !1119, !1120, !1121, !1122}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1092, file: !1093, line: 166, baseType: !595, size: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1092, file: !1093, line: 167, baseType: !1097, size: 64, offset: 64)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1093, line: 157, size: 192, elements: !1099)
!1099 = !{!1100, !1101, !1102}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1098, file: !1093, line: 159, baseType: !528, size: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1098, file: !1093, line: 160, baseType: !1097, size: 64, offset: 64)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1098, file: !1093, line: 161, baseType: !1103, size: 32, offset: 128)
!1103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !529, size: 32, elements: !1104)
!1104 = !{!1105}
!1105 = !DISubrange(count: 4)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1092, file: !1093, line: 168, baseType: !528, size: 64, offset: 128)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1092, file: !1093, line: 169, baseType: !528, size: 64, offset: 192)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1092, file: !1093, line: 170, baseType: !528, size: 64, offset: 256)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1092, file: !1093, line: 171, baseType: !595, size: 64, offset: 320)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1092, file: !1093, line: 172, baseType: !526, size: 32, offset: 384)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1092, file: !1093, line: 176, baseType: !1112, size: 64, offset: 448)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64)
!1113 = !DISubroutineType(types: !1114)
!1114 = !{!1097, !530, !595}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1092, file: !1093, line: 177, baseType: !1116, size: 64, offset: 512)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64)
!1117 = !DISubroutineType(types: !1118)
!1118 = !{null, !530, !1097}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1092, file: !1093, line: 178, baseType: !530, size: 64, offset: 576)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1092, file: !1093, line: 179, baseType: !5, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1092, file: !1093, line: 180, baseType: !5, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1092, file: !1093, line: 184, baseType: !5, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !1033, file: !381, line: 177, baseType: !1124, size: 64)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !1013, line: 56, baseType: !1125)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !149, line: 3371, size: 1792, elements: !1127)
!1127 = !{!1128, !1161, !1167, !1178, !1195, !1206, !1211, !1217, !1223, !1236, !1248, !1286, !1291, !1319, !1327, !1328, !1333, !1342, !1348, !1353, !1357, !1361, !1605, !1654, !1660, !1667, !1674, !1700, !1725, !1742, !1754, !1776, !1791, !1962}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1126, file: !149, line: 3372, baseType: !1129, size: 64)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !149, line: 360, size: 64, elements: !1130)
!1130 = !{!1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1129, file: !149, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !1129, file: !149, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !1129, file: !149, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !1129, file: !149, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !1129, file: !149, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !1129, file: !149, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !1129, file: !149, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !1129, file: !149, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !1129, file: !149, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !1129, file: !149, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !1129, file: !149, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !1129, file: !149, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !1129, file: !149, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !1129, file: !149, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !1129, file: !149, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !1129, file: !149, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !1129, file: !149, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !1129, file: !149, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1129, file: !149, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1129, file: !149, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1129, file: !149, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1129, file: !149, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1129, file: !149, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1129, file: !149, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1129, file: !149, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1129, file: !149, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !1129, file: !149, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !1129, file: !149, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !1129, file: !149, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !1129, file: !149, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1126, file: !149, line: 3373, baseType: !1162, size: 192)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !149, line: 402, size: 192, elements: !1163)
!1163 = !{!1164, !1165, !1166}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1162, file: !149, line: 403, baseType: !1129, size: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !1162, file: !149, line: 404, baseType: !1124, size: 64, offset: 64)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1162, file: !149, line: 405, baseType: !1124, size: 64, offset: 128)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1126, file: !149, line: 3374, baseType: !1168, size: 320)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !149, line: 1384, size: 320, elements: !1169)
!1169 = !{!1170, !1171}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1168, file: !149, line: 1385, baseType: !1162, size: 192)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1168, file: !149, line: 1386, baseType: !1172, size: 128, offset: 192)
!1172 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !1173, line: 58, baseType: !1174)
!1173 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1173, line: 54, size: 128, elements: !1175)
!1175 = !{!1176, !1177}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !1174, file: !1173, line: 56, baseType: !619, size: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !1174, file: !1173, line: 57, baseType: !595, size: 64, offset: 64)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !1126, file: !149, line: 3375, baseType: !1179, size: 256)
!1179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !149, line: 1397, size: 256, elements: !1180)
!1180 = !{!1181, !1182}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1179, file: !149, line: 1398, baseType: !1162, size: 192)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !1179, file: !149, line: 1399, baseType: !1183, size: 64, offset: 192)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64)
!1184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !1185, line: 52, size: 256, elements: !1186)
!1185 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1186 = !{!1187, !1188, !1189, !1190, !1191, !1192, !1193}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !1184, file: !1185, line: 56, baseType: !5, size: 2, flags: DIFlagBitField, extraData: i64 0)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !1184, file: !1185, line: 57, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !1184, file: !1185, line: 58, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !1184, file: !1185, line: 59, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1184, file: !1185, line: 60, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !1184, file: !1185, line: 61, baseType: !5, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !1184, file: !1185, line: 62, baseType: !1194, size: 192, offset: 64)
!1194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !619, size: 192, elements: !886)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !1126, file: !149, line: 3376, baseType: !1196, size: 256)
!1196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !149, line: 1408, size: 256, elements: !1197)
!1197 = !{!1198, !1199}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1196, file: !149, line: 1409, baseType: !1162, size: 192)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !1196, file: !149, line: 1410, baseType: !1200, size: 64, offset: 192)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64)
!1201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !1202, line: 27, size: 192, elements: !1203)
!1202 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1203 = !{!1204, !1205}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1201, file: !1202, line: 29, baseType: !1172, size: 128)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1201, file: !1202, line: 30, baseType: !3, size: 32, offset: 128)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !1126, file: !149, line: 3377, baseType: !1207, size: 256)
!1207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !149, line: 1437, size: 256, elements: !1208)
!1208 = !{!1209, !1210}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1207, file: !149, line: 1438, baseType: !1162, size: 192)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1207, file: !149, line: 1439, baseType: !1124, size: 64, offset: 192)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1126, file: !149, line: 3378, baseType: !1212, size: 256)
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !149, line: 1418, size: 256, elements: !1213)
!1213 = !{!1214, !1215, !1216}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1212, file: !149, line: 1419, baseType: !1162, size: 192)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1212, file: !149, line: 1420, baseType: !526, size: 32, offset: 192)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1212, file: !149, line: 1421, baseType: !600, size: 8, offset: 224)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !1126, file: !149, line: 3379, baseType: !1218, size: 320)
!1218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !149, line: 1428, size: 320, elements: !1219)
!1219 = !{!1220, !1221, !1222}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1218, file: !149, line: 1429, baseType: !1162, size: 192)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !1218, file: !149, line: 1430, baseType: !1124, size: 64, offset: 192)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !1218, file: !149, line: 1431, baseType: !1124, size: 64, offset: 256)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !1126, file: !149, line: 3380, baseType: !1224, size: 320)
!1224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !149, line: 1460, size: 320, elements: !1225)
!1225 = !{!1226, !1227}
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1224, file: !149, line: 1461, baseType: !1162, size: 192)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1224, file: !149, line: 1462, baseType: !1228, size: 128, offset: 192)
!1228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1229, line: 31, size: 128, elements: !1230)
!1229 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1230 = !{!1231, !1234, !1235}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1228, file: !1229, line: 32, baseType: !1232, size: 64)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64)
!1233 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !525)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1228, file: !1229, line: 33, baseType: !5, size: 32, offset: 64)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1228, file: !1229, line: 34, baseType: !5, size: 32, offset: 96)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !1126, file: !149, line: 3381, baseType: !1237, size: 384)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !149, line: 2507, size: 384, elements: !1238)
!1238 = !{!1239, !1240, !1245, !1246, !1247}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1237, file: !149, line: 2508, baseType: !1162, size: 192)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1237, file: !149, line: 2509, baseType: !1241, size: 32, offset: 192)
!1241 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1242, line: 58, baseType: !1243)
!1242 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1243 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1244, line: 44, baseType: !5)
!1244 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1237, file: !149, line: 2510, baseType: !5, size: 32, offset: 224)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1237, file: !149, line: 2511, baseType: !1124, size: 64, offset: 256)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1237, file: !149, line: 2512, baseType: !1124, size: 64, offset: 320)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !1126, file: !149, line: 3382, baseType: !1249, size: 896)
!1249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !149, line: 2652, size: 896, elements: !1250)
!1250 = !{!1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1249, file: !149, line: 2653, baseType: !1237, size: 384)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1249, file: !149, line: 2654, baseType: !1124, size: 64, offset: 384)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1249, file: !149, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1249, file: !149, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1249, file: !149, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1249, file: !149, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1249, file: !149, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1249, file: !149, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1249, file: !149, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1249, file: !149, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1249, file: !149, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1249, file: !149, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1249, file: !149, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1249, file: !149, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1249, file: !149, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1249, file: !149, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1249, file: !149, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1249, file: !149, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1249, file: !149, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1249, file: !149, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1249, file: !149, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1249, file: !149, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1249, file: !149, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1249, file: !149, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1249, file: !149, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1249, file: !149, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1249, file: !149, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1249, file: !149, line: 2703, baseType: !5, size: 32, offset: 512)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1249, file: !149, line: 2705, baseType: !1124, size: 64, offset: 576)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1249, file: !149, line: 2706, baseType: !1124, size: 64, offset: 640)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1249, file: !149, line: 2707, baseType: !1124, size: 64, offset: 704)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1249, file: !149, line: 2708, baseType: !1124, size: 64, offset: 768)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1249, file: !149, line: 2711, baseType: !1284, size: 64, offset: 832)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64)
!1285 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !149, line: 2711, flags: DIFlagFwdDecl)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !1126, file: !149, line: 3383, baseType: !1287, size: 960)
!1287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !149, line: 2756, size: 960, elements: !1288)
!1288 = !{!1289, !1290}
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1287, file: !149, line: 2757, baseType: !1249, size: 896)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1287, file: !149, line: 2758, baseType: !1012, size: 64, offset: 896)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !1126, file: !149, line: 3384, baseType: !1292, size: 1472)
!1292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !149, line: 3114, size: 1472, elements: !1293)
!1293 = !{!1294, !1315, !1316, !1317, !1318}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1292, file: !149, line: 3115, baseType: !1295, size: 1216)
!1295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !149, line: 2984, size: 1216, elements: !1296)
!1296 = !{!1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1295, file: !149, line: 2985, baseType: !1287, size: 960)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1295, file: !149, line: 2986, baseType: !1124, size: 64, offset: 960)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1295, file: !149, line: 2987, baseType: !1124, size: 64, offset: 1024)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1295, file: !149, line: 2988, baseType: !1124, size: 64, offset: 1088)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1295, file: !149, line: 2991, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1295, file: !149, line: 2992, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1295, file: !149, line: 2993, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1295, file: !149, line: 2994, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1295, file: !149, line: 2995, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1295, file: !149, line: 2996, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1295, file: !149, line: 2998, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1295, file: !149, line: 3000, baseType: !5, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1295, file: !149, line: 3002, baseType: !5, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1295, file: !149, line: 3003, baseType: !5, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1295, file: !149, line: 3004, baseType: !5, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1295, file: !149, line: 3005, baseType: !5, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1295, file: !149, line: 3007, baseType: !5, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1295, file: !149, line: 3010, baseType: !5, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1292, file: !149, line: 3117, baseType: !1124, size: 64, offset: 1216)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1292, file: !149, line: 3119, baseType: !1124, size: 64, offset: 1280)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1292, file: !149, line: 3121, baseType: !1124, size: 64, offset: 1344)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1292, file: !149, line: 3123, baseType: !1124, size: 64, offset: 1408)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !1126, file: !149, line: 3385, baseType: !1320, size: 1088)
!1320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !149, line: 2874, size: 1088, elements: !1321)
!1321 = !{!1322, !1323, !1324}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1320, file: !149, line: 2875, baseType: !1287, size: 960)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1320, file: !149, line: 2876, baseType: !1012, size: 64, offset: 960)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1320, file: !149, line: 2877, baseType: !1325, size: 64, offset: 1024)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64)
!1326 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !149, line: 2856, flags: DIFlagFwdDecl)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !1126, file: !149, line: 3386, baseType: !1295, size: 1216)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !1126, file: !149, line: 3387, baseType: !1329, size: 1280)
!1329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !149, line: 3093, size: 1280, elements: !1330)
!1330 = !{!1331, !1332}
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1329, file: !149, line: 3094, baseType: !1295, size: 1216)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1329, file: !149, line: 3095, baseType: !1325, size: 64, offset: 1216)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !1126, file: !149, line: 3388, baseType: !1334, size: 1216)
!1334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !149, line: 2824, size: 1216, elements: !1335)
!1335 = !{!1336, !1337, !1338, !1339, !1340, !1341}
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1334, file: !149, line: 2825, baseType: !1249, size: 896)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1334, file: !149, line: 2827, baseType: !1124, size: 64, offset: 896)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1334, file: !149, line: 2828, baseType: !1124, size: 64, offset: 960)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1334, file: !149, line: 2829, baseType: !1124, size: 64, offset: 1024)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1334, file: !149, line: 2830, baseType: !1124, size: 64, offset: 1088)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1334, file: !149, line: 2831, baseType: !1124, size: 64, offset: 1152)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !1126, file: !149, line: 3389, baseType: !1343, size: 1024)
!1343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !149, line: 2850, size: 1024, elements: !1344)
!1344 = !{!1345, !1346, !1347}
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1343, file: !149, line: 2851, baseType: !1287, size: 960)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1343, file: !149, line: 2852, baseType: !526, size: 32, offset: 960)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1343, file: !149, line: 2853, baseType: !526, size: 32, offset: 992)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !1126, file: !149, line: 3390, baseType: !1349, size: 1024)
!1349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !149, line: 2857, size: 1024, elements: !1350)
!1350 = !{!1351, !1352}
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1349, file: !149, line: 2858, baseType: !1287, size: 960)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1349, file: !149, line: 2859, baseType: !1325, size: 64, offset: 960)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !1126, file: !149, line: 3391, baseType: !1354, size: 960)
!1354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !149, line: 2862, size: 960, elements: !1355)
!1355 = !{!1356}
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1354, file: !149, line: 2863, baseType: !1287, size: 960)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !1126, file: !149, line: 3392, baseType: !1358, size: 1472)
!1358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !149, line: 3304, size: 1472, elements: !1359)
!1359 = !{!1360}
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1358, file: !149, line: 3305, baseType: !1292, size: 1472)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !1126, file: !149, line: 3393, baseType: !1362, size: 1792)
!1362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !149, line: 3248, size: 1792, elements: !1363)
!1363 = !{!1364, !1365, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1362, file: !149, line: 3249, baseType: !1292, size: 1472)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1362, file: !149, line: 3251, baseType: !1366, size: 64, offset: 1472)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64)
!1367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1368, line: 463, size: 1152, elements: !1369)
!1368 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1369 = !{!1370, !1373, !1477, !1478, !1481, !1484, !1529, !1530, !1531, !1532, !1533, !1557, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583}
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1367, file: !1368, line: 464, baseType: !1371, size: 64)
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64)
!1372 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1368, line: 464, flags: DIFlagFwdDecl)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1367, file: !1368, line: 467, baseType: !1374, size: 64, offset: 64)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64)
!1375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !133, line: 374, size: 640, elements: !1376)
!1376 = !{!1377, !1452, !1453, !1466, !1467, !1468, !1469, !1470, !1471, !1473, !1475, !1476}
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1375, file: !133, line: 377, baseType: !1378, size: 64)
!1378 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !1013, line: 111, baseType: !1379)
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64)
!1380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !133, line: 217, size: 832, elements: !1381)
!1381 = !{!1382, !1417, !1418, !1419, !1422, !1426, !1427, !1428, !1446, !1447, !1448, !1449, !1450, !1451}
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1380, file: !133, line: 219, baseType: !1383, size: 64)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64)
!1384 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !133, line: 151, baseType: !1385)
!1385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !133, line: 151, size: 128, elements: !1386)
!1386 = !{!1387}
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1385, file: !133, line: 151, baseType: !1388, size: 128)
!1388 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !133, line: 150, baseType: !1389)
!1389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !133, line: 150, size: 128, elements: !1390)
!1390 = !{!1391, !1392, !1393}
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1389, file: !133, line: 150, baseType: !5, size: 32)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1389, file: !133, line: 150, baseType: !5, size: 32, offset: 32)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1389, file: !133, line: 150, baseType: !1394, size: 64, offset: 64)
!1394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1395, size: 64, elements: !601)
!1395 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !1013, line: 108, baseType: !1396)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64)
!1397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !133, line: 122, size: 512, elements: !1398)
!1398 = !{!1399, !1400, !1401, !1409, !1410, !1411, !1412, !1413, !1414, !1415}
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1397, file: !133, line: 124, baseType: !1379, size: 64)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1397, file: !133, line: 125, baseType: !1379, size: 64, offset: 64)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1397, file: !133, line: 131, baseType: !1402, size: 64, offset: 128)
!1402 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !133, line: 128, size: 64, elements: !1403)
!1403 = !{!1404, !1408}
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1402, file: !133, line: 129, baseType: !1405, size: 64)
!1405 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !1013, line: 66, baseType: !1406)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64)
!1407 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !1013, line: 65, flags: DIFlagFwdDecl)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1402, file: !133, line: 130, baseType: !1012, size: 64)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1397, file: !133, line: 134, baseType: !530, size: 64, offset: 192)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1397, file: !133, line: 137, baseType: !1124, size: 64, offset: 256)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1397, file: !133, line: 138, baseType: !1241, size: 32, offset: 320)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1397, file: !133, line: 142, baseType: !5, size: 32, offset: 352)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1397, file: !133, line: 144, baseType: !526, size: 32, offset: 384)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1397, file: !133, line: 145, baseType: !526, size: 32, offset: 416)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1397, file: !133, line: 146, baseType: !1416, size: 64, offset: 448)
!1416 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !133, line: 119, baseType: !595)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1380, file: !133, line: 220, baseType: !1383, size: 64, offset: 64)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1380, file: !133, line: 223, baseType: !530, size: 64, offset: 128)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1380, file: !133, line: 226, baseType: !1420, size: 64, offset: 192)
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64)
!1421 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !133, line: 185, flags: DIFlagFwdDecl)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1380, file: !133, line: 229, baseType: !1423, size: 128, offset: 256)
!1423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1424, size: 128, elements: !1080)
