; ModuleID = 'df-core.bc'
source_filename = "df-core.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.df = type { [8 x %struct.dataflow*], [8 x %struct.dataflow*], %struct.bitmap_head_def*, %struct.df_ref_info, %struct.df_ref_info, %struct.df_reg_info**, %struct.df_reg_info**, %struct.df_reg_info**, i32, i32, %struct.df_insn_info**, i32, i32, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, i32*, i32*, i32, i32, i32*, i32, i8, i8, i8 }
%struct.dataflow = type { %struct.df_problem*, i8**, i32, %struct.alloc_pool_def*, %struct.bitmap_head_def*, i8*, i32, i8, i8, i8 }

!657 = !DIEnumerator(name: "LEU", value: 88, isUnsigned: true)
!658 = !DIEnumerator(name: "LTU", value: 89, isUnsigned: true)
!659 = !DIEnumerator(name: "UNORDERED", value: 90, isUnsigned: true)
!660 = !DIEnumerator(name: "ORDERED", value: 91, isUnsigned: true)
!661 = !DIEnumerator(name: "UNEQ", value: 92, isUnsigned: true)
!662 = !DIEnumerator(name: "UNGE", value: 93, isUnsigned: true)
!663 = !DIEnumerator(name: "UNGT", value: 94, isUnsigned: true)
!664 = !DIEnumerator(name: "UNLE", value: 95, isUnsigned: true)
!665 = !DIEnumerator(name: "UNLT", value: 96, isUnsigned: true)
!666 = !DIEnumerator(name: "LTGT", value: 97, isUnsigned: true)
!667 = !DIEnumerator(name: "SIGN_EXTEND", value: 98, isUnsigned: true)
!668 = !DIEnumerator(name: "ZERO_EXTEND", value: 99, isUnsigned: true)
!669 = !DIEnumerator(name: "TRUNCATE", value: 100, isUnsigned: true)
!670 = !DIEnumerator(name: "FLOAT_EXTEND", value: 101, isUnsigned: true)
!671 = !DIEnumerator(name: "FLOAT_TRUNCATE", value: 102, isUnsigned: true)
!672 = !DIEnumerator(name: "FLOAT", value: 103, isUnsigned: true)
!673 = !DIEnumerator(name: "FIX", value: 104, isUnsigned: true)
!674 = !DIEnumerator(name: "UNSIGNED_FLOAT", value: 105, isUnsigned: true)
!675 = !DIEnumerator(name: "UNSIGNED_FIX", value: 106, isUnsigned: true)
!676 = !DIEnumerator(name: "FRACT_CONVERT", value: 107, isUnsigned: true)
!677 = !DIEnumerator(name: "UNSIGNED_FRACT_CONVERT", value: 108, isUnsigned: true)
!678 = !DIEnumerator(name: "SAT_FRACT", value: 109, isUnsigned: true)
!679 = !DIEnumerator(name: "UNSIGNED_SAT_FRACT", value: 110, isUnsigned: true)
!680 = !DIEnumerator(name: "ABS", value: 111, isUnsigned: true)
!681 = !DIEnumerator(name: "SQRT", value: 112, isUnsigned: true)
!682 = !DIEnumerator(name: "BSWAP", value: 113, isUnsigned: true)
!683 = !DIEnumerator(name: "FFS", value: 114, isUnsigned: true)
!684 = !DIEnumerator(name: "CLZ", value: 115, isUnsigned: true)
!685 = !DIEnumerator(name: "CTZ", value: 116, isUnsigned: true)
!686 = !DIEnumerator(name: "POPCOUNT", value: 117, isUnsigned: true)
!687 = !DIEnumerator(name: "PARITY", value: 118, isUnsigned: true)
!688 = !DIEnumerator(name: "SIGN_EXTRACT", value: 119, isUnsigned: true)
!689 = !DIEnumerator(name: "ZERO_EXTRACT", value: 120, isUnsigned: true)
!690 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!691 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!692 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!693 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!694 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!695 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!696 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!697 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!698 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!699 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!700 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!701 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!702 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!703 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!704 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!705 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!706 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!707 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!708 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!709 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "df_ref_order", file: !6, line: 166, baseType: !7, size: 32, elements: !710)
!710 = !{!711, !712, !713, !714, !715, !716, !717}
!711 = !DIEnumerator(name: "DF_REF_ORDER_NO_TABLE", value: 0, isUnsigned: true)
!712 = !DIEnumerator(name: "DF_REF_ORDER_UNORDERED", value: 1, isUnsigned: true)
!713 = !DIEnumerator(name: "DF_REF_ORDER_UNORDERED_WITH_NOTES", value: 2, isUnsigned: true)
!714 = !DIEnumerator(name: "DF_REF_ORDER_BY_REG", value: 3, isUnsigned: true)
!715 = !DIEnumerator(name: "DF_REF_ORDER_BY_REG_WITH_NOTES", value: 4, isUnsigned: true)
!716 = !DIEnumerator(name: "DF_REF_ORDER_BY_INSN", value: 5, isUnsigned: true)
!717 = !DIEnumerator(name: "DF_REF_ORDER_BY_INSN_WITH_NOTES", value: 6, isUnsigned: true)
!718 = !{!719, !720, !721, !722, !725, !726, !728, !742, !1954, !1829, !1211, !566, !1955, !7, !760, !2068, !2069}
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!721 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !724)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dataflow", file: !6, line: 289, size: 448, elements: !730)
!730 = !{!731, !1924, !1925, !1926, !1948, !1949, !1950, !1951, !1952, !1953}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "problem", scope: !729, file: !6, line: 291, baseType: !732, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "df_problem", file: !6, line: 255, size: 1280, elements: !734)
!734 = !{!735, !736, !737, !805, !807, !1820, !1822, !1824, !1830, !1835, !1840, !1845, !1847, !1852, !1854, !1910, !1915, !1916, !1918, !1920, !1921, !1923}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !733, file: !6, line: 258, baseType: !7, size: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !733, file: !6, line: 259, baseType: !5, size: 32, offset: 32)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_fun", scope: !733, file: !6, line: 260, baseType: !738, size: 64, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "df_alloc_function", file: !6, line: 197, baseType: !739)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{null, !742}
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !743, line: 47, baseType: !744)
!743 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !746, line: 75, size: 256, elements: !747)
!746 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!747 = !{!748, !763, !764, !765}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !745, file: !746, line: 76, baseType: !749, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !746, line: 68, baseType: !751)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !746, line: 63, size: 320, elements: !752)
!752 = !{!753, !755, !756, !757}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !751, file: !746, line: 64, baseType: !754, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !751, file: !746, line: 65, baseType: !754, size: 64, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !751, file: !746, line: 66, baseType: !7, size: 32, offset: 128)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !751, file: !746, line: 67, baseType: !758, size: 128, offset: 192)
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !759, size: 128, elements: !761)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !746, line: 29, baseType: !760)
!760 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!761 = !{!762}
!762 = !DISubrange(count: 2)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !745, file: !746, line: 77, baseType: !749, size: 64, offset: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !745, file: !746, line: 78, baseType: !7, size: 32, offset: 128)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !745, file: !746, line: 79, baseType: !766, size: 64, offset: 192)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !746, line: 49, baseType: !768)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !746, line: 45, size: 832, elements: !769)
!769 = !{!770, !771, !772}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !768, file: !746, line: 46, baseType: !754, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !768, file: !746, line: 47, baseType: !744, size: 64, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !768, file: !746, line: 48, baseType: !773, size: 704, offset: 128)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !774, line: 164, size: 704, elements: !775)
!774 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!775 = !{!776, !778, !788, !789, !790, !791, !792, !793, !797, !801, !802, !803, !804}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !773, file: !774, line: 166, baseType: !777, size: 64)
!777 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !773, file: !774, line: 167, baseType: !779, size: 64, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !774, line: 157, size: 192, elements: !781)
!781 = !{!782, !783, !784}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !780, file: !774, line: 159, baseType: !723, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !780, file: !774, line: 160, baseType: !779, size: 64, offset: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !780, file: !774, line: 161, baseType: !785, size: 32, offset: 128)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !724, size: 32, elements: !786)
!786 = !{!787}
!787 = !DISubrange(count: 4)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !773, file: !774, line: 168, baseType: !723, size: 64, offset: 128)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !773, file: !774, line: 169, baseType: !723, size: 64, offset: 192)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !773, file: !774, line: 170, baseType: !723, size: 64, offset: 256)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !773, file: !774, line: 171, baseType: !777, size: 64, offset: 320)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !773, file: !774, line: 172, baseType: !721, size: 32, offset: 384)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !773, file: !774, line: 176, baseType: !794, size: 64, offset: 448)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DISubroutineType(types: !796)
!796 = !{!779, !725, !777}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !773, file: !774, line: 177, baseType: !798, size: 64, offset: 512)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DISubroutineType(types: !800)
!800 = !{null, !725, !779}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !773, file: !774, line: 178, baseType: !725, size: 64, offset: 576)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !773, file: !774, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !773, file: !774, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !773, file: !774, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "reset_fun", scope: !733, file: !6, line: 261, baseType: !806, size: 64, offset: 128)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "df_reset_function", file: !6, line: 205, baseType: !739)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "free_bb_fun", scope: !733, file: !6, line: 262, baseType: !808, size: 64, offset: 192)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "df_free_bb_function", file: !6, line: 209, baseType: !809)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{null, !812, !725}
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !743, line: 111, baseType: !813)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !141, line: 217, size: 832, elements: !815)
!815 = !{!816, !1785, !1786, !1787, !1790, !1794, !1795, !1796, !1814, !1815, !1816, !1817, !1818, !1819}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !814, file: !141, line: 219, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !141, line: 151, baseType: !819)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !141, line: 151, size: 128, elements: !820)
!820 = !{!821}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !819, file: !141, line: 151, baseType: !822, size: 128)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !141, line: 150, baseType: !823)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !141, line: 150, size: 128, elements: !824)
!824 = !{!825, !826, !827}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !823, file: !141, line: 150, baseType: !7, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !823, file: !141, line: 150, baseType: !7, size: 32, offset: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !823, file: !141, line: 150, baseType: !828, size: 64, offset: 64)
!828 = !DICompositeType(tag: DW_TAG_array_type, baseType: !829, size: 64, elements: !877)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !743, line: 108, baseType: !830)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !141, line: 122, size: 512, elements: !832)
!832 = !{!833, !834, !835, !1777, !1778, !1779, !1780, !1781, !1782, !1783}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !831, file: !141, line: 124, baseType: !813, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !831, file: !141, line: 125, baseType: !813, size: 64, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !831, file: !141, line: 131, baseType: !836, size: 64, offset: 128)
!836 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !141, line: 128, size: 64, elements: !837)
!837 = !{!838, !842}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !836, file: !141, line: 129, baseType: !839, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !743, line: 66, baseType: !840)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !743, line: 65, flags: DIFlagFwdDecl)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !836, file: !141, line: 130, baseType: !843, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !743, line: 50, baseType: !844)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !567, line: 240, size: 384, elements: !846)
!846 = !{!847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !845, file: !567, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !845, file: !567, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !845, file: !567, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !845, file: !567, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !845, file: !567, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !845, file: !567, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !845, file: !567, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !845, file: !567, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !845, file: !567, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !845, file: !567, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !845, file: !567, line: 321, baseType: !858, size: 320, offset: 64)
!858 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !567, line: 315, size: 320, elements: !859)
!859 = !{!860, !1712, !1714, !1775, !1776}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !858, file: !567, line: 316, baseType: !861, size: 64)
!861 = !DICompositeType(tag: DW_TAG_array_type, baseType: !862, size: 64, elements: !877)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !567, line: 183, baseType: !863)
!863 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !567, line: 166, size: 64, elements: !864)
!864 = !{!865, !866, !867, !868, !869, !879, !880, !892, !895, !896, !1690, !1691, !1702, !1709}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !863, file: !567, line: 168, baseType: !721, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !863, file: !567, line: 169, baseType: !7, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !863, file: !567, line: 170, baseType: !726, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !863, file: !567, line: 171, baseType: !843, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !863, file: !567, line: 172, baseType: !870, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !743, line: 53, baseType: !871)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !567, line: 359, size: 128, elements: !873)
!873 = !{!874, !875}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !872, file: !567, line: 360, baseType: !721, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !872, file: !567, line: 361, baseType: !876, size: 64, offset: 64)
!876 = !DICompositeType(tag: DW_TAG_array_type, baseType: !843, size: 64, elements: !877)
!877 = !{!878}
!878 = !DISubrange(count: 1)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !863, file: !567, line: 173, baseType: !12, size: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !863, file: !567, line: 174, baseType: !881, size: 32)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !567, line: 133, baseType: !882)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !567, line: 115, size: 32, elements: !883)
!883 = !{!884, !885, !886, !887, !888, !889, !890, !891}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !882, file: !567, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !882, file: !567, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !882, file: !567, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !882, file: !567, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !882, file: !567, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !882, file: !567, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !882, file: !567, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !882, file: !567, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !863, file: !567, line: 175, baseType: !893, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !567, line: 175, flags: DIFlagFwdDecl)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !863, file: !567, line: 176, baseType: !744, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !863, file: !567, line: 177, baseType: !897, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !743, line: 56, baseType: !898)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !157, line: 3371, size: 1792, elements: !900)
!900 = !{!901, !934, !940, !951, !970, !981, !986, !993, !999, !1012, !1024, !1062, !1067, !1095, !1103, !1104, !1109, !1118, !1124, !1129, !1133, !1137, !1314, !1363, !1369, !1376, !1383, !1409, !1434, !1451, !1463, !1485, !1500, !1672}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !899, file: !157, line: 3372, baseType: !902, size: 64)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !157, line: 360, size: 64, elements: !903)
!903 = !{!904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !902, file: !157, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !902, file: !157, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !902, file: !157, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !902, file: !157, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !902, file: !157, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !902, file: !157, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !902, file: !157, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !902, file: !157, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !902, file: !157, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !902, file: !157, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !902, file: !157, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !902, file: !157, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !902, file: !157, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !902, file: !157, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !902, file: !157, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !902, file: !157, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !902, file: !157, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !902, file: !157, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !902, file: !157, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !902, file: !157, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !902, file: !157, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !902, file: !157, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !902, file: !157, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !902, file: !157, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !902, file: !157, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !902, file: !157, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !902, file: !157, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !902, file: !157, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !902, file: !157, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !902, file: !157, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !899, file: !157, line: 3373, baseType: !935, size: 192)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !157, line: 402, size: 192, elements: !936)
!936 = !{!937, !938, !939}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !935, file: !157, line: 403, baseType: !902, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !935, file: !157, line: 404, baseType: !897, size: 64, offset: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !935, file: !157, line: 405, baseType: !897, size: 64, offset: 128)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !899, file: !157, line: 3374, baseType: !941, size: 320)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !157, line: 1384, size: 320, elements: !942)
!942 = !{!943, !944}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !941, file: !157, line: 1385, baseType: !935, size: 192)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !941, file: !157, line: 1386, baseType: !945, size: 128, offset: 192)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !946, line: 58, baseType: !947)
!946 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !946, line: 54, size: 128, elements: !948)
!948 = !{!949, !950}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !947, file: !946, line: 56, baseType: !760, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !947, file: !946, line: 57, baseType: !777, size: 64, offset: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !899, file: !157, line: 3375, baseType: !952, size: 256)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !157, line: 1397, size: 256, elements: !953)
!953 = !{!954, !955}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !952, file: !157, line: 1398, baseType: !935, size: 192)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !952, file: !157, line: 1399, baseType: !956, size: 64, offset: 192)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !958, line: 52, size: 256, elements: !959)
!958 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!959 = !{!960, !961, !962, !963, !964, !965, !966}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !957, file: !958, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !957, file: !958, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !957, file: !958, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !957, file: !958, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !957, file: !958, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !957, file: !958, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !957, file: !958, line: 62, baseType: !967, size: 192, offset: 64)
!967 = !DICompositeType(tag: DW_TAG_array_type, baseType: !760, size: 192, elements: !968)
!968 = !{!969}
!969 = !DISubrange(count: 3)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !899, file: !157, line: 3376, baseType: !971, size: 256)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !157, line: 1408, size: 256, elements: !972)
!972 = !{!973, !974}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !971, file: !157, line: 1409, baseType: !935, size: 192)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !971, file: !157, line: 1410, baseType: !975, size: 64, offset: 192)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !977, line: 27, size: 192, elements: !978)
!977 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!978 = !{!979, !980}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !976, file: !977, line: 29, baseType: !945, size: 128)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !976, file: !977, line: 30, baseType: !12, size: 32, offset: 128)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !899, file: !157, line: 3377, baseType: !982, size: 256)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !157, line: 1437, size: 256, elements: !983)
!983 = !{!984, !985}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !982, file: !157, line: 1438, baseType: !935, size: 192)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !982, file: !157, line: 1439, baseType: !897, size: 64, offset: 192)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !899, file: !157, line: 3378, baseType: !987, size: 256)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !157, line: 1418, size: 256, elements: !988)
!988 = !{!989, !990, !991}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !987, file: !157, line: 1419, baseType: !935, size: 192)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !987, file: !157, line: 1420, baseType: !721, size: 32, offset: 192)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !987, file: !157, line: 1421, baseType: !992, size: 8, offset: 224)
!992 = !DICompositeType(tag: DW_TAG_array_type, baseType: !724, size: 8, elements: !877)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !899, file: !157, line: 3379, baseType: !994, size: 320)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !157, line: 1428, size: 320, elements: !995)
!995 = !{!996, !997, !998}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !994, file: !157, line: 1429, baseType: !935, size: 192)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !994, file: !157, line: 1430, baseType: !897, size: 64, offset: 192)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !994, file: !157, line: 1431, baseType: !897, size: 64, offset: 256)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !899, file: !157, line: 3380, baseType: !1000, size: 320)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !157, line: 1460, size: 320, elements: !1001)
!1001 = !{!1002, !1003}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1000, file: !157, line: 1461, baseType: !935, size: 192)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1000, file: !157, line: 1462, baseType: !1004, size: 128, offset: 192)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1005, line: 31, size: 128, elements: !1006)
!1005 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1006 = !{!1007, !1010, !1011}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1004, file: !1005, line: 32, baseType: !1008, size: 64)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !720)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1004, file: !1005, line: 33, baseType: !7, size: 32, offset: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1004, file: !1005, line: 34, baseType: !7, size: 32, offset: 96)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !899, file: !157, line: 3381, baseType: !1013, size: 384)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !157, line: 2507, size: 384, elements: !1014)
!1014 = !{!1015, !1016, !1021, !1022, !1023}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1013, file: !157, line: 2508, baseType: !935, size: 192)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1013, file: !157, line: 2509, baseType: !1017, size: 32, offset: 192)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1018, line: 58, baseType: !1019)
!1018 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1020, line: 44, baseType: !7)
!1020 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1013, file: !157, line: 2510, baseType: !7, size: 32, offset: 224)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1013, file: !157, line: 2511, baseType: !897, size: 64, offset: 256)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1013, file: !157, line: 2512, baseType: !897, size: 64, offset: 320)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !899, file: !157, line: 3382, baseType: !1025, size: 896)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !157, line: 2652, size: 896, elements: !1026)
!1026 = !{!1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1025, file: !157, line: 2653, baseType: !1013, size: 384)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1025, file: !157, line: 2654, baseType: !897, size: 64, offset: 384)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1025, file: !157, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1025, file: !157, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1025, file: !157, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1025, file: !157, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1025, file: !157, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1025, file: !157, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1025, file: !157, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1025, file: !157, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1025, file: !157, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1025, file: !157, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1025, file: !157, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1025, file: !157, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1025, file: !157, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1025, file: !157, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1025, file: !157, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1025, file: !157, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1025, file: !157, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1025, file: !157, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1025, file: !157, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1025, file: !157, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1025, file: !157, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1025, file: !157, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1025, file: !157, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1025, file: !157, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1025, file: !157, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1025, file: !157, line: 2703, baseType: !7, size: 32, offset: 512)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1025, file: !157, line: 2705, baseType: !897, size: 64, offset: 576)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1025, file: !157, line: 2706, baseType: !897, size: 64, offset: 640)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1025, file: !157, line: 2707, baseType: !897, size: 64, offset: 704)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1025, file: !157, line: 2708, baseType: !897, size: 64, offset: 768)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1025, file: !157, line: 2711, baseType: !1060, size: 64, offset: 832)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !157, line: 2711, flags: DIFlagFwdDecl)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !899, file: !157, line: 3383, baseType: !1063, size: 960)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !157, line: 2756, size: 960, elements: !1064)
!1064 = !{!1065, !1066}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1063, file: !157, line: 2757, baseType: !1025, size: 896)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1063, file: !157, line: 2758, baseType: !843, size: 64, offset: 896)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !899, file: !157, line: 3384, baseType: !1068, size: 1472)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !157, line: 3114, size: 1472, elements: !1069)
!1069 = !{!1070, !1091, !1092, !1093, !1094}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1068, file: !157, line: 3115, baseType: !1071, size: 1216)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !157, line: 2984, size: 1216, elements: !1072)
!1072 = !{!1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1071, file: !157, line: 2985, baseType: !1063, size: 960)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1071, file: !157, line: 2986, baseType: !897, size: 64, offset: 960)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1071, file: !157, line: 2987, baseType: !897, size: 64, offset: 1024)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1071, file: !157, line: 2988, baseType: !897, size: 64, offset: 1088)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1071, file: !157, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1071, file: !157, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1071, file: !157, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1071, file: !157, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1071, file: !157, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1071, file: !157, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1071, file: !157, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1071, file: !157, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1071, file: !157, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1071, file: !157, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1071, file: !157, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1071, file: !157, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1071, file: !157, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1071, file: !157, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1068, file: !157, line: 3117, baseType: !897, size: 64, offset: 1216)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1068, file: !157, line: 3119, baseType: !897, size: 64, offset: 1280)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1068, file: !157, line: 3121, baseType: !897, size: 64, offset: 1344)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1068, file: !157, line: 3123, baseType: !897, size: 64, offset: 1408)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !899, file: !157, line: 3385, baseType: !1096, size: 1088)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !157, line: 2874, size: 1088, elements: !1097)
!1097 = !{!1098, !1099, !1100}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1096, file: !157, line: 2875, baseType: !1063, size: 960)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1096, file: !157, line: 2876, baseType: !843, size: 64, offset: 960)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1096, file: !157, line: 2877, baseType: !1101, size: 64, offset: 1024)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1102 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !157, line: 2856, flags: DIFlagFwdDecl)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !899, file: !157, line: 3386, baseType: !1071, size: 1216)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !899, file: !157, line: 3387, baseType: !1105, size: 1280)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !157, line: 3093, size: 1280, elements: !1106)
!1106 = !{!1107, !1108}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1105, file: !157, line: 3094, baseType: !1071, size: 1216)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1105, file: !157, line: 3095, baseType: !1101, size: 64, offset: 1216)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !899, file: !157, line: 3388, baseType: !1110, size: 1216)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !157, line: 2824, size: 1216, elements: !1111)
!1111 = !{!1112, !1113, !1114, !1115, !1116, !1117}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1110, file: !157, line: 2825, baseType: !1025, size: 896)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1110, file: !157, line: 2827, baseType: !897, size: 64, offset: 896)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1110, file: !157, line: 2828, baseType: !897, size: 64, offset: 960)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1110, file: !157, line: 2829, baseType: !897, size: 64, offset: 1024)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1110, file: !157, line: 2830, baseType: !897, size: 64, offset: 1088)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1110, file: !157, line: 2831, baseType: !897, size: 64, offset: 1152)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !899, file: !157, line: 3389, baseType: !1119, size: 1024)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !157, line: 2850, size: 1024, elements: !1120)
!1120 = !{!1121, !1122, !1123}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1119, file: !157, line: 2851, baseType: !1063, size: 960)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1119, file: !157, line: 2852, baseType: !721, size: 32, offset: 960)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1119, file: !157, line: 2853, baseType: !721, size: 32, offset: 992)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !899, file: !157, line: 3390, baseType: !1125, size: 1024)
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !157, line: 2857, size: 1024, elements: !1126)
!1126 = !{!1127, !1128}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1125, file: !157, line: 2858, baseType: !1063, size: 960)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1125, file: !157, line: 2859, baseType: !1101, size: 64, offset: 960)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !899, file: !157, line: 3391, baseType: !1130, size: 960)
!1130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !157, line: 2862, size: 960, elements: !1131)
!1131 = !{!1132}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1130, file: !157, line: 2863, baseType: !1063, size: 960)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !899, file: !157, line: 3392, baseType: !1134, size: 1472)
!1134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !157, line: 3304, size: 1472, elements: !1135)
!1135 = !{!1136}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1134, file: !157, line: 3305, baseType: !1068, size: 1472)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !899, file: !157, line: 3393, baseType: !1138, size: 1792)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !157, line: 3248, size: 1792, elements: !1139)
!1139 = !{!1140, !1141, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1138, file: !157, line: 3249, baseType: !1068, size: 1472)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1138, file: !157, line: 3251, baseType: !1142, size: 64, offset: 1472)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64)
!1143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1144, line: 463, size: 1152, elements: !1145)
!1144 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1145 = !{!1146, !1149, !1179, !1180, !1183, !1186, !1238, !1239, !1240, !1241, !1242, !1266, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1143, file: !1144, line: 464, baseType: !1147, size: 64)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64)
!1148 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1144, line: 464, flags: DIFlagFwdDecl)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1143, file: !1144, line: 467, baseType: !1150, size: 64, offset: 64)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !141, line: 374, size: 640, elements: !1152)
!1152 = !{!1153, !1154, !1155, !1168, !1169, !1170, !1171, !1172, !1173, !1175, !1177, !1178}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1151, file: !141, line: 377, baseType: !812, size: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1151, file: !141, line: 378, baseType: !812, size: 64, offset: 64)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1151, file: !141, line: 381, baseType: !1156, size: 64, offset: 128)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !141, line: 282, baseType: !1158)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !141, line: 282, size: 128, elements: !1159)
!1159 = !{!1160}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1158, file: !141, line: 282, baseType: !1161, size: 128)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !141, line: 281, baseType: !1162)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !141, line: 281, size: 128, elements: !1163)
!1163 = !{!1164, !1165, !1166}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1162, file: !141, line: 281, baseType: !7, size: 32)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1162, file: !141, line: 281, baseType: !7, size: 32, offset: 32)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1162, file: !141, line: 281, baseType: !1167, size: 64, offset: 64)
!1167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !812, size: 64, elements: !877)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1151, file: !141, line: 384, baseType: !721, size: 32, offset: 192)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1151, file: !141, line: 387, baseType: !721, size: 32, offset: 224)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1151, file: !141, line: 390, baseType: !721, size: 32, offset: 256)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1151, file: !141, line: 394, baseType: !1156, size: 64, offset: 320)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1151, file: !141, line: 396, baseType: !140, size: 32, offset: 384)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1151, file: !141, line: 399, baseType: !1174, size: 64, offset: 416)
!1174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 64, elements: !761)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1151, file: !141, line: 402, baseType: !1176, size: 64, offset: 480)
!1176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !761)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1151, file: !141, line: 406, baseType: !721, size: 32, offset: 544)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1151, file: !141, line: 409, baseType: !721, size: 32, offset: 576)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1143, file: !1144, line: 470, baseType: !840, size: 64, offset: 128)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1143, file: !1144, line: 473, baseType: !1181, size: 64, offset: 192)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64)
!1182 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1144, line: 166, flags: DIFlagFwdDecl)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1143, file: !1144, line: 476, baseType: !1184, size: 64, offset: 256)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1144, line: 476, flags: DIFlagFwdDecl)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1143, file: !1144, line: 479, baseType: !1187, size: 64, offset: 320)
!1187 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1188, line: 144, baseType: !1189)
!1188 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1188, line: 100, size: 896, elements: !1191)
!1191 = !{!1192, !1200, !1205, !1210, !1212, !1215, !1216, !1217, !1218, !1219, !1224, !1226, !1227, !1232, !1237}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1190, file: !1188, line: 102, baseType: !1193, size: 64)
!1193 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1188, line: 52, baseType: !1194)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64)
!1195 = !DISubroutineType(types: !1196)
!1196 = !{!1197, !1198}
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1188, line: 47, baseType: !7)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64)
!1199 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1190, file: !1188, line: 105, baseType: !1201, size: 64, offset: 64)
!1201 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1188, line: 59, baseType: !1202)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64)
!1203 = !DISubroutineType(types: !1204)
!1204 = !{!721, !1198, !1198}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1190, file: !1188, line: 108, baseType: !1206, size: 64, offset: 128)
!1206 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1188, line: 63, baseType: !1207)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64)
!1208 = !DISubroutineType(types: !1209)
!1209 = !{null, !725}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1190, file: !1188, line: 111, baseType: !1211, size: 64, offset: 192)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1190, file: !1188, line: 114, baseType: !1213, size: 64, offset: 256)
!1213 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1214, line: 46, baseType: !760)
!1214 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1190, file: !1188, line: 117, baseType: !1213, size: 64, offset: 320)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1190, file: !1188, line: 120, baseType: !1213, size: 64, offset: 384)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1190, file: !1188, line: 124, baseType: !7, size: 32, offset: 448)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1190, file: !1188, line: 128, baseType: !7, size: 32, offset: 480)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1190, file: !1188, line: 131, baseType: !1220, size: 64, offset: 512)
!1220 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1188, line: 75, baseType: !1221)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64)
!1222 = !DISubroutineType(types: !1223)
!1223 = !{!725, !1213, !1213}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1190, file: !1188, line: 132, baseType: !1225, size: 64, offset: 576)
!1225 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1188, line: 78, baseType: !1207)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1190, file: !1188, line: 135, baseType: !725, size: 64, offset: 640)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1190, file: !1188, line: 136, baseType: !1228, size: 64, offset: 704)
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1188, line: 82, baseType: !1229)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64)
!1230 = !DISubroutineType(types: !1231)
!1231 = !{!725, !725, !1213, !1213}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1190, file: !1188, line: 137, baseType: !1233, size: 64, offset: 768)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1188, line: 83, baseType: !1234)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64)
!1235 = !DISubroutineType(types: !1236)
!1236 = !{null, !725, !725}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1190, file: !1188, line: 141, baseType: !7, size: 32, offset: 832)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1143, file: !1144, line: 484, baseType: !897, size: 64, offset: 384)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1143, file: !1144, line: 488, baseType: !897, size: 64, offset: 448)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1143, file: !1144, line: 493, baseType: !897, size: 64, offset: 512)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1143, file: !1144, line: 496, baseType: !897, size: 64, offset: 576)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1143, file: !1144, line: 501, baseType: !1243, size: 64, offset: 640)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64)
!1244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !152, line: 2355, size: 576, elements: !1245)
!1245 = !{!1246, !1249, !1250, !1251, !1252, !1254, !1255, !1260, !1261, !1262, !1263, !1264, !1265}
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1244, file: !152, line: 2356, baseType: !1247, size: 64)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64)
!1248 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !152, line: 2356, flags: DIFlagFwdDecl)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1244, file: !152, line: 2357, baseType: !726, size: 64, offset: 64)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1244, file: !152, line: 2358, baseType: !721, size: 32, offset: 128)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1244, file: !152, line: 2359, baseType: !721, size: 32, offset: 160)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1244, file: !152, line: 2360, baseType: !1253, size: 128, offset: 192)
!1253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !721, size: 128, elements: !786)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1244, file: !152, line: 2364, baseType: !721, size: 32, offset: 320)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1244, file: !152, line: 2367, baseType: !1256, size: 128, offset: 384)
!1256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !152, line: 2349, size: 128, elements: !1257)
!1257 = !{!1258, !1259}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1256, file: !152, line: 2351, baseType: !843, size: 64)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1256, file: !152, line: 2352, baseType: !777, size: 64, offset: 64)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1244, file: !152, line: 2371, baseType: !151, size: 32, offset: 512)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1244, file: !152, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1244, file: !152, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1244, file: !152, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1244, file: !152, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1244, file: !152, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1143, file: !1144, line: 504, baseType: !1267, size: 64, offset: 704)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64)
!1268 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1144, line: 504, flags: DIFlagFwdDecl)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1143, file: !1144, line: 507, baseType: !1187, size: 64, offset: 768)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1143, file: !1144, line: 510, baseType: !721, size: 32, offset: 832)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1143, file: !1144, line: 513, baseType: !721, size: 32, offset: 864)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1143, file: !1144, line: 516, baseType: !1017, size: 32, offset: 896)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1143, file: !1144, line: 519, baseType: !1017, size: 32, offset: 928)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1143, file: !1144, line: 522, baseType: !7, size: 32, offset: 960)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1143, file: !1144, line: 523, baseType: !7, size: 32, offset: 992)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1143, file: !1144, line: 528, baseType: !726, size: 64, offset: 1024)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1143, file: !1144, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1143, file: !1144, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1143, file: !1144, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1143, file: !1144, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1143, file: !1144, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1143, file: !1144, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1143, file: !1144, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1143, file: !1144, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1143, file: !1144, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1143, file: !1144, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1143, file: !1144, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1143, file: !1144, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1143, file: !1144, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1143, file: !1144, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1143, file: !1144, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1143, file: !1144, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1138, file: !157, line: 3254, baseType: !897, size: 64, offset: 1536)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1138, file: !157, line: 3257, baseType: !897, size: 64, offset: 1600)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1138, file: !157, line: 3258, baseType: !897, size: 64, offset: 1664)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1138, file: !157, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1138, file: !157, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1138, file: !157, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1138, file: !157, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1138, file: !157, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1138, file: !157, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1138, file: !157, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1138, file: !157, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1138, file: !157, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1138, file: !157, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1138, file: !157, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1138, file: !157, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1138, file: !157, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1138, file: !157, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1138, file: !157, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1138, file: !157, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1138, file: !157, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1138, file: !157, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !899, file: !157, line: 3394, baseType: !1315, size: 1344)
!1315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !157, line: 2279, size: 1344, elements: !1316)
!1316 = !{!1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1342, !1343, !1344, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360}
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1315, file: !157, line: 2280, baseType: !935, size: 192)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1315, file: !157, line: 2281, baseType: !897, size: 64, offset: 192)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1315, file: !157, line: 2282, baseType: !897, size: 64, offset: 256)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1315, file: !157, line: 2283, baseType: !897, size: 64, offset: 320)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1315, file: !157, line: 2284, baseType: !897, size: 64, offset: 384)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1315, file: !157, line: 2285, baseType: !7, size: 32, offset: 448)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1315, file: !157, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1315, file: !157, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1315, file: !157, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1315, file: !157, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1315, file: !157, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1315, file: !157, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1315, file: !157, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1315, file: !157, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1315, file: !157, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1315, file: !157, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1315, file: !157, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1315, file: !157, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1315, file: !157, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1315, file: !157, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1315, file: !157, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1315, file: !157, line: 2305, baseType: !7, size: 32, offset: 512)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1315, file: !157, line: 2306, baseType: !1340, size: 32, offset: 544)
!1340 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1341, line: 31, baseType: !721)
!1341 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1315, file: !157, line: 2307, baseType: !897, size: 64, offset: 576)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1315, file: !157, line: 2308, baseType: !897, size: 64, offset: 640)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1315, file: !157, line: 2314, baseType: !1345, size: 64, offset: 704)
!1345 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !157, line: 2309, size: 64, elements: !1346)
!1346 = !{!1347, !1348, !1349}
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1345, file: !157, line: 2310, baseType: !721, size: 32)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1345, file: !157, line: 2311, baseType: !726, size: 64)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1345, file: !157, line: 2312, baseType: !1350, size: 64)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64)
!1351 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !157, line: 2277, flags: DIFlagFwdDecl)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1315, file: !157, line: 2315, baseType: !897, size: 64, offset: 768)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1315, file: !157, line: 2316, baseType: !897, size: 64, offset: 832)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1315, file: !157, line: 2317, baseType: !897, size: 64, offset: 896)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1315, file: !157, line: 2318, baseType: !897, size: 64, offset: 960)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1315, file: !157, line: 2319, baseType: !897, size: 64, offset: 1024)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1315, file: !157, line: 2320, baseType: !897, size: 64, offset: 1088)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1315, file: !157, line: 2321, baseType: !897, size: 64, offset: 1152)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1315, file: !157, line: 2322, baseType: !897, size: 64, offset: 1216)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1315, file: !157, line: 2324, baseType: !1361, size: 64, offset: 1280)
!1361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1362, size: 64)
!1362 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !157, line: 2324, flags: DIFlagFwdDecl)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !899, file: !157, line: 3395, baseType: !1364, size: 320)
!1364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !157, line: 1469, size: 320, elements: !1365)
!1365 = !{!1366, !1367, !1368}
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1364, file: !157, line: 1470, baseType: !935, size: 192)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1364, file: !157, line: 1471, baseType: !897, size: 64, offset: 192)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1364, file: !157, line: 1472, baseType: !897, size: 64, offset: 256)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !899, file: !157, line: 3396, baseType: !1370, size: 320)
!1370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !157, line: 1482, size: 320, elements: !1371)
!1371 = !{!1372, !1373, !1374}
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1370, file: !157, line: 1483, baseType: !935, size: 192)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1370, file: !157, line: 1484, baseType: !721, size: 32, offset: 192)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1370, file: !157, line: 1485, baseType: !1375, size: 64, offset: 256)
!1375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !897, size: 64, elements: !877)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !899, file: !157, line: 3397, baseType: !1377, size: 384)
!1377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !157, line: 1829, size: 384, elements: !1378)
!1378 = !{!1379, !1380, !1381, !1382}
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1377, file: !157, line: 1830, baseType: !935, size: 192)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1377, file: !157, line: 1831, baseType: !1017, size: 32, offset: 192)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1377, file: !157, line: 1832, baseType: !897, size: 64, offset: 256)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1377, file: !157, line: 1835, baseType: !1375, size: 64, offset: 320)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !899, file: !157, line: 3398, baseType: !1384, size: 704)
!1384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !157, line: 1898, size: 704, elements: !1385)
!1385 = !{!1386, !1387, !1388, !1392, !1393, !1396}
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1384, file: !157, line: 1899, baseType: !935, size: 192)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1384, file: !157, line: 1902, baseType: !897, size: 64, offset: 192)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1384, file: !157, line: 1905, baseType: !1389, size: 64, offset: 256)
!1389 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !743, line: 58, baseType: !1390)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64)
!1391 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !743, line: 57, flags: DIFlagFwdDecl)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1384, file: !157, line: 1908, baseType: !7, size: 32, offset: 320)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1384, file: !157, line: 1911, baseType: !1394, size: 64, offset: 384)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1395, size: 64)
!1395 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !157, line: 1876, flags: DIFlagFwdDecl)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1384, file: !157, line: 1914, baseType: !1397, size: 256, offset: 448)
!1397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !157, line: 1883, size: 256, elements: !1398)
!1398 = !{!1399, !1401, !1402, !1407}
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1397, file: !157, line: 1884, baseType: !1400, size: 64)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1397, file: !157, line: 1885, baseType: !1400, size: 64, offset: 64)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1397, file: !157, line: 1891, baseType: !1403, size: 64, offset: 128)
!1403 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1397, file: !157, line: 1891, size: 64, elements: !1404)
!1404 = !{!1405, !1406}
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1403, file: !157, line: 1891, baseType: !1389, size: 64)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1403, file: !157, line: 1891, baseType: !897, size: 64)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1397, file: !157, line: 1892, baseType: !1408, size: 64, offset: 192)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !899, file: !157, line: 3399, baseType: !1410, size: 704)
!1410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !157, line: 2008, size: 704, elements: !1411)
!1411 = !{!1412, !1413, !1414, !1415, !1416, !1417, !1429, !1430, !1431, !1432, !1433}
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1410, file: !157, line: 2009, baseType: !935, size: 192)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1410, file: !157, line: 2011, baseType: !7, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !1410, file: !157, line: 2012, baseType: !7, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1410, file: !157, line: 2014, baseType: !1017, size: 32, offset: 224)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1410, file: !157, line: 2016, baseType: !897, size: 64, offset: 256)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !1410, file: !157, line: 2017, baseType: !1418, size: 64, offset: 320)
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64)
!1419 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !157, line: 183, baseType: !1420)
!1420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !157, line: 183, size: 128, elements: !1421)
!1421 = !{!1422}
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1420, file: !157, line: 183, baseType: !1423, size: 128)
!1423 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !157, line: 182, baseType: !1424)
!1424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !157, line: 182, size: 128, elements: !1425)
!1425 = !{!1426, !1427, !1428}
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1424, file: !157, line: 182, baseType: !7, size: 32)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1424, file: !157, line: 182, baseType: !7, size: 32, offset: 32)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1424, file: !157, line: 182, baseType: !1375, size: 64, offset: 64)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !1410, file: !157, line: 2019, baseType: !897, size: 64, offset: 384)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !1410, file: !157, line: 2020, baseType: !897, size: 64, offset: 448)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1410, file: !157, line: 2021, baseType: !897, size: 64, offset: 512)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !1410, file: !157, line: 2022, baseType: !897, size: 64, offset: 576)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !1410, file: !157, line: 2023, baseType: !897, size: 64, offset: 640)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !899, file: !157, line: 3400, baseType: !1435, size: 832)
!1435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !157, line: 2430, size: 832, elements: !1436)
!1436 = !{!1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446}
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1435, file: !157, line: 2431, baseType: !935, size: 192)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1435, file: !157, line: 2433, baseType: !897, size: 64, offset: 192)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !1435, file: !157, line: 2434, baseType: !897, size: 64, offset: 256)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !1435, file: !157, line: 2435, baseType: !897, size: 64, offset: 320)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !1435, file: !157, line: 2436, baseType: !897, size: 64, offset: 384)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "base_accesses", scope: !1435, file: !157, line: 2437, baseType: !1418, size: 64, offset: 448)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "inheritance", scope: !1435, file: !157, line: 2438, baseType: !897, size: 64, offset: 512)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_subvtt", scope: !1435, file: !157, line: 2440, baseType: !897, size: 64, offset: 576)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_vptr", scope: !1435, file: !157, line: 2441, baseType: !897, size: 64, offset: 640)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "base_binfos", scope: !1435, file: !157, line: 2443, baseType: !1447, size: 128, offset: 704)
!1447 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_none", file: !157, line: 182, baseType: !1448)
!1448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_none", file: !157, line: 182, size: 128, elements: !1449)
!1449 = !{!1450}
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1448, file: !157, line: 182, baseType: !1423, size: 128)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "stmt_list", scope: !899, file: !157, line: 3401, baseType: !1452, size: 320)
!1452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list", file: !157, line: 3327, size: 320, elements: !1453)
!1453 = !{!1454, !1455, !1462}
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1452, file: !157, line: 3329, baseType: !935, size: 192)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1452, file: !157, line: 3330, baseType: !1456, size: 64, offset: 192)
!1456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1457, size: 64)
!1457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list_node", file: !157, line: 3320, size: 192, elements: !1458)
!1458 = !{!1459, !1460, !1461}
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1457, file: !157, line: 3322, baseType: !1456, size: 64)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1457, file: !157, line: 3323, baseType: !1456, size: 64, offset: 64)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1457, file: !157, line: 3324, baseType: !897, size: 64, offset: 128)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1452, file: !157, line: 3331, baseType: !1456, size: 64, offset: 256)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "constructor", scope: !899, file: !157, line: 3402, baseType: !1464, size: 256)
!1464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_constructor", file: !157, line: 1540, size: 256, elements: !1465)
!1465 = !{!1466, !1467}
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1464, file: !157, line: 1541, baseType: !935, size: 192)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !1464, file: !157, line: 1542, baseType: !1468, size: 64, offset: 192)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64)
!1469 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_gc", file: !157, line: 1538, baseType: !1470)
!1470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_gc", file: !157, line: 1538, size: 192, elements: !1471)
!1471 = !{!1472}
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1470, file: !157, line: 1538, baseType: !1473, size: 192)
