; ModuleID = 'df-problems.bc'
source_filename = "df-problems.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.df = type { [8 x %struct.dataflow*], [8 x %struct.dataflow*], %struct.bitmap_head_def*, %struct.df_ref_info, %struct.df_ref_info, %struct.df_reg_info**, %struct.df_reg_info**, %struct.df_reg_info**, i32, i32, %struct.df_insn_info**, i32, i32, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, i32*, i32*, i32, i32, i32*, i32, i8, i8, i8 }
%struct.dataflow = type { %struct.df_problem*, i8**, i32, %struct.alloc_pool_def*, %struct.bitmap_head_def*, i8*, i32, i8, i8, i8 }

!697 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!698 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!699 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!700 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!701 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!702 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!703 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!704 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!705 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!706 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!707 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!708 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!709 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "reg_note", file: !567, line: 836, baseType: !7, size: 32, elements: !710)
!710 = !{!711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742}
!711 = !DIEnumerator(name: "REG_DEP_TRUE", value: 0, isUnsigned: true)
!712 = !DIEnumerator(name: "REG_DEAD", value: 1, isUnsigned: true)
!713 = !DIEnumerator(name: "REG_INC", value: 2, isUnsigned: true)
!714 = !DIEnumerator(name: "REG_EQUIV", value: 3, isUnsigned: true)
!715 = !DIEnumerator(name: "REG_EQUAL", value: 4, isUnsigned: true)
!716 = !DIEnumerator(name: "REG_NONNEG", value: 5, isUnsigned: true)
!717 = !DIEnumerator(name: "REG_UNUSED", value: 6, isUnsigned: true)
!718 = !DIEnumerator(name: "REG_CC_SETTER", value: 7, isUnsigned: true)
!719 = !DIEnumerator(name: "REG_CC_USER", value: 8, isUnsigned: true)
!720 = !DIEnumerator(name: "REG_LABEL_TARGET", value: 9, isUnsigned: true)
!721 = !DIEnumerator(name: "REG_LABEL_OPERAND", value: 10, isUnsigned: true)
!722 = !DIEnumerator(name: "REG_DEP_OUTPUT", value: 11, isUnsigned: true)
!723 = !DIEnumerator(name: "REG_DEP_ANTI", value: 12, isUnsigned: true)
!724 = !DIEnumerator(name: "REG_BR_PROB", value: 13, isUnsigned: true)
!725 = !DIEnumerator(name: "REG_VALUE_PROFILE", value: 14, isUnsigned: true)
!726 = !DIEnumerator(name: "REG_NOALIAS", value: 15, isUnsigned: true)
!727 = !DIEnumerator(name: "REG_BR_PRED", value: 16, isUnsigned: true)
!728 = !DIEnumerator(name: "REG_FRAME_RELATED_EXPR", value: 17, isUnsigned: true)
!729 = !DIEnumerator(name: "REG_CFA_DEF_CFA", value: 18, isUnsigned: true)
!730 = !DIEnumerator(name: "REG_CFA_ADJUST_CFA", value: 19, isUnsigned: true)
!731 = !DIEnumerator(name: "REG_CFA_OFFSET", value: 20, isUnsigned: true)
!732 = !DIEnumerator(name: "REG_CFA_REGISTER", value: 21, isUnsigned: true)
!733 = !DIEnumerator(name: "REG_CFA_RESTORE", value: 22, isUnsigned: true)
!734 = !DIEnumerator(name: "REG_CFA_SET_VDRAP", value: 23, isUnsigned: true)
!735 = !DIEnumerator(name: "REG_EH_CONTEXT", value: 24, isUnsigned: true)
!736 = !DIEnumerator(name: "REG_EH_REGION", value: 25, isUnsigned: true)
!737 = !DIEnumerator(name: "REG_SAVE_NOTE", value: 26, isUnsigned: true)
!738 = !DIEnumerator(name: "REG_NORETURN", value: 27, isUnsigned: true)
!739 = !DIEnumerator(name: "REG_NON_LOCAL_GOTO", value: 28, isUnsigned: true)
!740 = !DIEnumerator(name: "REG_CROSSING_JUMP", value: 29, isUnsigned: true)
!741 = !DIEnumerator(name: "REG_SETJMP", value: 30, isUnsigned: true)
!742 = !DIEnumerator(name: "REG_NOTE_MAX", value: 31, isUnsigned: true)
!743 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "df_chain_flags", file: !385, line: 456, baseType: !7, size: 32, elements: !744)
!744 = !{!745, !746}
!745 = !DIEnumerator(name: "DF_DU_CHAIN", value: 1, isUnsigned: true)
!746 = !DIEnumerator(name: "DF_UD_CHAIN", value: 2, isUnsigned: true)
!747 = !{!748, !749, !750, !751, !754, !755, !757, !758, !821, !1987, !566, !709, !5, !1997, !2004, !2011, !2017, !7, !2025, !2029, !2031, !2036, !743, !1994, !2041, !2042, !776, !2049}
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!750 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !753)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !759, line: 47, baseType: !760)
!759 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !762, line: 75, size: 256, elements: !763)
!762 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!763 = !{!764, !779, !780, !781}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !761, file: !762, line: 76, baseType: !765, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !762, line: 68, baseType: !767)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !762, line: 63, size: 320, elements: !768)
!768 = !{!769, !771, !772, !773}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !767, file: !762, line: 64, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !767, file: !762, line: 65, baseType: !770, size: 64, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !767, file: !762, line: 66, baseType: !7, size: 32, offset: 128)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !767, file: !762, line: 67, baseType: !774, size: 128, offset: 192)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !775, size: 128, elements: !777)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !762, line: 29, baseType: !776)
!776 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!777 = !{!778}
!778 = !DISubrange(count: 2)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !761, file: !762, line: 77, baseType: !765, size: 64, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !761, file: !762, line: 78, baseType: !7, size: 32, offset: 128)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !761, file: !762, line: 79, baseType: !782, size: 64, offset: 192)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !762, line: 49, baseType: !784)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !762, line: 45, size: 832, elements: !785)
!785 = !{!786, !787, !788}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !784, file: !762, line: 46, baseType: !770, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !784, file: !762, line: 47, baseType: !760, size: 64, offset: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !784, file: !762, line: 48, baseType: !789, size: 704, offset: 128)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !790, line: 164, size: 704, elements: !791)
!790 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!791 = !{!792, !794, !804, !805, !806, !807, !808, !809, !813, !817, !818, !819, !820}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !789, file: !790, line: 166, baseType: !793, size: 64)
!793 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !789, file: !790, line: 167, baseType: !795, size: 64, offset: 64)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !790, line: 157, size: 192, elements: !797)
!797 = !{!798, !799, !800}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !796, file: !790, line: 159, baseType: !752, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !796, file: !790, line: 160, baseType: !795, size: 64, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !796, file: !790, line: 161, baseType: !801, size: 32, offset: 128)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !753, size: 32, elements: !802)
!802 = !{!803}
!803 = !DISubrange(count: 4)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !789, file: !790, line: 168, baseType: !752, size: 64, offset: 128)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !789, file: !790, line: 169, baseType: !752, size: 64, offset: 192)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !789, file: !790, line: 170, baseType: !752, size: 64, offset: 256)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !789, file: !790, line: 171, baseType: !793, size: 64, offset: 320)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !789, file: !790, line: 172, baseType: !750, size: 32, offset: 384)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !789, file: !790, line: 176, baseType: !810, size: 64, offset: 448)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DISubroutineType(types: !812)
!812 = !{!795, !754, !793}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !789, file: !790, line: 177, baseType: !814, size: 64, offset: 512)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DISubroutineType(types: !816)
!816 = !{null, !754, !795}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !789, file: !790, line: 178, baseType: !754, size: 64, offset: 576)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !789, file: !790, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !789, file: !790, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !789, file: !790, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "df_link", file: !385, line: 449, size: 128, elements: !823)
!823 = !{!824, !1986}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !822, file: !385, line: 451, baseType: !825, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "df_ref", file: !385, line: 429, baseType: !826)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "df_ref_d", file: !385, line: 422, size: 704, elements: !828)
!828 = !{!829, !1968, !1974, !1979}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !827, file: !385, line: 424, baseType: !830, size: 512)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "df_base_ref", file: !385, line: 356, size: 512, elements: !831)
!831 = !{!832, !833, !834, !835, !1941, !1942, !1963, !1964, !1965, !1966, !1967}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !830, file: !385, line: 360, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !830, file: !385, line: 362, baseType: !7, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !830, file: !385, line: 364, baseType: !750, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !830, file: !385, line: 365, baseType: !836, size: 64, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !759, line: 50, baseType: !837)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !567, line: 240, size: 384, elements: !839)
!839 = !{!840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !838, file: !567, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !838, file: !567, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !838, file: !567, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !838, file: !567, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !838, file: !567, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !838, file: !567, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !838, file: !567, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !838, file: !567, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !838, file: !567, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !838, file: !567, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !838, file: !567, line: 321, baseType: !851, size: 320, offset: 64)
!851 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !567, line: 315, size: 320, elements: !852)
!852 = !{!853, !1876, !1878, !1939, !1940}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !851, file: !567, line: 316, baseType: !854, size: 64)
!854 = !DICompositeType(tag: DW_TAG_array_type, baseType: !855, size: 64, elements: !870)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !567, line: 183, baseType: !856)
!856 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !567, line: 166, size: 64, elements: !857)
!857 = !{!858, !859, !860, !861, !862, !872, !873, !885, !888, !889, !1854, !1855, !1866, !1873}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !856, file: !567, line: 168, baseType: !750, size: 32)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !856, file: !567, line: 169, baseType: !7, size: 32)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !856, file: !567, line: 170, baseType: !755, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !856, file: !567, line: 171, baseType: !836, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !856, file: !567, line: 172, baseType: !863, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !759, line: 53, baseType: !864)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !567, line: 359, size: 128, elements: !866)
!866 = !{!867, !868}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !865, file: !567, line: 360, baseType: !750, size: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !865, file: !567, line: 361, baseType: !869, size: 64, offset: 64)
!869 = !DICompositeType(tag: DW_TAG_array_type, baseType: !836, size: 64, elements: !870)
!870 = !{!871}
!871 = !DISubrange(count: 1)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !856, file: !567, line: 173, baseType: !5, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !856, file: !567, line: 174, baseType: !874, size: 32)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !567, line: 133, baseType: !875)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !567, line: 115, size: 32, elements: !876)
!876 = !{!877, !878, !879, !880, !881, !882, !883, !884}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !875, file: !567, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !875, file: !567, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !875, file: !567, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !875, file: !567, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !875, file: !567, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !875, file: !567, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !875, file: !567, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !875, file: !567, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !856, file: !567, line: 175, baseType: !886, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !567, line: 175, flags: DIFlagFwdDecl)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !856, file: !567, line: 176, baseType: !760, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !856, file: !567, line: 177, baseType: !890, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !759, line: 56, baseType: !891)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !158, line: 3371, size: 1792, elements: !893)
!893 = !{!894, !927, !933, !944, !963, !974, !979, !986, !992, !1005, !1017, !1055, !1060, !1088, !1096, !1097, !1102, !1111, !1117, !1122, !1126, !1130, !1490, !1539, !1545, !1551, !1558, !1584, !1598, !1615, !1627, !1649, !1664, !1836}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !892, file: !158, line: 3372, baseType: !895, size: 64)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !158, line: 360, size: 64, elements: !896)
!896 = !{!897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !895, file: !158, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !895, file: !158, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !895, file: !158, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !895, file: !158, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !895, file: !158, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !895, file: !158, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !895, file: !158, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !895, file: !158, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !895, file: !158, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !895, file: !158, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !895, file: !158, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !895, file: !158, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !895, file: !158, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !895, file: !158, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !895, file: !158, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !895, file: !158, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !895, file: !158, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !895, file: !158, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !895, file: !158, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !895, file: !158, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !895, file: !158, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !895, file: !158, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !895, file: !158, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !895, file: !158, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !895, file: !158, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !895, file: !158, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !895, file: !158, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !895, file: !158, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !895, file: !158, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !895, file: !158, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !892, file: !158, line: 3373, baseType: !928, size: 192)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !158, line: 402, size: 192, elements: !929)
!929 = !{!930, !931, !932}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !928, file: !158, line: 403, baseType: !895, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !928, file: !158, line: 404, baseType: !890, size: 64, offset: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !928, file: !158, line: 405, baseType: !890, size: 64, offset: 128)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !892, file: !158, line: 3374, baseType: !934, size: 320)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !158, line: 1384, size: 320, elements: !935)
!935 = !{!936, !937}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !934, file: !158, line: 1385, baseType: !928, size: 192)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !934, file: !158, line: 1386, baseType: !938, size: 128, offset: 192)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !939, line: 58, baseType: !940)
!939 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !939, line: 54, size: 128, elements: !941)
!941 = !{!942, !943}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !940, file: !939, line: 56, baseType: !776, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !940, file: !939, line: 57, baseType: !793, size: 64, offset: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !892, file: !158, line: 3375, baseType: !945, size: 256)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !158, line: 1397, size: 256, elements: !946)
!946 = !{!947, !948}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !945, file: !158, line: 1398, baseType: !928, size: 192)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !945, file: !158, line: 1399, baseType: !949, size: 64, offset: 192)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !951, line: 52, size: 256, elements: !952)
!951 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!952 = !{!953, !954, !955, !956, !957, !958, !959}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !950, file: !951, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !950, file: !951, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !950, file: !951, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !950, file: !951, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !950, file: !951, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !950, file: !951, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !950, file: !951, line: 62, baseType: !960, size: 192, offset: 64)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !776, size: 192, elements: !961)
!961 = !{!962}
!962 = !DISubrange(count: 3)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !892, file: !158, line: 3376, baseType: !964, size: 256)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !158, line: 1408, size: 256, elements: !965)
!965 = !{!966, !967}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !964, file: !158, line: 1409, baseType: !928, size: 192)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !964, file: !158, line: 1410, baseType: !968, size: 64, offset: 192)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !970, line: 27, size: 192, elements: !971)
!970 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!971 = !{!972, !973}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !969, file: !970, line: 29, baseType: !938, size: 128)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !969, file: !970, line: 30, baseType: !5, size: 32, offset: 128)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !892, file: !158, line: 3377, baseType: !975, size: 256)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !158, line: 1437, size: 256, elements: !976)
!976 = !{!977, !978}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !975, file: !158, line: 1438, baseType: !928, size: 192)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !975, file: !158, line: 1439, baseType: !890, size: 64, offset: 192)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !892, file: !158, line: 3378, baseType: !980, size: 256)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !158, line: 1418, size: 256, elements: !981)
!981 = !{!982, !983, !984}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !980, file: !158, line: 1419, baseType: !928, size: 192)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !980, file: !158, line: 1420, baseType: !750, size: 32, offset: 192)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !980, file: !158, line: 1421, baseType: !985, size: 8, offset: 224)
!985 = !DICompositeType(tag: DW_TAG_array_type, baseType: !753, size: 8, elements: !870)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !892, file: !158, line: 3379, baseType: !987, size: 320)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !158, line: 1428, size: 320, elements: !988)
!988 = !{!989, !990, !991}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !987, file: !158, line: 1429, baseType: !928, size: 192)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !987, file: !158, line: 1430, baseType: !890, size: 64, offset: 192)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !987, file: !158, line: 1431, baseType: !890, size: 64, offset: 256)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !892, file: !158, line: 3380, baseType: !993, size: 320)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !158, line: 1460, size: 320, elements: !994)
!994 = !{!995, !996}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !993, file: !158, line: 1461, baseType: !928, size: 192)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !993, file: !158, line: 1462, baseType: !997, size: 128, offset: 192)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !998, line: 31, size: 128, elements: !999)
!998 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!999 = !{!1000, !1003, !1004}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !997, file: !998, line: 32, baseType: !1001, size: 64)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !749)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !997, file: !998, line: 33, baseType: !7, size: 32, offset: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !997, file: !998, line: 34, baseType: !7, size: 32, offset: 96)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !892, file: !158, line: 3381, baseType: !1006, size: 384)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !158, line: 2507, size: 384, elements: !1007)
!1007 = !{!1008, !1009, !1014, !1015, !1016}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1006, file: !158, line: 2508, baseType: !928, size: 192)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1006, file: !158, line: 2509, baseType: !1010, size: 32, offset: 192)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1011, line: 58, baseType: !1012)
!1011 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1013, line: 44, baseType: !7)
!1013 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1006, file: !158, line: 2510, baseType: !7, size: 32, offset: 224)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1006, file: !158, line: 2511, baseType: !890, size: 64, offset: 256)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1006, file: !158, line: 2512, baseType: !890, size: 64, offset: 320)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !892, file: !158, line: 3382, baseType: !1018, size: 896)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !158, line: 2652, size: 896, elements: !1019)
!1019 = !{!1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1018, file: !158, line: 2653, baseType: !1006, size: 384)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1018, file: !158, line: 2654, baseType: !890, size: 64, offset: 384)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1018, file: !158, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1018, file: !158, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1018, file: !158, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1018, file: !158, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1018, file: !158, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1018, file: !158, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1018, file: !158, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1018, file: !158, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1018, file: !158, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1018, file: !158, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1018, file: !158, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1018, file: !158, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1018, file: !158, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1018, file: !158, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1018, file: !158, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1018, file: !158, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1018, file: !158, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1018, file: !158, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1018, file: !158, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1018, file: !158, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1018, file: !158, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1018, file: !158, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1018, file: !158, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1018, file: !158, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1018, file: !158, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1018, file: !158, line: 2703, baseType: !7, size: 32, offset: 512)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1018, file: !158, line: 2705, baseType: !890, size: 64, offset: 576)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1018, file: !158, line: 2706, baseType: !890, size: 64, offset: 640)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1018, file: !158, line: 2707, baseType: !890, size: 64, offset: 704)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1018, file: !158, line: 2708, baseType: !890, size: 64, offset: 768)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1018, file: !158, line: 2711, baseType: !1053, size: 64, offset: 832)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !158, line: 2711, flags: DIFlagFwdDecl)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !892, file: !158, line: 3383, baseType: !1056, size: 960)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !158, line: 2756, size: 960, elements: !1057)
!1057 = !{!1058, !1059}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1056, file: !158, line: 2757, baseType: !1018, size: 896)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1056, file: !158, line: 2758, baseType: !836, size: 64, offset: 896)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !892, file: !158, line: 3384, baseType: !1061, size: 1472)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !158, line: 3114, size: 1472, elements: !1062)
!1062 = !{!1063, !1084, !1085, !1086, !1087}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1061, file: !158, line: 3115, baseType: !1064, size: 1216)
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !158, line: 2984, size: 1216, elements: !1065)
!1065 = !{!1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1064, file: !158, line: 2985, baseType: !1056, size: 960)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1064, file: !158, line: 2986, baseType: !890, size: 64, offset: 960)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1064, file: !158, line: 2987, baseType: !890, size: 64, offset: 1024)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1064, file: !158, line: 2988, baseType: !890, size: 64, offset: 1088)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1064, file: !158, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1064, file: !158, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1064, file: !158, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1064, file: !158, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1064, file: !158, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1064, file: !158, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1064, file: !158, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1064, file: !158, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1064, file: !158, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1064, file: !158, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1064, file: !158, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1064, file: !158, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1064, file: !158, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1064, file: !158, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1061, file: !158, line: 3117, baseType: !890, size: 64, offset: 1216)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1061, file: !158, line: 3119, baseType: !890, size: 64, offset: 1280)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1061, file: !158, line: 3121, baseType: !890, size: 64, offset: 1344)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1061, file: !158, line: 3123, baseType: !890, size: 64, offset: 1408)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !892, file: !158, line: 3385, baseType: !1089, size: 1088)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !158, line: 2874, size: 1088, elements: !1090)
!1090 = !{!1091, !1092, !1093}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1089, file: !158, line: 2875, baseType: !1056, size: 960)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1089, file: !158, line: 2876, baseType: !836, size: 64, offset: 960)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1089, file: !158, line: 2877, baseType: !1094, size: 64, offset: 1024)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64)
!1095 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !158, line: 2856, flags: DIFlagFwdDecl)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !892, file: !158, line: 3386, baseType: !1064, size: 1216)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !892, file: !158, line: 3387, baseType: !1098, size: 1280)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !158, line: 3093, size: 1280, elements: !1099)
!1099 = !{!1100, !1101}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1098, file: !158, line: 3094, baseType: !1064, size: 1216)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1098, file: !158, line: 3095, baseType: !1094, size: 64, offset: 1216)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !892, file: !158, line: 3388, baseType: !1103, size: 1216)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !158, line: 2824, size: 1216, elements: !1104)
!1104 = !{!1105, !1106, !1107, !1108, !1109, !1110}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1103, file: !158, line: 2825, baseType: !1018, size: 896)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1103, file: !158, line: 2827, baseType: !890, size: 64, offset: 896)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1103, file: !158, line: 2828, baseType: !890, size: 64, offset: 960)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1103, file: !158, line: 2829, baseType: !890, size: 64, offset: 1024)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1103, file: !158, line: 2830, baseType: !890, size: 64, offset: 1088)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1103, file: !158, line: 2831, baseType: !890, size: 64, offset: 1152)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !892, file: !158, line: 3389, baseType: !1112, size: 1024)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !158, line: 2850, size: 1024, elements: !1113)
!1113 = !{!1114, !1115, !1116}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1112, file: !158, line: 2851, baseType: !1056, size: 960)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1112, file: !158, line: 2852, baseType: !750, size: 32, offset: 960)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1112, file: !158, line: 2853, baseType: !750, size: 32, offset: 992)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !892, file: !158, line: 3390, baseType: !1118, size: 1024)
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !158, line: 2857, size: 1024, elements: !1119)
!1119 = !{!1120, !1121}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1118, file: !158, line: 2858, baseType: !1056, size: 960)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1118, file: !158, line: 2859, baseType: !1094, size: 64, offset: 960)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !892, file: !158, line: 3391, baseType: !1123, size: 960)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !158, line: 2862, size: 960, elements: !1124)
!1124 = !{!1125}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1123, file: !158, line: 2863, baseType: !1056, size: 960)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !892, file: !158, line: 3392, baseType: !1127, size: 1472)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !158, line: 3304, size: 1472, elements: !1128)
!1128 = !{!1129}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1127, file: !158, line: 3305, baseType: !1061, size: 1472)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !892, file: !158, line: 3393, baseType: !1131, size: 1792)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !158, line: 3248, size: 1792, elements: !1132)
!1132 = !{!1133, !1134, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1131, file: !158, line: 3249, baseType: !1061, size: 1472)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1131, file: !158, line: 3251, baseType: !1135, size: 64, offset: 1472)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1137, line: 463, size: 1152, elements: !1138)
!1137 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1138 = !{!1139, !1302, !1406, !1407, !1410, !1413, !1414, !1415, !1416, !1417, !1418, !1442, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1136, file: !1137, line: 464, baseType: !1140, size: 64)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !135, line: 194, size: 384, elements: !1142)
!1142 = !{!1143, !1192, !1205, !1219, !1270, !1283}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !1141, file: !135, line: 197, baseType: !1144, size: 64)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !135, line: 182, baseType: !1145)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !135, line: 116, size: 704, elements: !1147)
!1147 = !{!1148, !1149, !1150, !1151, !1152, !1153, !1180, !1189, !1190, !1191}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !1146, file: !135, line: 119, baseType: !1145, size: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1146, file: !135, line: 122, baseType: !1145, size: 64, offset: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !1146, file: !135, line: 123, baseType: !1145, size: 64, offset: 128)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1146, file: !135, line: 126, baseType: !750, size: 32, offset: 192)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1146, file: !135, line: 129, baseType: !134, size: 32, offset: 224)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1146, file: !135, line: 165, baseType: !1154, size: 192, offset: 256)
!1154 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !135, line: 132, size: 192, elements: !1155)
!1155 = !{!1156, !1169, !1175}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !1154, file: !135, line: 137, baseType: !1157, size: 128)
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !135, line: 133, size: 128, elements: !1158)
!1158 = !{!1159, !1168}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !1157, file: !135, line: 135, baseType: !1160, size: 64)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !135, line: 93, size: 320, elements: !1162)
!1162 = !{!1163, !1164, !1165, !1166, !1167}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !1161, file: !135, line: 96, baseType: !1160, size: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !1161, file: !135, line: 97, baseType: !1160, size: 64, offset: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1161, file: !135, line: 101, baseType: !890, size: 64, offset: 128)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !1161, file: !135, line: 106, baseType: !890, size: 64, offset: 192)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1161, file: !135, line: 111, baseType: !890, size: 64, offset: 256)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !1157, file: !135, line: 136, baseType: !1160, size: 64, offset: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !1154, file: !135, line: 151, baseType: !1170, size: 192)
!1170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !135, line: 139, size: 192, elements: !1171)
!1171 = !{!1172, !1173, !1174}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1170, file: !135, line: 141, baseType: !890, size: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1170, file: !135, line: 145, baseType: !890, size: 64, offset: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1170, file: !135, line: 150, baseType: !750, size: 32, offset: 128)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !1154, file: !135, line: 164, baseType: !1176, size: 128)
!1176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !135, line: 153, size: 128, elements: !1177)
!1177 = !{!1178, !1179}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !1176, file: !135, line: 161, baseType: !890, size: 64)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !1176, file: !135, line: 163, baseType: !1010, size: 32, offset: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !1146, file: !135, line: 168, baseType: !1181, size: 64, offset: 448)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64)
!1182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !135, line: 67, size: 320, elements: !1183)
!1183 = !{!1184, !1185, !1186, !1187, !1188}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !1182, file: !135, line: 70, baseType: !1181, size: 64)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1182, file: !135, line: 73, baseType: !1145, size: 64, offset: 64)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !1182, file: !135, line: 78, baseType: !890, size: 64, offset: 128)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !1182, file: !135, line: 85, baseType: !836, size: 64, offset: 192)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1182, file: !135, line: 88, baseType: !750, size: 32, offset: 256)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !1146, file: !135, line: 173, baseType: !836, size: 64, offset: 512)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !1146, file: !135, line: 173, baseType: !836, size: 64, offset: 576)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !1146, file: !135, line: 177, baseType: !749, size: 8, offset: 640)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !1141, file: !135, line: 200, baseType: !1193, size: 64, offset: 64)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !135, line: 185, baseType: !1195)
!1195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !135, line: 185, size: 128, elements: !1196)
!1196 = !{!1197}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1195, file: !135, line: 185, baseType: !1198, size: 128)
!1198 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !135, line: 184, baseType: !1199)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !135, line: 184, size: 128, elements: !1200)
!1200 = !{!1201, !1202, !1203}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1199, file: !135, line: 184, baseType: !7, size: 32)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1199, file: !135, line: 184, baseType: !7, size: 32, offset: 32)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1199, file: !135, line: 184, baseType: !1204, size: 64, offset: 64)
!1204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1144, size: 64, elements: !870)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !1141, file: !135, line: 203, baseType: !1206, size: 64, offset: 128)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, baseType: !1208)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, size: 128, elements: !1209)
!1209 = !{!1210}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1208, file: !135, line: 189, baseType: !1211, size: 128)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !135, line: 188, baseType: !1212)
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !135, line: 188, size: 128, elements: !1213)
!1213 = !{!1214, !1215, !1216}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1212, file: !135, line: 188, baseType: !7, size: 32)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1212, file: !135, line: 188, baseType: !7, size: 32, offset: 32)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1212, file: !135, line: 188, baseType: !1217, size: 64, offset: 64)
!1217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1218, size: 64, elements: !870)
!1218 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !135, line: 180, baseType: !1181)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !1141, file: !135, line: 207, baseType: !1220, size: 64, offset: 192)
!1220 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1221, line: 144, baseType: !1222)
!1221 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64)
!1223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1221, line: 100, size: 896, elements: !1224)
!1224 = !{!1225, !1233, !1238, !1243, !1244, !1247, !1248, !1249, !1250, !1251, !1256, !1258, !1259, !1264, !1269}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1223, file: !1221, line: 102, baseType: !1226, size: 64)
!1226 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1221, line: 52, baseType: !1227)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64)
!1228 = !DISubroutineType(types: !1229)
!1229 = !{!1230, !1231}
!1230 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1221, line: 47, baseType: !7)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64)
!1232 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1223, file: !1221, line: 105, baseType: !1234, size: 64, offset: 64)
!1234 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1221, line: 59, baseType: !1235)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64)
!1236 = !DISubroutineType(types: !1237)
!1237 = !{!750, !1231, !1231}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1223, file: !1221, line: 108, baseType: !1239, size: 64, offset: 128)
!1239 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1221, line: 63, baseType: !1240)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64)
!1241 = !DISubroutineType(types: !1242)
!1242 = !{null, !754}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1223, file: !1221, line: 111, baseType: !757, size: 64, offset: 192)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1223, file: !1221, line: 114, baseType: !1245, size: 64, offset: 256)
!1245 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1246, line: 46, baseType: !776)
!1246 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1223, file: !1221, line: 117, baseType: !1245, size: 64, offset: 320)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1223, file: !1221, line: 120, baseType: !1245, size: 64, offset: 384)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1223, file: !1221, line: 124, baseType: !7, size: 32, offset: 448)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1223, file: !1221, line: 128, baseType: !7, size: 32, offset: 480)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1223, file: !1221, line: 131, baseType: !1252, size: 64, offset: 512)
!1252 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1221, line: 75, baseType: !1253)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64)
!1254 = !DISubroutineType(types: !1255)
!1255 = !{!754, !1245, !1245}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1223, file: !1221, line: 132, baseType: !1257, size: 64, offset: 576)
!1257 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1221, line: 78, baseType: !1240)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1223, file: !1221, line: 135, baseType: !754, size: 64, offset: 640)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1223, file: !1221, line: 136, baseType: !1260, size: 64, offset: 704)
!1260 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1221, line: 82, baseType: !1261)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64)
!1262 = !DISubroutineType(types: !1263)
!1263 = !{!754, !754, !1245, !1245}
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1223, file: !1221, line: 137, baseType: !1265, size: 64, offset: 768)
!1265 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1221, line: 83, baseType: !1266)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64)
!1267 = !DISubroutineType(types: !1268)
!1268 = !{null, !754, !754}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1223, file: !1221, line: 141, baseType: !7, size: 32, offset: 832)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !1141, file: !135, line: 211, baseType: !1271, size: 64, offset: 256)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64)
!1272 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !158, line: 183, baseType: !1273)
!1273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !158, line: 183, size: 128, elements: !1274)
!1274 = !{!1275}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1273, file: !158, line: 183, baseType: !1276, size: 128)
!1276 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !158, line: 182, baseType: !1277)
!1277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !158, line: 182, size: 128, elements: !1278)
!1278 = !{!1279, !1280, !1281}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1277, file: !158, line: 182, baseType: !7, size: 32)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1277, file: !158, line: 182, baseType: !7, size: 32, offset: 32)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1277, file: !158, line: 182, baseType: !1282, size: 64, offset: 64)
!1282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !890, size: 64, elements: !870)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !1141, file: !135, line: 220, baseType: !1284, size: 64, offset: 320)
!1284 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !135, line: 217, size: 64, elements: !1285)
!1285 = !{!1286, !1287}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !1284, file: !135, line: 218, baseType: !1271, size: 64)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !1284, file: !135, line: 219, baseType: !1288, size: 64)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64)
!1289 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !1290, line: 29, baseType: !1291)
!1290 = !DIFile(filename: "./vecprim.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !1290, line: 29, size: 96, elements: !1292)
!1292 = !{!1293}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1291, file: !1290, line: 29, baseType: !1294, size: 96)
!1294 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !1290, line: 27, baseType: !1295)
!1295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !1290, line: 27, size: 96, elements: !1296)
!1296 = !{!1297, !1298, !1299}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1295, file: !1290, line: 27, baseType: !7, size: 32)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1295, file: !1290, line: 27, baseType: !7, size: 32, offset: 32)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1295, file: !1290, line: 27, baseType: !1300, size: 8, offset: 64)
!1300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1301, size: 8, elements: !870)
!1301 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !1290, line: 26, baseType: !749)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1136, file: !1137, line: 467, baseType: !1303, size: 64, offset: 64)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64)
!1304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !142, line: 374, size: 640, elements: !1305)
!1305 = !{!1306, !1381, !1382, !1395, !1396, !1397, !1398, !1399, !1400, !1402, !1404, !1405}
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1304, file: !142, line: 377, baseType: !1307, size: 64)
!1307 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !759, line: 111, baseType: !1308)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64)
!1309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !142, line: 217, size: 832, elements: !1310)
!1310 = !{!1311, !1346, !1347, !1348, !1351, !1355, !1356, !1357, !1375, !1376, !1377, !1378, !1379, !1380}
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1309, file: !142, line: 219, baseType: !1312, size: 64)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64)
!1313 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !142, line: 151, baseType: !1314)
!1314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !142, line: 151, size: 128, elements: !1315)
!1315 = !{!1316}
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1314, file: !142, line: 151, baseType: !1317, size: 128)
!1317 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !142, line: 150, baseType: !1318)
!1318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !142, line: 150, size: 128, elements: !1319)
!1319 = !{!1320, !1321, !1322}
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1318, file: !142, line: 150, baseType: !7, size: 32)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1318, file: !142, line: 150, baseType: !7, size: 32, offset: 32)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1318, file: !142, line: 150, baseType: !1323, size: 64, offset: 64)
!1323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1324, size: 64, elements: !870)
!1324 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !759, line: 108, baseType: !1325)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64)
!1326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !142, line: 122, size: 512, elements: !1327)
!1327 = !{!1328, !1329, !1330, !1338, !1339, !1340, !1341, !1342, !1343, !1344}
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1326, file: !142, line: 124, baseType: !1308, size: 64)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1326, file: !142, line: 125, baseType: !1308, size: 64, offset: 64)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1326, file: !142, line: 131, baseType: !1331, size: 64, offset: 128)
!1331 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !142, line: 128, size: 64, elements: !1332)
!1332 = !{!1333, !1337}
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1331, file: !142, line: 129, baseType: !1334, size: 64)
!1334 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !759, line: 66, baseType: !1335)
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1336, size: 64)
!1336 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !759, line: 65, flags: DIFlagFwdDecl)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1331, file: !142, line: 130, baseType: !836, size: 64)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1326, file: !142, line: 134, baseType: !754, size: 64, offset: 192)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1326, file: !142, line: 137, baseType: !890, size: 64, offset: 256)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1326, file: !142, line: 138, baseType: !1010, size: 32, offset: 320)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1326, file: !142, line: 142, baseType: !7, size: 32, offset: 352)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1326, file: !142, line: 144, baseType: !750, size: 32, offset: 384)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1326, file: !142, line: 145, baseType: !750, size: 32, offset: 416)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1326, file: !142, line: 146, baseType: !1345, size: 64, offset: 448)
!1345 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !142, line: 119, baseType: !793)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1309, file: !142, line: 220, baseType: !1312, size: 64, offset: 64)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1309, file: !142, line: 223, baseType: !754, size: 64, offset: 128)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1309, file: !142, line: 226, baseType: !1349, size: 64, offset: 192)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64)
!1350 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !142, line: 185, flags: DIFlagFwdDecl)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1309, file: !142, line: 229, baseType: !1352, size: 128, offset: 256)
!1352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1353, size: 128, elements: !777)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64)
!1354 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !142, line: 229, flags: DIFlagFwdDecl)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1309, file: !142, line: 232, baseType: !1308, size: 64, offset: 384)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1309, file: !142, line: 233, baseType: !1308, size: 64, offset: 448)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1309, file: !142, line: 238, baseType: !1358, size: 64, offset: 512)
!1358 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !142, line: 235, size: 64, elements: !1359)
!1359 = !{!1360, !1366}
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1358, file: !142, line: 236, baseType: !1361, size: 64)
!1361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1362, size: 64)
!1362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !142, line: 273, size: 128, elements: !1363)
!1363 = !{!1364, !1365}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1362, file: !142, line: 275, baseType: !1334, size: 64)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1362, file: !142, line: 278, baseType: !1334, size: 64, offset: 64)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1358, file: !142, line: 237, baseType: !1367, size: 64)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64)
!1368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !142, line: 259, size: 320, elements: !1369)
!1369 = !{!1370, !1371, !1372, !1373, !1374}
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1368, file: !142, line: 261, baseType: !836, size: 64)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1368, file: !142, line: 262, baseType: !836, size: 64, offset: 64)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1368, file: !142, line: 266, baseType: !836, size: 64, offset: 128)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1368, file: !142, line: 267, baseType: !836, size: 64, offset: 192)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1368, file: !142, line: 270, baseType: !750, size: 32, offset: 256)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1309, file: !142, line: 241, baseType: !1345, size: 64, offset: 576)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1309, file: !142, line: 244, baseType: !750, size: 32, offset: 640)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1309, file: !142, line: 247, baseType: !750, size: 32, offset: 672)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1309, file: !142, line: 250, baseType: !750, size: 32, offset: 704)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1309, file: !142, line: 253, baseType: !750, size: 32, offset: 736)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1309, file: !142, line: 256, baseType: !750, size: 32, offset: 768)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1304, file: !142, line: 378, baseType: !1307, size: 64, offset: 64)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1304, file: !142, line: 381, baseType: !1383, size: 64, offset: 128)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64)
!1384 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !142, line: 282, baseType: !1385)
!1385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !142, line: 282, size: 128, elements: !1386)
!1386 = !{!1387}
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1385, file: !142, line: 282, baseType: !1388, size: 128)
!1388 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !142, line: 281, baseType: !1389)
!1389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !142, line: 281, size: 128, elements: !1390)
!1390 = !{!1391, !1392, !1393}
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1389, file: !142, line: 281, baseType: !7, size: 32)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1389, file: !142, line: 281, baseType: !7, size: 32, offset: 32)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1389, file: !142, line: 281, baseType: !1394, size: 64, offset: 64)
!1394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1307, size: 64, elements: !870)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1304, file: !142, line: 384, baseType: !750, size: 32, offset: 192)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1304, file: !142, line: 387, baseType: !750, size: 32, offset: 224)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1304, file: !142, line: 390, baseType: !750, size: 32, offset: 256)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1304, file: !142, line: 394, baseType: !1383, size: 64, offset: 320)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1304, file: !142, line: 396, baseType: !141, size: 32, offset: 384)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1304, file: !142, line: 399, baseType: !1401, size: 64, offset: 416)
!1401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 64, elements: !777)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1304, file: !142, line: 402, baseType: !1403, size: 64, offset: 480)
!1403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !777)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1304, file: !142, line: 406, baseType: !750, size: 32, offset: 544)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1304, file: !142, line: 409, baseType: !750, size: 32, offset: 576)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1136, file: !1137, line: 470, baseType: !1335, size: 64, offset: 128)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1136, file: !1137, line: 473, baseType: !1408, size: 64, offset: 192)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64)
!1409 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1137, line: 166, flags: DIFlagFwdDecl)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1136, file: !1137, line: 476, baseType: !1411, size: 64, offset: 256)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64)
!1412 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1137, line: 476, flags: DIFlagFwdDecl)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1136, file: !1137, line: 479, baseType: !1220, size: 64, offset: 320)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1136, file: !1137, line: 484, baseType: !890, size: 64, offset: 384)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1136, file: !1137, line: 488, baseType: !890, size: 64, offset: 448)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1136, file: !1137, line: 493, baseType: !890, size: 64, offset: 512)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1136, file: !1137, line: 496, baseType: !890, size: 64, offset: 576)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1136, file: !1137, line: 501, baseType: !1419, size: 64, offset: 640)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64)
!1420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !153, line: 2355, size: 576, elements: !1421)
!1421 = !{!1422, !1425, !1426, !1427, !1428, !1430, !1431, !1436, !1437, !1438, !1439, !1440, !1441}
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1420, file: !153, line: 2356, baseType: !1423, size: 64)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64)
!1424 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !153, line: 2356, flags: DIFlagFwdDecl)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1420, file: !153, line: 2357, baseType: !755, size: 64, offset: 64)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1420, file: !153, line: 2358, baseType: !750, size: 32, offset: 128)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1420, file: !153, line: 2359, baseType: !750, size: 32, offset: 160)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1420, file: !153, line: 2360, baseType: !1429, size: 128, offset: 192)
!1429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !750, size: 128, elements: !802)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1420, file: !153, line: 2364, baseType: !750, size: 32, offset: 320)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1420, file: !153, line: 2367, baseType: !1432, size: 128, offset: 384)
!1432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !153, line: 2349, size: 128, elements: !1433)
!1433 = !{!1434, !1435}
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1432, file: !153, line: 2351, baseType: !836, size: 64)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1432, file: !153, line: 2352, baseType: !793, size: 64, offset: 64)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1420, file: !153, line: 2371, baseType: !152, size: 32, offset: 512)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1420, file: !153, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1420, file: !153, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1420, file: !153, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1420, file: !153, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1420, file: !153, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1136, file: !1137, line: 504, baseType: !1443, size: 64, offset: 704)
!1443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1444, size: 64)
!1444 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1137, line: 504, flags: DIFlagFwdDecl)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1136, file: !1137, line: 507, baseType: !1220, size: 64, offset: 768)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1136, file: !1137, line: 510, baseType: !750, size: 32, offset: 832)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1136, file: !1137, line: 513, baseType: !750, size: 32, offset: 864)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1136, file: !1137, line: 516, baseType: !1010, size: 32, offset: 896)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1136, file: !1137, line: 519, baseType: !1010, size: 32, offset: 928)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1136, file: !1137, line: 522, baseType: !7, size: 32, offset: 960)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1136, file: !1137, line: 523, baseType: !7, size: 32, offset: 992)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1136, file: !1137, line: 528, baseType: !755, size: 64, offset: 1024)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1136, file: !1137, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1136, file: !1137, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1136, file: !1137, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1136, file: !1137, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1136, file: !1137, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1136, file: !1137, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1136, file: !1137, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1136, file: !1137, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1136, file: !1137, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1136, file: !1137, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1136, file: !1137, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1136, file: !1137, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1136, file: !1137, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1136, file: !1137, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1136, file: !1137, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1136, file: !1137, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1131, file: !158, line: 3254, baseType: !890, size: 64, offset: 1536)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1131, file: !158, line: 3257, baseType: !890, size: 64, offset: 1600)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1131, file: !158, line: 3258, baseType: !890, size: 64, offset: 1664)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1131, file: !158, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1131, file: !158, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1131, file: !158, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1131, file: !158, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1131, file: !158, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1131, file: !158, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1131, file: !158, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1131, file: !158, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1131, file: !158, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1131, file: !158, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1131, file: !158, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1131, file: !158, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1131, file: !158, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1131, file: !158, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1131, file: !158, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1131, file: !158, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1131, file: !158, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1131, file: !158, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !892, file: !158, line: 3394, baseType: !1491, size: 1344)
!1491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !158, line: 2279, size: 1344, elements: !1492)
!1492 = !{!1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1518, !1519, !1520, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536}
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1491, file: !158, line: 2280, baseType: !928, size: 192)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1491, file: !158, line: 2281, baseType: !890, size: 64, offset: 192)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1491, file: !158, line: 2282, baseType: !890, size: 64, offset: 256)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1491, file: !158, line: 2283, baseType: !890, size: 64, offset: 320)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1491, file: !158, line: 2284, baseType: !890, size: 64, offset: 384)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1491, file: !158, line: 2285, baseType: !7, size: 32, offset: 448)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1491, file: !158, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1491, file: !158, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1491, file: !158, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1491, file: !158, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1491, file: !158, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1491, file: !158, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1491, file: !158, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1491, file: !158, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1491, file: !158, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1491, file: !158, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1491, file: !158, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
