; ModuleID = 'df-scan.bc'
source_filename = "df-scan.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.df = type { [8 x %struct.dataflow*], [8 x %struct.dataflow*], %struct.bitmap_head_def*, %struct.df_ref_info, %struct.df_ref_info, %struct.df_reg_info**, %struct.df_reg_info**, %struct.df_reg_info**, i32, i32, %struct.df_insn_info**, i32, i32, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, i32*, i32*, i32, i32, i32*, i32, i8, i8, i8 }
%struct.dataflow = type { %struct.df_problem*, i8**, i32, %struct.alloc_pool_def*, %struct.bitmap_head_def*, i8*, i32, i8, i8, i8 }

!701 = !DIEnumerator(name: "TV_VARCONST", value: 117, isUnsigned: true)
!702 = !DIEnumerator(name: "TV_LOWER_SUBREG", value: 118, isUnsigned: true)
!703 = !DIEnumerator(name: "TV_JUMP", value: 119, isUnsigned: true)
!704 = !DIEnumerator(name: "TV_FWPROP", value: 120, isUnsigned: true)
!705 = !DIEnumerator(name: "TV_CSE", value: 121, isUnsigned: true)
!706 = !DIEnumerator(name: "TV_DCE", value: 122, isUnsigned: true)
!707 = !DIEnumerator(name: "TV_DSE1", value: 123, isUnsigned: true)
!708 = !DIEnumerator(name: "TV_DSE2", value: 124, isUnsigned: true)
!709 = !DIEnumerator(name: "TV_LOOP", value: 125, isUnsigned: true)
!710 = !DIEnumerator(name: "TV_LOOP_MOVE_INVARIANTS", value: 126, isUnsigned: true)
!711 = !DIEnumerator(name: "TV_LOOP_UNSWITCH", value: 127, isUnsigned: true)
!712 = !DIEnumerator(name: "TV_LOOP_UNROLL", value: 128, isUnsigned: true)
!713 = !DIEnumerator(name: "TV_LOOP_DOLOOP", value: 129, isUnsigned: true)
!714 = !DIEnumerator(name: "TV_CPROP", value: 130, isUnsigned: true)
!715 = !DIEnumerator(name: "TV_PRE", value: 131, isUnsigned: true)
!716 = !DIEnumerator(name: "TV_HOIST", value: 132, isUnsigned: true)
!717 = !DIEnumerator(name: "TV_LSM", value: 133, isUnsigned: true)
!718 = !DIEnumerator(name: "TV_TRACER", value: 134, isUnsigned: true)
!719 = !DIEnumerator(name: "TV_WEB", value: 135, isUnsigned: true)
!720 = !DIEnumerator(name: "TV_AUTO_INC_DEC", value: 136, isUnsigned: true)
!721 = !DIEnumerator(name: "TV_CSE2", value: 137, isUnsigned: true)
!722 = !DIEnumerator(name: "TV_BRANCH_PROB", value: 138, isUnsigned: true)
!723 = !DIEnumerator(name: "TV_VPT", value: 139, isUnsigned: true)
!724 = !DIEnumerator(name: "TV_COMBINE", value: 140, isUnsigned: true)
!725 = !DIEnumerator(name: "TV_IFCVT", value: 141, isUnsigned: true)
!726 = !DIEnumerator(name: "TV_REGMOVE", value: 142, isUnsigned: true)
!727 = !DIEnumerator(name: "TV_MODE_SWITCH", value: 143, isUnsigned: true)
!728 = !DIEnumerator(name: "TV_SMS", value: 144, isUnsigned: true)
!729 = !DIEnumerator(name: "TV_SCHED", value: 145, isUnsigned: true)
!730 = !DIEnumerator(name: "TV_LOCAL_ALLOC", value: 146, isUnsigned: true)
!731 = !DIEnumerator(name: "TV_GLOBAL_ALLOC", value: 147, isUnsigned: true)
!732 = !DIEnumerator(name: "TV_IRA", value: 148, isUnsigned: true)
!733 = !DIEnumerator(name: "TV_RELOAD", value: 149, isUnsigned: true)
!734 = !DIEnumerator(name: "TV_RELOAD_CSE_REGS", value: 150, isUnsigned: true)
!735 = !DIEnumerator(name: "TV_SEQABSTR", value: 151, isUnsigned: true)
!736 = !DIEnumerator(name: "TV_GCSE_AFTER_RELOAD", value: 152, isUnsigned: true)
!737 = !DIEnumerator(name: "TV_THREAD_PROLOGUE_AND_EPILOGUE", value: 153, isUnsigned: true)
!738 = !DIEnumerator(name: "TV_IFCVT2", value: 154, isUnsigned: true)
!739 = !DIEnumerator(name: "TV_COMBINE_STACK_ADJUST", value: 155, isUnsigned: true)
!740 = !DIEnumerator(name: "TV_PEEPHOLE2", value: 156, isUnsigned: true)
!741 = !DIEnumerator(name: "TV_RENAME_REGISTERS", value: 157, isUnsigned: true)
!742 = !DIEnumerator(name: "TV_CPROP_REGISTERS", value: 158, isUnsigned: true)
!743 = !DIEnumerator(name: "TV_SCHED2", value: 159, isUnsigned: true)
!744 = !DIEnumerator(name: "TV_MACH_DEP", value: 160, isUnsigned: true)
!745 = !DIEnumerator(name: "TV_DBR_SCHED", value: 161, isUnsigned: true)
!746 = !DIEnumerator(name: "TV_REORDER_BLOCKS", value: 162, isUnsigned: true)
!747 = !DIEnumerator(name: "TV_SHORTEN_BRANCH", value: 163, isUnsigned: true)
!748 = !DIEnumerator(name: "TV_REG_STACK", value: 164, isUnsigned: true)
!749 = !DIEnumerator(name: "TV_FINAL", value: 165, isUnsigned: true)
!750 = !DIEnumerator(name: "TV_SYMOUT", value: 166, isUnsigned: true)
!751 = !DIEnumerator(name: "TV_VAR_TRACKING", value: 167, isUnsigned: true)
!752 = !DIEnumerator(name: "TV_TREE_IFCOMBINE", value: 168, isUnsigned: true)
!753 = !DIEnumerator(name: "TV_PLUGIN_INIT", value: 169, isUnsigned: true)
!754 = !DIEnumerator(name: "TV_PLUGIN_RUN", value: 170, isUnsigned: true)
!755 = !DIEnumerator(name: "TV_REST_OF_COMPILATION", value: 171, isUnsigned: true)
!756 = !DIEnumerator(name: "TIMEVAR_LAST", value: 172, isUnsigned: true)
!757 = !{!758, !759, !760, !761, !764, !765, !767, !863, !1936, !1942, !1937, !1943, !867, !399, !1893, !7, !1944, !1956, !1969, !542, !5, !1901, !1970, !1971, !868, !1968, !1973, !1975, !1902}
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!760 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !763)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "df_scan_problem_data", file: !3, line: 179, size: 2112, elements: !769)
!769 = !{!770, !795, !796, !797, !798, !799, !800, !801, !862}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "ref_base_pool", scope: !768, file: !3, line: 181, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_pool", file: !772, line: 58, baseType: !773)
!772 = !DIFile(filename: "./alloc-pool.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "alloc_pool_def", file: !772, line: 32, size: 704, elements: !775)
!775 = !{!776, !777, !781, !787, !788, !789, !790, !791, !792, !793, !794}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !774, file: !772, line: 34, baseType: !765, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "elts_per_block", scope: !774, file: !772, line: 38, baseType: !778, size: 64, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !779, line: 46, baseType: !780)
!779 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!780 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "returned_free_list", scope: !774, file: !772, line: 41, baseType: !782, size: 64, offset: 128)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_pool_list", file: !772, line: 30, baseType: !783)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "alloc_pool_list_def", file: !772, line: 26, size: 64, elements: !785)
!785 = !{!786}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !784, file: !772, line: 28, baseType: !783, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "virgin_free_list", scope: !774, file: !772, line: 45, baseType: !762, size: 64, offset: 192)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "virgin_elts_remaining", scope: !774, file: !772, line: 49, baseType: !778, size: 64, offset: 256)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "elts_allocated", scope: !774, file: !772, line: 51, baseType: !778, size: 64, offset: 320)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "elts_free", scope: !774, file: !772, line: 52, baseType: !778, size: 64, offset: 384)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_allocated", scope: !774, file: !772, line: 53, baseType: !778, size: 64, offset: 448)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "block_list", scope: !774, file: !772, line: 54, baseType: !782, size: 64, offset: 512)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !774, file: !772, line: 55, baseType: !778, size: 64, offset: 576)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "elt_size", scope: !774, file: !772, line: 56, baseType: !778, size: 64, offset: 640)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "ref_artificial_pool", scope: !768, file: !3, line: 182, baseType: !771, size: 64, offset: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "ref_regular_pool", scope: !768, file: !3, line: 183, baseType: !771, size: 64, offset: 128)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "ref_extract_pool", scope: !768, file: !3, line: 184, baseType: !771, size: 64, offset: 192)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "insn_pool", scope: !768, file: !3, line: 185, baseType: !771, size: 64, offset: 256)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "reg_pool", scope: !768, file: !3, line: 186, baseType: !771, size: 64, offset: 320)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "mw_reg_pool", scope: !768, file: !3, line: 187, baseType: !771, size: 64, offset: 384)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "reg_bitmaps", scope: !768, file: !3, line: 188, baseType: !802, size: 832, offset: 448)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !803, line: 49, baseType: !804)
!803 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !803, line: 45, size: 832, elements: !805)
!805 = !{!806, !818, !829}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !804, file: !803, line: 46, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !803, line: 63, size: 320, elements: !809)
!809 = !{!810, !811, !812, !813}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !808, file: !803, line: 64, baseType: !807, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !808, file: !803, line: 65, baseType: !807, size: 64, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !808, file: !803, line: 66, baseType: !7, size: 32, offset: 128)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !808, file: !803, line: 67, baseType: !814, size: 128, offset: 192)
!814 = !DICompositeType(tag: DW_TAG_array_type, baseType: !815, size: 128, elements: !816)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !803, line: 29, baseType: !780)
!816 = !{!817}
!817 = !DISubrange(count: 2)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !804, file: !803, line: 47, baseType: !819, size: 64, offset: 64)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !803, line: 75, size: 256, elements: !821)
!821 = !{!822, !825, !826, !827}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !820, file: !803, line: 76, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !803, line: 68, baseType: !808)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !820, file: !803, line: 77, baseType: !823, size: 64, offset: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !820, file: !803, line: 78, baseType: !7, size: 32, offset: 128)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !820, file: !803, line: 79, baseType: !828, size: 64, offset: 192)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !804, file: !803, line: 48, baseType: !830, size: 704, offset: 128)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !831, line: 164, size: 704, elements: !832)
!831 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!832 = !{!833, !835, !845, !846, !847, !848, !849, !850, !854, !858, !859, !860, !861}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !830, file: !831, line: 166, baseType: !834, size: 64)
!834 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !830, file: !831, line: 167, baseType: !836, size: 64, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !831, line: 157, size: 192, elements: !838)
!838 = !{!839, !840, !841}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !837, file: !831, line: 159, baseType: !762, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !837, file: !831, line: 160, baseType: !836, size: 64, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !837, file: !831, line: 161, baseType: !842, size: 32, offset: 128)
!842 = !DICompositeType(tag: DW_TAG_array_type, baseType: !763, size: 32, elements: !843)
!843 = !{!844}
!844 = !DISubrange(count: 4)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !830, file: !831, line: 168, baseType: !762, size: 64, offset: 128)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !830, file: !831, line: 169, baseType: !762, size: 64, offset: 192)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !830, file: !831, line: 170, baseType: !762, size: 64, offset: 256)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !830, file: !831, line: 171, baseType: !834, size: 64, offset: 320)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !830, file: !831, line: 172, baseType: !760, size: 32, offset: 384)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !830, file: !831, line: 176, baseType: !851, size: 64, offset: 448)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DISubroutineType(types: !853)
!853 = !{!836, !764, !834}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !830, file: !831, line: 177, baseType: !855, size: 64, offset: 512)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DISubroutineType(types: !857)
!857 = !{null, !764, !836}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !830, file: !831, line: 178, baseType: !764, size: 64, offset: 576)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !830, file: !831, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !830, file: !831, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !830, file: !831, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "insn_bitmaps", scope: !768, file: !3, line: 189, baseType: !802, size: 832, offset: 1280)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "df_scan_bb_info", file: !378, line: 771, size: 128, elements: !865)
!865 = !{!866, !1935}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_defs", scope: !864, file: !378, line: 782, baseType: !867, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "df_ref", file: !378, line: 429, baseType: !869)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "df_ref_d", file: !378, line: 422, size: 704, elements: !871)
!871 = !{!872, !1917, !1923, !1928}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !870, file: !378, line: 424, baseType: !873, size: 512)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "df_base_ref", file: !378, line: 356, size: 512, elements: !874)
!874 = !{!875, !876, !877, !878, !1886, !1892, !1912, !1913, !1914, !1915, !1916}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !873, file: !378, line: 360, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !873, file: !378, line: 362, baseType: !7, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !873, file: !378, line: 364, baseType: !760, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !873, file: !378, line: 365, baseType: !879, size: 64, offset: 64)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !880, line: 50, baseType: !881)
!880 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !400, line: 240, size: 384, elements: !883)
!883 = !{!884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !882, file: !400, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !882, file: !400, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !882, file: !400, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !882, file: !400, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !882, file: !400, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !882, file: !400, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !882, file: !400, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !882, file: !400, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !882, file: !400, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !882, file: !400, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !882, file: !400, line: 321, baseType: !895, size: 320, offset: 64)
!895 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !400, line: 315, size: 320, elements: !896)
!896 = !{!897, !1821, !1823, !1884, !1885}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !895, file: !400, line: 316, baseType: !898, size: 64)
!898 = !DICompositeType(tag: DW_TAG_array_type, baseType: !899, size: 64, elements: !914)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !400, line: 183, baseType: !900)
!900 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !400, line: 166, size: 64, elements: !901)
!901 = !{!902, !903, !904, !905, !906, !916, !917, !929, !932, !933, !1799, !1800, !1811, !1818}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !900, file: !400, line: 168, baseType: !760, size: 32)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !900, file: !400, line: 169, baseType: !7, size: 32)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !900, file: !400, line: 170, baseType: !765, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !900, file: !400, line: 171, baseType: !879, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !900, file: !400, line: 172, baseType: !907, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !880, line: 53, baseType: !908)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !400, line: 359, size: 128, elements: !910)
!910 = !{!911, !912}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !909, file: !400, line: 360, baseType: !760, size: 32)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !909, file: !400, line: 361, baseType: !913, size: 64, offset: 64)
!913 = !DICompositeType(tag: DW_TAG_array_type, baseType: !879, size: 64, elements: !914)
!914 = !{!915}
!915 = !DISubrange(count: 1)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !900, file: !400, line: 173, baseType: !5, size: 32)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !900, file: !400, line: 174, baseType: !918, size: 32)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !400, line: 133, baseType: !919)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !400, line: 115, size: 32, elements: !920)
!920 = !{!921, !922, !923, !924, !925, !926, !927, !928}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !919, file: !400, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !919, file: !400, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !919, file: !400, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !919, file: !400, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !919, file: !400, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !919, file: !400, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !919, file: !400, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !919, file: !400, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !900, file: !400, line: 175, baseType: !930, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !400, line: 175, flags: DIFlagFwdDecl)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !900, file: !400, line: 176, baseType: !819, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !900, file: !400, line: 177, baseType: !934, size: 64)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !880, line: 56, baseType: !935)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !151, line: 3371, size: 1792, elements: !937)
!937 = !{!938, !971, !977, !988, !1007, !1018, !1023, !1030, !1036, !1049, !1061, !1099, !1104, !1132, !1140, !1141, !1146, !1155, !1161, !1166, !1170, !1174, !1423, !1472, !1478, !1485, !1492, !1518, !1543, !1560, !1572, !1594, !1609, !1781}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !936, file: !151, line: 3372, baseType: !939, size: 64)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !151, line: 360, size: 64, elements: !940)
!940 = !{!941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !939, file: !151, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !939, file: !151, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !939, file: !151, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !939, file: !151, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !939, file: !151, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !939, file: !151, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !939, file: !151, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !939, file: !151, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !939, file: !151, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !939, file: !151, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !939, file: !151, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !939, file: !151, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !939, file: !151, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !939, file: !151, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !939, file: !151, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !939, file: !151, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !939, file: !151, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !939, file: !151, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !939, file: !151, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !939, file: !151, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !939, file: !151, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !939, file: !151, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !939, file: !151, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !939, file: !151, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !939, file: !151, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !939, file: !151, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !939, file: !151, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !939, file: !151, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !939, file: !151, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !939, file: !151, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !936, file: !151, line: 3373, baseType: !972, size: 192)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !151, line: 402, size: 192, elements: !973)
!973 = !{!974, !975, !976}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !972, file: !151, line: 403, baseType: !939, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !972, file: !151, line: 404, baseType: !934, size: 64, offset: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !972, file: !151, line: 405, baseType: !934, size: 64, offset: 128)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !936, file: !151, line: 3374, baseType: !978, size: 320)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !151, line: 1384, size: 320, elements: !979)
!979 = !{!980, !981}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !978, file: !151, line: 1385, baseType: !972, size: 192)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !978, file: !151, line: 1386, baseType: !982, size: 128, offset: 192)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !983, line: 58, baseType: !984)
!983 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !983, line: 54, size: 128, elements: !985)
!985 = !{!986, !987}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !984, file: !983, line: 56, baseType: !780, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !984, file: !983, line: 57, baseType: !834, size: 64, offset: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !936, file: !151, line: 3375, baseType: !989, size: 256)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !151, line: 1397, size: 256, elements: !990)
!990 = !{!991, !992}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !989, file: !151, line: 1398, baseType: !972, size: 192)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !989, file: !151, line: 1399, baseType: !993, size: 64, offset: 192)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !995, line: 52, size: 256, elements: !996)
!995 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!996 = !{!997, !998, !999, !1000, !1001, !1002, !1003}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !994, file: !995, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !994, file: !995, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !994, file: !995, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !994, file: !995, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !994, file: !995, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !994, file: !995, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !994, file: !995, line: 62, baseType: !1004, size: 192, offset: 64)
!1004 = !DICompositeType(tag: DW_TAG_array_type, baseType: !780, size: 192, elements: !1005)
!1005 = !{!1006}
!1006 = !DISubrange(count: 3)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !936, file: !151, line: 3376, baseType: !1008, size: 256)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !151, line: 1408, size: 256, elements: !1009)
!1009 = !{!1010, !1011}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1008, file: !151, line: 1409, baseType: !972, size: 192)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !1008, file: !151, line: 1410, baseType: !1012, size: 64, offset: 192)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !1014, line: 27, size: 192, elements: !1015)
!1014 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1015 = !{!1016, !1017}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1013, file: !1014, line: 29, baseType: !982, size: 128)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1013, file: !1014, line: 30, baseType: !5, size: 32, offset: 128)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !936, file: !151, line: 3377, baseType: !1019, size: 256)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !151, line: 1437, size: 256, elements: !1020)
!1020 = !{!1021, !1022}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1019, file: !151, line: 1438, baseType: !972, size: 192)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1019, file: !151, line: 1439, baseType: !934, size: 64, offset: 192)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !936, file: !151, line: 3378, baseType: !1024, size: 256)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !151, line: 1418, size: 256, elements: !1025)
!1025 = !{!1026, !1027, !1028}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1024, file: !151, line: 1419, baseType: !972, size: 192)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1024, file: !151, line: 1420, baseType: !760, size: 32, offset: 192)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1024, file: !151, line: 1421, baseType: !1029, size: 8, offset: 224)
!1029 = !DICompositeType(tag: DW_TAG_array_type, baseType: !763, size: 8, elements: !914)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !936, file: !151, line: 3379, baseType: !1031, size: 320)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !151, line: 1428, size: 320, elements: !1032)
!1032 = !{!1033, !1034, !1035}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1031, file: !151, line: 1429, baseType: !972, size: 192)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !1031, file: !151, line: 1430, baseType: !934, size: 64, offset: 192)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !1031, file: !151, line: 1431, baseType: !934, size: 64, offset: 256)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !936, file: !151, line: 3380, baseType: !1037, size: 320)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !151, line: 1460, size: 320, elements: !1038)
!1038 = !{!1039, !1040}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1037, file: !151, line: 1461, baseType: !972, size: 192)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1037, file: !151, line: 1462, baseType: !1041, size: 128, offset: 192)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1042, line: 31, size: 128, elements: !1043)
!1042 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1043 = !{!1044, !1047, !1048}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1041, file: !1042, line: 32, baseType: !1045, size: 64)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !759)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1041, file: !1042, line: 33, baseType: !7, size: 32, offset: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1041, file: !1042, line: 34, baseType: !7, size: 32, offset: 96)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !936, file: !151, line: 3381, baseType: !1050, size: 384)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !151, line: 2507, size: 384, elements: !1051)
!1051 = !{!1052, !1053, !1058, !1059, !1060}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1050, file: !151, line: 2508, baseType: !972, size: 192)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1050, file: !151, line: 2509, baseType: !1054, size: 32, offset: 192)
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1055, line: 58, baseType: !1056)
!1055 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1057, line: 44, baseType: !7)
!1057 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1050, file: !151, line: 2510, baseType: !7, size: 32, offset: 224)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1050, file: !151, line: 2511, baseType: !934, size: 64, offset: 256)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1050, file: !151, line: 2512, baseType: !934, size: 64, offset: 320)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !936, file: !151, line: 3382, baseType: !1062, size: 896)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !151, line: 2652, size: 896, elements: !1063)
!1063 = !{!1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1062, file: !151, line: 2653, baseType: !1050, size: 384)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1062, file: !151, line: 2654, baseType: !934, size: 64, offset: 384)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1062, file: !151, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1062, file: !151, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1062, file: !151, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1062, file: !151, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1062, file: !151, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1062, file: !151, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1062, file: !151, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1062, file: !151, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1062, file: !151, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1062, file: !151, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1062, file: !151, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1062, file: !151, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1062, file: !151, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1062, file: !151, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1062, file: !151, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1062, file: !151, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1062, file: !151, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1062, file: !151, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1062, file: !151, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1062, file: !151, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1062, file: !151, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1062, file: !151, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1062, file: !151, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1062, file: !151, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1062, file: !151, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1062, file: !151, line: 2703, baseType: !7, size: 32, offset: 512)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1062, file: !151, line: 2705, baseType: !934, size: 64, offset: 576)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1062, file: !151, line: 2706, baseType: !934, size: 64, offset: 640)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1062, file: !151, line: 2707, baseType: !934, size: 64, offset: 704)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1062, file: !151, line: 2708, baseType: !934, size: 64, offset: 768)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1062, file: !151, line: 2711, baseType: !1097, size: 64, offset: 832)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !151, line: 2711, flags: DIFlagFwdDecl)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !936, file: !151, line: 3383, baseType: !1100, size: 960)
!1100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !151, line: 2756, size: 960, elements: !1101)
!1101 = !{!1102, !1103}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1100, file: !151, line: 2757, baseType: !1062, size: 896)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1100, file: !151, line: 2758, baseType: !879, size: 64, offset: 896)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !936, file: !151, line: 3384, baseType: !1105, size: 1472)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !151, line: 3114, size: 1472, elements: !1106)
!1106 = !{!1107, !1128, !1129, !1130, !1131}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1105, file: !151, line: 3115, baseType: !1108, size: 1216)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !151, line: 2984, size: 1216, elements: !1109)
!1109 = !{!1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1108, file: !151, line: 2985, baseType: !1100, size: 960)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1108, file: !151, line: 2986, baseType: !934, size: 64, offset: 960)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1108, file: !151, line: 2987, baseType: !934, size: 64, offset: 1024)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1108, file: !151, line: 2988, baseType: !934, size: 64, offset: 1088)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1108, file: !151, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1108, file: !151, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1108, file: !151, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1108, file: !151, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1108, file: !151, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1108, file: !151, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1108, file: !151, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1108, file: !151, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1108, file: !151, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1108, file: !151, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1108, file: !151, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1108, file: !151, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1108, file: !151, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1108, file: !151, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1105, file: !151, line: 3117, baseType: !934, size: 64, offset: 1216)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1105, file: !151, line: 3119, baseType: !934, size: 64, offset: 1280)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1105, file: !151, line: 3121, baseType: !934, size: 64, offset: 1344)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1105, file: !151, line: 3123, baseType: !934, size: 64, offset: 1408)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !936, file: !151, line: 3385, baseType: !1133, size: 1088)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !151, line: 2874, size: 1088, elements: !1134)
!1134 = !{!1135, !1136, !1137}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1133, file: !151, line: 2875, baseType: !1100, size: 960)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1133, file: !151, line: 2876, baseType: !879, size: 64, offset: 960)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1133, file: !151, line: 2877, baseType: !1138, size: 64, offset: 1024)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64)
!1139 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !151, line: 2856, flags: DIFlagFwdDecl)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !936, file: !151, line: 3386, baseType: !1108, size: 1216)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !936, file: !151, line: 3387, baseType: !1142, size: 1280)
!1142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !151, line: 3093, size: 1280, elements: !1143)
!1143 = !{!1144, !1145}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1142, file: !151, line: 3094, baseType: !1108, size: 1216)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1142, file: !151, line: 3095, baseType: !1138, size: 64, offset: 1216)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !936, file: !151, line: 3388, baseType: !1147, size: 1216)
!1147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !151, line: 2824, size: 1216, elements: !1148)
!1148 = !{!1149, !1150, !1151, !1152, !1153, !1154}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1147, file: !151, line: 2825, baseType: !1062, size: 896)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1147, file: !151, line: 2827, baseType: !934, size: 64, offset: 896)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1147, file: !151, line: 2828, baseType: !934, size: 64, offset: 960)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1147, file: !151, line: 2829, baseType: !934, size: 64, offset: 1024)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1147, file: !151, line: 2830, baseType: !934, size: 64, offset: 1088)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1147, file: !151, line: 2831, baseType: !934, size: 64, offset: 1152)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !936, file: !151, line: 3389, baseType: !1156, size: 1024)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !151, line: 2850, size: 1024, elements: !1157)
!1157 = !{!1158, !1159, !1160}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1156, file: !151, line: 2851, baseType: !1100, size: 960)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1156, file: !151, line: 2852, baseType: !760, size: 32, offset: 960)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1156, file: !151, line: 2853, baseType: !760, size: 32, offset: 992)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !936, file: !151, line: 3390, baseType: !1162, size: 1024)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !151, line: 2857, size: 1024, elements: !1163)
!1163 = !{!1164, !1165}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1162, file: !151, line: 2858, baseType: !1100, size: 960)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1162, file: !151, line: 2859, baseType: !1138, size: 64, offset: 960)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !936, file: !151, line: 3391, baseType: !1167, size: 960)
!1167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !151, line: 2862, size: 960, elements: !1168)
!1168 = !{!1169}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1167, file: !151, line: 2863, baseType: !1100, size: 960)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !936, file: !151, line: 3392, baseType: !1171, size: 1472)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !151, line: 3304, size: 1472, elements: !1172)
!1172 = !{!1173}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1171, file: !151, line: 3305, baseType: !1105, size: 1472)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !936, file: !151, line: 3393, baseType: !1175, size: 1792)
!1175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !151, line: 3248, size: 1792, elements: !1176)
!1176 = !{!1177, !1178, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1175, file: !151, line: 3249, baseType: !1105, size: 1472)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1175, file: !151, line: 3251, baseType: !1179, size: 64, offset: 1472)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64)
!1180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1181, line: 463, size: 1152, elements: !1182)
!1181 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1182 = !{!1183, !1186, !1290, !1291, !1294, !1297, !1347, !1348, !1349, !1350, !1351, !1375, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1180, file: !1181, line: 464, baseType: !1184, size: 64)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1181, line: 464, flags: DIFlagFwdDecl)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1180, file: !1181, line: 467, baseType: !1187, size: 64, offset: 64)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64)
!1188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !135, line: 374, size: 640, elements: !1189)
!1189 = !{!1190, !1265, !1266, !1279, !1280, !1281, !1282, !1283, !1284, !1286, !1288, !1289}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1188, file: !135, line: 377, baseType: !1191, size: 64)
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !880, line: 111, baseType: !1192)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1193, size: 64)
!1193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !135, line: 217, size: 832, elements: !1194)
!1194 = !{!1195, !1230, !1231, !1232, !1235, !1239, !1240, !1241, !1259, !1260, !1261, !1262, !1263, !1264}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1193, file: !135, line: 219, baseType: !1196, size: 64)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !135, line: 151, baseType: !1198)
!1198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !135, line: 151, size: 128, elements: !1199)
!1199 = !{!1200}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1198, file: !135, line: 151, baseType: !1201, size: 128)
!1201 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !135, line: 150, baseType: !1202)
!1202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !135, line: 150, size: 128, elements: !1203)
!1203 = !{!1204, !1205, !1206}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1202, file: !135, line: 150, baseType: !7, size: 32)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1202, file: !135, line: 150, baseType: !7, size: 32, offset: 32)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1202, file: !135, line: 150, baseType: !1207, size: 64, offset: 64)
!1207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1208, size: 64, elements: !914)
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !880, line: 108, baseType: !1209)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64)
!1210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !135, line: 122, size: 512, elements: !1211)
!1211 = !{!1212, !1213, !1214, !1222, !1223, !1224, !1225, !1226, !1227, !1228}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1210, file: !135, line: 124, baseType: !1192, size: 64)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1210, file: !135, line: 125, baseType: !1192, size: 64, offset: 64)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1210, file: !135, line: 131, baseType: !1215, size: 64, offset: 128)
!1215 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !135, line: 128, size: 64, elements: !1216)
!1216 = !{!1217, !1221}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1215, file: !135, line: 129, baseType: !1218, size: 64)
!1218 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !880, line: 66, baseType: !1219)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64)
!1220 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !880, line: 65, flags: DIFlagFwdDecl)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1215, file: !135, line: 130, baseType: !879, size: 64)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1210, file: !135, line: 134, baseType: !764, size: 64, offset: 192)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1210, file: !135, line: 137, baseType: !934, size: 64, offset: 256)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1210, file: !135, line: 138, baseType: !1054, size: 32, offset: 320)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1210, file: !135, line: 142, baseType: !7, size: 32, offset: 352)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1210, file: !135, line: 144, baseType: !760, size: 32, offset: 384)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1210, file: !135, line: 145, baseType: !760, size: 32, offset: 416)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1210, file: !135, line: 146, baseType: !1229, size: 64, offset: 448)
!1229 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !135, line: 119, baseType: !834)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1193, file: !135, line: 220, baseType: !1196, size: 64, offset: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1193, file: !135, line: 223, baseType: !764, size: 64, offset: 128)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1193, file: !135, line: 226, baseType: !1233, size: 64, offset: 192)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64)
!1234 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !135, line: 185, flags: DIFlagFwdDecl)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1193, file: !135, line: 229, baseType: !1236, size: 128, offset: 256)
!1236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1237, size: 128, elements: !816)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64)
!1238 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !135, line: 229, flags: DIFlagFwdDecl)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1193, file: !135, line: 232, baseType: !1192, size: 64, offset: 384)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1193, file: !135, line: 233, baseType: !1192, size: 64, offset: 448)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1193, file: !135, line: 238, baseType: !1242, size: 64, offset: 512)
!1242 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !135, line: 235, size: 64, elements: !1243)
!1243 = !{!1244, !1250}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1242, file: !135, line: 236, baseType: !1245, size: 64)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64)
!1246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !135, line: 273, size: 128, elements: !1247)
!1247 = !{!1248, !1249}
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1246, file: !135, line: 275, baseType: !1218, size: 64)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1246, file: !135, line: 278, baseType: !1218, size: 64, offset: 64)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1242, file: !135, line: 237, baseType: !1251, size: 64)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !135, line: 259, size: 320, elements: !1253)
!1253 = !{!1254, !1255, !1256, !1257, !1258}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1252, file: !135, line: 261, baseType: !879, size: 64)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1252, file: !135, line: 262, baseType: !879, size: 64, offset: 64)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1252, file: !135, line: 266, baseType: !879, size: 64, offset: 128)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1252, file: !135, line: 267, baseType: !879, size: 64, offset: 192)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1252, file: !135, line: 270, baseType: !760, size: 32, offset: 256)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1193, file: !135, line: 241, baseType: !1229, size: 64, offset: 576)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1193, file: !135, line: 244, baseType: !760, size: 32, offset: 640)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1193, file: !135, line: 247, baseType: !760, size: 32, offset: 672)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1193, file: !135, line: 250, baseType: !760, size: 32, offset: 704)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1193, file: !135, line: 253, baseType: !760, size: 32, offset: 736)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1193, file: !135, line: 256, baseType: !760, size: 32, offset: 768)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1188, file: !135, line: 378, baseType: !1191, size: 64, offset: 64)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1188, file: !135, line: 381, baseType: !1267, size: 64, offset: 128)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64)
!1268 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !135, line: 282, baseType: !1269)
!1269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !135, line: 282, size: 128, elements: !1270)
!1270 = !{!1271}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1269, file: !135, line: 282, baseType: !1272, size: 128)
!1272 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !135, line: 281, baseType: !1273)
!1273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !135, line: 281, size: 128, elements: !1274)
!1274 = !{!1275, !1276, !1277}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1273, file: !135, line: 281, baseType: !7, size: 32)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1273, file: !135, line: 281, baseType: !7, size: 32, offset: 32)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1273, file: !135, line: 281, baseType: !1278, size: 64, offset: 64)
!1278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1191, size: 64, elements: !914)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1188, file: !135, line: 384, baseType: !760, size: 32, offset: 192)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1188, file: !135, line: 387, baseType: !760, size: 32, offset: 224)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1188, file: !135, line: 390, baseType: !760, size: 32, offset: 256)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1188, file: !135, line: 394, baseType: !1267, size: 64, offset: 320)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1188, file: !135, line: 396, baseType: !134, size: 32, offset: 384)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1188, file: !135, line: 399, baseType: !1285, size: 64, offset: 416)
!1285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 64, elements: !816)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1188, file: !135, line: 402, baseType: !1287, size: 64, offset: 480)
!1287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !816)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1188, file: !135, line: 406, baseType: !760, size: 32, offset: 544)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1188, file: !135, line: 409, baseType: !760, size: 32, offset: 576)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1180, file: !1181, line: 470, baseType: !1219, size: 64, offset: 128)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1180, file: !1181, line: 473, baseType: !1292, size: 64, offset: 192)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64)
!1293 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1181, line: 166, flags: DIFlagFwdDecl)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1180, file: !1181, line: 476, baseType: !1295, size: 64, offset: 256)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64)
!1296 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1181, line: 476, flags: DIFlagFwdDecl)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1180, file: !1181, line: 479, baseType: !1298, size: 64, offset: 320)
!1298 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1299, line: 144, baseType: !1300)
!1299 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64)
!1301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1299, line: 100, size: 896, elements: !1302)
!1302 = !{!1303, !1311, !1316, !1321, !1323, !1324, !1325, !1326, !1327, !1328, !1333, !1335, !1336, !1341, !1346}
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1301, file: !1299, line: 102, baseType: !1304, size: 64)
!1304 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1299, line: 52, baseType: !1305)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64)
!1306 = !DISubroutineType(types: !1307)
!1307 = !{!1308, !1309}
!1308 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1299, line: 47, baseType: !7)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64)
!1310 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1301, file: !1299, line: 105, baseType: !1312, size: 64, offset: 64)
!1312 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1299, line: 59, baseType: !1313)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64)
!1314 = !DISubroutineType(types: !1315)
!1315 = !{!760, !1309, !1309}
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1301, file: !1299, line: 108, baseType: !1317, size: 64, offset: 128)
!1317 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1299, line: 63, baseType: !1318)
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64)
!1319 = !DISubroutineType(types: !1320)
!1320 = !{null, !764}
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1301, file: !1299, line: 111, baseType: !1322, size: 64, offset: 192)
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1301, file: !1299, line: 114, baseType: !778, size: 64, offset: 256)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1301, file: !1299, line: 117, baseType: !778, size: 64, offset: 320)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1301, file: !1299, line: 120, baseType: !778, size: 64, offset: 384)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1301, file: !1299, line: 124, baseType: !7, size: 32, offset: 448)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1301, file: !1299, line: 128, baseType: !7, size: 32, offset: 480)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1301, file: !1299, line: 131, baseType: !1329, size: 64, offset: 512)
!1329 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1299, line: 75, baseType: !1330)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64)
!1331 = !DISubroutineType(types: !1332)
!1332 = !{!764, !778, !778}
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1301, file: !1299, line: 132, baseType: !1334, size: 64, offset: 576)
!1334 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1299, line: 78, baseType: !1318)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1301, file: !1299, line: 135, baseType: !764, size: 64, offset: 640)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1301, file: !1299, line: 136, baseType: !1337, size: 64, offset: 704)
!1337 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1299, line: 82, baseType: !1338)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64)
!1339 = !DISubroutineType(types: !1340)
!1340 = !{!764, !764, !778, !778}
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1301, file: !1299, line: 137, baseType: !1342, size: 64, offset: 768)
!1342 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1299, line: 83, baseType: !1343)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64)
!1344 = !DISubroutineType(types: !1345)
!1345 = !{null, !764, !764}
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1301, file: !1299, line: 141, baseType: !7, size: 32, offset: 832)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1180, file: !1181, line: 484, baseType: !934, size: 64, offset: 384)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1180, file: !1181, line: 488, baseType: !934, size: 64, offset: 448)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1180, file: !1181, line: 493, baseType: !934, size: 64, offset: 512)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1180, file: !1181, line: 496, baseType: !934, size: 64, offset: 576)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1180, file: !1181, line: 501, baseType: !1352, size: 64, offset: 640)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64)
!1353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !146, line: 2355, size: 576, elements: !1354)
!1354 = !{!1355, !1358, !1359, !1360, !1361, !1363, !1364, !1369, !1370, !1371, !1372, !1373, !1374}
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1353, file: !146, line: 2356, baseType: !1356, size: 64)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64)
!1357 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !146, line: 2356, flags: DIFlagFwdDecl)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1353, file: !146, line: 2357, baseType: !765, size: 64, offset: 64)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1353, file: !146, line: 2358, baseType: !760, size: 32, offset: 128)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1353, file: !146, line: 2359, baseType: !760, size: 32, offset: 160)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1353, file: !146, line: 2360, baseType: !1362, size: 128, offset: 192)
!1362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !760, size: 128, elements: !843)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1353, file: !146, line: 2364, baseType: !760, size: 32, offset: 320)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1353, file: !146, line: 2367, baseType: !1365, size: 128, offset: 384)
!1365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !146, line: 2349, size: 128, elements: !1366)
!1366 = !{!1367, !1368}
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1365, file: !146, line: 2351, baseType: !879, size: 64)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1365, file: !146, line: 2352, baseType: !834, size: 64, offset: 64)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1353, file: !146, line: 2371, baseType: !145, size: 32, offset: 512)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1353, file: !146, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1353, file: !146, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1353, file: !146, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1353, file: !146, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1353, file: !146, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1180, file: !1181, line: 504, baseType: !1376, size: 64, offset: 704)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64)
!1377 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1181, line: 504, flags: DIFlagFwdDecl)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1180, file: !1181, line: 507, baseType: !1298, size: 64, offset: 768)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1180, file: !1181, line: 510, baseType: !760, size: 32, offset: 832)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1180, file: !1181, line: 513, baseType: !760, size: 32, offset: 864)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1180, file: !1181, line: 516, baseType: !1054, size: 32, offset: 896)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1180, file: !1181, line: 519, baseType: !1054, size: 32, offset: 928)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1180, file: !1181, line: 522, baseType: !7, size: 32, offset: 960)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1180, file: !1181, line: 523, baseType: !7, size: 32, offset: 992)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1180, file: !1181, line: 528, baseType: !765, size: 64, offset: 1024)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1180, file: !1181, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1180, file: !1181, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1180, file: !1181, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1180, file: !1181, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1180, file: !1181, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1180, file: !1181, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1180, file: !1181, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1180, file: !1181, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1180, file: !1181, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1180, file: !1181, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1180, file: !1181, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1180, file: !1181, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1180, file: !1181, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1180, file: !1181, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1180, file: !1181, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1180, file: !1181, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1175, file: !151, line: 3254, baseType: !934, size: 64, offset: 1536)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1175, file: !151, line: 3257, baseType: !934, size: 64, offset: 1600)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1175, file: !151, line: 3258, baseType: !934, size: 64, offset: 1664)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1175, file: !151, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1175, file: !151, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1175, file: !151, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1175, file: !151, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1175, file: !151, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1175, file: !151, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1175, file: !151, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1175, file: !151, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1175, file: !151, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1175, file: !151, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1175, file: !151, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1175, file: !151, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1175, file: !151, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1175, file: !151, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1175, file: !151, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1175, file: !151, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1175, file: !151, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1175, file: !151, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !936, file: !151, line: 3394, baseType: !1424, size: 1344)
!1424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !151, line: 2279, size: 1344, elements: !1425)
!1425 = !{!1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1451, !1452, !1453, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469}
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1424, file: !151, line: 2280, baseType: !972, size: 192)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1424, file: !151, line: 2281, baseType: !934, size: 64, offset: 192)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1424, file: !151, line: 2282, baseType: !934, size: 64, offset: 256)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1424, file: !151, line: 2283, baseType: !934, size: 64, offset: 320)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1424, file: !151, line: 2284, baseType: !934, size: 64, offset: 384)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1424, file: !151, line: 2285, baseType: !7, size: 32, offset: 448)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1424, file: !151, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1424, file: !151, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1424, file: !151, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1424, file: !151, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1424, file: !151, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1424, file: !151, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1424, file: !151, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1424, file: !151, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1424, file: !151, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1424, file: !151, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1424, file: !151, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1424, file: !151, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1424, file: !151, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1424, file: !151, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1424, file: !151, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1424, file: !151, line: 2305, baseType: !7, size: 32, offset: 512)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1424, file: !151, line: 2306, baseType: !1449, size: 32, offset: 544)
!1449 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1450, line: 31, baseType: !760)
!1450 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1424, file: !151, line: 2307, baseType: !934, size: 64, offset: 576)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1424, file: !151, line: 2308, baseType: !934, size: 64, offset: 640)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1424, file: !151, line: 2314, baseType: !1454, size: 64, offset: 704)
!1454 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !151, line: 2309, size: 64, elements: !1455)
!1455 = !{!1456, !1457, !1458}
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1454, file: !151, line: 2310, baseType: !760, size: 32)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1454, file: !151, line: 2311, baseType: !765, size: 64)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1454, file: !151, line: 2312, baseType: !1459, size: 64)
!1459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1460, size: 64)
!1460 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !151, line: 2277, flags: DIFlagFwdDecl)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1424, file: !151, line: 2315, baseType: !934, size: 64, offset: 768)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1424, file: !151, line: 2316, baseType: !934, size: 64, offset: 832)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1424, file: !151, line: 2317, baseType: !934, size: 64, offset: 896)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1424, file: !151, line: 2318, baseType: !934, size: 64, offset: 960)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1424, file: !151, line: 2319, baseType: !934, size: 64, offset: 1024)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1424, file: !151, line: 2320, baseType: !934, size: 64, offset: 1088)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1424, file: !151, line: 2321, baseType: !934, size: 64, offset: 1152)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1424, file: !151, line: 2322, baseType: !934, size: 64, offset: 1216)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1424, file: !151, line: 2324, baseType: !1470, size: 64, offset: 1280)
!1470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1471, size: 64)
!1471 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !151, line: 2324, flags: DIFlagFwdDecl)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !936, file: !151, line: 3395, baseType: !1473, size: 320)
!1473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !151, line: 1469, size: 320, elements: !1474)
!1474 = !{!1475, !1476, !1477}
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1473, file: !151, line: 1470, baseType: !972, size: 192)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1473, file: !151, line: 1471, baseType: !934, size: 64, offset: 192)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1473, file: !151, line: 1472, baseType: !934, size: 64, offset: 256)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !936, file: !151, line: 3396, baseType: !1479, size: 320)
!1479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !151, line: 1482, size: 320, elements: !1480)
!1480 = !{!1481, !1482, !1483}
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1479, file: !151, line: 1483, baseType: !972, size: 192)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1479, file: !151, line: 1484, baseType: !760, size: 32, offset: 192)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1479, file: !151, line: 1485, baseType: !1484, size: 64, offset: 256)
!1484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !934, size: 64, elements: !914)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !936, file: !151, line: 3397, baseType: !1486, size: 384)
!1486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !151, line: 1829, size: 384, elements: !1487)
!1487 = !{!1488, !1489, !1490, !1491}
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1486, file: !151, line: 1830, baseType: !972, size: 192)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1486, file: !151, line: 1831, baseType: !1054, size: 32, offset: 192)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1486, file: !151, line: 1832, baseType: !934, size: 64, offset: 256)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1486, file: !151, line: 1835, baseType: !1484, size: 64, offset: 320)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !936, file: !151, line: 3398, baseType: !1493, size: 704)
!1493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !151, line: 1898, size: 704, elements: !1494)
!1494 = !{!1495, !1496, !1497, !1501, !1502, !1505}
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1493, file: !151, line: 1899, baseType: !972, size: 192)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1493, file: !151, line: 1902, baseType: !934, size: 64, offset: 192)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1493, file: !151, line: 1905, baseType: !1498, size: 64, offset: 256)
!1498 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !880, line: 58, baseType: !1499)
!1499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1500, size: 64)
!1500 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !880, line: 57, flags: DIFlagFwdDecl)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1493, file: !151, line: 1908, baseType: !7, size: 32, offset: 320)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1493, file: !151, line: 1911, baseType: !1503, size: 64, offset: 384)
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1504, size: 64)
!1504 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !151, line: 1876, flags: DIFlagFwdDecl)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1493, file: !151, line: 1914, baseType: !1506, size: 256, offset: 448)
!1506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !151, line: 1883, size: 256, elements: !1507)
