; ModuleID = 'dfp.bc'
source_filename = "dfp.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.real_format = type { {}*, void (%struct.real_format*, %struct.real_value*, i64*)*, i32, i32, i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.real_value = type { i32, [3 x i64] }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.stat64 = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.decNumber = type { i32, i32, i8, [12 x i16] }
%struct.decContext = type { i32, i32, i32, i32, i32, i32, i8 }
%struct.decimal128 = type { [16 x i8] }
%struct.decimal32 = type { [4 x i8] }
%struct.decimal64 = type { [8 x i8] }

@stdout = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@stdin = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8

!321 = !DIEnumerator(name: "TARGET_MEM_REF", value: 152, isUnsigned: true)
!322 = !DIEnumerator(name: "OMP_PARALLEL", value: 153, isUnsigned: true)
!323 = !DIEnumerator(name: "OMP_TASK", value: 154, isUnsigned: true)
!324 = !DIEnumerator(name: "OMP_FOR", value: 155, isUnsigned: true)
!325 = !DIEnumerator(name: "OMP_SECTIONS", value: 156, isUnsigned: true)
!326 = !DIEnumerator(name: "OMP_SINGLE", value: 157, isUnsigned: true)
!327 = !DIEnumerator(name: "OMP_SECTION", value: 158, isUnsigned: true)
!328 = !DIEnumerator(name: "OMP_MASTER", value: 159, isUnsigned: true)
!329 = !DIEnumerator(name: "OMP_ORDERED", value: 160, isUnsigned: true)
!330 = !DIEnumerator(name: "OMP_CRITICAL", value: 161, isUnsigned: true)
!331 = !DIEnumerator(name: "OMP_ATOMIC", value: 162, isUnsigned: true)
!332 = !DIEnumerator(name: "OMP_CLAUSE", value: 163, isUnsigned: true)
!333 = !DIEnumerator(name: "REDUC_MAX_EXPR", value: 164, isUnsigned: true)
!334 = !DIEnumerator(name: "REDUC_MIN_EXPR", value: 165, isUnsigned: true)
!335 = !DIEnumerator(name: "REDUC_PLUS_EXPR", value: 166, isUnsigned: true)
!336 = !DIEnumerator(name: "DOT_PROD_EXPR", value: 167, isUnsigned: true)
!337 = !DIEnumerator(name: "WIDEN_SUM_EXPR", value: 168, isUnsigned: true)
!338 = !DIEnumerator(name: "WIDEN_MULT_EXPR", value: 169, isUnsigned: true)
!339 = !DIEnumerator(name: "VEC_LSHIFT_EXPR", value: 170, isUnsigned: true)
!340 = !DIEnumerator(name: "VEC_RSHIFT_EXPR", value: 171, isUnsigned: true)
!341 = !DIEnumerator(name: "VEC_WIDEN_MULT_HI_EXPR", value: 172, isUnsigned: true)
!342 = !DIEnumerator(name: "VEC_WIDEN_MULT_LO_EXPR", value: 173, isUnsigned: true)
!343 = !DIEnumerator(name: "VEC_UNPACK_HI_EXPR", value: 174, isUnsigned: true)
!344 = !DIEnumerator(name: "VEC_UNPACK_LO_EXPR", value: 175, isUnsigned: true)
!345 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_HI_EXPR", value: 176, isUnsigned: true)
!346 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_LO_EXPR", value: 177, isUnsigned: true)
!347 = !DIEnumerator(name: "VEC_PACK_TRUNC_EXPR", value: 178, isUnsigned: true)
!348 = !DIEnumerator(name: "VEC_PACK_SAT_EXPR", value: 179, isUnsigned: true)
!349 = !DIEnumerator(name: "VEC_PACK_FIX_TRUNC_EXPR", value: 180, isUnsigned: true)
!350 = !DIEnumerator(name: "VEC_EXTRACT_EVEN_EXPR", value: 181, isUnsigned: true)
!351 = !DIEnumerator(name: "VEC_EXTRACT_ODD_EXPR", value: 182, isUnsigned: true)
!352 = !DIEnumerator(name: "VEC_INTERLEAVE_HIGH_EXPR", value: 183, isUnsigned: true)
!353 = !DIEnumerator(name: "VEC_INTERLEAVE_LOW_EXPR", value: 184, isUnsigned: true)
!354 = !DIEnumerator(name: "PREDICT_EXPR", value: 185, isUnsigned: true)
!355 = !DIEnumerator(name: "OPTIMIZATION_NODE", value: 186, isUnsigned: true)
!356 = !DIEnumerator(name: "TARGET_OPTION_NODE", value: 187, isUnsigned: true)
!357 = !DIEnumerator(name: "LAST_AND_UNUSED_TREE_CODE", value: 188, isUnsigned: true)
!358 = !DIEnumerator(name: "C_MAYBE_CONST_EXPR", value: 189, isUnsigned: true)
!359 = !DIEnumerator(name: "EXCESS_PRECISION_EXPR", value: 190, isUnsigned: true)
!360 = !DIEnumerator(name: "MAX_TREE_CODES", value: 191, isUnsigned: true)
!361 = !{!362, !363, !364, !365, !368, !369, !371, !385, !144, !5}
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!364 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !367)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !373)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "decimal128", file: !374, line: 64, baseType: !375)
!374 = !DIFile(filename: "./decimal128.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !374, line: 62, size: 128, elements: !376)
!376 = !{!377}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !375, file: !374, line: 63, baseType: !378, size: 128)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !379, size: 128, elements: !383)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !380, line: 24, baseType: !381)
!380 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !382, line: 38, baseType: !363)
!382 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!383 = !{!384}
!384 = !DISubrange(count: 16)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!386 = !{i32 2, !"Dwarf Version", i32 4}
!387 = !{i32 2, !"Debug Info Version", i32 3}
!388 = !{i32 1, !"wchar_size", i32 4}
!389 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!390 = distinct !DISubprogram(name: "vprintf", scope: !391, file: !391, line: 39, type: !392, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !402)
!391 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!392 = !DISubroutineType(types: !393)
!393 = !{!364, !394, !395}
!394 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !369)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, elements: !397)
!397 = !{!398, !399, !400, !401}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !396, file: !1, baseType: !5, size: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !396, file: !1, baseType: !5, size: 32, offset: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !396, file: !1, baseType: !368, size: 64, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !396, file: !1, baseType: !368, size: 64, offset: 128)
!402 = !{!403, !404}
!403 = !DILocalVariable(name: "__fmt", arg: 1, scope: !390, file: !391, line: 39, type: !394)
!404 = !DILocalVariable(name: "__arg", arg: 2, scope: !390, file: !391, line: 39, type: !395)
!405 = !DILocation(line: 0, scope: !390)
!406 = !DILocation(line: 41, column: 20, scope: !390)
!407 = !DILocation(line: 41, column: 10, scope: !390)
!408 = !DILocation(line: 41, column: 3, scope: !390)
!409 = distinct !DISubprogram(name: "getchar", scope: !391, file: !391, line: 47, type: !410, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !412)
!410 = !DISubroutineType(types: !411)
!411 = !{!364}
!412 = !{}
!413 = !DILocation(line: 49, column: 16, scope: !409)
!414 = !DILocation(line: 49, column: 10, scope: !409)
!415 = !DILocation(line: 49, column: 3, scope: !409)
!416 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !391, file: !391, line: 56, type: !417, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !477)
!417 = !DISubroutineType(types: !418)
!418 = !{!364, !419}
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !421, line: 7, baseType: !422)
!421 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !423, line: 49, size: 1728, elements: !424)
!423 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!424 = !{!425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !440, !442, !443, !444, !447, !449, !451, !455, !458, !460, !463, !466, !467, !468, !472, !473}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !422, file: !423, line: 51, baseType: !364, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !422, file: !423, line: 54, baseType: !366, size: 64, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !422, file: !423, line: 55, baseType: !366, size: 64, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !422, file: !423, line: 56, baseType: !366, size: 64, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !422, file: !423, line: 57, baseType: !366, size: 64, offset: 256)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !422, file: !423, line: 58, baseType: !366, size: 64, offset: 320)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !422, file: !423, line: 59, baseType: !366, size: 64, offset: 384)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !422, file: !423, line: 60, baseType: !366, size: 64, offset: 448)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !422, file: !423, line: 61, baseType: !366, size: 64, offset: 512)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !422, file: !423, line: 64, baseType: !366, size: 64, offset: 576)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !422, file: !423, line: 65, baseType: !366, size: 64, offset: 640)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !422, file: !423, line: 66, baseType: !366, size: 64, offset: 704)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !422, file: !423, line: 68, baseType: !438, size: 64, offset: 768)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !423, line: 36, flags: DIFlagFwdDecl)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !422, file: !423, line: 70, baseType: !441, size: 64, offset: 832)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !422, file: !423, line: 72, baseType: !364, size: 32, offset: 896)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !422, file: !423, line: 73, baseType: !364, size: 32, offset: 928)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !422, file: !423, line: 74, baseType: !445, size: 64, offset: 960)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !382, line: 152, baseType: !446)
!446 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !422, file: !423, line: 77, baseType: !448, size: 16, offset: 1024)
!448 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !422, file: !423, line: 78, baseType: !450, size: 8, offset: 1040)
!450 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !422, file: !423, line: 79, baseType: !452, size: 8, offset: 1048)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 8, elements: !453)
!453 = !{!454}
!454 = !DISubrange(count: 1)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !422, file: !423, line: 81, baseType: !456, size: 64, offset: 1088)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !423, line: 43, baseType: null)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !422, file: !423, line: 89, baseType: !459, size: 64, offset: 1152)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !382, line: 153, baseType: !446)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !422, file: !423, line: 91, baseType: !461, size: 64, offset: 1216)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !423, line: 37, flags: DIFlagFwdDecl)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !422, file: !423, line: 92, baseType: !464, size: 64, offset: 1280)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !423, line: 38, flags: DIFlagFwdDecl)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !422, file: !423, line: 93, baseType: !441, size: 64, offset: 1344)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !422, file: !423, line: 94, baseType: !368, size: 64, offset: 1408)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !422, file: !423, line: 95, baseType: !469, size: 64, offset: 1472)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !470, line: 46, baseType: !471)
!470 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!471 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !422, file: !423, line: 96, baseType: !364, size: 32, offset: 1536)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !422, file: !423, line: 98, baseType: !474, size: 160, offset: 1568)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 160, elements: !475)
!475 = !{!476}
!476 = !DISubrange(count: 20)
!477 = !{!478}
!478 = !DILocalVariable(name: "__fp", arg: 1, scope: !416, file: !391, line: 56, type: !419)
!479 = !DILocation(line: 0, scope: !416)
!480 = !DILocation(line: 58, column: 10, scope: !416)
!481 = !DILocation(line: 58, column: 3, scope: !416)
!482 = distinct !DISubprogram(name: "getc_unlocked", scope: !391, file: !391, line: 66, type: !417, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !483)
!483 = !{!484}
!484 = !DILocalVariable(name: "__fp", arg: 1, scope: !482, file: !391, line: 66, type: !419)
!485 = !DILocation(line: 0, scope: !482)
!486 = !DILocation(line: 68, column: 10, scope: !482)
!487 = !DILocation(line: 68, column: 3, scope: !482)
!488 = distinct !DISubprogram(name: "getchar_unlocked", scope: !391, file: !391, line: 73, type: !410, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !412)
!489 = !DILocation(line: 75, column: 10, scope: !488)
!490 = !DILocation(line: 75, column: 3, scope: !488)
!491 = distinct !DISubprogram(name: "putchar", scope: !391, file: !391, line: 82, type: !492, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !494)
!492 = !DISubroutineType(types: !493)
!493 = !{!364, !364}
!494 = !{!495}
!495 = !DILocalVariable(name: "__c", arg: 1, scope: !491, file: !391, line: 82, type: !364)
!496 = !DILocation(line: 0, scope: !491)
!497 = !DILocation(line: 84, column: 21, scope: !491)
!498 = !DILocation(line: 84, column: 10, scope: !491)
!499 = !DILocation(line: 84, column: 3, scope: !491)
!500 = distinct !DISubprogram(name: "fputc_unlocked", scope: !391, file: !391, line: 91, type: !501, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !503)
!501 = !DISubroutineType(types: !502)
!502 = !{!364, !364, !419}
!503 = !{!504, !505}
!504 = !DILocalVariable(name: "__c", arg: 1, scope: !500, file: !391, line: 91, type: !364)
!505 = !DILocalVariable(name: "__stream", arg: 2, scope: !500, file: !391, line: 91, type: !419)
!506 = !DILocation(line: 0, scope: !500)
!507 = !DILocation(line: 93, column: 10, scope: !500)
!508 = !DILocation(line: 93, column: 3, scope: !500)
!509 = distinct !DISubprogram(name: "putc_unlocked", scope: !391, file: !391, line: 101, type: !501, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !510)
!510 = !{!511, !512}
!511 = !DILocalVariable(name: "__c", arg: 1, scope: !509, file: !391, line: 101, type: !364)
!512 = !DILocalVariable(name: "__stream", arg: 2, scope: !509, file: !391, line: 101, type: !419)
!513 = !DILocation(line: 0, scope: !509)
!514 = !DILocation(line: 103, column: 10, scope: !509)
!515 = !DILocation(line: 103, column: 3, scope: !509)
!516 = distinct !DISubprogram(name: "putchar_unlocked", scope: !391, file: !391, line: 108, type: !492, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !517)
!517 = !{!518}
!518 = !DILocalVariable(name: "__c", arg: 1, scope: !516, file: !391, line: 108, type: !364)
!519 = !DILocation(line: 0, scope: !516)
!520 = !DILocation(line: 110, column: 10, scope: !516)
!521 = !DILocation(line: 110, column: 3, scope: !516)
!522 = distinct !DISubprogram(name: "getline", scope: !391, file: !391, line: 118, type: !523, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !527)
!523 = !DISubroutineType(types: !524)
!524 = !{!525, !365, !526, !419}
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !382, line: 193, baseType: !446)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!527 = !{!528, !529, !530}
!528 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !522, file: !391, line: 118, type: !365)
!529 = !DILocalVariable(name: "__n", arg: 2, scope: !522, file: !391, line: 118, type: !526)
!530 = !DILocalVariable(name: "__stream", arg: 3, scope: !522, file: !391, line: 118, type: !419)
!531 = !DILocation(line: 0, scope: !522)
!532 = !DILocation(line: 120, column: 10, scope: !522)
!533 = !DILocation(line: 120, column: 3, scope: !522)
!534 = distinct !DISubprogram(name: "feof_unlocked", scope: !391, file: !391, line: 128, type: !417, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !535)
!535 = !{!536}
!536 = !DILocalVariable(name: "__stream", arg: 1, scope: !534, file: !391, line: 128, type: !419)
!537 = !DILocation(line: 0, scope: !534)
!538 = !DILocation(line: 130, column: 10, scope: !534)
!539 = !DILocation(line: 130, column: 3, scope: !534)
!540 = distinct !DISubprogram(name: "ferror_unlocked", scope: !391, file: !391, line: 135, type: !417, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !541)
!541 = !{!542}
!542 = !DILocalVariable(name: "__stream", arg: 1, scope: !540, file: !391, line: 135, type: !419)
!543 = !DILocation(line: 0, scope: !540)
!544 = !DILocation(line: 137, column: 10, scope: !540)
!545 = !DILocation(line: 137, column: 3, scope: !540)
!546 = distinct !DISubprogram(name: "tolower", scope: !547, file: !547, line: 207, type: !492, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !548)
!547 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!548 = !{!549}
!549 = !DILocalVariable(name: "__c", arg: 1, scope: !546, file: !547, line: 207, type: !364)
!550 = !DILocation(line: 0, scope: !546)
!551 = !DILocation(line: 209, column: 22, scope: !546)
!552 = !DILocation(line: 209, column: 39, scope: !546)
!553 = !DILocation(line: 209, column: 38, scope: !546)
!554 = !DILocation(line: 209, column: 37, scope: !546)
!555 = !DILocation(line: 209, column: 10, scope: !546)
!556 = !DILocation(line: 209, column: 3, scope: !546)
!557 = distinct !DISubprogram(name: "toupper", scope: !547, file: !547, line: 213, type: !492, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !558)
!558 = !{!559}
!559 = !DILocalVariable(name: "__c", arg: 1, scope: !557, file: !547, line: 213, type: !364)
!560 = !DILocation(line: 0, scope: !557)
!561 = !DILocation(line: 215, column: 22, scope: !557)
!562 = !DILocation(line: 215, column: 39, scope: !557)
!563 = !DILocation(line: 215, column: 38, scope: !557)
!564 = !DILocation(line: 215, column: 37, scope: !557)
!565 = !DILocation(line: 215, column: 10, scope: !557)
!566 = !DILocation(line: 215, column: 3, scope: !557)
!567 = distinct !DISubprogram(name: "atoi", scope: !568, file: !568, line: 361, type: !569, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !571)
!568 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!569 = !DISubroutineType(types: !570)
!570 = !{!364, !369}
!571 = !{!572}
!572 = !DILocalVariable(name: "__nptr", arg: 1, scope: !567, file: !568, line: 361, type: !369)
!573 = !DILocation(line: 0, scope: !567)
!574 = !DILocation(line: 363, column: 16, scope: !567)
!575 = !DILocation(line: 363, column: 10, scope: !567)
!576 = !DILocation(line: 363, column: 3, scope: !567)
!577 = distinct !DISubprogram(name: "atol", scope: !568, file: !568, line: 366, type: !578, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !580)
!578 = !DISubroutineType(types: !579)
!579 = !{!446, !369}
!580 = !{!581}
!581 = !DILocalVariable(name: "__nptr", arg: 1, scope: !577, file: !568, line: 366, type: !369)
!582 = !DILocation(line: 0, scope: !577)
!583 = !DILocation(line: 368, column: 10, scope: !577)
!584 = !DILocation(line: 368, column: 3, scope: !577)
!585 = distinct !DISubprogram(name: "atoll", scope: !568, file: !568, line: 373, type: !586, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !589)
!586 = !DISubroutineType(types: !587)
!587 = !{!588, !369}
!588 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!589 = !{!590}
!590 = !DILocalVariable(name: "__nptr", arg: 1, scope: !585, file: !568, line: 373, type: !369)
!591 = !DILocation(line: 0, scope: !585)
!592 = !DILocation(line: 375, column: 10, scope: !585)
!593 = !DILocation(line: 375, column: 3, scope: !585)
!594 = distinct !DISubprogram(name: "bsearch", scope: !595, file: !595, line: 20, type: !596, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !604)
!595 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!596 = !DISubroutineType(types: !597)
!597 = !{!368, !598, !598, !469, !469, !600}
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !568, line: 808, baseType: !601)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{!364, !598, !598}
!604 = !{!605, !606, !607, !608, !609, !610, !611, !612, !613, !614}
!605 = !DILocalVariable(name: "__key", arg: 1, scope: !594, file: !595, line: 20, type: !598)
!606 = !DILocalVariable(name: "__base", arg: 2, scope: !594, file: !595, line: 20, type: !598)
!607 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !594, file: !595, line: 20, type: !469)
!608 = !DILocalVariable(name: "__size", arg: 4, scope: !594, file: !595, line: 20, type: !469)
!609 = !DILocalVariable(name: "__compar", arg: 5, scope: !594, file: !595, line: 21, type: !600)
!610 = !DILocalVariable(name: "__l", scope: !594, file: !595, line: 23, type: !469)
!611 = !DILocalVariable(name: "__u", scope: !594, file: !595, line: 23, type: !469)
!612 = !DILocalVariable(name: "__idx", scope: !594, file: !595, line: 23, type: !469)
!613 = !DILocalVariable(name: "__p", scope: !594, file: !595, line: 24, type: !598)
!614 = !DILocalVariable(name: "__comparison", scope: !594, file: !595, line: 25, type: !364)
!615 = !DILocation(line: 0, scope: !594)
!616 = !DILocation(line: 29, column: 3, scope: !594)
!617 = !DILocation(line: 27, column: 7, scope: !594)
!618 = !DILocation(line: 29, column: 14, scope: !594)
!619 = !DILocation(line: 31, column: 20, scope: !620)
!620 = distinct !DILexicalBlock(scope: !594, file: !595, line: 30, column: 5)
!621 = !DILocation(line: 31, column: 27, scope: !620)
!622 = !DILocation(line: 32, column: 56, scope: !620)
!623 = !DILocation(line: 32, column: 47, scope: !620)
!624 = !DILocation(line: 33, column: 22, scope: !620)
!625 = !DILocation(line: 34, column: 24, scope: !626)
!626 = distinct !DILexicalBlock(scope: !620, file: !595, line: 34, column: 11)
!627 = !DILocation(line: 34, column: 11, scope: !620)
!628 = !DILocation(line: 36, column: 29, scope: !629)
!629 = distinct !DILexicalBlock(scope: !626, file: !595, line: 36, column: 16)
!630 = !DILocation(line: 36, column: 16, scope: !626)
!631 = !DILocation(line: 37, column: 14, scope: !629)
!632 = distinct !{!632, !616, !633}
!633 = !DILocation(line: 40, column: 5, scope: !594)
!634 = !DILocation(line: 43, column: 1, scope: !594)
!635 = distinct !DISubprogram(name: "atof", scope: !636, file: !636, line: 25, type: !637, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !640)
!636 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!637 = !DISubroutineType(types: !638)
!638 = !{!639, !369}
!639 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!640 = !{!641}
!641 = !DILocalVariable(name: "__nptr", arg: 1, scope: !635, file: !636, line: 25, type: !369)
!642 = !DILocation(line: 0, scope: !635)
!643 = !DILocation(line: 27, column: 10, scope: !635)
!644 = !DILocation(line: 27, column: 3, scope: !635)
!645 = distinct !DISubprogram(name: "strtoimax", scope: !646, file: !646, line: 324, type: !647, scopeLine: 326, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !653)
!646 = !DIFile(filename: "/usr/include/inttypes.h", directory: "")
!647 = !DISubroutineType(types: !648)
!648 = !{!649, !394, !652, !364}
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !650, line: 101, baseType: !651)
!650 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !382, line: 72, baseType: !446)
!652 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !365)
!653 = !{!654, !655, !656}
!654 = !DILocalVariable(name: "nptr", arg: 1, scope: !645, file: !646, line: 324, type: !394)
!655 = !DILocalVariable(name: "endptr", arg: 2, scope: !645, file: !646, line: 324, type: !652)
!656 = !DILocalVariable(name: "base", arg: 3, scope: !645, file: !646, line: 324, type: !364)
!657 = !DILocation(line: 0, scope: !645)
!658 = !DILocation(line: 327, column: 10, scope: !645)
!659 = !DILocation(line: 327, column: 3, scope: !645)
!660 = distinct !DISubprogram(name: "strtoumax", scope: !646, file: !646, line: 336, type: !661, scopeLine: 338, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !665)
!661 = !DISubroutineType(types: !662)
!662 = !{!663, !394, !652, !364}
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !650, line: 102, baseType: !664)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !382, line: 73, baseType: !471)
!665 = !{!666, !667, !668}
!666 = !DILocalVariable(name: "nptr", arg: 1, scope: !660, file: !646, line: 336, type: !394)
!667 = !DILocalVariable(name: "endptr", arg: 2, scope: !660, file: !646, line: 336, type: !652)
!668 = !DILocalVariable(name: "base", arg: 3, scope: !660, file: !646, line: 336, type: !364)
!669 = !DILocation(line: 0, scope: !660)
!670 = !DILocation(line: 339, column: 10, scope: !660)
!671 = !DILocation(line: 339, column: 3, scope: !660)
!672 = distinct !DISubprogram(name: "wcstoimax", scope: !646, file: !646, line: 348, type: !673, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !682)
!673 = !DISubroutineType(types: !674)
!674 = !{!649, !675, !679, !364}
!675 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !676)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !678)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gwchar_t", file: !646, line: 34, baseType: !364)
!679 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !680)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!682 = !{!683, !684, !685}
!683 = !DILocalVariable(name: "nptr", arg: 1, scope: !672, file: !646, line: 348, type: !675)
!684 = !DILocalVariable(name: "endptr", arg: 2, scope: !672, file: !646, line: 348, type: !679)
!685 = !DILocalVariable(name: "base", arg: 3, scope: !672, file: !646, line: 348, type: !364)
!686 = !DILocation(line: 0, scope: !672)
!687 = !DILocation(line: 351, column: 10, scope: !672)
!688 = !DILocation(line: 351, column: 3, scope: !672)
!689 = distinct !DISubprogram(name: "wcstoumax", scope: !646, file: !646, line: 362, type: !690, scopeLine: 364, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !692)
!690 = !DISubroutineType(types: !691)
!691 = !{!663, !675, !679, !364}
!692 = !{!693, !694, !695}
!693 = !DILocalVariable(name: "nptr", arg: 1, scope: !689, file: !646, line: 362, type: !675)
!694 = !DILocalVariable(name: "endptr", arg: 2, scope: !689, file: !646, line: 362, type: !679)
!695 = !DILocalVariable(name: "base", arg: 3, scope: !689, file: !646, line: 362, type: !364)
!696 = !DILocation(line: 0, scope: !689)
!697 = !DILocation(line: 365, column: 10, scope: !689)
!698 = !DILocation(line: 365, column: 3, scope: !689)
!699 = distinct !DISubprogram(name: "stat", scope: !700, file: !700, line: 453, type: !701, scopeLine: 454, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !740)
!700 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "")
!701 = !DISubroutineType(types: !702)
!702 = !{!364, !369, !703}
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !705, line: 46, size: 1152, elements: !706)
!705 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!706 = !{!707, !709, !711, !713, !715, !717, !719, !720, !721, !722, !724, !726, !734, !735, !736}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !704, file: !705, line: 48, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !382, line: 145, baseType: !471)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !704, file: !705, line: 53, baseType: !710, size: 64, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !382, line: 148, baseType: !471)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !704, file: !705, line: 61, baseType: !712, size: 64, offset: 128)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !382, line: 151, baseType: !471)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !704, file: !705, line: 62, baseType: !714, size: 32, offset: 192)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !382, line: 150, baseType: !5)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !704, file: !705, line: 64, baseType: !716, size: 32, offset: 224)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !382, line: 146, baseType: !5)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !704, file: !705, line: 65, baseType: !718, size: 32, offset: 256)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !382, line: 147, baseType: !5)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !704, file: !705, line: 67, baseType: !364, size: 32, offset: 288)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !704, file: !705, line: 69, baseType: !708, size: 64, offset: 320)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !704, file: !705, line: 74, baseType: !445, size: 64, offset: 384)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !704, file: !705, line: 78, baseType: !723, size: 64, offset: 448)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !382, line: 174, baseType: !446)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !704, file: !705, line: 80, baseType: !725, size: 64, offset: 512)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !382, line: 179, baseType: !446)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !704, file: !705, line: 91, baseType: !727, size: 128, offset: 576)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !728, line: 10, size: 128, elements: !729)
!728 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!729 = !{!730, !732}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !727, file: !728, line: 12, baseType: !731, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !382, line: 160, baseType: !446)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !727, file: !728, line: 16, baseType: !733, size: 64, offset: 64)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !382, line: 196, baseType: !446)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !704, file: !705, line: 92, baseType: !727, size: 128, offset: 704)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !704, file: !705, line: 93, baseType: !727, size: 128, offset: 832)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !704, file: !705, line: 106, baseType: !737, size: 192, offset: 960)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !733, size: 192, elements: !738)
!738 = !{!739}
!739 = !DISubrange(count: 3)
!740 = !{!741, !742}
!741 = !DILocalVariable(name: "__path", arg: 1, scope: !699, file: !700, line: 453, type: !369)
!742 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !699, file: !700, line: 453, type: !703)
!743 = !DILocation(line: 0, scope: !699)
!744 = !DILocation(line: 455, column: 10, scope: !699)
!745 = !DILocation(line: 455, column: 3, scope: !699)
!746 = distinct !DISubprogram(name: "lstat", scope: !700, file: !700, line: 460, type: !701, scopeLine: 461, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !747)
!747 = !{!748, !749}
!748 = !DILocalVariable(name: "__path", arg: 1, scope: !746, file: !700, line: 460, type: !369)
!749 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !746, file: !700, line: 460, type: !703)
!750 = !DILocation(line: 0, scope: !746)
!751 = !DILocation(line: 462, column: 10, scope: !746)
!752 = !DILocation(line: 462, column: 3, scope: !746)
!753 = distinct !DISubprogram(name: "fstat", scope: !700, file: !700, line: 467, type: !754, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !756)
!754 = !DISubroutineType(types: !755)
!755 = !{!364, !364, !703}
!756 = !{!757, !758}
!757 = !DILocalVariable(name: "__fd", arg: 1, scope: !753, file: !700, line: 467, type: !364)
!758 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !753, file: !700, line: 467, type: !703)
!759 = !DILocation(line: 0, scope: !753)
!760 = !DILocation(line: 469, column: 10, scope: !753)
!761 = !DILocation(line: 469, column: 3, scope: !753)
!762 = distinct !DISubprogram(name: "fstatat", scope: !700, file: !700, line: 474, type: !763, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !765)
!763 = !DISubroutineType(types: !764)
!764 = !{!364, !364, !369, !703, !364}
!765 = !{!766, !767, !768, !769}
!766 = !DILocalVariable(name: "__fd", arg: 1, scope: !762, file: !700, line: 474, type: !364)
!767 = !DILocalVariable(name: "__filename", arg: 2, scope: !762, file: !700, line: 474, type: !369)
!768 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !762, file: !700, line: 474, type: !703)
!769 = !DILocalVariable(name: "__flag", arg: 4, scope: !762, file: !700, line: 474, type: !364)
!770 = !DILocation(line: 0, scope: !762)
!771 = !DILocation(line: 477, column: 10, scope: !762)
!772 = !DILocation(line: 477, column: 3, scope: !762)
!773 = distinct !DISubprogram(name: "mknod", scope: !700, file: !700, line: 483, type: !774, scopeLine: 484, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !776)
!774 = !DISubroutineType(types: !775)
!775 = !{!364, !369, !714, !708}
!776 = !{!777, !778, !779}
!777 = !DILocalVariable(name: "__path", arg: 1, scope: !773, file: !700, line: 483, type: !369)
!778 = !DILocalVariable(name: "__mode", arg: 2, scope: !773, file: !700, line: 483, type: !714)
!779 = !DILocalVariable(name: "__dev", arg: 3, scope: !773, file: !700, line: 483, type: !708)
!780 = !DILocation(line: 0, scope: !773)
!781 = !DILocation(line: 485, column: 10, scope: !773)
!782 = !DILocation(line: 485, column: 3, scope: !773)
!783 = distinct !DISubprogram(name: "mknodat", scope: !700, file: !700, line: 491, type: !784, scopeLine: 493, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !786)
!784 = !DISubroutineType(types: !785)
!785 = !{!364, !364, !369, !714, !708}
!786 = !{!787, !788, !789, !790}
!787 = !DILocalVariable(name: "__fd", arg: 1, scope: !783, file: !700, line: 491, type: !364)
!788 = !DILocalVariable(name: "__path", arg: 2, scope: !783, file: !700, line: 491, type: !369)
!789 = !DILocalVariable(name: "__mode", arg: 3, scope: !783, file: !700, line: 491, type: !714)
!790 = !DILocalVariable(name: "__dev", arg: 4, scope: !783, file: !700, line: 491, type: !708)
!791 = !DILocation(line: 0, scope: !783)
!792 = !DILocation(line: 494, column: 10, scope: !783)
!793 = !DILocation(line: 494, column: 3, scope: !783)
!794 = distinct !DISubprogram(name: "stat64", scope: !700, file: !700, line: 502, type: !795, scopeLine: 503, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !817)
!795 = !DISubroutineType(types: !796)
!796 = !{!364, !369, !797}
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !705, line: 119, size: 1152, elements: !799)
!799 = !{!800, !801, !803, !804, !805, !806, !807, !808, !809, !810, !811, !813, !814, !815, !816}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !798, file: !705, line: 121, baseType: !708, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !798, file: !705, line: 123, baseType: !802, size: 64, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !382, line: 149, baseType: !471)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !798, file: !705, line: 124, baseType: !712, size: 64, offset: 128)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !798, file: !705, line: 125, baseType: !714, size: 32, offset: 192)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !798, file: !705, line: 132, baseType: !716, size: 32, offset: 224)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !798, file: !705, line: 133, baseType: !718, size: 32, offset: 256)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !798, file: !705, line: 135, baseType: !364, size: 32, offset: 288)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !798, file: !705, line: 136, baseType: !708, size: 64, offset: 320)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !798, file: !705, line: 137, baseType: !445, size: 64, offset: 384)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !798, file: !705, line: 143, baseType: !723, size: 64, offset: 448)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !798, file: !705, line: 144, baseType: !812, size: 64, offset: 512)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !382, line: 180, baseType: !446)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !798, file: !705, line: 152, baseType: !727, size: 128, offset: 576)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !798, file: !705, line: 153, baseType: !727, size: 128, offset: 704)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !798, file: !705, line: 154, baseType: !727, size: 128, offset: 832)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !798, file: !705, line: 164, baseType: !737, size: 192, offset: 960)
!817 = !{!818, !819}
!818 = !DILocalVariable(name: "__path", arg: 1, scope: !794, file: !700, line: 502, type: !369)
!819 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !794, file: !700, line: 502, type: !797)
!820 = !DILocation(line: 0, scope: !794)
!821 = !DILocation(line: 504, column: 10, scope: !794)
!822 = !DILocation(line: 504, column: 3, scope: !794)
!823 = distinct !DISubprogram(name: "lstat64", scope: !700, file: !700, line: 509, type: !795, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !824)
!824 = !{!825, !826}
!825 = !DILocalVariable(name: "__path", arg: 1, scope: !823, file: !700, line: 509, type: !369)
!826 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !823, file: !700, line: 509, type: !797)
!827 = !DILocation(line: 0, scope: !823)
!828 = !DILocation(line: 511, column: 10, scope: !823)
!829 = !DILocation(line: 511, column: 3, scope: !823)
!830 = distinct !DISubprogram(name: "fstat64", scope: !700, file: !700, line: 516, type: !831, scopeLine: 517, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !833)
!831 = !DISubroutineType(types: !832)
!832 = !{!364, !364, !797}
!833 = !{!834, !835}
!834 = !DILocalVariable(name: "__fd", arg: 1, scope: !830, file: !700, line: 516, type: !364)
!835 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !830, file: !700, line: 516, type: !797)
!836 = !DILocation(line: 0, scope: !830)
!837 = !DILocation(line: 518, column: 10, scope: !830)
!838 = !DILocation(line: 518, column: 3, scope: !830)
!839 = distinct !DISubprogram(name: "fstatat64", scope: !700, file: !700, line: 523, type: !840, scopeLine: 525, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !842)
!840 = !DISubroutineType(types: !841)
!841 = !{!364, !364, !369, !797, !364}
!842 = !{!843, !844, !845, !846}
!843 = !DILocalVariable(name: "__fd", arg: 1, scope: !839, file: !700, line: 523, type: !364)
!844 = !DILocalVariable(name: "__filename", arg: 2, scope: !839, file: !700, line: 523, type: !369)
!845 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !839, file: !700, line: 523, type: !797)
!846 = !DILocalVariable(name: "__flag", arg: 4, scope: !839, file: !700, line: 523, type: !364)
!847 = !DILocation(line: 0, scope: !839)
!848 = !DILocation(line: 526, column: 10, scope: !839)
!849 = !DILocation(line: 526, column: 3, scope: !839)
!850 = distinct !DISubprogram(name: "decimal_real_from_string", scope: !1, file: !1, line: 76, type: !851, scopeLine: 77, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !865)
!851 = !DISubroutineType(types: !852)
!852 = !{null, !853, !369}
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !855, line: 52, size: 256, elements: !856)
!855 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!856 = !{!857, !858, !859, !860, !861, !862, !863}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !854, file: !855, line: 56, baseType: !5, size: 2, flags: DIFlagBitField, extraData: i64 0)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !854, file: !855, line: 57, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !854, file: !855, line: 58, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !854, file: !855, line: 59, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !854, file: !855, line: 60, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !854, file: !855, line: 61, baseType: !5, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !854, file: !855, line: 62, baseType: !864, size: 192, offset: 64)
!864 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 192, elements: !738)
!865 = !{!866, !867, !868, !885}
!866 = !DILocalVariable(name: "r", arg: 1, scope: !850, file: !1, line: 76, type: !853)
!867 = !DILocalVariable(name: "s", arg: 2, scope: !850, file: !1, line: 76, type: !369)
!868 = !DILocalVariable(name: "dn", scope: !850, file: !1, line: 78, type: !869)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "decNumber", file: !870, line: 84, baseType: !871)
!870 = !DIFile(filename: "./decNumber.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !870, line: 77, size: 288, elements: !872)
!872 = !{!873, !877, !878, !879}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "digits", scope: !871, file: !870, line: 78, baseType: !874, size: 32)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !875, line: 26, baseType: !876)
!875 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !382, line: 41, baseType: !364)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "exponent", scope: !871, file: !870, line: 79, baseType: !874, size: 32, offset: 32)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !871, file: !870, line: 81, baseType: !379, size: 8, offset: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "lsu", scope: !871, file: !870, line: 83, baseType: !880, size: 192, offset: 80)
!880 = !DICompositeType(tag: DW_TAG_array_type, baseType: !881, size: 192, elements: !883)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !380, line: 25, baseType: !882)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !382, line: 40, baseType: !448)
!883 = !{!884}
!884 = !DISubrange(count: 12)
!885 = !DILocalVariable(name: "set", scope: !850, file: !1, line: 79, type: !886)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "decContext", file: !4, line: 93, baseType: !887)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 82, size: 224, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !896, !897}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "digits", scope: !887, file: !4, line: 83, baseType: !874, size: 32)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "emax", scope: !887, file: !4, line: 84, baseType: !874, size: 32, offset: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "emin", scope: !887, file: !4, line: 85, baseType: !874, size: 32, offset: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "round", scope: !887, file: !4, line: 86, baseType: !3, size: 32, offset: 96)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "traps", scope: !887, file: !4, line: 87, baseType: !894, size: 32, offset: 128)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !380, line: 26, baseType: !895)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !382, line: 42, baseType: !5)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !887, file: !4, line: 88, baseType: !894, size: 32, offset: 160)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "clamp", scope: !887, file: !4, line: 89, baseType: !379, size: 8, offset: 192)
!898 = !DILocation(line: 0, scope: !850)
!899 = !DILocation(line: 78, column: 3, scope: !850)
!900 = !DILocation(line: 79, column: 3, scope: !850)
!901 = !DILocation(line: 80, column: 3, scope: !850)
!902 = !DILocation(line: 81, column: 7, scope: !850)
!903 = !DILocation(line: 81, column: 13, scope: !850)
!904 = !DILocation(line: 83, column: 3, scope: !850)
!905 = !DILocation(line: 88, column: 3, scope: !850)
!906 = !DILocation(line: 89, column: 1, scope: !850)
!907 = distinct !DISubprogram(name: "decimal_from_decnumber", scope: !1, file: !1, line: 49, type: !908, scopeLine: 50, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !912)
!908 = !DISubroutineType(types: !909)
!909 = !{null, !853, !910, !911}
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!912 = !{!913, !914, !915}
!913 = !DILocalVariable(name: "r", arg: 1, scope: !907, file: !1, line: 49, type: !853)
!914 = !DILocalVariable(name: "dn", arg: 2, scope: !907, file: !1, line: 49, type: !910)
!915 = !DILocalVariable(name: "context", arg: 3, scope: !907, file: !1, line: 49, type: !911)
!916 = !DILocation(line: 0, scope: !907)
!917 = !DILocation(line: 51, column: 11, scope: !907)
!918 = !DILocation(line: 51, column: 3, scope: !907)
!919 = !DILocation(line: 53, column: 6, scope: !907)
!920 = !DILocation(line: 53, column: 9, scope: !907)
!921 = !DILocation(line: 54, column: 7, scope: !922)
!922 = distinct !DILexicalBlock(scope: !907, file: !1, line: 54, column: 7)
!923 = !DILocation(line: 54, column: 7, scope: !907)
!924 = !DILocation(line: 55, column: 11, scope: !922)
!925 = !DILocation(line: 56, column: 7, scope: !926)
!926 = distinct !DILexicalBlock(scope: !907, file: !1, line: 56, column: 7)
!927 = !DILocation(line: 55, column: 5, scope: !922)
!928 = !DILocation(line: 56, column: 7, scope: !907)
!929 = !DILocation(line: 57, column: 11, scope: !926)
!930 = !DILocation(line: 57, column: 5, scope: !926)
!931 = !DILocation(line: 58, column: 16, scope: !932)
!932 = distinct !DILexicalBlock(scope: !907, file: !1, line: 58, column: 7)
!933 = !DILocation(line: 58, column: 23, scope: !932)
!934 = !DILocation(line: 58, column: 7, scope: !907)
!935 = !DILocation(line: 59, column: 11, scope: !932)
!936 = !DILocation(line: 59, column: 5, scope: !932)
!937 = !DILocation(line: 60, column: 7, scope: !938)
!938 = distinct !DILexicalBlock(scope: !907, file: !1, line: 60, column: 7)
!939 = !DILocation(line: 60, column: 7, scope: !907)
!940 = !DILocation(line: 61, column: 13, scope: !938)
!941 = !DILocation(line: 61, column: 5, scope: !938)
!942 = !DILocation(line: 62, column: 14, scope: !907)
!943 = !DILocation(line: 64, column: 10, scope: !944)
!944 = distinct !DILexicalBlock(scope: !907, file: !1, line: 64, column: 7)
!945 = !DILocation(line: 64, column: 13, scope: !944)
!946 = !DILocation(line: 64, column: 7, scope: !907)
!947 = !DILocation(line: 67, column: 3, scope: !907)
!948 = !DILocation(line: 68, column: 12, scope: !907)
!949 = !DILocation(line: 68, column: 18, scope: !907)
!950 = !DILocation(line: 70, column: 40, scope: !907)
!951 = !DILocation(line: 70, column: 25, scope: !907)
!952 = !DILocation(line: 70, column: 3, scope: !907)
!953 = !DILocation(line: 71, column: 1, scope: !907)
!954 = distinct !DISubprogram(name: "encode_decimal32", scope: !1, file: !1, line: 130, type: !955, scopeLine: 132, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !987)
!955 = !DISubroutineType(types: !956)
!956 = !{null, !957, !984, !985}
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !959)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_format", file: !855, line: 124, size: 448, elements: !960)
!960 = !{!961, !963, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "encode", scope: !959, file: !855, line: 127, baseType: !962, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !959, file: !855, line: 129, baseType: !964, size: 64, offset: 64)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DISubroutineType(types: !966)
!966 = !{null, !957, !853, !967}
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !446)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !959, file: !855, line: 133, baseType: !364, size: 32, offset: 128)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !959, file: !855, line: 136, baseType: !364, size: 32, offset: 160)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "pnan", scope: !959, file: !855, line: 139, baseType: !364, size: 32, offset: 192)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "emin", scope: !959, file: !855, line: 142, baseType: !364, size: 32, offset: 224)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "emax", scope: !959, file: !855, line: 145, baseType: !364, size: 32, offset: 256)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "signbit_ro", scope: !959, file: !855, line: 149, baseType: !364, size: 32, offset: 288)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "signbit_rw", scope: !959, file: !855, line: 153, baseType: !364, size: 32, offset: 320)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "round_towards_zero", scope: !959, file: !855, line: 156, baseType: !363, size: 8, offset: 352)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "has_sign_dependent_rounding", scope: !959, file: !855, line: 157, baseType: !363, size: 8, offset: 360)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "has_nans", scope: !959, file: !855, line: 160, baseType: !363, size: 8, offset: 368)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "has_inf", scope: !959, file: !855, line: 161, baseType: !363, size: 8, offset: 376)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "has_denorm", scope: !959, file: !855, line: 162, baseType: !363, size: 8, offset: 384)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "has_signed_zero", scope: !959, file: !855, line: 163, baseType: !363, size: 8, offset: 392)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "qnan_msb_set", scope: !959, file: !855, line: 164, baseType: !363, size: 8, offset: 400)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "canonical_nan_lsbs_set", scope: !959, file: !855, line: 165, baseType: !363, size: 8, offset: 408)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !854)
!987 = !{!988, !989, !990, !991, !992, !1001, !1002}
!988 = !DILocalVariable(name: "fmt", arg: 1, scope: !954, file: !1, line: 130, type: !957)
!989 = !DILocalVariable(name: "buf", arg: 2, scope: !954, file: !1, line: 131, type: !984)
!990 = !DILocalVariable(name: "r", arg: 3, scope: !954, file: !1, line: 131, type: !985)
!991 = !DILocalVariable(name: "dn", scope: !954, file: !1, line: 133, type: !869)
!992 = !DILocalVariable(name: "d32", scope: !954, file: !1, line: 134, type: !993)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "decimal32", file: !994, line: 64, baseType: !995)
!994 = !DIFile(filename: "./decimal32.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !994, line: 62, size: 32, elements: !996)
!996 = !{!997}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !995, file: !994, line: 63, baseType: !998, size: 32)
!998 = !DICompositeType(tag: DW_TAG_array_type, baseType: !379, size: 32, elements: !999)
!999 = !{!1000}
!1000 = !DISubrange(count: 4)
!1001 = !DILocalVariable(name: "set", scope: !954, file: !1, line: 135, type: !886)
!1002 = !DILocalVariable(name: "image", scope: !954, file: !1, line: 136, type: !874)
!1003 = !DILocation(line: 0, scope: !954)
!1004 = !DILocation(line: 133, column: 3, scope: !954)
!1005 = !DILocation(line: 134, column: 3, scope: !954)
!1006 = !DILocation(line: 135, column: 3, scope: !954)
!1007 = !DILocation(line: 136, column: 3, scope: !954)
!1008 = !DILocation(line: 138, column: 3, scope: !954)
!1009 = !DILocation(line: 139, column: 7, scope: !954)
!1010 = !DILocation(line: 139, column: 13, scope: !954)
!1011 = !DILocation(line: 141, column: 3, scope: !954)
!1012 = !DILocation(line: 142, column: 3, scope: !954)
!1013 = !DILocation(line: 144, column: 3, scope: !954)
!1014 = !DILocation(line: 145, column: 12, scope: !954)
!1015 = !DILocation(line: 145, column: 10, scope: !954)
!1016 = !DILocation(line: 146, column: 1, scope: !954)
!1017 = distinct !DISubprogram(name: "decimal_to_decnumber", scope: !1, file: !1, line: 94, type: !1018, scopeLine: 95, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1020)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{null, !985, !910}
!1020 = !{!1021, !1022, !1023}
!1021 = !DILocalVariable(name: "r", arg: 1, scope: !1017, file: !1, line: 94, type: !985)
!1022 = !DILocalVariable(name: "dn", arg: 2, scope: !1017, file: !1, line: 94, type: !910)
!1023 = !DILocalVariable(name: "set", scope: !1017, file: !1, line: 96, type: !886)
!1024 = !DILocation(line: 0, scope: !1017)
!1025 = !DILocation(line: 96, column: 3, scope: !1017)
!1026 = !DILocation(line: 97, column: 3, scope: !1017)
!1027 = !DILocation(line: 98, column: 7, scope: !1017)
!1028 = !DILocation(line: 98, column: 13, scope: !1017)
!1029 = !DILocation(line: 100, column: 14, scope: !1017)
!1030 = !DILocation(line: 100, column: 3, scope: !1017)
!1031 = !DILocation(line: 103, column: 7, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !1017, file: !1, line: 101, column: 5)
!1033 = !DILocation(line: 104, column: 7, scope: !1032)
!1034 = !DILocation(line: 106, column: 7, scope: !1032)
!1035 = !DILocation(line: 107, column: 7, scope: !1032)
!1036 = !DILocation(line: 109, column: 14, scope: !1037)
!1037 = distinct !DILexicalBlock(scope: !1032, file: !1, line: 109, column: 11)
!1038 = !DILocation(line: 109, column: 11, scope: !1037)
!1039 = !DILocation(line: 109, column: 11, scope: !1032)
!1040 = !DILocation(line: 110, column: 9, scope: !1037)
