; ModuleID = 'diagnostic.bc'
source_filename = "diagnostic.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.diagnostic_context = type { %struct.pretty_print_info*, [12 x i32], i8, i8, [870 x i32], i8, i8, void (%struct.diagnostic_context*, %struct.diagnostic_info*)*, void (%struct.diagnostic_context*, %struct.diagnostic_info*)*, void (i8*, [1 x %struct.__va_list_tag]*)*, %union.tree_node*, %struct.line_map*, i32, i8 }
%struct.pretty_print_info = type { %struct.output_buffer*, i8*, i32, i32, i32, %struct.pp_wrapping_mode_t, i8 (%struct.pretty_print_info*, %struct.text_info*, i8*, i32, i8, i8, i8)*, i8, i8, i8 }
%struct.output_buffer = type { %struct.obstack, %struct.obstack, %struct.obstack*, %struct.chunk_info*, %struct._IO_FILE*, i32, [128 x i8] }
%struct.obstack = type { i64, %struct._obstack_chunk*, i8*, i8*, i8*, i64, i32, %struct._obstack_chunk* (i8*, i64)*, void (i8*, %struct._obstack_chunk*)*, i8*, i8 }
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [4 x i8] }
%struct.chunk_info = type { %struct.chunk_info*, [60 x i8*] }

!212 = !DIEnumerator(name: "OMP_ORDERED", value: 160, isUnsigned: true)
!213 = !DIEnumerator(name: "OMP_CRITICAL", value: 161, isUnsigned: true)
!214 = !DIEnumerator(name: "OMP_ATOMIC", value: 162, isUnsigned: true)
!215 = !DIEnumerator(name: "OMP_CLAUSE", value: 163, isUnsigned: true)
!216 = !DIEnumerator(name: "REDUC_MAX_EXPR", value: 164, isUnsigned: true)
!217 = !DIEnumerator(name: "REDUC_MIN_EXPR", value: 165, isUnsigned: true)
!218 = !DIEnumerator(name: "REDUC_PLUS_EXPR", value: 166, isUnsigned: true)
!219 = !DIEnumerator(name: "DOT_PROD_EXPR", value: 167, isUnsigned: true)
!220 = !DIEnumerator(name: "WIDEN_SUM_EXPR", value: 168, isUnsigned: true)
!221 = !DIEnumerator(name: "WIDEN_MULT_EXPR", value: 169, isUnsigned: true)
!222 = !DIEnumerator(name: "VEC_LSHIFT_EXPR", value: 170, isUnsigned: true)
!223 = !DIEnumerator(name: "VEC_RSHIFT_EXPR", value: 171, isUnsigned: true)
!224 = !DIEnumerator(name: "VEC_WIDEN_MULT_HI_EXPR", value: 172, isUnsigned: true)
!225 = !DIEnumerator(name: "VEC_WIDEN_MULT_LO_EXPR", value: 173, isUnsigned: true)
!226 = !DIEnumerator(name: "VEC_UNPACK_HI_EXPR", value: 174, isUnsigned: true)
!227 = !DIEnumerator(name: "VEC_UNPACK_LO_EXPR", value: 175, isUnsigned: true)
!228 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_HI_EXPR", value: 176, isUnsigned: true)
!229 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_LO_EXPR", value: 177, isUnsigned: true)
!230 = !DIEnumerator(name: "VEC_PACK_TRUNC_EXPR", value: 178, isUnsigned: true)
!231 = !DIEnumerator(name: "VEC_PACK_SAT_EXPR", value: 179, isUnsigned: true)
!232 = !DIEnumerator(name: "VEC_PACK_FIX_TRUNC_EXPR", value: 180, isUnsigned: true)
!233 = !DIEnumerator(name: "VEC_EXTRACT_EVEN_EXPR", value: 181, isUnsigned: true)
!234 = !DIEnumerator(name: "VEC_EXTRACT_ODD_EXPR", value: 182, isUnsigned: true)
!235 = !DIEnumerator(name: "VEC_INTERLEAVE_HIGH_EXPR", value: 183, isUnsigned: true)
!236 = !DIEnumerator(name: "VEC_INTERLEAVE_LOW_EXPR", value: 184, isUnsigned: true)
!237 = !DIEnumerator(name: "PREDICT_EXPR", value: 185, isUnsigned: true)
!238 = !DIEnumerator(name: "OPTIMIZATION_NODE", value: 186, isUnsigned: true)
!239 = !DIEnumerator(name: "TARGET_OPTION_NODE", value: 187, isUnsigned: true)
!240 = !DIEnumerator(name: "LAST_AND_UNUSED_TREE_CODE", value: 188, isUnsigned: true)
!241 = !DIEnumerator(name: "C_MAYBE_CONST_EXPR", value: 189, isUnsigned: true)
!242 = !DIEnumerator(name: "EXCESS_PRECISION_EXPR", value: 190, isUnsigned: true)
!243 = !DIEnumerator(name: "MAX_TREE_CODES", value: 191, isUnsigned: true)
!244 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !245, line: 29, baseType: !7, size: 32, elements: !246)
!245 = !DIFile(filename: "./diagnostic.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!246 = !{!247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259}
!247 = !DIEnumerator(name: "DK_UNSPECIFIED", value: 0, isUnsigned: true)
!248 = !DIEnumerator(name: "DK_IGNORED", value: 1, isUnsigned: true)
!249 = !DIEnumerator(name: "DK_FATAL", value: 2, isUnsigned: true)
!250 = !DIEnumerator(name: "DK_ICE", value: 3, isUnsigned: true)
!251 = !DIEnumerator(name: "DK_ERROR", value: 4, isUnsigned: true)
!252 = !DIEnumerator(name: "DK_SORRY", value: 5, isUnsigned: true)
!253 = !DIEnumerator(name: "DK_WARNING", value: 6, isUnsigned: true)
!254 = !DIEnumerator(name: "DK_ANACHRONISM", value: 7, isUnsigned: true)
!255 = !DIEnumerator(name: "DK_NOTE", value: 8, isUnsigned: true)
!256 = !DIEnumerator(name: "DK_DEBUG", value: 9, isUnsigned: true)
!257 = !DIEnumerator(name: "DK_PEDWARN", value: 10, isUnsigned: true)
!258 = !DIEnumerator(name: "DK_PERMERROR", value: 11, isUnsigned: true)
!259 = !DIEnumerator(name: "DK_LAST_DIAGNOSTIC_KIND", value: 12, isUnsigned: true)
!260 = !{!261, !262, !263, !264, !267, !268, !270, !429, !265}
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!263 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !266)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "pretty_printer", file: !6, line: 134, baseType: !272)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pretty_print_info", file: !6, line: 158, size: 448, elements: !273)
!273 = !{!274, !388, !389, !391, !392, !393, !400, !1062, !1063, !1064}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !272, file: !6, line: 161, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "output_buffer", file: !6, line: 99, baseType: !277)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 74, size: 2688, elements: !278)
!278 = !{!279, !312, !313, !315, !324, !383, !384}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "formatted_obstack", scope: !277, file: !6, line: 77, baseType: !280, size: 704)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !281, line: 164, size: 704, elements: !282)
!281 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!282 = !{!283, !285, !295, !296, !297, !298, !299, !300, !304, !308, !309, !310, !311}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !280, file: !281, line: 166, baseType: !284, size: 64)
!284 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !280, file: !281, line: 167, baseType: !286, size: 64, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !281, line: 157, size: 192, elements: !288)
!288 = !{!289, !290, !291}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !287, file: !281, line: 159, baseType: !265, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !287, file: !281, line: 160, baseType: !286, size: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !287, file: !281, line: 161, baseType: !292, size: 32, offset: 128)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 32, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 4)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !280, file: !281, line: 168, baseType: !265, size: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !280, file: !281, line: 169, baseType: !265, size: 64, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !280, file: !281, line: 170, baseType: !265, size: 64, offset: 256)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !280, file: !281, line: 171, baseType: !284, size: 64, offset: 320)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !280, file: !281, line: 172, baseType: !263, size: 32, offset: 384)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !280, file: !281, line: 176, baseType: !301, size: 64, offset: 448)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{!286, !267, !284}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !280, file: !281, line: 177, baseType: !305, size: 64, offset: 512)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{null, !267, !286}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !280, file: !281, line: 178, baseType: !267, size: 64, offset: 576)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !280, file: !281, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !280, file: !281, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !280, file: !281, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_obstack", scope: !277, file: !6, line: 81, baseType: !280, size: 704, offset: 704)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !277, file: !6, line: 85, baseType: !314, size: 64, offset: 1408)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "cur_chunk_array", scope: !277, file: !6, line: 88, baseType: !316, size: 64, offset: 1472)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chunk_info", file: !6, line: 58, size: 3904, elements: !318)
!318 = !{!319, !320}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !317, file: !6, line: 61, baseType: !316, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !317, file: !6, line: 69, baseType: !321, size: 3840, offset: 64)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 3840, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 60)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !277, file: !6, line: 91, baseType: !325, size: 64, offset: 1536)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !327, line: 7, baseType: !328)
!327 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !329, line: 49, size: 1728, elements: !330)
!329 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!330 = !{!331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !346, !348, !349, !350, !353, !355, !357, !361, !364, !366, !369, !372, !373, !374, !378, !379}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !328, file: !329, line: 51, baseType: !263, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !328, file: !329, line: 54, baseType: !265, size: 64, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !328, file: !329, line: 55, baseType: !265, size: 64, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !328, file: !329, line: 56, baseType: !265, size: 64, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !328, file: !329, line: 57, baseType: !265, size: 64, offset: 256)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !328, file: !329, line: 58, baseType: !265, size: 64, offset: 320)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !328, file: !329, line: 59, baseType: !265, size: 64, offset: 384)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !328, file: !329, line: 60, baseType: !265, size: 64, offset: 448)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !328, file: !329, line: 61, baseType: !265, size: 64, offset: 512)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !328, file: !329, line: 64, baseType: !265, size: 64, offset: 576)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !328, file: !329, line: 65, baseType: !265, size: 64, offset: 640)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !328, file: !329, line: 66, baseType: !265, size: 64, offset: 704)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !328, file: !329, line: 68, baseType: !344, size: 64, offset: 768)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !329, line: 36, flags: DIFlagFwdDecl)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !328, file: !329, line: 70, baseType: !347, size: 64, offset: 832)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !328, file: !329, line: 72, baseType: !263, size: 32, offset: 896)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !328, file: !329, line: 73, baseType: !263, size: 32, offset: 928)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !328, file: !329, line: 74, baseType: !351, size: 64, offset: 960)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !352, line: 152, baseType: !284)
!352 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !328, file: !329, line: 77, baseType: !354, size: 16, offset: 1024)
!354 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !328, file: !329, line: 78, baseType: !356, size: 8, offset: 1040)
!356 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !328, file: !329, line: 79, baseType: !358, size: 8, offset: 1048)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 8, elements: !359)
!359 = !{!360}
!360 = !DISubrange(count: 1)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !328, file: !329, line: 81, baseType: !362, size: 64, offset: 1088)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !329, line: 43, baseType: null)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !328, file: !329, line: 89, baseType: !365, size: 64, offset: 1152)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !352, line: 153, baseType: !284)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !328, file: !329, line: 91, baseType: !367, size: 64, offset: 1216)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !329, line: 37, flags: DIFlagFwdDecl)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !328, file: !329, line: 92, baseType: !370, size: 64, offset: 1280)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !329, line: 38, flags: DIFlagFwdDecl)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !328, file: !329, line: 93, baseType: !347, size: 64, offset: 1344)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !328, file: !329, line: 94, baseType: !267, size: 64, offset: 1408)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !328, file: !329, line: 95, baseType: !375, size: 64, offset: 1472)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !376, line: 46, baseType: !377)
!376 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!377 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !328, file: !329, line: 96, baseType: !263, size: 32, offset: 1536)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !328, file: !329, line: 98, baseType: !380, size: 160, offset: 1568)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 160, elements: !381)
!381 = !{!382}
!382 = !DISubrange(count: 20)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "line_length", scope: !277, file: !6, line: 94, baseType: !263, size: 32, offset: 1600)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "digit_buffer", scope: !277, file: !6, line: 98, baseType: !385, size: 1024, offset: 1632)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 1024, elements: !386)
!386 = !{!387}
!387 = !DISubrange(count: 128)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !272, file: !6, line: 164, baseType: !268, size: 64, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !272, file: !6, line: 167, baseType: !390, size: 32, offset: 128)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "pp_padding", file: !6, line: 107, baseType: !5)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "maximum_length", scope: !272, file: !6, line: 171, baseType: !263, size: 32, offset: 160)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "indent_skip", scope: !272, file: !6, line: 174, baseType: !263, size: 32, offset: 192)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "wrapping", scope: !272, file: !6, line: 177, baseType: !394, size: 64, offset: 224)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "pp_wrapping_mode_t", file: !6, line: 119, baseType: !395)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 111, size: 64, elements: !396)
!396 = !{!397, !399}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "rule", scope: !395, file: !6, line: 114, baseType: !398, size: 32)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "diagnostic_prefixing_rule_t", file: !6, line: 51, baseType: !12)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "line_cutoff", scope: !395, file: !6, line: 118, baseType: !263, size: 32, offset: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "format_decoder", scope: !272, file: !6, line: 187, baseType: !401, size: 64, offset: 320)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "printer_fn", file: !6, line: 135, baseType: !402)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{!262, !270, !405, !268, !263, !262, !262, !262}
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "text_info", file: !6, line: 39, baseType: !407)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 32, size: 320, elements: !408)
!408 = !{!409, !410, !424, !425, !431}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "format_spec", scope: !407, file: !6, line: 34, baseType: !268, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "args_ptr", scope: !407, file: !6, line: 35, baseType: !411, size: 64, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !413, line: 52, baseType: !414)
!413 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !415, line: 32, baseType: !416)
!415 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stdarg.h", directory: "")
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 59, baseType: !417)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !418, size: 192, elements: !359)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, size: 192, elements: !419)
!419 = !{!420, !421, !422, !423}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !418, file: !3, baseType: !7, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !418, file: !3, baseType: !7, size: 32, offset: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !418, file: !3, baseType: !267, size: 64, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !418, file: !3, baseType: !267, size: 64, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "err_no", scope: !407, file: !6, line: 36, baseType: !263, size: 32, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !407, file: !6, line: 37, baseType: !426, size: 64, offset: 192)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !428, line: 58, baseType: !429)
!428 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !430, line: 44, baseType: !7)
!430 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!431 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !407, file: !6, line: 38, baseType: !432, size: 64, offset: 256)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !434, line: 56, baseType: !435)
!434 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !18, line: 3371, size: 1792, elements: !437)
!437 = !{!438, !471, !477, !488, !495, !502, !507, !513, !519, !532, !540, !578, !586, !614, !622, !623, !628, !637, !643, !648, !652, !656, !685, !734, !740, !747, !754, !779, !804, !821, !833, !855, !873, !1044}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !436, file: !18, line: 3372, baseType: !439, size: 64)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !18, line: 360, size: 64, elements: !440)
!440 = !{!441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !439, file: !18, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !439, file: !18, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !439, file: !18, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !439, file: !18, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !439, file: !18, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !439, file: !18, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !439, file: !18, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !439, file: !18, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !439, file: !18, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !439, file: !18, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !439, file: !18, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !439, file: !18, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !439, file: !18, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !439, file: !18, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !439, file: !18, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !439, file: !18, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !439, file: !18, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !439, file: !18, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !439, file: !18, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !439, file: !18, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !439, file: !18, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !439, file: !18, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !439, file: !18, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !439, file: !18, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !439, file: !18, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !439, file: !18, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !439, file: !18, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !439, file: !18, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !439, file: !18, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !439, file: !18, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !436, file: !18, line: 3373, baseType: !472, size: 192)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !18, line: 402, size: 192, elements: !473)
!473 = !{!474, !475, !476}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !472, file: !18, line: 403, baseType: !439, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !472, file: !18, line: 404, baseType: !433, size: 64, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !472, file: !18, line: 405, baseType: !433, size: 64, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !436, file: !18, line: 3374, baseType: !478, size: 320)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !18, line: 1384, size: 320, elements: !479)
!479 = !{!480, !481}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !478, file: !18, line: 1385, baseType: !472, size: 192)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !478, file: !18, line: 1386, baseType: !482, size: 128, offset: 192)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !483, line: 58, baseType: !484)
!483 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !483, line: 54, size: 128, elements: !485)
!485 = !{!486, !487}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !484, file: !483, line: 56, baseType: !377, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !484, file: !483, line: 57, baseType: !284, size: 64, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !436, file: !18, line: 3375, baseType: !489, size: 256)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !18, line: 1397, size: 256, elements: !490)
!490 = !{!491, !492}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !489, file: !18, line: 1398, baseType: !472, size: 192)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !489, file: !18, line: 1399, baseType: !493, size: 64, offset: 192)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !18, line: 1392, flags: DIFlagFwdDecl)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !436, file: !18, line: 3376, baseType: !496, size: 256)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !18, line: 1408, size: 256, elements: !497)
!497 = !{!498, !499}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !496, file: !18, line: 1409, baseType: !472, size: 192)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !496, file: !18, line: 1410, baseType: !500, size: 64, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !18, line: 1403, flags: DIFlagFwdDecl)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !436, file: !18, line: 3377, baseType: !503, size: 256)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !18, line: 1437, size: 256, elements: !504)
!504 = !{!505, !506}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !503, file: !18, line: 1438, baseType: !472, size: 192)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !503, file: !18, line: 1439, baseType: !433, size: 64, offset: 192)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !436, file: !18, line: 3378, baseType: !508, size: 256)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !18, line: 1418, size: 256, elements: !509)
!509 = !{!510, !511, !512}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !508, file: !18, line: 1419, baseType: !472, size: 192)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !508, file: !18, line: 1420, baseType: !263, size: 32, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !508, file: !18, line: 1421, baseType: !358, size: 8, offset: 224)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !436, file: !18, line: 3379, baseType: !514, size: 320)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !18, line: 1428, size: 320, elements: !515)
!515 = !{!516, !517, !518}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !514, file: !18, line: 1429, baseType: !472, size: 192)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !514, file: !18, line: 1430, baseType: !433, size: 64, offset: 192)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !514, file: !18, line: 1431, baseType: !433, size: 64, offset: 256)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !436, file: !18, line: 3380, baseType: !520, size: 320)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !18, line: 1460, size: 320, elements: !521)
!521 = !{!522, !523}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !520, file: !18, line: 1461, baseType: !472, size: 192)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !520, file: !18, line: 1462, baseType: !524, size: 128, offset: 192)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !525, line: 31, size: 128, elements: !526)
!525 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!526 = !{!527, !530, !531}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !524, file: !525, line: 32, baseType: !528, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !262)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !524, file: !525, line: 33, baseType: !7, size: 32, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !524, file: !525, line: 34, baseType: !7, size: 32, offset: 96)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !436, file: !18, line: 3381, baseType: !533, size: 384)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !18, line: 2507, size: 384, elements: !534)
!534 = !{!535, !536, !537, !538, !539}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !533, file: !18, line: 2508, baseType: !472, size: 192)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !533, file: !18, line: 2509, baseType: !427, size: 32, offset: 192)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !533, file: !18, line: 2510, baseType: !7, size: 32, offset: 224)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !533, file: !18, line: 2511, baseType: !433, size: 64, offset: 256)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !533, file: !18, line: 2512, baseType: !433, size: 64, offset: 320)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !436, file: !18, line: 3382, baseType: !541, size: 896)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !18, line: 2652, size: 896, elements: !542)
!542 = !{!543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !541, file: !18, line: 2653, baseType: !533, size: 384)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !541, file: !18, line: 2654, baseType: !433, size: 64, offset: 384)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !541, file: !18, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !541, file: !18, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !541, file: !18, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !541, file: !18, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !541, file: !18, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !541, file: !18, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !541, file: !18, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !541, file: !18, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !541, file: !18, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !541, file: !18, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !541, file: !18, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !541, file: !18, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !541, file: !18, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !541, file: !18, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !541, file: !18, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !541, file: !18, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !541, file: !18, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !541, file: !18, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !541, file: !18, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !541, file: !18, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !541, file: !18, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !541, file: !18, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !541, file: !18, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !541, file: !18, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !541, file: !18, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !541, file: !18, line: 2703, baseType: !7, size: 32, offset: 512)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !541, file: !18, line: 2705, baseType: !433, size: 64, offset: 576)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !541, file: !18, line: 2706, baseType: !433, size: 64, offset: 640)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !541, file: !18, line: 2707, baseType: !433, size: 64, offset: 704)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !541, file: !18, line: 2708, baseType: !433, size: 64, offset: 768)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !541, file: !18, line: 2711, baseType: !576, size: 64, offset: 832)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !18, line: 2711, flags: DIFlagFwdDecl)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !436, file: !18, line: 3383, baseType: !579, size: 960)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !18, line: 2756, size: 960, elements: !580)
!580 = !{!581, !582}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !579, file: !18, line: 2757, baseType: !541, size: 896)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !579, file: !18, line: 2758, baseType: !583, size: 64, offset: 896)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !434, line: 50, baseType: !584)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !434, line: 49, flags: DIFlagFwdDecl)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !436, file: !18, line: 3384, baseType: !587, size: 1472)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !18, line: 3114, size: 1472, elements: !588)
!588 = !{!589, !610, !611, !612, !613}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !587, file: !18, line: 3115, baseType: !590, size: 1216)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !18, line: 2984, size: 1216, elements: !591)
!591 = !{!592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !590, file: !18, line: 2985, baseType: !579, size: 960)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !590, file: !18, line: 2986, baseType: !433, size: 64, offset: 960)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !590, file: !18, line: 2987, baseType: !433, size: 64, offset: 1024)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !590, file: !18, line: 2988, baseType: !433, size: 64, offset: 1088)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !590, file: !18, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !590, file: !18, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !590, file: !18, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !590, file: !18, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !590, file: !18, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !590, file: !18, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !590, file: !18, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !590, file: !18, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !590, file: !18, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !590, file: !18, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !590, file: !18, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !590, file: !18, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !590, file: !18, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !590, file: !18, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !587, file: !18, line: 3117, baseType: !433, size: 64, offset: 1216)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !587, file: !18, line: 3119, baseType: !433, size: 64, offset: 1280)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !587, file: !18, line: 3121, baseType: !433, size: 64, offset: 1344)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !587, file: !18, line: 3123, baseType: !433, size: 64, offset: 1408)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !436, file: !18, line: 3385, baseType: !615, size: 1088)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !18, line: 2874, size: 1088, elements: !616)
!616 = !{!617, !618, !619}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !615, file: !18, line: 2875, baseType: !579, size: 960)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !615, file: !18, line: 2876, baseType: !583, size: 64, offset: 960)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !615, file: !18, line: 2877, baseType: !620, size: 64, offset: 1024)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !18, line: 2856, flags: DIFlagFwdDecl)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !436, file: !18, line: 3386, baseType: !590, size: 1216)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !436, file: !18, line: 3387, baseType: !624, size: 1280)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !18, line: 3093, size: 1280, elements: !625)
!625 = !{!626, !627}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !624, file: !18, line: 3094, baseType: !590, size: 1216)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !624, file: !18, line: 3095, baseType: !620, size: 64, offset: 1216)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !436, file: !18, line: 3388, baseType: !629, size: 1216)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !18, line: 2824, size: 1216, elements: !630)
!630 = !{!631, !632, !633, !634, !635, !636}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !629, file: !18, line: 2825, baseType: !541, size: 896)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !629, file: !18, line: 2827, baseType: !433, size: 64, offset: 896)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !629, file: !18, line: 2828, baseType: !433, size: 64, offset: 960)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !629, file: !18, line: 2829, baseType: !433, size: 64, offset: 1024)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !629, file: !18, line: 2830, baseType: !433, size: 64, offset: 1088)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !629, file: !18, line: 2831, baseType: !433, size: 64, offset: 1152)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !436, file: !18, line: 3389, baseType: !638, size: 1024)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !18, line: 2850, size: 1024, elements: !639)
!639 = !{!640, !641, !642}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !638, file: !18, line: 2851, baseType: !579, size: 960)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !638, file: !18, line: 2852, baseType: !263, size: 32, offset: 960)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !638, file: !18, line: 2853, baseType: !263, size: 32, offset: 992)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !436, file: !18, line: 3390, baseType: !644, size: 1024)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !18, line: 2857, size: 1024, elements: !645)
!645 = !{!646, !647}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !644, file: !18, line: 2858, baseType: !579, size: 960)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !644, file: !18, line: 2859, baseType: !620, size: 64, offset: 960)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !436, file: !18, line: 3391, baseType: !649, size: 960)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !18, line: 2862, size: 960, elements: !650)
!650 = !{!651}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !649, file: !18, line: 2863, baseType: !579, size: 960)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !436, file: !18, line: 3392, baseType: !653, size: 1472)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !18, line: 3304, size: 1472, elements: !654)
!654 = !{!655}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !653, file: !18, line: 3305, baseType: !587, size: 1472)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !436, file: !18, line: 3393, baseType: !657, size: 1792)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !18, line: 3248, size: 1792, elements: !658)
!658 = !{!659, !660, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !657, file: !18, line: 3249, baseType: !587, size: 1472)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !657, file: !18, line: 3251, baseType: !661, size: 64, offset: 1472)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !663, line: 41, flags: DIFlagFwdDecl)
!663 = !DIFile(filename: "./statistics.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!664 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !657, file: !18, line: 3254, baseType: !433, size: 64, offset: 1536)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !657, file: !18, line: 3257, baseType: !433, size: 64, offset: 1600)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !657, file: !18, line: 3258, baseType: !433, size: 64, offset: 1664)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !657, file: !18, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !657, file: !18, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !657, file: !18, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !657, file: !18, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !657, file: !18, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !657, file: !18, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !657, file: !18, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !657, file: !18, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !657, file: !18, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !657, file: !18, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !657, file: !18, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !657, file: !18, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !657, file: !18, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !657, file: !18, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !657, file: !18, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !657, file: !18, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !657, file: !18, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !657, file: !18, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !436, file: !18, line: 3394, baseType: !686, size: 1344)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !18, line: 2279, size: 1344, elements: !687)
!687 = !{!688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !713, !714, !715, !723, !724, !725, !726, !727, !728, !729, !730, !731}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !686, file: !18, line: 2280, baseType: !472, size: 192)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !686, file: !18, line: 2281, baseType: !433, size: 64, offset: 192)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !686, file: !18, line: 2282, baseType: !433, size: 64, offset: 256)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !686, file: !18, line: 2283, baseType: !433, size: 64, offset: 320)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !686, file: !18, line: 2284, baseType: !433, size: 64, offset: 384)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !686, file: !18, line: 2285, baseType: !7, size: 32, offset: 448)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !686, file: !18, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !686, file: !18, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !686, file: !18, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !686, file: !18, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !686, file: !18, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !686, file: !18, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !686, file: !18, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !686, file: !18, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !686, file: !18, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !686, file: !18, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !686, file: !18, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !686, file: !18, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !686, file: !18, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !686, file: !18, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !686, file: !18, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !686, file: !18, line: 2305, baseType: !7, size: 32, offset: 512)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !686, file: !18, line: 2306, baseType: !711, size: 32, offset: 544)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !712, line: 31, baseType: !263)
!712 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!713 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !686, file: !18, line: 2307, baseType: !433, size: 64, offset: 576)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !686, file: !18, line: 2308, baseType: !433, size: 64, offset: 640)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !686, file: !18, line: 2314, baseType: !716, size: 64, offset: 704)
!716 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !18, line: 2309, size: 64, elements: !717)
!717 = !{!718, !719, !720}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !716, file: !18, line: 2310, baseType: !263, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !716, file: !18, line: 2311, baseType: !268, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !716, file: !18, line: 2312, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !18, line: 2277, flags: DIFlagFwdDecl)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !686, file: !18, line: 2315, baseType: !433, size: 64, offset: 768)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !686, file: !18, line: 2316, baseType: !433, size: 64, offset: 832)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !686, file: !18, line: 2317, baseType: !433, size: 64, offset: 896)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !686, file: !18, line: 2318, baseType: !433, size: 64, offset: 960)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !686, file: !18, line: 2319, baseType: !433, size: 64, offset: 1024)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !686, file: !18, line: 2320, baseType: !433, size: 64, offset: 1088)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !686, file: !18, line: 2321, baseType: !433, size: 64, offset: 1152)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !686, file: !18, line: 2322, baseType: !433, size: 64, offset: 1216)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !686, file: !18, line: 2324, baseType: !732, size: 64, offset: 1280)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !18, line: 2324, flags: DIFlagFwdDecl)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !436, file: !18, line: 3395, baseType: !735, size: 320)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !18, line: 1469, size: 320, elements: !736)
!736 = !{!737, !738, !739}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !735, file: !18, line: 1470, baseType: !472, size: 192)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !735, file: !18, line: 1471, baseType: !433, size: 64, offset: 192)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !735, file: !18, line: 1472, baseType: !433, size: 64, offset: 256)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !436, file: !18, line: 3396, baseType: !741, size: 320)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !18, line: 1482, size: 320, elements: !742)
!742 = !{!743, !744, !745}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !741, file: !18, line: 1483, baseType: !472, size: 192)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !741, file: !18, line: 1484, baseType: !263, size: 32, offset: 192)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !741, file: !18, line: 1485, baseType: !746, size: 64, offset: 256)
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 64, elements: !359)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !436, file: !18, line: 3397, baseType: !748, size: 384)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !18, line: 1829, size: 384, elements: !749)
!749 = !{!750, !751, !752, !753}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !748, file: !18, line: 1830, baseType: !472, size: 192)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !748, file: !18, line: 1831, baseType: !427, size: 32, offset: 192)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !748, file: !18, line: 1832, baseType: !433, size: 64, offset: 256)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !748, file: !18, line: 1835, baseType: !746, size: 64, offset: 320)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !436, file: !18, line: 3398, baseType: !755, size: 704)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !18, line: 1898, size: 704, elements: !756)
!756 = !{!757, !758, !759, !763, !764, !767}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !755, file: !18, line: 1899, baseType: !472, size: 192)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !755, file: !18, line: 1902, baseType: !433, size: 64, offset: 192)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !755, file: !18, line: 1905, baseType: !760, size: 64, offset: 256)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !434, line: 58, baseType: !761)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !434, line: 57, flags: DIFlagFwdDecl)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !755, file: !18, line: 1908, baseType: !7, size: 32, offset: 320)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !755, file: !18, line: 1911, baseType: !765, size: 64, offset: 384)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !18, line: 1876, flags: DIFlagFwdDecl)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !755, file: !18, line: 1914, baseType: !768, size: 256, offset: 448)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !18, line: 1883, size: 256, elements: !769)
!769 = !{!770, !772, !773, !778}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !768, file: !18, line: 1884, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !768, file: !18, line: 1885, baseType: !771, size: 64, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !768, file: !18, line: 1891, baseType: !774, size: 64, offset: 128)
!774 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !768, file: !18, line: 1891, size: 64, elements: !775)
!775 = !{!776, !777}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !774, file: !18, line: 1891, baseType: !760, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !774, file: !18, line: 1891, baseType: !433, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !768, file: !18, line: 1892, baseType: !432, size: 64, offset: 192)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !436, file: !18, line: 3399, baseType: !780, size: 704)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !18, line: 2008, size: 704, elements: !781)
!781 = !{!782, !783, !784, !785, !786, !787, !799, !800, !801, !802, !803}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !780, file: !18, line: 2009, baseType: !472, size: 192)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !780, file: !18, line: 2011, baseType: !7, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !780, file: !18, line: 2012, baseType: !7, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !780, file: !18, line: 2014, baseType: !427, size: 32, offset: 224)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !780, file: !18, line: 2016, baseType: !433, size: 64, offset: 256)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !780, file: !18, line: 2017, baseType: !788, size: 64, offset: 320)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !18, line: 183, baseType: !790)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !18, line: 183, size: 128, elements: !791)
!791 = !{!792}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !790, file: !18, line: 183, baseType: !793, size: 128)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !18, line: 182, baseType: !794)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !18, line: 182, size: 128, elements: !795)
!795 = !{!796, !797, !798}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !794, file: !18, line: 182, baseType: !7, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !794, file: !18, line: 182, baseType: !7, size: 32, offset: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !794, file: !18, line: 182, baseType: !746, size: 64, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !780, file: !18, line: 2019, baseType: !433, size: 64, offset: 384)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !780, file: !18, line: 2020, baseType: !433, size: 64, offset: 448)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !780, file: !18, line: 2021, baseType: !433, size: 64, offset: 512)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !780, file: !18, line: 2022, baseType: !433, size: 64, offset: 576)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !780, file: !18, line: 2023, baseType: !433, size: 64, offset: 640)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !436, file: !18, line: 3400, baseType: !805, size: 832)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !18, line: 2430, size: 832, elements: !806)
!806 = !{!807, !808, !809, !810, !811, !812, !813, !814, !815, !816}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !805, file: !18, line: 2431, baseType: !472, size: 192)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !805, file: !18, line: 2433, baseType: !433, size: 64, offset: 192)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !805, file: !18, line: 2434, baseType: !433, size: 64, offset: 256)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !805, file: !18, line: 2435, baseType: !433, size: 64, offset: 320)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !805, file: !18, line: 2436, baseType: !433, size: 64, offset: 384)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "base_accesses", scope: !805, file: !18, line: 2437, baseType: !788, size: 64, offset: 448)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "inheritance", scope: !805, file: !18, line: 2438, baseType: !433, size: 64, offset: 512)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_subvtt", scope: !805, file: !18, line: 2440, baseType: !433, size: 64, offset: 576)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_vptr", scope: !805, file: !18, line: 2441, baseType: !433, size: 64, offset: 640)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "base_binfos", scope: !805, file: !18, line: 2443, baseType: !817, size: 128, offset: 704)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_none", file: !18, line: 182, baseType: !818)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_none", file: !18, line: 182, size: 128, elements: !819)
!819 = !{!820}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !818, file: !18, line: 182, baseType: !793, size: 128)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "stmt_list", scope: !436, file: !18, line: 3401, baseType: !822, size: 320)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list", file: !18, line: 3327, size: 320, elements: !823)
!823 = !{!824, !825, !832}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !822, file: !18, line: 3329, baseType: !472, size: 192)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !822, file: !18, line: 3330, baseType: !826, size: 64, offset: 192)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list_node", file: !18, line: 3320, size: 192, elements: !828)
!828 = !{!829, !830, !831}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !827, file: !18, line: 3322, baseType: !826, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !827, file: !18, line: 3323, baseType: !826, size: 64, offset: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !827, file: !18, line: 3324, baseType: !433, size: 64, offset: 128)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !822, file: !18, line: 3331, baseType: !826, size: 64, offset: 256)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "constructor", scope: !436, file: !18, line: 3402, baseType: !834, size: 256)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_constructor", file: !18, line: 1540, size: 256, elements: !835)
!835 = !{!836, !837}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !834, file: !18, line: 1541, baseType: !472, size: 192)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !834, file: !18, line: 1542, baseType: !838, size: 64, offset: 192)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_gc", file: !18, line: 1538, baseType: !840)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_gc", file: !18, line: 1538, size: 192, elements: !841)
!841 = !{!842}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !840, file: !18, line: 1538, baseType: !843, size: 192)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_base", file: !18, line: 1537, baseType: !844)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_base", file: !18, line: 1537, size: 192, elements: !845)
!845 = !{!846, !847, !848}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !844, file: !18, line: 1537, baseType: !7, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !844, file: !18, line: 1537, baseType: !7, size: 32, offset: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !844, file: !18, line: 1537, baseType: !849, size: 128, offset: 64)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !850, size: 128, elements: !359)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "constructor_elt", file: !18, line: 1535, baseType: !851)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "constructor_elt_d", file: !18, line: 1532, size: 128, elements: !852)
!852 = !{!853, !854}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !851, file: !18, line: 1533, baseType: !433, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !851, file: !18, line: 1534, baseType: !433, size: 64, offset: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "omp_clause", scope: !436, file: !18, line: 3403, baseType: !856, size: 512)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_omp_clause", file: !18, line: 1938, size: 512, elements: !857)
!857 = !{!858, !859, !860, !861, !867, !871, !872}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !856, file: !18, line: 1939, baseType: !472, size: 192)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !856, file: !18, line: 1940, baseType: !427, size: 32, offset: 192)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !856, file: !18, line: 1941, baseType: !17, size: 32, offset: 224)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !856, file: !18, line: 1946, baseType: !862, size: 32, offset: 256)
!862 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "omp_clause_subcode", file: !18, line: 1942, size: 32, elements: !863)
!863 = !{!864, !865, !866}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "default_kind", scope: !862, file: !18, line: 1943, baseType: !36, size: 32)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "schedule_kind", scope: !862, file: !18, line: 1944, baseType: !43, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "reduction_code", scope: !862, file: !18, line: 1945, baseType: !50, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reduction_init", scope: !856, file: !18, line: 1950, baseType: !868, size: 64, offset: 320)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !434, line: 66, baseType: !869)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !434, line: 65, flags: DIFlagFwdDecl)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reduction_merge", scope: !856, file: !18, line: 1951, baseType: !868, size: 64, offset: 384)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !856, file: !18, line: 1953, baseType: !746, size: 64, offset: 448)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "optimization", scope: !436, file: !18, line: 3404, baseType: !874, size: 1664)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_optimization_option", file: !18, line: 3337, size: 1664, elements: !875)
!875 = !{!876, !877}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !874, file: !18, line: 3338, baseType: !472, size: 192)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !874, file: !18, line: 3341, baseType: !878, size: 1472, offset: 192)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cl_optimization", file: !879, line: 410, size: 1472, elements: !880)
!879 = !DIFile(filename: "./options.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!880 = !{!881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "align_functions", scope: !878, file: !879, line: 412, baseType: !263, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "align_jumps", scope: !878, file: !879, line: 413, baseType: !263, size: 32, offset: 32)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "align_labels", scope: !878, file: !879, line: 414, baseType: !263, size: 32, offset: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "align_loops", scope: !878, file: !879, line: 415, baseType: !263, size: 32, offset: 96)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_stalled_insns", scope: !878, file: !879, line: 416, baseType: !263, size: 32, offset: 128)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_stalled_insns_dep", scope: !878, file: !879, line: 417, baseType: !263, size: 32, offset: 160)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "optimize", scope: !878, file: !879, line: 418, baseType: !262, size: 8, offset: 192)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_size", scope: !878, file: !879, line: 419, baseType: !262, size: 8, offset: 200)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "flag_argument_noalias", scope: !878, file: !879, line: 420, baseType: !356, size: 8, offset: 208)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "flag_asynchronous_unwind_tables", scope: !878, file: !879, line: 421, baseType: !356, size: 8, offset: 216)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_on_count_reg", scope: !878, file: !879, line: 422, baseType: !356, size: 8, offset: 224)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_probabilities", scope: !878, file: !879, line: 423, baseType: !356, size: 8, offset: 232)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_target_load_optimize", scope: !878, file: !879, line: 424, baseType: !356, size: 8, offset: 240)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_target_load_optimize2", scope: !878, file: !879, line: 425, baseType: !356, size: 8, offset: 248)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "flag_btr_bb_exclusive", scope: !878, file: !879, line: 426, baseType: !356, size: 8, offset: 256)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "flag_caller_saves", scope: !878, file: !879, line: 427, baseType: !356, size: 8, offset: 264)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "flag_no_common", scope: !878, file: !879, line: 428, baseType: !356, size: 8, offset: 272)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "flag_conserve_stack", scope: !878, file: !879, line: 429, baseType: !356, size: 8, offset: 280)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cprop_registers", scope: !878, file: !879, line: 430, baseType: !356, size: 8, offset: 288)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "flag_crossjumping", scope: !878, file: !879, line: 431, baseType: !356, size: 8, offset: 296)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cse_follow_jumps", scope: !878, file: !879, line: 432, baseType: !356, size: 8, offset: 304)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cx_fortran_rules", scope: !878, file: !879, line: 433, baseType: !356, size: 8, offset: 312)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cx_limited_range", scope: !878, file: !879, line: 434, baseType: !356, size: 8, offset: 320)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "flag_data_sections", scope: !878, file: !879, line: 435, baseType: !356, size: 8, offset: 328)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "flag_dce", scope: !878, file: !879, line: 436, baseType: !356, size: 8, offset: 336)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "flag_defer_pop", scope: !878, file: !879, line: 437, baseType: !356, size: 8, offset: 344)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "flag_delayed_branch", scope: !878, file: !879, line: 438, baseType: !356, size: 8, offset: 352)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "flag_delete_null_pointer_checks", scope: !878, file: !879, line: 439, baseType: !356, size: 8, offset: 360)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "flag_dse", scope: !878, file: !879, line: 440, baseType: !356, size: 8, offset: 368)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "flag_early_inlining", scope: !878, file: !879, line: 441, baseType: !356, size: 8, offset: 376)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "flag_exceptions", scope: !878, file: !879, line: 442, baseType: !356, size: 8, offset: 384)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "flag_expensive_optimizations", scope: !878, file: !879, line: 443, baseType: !356, size: 8, offset: 392)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "flag_finite_math_only", scope: !878, file: !879, line: 444, baseType: !356, size: 8, offset: 400)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "flag_float_store", scope: !878, file: !879, line: 445, baseType: !356, size: 8, offset: 408)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "flag_forward_propagate", scope: !878, file: !879, line: 446, baseType: !356, size: 8, offset: 416)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse", scope: !878, file: !879, line: 447, baseType: !356, size: 8, offset: 424)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_after_reload", scope: !878, file: !879, line: 448, baseType: !356, size: 8, offset: 432)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_las", scope: !878, file: !879, line: 449, baseType: !356, size: 8, offset: 440)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_lm", scope: !878, file: !879, line: 450, baseType: !356, size: 8, offset: 448)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_sm", scope: !878, file: !879, line: 451, baseType: !356, size: 8, offset: 456)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "flag_graphite_identity", scope: !878, file: !879, line: 452, baseType: !356, size: 8, offset: 464)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "flag_guess_branch_prob", scope: !878, file: !879, line: 453, baseType: !356, size: 8, offset: 472)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "flag_if_conversion", scope: !878, file: !879, line: 454, baseType: !356, size: 8, offset: 480)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "flag_if_conversion2", scope: !878, file: !879, line: 455, baseType: !356, size: 8, offset: 488)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_functions", scope: !878, file: !879, line: 456, baseType: !356, size: 8, offset: 496)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_functions_called_once", scope: !878, file: !879, line: 457, baseType: !356, size: 8, offset: 504)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_small_functions", scope: !878, file: !879, line: 458, baseType: !356, size: 8, offset: 512)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_cp", scope: !878, file: !879, line: 459, baseType: !356, size: 8, offset: 520)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_cp_clone", scope: !878, file: !879, line: 460, baseType: !356, size: 8, offset: 528)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_matrix_reorg", scope: !878, file: !879, line: 461, baseType: !356, size: 8, offset: 536)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_pta", scope: !878, file: !879, line: 462, baseType: !356, size: 8, offset: 544)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_pure_const", scope: !878, file: !879, line: 463, baseType: !356, size: 8, offset: 552)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_reference", scope: !878, file: !879, line: 464, baseType: !356, size: 8, offset: 560)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_sra", scope: !878, file: !879, line: 465, baseType: !356, size: 8, offset: 568)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_type_escape", scope: !878, file: !879, line: 466, baseType: !356, size: 8, offset: 576)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ivopts", scope: !878, file: !879, line: 467, baseType: !356, size: 8, offset: 584)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "flag_jump_tables", scope: !878, file: !879, line: 468, baseType: !356, size: 8, offset: 592)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_block", scope: !878, file: !879, line: 469, baseType: !356, size: 8, offset: 600)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_interchange", scope: !878, file: !879, line: 470, baseType: !356, size: 8, offset: 608)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_parallelize_all", scope: !878, file: !879, line: 471, baseType: !356, size: 8, offset: 616)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_strip_mine", scope: !878, file: !879, line: 472, baseType: !356, size: 8, offset: 624)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "flag_lto_report", scope: !878, file: !879, line: 473, baseType: !356, size: 8, offset: 632)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ltrans", scope: !878, file: !879, line: 474, baseType: !356, size: 8, offset: 640)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "flag_errno_math", scope: !878, file: !879, line: 475, baseType: !356, size: 8, offset: 648)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "flag_merge_constants", scope: !878, file: !879, line: 476, baseType: !356, size: 8, offset: 656)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "flag_modulo_sched", scope: !878, file: !879, line: 477, baseType: !356, size: 8, offset: 664)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "flag_move_loop_invariants", scope: !878, file: !879, line: 478, baseType: !356, size: 8, offset: 672)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "flag_non_call_exceptions", scope: !878, file: !879, line: 479, baseType: !356, size: 8, offset: 680)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "flag_omit_frame_pointer", scope: !878, file: !879, line: 480, baseType: !356, size: 8, offset: 688)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "flag_regmove", scope: !878, file: !879, line: 481, baseType: !356, size: 8, offset: 696)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "flag_optimize_sibling_calls", scope: !878, file: !879, line: 482, baseType: !356, size: 8, offset: 704)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "flag_pack_struct", scope: !878, file: !879, line: 483, baseType: !356, size: 8, offset: 712)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "flag_peel_loops", scope: !878, file: !879, line: 484, baseType: !356, size: 8, offset: 720)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "flag_no_peephole", scope: !878, file: !879, line: 485, baseType: !356, size: 8, offset: 728)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "flag_peephole2", scope: !878, file: !879, line: 486, baseType: !356, size: 8, offset: 736)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "flag_predictive_commoning", scope: !878, file: !879, line: 487, baseType: !356, size: 8, offset: 744)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "flag_prefetch_loop_arrays", scope: !878, file: !879, line: 488, baseType: !356, size: 8, offset: 752)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "flag_pcc_struct_return", scope: !878, file: !879, line: 489, baseType: !356, size: 8, offset: 760)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "flag_rename_registers", scope: !878, file: !879, line: 490, baseType: !356, size: 8, offset: 768)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "flag_reorder_blocks", scope: !878, file: !879, line: 491, baseType: !356, size: 8, offset: 776)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "flag_reorder_blocks_and_partition", scope: !878, file: !879, line: 492, baseType: !356, size: 8, offset: 784)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "flag_reorder_functions", scope: !878, file: !879, line: 493, baseType: !356, size: 8, offset: 792)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "flag_rerun_cse_after_loop", scope: !878, file: !879, line: 494, baseType: !356, size: 8, offset: 800)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "flag_resched_modulo_sched", scope: !878, file: !879, line: 495, baseType: !356, size: 8, offset: 808)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "flag_rounding_math", scope: !878, file: !879, line: 496, baseType: !356, size: 8, offset: 816)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_critical_path_heuristic", scope: !878, file: !879, line: 497, baseType: !356, size: 8, offset: 824)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_dep_count_heuristic", scope: !878, file: !879, line: 498, baseType: !356, size: 8, offset: 832)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_group_heuristic", scope: !878, file: !879, line: 499, baseType: !356, size: 8, offset: 840)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_interblock", scope: !878, file: !879, line: 500, baseType: !356, size: 8, offset: 848)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_last_insn_heuristic", scope: !878, file: !879, line: 501, baseType: !356, size: 8, offset: 856)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_pressure", scope: !878, file: !879, line: 502, baseType: !356, size: 8, offset: 864)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_rank_heuristic", scope: !878, file: !879, line: 503, baseType: !356, size: 8, offset: 872)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_speculative", scope: !878, file: !879, line: 504, baseType: !356, size: 8, offset: 880)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_spec_insn_heuristic", scope: !878, file: !879, line: 505, baseType: !356, size: 8, offset: 888)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_speculative_load", scope: !878, file: !879, line: 506, baseType: !356, size: 8, offset: 896)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_speculative_load_dangerous", scope: !878, file: !879, line: 507, baseType: !356, size: 8, offset: 904)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched2_use_superblocks", scope: !878, file: !879, line: 508, baseType: !356, size: 8, offset: 912)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_insns", scope: !878, file: !879, line: 509, baseType: !356, size: 8, offset: 920)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_insns_after_reload", scope: !878, file: !879, line: 510, baseType: !356, size: 8, offset: 928)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "flag_section_anchors", scope: !878, file: !879, line: 511, baseType: !356, size: 8, offset: 936)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sel_sched_pipelining", scope: !878, file: !879, line: 512, baseType: !356, size: 8, offset: 944)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sel_sched_pipelining_outer_loops", scope: !878, file: !879, line: 513, baseType: !356, size: 8, offset: 952)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sel_sched_reschedule_pipelined", scope: !878, file: !879, line: 514, baseType: !356, size: 8, offset: 960)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "flag_selective_scheduling", scope: !878, file: !879, line: 515, baseType: !356, size: 8, offset: 968)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "flag_selective_scheduling2", scope: !878, file: !879, line: 516, baseType: !356, size: 8, offset: 976)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "flag_signaling_nans", scope: !878, file: !879, line: 517, baseType: !356, size: 8, offset: 984)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "flag_signed_zeros", scope: !878, file: !879, line: 518, baseType: !356, size: 8, offset: 992)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "flag_single_precision_constant", scope: !878, file: !879, line: 519, baseType: !356, size: 8, offset: 1000)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "flag_split_ivs_in_unroller", scope: !878, file: !879, line: 520, baseType: !356, size: 8, offset: 1008)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "flag_split_wide_types", scope: !878, file: !879, line: 521, baseType: !356, size: 8, offset: 1016)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "flag_strict_aliasing", scope: !878, file: !879, line: 522, baseType: !356, size: 8, offset: 1024)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "flag_thread_jumps", scope: !878, file: !879, line: 523, baseType: !356, size: 8, offset: 1032)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "flag_toplevel_reorder", scope: !878, file: !879, line: 524, baseType: !356, size: 8, offset: 1040)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "flag_trapping_math", scope: !878, file: !879, line: 525, baseType: !356, size: 8, offset: 1048)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "flag_trapv", scope: !878, file: !879, line: 526, baseType: !356, size: 8, offset: 1056)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_builtin_call_dce", scope: !878, file: !879, line: 527, baseType: !356, size: 8, offset: 1064)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_ccp", scope: !878, file: !879, line: 528, baseType: !356, size: 8, offset: 1072)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_ch", scope: !878, file: !879, line: 529, baseType: !356, size: 8, offset: 1080)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_copy_prop", scope: !878, file: !879, line: 530, baseType: !356, size: 8, offset: 1088)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_copyrename", scope: !878, file: !879, line: 531, baseType: !356, size: 8, offset: 1096)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_cselim", scope: !878, file: !879, line: 532, baseType: !356, size: 8, offset: 1104)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_dce", scope: !878, file: !879, line: 533, baseType: !356, size: 8, offset: 1112)
