; ModuleID = 'dojump.bc'
source_filename = "dojump.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.rtl_data = type { %struct.expr_status, %struct.emit_status, %struct.varasm_status, %struct.incoming_args, %struct.function_subsections, %struct.rtl_eh, i32, %struct.rtx_def*, %struct.initial_value_struct*, %union.tree_node*, %struct.rtx_def*, %struct.rtx_def*, %struct.rtx_def*, %struct.rtx_def*, %struct.rtx_def*, %struct.rtx_def*, %struct.rtx_def*, i64, %struct.rtx_def*, %struct.VEC_temp_slot_p_gc*, %struct.temp_slot*, i32, i32, i32, i32, i32, i32, %struct.rtx_def*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.expr_status = type { i32, i32, i32, %struct.rtx_def*, %struct.rtx_def*, %struct.rtx_def* }
%struct.emit_status = type { i32, i32, %struct.rtx_def*, %struct.rtx_def*, %struct.sequence_stack*, i32, i32, i32, i32, i8* }
%struct.sequence_stack = type { %struct.rtx_def*, %struct.rtx_def*, %struct.sequence_stack* }
%struct.varasm_status = type { %struct.rtx_constant_pool*, i32 }

!475 = !DIEnumerator(name: "UMAX", value: 73, isUnsigned: true)
!476 = !DIEnumerator(name: "PRE_DEC", value: 74, isUnsigned: true)
!477 = !DIEnumerator(name: "PRE_INC", value: 75, isUnsigned: true)
!478 = !DIEnumerator(name: "POST_DEC", value: 76, isUnsigned: true)
!479 = !DIEnumerator(name: "POST_INC", value: 77, isUnsigned: true)
!480 = !DIEnumerator(name: "PRE_MODIFY", value: 78, isUnsigned: true)
!481 = !DIEnumerator(name: "POST_MODIFY", value: 79, isUnsigned: true)
!482 = !DIEnumerator(name: "NE", value: 80, isUnsigned: true)
!483 = !DIEnumerator(name: "EQ", value: 81, isUnsigned: true)
!484 = !DIEnumerator(name: "GE", value: 82, isUnsigned: true)
!485 = !DIEnumerator(name: "GT", value: 83, isUnsigned: true)
!486 = !DIEnumerator(name: "LE", value: 84, isUnsigned: true)
!487 = !DIEnumerator(name: "LT", value: 85, isUnsigned: true)
!488 = !DIEnumerator(name: "GEU", value: 86, isUnsigned: true)
!489 = !DIEnumerator(name: "GTU", value: 87, isUnsigned: true)
!490 = !DIEnumerator(name: "LEU", value: 88, isUnsigned: true)
!491 = !DIEnumerator(name: "LTU", value: 89, isUnsigned: true)
!492 = !DIEnumerator(name: "UNORDERED", value: 90, isUnsigned: true)
!493 = !DIEnumerator(name: "ORDERED", value: 91, isUnsigned: true)
!494 = !DIEnumerator(name: "UNEQ", value: 92, isUnsigned: true)
!495 = !DIEnumerator(name: "UNGE", value: 93, isUnsigned: true)
!496 = !DIEnumerator(name: "UNGT", value: 94, isUnsigned: true)
!497 = !DIEnumerator(name: "UNLE", value: 95, isUnsigned: true)
!498 = !DIEnumerator(name: "UNLT", value: 96, isUnsigned: true)
!499 = !DIEnumerator(name: "LTGT", value: 97, isUnsigned: true)
!500 = !DIEnumerator(name: "SIGN_EXTEND", value: 98, isUnsigned: true)
!501 = !DIEnumerator(name: "ZERO_EXTEND", value: 99, isUnsigned: true)
!502 = !DIEnumerator(name: "TRUNCATE", value: 100, isUnsigned: true)
!503 = !DIEnumerator(name: "FLOAT_EXTEND", value: 101, isUnsigned: true)
!504 = !DIEnumerator(name: "FLOAT_TRUNCATE", value: 102, isUnsigned: true)
!505 = !DIEnumerator(name: "FLOAT", value: 103, isUnsigned: true)
!506 = !DIEnumerator(name: "FIX", value: 104, isUnsigned: true)
!507 = !DIEnumerator(name: "UNSIGNED_FLOAT", value: 105, isUnsigned: true)
!508 = !DIEnumerator(name: "UNSIGNED_FIX", value: 106, isUnsigned: true)
!509 = !DIEnumerator(name: "FRACT_CONVERT", value: 107, isUnsigned: true)
!510 = !DIEnumerator(name: "UNSIGNED_FRACT_CONVERT", value: 108, isUnsigned: true)
!511 = !DIEnumerator(name: "SAT_FRACT", value: 109, isUnsigned: true)
!512 = !DIEnumerator(name: "UNSIGNED_SAT_FRACT", value: 110, isUnsigned: true)
!513 = !DIEnumerator(name: "ABS", value: 111, isUnsigned: true)
!514 = !DIEnumerator(name: "SQRT", value: 112, isUnsigned: true)
!515 = !DIEnumerator(name: "BSWAP", value: 113, isUnsigned: true)
!516 = !DIEnumerator(name: "FFS", value: 114, isUnsigned: true)
!517 = !DIEnumerator(name: "CLZ", value: 115, isUnsigned: true)
!518 = !DIEnumerator(name: "CTZ", value: 116, isUnsigned: true)
!519 = !DIEnumerator(name: "POPCOUNT", value: 117, isUnsigned: true)
!520 = !DIEnumerator(name: "PARITY", value: 118, isUnsigned: true)
!521 = !DIEnumerator(name: "SIGN_EXTRACT", value: 119, isUnsigned: true)
!522 = !DIEnumerator(name: "ZERO_EXTRACT", value: 120, isUnsigned: true)
!523 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!524 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!525 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!526 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!527 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!528 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!529 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!530 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!531 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!532 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!533 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!534 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!535 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!536 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!537 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!538 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!539 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!540 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!541 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!542 = !{!543, !544, !545, !546, !549, !550, !552, !377, !183, !790, !622, !399, !5, !1622}
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!545 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !548)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !553, line: 50, baseType: !554)
!553 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !400, line: 240, size: 384, elements: !556)
!556 = !{!557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !555, file: !400, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !555, file: !400, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !555, file: !400, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !555, file: !400, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !555, file: !400, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !555, file: !400, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !555, file: !400, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !555, file: !400, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !555, file: !400, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !555, file: !400, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !555, file: !400, line: 321, baseType: !568, size: 320, offset: 64)
!568 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !400, line: 315, size: 320, elements: !569)
!569 = !{!570, !1557, !1559, !1620, !1621}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !568, file: !400, line: 316, baseType: !571, size: 64)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !572, size: 64, elements: !587)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !400, line: 183, baseType: !573)
!573 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !400, line: 166, size: 64, elements: !574)
!574 = !{!575, !576, !577, !578, !579, !589, !590, !602, !605, !667, !1535, !1536, !1547, !1554}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !573, file: !400, line: 168, baseType: !545, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !573, file: !400, line: 169, baseType: !7, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !573, file: !400, line: 170, baseType: !550, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !573, file: !400, line: 171, baseType: !552, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !573, file: !400, line: 172, baseType: !580, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !553, line: 53, baseType: !581)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !400, line: 359, size: 128, elements: !583)
!583 = !{!584, !585}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !582, file: !400, line: 360, baseType: !545, size: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !582, file: !400, line: 361, baseType: !586, size: 64, offset: 64)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !552, size: 64, elements: !587)
!587 = !{!588}
!588 = !DISubrange(count: 1)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !573, file: !400, line: 173, baseType: !5, size: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !573, file: !400, line: 174, baseType: !591, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !400, line: 133, baseType: !592)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !400, line: 115, size: 32, elements: !593)
!593 = !{!594, !595, !596, !597, !598, !599, !600, !601}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !592, file: !400, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !592, file: !400, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !592, file: !400, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !592, file: !400, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !592, file: !400, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !592, file: !400, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !592, file: !400, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !592, file: !400, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !573, file: !400, line: 175, baseType: !603, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !400, line: 175, flags: DIFlagFwdDecl)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !573, file: !400, line: 176, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !608, line: 75, size: 256, elements: !609)
!608 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!609 = !{!610, !625, !626, !627}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !607, file: !608, line: 76, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !608, line: 68, baseType: !613)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !608, line: 63, size: 320, elements: !614)
!614 = !{!615, !617, !618, !619}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !613, file: !608, line: 64, baseType: !616, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !613, file: !608, line: 65, baseType: !616, size: 64, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !613, file: !608, line: 66, baseType: !7, size: 32, offset: 128)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !613, file: !608, line: 67, baseType: !620, size: 128, offset: 192)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !621, size: 128, elements: !623)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !608, line: 29, baseType: !622)
!622 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!623 = !{!624}
!624 = !DISubrange(count: 2)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !607, file: !608, line: 77, baseType: !611, size: 64, offset: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !607, file: !608, line: 78, baseType: !7, size: 32, offset: 128)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !607, file: !608, line: 79, baseType: !628, size: 64, offset: 192)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !608, line: 49, baseType: !630)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !608, line: 45, size: 832, elements: !631)
!631 = !{!632, !633, !634}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !630, file: !608, line: 46, baseType: !616, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !630, file: !608, line: 47, baseType: !606, size: 64, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !630, file: !608, line: 48, baseType: !635, size: 704, offset: 128)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !636, line: 164, size: 704, elements: !637)
!636 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!637 = !{!638, !640, !650, !651, !652, !653, !654, !655, !659, !663, !664, !665, !666}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !635, file: !636, line: 166, baseType: !639, size: 64)
!639 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !635, file: !636, line: 167, baseType: !641, size: 64, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !636, line: 157, size: 192, elements: !643)
!643 = !{!644, !645, !646}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !642, file: !636, line: 159, baseType: !547, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !642, file: !636, line: 160, baseType: !641, size: 64, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !642, file: !636, line: 161, baseType: !647, size: 32, offset: 128)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !548, size: 32, elements: !648)
!648 = !{!649}
!649 = !DISubrange(count: 4)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !635, file: !636, line: 168, baseType: !547, size: 64, offset: 128)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !635, file: !636, line: 169, baseType: !547, size: 64, offset: 192)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !635, file: !636, line: 170, baseType: !547, size: 64, offset: 256)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !635, file: !636, line: 171, baseType: !639, size: 64, offset: 320)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !635, file: !636, line: 172, baseType: !545, size: 32, offset: 384)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !635, file: !636, line: 176, baseType: !656, size: 64, offset: 448)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{!641, !549, !639}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !635, file: !636, line: 177, baseType: !660, size: 64, offset: 512)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{null, !549, !641}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !635, file: !636, line: 178, baseType: !549, size: 64, offset: 576)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !635, file: !636, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !635, file: !636, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !635, file: !636, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !573, file: !400, line: 177, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !553, line: 56, baseType: !669)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !151, line: 3371, size: 1792, elements: !671)
!671 = !{!672, !705, !711, !722, !741, !752, !757, !764, !770, !783, !795, !833, !838, !866, !874, !875, !880, !889, !895, !900, !904, !908, !1159, !1208, !1214, !1221, !1228, !1254, !1279, !1296, !1308, !1330, !1345, !1517}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !670, file: !151, line: 3372, baseType: !673, size: 64)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !151, line: 360, size: 64, elements: !674)
!674 = !{!675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !673, file: !151, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !673, file: !151, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !673, file: !151, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !673, file: !151, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !673, file: !151, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !673, file: !151, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !673, file: !151, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !673, file: !151, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !673, file: !151, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !673, file: !151, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !673, file: !151, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !673, file: !151, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !673, file: !151, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !673, file: !151, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !673, file: !151, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !673, file: !151, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !673, file: !151, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !673, file: !151, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !673, file: !151, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !673, file: !151, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !673, file: !151, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !673, file: !151, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !673, file: !151, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !673, file: !151, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !673, file: !151, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !673, file: !151, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !673, file: !151, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !673, file: !151, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !673, file: !151, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !673, file: !151, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !670, file: !151, line: 3373, baseType: !706, size: 192)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !151, line: 402, size: 192, elements: !707)
!707 = !{!708, !709, !710}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !706, file: !151, line: 403, baseType: !673, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !706, file: !151, line: 404, baseType: !668, size: 64, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !706, file: !151, line: 405, baseType: !668, size: 64, offset: 128)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !670, file: !151, line: 3374, baseType: !712, size: 320)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !151, line: 1384, size: 320, elements: !713)
!713 = !{!714, !715}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !712, file: !151, line: 1385, baseType: !706, size: 192)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !712, file: !151, line: 1386, baseType: !716, size: 128, offset: 192)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !717, line: 58, baseType: !718)
!717 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !717, line: 54, size: 128, elements: !719)
!719 = !{!720, !721}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !718, file: !717, line: 56, baseType: !622, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !718, file: !717, line: 57, baseType: !639, size: 64, offset: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !670, file: !151, line: 3375, baseType: !723, size: 256)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !151, line: 1397, size: 256, elements: !724)
!724 = !{!725, !726}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !723, file: !151, line: 1398, baseType: !706, size: 192)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !723, file: !151, line: 1399, baseType: !727, size: 64, offset: 192)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !729, line: 52, size: 256, elements: !730)
!729 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!730 = !{!731, !732, !733, !734, !735, !736, !737}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !728, file: !729, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !728, file: !729, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !728, file: !729, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !728, file: !729, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !728, file: !729, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !728, file: !729, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !728, file: !729, line: 62, baseType: !738, size: 192, offset: 64)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 192, elements: !739)
!739 = !{!740}
!740 = !DISubrange(count: 3)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !670, file: !151, line: 3376, baseType: !742, size: 256)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !151, line: 1408, size: 256, elements: !743)
!743 = !{!744, !745}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !742, file: !151, line: 1409, baseType: !706, size: 192)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !742, file: !151, line: 1410, baseType: !746, size: 64, offset: 192)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !748, line: 27, size: 192, elements: !749)
!748 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!749 = !{!750, !751}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !747, file: !748, line: 29, baseType: !716, size: 128)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !747, file: !748, line: 30, baseType: !5, size: 32, offset: 128)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !670, file: !151, line: 3377, baseType: !753, size: 256)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !151, line: 1437, size: 256, elements: !754)
!754 = !{!755, !756}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !753, file: !151, line: 1438, baseType: !706, size: 192)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !753, file: !151, line: 1439, baseType: !668, size: 64, offset: 192)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !670, file: !151, line: 3378, baseType: !758, size: 256)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !151, line: 1418, size: 256, elements: !759)
!759 = !{!760, !761, !762}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !758, file: !151, line: 1419, baseType: !706, size: 192)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !758, file: !151, line: 1420, baseType: !545, size: 32, offset: 192)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !758, file: !151, line: 1421, baseType: !763, size: 8, offset: 224)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !548, size: 8, elements: !587)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !670, file: !151, line: 3379, baseType: !765, size: 320)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !151, line: 1428, size: 320, elements: !766)
!766 = !{!767, !768, !769}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !765, file: !151, line: 1429, baseType: !706, size: 192)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !765, file: !151, line: 1430, baseType: !668, size: 64, offset: 192)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !765, file: !151, line: 1431, baseType: !668, size: 64, offset: 256)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !670, file: !151, line: 3380, baseType: !771, size: 320)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !151, line: 1460, size: 320, elements: !772)
!772 = !{!773, !774}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !771, file: !151, line: 1461, baseType: !706, size: 192)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !771, file: !151, line: 1462, baseType: !775, size: 128, offset: 192)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !776, line: 31, size: 128, elements: !777)
!776 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!777 = !{!778, !781, !782}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !775, file: !776, line: 32, baseType: !779, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !544)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !775, file: !776, line: 33, baseType: !7, size: 32, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !775, file: !776, line: 34, baseType: !7, size: 32, offset: 96)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !670, file: !151, line: 3381, baseType: !784, size: 384)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !151, line: 2507, size: 384, elements: !785)
!785 = !{!786, !787, !792, !793, !794}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !784, file: !151, line: 2508, baseType: !706, size: 192)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !784, file: !151, line: 2509, baseType: !788, size: 32, offset: 192)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !789, line: 58, baseType: !790)
!789 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !791, line: 44, baseType: !7)
!791 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!792 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !784, file: !151, line: 2510, baseType: !7, size: 32, offset: 224)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !784, file: !151, line: 2511, baseType: !668, size: 64, offset: 256)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !784, file: !151, line: 2512, baseType: !668, size: 64, offset: 320)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !670, file: !151, line: 3382, baseType: !796, size: 896)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !151, line: 2652, size: 896, elements: !797)
!797 = !{!798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !796, file: !151, line: 2653, baseType: !784, size: 384)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !796, file: !151, line: 2654, baseType: !668, size: 64, offset: 384)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !796, file: !151, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !796, file: !151, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !796, file: !151, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !796, file: !151, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !796, file: !151, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !796, file: !151, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !796, file: !151, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !796, file: !151, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !796, file: !151, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !796, file: !151, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !796, file: !151, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !796, file: !151, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !796, file: !151, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !796, file: !151, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !796, file: !151, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !796, file: !151, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !796, file: !151, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !796, file: !151, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !796, file: !151, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !796, file: !151, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !796, file: !151, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !796, file: !151, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !796, file: !151, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !796, file: !151, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !796, file: !151, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !796, file: !151, line: 2703, baseType: !7, size: 32, offset: 512)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !796, file: !151, line: 2705, baseType: !668, size: 64, offset: 576)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !796, file: !151, line: 2706, baseType: !668, size: 64, offset: 640)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !796, file: !151, line: 2707, baseType: !668, size: 64, offset: 704)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !796, file: !151, line: 2708, baseType: !668, size: 64, offset: 768)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !796, file: !151, line: 2711, baseType: !831, size: 64, offset: 832)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !151, line: 2711, flags: DIFlagFwdDecl)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !670, file: !151, line: 3383, baseType: !834, size: 960)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !151, line: 2756, size: 960, elements: !835)
!835 = !{!836, !837}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !834, file: !151, line: 2757, baseType: !796, size: 896)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !834, file: !151, line: 2758, baseType: !552, size: 64, offset: 896)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !670, file: !151, line: 3384, baseType: !839, size: 1472)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !151, line: 3114, size: 1472, elements: !840)
!840 = !{!841, !862, !863, !864, !865}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !839, file: !151, line: 3115, baseType: !842, size: 1216)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !151, line: 2984, size: 1216, elements: !843)
!843 = !{!844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !842, file: !151, line: 2985, baseType: !834, size: 960)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !842, file: !151, line: 2986, baseType: !668, size: 64, offset: 960)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !842, file: !151, line: 2987, baseType: !668, size: 64, offset: 1024)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !842, file: !151, line: 2988, baseType: !668, size: 64, offset: 1088)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !842, file: !151, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !842, file: !151, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !842, file: !151, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !842, file: !151, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !842, file: !151, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !842, file: !151, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !842, file: !151, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !842, file: !151, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !842, file: !151, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !842, file: !151, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !842, file: !151, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !842, file: !151, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !842, file: !151, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !842, file: !151, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !839, file: !151, line: 3117, baseType: !668, size: 64, offset: 1216)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !839, file: !151, line: 3119, baseType: !668, size: 64, offset: 1280)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !839, file: !151, line: 3121, baseType: !668, size: 64, offset: 1344)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !839, file: !151, line: 3123, baseType: !668, size: 64, offset: 1408)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !670, file: !151, line: 3385, baseType: !867, size: 1088)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !151, line: 2874, size: 1088, elements: !868)
!868 = !{!869, !870, !871}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !867, file: !151, line: 2875, baseType: !834, size: 960)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !867, file: !151, line: 2876, baseType: !552, size: 64, offset: 960)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !867, file: !151, line: 2877, baseType: !872, size: 64, offset: 1024)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !151, line: 2856, flags: DIFlagFwdDecl)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !670, file: !151, line: 3386, baseType: !842, size: 1216)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !670, file: !151, line: 3387, baseType: !876, size: 1280)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !151, line: 3093, size: 1280, elements: !877)
!877 = !{!878, !879}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !876, file: !151, line: 3094, baseType: !842, size: 1216)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !876, file: !151, line: 3095, baseType: !872, size: 64, offset: 1216)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !670, file: !151, line: 3388, baseType: !881, size: 1216)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !151, line: 2824, size: 1216, elements: !882)
!882 = !{!883, !884, !885, !886, !887, !888}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !881, file: !151, line: 2825, baseType: !796, size: 896)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !881, file: !151, line: 2827, baseType: !668, size: 64, offset: 896)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !881, file: !151, line: 2828, baseType: !668, size: 64, offset: 960)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !881, file: !151, line: 2829, baseType: !668, size: 64, offset: 1024)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !881, file: !151, line: 2830, baseType: !668, size: 64, offset: 1088)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !881, file: !151, line: 2831, baseType: !668, size: 64, offset: 1152)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !670, file: !151, line: 3389, baseType: !890, size: 1024)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !151, line: 2850, size: 1024, elements: !891)
!891 = !{!892, !893, !894}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !890, file: !151, line: 2851, baseType: !834, size: 960)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !890, file: !151, line: 2852, baseType: !545, size: 32, offset: 960)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !890, file: !151, line: 2853, baseType: !545, size: 32, offset: 992)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !670, file: !151, line: 3390, baseType: !896, size: 1024)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !151, line: 2857, size: 1024, elements: !897)
!897 = !{!898, !899}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !896, file: !151, line: 2858, baseType: !834, size: 960)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !896, file: !151, line: 2859, baseType: !872, size: 64, offset: 960)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !670, file: !151, line: 3391, baseType: !901, size: 960)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !151, line: 2862, size: 960, elements: !902)
!902 = !{!903}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !901, file: !151, line: 2863, baseType: !834, size: 960)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !670, file: !151, line: 3392, baseType: !905, size: 1472)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !151, line: 3304, size: 1472, elements: !906)
!906 = !{!907}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !905, file: !151, line: 3305, baseType: !839, size: 1472)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !670, file: !151, line: 3393, baseType: !909, size: 1792)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !151, line: 3248, size: 1792, elements: !910)
!910 = !{!911, !912, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !909, file: !151, line: 3249, baseType: !839, size: 1472)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !909, file: !151, line: 3251, baseType: !913, size: 64, offset: 1472)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !915, line: 463, size: 1152, elements: !916)
!915 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!916 = !{!917, !920, !1024, !1025, !1028, !1031, !1083, !1084, !1085, !1086, !1087, !1111, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !914, file: !915, line: 464, baseType: !918, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !915, line: 464, flags: DIFlagFwdDecl)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !914, file: !915, line: 467, baseType: !921, size: 64, offset: 64)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !135, line: 374, size: 640, elements: !923)
!923 = !{!924, !999, !1000, !1013, !1014, !1015, !1016, !1017, !1018, !1020, !1022, !1023}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !922, file: !135, line: 377, baseType: !925, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !553, line: 111, baseType: !926)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !135, line: 217, size: 832, elements: !928)
!928 = !{!929, !964, !965, !966, !969, !973, !974, !975, !993, !994, !995, !996, !997, !998}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !927, file: !135, line: 219, baseType: !930, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !135, line: 151, baseType: !932)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !135, line: 151, size: 128, elements: !933)
!933 = !{!934}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !932, file: !135, line: 151, baseType: !935, size: 128)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !135, line: 150, baseType: !936)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !135, line: 150, size: 128, elements: !937)
!937 = !{!938, !939, !940}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !936, file: !135, line: 150, baseType: !7, size: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !936, file: !135, line: 150, baseType: !7, size: 32, offset: 32)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !936, file: !135, line: 150, baseType: !941, size: 64, offset: 64)
!941 = !DICompositeType(tag: DW_TAG_array_type, baseType: !942, size: 64, elements: !587)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !553, line: 108, baseType: !943)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !135, line: 122, size: 512, elements: !945)
!945 = !{!946, !947, !948, !956, !957, !958, !959, !960, !961, !962}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !944, file: !135, line: 124, baseType: !926, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !944, file: !135, line: 125, baseType: !926, size: 64, offset: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !944, file: !135, line: 131, baseType: !949, size: 64, offset: 128)
!949 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !135, line: 128, size: 64, elements: !950)
!950 = !{!951, !955}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !949, file: !135, line: 129, baseType: !952, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !553, line: 66, baseType: !953)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !553, line: 65, flags: DIFlagFwdDecl)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !949, file: !135, line: 130, baseType: !552, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !944, file: !135, line: 134, baseType: !549, size: 64, offset: 192)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !944, file: !135, line: 137, baseType: !668, size: 64, offset: 256)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !944, file: !135, line: 138, baseType: !788, size: 32, offset: 320)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !944, file: !135, line: 142, baseType: !7, size: 32, offset: 352)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !944, file: !135, line: 144, baseType: !545, size: 32, offset: 384)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !944, file: !135, line: 145, baseType: !545, size: 32, offset: 416)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !944, file: !135, line: 146, baseType: !963, size: 64, offset: 448)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !135, line: 119, baseType: !639)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !927, file: !135, line: 220, baseType: !930, size: 64, offset: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !927, file: !135, line: 223, baseType: !549, size: 64, offset: 128)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !927, file: !135, line: 226, baseType: !967, size: 64, offset: 192)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !135, line: 185, flags: DIFlagFwdDecl)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !927, file: !135, line: 229, baseType: !970, size: 128, offset: 256)
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 128, elements: !623)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !135, line: 229, flags: DIFlagFwdDecl)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !927, file: !135, line: 232, baseType: !926, size: 64, offset: 384)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !927, file: !135, line: 233, baseType: !926, size: 64, offset: 448)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !927, file: !135, line: 238, baseType: !976, size: 64, offset: 512)
!976 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !135, line: 235, size: 64, elements: !977)
!977 = !{!978, !984}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !976, file: !135, line: 236, baseType: !979, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !135, line: 273, size: 128, elements: !981)
!981 = !{!982, !983}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !980, file: !135, line: 275, baseType: !952, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !980, file: !135, line: 278, baseType: !952, size: 64, offset: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !976, file: !135, line: 237, baseType: !985, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !135, line: 259, size: 320, elements: !987)
!987 = !{!988, !989, !990, !991, !992}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !986, file: !135, line: 261, baseType: !552, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !986, file: !135, line: 262, baseType: !552, size: 64, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !986, file: !135, line: 266, baseType: !552, size: 64, offset: 128)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !986, file: !135, line: 267, baseType: !552, size: 64, offset: 192)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !986, file: !135, line: 270, baseType: !545, size: 32, offset: 256)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !927, file: !135, line: 241, baseType: !963, size: 64, offset: 576)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !927, file: !135, line: 244, baseType: !545, size: 32, offset: 640)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !927, file: !135, line: 247, baseType: !545, size: 32, offset: 672)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !927, file: !135, line: 250, baseType: !545, size: 32, offset: 704)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !927, file: !135, line: 253, baseType: !545, size: 32, offset: 736)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !927, file: !135, line: 256, baseType: !545, size: 32, offset: 768)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !922, file: !135, line: 378, baseType: !925, size: 64, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !922, file: !135, line: 381, baseType: !1001, size: 64, offset: 128)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !135, line: 282, baseType: !1003)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !135, line: 282, size: 128, elements: !1004)
!1004 = !{!1005}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1003, file: !135, line: 282, baseType: !1006, size: 128)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !135, line: 281, baseType: !1007)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !135, line: 281, size: 128, elements: !1008)
!1008 = !{!1009, !1010, !1011}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1007, file: !135, line: 281, baseType: !7, size: 32)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1007, file: !135, line: 281, baseType: !7, size: 32, offset: 32)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1007, file: !135, line: 281, baseType: !1012, size: 64, offset: 64)
!1012 = !DICompositeType(tag: DW_TAG_array_type, baseType: !925, size: 64, elements: !587)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !922, file: !135, line: 384, baseType: !545, size: 32, offset: 192)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !922, file: !135, line: 387, baseType: !545, size: 32, offset: 224)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !922, file: !135, line: 390, baseType: !545, size: 32, offset: 256)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !922, file: !135, line: 394, baseType: !1001, size: 64, offset: 320)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !922, file: !135, line: 396, baseType: !134, size: 32, offset: 384)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !922, file: !135, line: 399, baseType: !1019, size: 64, offset: 416)
!1019 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 64, elements: !623)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !922, file: !135, line: 402, baseType: !1021, size: 64, offset: 480)
!1021 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !623)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !922, file: !135, line: 406, baseType: !545, size: 32, offset: 544)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !922, file: !135, line: 409, baseType: !545, size: 32, offset: 576)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !914, file: !915, line: 470, baseType: !953, size: 64, offset: 128)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !914, file: !915, line: 473, baseType: !1026, size: 64, offset: 192)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !915, line: 166, flags: DIFlagFwdDecl)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !914, file: !915, line: 476, baseType: !1029, size: 64, offset: 256)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !915, line: 476, flags: DIFlagFwdDecl)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !914, file: !915, line: 479, baseType: !1032, size: 64, offset: 320)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1033, line: 144, baseType: !1034)
!1033 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1033, line: 100, size: 896, elements: !1036)
!1036 = !{!1037, !1045, !1050, !1055, !1057, !1060, !1061, !1062, !1063, !1064, !1069, !1071, !1072, !1077, !1082}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1035, file: !1033, line: 102, baseType: !1038, size: 64)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1033, line: 52, baseType: !1039)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!1042, !1043}
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1033, line: 47, baseType: !7)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1035, file: !1033, line: 105, baseType: !1046, size: 64, offset: 64)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1033, line: 59, baseType: !1047)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!545, !1043, !1043}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1035, file: !1033, line: 108, baseType: !1051, size: 64, offset: 128)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1033, line: 63, baseType: !1052)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{null, !549}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1035, file: !1033, line: 111, baseType: !1056, size: 64, offset: 192)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1035, file: !1033, line: 114, baseType: !1058, size: 64, offset: 256)
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1059, line: 46, baseType: !622)
!1059 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1035, file: !1033, line: 117, baseType: !1058, size: 64, offset: 320)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1035, file: !1033, line: 120, baseType: !1058, size: 64, offset: 384)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1035, file: !1033, line: 124, baseType: !7, size: 32, offset: 448)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1035, file: !1033, line: 128, baseType: !7, size: 32, offset: 480)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1035, file: !1033, line: 131, baseType: !1065, size: 64, offset: 512)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1033, line: 75, baseType: !1066)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!549, !1058, !1058}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1035, file: !1033, line: 132, baseType: !1070, size: 64, offset: 576)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1033, line: 78, baseType: !1052)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1035, file: !1033, line: 135, baseType: !549, size: 64, offset: 640)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1035, file: !1033, line: 136, baseType: !1073, size: 64, offset: 704)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1033, line: 82, baseType: !1074)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{!549, !549, !1058, !1058}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1035, file: !1033, line: 137, baseType: !1078, size: 64, offset: 768)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1033, line: 83, baseType: !1079)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64)
!1080 = !DISubroutineType(types: !1081)
!1081 = !{null, !549, !549}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1035, file: !1033, line: 141, baseType: !7, size: 32, offset: 832)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !914, file: !915, line: 484, baseType: !668, size: 64, offset: 384)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !914, file: !915, line: 488, baseType: !668, size: 64, offset: 448)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !914, file: !915, line: 493, baseType: !668, size: 64, offset: 512)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !914, file: !915, line: 496, baseType: !668, size: 64, offset: 576)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !914, file: !915, line: 501, baseType: !1088, size: 64, offset: 640)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !146, line: 2355, size: 576, elements: !1090)
!1090 = !{!1091, !1094, !1095, !1096, !1097, !1099, !1100, !1105, !1106, !1107, !1108, !1109, !1110}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1089, file: !146, line: 2356, baseType: !1092, size: 64)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1093 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !146, line: 2356, flags: DIFlagFwdDecl)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1089, file: !146, line: 2357, baseType: !550, size: 64, offset: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1089, file: !146, line: 2358, baseType: !545, size: 32, offset: 128)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1089, file: !146, line: 2359, baseType: !545, size: 32, offset: 160)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1089, file: !146, line: 2360, baseType: !1098, size: 128, offset: 192)
!1098 = !DICompositeType(tag: DW_TAG_array_type, baseType: !545, size: 128, elements: !648)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1089, file: !146, line: 2364, baseType: !545, size: 32, offset: 320)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1089, file: !146, line: 2367, baseType: !1101, size: 128, offset: 384)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !146, line: 2349, size: 128, elements: !1102)
!1102 = !{!1103, !1104}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1101, file: !146, line: 2351, baseType: !552, size: 64)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1101, file: !146, line: 2352, baseType: !639, size: 64, offset: 64)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1089, file: !146, line: 2371, baseType: !145, size: 32, offset: 512)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1089, file: !146, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1089, file: !146, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1089, file: !146, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1089, file: !146, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1089, file: !146, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !914, file: !915, line: 504, baseType: !1112, size: 64, offset: 704)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64)
!1113 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !915, line: 504, flags: DIFlagFwdDecl)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !914, file: !915, line: 507, baseType: !1032, size: 64, offset: 768)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !914, file: !915, line: 510, baseType: !545, size: 32, offset: 832)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !914, file: !915, line: 513, baseType: !545, size: 32, offset: 864)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !914, file: !915, line: 516, baseType: !788, size: 32, offset: 896)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !914, file: !915, line: 519, baseType: !788, size: 32, offset: 928)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !914, file: !915, line: 522, baseType: !7, size: 32, offset: 960)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !914, file: !915, line: 523, baseType: !7, size: 32, offset: 992)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !914, file: !915, line: 528, baseType: !550, size: 64, offset: 1024)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !914, file: !915, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !914, file: !915, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !914, file: !915, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !914, file: !915, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !914, file: !915, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !914, file: !915, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !914, file: !915, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !914, file: !915, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !914, file: !915, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !914, file: !915, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !914, file: !915, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !914, file: !915, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !914, file: !915, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !914, file: !915, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !914, file: !915, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !914, file: !915, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !909, file: !151, line: 3254, baseType: !668, size: 64, offset: 1536)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !909, file: !151, line: 3257, baseType: !668, size: 64, offset: 1600)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !909, file: !151, line: 3258, baseType: !668, size: 64, offset: 1664)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !909, file: !151, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !909, file: !151, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !909, file: !151, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !909, file: !151, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !909, file: !151, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !909, file: !151, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !909, file: !151, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !909, file: !151, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !909, file: !151, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !909, file: !151, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !909, file: !151, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !909, file: !151, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !909, file: !151, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !909, file: !151, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !909, file: !151, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !909, file: !151, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !909, file: !151, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !909, file: !151, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !670, file: !151, line: 3394, baseType: !1160, size: 1344)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !151, line: 2279, size: 1344, elements: !1161)
!1161 = !{!1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1187, !1188, !1189, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1160, file: !151, line: 2280, baseType: !706, size: 192)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1160, file: !151, line: 2281, baseType: !668, size: 64, offset: 192)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1160, file: !151, line: 2282, baseType: !668, size: 64, offset: 256)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1160, file: !151, line: 2283, baseType: !668, size: 64, offset: 320)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1160, file: !151, line: 2284, baseType: !668, size: 64, offset: 384)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1160, file: !151, line: 2285, baseType: !7, size: 32, offset: 448)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1160, file: !151, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1160, file: !151, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1160, file: !151, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1160, file: !151, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1160, file: !151, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1160, file: !151, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1160, file: !151, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1160, file: !151, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1160, file: !151, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1160, file: !151, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1160, file: !151, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1160, file: !151, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1160, file: !151, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1160, file: !151, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1160, file: !151, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1160, file: !151, line: 2305, baseType: !7, size: 32, offset: 512)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1160, file: !151, line: 2306, baseType: !1185, size: 32, offset: 544)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1186, line: 31, baseType: !545)
!1186 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1160, file: !151, line: 2307, baseType: !668, size: 64, offset: 576)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1160, file: !151, line: 2308, baseType: !668, size: 64, offset: 640)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1160, file: !151, line: 2314, baseType: !1190, size: 64, offset: 704)
!1190 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !151, line: 2309, size: 64, elements: !1191)
!1191 = !{!1192, !1193, !1194}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1190, file: !151, line: 2310, baseType: !545, size: 32)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1190, file: !151, line: 2311, baseType: !550, size: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1190, file: !151, line: 2312, baseType: !1195, size: 64)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64)
!1196 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !151, line: 2277, flags: DIFlagFwdDecl)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1160, file: !151, line: 2315, baseType: !668, size: 64, offset: 768)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1160, file: !151, line: 2316, baseType: !668, size: 64, offset: 832)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1160, file: !151, line: 2317, baseType: !668, size: 64, offset: 896)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1160, file: !151, line: 2318, baseType: !668, size: 64, offset: 960)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1160, file: !151, line: 2319, baseType: !668, size: 64, offset: 1024)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1160, file: !151, line: 2320, baseType: !668, size: 64, offset: 1088)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1160, file: !151, line: 2321, baseType: !668, size: 64, offset: 1152)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1160, file: !151, line: 2322, baseType: !668, size: 64, offset: 1216)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1160, file: !151, line: 2324, baseType: !1206, size: 64, offset: 1280)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64)
!1207 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !151, line: 2324, flags: DIFlagFwdDecl)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !670, file: !151, line: 3395, baseType: !1209, size: 320)
!1209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !151, line: 1469, size: 320, elements: !1210)
!1210 = !{!1211, !1212, !1213}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1209, file: !151, line: 1470, baseType: !706, size: 192)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1209, file: !151, line: 1471, baseType: !668, size: 64, offset: 192)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1209, file: !151, line: 1472, baseType: !668, size: 64, offset: 256)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !670, file: !151, line: 3396, baseType: !1215, size: 320)
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !151, line: 1482, size: 320, elements: !1216)
!1216 = !{!1217, !1218, !1219}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1215, file: !151, line: 1483, baseType: !706, size: 192)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1215, file: !151, line: 1484, baseType: !545, size: 32, offset: 192)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1215, file: !151, line: 1485, baseType: !1220, size: 64, offset: 256)
!1220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !668, size: 64, elements: !587)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !670, file: !151, line: 3397, baseType: !1222, size: 384)
!1222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !151, line: 1829, size: 384, elements: !1223)
!1223 = !{!1224, !1225, !1226, !1227}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1222, file: !151, line: 1830, baseType: !706, size: 192)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1222, file: !151, line: 1831, baseType: !788, size: 32, offset: 192)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1222, file: !151, line: 1832, baseType: !668, size: 64, offset: 256)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1222, file: !151, line: 1835, baseType: !1220, size: 64, offset: 320)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !670, file: !151, line: 3398, baseType: !1229, size: 704)
!1229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !151, line: 1898, size: 704, elements: !1230)
!1230 = !{!1231, !1232, !1233, !1237, !1238, !1241}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1229, file: !151, line: 1899, baseType: !706, size: 192)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1229, file: !151, line: 1902, baseType: !668, size: 64, offset: 192)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1229, file: !151, line: 1905, baseType: !1234, size: 64, offset: 256)
!1234 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !553, line: 58, baseType: !1235)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64)
!1236 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !553, line: 57, flags: DIFlagFwdDecl)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1229, file: !151, line: 1908, baseType: !7, size: 32, offset: 320)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1229, file: !151, line: 1911, baseType: !1239, size: 64, offset: 384)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64)
!1240 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !151, line: 1876, flags: DIFlagFwdDecl)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1229, file: !151, line: 1914, baseType: !1242, size: 256, offset: 448)
!1242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !151, line: 1883, size: 256, elements: !1243)
!1243 = !{!1244, !1246, !1247, !1252}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1242, file: !151, line: 1884, baseType: !1245, size: 64)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1242, file: !151, line: 1885, baseType: !1245, size: 64, offset: 64)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1242, file: !151, line: 1891, baseType: !1248, size: 64, offset: 128)
!1248 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1242, file: !151, line: 1891, size: 64, elements: !1249)
!1249 = !{!1250, !1251}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1248, file: !151, line: 1891, baseType: !1234, size: 64)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1248, file: !151, line: 1891, baseType: !668, size: 64)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1242, file: !151, line: 1892, baseType: !1253, size: 64, offset: 192)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !670, file: !151, line: 3399, baseType: !1255, size: 704)
!1255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !151, line: 2008, size: 704, elements: !1256)
!1256 = !{!1257, !1258, !1259, !1260, !1261, !1262, !1274, !1275, !1276, !1277, !1278}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1255, file: !151, line: 2009, baseType: !706, size: 192)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1255, file: !151, line: 2011, baseType: !7, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !1255, file: !151, line: 2012, baseType: !7, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1255, file: !151, line: 2014, baseType: !788, size: 32, offset: 224)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1255, file: !151, line: 2016, baseType: !668, size: 64, offset: 256)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !1255, file: !151, line: 2017, baseType: !1263, size: 64, offset: 320)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64)
!1264 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !151, line: 183, baseType: !1265)
!1265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !151, line: 183, size: 128, elements: !1266)
!1266 = !{!1267}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1265, file: !151, line: 183, baseType: !1268, size: 128)
!1268 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !151, line: 182, baseType: !1269)
!1269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !151, line: 182, size: 128, elements: !1270)
!1270 = !{!1271, !1272, !1273}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1269, file: !151, line: 182, baseType: !7, size: 32)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1269, file: !151, line: 182, baseType: !7, size: 32, offset: 32)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1269, file: !151, line: 182, baseType: !1220, size: 64, offset: 64)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !1255, file: !151, line: 2019, baseType: !668, size: 64, offset: 384)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !1255, file: !151, line: 2020, baseType: !668, size: 64, offset: 448)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1255, file: !151, line: 2021, baseType: !668, size: 64, offset: 512)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !1255, file: !151, line: 2022, baseType: !668, size: 64, offset: 576)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !1255, file: !151, line: 2023, baseType: !668, size: 64, offset: 640)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !670, file: !151, line: 3400, baseType: !1280, size: 832)
!1280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !151, line: 2430, size: 832, elements: !1281)
!1281 = !{!1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1280, file: !151, line: 2431, baseType: !706, size: 192)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1280, file: !151, line: 2433, baseType: !668, size: 64, offset: 192)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !1280, file: !151, line: 2434, baseType: !668, size: 64, offset: 256)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !1280, file: !151, line: 2435, baseType: !668, size: 64, offset: 320)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !1280, file: !151, line: 2436, baseType: !668, size: 64, offset: 384)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "base_accesses", scope: !1280, file: !151, line: 2437, baseType: !1263, size: 64, offset: 448)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "inheritance", scope: !1280, file: !151, line: 2438, baseType: !668, size: 64, offset: 512)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_subvtt", scope: !1280, file: !151, line: 2440, baseType: !668, size: 64, offset: 576)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_vptr", scope: !1280, file: !151, line: 2441, baseType: !668, size: 64, offset: 640)
