; ModuleID = 'dominance.bc'
source_filename = "dominance.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }

!330 = !DIEnumerator(name: "EH_FILTER_EXPR", value: 143, isUnsigned: true)
!331 = !DIEnumerator(name: "SCEV_KNOWN", value: 144, isUnsigned: true)
!332 = !DIEnumerator(name: "SCEV_NOT_KNOWN", value: 145, isUnsigned: true)
!333 = !DIEnumerator(name: "POLYNOMIAL_CHREC", value: 146, isUnsigned: true)
!334 = !DIEnumerator(name: "STATEMENT_LIST", value: 147, isUnsigned: true)
!335 = !DIEnumerator(name: "ASSERT_EXPR", value: 148, isUnsigned: true)
!336 = !DIEnumerator(name: "TREE_BINFO", value: 149, isUnsigned: true)
!337 = !DIEnumerator(name: "WITH_SIZE_EXPR", value: 150, isUnsigned: true)
!338 = !DIEnumerator(name: "REALIGN_LOAD_EXPR", value: 151, isUnsigned: true)
!339 = !DIEnumerator(name: "TARGET_MEM_REF", value: 152, isUnsigned: true)
!340 = !DIEnumerator(name: "OMP_PARALLEL", value: 153, isUnsigned: true)
!341 = !DIEnumerator(name: "OMP_TASK", value: 154, isUnsigned: true)
!342 = !DIEnumerator(name: "OMP_FOR", value: 155, isUnsigned: true)
!343 = !DIEnumerator(name: "OMP_SECTIONS", value: 156, isUnsigned: true)
!344 = !DIEnumerator(name: "OMP_SINGLE", value: 157, isUnsigned: true)
!345 = !DIEnumerator(name: "OMP_SECTION", value: 158, isUnsigned: true)
!346 = !DIEnumerator(name: "OMP_MASTER", value: 159, isUnsigned: true)
!347 = !DIEnumerator(name: "OMP_ORDERED", value: 160, isUnsigned: true)
!348 = !DIEnumerator(name: "OMP_CRITICAL", value: 161, isUnsigned: true)
!349 = !DIEnumerator(name: "OMP_ATOMIC", value: 162, isUnsigned: true)
!350 = !DIEnumerator(name: "OMP_CLAUSE", value: 163, isUnsigned: true)
!351 = !DIEnumerator(name: "REDUC_MAX_EXPR", value: 164, isUnsigned: true)
!352 = !DIEnumerator(name: "REDUC_MIN_EXPR", value: 165, isUnsigned: true)
!353 = !DIEnumerator(name: "REDUC_PLUS_EXPR", value: 166, isUnsigned: true)
!354 = !DIEnumerator(name: "DOT_PROD_EXPR", value: 167, isUnsigned: true)
!355 = !DIEnumerator(name: "WIDEN_SUM_EXPR", value: 168, isUnsigned: true)
!356 = !DIEnumerator(name: "WIDEN_MULT_EXPR", value: 169, isUnsigned: true)
!357 = !DIEnumerator(name: "VEC_LSHIFT_EXPR", value: 170, isUnsigned: true)
!358 = !DIEnumerator(name: "VEC_RSHIFT_EXPR", value: 171, isUnsigned: true)
!359 = !DIEnumerator(name: "VEC_WIDEN_MULT_HI_EXPR", value: 172, isUnsigned: true)
!360 = !DIEnumerator(name: "VEC_WIDEN_MULT_LO_EXPR", value: 173, isUnsigned: true)
!361 = !DIEnumerator(name: "VEC_UNPACK_HI_EXPR", value: 174, isUnsigned: true)
!362 = !DIEnumerator(name: "VEC_UNPACK_LO_EXPR", value: 175, isUnsigned: true)
!363 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_HI_EXPR", value: 176, isUnsigned: true)
!364 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_LO_EXPR", value: 177, isUnsigned: true)
!365 = !DIEnumerator(name: "VEC_PACK_TRUNC_EXPR", value: 178, isUnsigned: true)
!366 = !DIEnumerator(name: "VEC_PACK_SAT_EXPR", value: 179, isUnsigned: true)
!367 = !DIEnumerator(name: "VEC_PACK_FIX_TRUNC_EXPR", value: 180, isUnsigned: true)
!368 = !DIEnumerator(name: "VEC_EXTRACT_EVEN_EXPR", value: 181, isUnsigned: true)
!369 = !DIEnumerator(name: "VEC_EXTRACT_ODD_EXPR", value: 182, isUnsigned: true)
!370 = !DIEnumerator(name: "VEC_INTERLEAVE_HIGH_EXPR", value: 183, isUnsigned: true)
!371 = !DIEnumerator(name: "VEC_INTERLEAVE_LOW_EXPR", value: 184, isUnsigned: true)
!372 = !DIEnumerator(name: "PREDICT_EXPR", value: 185, isUnsigned: true)
!373 = !DIEnumerator(name: "OPTIMIZATION_NODE", value: 186, isUnsigned: true)
!374 = !DIEnumerator(name: "TARGET_OPTION_NODE", value: 187, isUnsigned: true)
!375 = !DIEnumerator(name: "LAST_AND_UNUSED_TREE_CODE", value: 188, isUnsigned: true)
!376 = !DIEnumerator(name: "C_MAYBE_CONST_EXPR", value: 189, isUnsigned: true)
!377 = !DIEnumerator(name: "EXCESS_PRECISION_EXPR", value: 190, isUnsigned: true)
!378 = !DIEnumerator(name: "MAX_TREE_CODES", value: 191, isUnsigned: true)
!379 = !{!380, !381, !382, !383, !386, !387, !389, !853, !1441, !1442, !1443, !1445, !5, !1446, !1447, !1454, !1459, !1460}
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!382 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !385)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !390, line: 111, baseType: !391)
!390 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !4, line: 217, size: 832, elements: !393)
!393 = !{!394, !1393, !1394, !1395, !1398, !1415, !1416, !1417, !1435, !1436, !1437, !1438, !1439, !1440}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !392, file: !4, line: 219, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !4, line: 151, baseType: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !4, line: 151, size: 128, elements: !398)
!398 = !{!399}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !397, file: !4, line: 151, baseType: !400, size: 128)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !4, line: 150, baseType: !401)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !4, line: 150, size: 128, elements: !402)
!402 = !{!403, !404, !405}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !401, file: !4, line: 150, baseType: !5, size: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !401, file: !4, line: 150, baseType: !5, size: 32, offset: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !401, file: !4, line: 150, baseType: !406, size: 64, offset: 64)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !407, size: 64, elements: !456)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !390, line: 108, baseType: !408)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !4, line: 122, size: 512, elements: !410)
!410 = !{!411, !412, !413, !1385, !1386, !1387, !1388, !1389, !1390, !1391}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !409, file: !4, line: 124, baseType: !391, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !409, file: !4, line: 125, baseType: !391, size: 64, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !409, file: !4, line: 131, baseType: !414, size: 64, offset: 128)
!414 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !4, line: 128, size: 64, elements: !415)
!415 = !{!416, !420}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !414, file: !4, line: 129, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !390, line: 66, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !390, line: 65, flags: DIFlagFwdDecl)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !414, file: !4, line: 130, baseType: !421, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !390, line: 50, baseType: !422)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !424, line: 240, size: 384, elements: !425)
!424 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!425 = !{!426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !423, file: !424, line: 242, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !423, file: !424, line: 245, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !423, file: !424, line: 252, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !423, file: !424, line: 257, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !423, file: !424, line: 265, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !423, file: !424, line: 277, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !423, file: !424, line: 291, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !423, file: !424, line: 298, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !423, file: !424, line: 305, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !423, file: !424, line: 310, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !423, file: !424, line: 321, baseType: !437, size: 320, offset: 64)
!437 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !424, line: 315, size: 320, elements: !438)
!438 = !{!439, !1352, !1354, !1383, !1384}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !437, file: !424, line: 316, baseType: !440, size: 64)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !441, size: 64, elements: !456)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !424, line: 183, baseType: !442)
!442 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !424, line: 166, size: 64, elements: !443)
!443 = !{!444, !445, !446, !447, !448, !458, !459, !471, !474, !536, !1330, !1331, !1342, !1349}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !442, file: !424, line: 168, baseType: !382, size: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !442, file: !424, line: 169, baseType: !5, size: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !442, file: !424, line: 170, baseType: !387, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !442, file: !424, line: 171, baseType: !421, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !442, file: !424, line: 172, baseType: !449, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !390, line: 53, baseType: !450)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !424, line: 359, size: 128, elements: !452)
!452 = !{!453, !454}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !451, file: !424, line: 360, baseType: !382, size: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !451, file: !424, line: 361, baseType: !455, size: 64, offset: 64)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 64, elements: !456)
!456 = !{!457}
!457 = !DISubrange(count: 1)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !442, file: !424, line: 173, baseType: !9, size: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !442, file: !424, line: 174, baseType: !460, size: 32)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !424, line: 133, baseType: !461)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !424, line: 115, size: 32, elements: !462)
!462 = !{!463, !464, !465, !466, !467, !468, !469, !470}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !461, file: !424, line: 118, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !461, file: !424, line: 120, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !461, file: !424, line: 121, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !461, file: !424, line: 123, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !461, file: !424, line: 125, baseType: !5, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !461, file: !424, line: 127, baseType: !5, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !461, file: !424, line: 130, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !461, file: !424, line: 132, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !442, file: !424, line: 175, baseType: !472, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !424, line: 175, flags: DIFlagFwdDecl)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !442, file: !424, line: 176, baseType: !475, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !477, line: 75, size: 256, elements: !478)
!477 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!478 = !{!479, !494, !495, !496}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !476, file: !477, line: 76, baseType: !480, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !477, line: 68, baseType: !482)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !477, line: 63, size: 320, elements: !483)
!483 = !{!484, !486, !487, !488}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !482, file: !477, line: 64, baseType: !485, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !482, file: !477, line: 65, baseType: !485, size: 64, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !482, file: !477, line: 66, baseType: !5, size: 32, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !482, file: !477, line: 67, baseType: !489, size: 128, offset: 192)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !490, size: 128, elements: !492)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !477, line: 29, baseType: !491)
!491 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!492 = !{!493}
!493 = !DISubrange(count: 2)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !476, file: !477, line: 77, baseType: !480, size: 64, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !476, file: !477, line: 78, baseType: !5, size: 32, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !476, file: !477, line: 79, baseType: !497, size: 64, offset: 192)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !477, line: 49, baseType: !499)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !477, line: 45, size: 832, elements: !500)
!500 = !{!501, !502, !503}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !499, file: !477, line: 46, baseType: !485, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !499, file: !477, line: 47, baseType: !475, size: 64, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !499, file: !477, line: 48, baseType: !504, size: 704, offset: 128)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !505, line: 164, size: 704, elements: !506)
!505 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!506 = !{!507, !509, !519, !520, !521, !522, !523, !524, !528, !532, !533, !534, !535}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !504, file: !505, line: 166, baseType: !508, size: 64)
!508 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !504, file: !505, line: 167, baseType: !510, size: 64, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !505, line: 157, size: 192, elements: !512)
!512 = !{!513, !514, !515}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !511, file: !505, line: 159, baseType: !384, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !511, file: !505, line: 160, baseType: !510, size: 64, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !511, file: !505, line: 161, baseType: !516, size: 32, offset: 128)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !385, size: 32, elements: !517)
!517 = !{!518}
!518 = !DISubrange(count: 4)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !504, file: !505, line: 168, baseType: !384, size: 64, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !504, file: !505, line: 169, baseType: !384, size: 64, offset: 192)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !504, file: !505, line: 170, baseType: !384, size: 64, offset: 256)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !504, file: !505, line: 171, baseType: !508, size: 64, offset: 320)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !504, file: !505, line: 172, baseType: !382, size: 32, offset: 384)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !504, file: !505, line: 176, baseType: !525, size: 64, offset: 448)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{!510, !386, !508}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !504, file: !505, line: 177, baseType: !529, size: 64, offset: 512)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{null, !386, !510}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !504, file: !505, line: 178, baseType: !386, size: 64, offset: 576)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !504, file: !505, line: 179, baseType: !5, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !504, file: !505, line: 180, baseType: !5, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !504, file: !505, line: 184, baseType: !5, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !442, file: !424, line: 177, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !390, line: 56, baseType: !538)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !153, line: 3371, size: 1792, elements: !540)
!540 = !{!541, !574, !580, !591, !610, !621, !626, !633, !639, !652, !664, !702, !707, !735, !743, !744, !749, !758, !764, !769, !773, !777, !954, !1003, !1009, !1016, !1023, !1049, !1074, !1091, !1103, !1125, !1140, !1312}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !539, file: !153, line: 3372, baseType: !542, size: 64)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !153, line: 360, size: 64, elements: !543)
!543 = !{!544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !542, file: !153, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !542, file: !153, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !542, file: !153, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !542, file: !153, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !542, file: !153, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !542, file: !153, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !542, file: !153, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !542, file: !153, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !542, file: !153, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !542, file: !153, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !542, file: !153, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !542, file: !153, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !542, file: !153, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !542, file: !153, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !542, file: !153, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !542, file: !153, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !542, file: !153, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !542, file: !153, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !542, file: !153, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !542, file: !153, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !542, file: !153, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !542, file: !153, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !542, file: !153, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !542, file: !153, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !542, file: !153, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !542, file: !153, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !542, file: !153, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !542, file: !153, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !542, file: !153, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !542, file: !153, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !539, file: !153, line: 3373, baseType: !575, size: 192)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !153, line: 402, size: 192, elements: !576)
!576 = !{!577, !578, !579}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !575, file: !153, line: 403, baseType: !542, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !575, file: !153, line: 404, baseType: !537, size: 64, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !575, file: !153, line: 405, baseType: !537, size: 64, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !539, file: !153, line: 3374, baseType: !581, size: 320)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !153, line: 1384, size: 320, elements: !582)
!582 = !{!583, !584}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !581, file: !153, line: 1385, baseType: !575, size: 192)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !581, file: !153, line: 1386, baseType: !585, size: 128, offset: 192)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !586, line: 58, baseType: !587)
!586 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !586, line: 54, size: 128, elements: !588)
!588 = !{!589, !590}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !587, file: !586, line: 56, baseType: !491, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !587, file: !586, line: 57, baseType: !508, size: 64, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !539, file: !153, line: 3375, baseType: !592, size: 256)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !153, line: 1397, size: 256, elements: !593)
!593 = !{!594, !595}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !592, file: !153, line: 1398, baseType: !575, size: 192)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !592, file: !153, line: 1399, baseType: !596, size: 64, offset: 192)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !598, line: 52, size: 256, elements: !599)
!598 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!599 = !{!600, !601, !602, !603, !604, !605, !606}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !597, file: !598, line: 56, baseType: !5, size: 2, flags: DIFlagBitField, extraData: i64 0)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !597, file: !598, line: 57, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !597, file: !598, line: 58, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !597, file: !598, line: 59, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !597, file: !598, line: 60, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !597, file: !598, line: 61, baseType: !5, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !597, file: !598, line: 62, baseType: !607, size: 192, offset: 64)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 192, elements: !608)
!608 = !{!609}
!609 = !DISubrange(count: 3)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !539, file: !153, line: 3376, baseType: !611, size: 256)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !153, line: 1408, size: 256, elements: !612)
!612 = !{!613, !614}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !611, file: !153, line: 1409, baseType: !575, size: 192)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !611, file: !153, line: 1410, baseType: !615, size: 64, offset: 192)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !617, line: 27, size: 192, elements: !618)
!617 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!618 = !{!619, !620}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !616, file: !617, line: 29, baseType: !585, size: 128)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !616, file: !617, line: 30, baseType: !9, size: 32, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !539, file: !153, line: 3377, baseType: !622, size: 256)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !153, line: 1437, size: 256, elements: !623)
!623 = !{!624, !625}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !622, file: !153, line: 1438, baseType: !575, size: 192)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !622, file: !153, line: 1439, baseType: !537, size: 64, offset: 192)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !539, file: !153, line: 3378, baseType: !627, size: 256)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !153, line: 1418, size: 256, elements: !628)
!628 = !{!629, !630, !631}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !627, file: !153, line: 1419, baseType: !575, size: 192)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !627, file: !153, line: 1420, baseType: !382, size: 32, offset: 192)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !627, file: !153, line: 1421, baseType: !632, size: 8, offset: 224)
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !385, size: 8, elements: !456)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !539, file: !153, line: 3379, baseType: !634, size: 320)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !153, line: 1428, size: 320, elements: !635)
!635 = !{!636, !637, !638}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !634, file: !153, line: 1429, baseType: !575, size: 192)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !634, file: !153, line: 1430, baseType: !537, size: 64, offset: 192)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !634, file: !153, line: 1431, baseType: !537, size: 64, offset: 256)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !539, file: !153, line: 3380, baseType: !640, size: 320)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !153, line: 1460, size: 320, elements: !641)
!641 = !{!642, !643}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !640, file: !153, line: 1461, baseType: !575, size: 192)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !640, file: !153, line: 1462, baseType: !644, size: 128, offset: 192)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !645, line: 31, size: 128, elements: !646)
!645 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!646 = !{!647, !650, !651}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !644, file: !645, line: 32, baseType: !648, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !381)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !644, file: !645, line: 33, baseType: !5, size: 32, offset: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !644, file: !645, line: 34, baseType: !5, size: 32, offset: 96)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !539, file: !153, line: 3381, baseType: !653, size: 384)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !153, line: 2507, size: 384, elements: !654)
!654 = !{!655, !656, !661, !662, !663}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !653, file: !153, line: 2508, baseType: !575, size: 192)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !653, file: !153, line: 2509, baseType: !657, size: 32, offset: 192)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !658, line: 58, baseType: !659)
!658 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !660, line: 44, baseType: !5)
!660 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!661 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !653, file: !153, line: 2510, baseType: !5, size: 32, offset: 224)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !653, file: !153, line: 2511, baseType: !537, size: 64, offset: 256)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !653, file: !153, line: 2512, baseType: !537, size: 64, offset: 320)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !539, file: !153, line: 3382, baseType: !665, size: 896)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !153, line: 2652, size: 896, elements: !666)
!666 = !{!667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !665, file: !153, line: 2653, baseType: !653, size: 384)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !665, file: !153, line: 2654, baseType: !537, size: 64, offset: 384)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !665, file: !153, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !665, file: !153, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !665, file: !153, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !665, file: !153, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !665, file: !153, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !665, file: !153, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !665, file: !153, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !665, file: !153, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !665, file: !153, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !665, file: !153, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !665, file: !153, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !665, file: !153, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !665, file: !153, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !665, file: !153, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !665, file: !153, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !665, file: !153, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !665, file: !153, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !665, file: !153, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !665, file: !153, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !665, file: !153, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !665, file: !153, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !665, file: !153, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !665, file: !153, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !665, file: !153, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !665, file: !153, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !665, file: !153, line: 2703, baseType: !5, size: 32, offset: 512)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !665, file: !153, line: 2705, baseType: !537, size: 64, offset: 576)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !665, file: !153, line: 2706, baseType: !537, size: 64, offset: 640)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !665, file: !153, line: 2707, baseType: !537, size: 64, offset: 704)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !665, file: !153, line: 2708, baseType: !537, size: 64, offset: 768)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !665, file: !153, line: 2711, baseType: !700, size: 64, offset: 832)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !153, line: 2711, flags: DIFlagFwdDecl)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !539, file: !153, line: 3383, baseType: !703, size: 960)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !153, line: 2756, size: 960, elements: !704)
!704 = !{!705, !706}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !703, file: !153, line: 2757, baseType: !665, size: 896)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !703, file: !153, line: 2758, baseType: !421, size: 64, offset: 896)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !539, file: !153, line: 3384, baseType: !708, size: 1472)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !153, line: 3114, size: 1472, elements: !709)
!709 = !{!710, !731, !732, !733, !734}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !708, file: !153, line: 3115, baseType: !711, size: 1216)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !153, line: 2984, size: 1216, elements: !712)
!712 = !{!713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !711, file: !153, line: 2985, baseType: !703, size: 960)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !711, file: !153, line: 2986, baseType: !537, size: 64, offset: 960)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !711, file: !153, line: 2987, baseType: !537, size: 64, offset: 1024)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !711, file: !153, line: 2988, baseType: !537, size: 64, offset: 1088)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !711, file: !153, line: 2991, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !711, file: !153, line: 2992, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !711, file: !153, line: 2993, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !711, file: !153, line: 2994, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !711, file: !153, line: 2995, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !711, file: !153, line: 2996, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !711, file: !153, line: 2998, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !711, file: !153, line: 3000, baseType: !5, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !711, file: !153, line: 3002, baseType: !5, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !711, file: !153, line: 3003, baseType: !5, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !711, file: !153, line: 3004, baseType: !5, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !711, file: !153, line: 3005, baseType: !5, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !711, file: !153, line: 3007, baseType: !5, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !711, file: !153, line: 3010, baseType: !5, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !708, file: !153, line: 3117, baseType: !537, size: 64, offset: 1216)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !708, file: !153, line: 3119, baseType: !537, size: 64, offset: 1280)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !708, file: !153, line: 3121, baseType: !537, size: 64, offset: 1344)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !708, file: !153, line: 3123, baseType: !537, size: 64, offset: 1408)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !539, file: !153, line: 3385, baseType: !736, size: 1088)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !153, line: 2874, size: 1088, elements: !737)
!737 = !{!738, !739, !740}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !736, file: !153, line: 2875, baseType: !703, size: 960)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !736, file: !153, line: 2876, baseType: !421, size: 64, offset: 960)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !736, file: !153, line: 2877, baseType: !741, size: 64, offset: 1024)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !153, line: 2856, flags: DIFlagFwdDecl)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !539, file: !153, line: 3386, baseType: !711, size: 1216)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !539, file: !153, line: 3387, baseType: !745, size: 1280)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !153, line: 3093, size: 1280, elements: !746)
!746 = !{!747, !748}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !745, file: !153, line: 3094, baseType: !711, size: 1216)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !745, file: !153, line: 3095, baseType: !741, size: 64, offset: 1216)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !539, file: !153, line: 3388, baseType: !750, size: 1216)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !153, line: 2824, size: 1216, elements: !751)
!751 = !{!752, !753, !754, !755, !756, !757}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !750, file: !153, line: 2825, baseType: !665, size: 896)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !750, file: !153, line: 2827, baseType: !537, size: 64, offset: 896)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !750, file: !153, line: 2828, baseType: !537, size: 64, offset: 960)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !750, file: !153, line: 2829, baseType: !537, size: 64, offset: 1024)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !750, file: !153, line: 2830, baseType: !537, size: 64, offset: 1088)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !750, file: !153, line: 2831, baseType: !537, size: 64, offset: 1152)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !539, file: !153, line: 3389, baseType: !759, size: 1024)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !153, line: 2850, size: 1024, elements: !760)
!760 = !{!761, !762, !763}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !759, file: !153, line: 2851, baseType: !703, size: 960)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !759, file: !153, line: 2852, baseType: !382, size: 32, offset: 960)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !759, file: !153, line: 2853, baseType: !382, size: 32, offset: 992)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !539, file: !153, line: 3390, baseType: !765, size: 1024)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !153, line: 2857, size: 1024, elements: !766)
!766 = !{!767, !768}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !765, file: !153, line: 2858, baseType: !703, size: 960)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !765, file: !153, line: 2859, baseType: !741, size: 64, offset: 960)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !539, file: !153, line: 3391, baseType: !770, size: 960)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !153, line: 2862, size: 960, elements: !771)
!771 = !{!772}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !770, file: !153, line: 2863, baseType: !703, size: 960)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !539, file: !153, line: 3392, baseType: !774, size: 1472)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !153, line: 3304, size: 1472, elements: !775)
!775 = !{!776}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !774, file: !153, line: 3305, baseType: !708, size: 1472)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !539, file: !153, line: 3393, baseType: !778, size: 1792)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !153, line: 3248, size: 1792, elements: !779)
!779 = !{!780, !781, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !778, file: !153, line: 3249, baseType: !708, size: 1472)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !778, file: !153, line: 3251, baseType: !782, size: 64, offset: 1472)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !784, line: 463, size: 1152, elements: !785)
!784 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!785 = !{!786, !789, !819, !820, !823, !826, !878, !879, !880, !881, !882, !906, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !783, file: !784, line: 464, baseType: !787, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !784, line: 464, flags: DIFlagFwdDecl)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !783, file: !784, line: 467, baseType: !790, size: 64, offset: 64)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !4, line: 374, size: 640, elements: !792)
!792 = !{!793, !794, !795, !808, !809, !810, !811, !812, !813, !815, !817, !818}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !791, file: !4, line: 377, baseType: !389, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !791, file: !4, line: 378, baseType: !389, size: 64, offset: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !791, file: !4, line: 381, baseType: !796, size: 64, offset: 128)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !4, line: 282, baseType: !798)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !4, line: 282, size: 128, elements: !799)
!799 = !{!800}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !798, file: !4, line: 282, baseType: !801, size: 128)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !4, line: 281, baseType: !802)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !4, line: 281, size: 128, elements: !803)
!803 = !{!804, !805, !806}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !802, file: !4, line: 281, baseType: !5, size: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !802, file: !4, line: 281, baseType: !5, size: 32, offset: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !802, file: !4, line: 281, baseType: !807, size: 64, offset: 64)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !389, size: 64, elements: !456)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !791, file: !4, line: 384, baseType: !382, size: 32, offset: 192)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !791, file: !4, line: 387, baseType: !382, size: 32, offset: 224)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !791, file: !4, line: 390, baseType: !382, size: 32, offset: 256)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !791, file: !4, line: 394, baseType: !796, size: 64, offset: 320)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !791, file: !4, line: 396, baseType: !137, size: 32, offset: 384)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !791, file: !4, line: 399, baseType: !814, size: 64, offset: 416)
!814 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 64, elements: !492)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !791, file: !4, line: 402, baseType: !816, size: 64, offset: 480)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !492)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !791, file: !4, line: 406, baseType: !382, size: 32, offset: 544)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !791, file: !4, line: 409, baseType: !382, size: 32, offset: 576)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !783, file: !784, line: 470, baseType: !418, size: 64, offset: 128)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !783, file: !784, line: 473, baseType: !821, size: 64, offset: 192)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !784, line: 166, flags: DIFlagFwdDecl)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !783, file: !784, line: 476, baseType: !824, size: 64, offset: 256)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !784, line: 476, flags: DIFlagFwdDecl)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !783, file: !784, line: 479, baseType: !827, size: 64, offset: 320)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !828, line: 144, baseType: !829)
!828 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !828, line: 100, size: 896, elements: !831)
!831 = !{!832, !840, !845, !850, !852, !855, !856, !857, !858, !859, !864, !866, !867, !872, !877}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !830, file: !828, line: 102, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !828, line: 52, baseType: !834)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DISubroutineType(types: !836)
!836 = !{!837, !838}
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !828, line: 47, baseType: !5)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !830, file: !828, line: 105, baseType: !841, size: 64, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !828, line: 59, baseType: !842)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!382, !838, !838}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !830, file: !828, line: 108, baseType: !846, size: 64, offset: 128)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !828, line: 63, baseType: !847)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DISubroutineType(types: !849)
!849 = !{null, !386}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !830, file: !828, line: 111, baseType: !851, size: 64, offset: 192)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !830, file: !828, line: 114, baseType: !853, size: 64, offset: 256)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !854, line: 46, baseType: !491)
!854 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!855 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !830, file: !828, line: 117, baseType: !853, size: 64, offset: 320)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !830, file: !828, line: 120, baseType: !853, size: 64, offset: 384)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !830, file: !828, line: 124, baseType: !5, size: 32, offset: 448)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !830, file: !828, line: 128, baseType: !5, size: 32, offset: 480)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !830, file: !828, line: 131, baseType: !860, size: 64, offset: 512)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !828, line: 75, baseType: !861)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{!386, !853, !853}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !830, file: !828, line: 132, baseType: !865, size: 64, offset: 576)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !828, line: 78, baseType: !847)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !830, file: !828, line: 135, baseType: !386, size: 64, offset: 640)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !830, file: !828, line: 136, baseType: !868, size: 64, offset: 704)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !828, line: 82, baseType: !869)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DISubroutineType(types: !871)
!871 = !{!386, !386, !853, !853}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !830, file: !828, line: 137, baseType: !873, size: 64, offset: 768)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !828, line: 83, baseType: !874)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DISubroutineType(types: !876)
!876 = !{null, !386, !386}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !830, file: !828, line: 141, baseType: !5, size: 32, offset: 832)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !783, file: !784, line: 484, baseType: !537, size: 64, offset: 384)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !783, file: !784, line: 488, baseType: !537, size: 64, offset: 448)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !783, file: !784, line: 493, baseType: !537, size: 64, offset: 512)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !783, file: !784, line: 496, baseType: !537, size: 64, offset: 576)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !783, file: !784, line: 501, baseType: !883, size: 64, offset: 640)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !148, line: 2355, size: 576, elements: !885)
!885 = !{!886, !889, !890, !891, !892, !894, !895, !900, !901, !902, !903, !904, !905}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !884, file: !148, line: 2356, baseType: !887, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !148, line: 2356, flags: DIFlagFwdDecl)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !884, file: !148, line: 2357, baseType: !387, size: 64, offset: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !884, file: !148, line: 2358, baseType: !382, size: 32, offset: 128)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !884, file: !148, line: 2359, baseType: !382, size: 32, offset: 160)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !884, file: !148, line: 2360, baseType: !893, size: 128, offset: 192)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !382, size: 128, elements: !517)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !884, file: !148, line: 2364, baseType: !382, size: 32, offset: 320)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !884, file: !148, line: 2367, baseType: !896, size: 128, offset: 384)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !148, line: 2349, size: 128, elements: !897)
!897 = !{!898, !899}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !896, file: !148, line: 2351, baseType: !421, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !896, file: !148, line: 2352, baseType: !508, size: 64, offset: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !884, file: !148, line: 2371, baseType: !147, size: 32, offset: 512)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !884, file: !148, line: 2374, baseType: !5, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !884, file: !148, line: 2377, baseType: !5, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !884, file: !148, line: 2381, baseType: !5, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !884, file: !148, line: 2392, baseType: !5, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !884, file: !148, line: 2396, baseType: !5, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !783, file: !784, line: 504, baseType: !907, size: 64, offset: 704)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !784, line: 504, flags: DIFlagFwdDecl)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !783, file: !784, line: 507, baseType: !827, size: 64, offset: 768)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !783, file: !784, line: 510, baseType: !382, size: 32, offset: 832)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !783, file: !784, line: 513, baseType: !382, size: 32, offset: 864)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !783, file: !784, line: 516, baseType: !657, size: 32, offset: 896)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !783, file: !784, line: 519, baseType: !657, size: 32, offset: 928)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !783, file: !784, line: 522, baseType: !5, size: 32, offset: 960)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !783, file: !784, line: 523, baseType: !5, size: 32, offset: 992)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !783, file: !784, line: 528, baseType: !387, size: 64, offset: 1024)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !783, file: !784, line: 535, baseType: !5, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !783, file: !784, line: 539, baseType: !5, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !783, file: !784, line: 543, baseType: !5, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !783, file: !784, line: 546, baseType: !5, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !783, file: !784, line: 550, baseType: !5, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !783, file: !784, line: 554, baseType: !5, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !783, file: !784, line: 559, baseType: !5, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !783, file: !784, line: 562, baseType: !5, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !783, file: !784, line: 571, baseType: !5, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !783, file: !784, line: 573, baseType: !5, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !783, file: !784, line: 574, baseType: !5, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !783, file: !784, line: 581, baseType: !5, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !783, file: !784, line: 585, baseType: !5, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !783, file: !784, line: 588, baseType: !5, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !783, file: !784, line: 592, baseType: !5, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !783, file: !784, line: 598, baseType: !5, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !778, file: !153, line: 3254, baseType: !537, size: 64, offset: 1536)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !778, file: !153, line: 3257, baseType: !537, size: 64, offset: 1600)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !778, file: !153, line: 3258, baseType: !537, size: 64, offset: 1664)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !778, file: !153, line: 3264, baseType: !5, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !778, file: !153, line: 3265, baseType: !5, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !778, file: !153, line: 3267, baseType: !5, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !778, file: !153, line: 3268, baseType: !5, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !778, file: !153, line: 3269, baseType: !5, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !778, file: !153, line: 3271, baseType: !5, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !778, file: !153, line: 3272, baseType: !5, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !778, file: !153, line: 3273, baseType: !5, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !778, file: !153, line: 3274, baseType: !5, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !778, file: !153, line: 3275, baseType: !5, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !778, file: !153, line: 3276, baseType: !5, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !778, file: !153, line: 3277, baseType: !5, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !778, file: !153, line: 3279, baseType: !5, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !778, file: !153, line: 3280, baseType: !5, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !778, file: !153, line: 3281, baseType: !5, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !778, file: !153, line: 3282, baseType: !5, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !778, file: !153, line: 3283, baseType: !5, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !778, file: !153, line: 3284, baseType: !5, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !539, file: !153, line: 3394, baseType: !955, size: 1344)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !153, line: 2279, size: 1344, elements: !956)
!956 = !{!957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !982, !983, !984, !992, !993, !994, !995, !996, !997, !998, !999, !1000}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !955, file: !153, line: 2280, baseType: !575, size: 192)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !955, file: !153, line: 2281, baseType: !537, size: 64, offset: 192)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !955, file: !153, line: 2282, baseType: !537, size: 64, offset: 256)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !955, file: !153, line: 2283, baseType: !537, size: 64, offset: 320)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !955, file: !153, line: 2284, baseType: !537, size: 64, offset: 384)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !955, file: !153, line: 2285, baseType: !5, size: 32, offset: 448)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !955, file: !153, line: 2287, baseType: !5, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !955, file: !153, line: 2288, baseType: !5, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !955, file: !153, line: 2289, baseType: !5, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !955, file: !153, line: 2290, baseType: !5, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !955, file: !153, line: 2291, baseType: !5, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !955, file: !153, line: 2292, baseType: !5, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !955, file: !153, line: 2294, baseType: !5, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !955, file: !153, line: 2296, baseType: !5, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !955, file: !153, line: 2297, baseType: !5, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !955, file: !153, line: 2298, baseType: !5, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !955, file: !153, line: 2299, baseType: !5, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !955, file: !153, line: 2300, baseType: !5, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !955, file: !153, line: 2301, baseType: !5, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !955, file: !153, line: 2302, baseType: !5, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !955, file: !153, line: 2303, baseType: !5, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !955, file: !153, line: 2305, baseType: !5, size: 32, offset: 512)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !955, file: !153, line: 2306, baseType: !980, size: 32, offset: 544)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !981, line: 31, baseType: !382)
!981 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!982 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !955, file: !153, line: 2307, baseType: !537, size: 64, offset: 576)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !955, file: !153, line: 2308, baseType: !537, size: 64, offset: 640)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !955, file: !153, line: 2314, baseType: !985, size: 64, offset: 704)
!985 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !153, line: 2309, size: 64, elements: !986)
!986 = !{!987, !988, !989}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !985, file: !153, line: 2310, baseType: !382, size: 32)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !985, file: !153, line: 2311, baseType: !387, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !985, file: !153, line: 2312, baseType: !990, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !153, line: 2277, flags: DIFlagFwdDecl)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !955, file: !153, line: 2315, baseType: !537, size: 64, offset: 768)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !955, file: !153, line: 2316, baseType: !537, size: 64, offset: 832)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !955, file: !153, line: 2317, baseType: !537, size: 64, offset: 896)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !955, file: !153, line: 2318, baseType: !537, size: 64, offset: 960)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !955, file: !153, line: 2319, baseType: !537, size: 64, offset: 1024)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !955, file: !153, line: 2320, baseType: !537, size: 64, offset: 1088)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !955, file: !153, line: 2321, baseType: !537, size: 64, offset: 1152)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !955, file: !153, line: 2322, baseType: !537, size: 64, offset: 1216)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !955, file: !153, line: 2324, baseType: !1001, size: 64, offset: 1280)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !153, line: 2324, flags: DIFlagFwdDecl)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !539, file: !153, line: 3395, baseType: !1004, size: 320)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !153, line: 1469, size: 320, elements: !1005)
!1005 = !{!1006, !1007, !1008}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1004, file: !153, line: 1470, baseType: !575, size: 192)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1004, file: !153, line: 1471, baseType: !537, size: 64, offset: 192)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1004, file: !153, line: 1472, baseType: !537, size: 64, offset: 256)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !539, file: !153, line: 3396, baseType: !1010, size: 320)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !153, line: 1482, size: 320, elements: !1011)
!1011 = !{!1012, !1013, !1014}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1010, file: !153, line: 1483, baseType: !575, size: 192)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1010, file: !153, line: 1484, baseType: !382, size: 32, offset: 192)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1010, file: !153, line: 1485, baseType: !1015, size: 64, offset: 256)
!1015 = !DICompositeType(tag: DW_TAG_array_type, baseType: !537, size: 64, elements: !456)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !539, file: !153, line: 3397, baseType: !1017, size: 384)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !153, line: 1829, size: 384, elements: !1018)
!1018 = !{!1019, !1020, !1021, !1022}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1017, file: !153, line: 1830, baseType: !575, size: 192)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1017, file: !153, line: 1831, baseType: !657, size: 32, offset: 192)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1017, file: !153, line: 1832, baseType: !537, size: 64, offset: 256)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1017, file: !153, line: 1835, baseType: !1015, size: 64, offset: 320)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !539, file: !153, line: 3398, baseType: !1024, size: 704)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !153, line: 1898, size: 704, elements: !1025)
!1025 = !{!1026, !1027, !1028, !1032, !1033, !1036}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1024, file: !153, line: 1899, baseType: !575, size: 192)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1024, file: !153, line: 1902, baseType: !537, size: 64, offset: 192)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1024, file: !153, line: 1905, baseType: !1029, size: 64, offset: 256)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !390, line: 58, baseType: !1030)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !390, line: 57, flags: DIFlagFwdDecl)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1024, file: !153, line: 1908, baseType: !5, size: 32, offset: 320)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1024, file: !153, line: 1911, baseType: !1034, size: 64, offset: 384)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !153, line: 1876, flags: DIFlagFwdDecl)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1024, file: !153, line: 1914, baseType: !1037, size: 256, offset: 448)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !153, line: 1883, size: 256, elements: !1038)
!1038 = !{!1039, !1041, !1042, !1047}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1037, file: !153, line: 1884, baseType: !1040, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1037, file: !153, line: 1885, baseType: !1040, size: 64, offset: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1037, file: !153, line: 1891, baseType: !1043, size: 64, offset: 128)
!1043 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1037, file: !153, line: 1891, size: 64, elements: !1044)
!1044 = !{!1045, !1046}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1043, file: !153, line: 1891, baseType: !1029, size: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1043, file: !153, line: 1891, baseType: !537, size: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1037, file: !153, line: 1892, baseType: !1048, size: 64, offset: 192)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !539, file: !153, line: 3399, baseType: !1050, size: 704)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !153, line: 2008, size: 704, elements: !1051)
!1051 = !{!1052, !1053, !1054, !1055, !1056, !1057, !1069, !1070, !1071, !1072, !1073}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1050, file: !153, line: 2009, baseType: !575, size: 192)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1050, file: !153, line: 2011, baseType: !5, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !1050, file: !153, line: 2012, baseType: !5, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1050, file: !153, line: 2014, baseType: !657, size: 32, offset: 224)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1050, file: !153, line: 2016, baseType: !537, size: 64, offset: 256)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !1050, file: !153, line: 2017, baseType: !1058, size: 64, offset: 320)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !153, line: 183, baseType: !1060)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !153, line: 183, size: 128, elements: !1061)
!1061 = !{!1062}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1060, file: !153, line: 183, baseType: !1063, size: 128)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !153, line: 182, baseType: !1064)
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !153, line: 182, size: 128, elements: !1065)
!1065 = !{!1066, !1067, !1068}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1064, file: !153, line: 182, baseType: !5, size: 32)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1064, file: !153, line: 182, baseType: !5, size: 32, offset: 32)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1064, file: !153, line: 182, baseType: !1015, size: 64, offset: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !1050, file: !153, line: 2019, baseType: !537, size: 64, offset: 384)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !1050, file: !153, line: 2020, baseType: !537, size: 64, offset: 448)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1050, file: !153, line: 2021, baseType: !537, size: 64, offset: 512)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !1050, file: !153, line: 2022, baseType: !537, size: 64, offset: 576)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !1050, file: !153, line: 2023, baseType: !537, size: 64, offset: 640)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !539, file: !153, line: 3400, baseType: !1075, size: 832)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !153, line: 2430, size: 832, elements: !1076)
!1076 = !{!1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1075, file: !153, line: 2431, baseType: !575, size: 192)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1075, file: !153, line: 2433, baseType: !537, size: 64, offset: 192)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !1075, file: !153, line: 2434, baseType: !537, size: 64, offset: 256)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !1075, file: !153, line: 2435, baseType: !537, size: 64, offset: 320)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !1075, file: !153, line: 2436, baseType: !537, size: 64, offset: 384)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "base_accesses", scope: !1075, file: !153, line: 2437, baseType: !1058, size: 64, offset: 448)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "inheritance", scope: !1075, file: !153, line: 2438, baseType: !537, size: 64, offset: 512)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_subvtt", scope: !1075, file: !153, line: 2440, baseType: !537, size: 64, offset: 576)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_vptr", scope: !1075, file: !153, line: 2441, baseType: !537, size: 64, offset: 640)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "base_binfos", scope: !1075, file: !153, line: 2443, baseType: !1087, size: 128, offset: 704)
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_none", file: !153, line: 182, baseType: !1088)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_none", file: !153, line: 182, size: 128, elements: !1089)
!1089 = !{!1090}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1088, file: !153, line: 182, baseType: !1063, size: 128)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "stmt_list", scope: !539, file: !153, line: 3401, baseType: !1092, size: 320)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list", file: !153, line: 3327, size: 320, elements: !1093)
!1093 = !{!1094, !1095, !1102}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1092, file: !153, line: 3329, baseType: !575, size: 192)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1092, file: !153, line: 3330, baseType: !1096, size: 64, offset: 192)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list_node", file: !153, line: 3320, size: 192, elements: !1098)
!1098 = !{!1099, !1100, !1101}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1097, file: !153, line: 3322, baseType: !1096, size: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1097, file: !153, line: 3323, baseType: !1096, size: 64, offset: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1097, file: !153, line: 3324, baseType: !537, size: 64, offset: 128)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1092, file: !153, line: 3331, baseType: !1096, size: 64, offset: 256)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "constructor", scope: !539, file: !153, line: 3402, baseType: !1104, size: 256)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_constructor", file: !153, line: 1540, size: 256, elements: !1105)
!1105 = !{!1106, !1107}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1104, file: !153, line: 1541, baseType: !575, size: 192)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !1104, file: !153, line: 1542, baseType: !1108, size: 64, offset: 192)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_gc", file: !153, line: 1538, baseType: !1110)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_gc", file: !153, line: 1538, size: 192, elements: !1111)
!1111 = !{!1112}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1110, file: !153, line: 1538, baseType: !1113, size: 192)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_base", file: !153, line: 1537, baseType: !1114)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_base", file: !153, line: 1537, size: 192, elements: !1115)
!1115 = !{!1116, !1117, !1118}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1114, file: !153, line: 1537, baseType: !5, size: 32)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1114, file: !153, line: 1537, baseType: !5, size: 32, offset: 32)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1114, file: !153, line: 1537, baseType: !1119, size: 128, offset: 64)
!1119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1120, size: 128, elements: !456)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "constructor_elt", file: !153, line: 1535, baseType: !1121)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "constructor_elt_d", file: !153, line: 1532, size: 128, elements: !1122)
!1122 = !{!1123, !1124}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1121, file: !153, line: 1533, baseType: !537, size: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1121, file: !153, line: 1534, baseType: !537, size: 64, offset: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "omp_clause", scope: !539, file: !153, line: 3403, baseType: !1126, size: 512)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_omp_clause", file: !153, line: 1938, size: 512, elements: !1127)
!1127 = !{!1128, !1129, !1130, !1131, !1137, !1138, !1139}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1126, file: !153, line: 1939, baseType: !575, size: 192)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1126, file: !153, line: 1940, baseType: !657, size: 32, offset: 192)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1126, file: !153, line: 1941, baseType: !152, size: 32, offset: 224)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !1126, file: !153, line: 1946, baseType: !1132, size: 32, offset: 256)
!1132 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "omp_clause_subcode", file: !153, line: 1942, size: 32, elements: !1133)
!1133 = !{!1134, !1135, !1136}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "default_kind", scope: !1132, file: !153, line: 1943, baseType: !171, size: 32)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "schedule_kind", scope: !1132, file: !153, line: 1944, baseType: !178, size: 32)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "reduction_code", scope: !1132, file: !153, line: 1945, baseType: !185, size: 32)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reduction_init", scope: !1126, file: !153, line: 1950, baseType: !417, size: 64, offset: 320)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reduction_merge", scope: !1126, file: !153, line: 1951, baseType: !417, size: 64, offset: 384)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1126, file: !153, line: 1953, baseType: !1015, size: 64, offset: 448)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "optimization", scope: !539, file: !153, line: 3404, baseType: !1141, size: 1664)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_optimization_option", file: !153, line: 3337, size: 1664, elements: !1142)
