; ModuleID = 'domwalk.bc'
source_filename = "domwalk.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }

!198 = !DIEnumerator(name: "EH_FILTER_EXPR", value: 143, isUnsigned: true)
!199 = !DIEnumerator(name: "SCEV_KNOWN", value: 144, isUnsigned: true)
!200 = !DIEnumerator(name: "SCEV_NOT_KNOWN", value: 145, isUnsigned: true)
!201 = !DIEnumerator(name: "POLYNOMIAL_CHREC", value: 146, isUnsigned: true)
!202 = !DIEnumerator(name: "STATEMENT_LIST", value: 147, isUnsigned: true)
!203 = !DIEnumerator(name: "ASSERT_EXPR", value: 148, isUnsigned: true)
!204 = !DIEnumerator(name: "TREE_BINFO", value: 149, isUnsigned: true)
!205 = !DIEnumerator(name: "WITH_SIZE_EXPR", value: 150, isUnsigned: true)
!206 = !DIEnumerator(name: "REALIGN_LOAD_EXPR", value: 151, isUnsigned: true)
!207 = !DIEnumerator(name: "TARGET_MEM_REF", value: 152, isUnsigned: true)
!208 = !DIEnumerator(name: "OMP_PARALLEL", value: 153, isUnsigned: true)
!209 = !DIEnumerator(name: "OMP_TASK", value: 154, isUnsigned: true)
!210 = !DIEnumerator(name: "OMP_FOR", value: 155, isUnsigned: true)
!211 = !DIEnumerator(name: "OMP_SECTIONS", value: 156, isUnsigned: true)
!212 = !DIEnumerator(name: "OMP_SINGLE", value: 157, isUnsigned: true)
!213 = !DIEnumerator(name: "OMP_SECTION", value: 158, isUnsigned: true)
!214 = !DIEnumerator(name: "OMP_MASTER", value: 159, isUnsigned: true)
!215 = !DIEnumerator(name: "OMP_ORDERED", value: 160, isUnsigned: true)
!216 = !DIEnumerator(name: "OMP_CRITICAL", value: 161, isUnsigned: true)
!217 = !DIEnumerator(name: "OMP_ATOMIC", value: 162, isUnsigned: true)
!218 = !DIEnumerator(name: "OMP_CLAUSE", value: 163, isUnsigned: true)
!219 = !DIEnumerator(name: "REDUC_MAX_EXPR", value: 164, isUnsigned: true)
!220 = !DIEnumerator(name: "REDUC_MIN_EXPR", value: 165, isUnsigned: true)
!221 = !DIEnumerator(name: "REDUC_PLUS_EXPR", value: 166, isUnsigned: true)
!222 = !DIEnumerator(name: "DOT_PROD_EXPR", value: 167, isUnsigned: true)
!223 = !DIEnumerator(name: "WIDEN_SUM_EXPR", value: 168, isUnsigned: true)
!224 = !DIEnumerator(name: "WIDEN_MULT_EXPR", value: 169, isUnsigned: true)
!225 = !DIEnumerator(name: "VEC_LSHIFT_EXPR", value: 170, isUnsigned: true)
!226 = !DIEnumerator(name: "VEC_RSHIFT_EXPR", value: 171, isUnsigned: true)
!227 = !DIEnumerator(name: "VEC_WIDEN_MULT_HI_EXPR", value: 172, isUnsigned: true)
!228 = !DIEnumerator(name: "VEC_WIDEN_MULT_LO_EXPR", value: 173, isUnsigned: true)
!229 = !DIEnumerator(name: "VEC_UNPACK_HI_EXPR", value: 174, isUnsigned: true)
!230 = !DIEnumerator(name: "VEC_UNPACK_LO_EXPR", value: 175, isUnsigned: true)
!231 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_HI_EXPR", value: 176, isUnsigned: true)
!232 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_LO_EXPR", value: 177, isUnsigned: true)
!233 = !DIEnumerator(name: "VEC_PACK_TRUNC_EXPR", value: 178, isUnsigned: true)
!234 = !DIEnumerator(name: "VEC_PACK_SAT_EXPR", value: 179, isUnsigned: true)
!235 = !DIEnumerator(name: "VEC_PACK_FIX_TRUNC_EXPR", value: 180, isUnsigned: true)
!236 = !DIEnumerator(name: "VEC_EXTRACT_EVEN_EXPR", value: 181, isUnsigned: true)
!237 = !DIEnumerator(name: "VEC_EXTRACT_ODD_EXPR", value: 182, isUnsigned: true)
!238 = !DIEnumerator(name: "VEC_INTERLEAVE_HIGH_EXPR", value: 183, isUnsigned: true)
!239 = !DIEnumerator(name: "VEC_INTERLEAVE_LOW_EXPR", value: 184, isUnsigned: true)
!240 = !DIEnumerator(name: "PREDICT_EXPR", value: 185, isUnsigned: true)
!241 = !DIEnumerator(name: "OPTIMIZATION_NODE", value: 186, isUnsigned: true)
!242 = !DIEnumerator(name: "TARGET_OPTION_NODE", value: 187, isUnsigned: true)
!243 = !DIEnumerator(name: "LAST_AND_UNUSED_TREE_CODE", value: 188, isUnsigned: true)
!244 = !DIEnumerator(name: "C_MAYBE_CONST_EXPR", value: 189, isUnsigned: true)
!245 = !DIEnumerator(name: "EXCESS_PRECISION_EXPR", value: 190, isUnsigned: true)
!246 = !DIEnumerator(name: "MAX_TREE_CODES", value: 191, isUnsigned: true)
!247 = !{!248, !249, !250, !251, !254, !255, !257, !1121, !5}
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!250 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !253)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !259, line: 111, baseType: !260)
!259 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !4, line: 217, size: 832, elements: !262)
!262 = !{!263, !1086, !1087, !1088, !1091, !1095, !1096, !1097, !1115, !1116, !1117, !1118, !1119, !1120}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !261, file: !4, line: 219, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !4, line: 151, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !4, line: 151, size: 128, elements: !267)
!267 = !{!268}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !266, file: !4, line: 151, baseType: !269, size: 128)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !4, line: 150, baseType: !270)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !4, line: 150, size: 128, elements: !271)
!271 = !{!272, !273, !274}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !270, file: !4, line: 150, baseType: !5, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !270, file: !4, line: 150, baseType: !5, size: 32, offset: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !270, file: !4, line: 150, baseType: !275, size: 64, offset: 64)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !276, size: 64, elements: !377)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !259, line: 108, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !4, line: 122, size: 512, elements: !279)
!279 = !{!280, !281, !282, !293, !294, !1080, !1081, !1082, !1083, !1084}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !278, file: !4, line: 124, baseType: !260, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !278, file: !4, line: 125, baseType: !260, size: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !278, file: !4, line: 131, baseType: !283, size: 64, offset: 128)
!283 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !4, line: 128, size: 64, elements: !284)
!284 = !{!285, !289}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !283, file: !4, line: 129, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !259, line: 66, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !259, line: 65, flags: DIFlagFwdDecl)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !283, file: !4, line: 130, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !259, line: 50, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !259, line: 49, flags: DIFlagFwdDecl)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !278, file: !4, line: 134, baseType: !254, size: 64, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !278, file: !4, line: 137, baseType: !295, size: 64, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !259, line: 56, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !21, line: 3371, size: 1792, elements: !298)
!298 = !{!299, !332, !338, !351, !358, !365, !370, !379, !385, !398, !410, !448, !453, !481, !489, !490, !495, !504, !510, !515, !519, !523, !704, !753, !759, !766, !773, !799, !824, !841, !853, !875, !890, !1062}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !297, file: !21, line: 3372, baseType: !300, size: 64)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !21, line: 360, size: 64, elements: !301)
!301 = !{!302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !300, file: !21, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !300, file: !21, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !300, file: !21, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !300, file: !21, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !300, file: !21, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !300, file: !21, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !300, file: !21, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !300, file: !21, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !300, file: !21, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !300, file: !21, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !300, file: !21, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !300, file: !21, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !300, file: !21, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !300, file: !21, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !300, file: !21, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !300, file: !21, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !300, file: !21, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !300, file: !21, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !300, file: !21, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !300, file: !21, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !300, file: !21, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !300, file: !21, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !300, file: !21, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !300, file: !21, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !300, file: !21, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !300, file: !21, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !300, file: !21, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !300, file: !21, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !300, file: !21, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !300, file: !21, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !297, file: !21, line: 3373, baseType: !333, size: 192)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !21, line: 402, size: 192, elements: !334)
!334 = !{!335, !336, !337}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !333, file: !21, line: 403, baseType: !300, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !333, file: !21, line: 404, baseType: !295, size: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !333, file: !21, line: 405, baseType: !295, size: 64, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !297, file: !21, line: 3374, baseType: !339, size: 320)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !21, line: 1384, size: 320, elements: !340)
!340 = !{!341, !342}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !339, file: !21, line: 1385, baseType: !333, size: 192)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !339, file: !21, line: 1386, baseType: !343, size: 128, offset: 192)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !344, line: 58, baseType: !345)
!344 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !344, line: 54, size: 128, elements: !346)
!346 = !{!347, !349}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !345, file: !344, line: 56, baseType: !348, size: 64)
!348 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !345, file: !344, line: 57, baseType: !350, size: 64, offset: 64)
!350 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !297, file: !21, line: 3375, baseType: !352, size: 256)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !21, line: 1397, size: 256, elements: !353)
!353 = !{!354, !355}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !352, file: !21, line: 1398, baseType: !333, size: 192)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !352, file: !21, line: 1399, baseType: !356, size: 64, offset: 192)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !21, line: 1392, flags: DIFlagFwdDecl)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !297, file: !21, line: 3376, baseType: !359, size: 256)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !21, line: 1408, size: 256, elements: !360)
!360 = !{!361, !362}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !359, file: !21, line: 1409, baseType: !333, size: 192)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !359, file: !21, line: 1410, baseType: !363, size: 64, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !21, line: 1403, flags: DIFlagFwdDecl)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !297, file: !21, line: 3377, baseType: !366, size: 256)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !21, line: 1437, size: 256, elements: !367)
!367 = !{!368, !369}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !366, file: !21, line: 1438, baseType: !333, size: 192)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !366, file: !21, line: 1439, baseType: !295, size: 64, offset: 192)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !297, file: !21, line: 3378, baseType: !371, size: 256)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !21, line: 1418, size: 256, elements: !372)
!372 = !{!373, !374, !375}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !371, file: !21, line: 1419, baseType: !333, size: 192)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !371, file: !21, line: 1420, baseType: !250, size: 32, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !371, file: !21, line: 1421, baseType: !376, size: 8, offset: 224)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 8, elements: !377)
!377 = !{!378}
!378 = !DISubrange(count: 1)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !297, file: !21, line: 3379, baseType: !380, size: 320)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !21, line: 1428, size: 320, elements: !381)
!381 = !{!382, !383, !384}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !380, file: !21, line: 1429, baseType: !333, size: 192)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !380, file: !21, line: 1430, baseType: !295, size: 64, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !380, file: !21, line: 1431, baseType: !295, size: 64, offset: 256)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !297, file: !21, line: 3380, baseType: !386, size: 320)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !21, line: 1460, size: 320, elements: !387)
!387 = !{!388, !389}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !386, file: !21, line: 1461, baseType: !333, size: 192)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !386, file: !21, line: 1462, baseType: !390, size: 128, offset: 192)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !391, line: 31, size: 128, elements: !392)
!391 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!392 = !{!393, !396, !397}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !390, file: !391, line: 32, baseType: !394, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !249)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !390, file: !391, line: 33, baseType: !5, size: 32, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !390, file: !391, line: 34, baseType: !5, size: 32, offset: 96)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !297, file: !21, line: 3381, baseType: !399, size: 384)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !21, line: 2507, size: 384, elements: !400)
!400 = !{!401, !402, !407, !408, !409}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !399, file: !21, line: 2508, baseType: !333, size: 192)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !399, file: !21, line: 2509, baseType: !403, size: 32, offset: 192)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !404, line: 58, baseType: !405)
!404 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !406, line: 44, baseType: !5)
!406 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!407 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !399, file: !21, line: 2510, baseType: !5, size: 32, offset: 224)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !399, file: !21, line: 2511, baseType: !295, size: 64, offset: 256)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !399, file: !21, line: 2512, baseType: !295, size: 64, offset: 320)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !297, file: !21, line: 3382, baseType: !411, size: 896)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !21, line: 2652, size: 896, elements: !412)
!412 = !{!413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !411, file: !21, line: 2653, baseType: !399, size: 384)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !411, file: !21, line: 2654, baseType: !295, size: 64, offset: 384)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !411, file: !21, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !411, file: !21, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !411, file: !21, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !411, file: !21, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !411, file: !21, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !411, file: !21, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !411, file: !21, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !411, file: !21, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !411, file: !21, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !411, file: !21, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !411, file: !21, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !411, file: !21, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !411, file: !21, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !411, file: !21, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !411, file: !21, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !411, file: !21, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !411, file: !21, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !411, file: !21, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !411, file: !21, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !411, file: !21, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !411, file: !21, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !411, file: !21, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !411, file: !21, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !411, file: !21, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !411, file: !21, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !411, file: !21, line: 2703, baseType: !5, size: 32, offset: 512)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !411, file: !21, line: 2705, baseType: !295, size: 64, offset: 576)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !411, file: !21, line: 2706, baseType: !295, size: 64, offset: 640)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !411, file: !21, line: 2707, baseType: !295, size: 64, offset: 704)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !411, file: !21, line: 2708, baseType: !295, size: 64, offset: 768)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !411, file: !21, line: 2711, baseType: !446, size: 64, offset: 832)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !21, line: 2711, flags: DIFlagFwdDecl)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !297, file: !21, line: 3383, baseType: !449, size: 960)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !21, line: 2756, size: 960, elements: !450)
!450 = !{!451, !452}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !449, file: !21, line: 2757, baseType: !411, size: 896)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !449, file: !21, line: 2758, baseType: !290, size: 64, offset: 896)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !297, file: !21, line: 3384, baseType: !454, size: 1472)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !21, line: 3114, size: 1472, elements: !455)
!455 = !{!456, !477, !478, !479, !480}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !454, file: !21, line: 3115, baseType: !457, size: 1216)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !21, line: 2984, size: 1216, elements: !458)
!458 = !{!459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !457, file: !21, line: 2985, baseType: !449, size: 960)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !457, file: !21, line: 2986, baseType: !295, size: 64, offset: 960)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !457, file: !21, line: 2987, baseType: !295, size: 64, offset: 1024)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !457, file: !21, line: 2988, baseType: !295, size: 64, offset: 1088)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !457, file: !21, line: 2991, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !457, file: !21, line: 2992, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !457, file: !21, line: 2993, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !457, file: !21, line: 2994, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !457, file: !21, line: 2995, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !457, file: !21, line: 2996, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !457, file: !21, line: 2998, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !457, file: !21, line: 3000, baseType: !5, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !457, file: !21, line: 3002, baseType: !5, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !457, file: !21, line: 3003, baseType: !5, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !457, file: !21, line: 3004, baseType: !5, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !457, file: !21, line: 3005, baseType: !5, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !457, file: !21, line: 3007, baseType: !5, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !457, file: !21, line: 3010, baseType: !5, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !454, file: !21, line: 3117, baseType: !295, size: 64, offset: 1216)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !454, file: !21, line: 3119, baseType: !295, size: 64, offset: 1280)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !454, file: !21, line: 3121, baseType: !295, size: 64, offset: 1344)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !454, file: !21, line: 3123, baseType: !295, size: 64, offset: 1408)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !297, file: !21, line: 3385, baseType: !482, size: 1088)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !21, line: 2874, size: 1088, elements: !483)
!483 = !{!484, !485, !486}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !482, file: !21, line: 2875, baseType: !449, size: 960)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !482, file: !21, line: 2876, baseType: !290, size: 64, offset: 960)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !482, file: !21, line: 2877, baseType: !487, size: 64, offset: 1024)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !21, line: 2856, flags: DIFlagFwdDecl)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !297, file: !21, line: 3386, baseType: !457, size: 1216)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !297, file: !21, line: 3387, baseType: !491, size: 1280)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !21, line: 3093, size: 1280, elements: !492)
!492 = !{!493, !494}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !491, file: !21, line: 3094, baseType: !457, size: 1216)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !491, file: !21, line: 3095, baseType: !487, size: 64, offset: 1216)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !297, file: !21, line: 3388, baseType: !496, size: 1216)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !21, line: 2824, size: 1216, elements: !497)
!497 = !{!498, !499, !500, !501, !502, !503}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !496, file: !21, line: 2825, baseType: !411, size: 896)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !496, file: !21, line: 2827, baseType: !295, size: 64, offset: 896)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !496, file: !21, line: 2828, baseType: !295, size: 64, offset: 960)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !496, file: !21, line: 2829, baseType: !295, size: 64, offset: 1024)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !496, file: !21, line: 2830, baseType: !295, size: 64, offset: 1088)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !496, file: !21, line: 2831, baseType: !295, size: 64, offset: 1152)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !297, file: !21, line: 3389, baseType: !505, size: 1024)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !21, line: 2850, size: 1024, elements: !506)
!506 = !{!507, !508, !509}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !505, file: !21, line: 2851, baseType: !449, size: 960)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !505, file: !21, line: 2852, baseType: !250, size: 32, offset: 960)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !505, file: !21, line: 2853, baseType: !250, size: 32, offset: 992)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !297, file: !21, line: 3390, baseType: !511, size: 1024)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !21, line: 2857, size: 1024, elements: !512)
!512 = !{!513, !514}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !511, file: !21, line: 2858, baseType: !449, size: 960)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !511, file: !21, line: 2859, baseType: !487, size: 64, offset: 960)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !297, file: !21, line: 3391, baseType: !516, size: 960)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !21, line: 2862, size: 960, elements: !517)
!517 = !{!518}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !516, file: !21, line: 2863, baseType: !449, size: 960)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !297, file: !21, line: 3392, baseType: !520, size: 1472)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !21, line: 3304, size: 1472, elements: !521)
!521 = !{!522}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !520, file: !21, line: 3305, baseType: !454, size: 1472)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !297, file: !21, line: 3393, baseType: !524, size: 1792)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !21, line: 3248, size: 1792, elements: !525)
!525 = !{!526, !527, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !524, file: !21, line: 3249, baseType: !454, size: 1472)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !524, file: !21, line: 3251, baseType: !528, size: 64, offset: 1472)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !530, line: 463, size: 1152, elements: !531)
!530 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!531 = !{!532, !535, !567, !568, !571, !574, !626, !627, !628, !629, !630, !656, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !529, file: !530, line: 464, baseType: !533, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !530, line: 464, flags: DIFlagFwdDecl)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !529, file: !530, line: 467, baseType: !536, size: 64, offset: 64)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !4, line: 374, size: 640, elements: !538)
!538 = !{!539, !540, !541, !554, !555, !556, !557, !558, !559, !563, !565, !566}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !537, file: !4, line: 377, baseType: !258, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !537, file: !4, line: 378, baseType: !258, size: 64, offset: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !537, file: !4, line: 381, baseType: !542, size: 64, offset: 128)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !4, line: 282, baseType: !544)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !4, line: 282, size: 128, elements: !545)
!545 = !{!546}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !544, file: !4, line: 282, baseType: !547, size: 128)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !4, line: 281, baseType: !548)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !4, line: 281, size: 128, elements: !549)
!549 = !{!550, !551, !552}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !548, file: !4, line: 281, baseType: !5, size: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !548, file: !4, line: 281, baseType: !5, size: 32, offset: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !548, file: !4, line: 281, baseType: !553, size: 64, offset: 64)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !258, size: 64, elements: !377)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !537, file: !4, line: 384, baseType: !250, size: 32, offset: 192)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !537, file: !4, line: 387, baseType: !250, size: 32, offset: 224)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !537, file: !4, line: 390, baseType: !250, size: 32, offset: 256)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !537, file: !4, line: 394, baseType: !542, size: 64, offset: 320)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !537, file: !4, line: 396, baseType: !3, size: 32, offset: 384)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !537, file: !4, line: 399, baseType: !560, size: 64, offset: 416)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 64, elements: !561)
!561 = !{!562}
!562 = !DISubrange(count: 2)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !537, file: !4, line: 402, baseType: !564, size: 64, offset: 480)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !561)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !537, file: !4, line: 406, baseType: !250, size: 32, offset: 544)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !537, file: !4, line: 409, baseType: !250, size: 32, offset: 576)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !529, file: !530, line: 470, baseType: !287, size: 64, offset: 128)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !529, file: !530, line: 473, baseType: !569, size: 64, offset: 192)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !530, line: 166, flags: DIFlagFwdDecl)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !529, file: !530, line: 476, baseType: !572, size: 64, offset: 256)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !530, line: 476, flags: DIFlagFwdDecl)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !529, file: !530, line: 479, baseType: !575, size: 64, offset: 320)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !576, line: 144, baseType: !577)
!576 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !576, line: 100, size: 896, elements: !579)
!579 = !{!580, !588, !593, !598, !600, !603, !604, !605, !606, !607, !612, !614, !615, !620, !625}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !578, file: !576, line: 102, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !576, line: 52, baseType: !582)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{!585, !586}
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !576, line: 47, baseType: !5)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !578, file: !576, line: 105, baseType: !589, size: 64, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !576, line: 59, baseType: !590)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{!250, !586, !586}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !578, file: !576, line: 108, baseType: !594, size: 64, offset: 128)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !576, line: 63, baseType: !595)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DISubroutineType(types: !597)
!597 = !{null, !254}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !578, file: !576, line: 111, baseType: !599, size: 64, offset: 192)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !578, file: !576, line: 114, baseType: !601, size: 64, offset: 256)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !602, line: 46, baseType: !348)
!602 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!603 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !578, file: !576, line: 117, baseType: !601, size: 64, offset: 320)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !578, file: !576, line: 120, baseType: !601, size: 64, offset: 384)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !578, file: !576, line: 124, baseType: !5, size: 32, offset: 448)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !578, file: !576, line: 128, baseType: !5, size: 32, offset: 480)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !578, file: !576, line: 131, baseType: !608, size: 64, offset: 512)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !576, line: 75, baseType: !609)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DISubroutineType(types: !611)
!611 = !{!254, !601, !601}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !578, file: !576, line: 132, baseType: !613, size: 64, offset: 576)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !576, line: 78, baseType: !595)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !578, file: !576, line: 135, baseType: !254, size: 64, offset: 640)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !578, file: !576, line: 136, baseType: !616, size: 64, offset: 704)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !576, line: 82, baseType: !617)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{!254, !254, !601, !601}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !578, file: !576, line: 137, baseType: !621, size: 64, offset: 768)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !576, line: 83, baseType: !622)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{null, !254, !254}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !578, file: !576, line: 141, baseType: !5, size: 32, offset: 832)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !529, file: !530, line: 484, baseType: !295, size: 64, offset: 384)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !529, file: !530, line: 488, baseType: !295, size: 64, offset: 448)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !529, file: !530, line: 493, baseType: !295, size: 64, offset: 512)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !529, file: !530, line: 496, baseType: !295, size: 64, offset: 576)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !529, file: !530, line: 501, baseType: !631, size: 64, offset: 640)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !16, line: 2355, size: 576, elements: !633)
!633 = !{!634, !637, !638, !639, !640, !644, !645, !650, !651, !652, !653, !654, !655}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !632, file: !16, line: 2356, baseType: !635, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !16, line: 2356, flags: DIFlagFwdDecl)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !632, file: !16, line: 2357, baseType: !255, size: 64, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !632, file: !16, line: 2358, baseType: !250, size: 32, offset: 128)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !632, file: !16, line: 2359, baseType: !250, size: 32, offset: 160)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !632, file: !16, line: 2360, baseType: !641, size: 128, offset: 192)
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 128, elements: !642)
!642 = !{!643}
!643 = !DISubrange(count: 4)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !632, file: !16, line: 2364, baseType: !250, size: 32, offset: 320)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !632, file: !16, line: 2367, baseType: !646, size: 128, offset: 384)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !16, line: 2349, size: 128, elements: !647)
!647 = !{!648, !649}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !646, file: !16, line: 2351, baseType: !290, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !646, file: !16, line: 2352, baseType: !350, size: 64, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !632, file: !16, line: 2371, baseType: !15, size: 32, offset: 512)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !632, file: !16, line: 2374, baseType: !5, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !632, file: !16, line: 2377, baseType: !5, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !632, file: !16, line: 2381, baseType: !5, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !632, file: !16, line: 2392, baseType: !5, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !632, file: !16, line: 2396, baseType: !5, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !529, file: !530, line: 504, baseType: !657, size: 64, offset: 704)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !530, line: 504, flags: DIFlagFwdDecl)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !529, file: !530, line: 507, baseType: !575, size: 64, offset: 768)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !529, file: !530, line: 510, baseType: !250, size: 32, offset: 832)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !529, file: !530, line: 513, baseType: !250, size: 32, offset: 864)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !529, file: !530, line: 516, baseType: !403, size: 32, offset: 896)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !529, file: !530, line: 519, baseType: !403, size: 32, offset: 928)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !529, file: !530, line: 522, baseType: !5, size: 32, offset: 960)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !529, file: !530, line: 523, baseType: !5, size: 32, offset: 992)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !529, file: !530, line: 528, baseType: !255, size: 64, offset: 1024)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !529, file: !530, line: 535, baseType: !5, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !529, file: !530, line: 539, baseType: !5, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !529, file: !530, line: 543, baseType: !5, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !529, file: !530, line: 546, baseType: !5, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !529, file: !530, line: 550, baseType: !5, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !529, file: !530, line: 554, baseType: !5, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !529, file: !530, line: 559, baseType: !5, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !529, file: !530, line: 562, baseType: !5, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !529, file: !530, line: 571, baseType: !5, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !529, file: !530, line: 573, baseType: !5, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !529, file: !530, line: 574, baseType: !5, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !529, file: !530, line: 581, baseType: !5, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !529, file: !530, line: 585, baseType: !5, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !529, file: !530, line: 588, baseType: !5, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !529, file: !530, line: 592, baseType: !5, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !529, file: !530, line: 598, baseType: !5, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !524, file: !21, line: 3254, baseType: !295, size: 64, offset: 1536)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !524, file: !21, line: 3257, baseType: !295, size: 64, offset: 1600)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !524, file: !21, line: 3258, baseType: !295, size: 64, offset: 1664)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !524, file: !21, line: 3264, baseType: !5, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !524, file: !21, line: 3265, baseType: !5, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !524, file: !21, line: 3267, baseType: !5, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !524, file: !21, line: 3268, baseType: !5, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !524, file: !21, line: 3269, baseType: !5, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !524, file: !21, line: 3271, baseType: !5, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !524, file: !21, line: 3272, baseType: !5, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !524, file: !21, line: 3273, baseType: !5, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !524, file: !21, line: 3274, baseType: !5, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !524, file: !21, line: 3275, baseType: !5, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !524, file: !21, line: 3276, baseType: !5, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !524, file: !21, line: 3277, baseType: !5, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !524, file: !21, line: 3279, baseType: !5, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !524, file: !21, line: 3280, baseType: !5, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !524, file: !21, line: 3281, baseType: !5, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !524, file: !21, line: 3282, baseType: !5, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !524, file: !21, line: 3283, baseType: !5, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !524, file: !21, line: 3284, baseType: !5, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !297, file: !21, line: 3394, baseType: !705, size: 1344)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !21, line: 2279, size: 1344, elements: !706)
!706 = !{!707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !732, !733, !734, !742, !743, !744, !745, !746, !747, !748, !749, !750}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !705, file: !21, line: 2280, baseType: !333, size: 192)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !705, file: !21, line: 2281, baseType: !295, size: 64, offset: 192)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !705, file: !21, line: 2282, baseType: !295, size: 64, offset: 256)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !705, file: !21, line: 2283, baseType: !295, size: 64, offset: 320)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !705, file: !21, line: 2284, baseType: !295, size: 64, offset: 384)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !705, file: !21, line: 2285, baseType: !5, size: 32, offset: 448)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !705, file: !21, line: 2287, baseType: !5, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !705, file: !21, line: 2288, baseType: !5, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !705, file: !21, line: 2289, baseType: !5, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !705, file: !21, line: 2290, baseType: !5, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !705, file: !21, line: 2291, baseType: !5, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !705, file: !21, line: 2292, baseType: !5, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !705, file: !21, line: 2294, baseType: !5, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !705, file: !21, line: 2296, baseType: !5, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !705, file: !21, line: 2297, baseType: !5, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !705, file: !21, line: 2298, baseType: !5, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !705, file: !21, line: 2299, baseType: !5, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !705, file: !21, line: 2300, baseType: !5, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !705, file: !21, line: 2301, baseType: !5, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !705, file: !21, line: 2302, baseType: !5, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !705, file: !21, line: 2303, baseType: !5, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !705, file: !21, line: 2305, baseType: !5, size: 32, offset: 512)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !705, file: !21, line: 2306, baseType: !730, size: 32, offset: 544)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !731, line: 31, baseType: !250)
!731 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!732 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !705, file: !21, line: 2307, baseType: !295, size: 64, offset: 576)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !705, file: !21, line: 2308, baseType: !295, size: 64, offset: 640)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !705, file: !21, line: 2314, baseType: !735, size: 64, offset: 704)
!735 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !21, line: 2309, size: 64, elements: !736)
!736 = !{!737, !738, !739}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !735, file: !21, line: 2310, baseType: !250, size: 32)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !735, file: !21, line: 2311, baseType: !255, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !735, file: !21, line: 2312, baseType: !740, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !21, line: 2277, flags: DIFlagFwdDecl)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !705, file: !21, line: 2315, baseType: !295, size: 64, offset: 768)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !705, file: !21, line: 2316, baseType: !295, size: 64, offset: 832)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !705, file: !21, line: 2317, baseType: !295, size: 64, offset: 896)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !705, file: !21, line: 2318, baseType: !295, size: 64, offset: 960)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !705, file: !21, line: 2319, baseType: !295, size: 64, offset: 1024)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !705, file: !21, line: 2320, baseType: !295, size: 64, offset: 1088)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !705, file: !21, line: 2321, baseType: !295, size: 64, offset: 1152)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !705, file: !21, line: 2322, baseType: !295, size: 64, offset: 1216)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !705, file: !21, line: 2324, baseType: !751, size: 64, offset: 1280)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !21, line: 2324, flags: DIFlagFwdDecl)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !297, file: !21, line: 3395, baseType: !754, size: 320)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !21, line: 1469, size: 320, elements: !755)
!755 = !{!756, !757, !758}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !754, file: !21, line: 1470, baseType: !333, size: 192)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !754, file: !21, line: 1471, baseType: !295, size: 64, offset: 192)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !754, file: !21, line: 1472, baseType: !295, size: 64, offset: 256)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !297, file: !21, line: 3396, baseType: !760, size: 320)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !21, line: 1482, size: 320, elements: !761)
!761 = !{!762, !763, !764}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !760, file: !21, line: 1483, baseType: !333, size: 192)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !760, file: !21, line: 1484, baseType: !250, size: 32, offset: 192)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !760, file: !21, line: 1485, baseType: !765, size: 64, offset: 256)
!765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 64, elements: !377)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !297, file: !21, line: 3397, baseType: !767, size: 384)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !21, line: 1829, size: 384, elements: !768)
!768 = !{!769, !770, !771, !772}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !767, file: !21, line: 1830, baseType: !333, size: 192)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !767, file: !21, line: 1831, baseType: !403, size: 32, offset: 192)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !767, file: !21, line: 1832, baseType: !295, size: 64, offset: 256)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !767, file: !21, line: 1835, baseType: !765, size: 64, offset: 320)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !297, file: !21, line: 3398, baseType: !774, size: 704)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !21, line: 1898, size: 704, elements: !775)
!775 = !{!776, !777, !778, !782, !783, !786}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !774, file: !21, line: 1899, baseType: !333, size: 192)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !774, file: !21, line: 1902, baseType: !295, size: 64, offset: 192)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !774, file: !21, line: 1905, baseType: !779, size: 64, offset: 256)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !259, line: 58, baseType: !780)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !259, line: 57, flags: DIFlagFwdDecl)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !774, file: !21, line: 1908, baseType: !5, size: 32, offset: 320)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !774, file: !21, line: 1911, baseType: !784, size: 64, offset: 384)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !21, line: 1876, flags: DIFlagFwdDecl)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !774, file: !21, line: 1914, baseType: !787, size: 256, offset: 448)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !21, line: 1883, size: 256, elements: !788)
!788 = !{!789, !791, !792, !797}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !787, file: !21, line: 1884, baseType: !790, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !787, file: !21, line: 1885, baseType: !790, size: 64, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !787, file: !21, line: 1891, baseType: !793, size: 64, offset: 128)
!793 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !787, file: !21, line: 1891, size: 64, elements: !794)
!794 = !{!795, !796}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !793, file: !21, line: 1891, baseType: !779, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !793, file: !21, line: 1891, baseType: !295, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !787, file: !21, line: 1892, baseType: !798, size: 64, offset: 192)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !297, file: !21, line: 3399, baseType: !800, size: 704)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !21, line: 2008, size: 704, elements: !801)
!801 = !{!802, !803, !804, !805, !806, !807, !819, !820, !821, !822, !823}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !800, file: !21, line: 2009, baseType: !333, size: 192)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !800, file: !21, line: 2011, baseType: !5, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !800, file: !21, line: 2012, baseType: !5, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !800, file: !21, line: 2014, baseType: !403, size: 32, offset: 224)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !800, file: !21, line: 2016, baseType: !295, size: 64, offset: 256)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !800, file: !21, line: 2017, baseType: !808, size: 64, offset: 320)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !21, line: 183, baseType: !810)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !21, line: 183, size: 128, elements: !811)
!811 = !{!812}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !810, file: !21, line: 183, baseType: !813, size: 128)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !21, line: 182, baseType: !814)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !21, line: 182, size: 128, elements: !815)
!815 = !{!816, !817, !818}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !814, file: !21, line: 182, baseType: !5, size: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !814, file: !21, line: 182, baseType: !5, size: 32, offset: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !814, file: !21, line: 182, baseType: !765, size: 64, offset: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !800, file: !21, line: 2019, baseType: !295, size: 64, offset: 384)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !800, file: !21, line: 2020, baseType: !295, size: 64, offset: 448)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !800, file: !21, line: 2021, baseType: !295, size: 64, offset: 512)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !800, file: !21, line: 2022, baseType: !295, size: 64, offset: 576)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !800, file: !21, line: 2023, baseType: !295, size: 64, offset: 640)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !297, file: !21, line: 3400, baseType: !825, size: 832)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !21, line: 2430, size: 832, elements: !826)
!826 = !{!827, !828, !829, !830, !831, !832, !833, !834, !835, !836}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !825, file: !21, line: 2431, baseType: !333, size: 192)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !825, file: !21, line: 2433, baseType: !295, size: 64, offset: 192)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !825, file: !21, line: 2434, baseType: !295, size: 64, offset: 256)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !825, file: !21, line: 2435, baseType: !295, size: 64, offset: 320)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !825, file: !21, line: 2436, baseType: !295, size: 64, offset: 384)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "base_accesses", scope: !825, file: !21, line: 2437, baseType: !808, size: 64, offset: 448)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "inheritance", scope: !825, file: !21, line: 2438, baseType: !295, size: 64, offset: 512)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_subvtt", scope: !825, file: !21, line: 2440, baseType: !295, size: 64, offset: 576)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_vptr", scope: !825, file: !21, line: 2441, baseType: !295, size: 64, offset: 640)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "base_binfos", scope: !825, file: !21, line: 2443, baseType: !837, size: 128, offset: 704)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_none", file: !21, line: 182, baseType: !838)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_none", file: !21, line: 182, size: 128, elements: !839)
!839 = !{!840}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !838, file: !21, line: 182, baseType: !813, size: 128)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "stmt_list", scope: !297, file: !21, line: 3401, baseType: !842, size: 320)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list", file: !21, line: 3327, size: 320, elements: !843)
!843 = !{!844, !845, !852}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !842, file: !21, line: 3329, baseType: !333, size: 192)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !842, file: !21, line: 3330, baseType: !846, size: 64, offset: 192)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list_node", file: !21, line: 3320, size: 192, elements: !848)
!848 = !{!849, !850, !851}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !847, file: !21, line: 3322, baseType: !846, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !847, file: !21, line: 3323, baseType: !846, size: 64, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !847, file: !21, line: 3324, baseType: !295, size: 64, offset: 128)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !842, file: !21, line: 3331, baseType: !846, size: 64, offset: 256)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "constructor", scope: !297, file: !21, line: 3402, baseType: !854, size: 256)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_constructor", file: !21, line: 1540, size: 256, elements: !855)
!855 = !{!856, !857}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !854, file: !21, line: 1541, baseType: !333, size: 192)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !854, file: !21, line: 1542, baseType: !858, size: 64, offset: 192)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_gc", file: !21, line: 1538, baseType: !860)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_gc", file: !21, line: 1538, size: 192, elements: !861)
!861 = !{!862}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !860, file: !21, line: 1538, baseType: !863, size: 192)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_base", file: !21, line: 1537, baseType: !864)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_base", file: !21, line: 1537, size: 192, elements: !865)
!865 = !{!866, !867, !868}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !864, file: !21, line: 1537, baseType: !5, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !864, file: !21, line: 1537, baseType: !5, size: 32, offset: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !864, file: !21, line: 1537, baseType: !869, size: 128, offset: 64)
!869 = !DICompositeType(tag: DW_TAG_array_type, baseType: !870, size: 128, elements: !377)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "constructor_elt", file: !21, line: 1535, baseType: !871)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "constructor_elt_d", file: !21, line: 1532, size: 128, elements: !872)
!872 = !{!873, !874}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !871, file: !21, line: 1533, baseType: !295, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !871, file: !21, line: 1534, baseType: !295, size: 64, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "omp_clause", scope: !297, file: !21, line: 3403, baseType: !876, size: 512)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_omp_clause", file: !21, line: 1938, size: 512, elements: !877)
!877 = !{!878, !879, !880, !881, !887, !888, !889}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !876, file: !21, line: 1939, baseType: !333, size: 192)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !876, file: !21, line: 1940, baseType: !403, size: 32, offset: 192)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !876, file: !21, line: 1941, baseType: !20, size: 32, offset: 224)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !876, file: !21, line: 1946, baseType: !882, size: 32, offset: 256)
!882 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "omp_clause_subcode", file: !21, line: 1942, size: 32, elements: !883)
!883 = !{!884, !885, !886}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "default_kind", scope: !882, file: !21, line: 1943, baseType: !39, size: 32)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "schedule_kind", scope: !882, file: !21, line: 1944, baseType: !46, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "reduction_code", scope: !882, file: !21, line: 1945, baseType: !53, size: 32)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reduction_init", scope: !876, file: !21, line: 1950, baseType: !286, size: 64, offset: 320)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reduction_merge", scope: !876, file: !21, line: 1951, baseType: !286, size: 64, offset: 384)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !876, file: !21, line: 1953, baseType: !765, size: 64, offset: 448)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "optimization", scope: !297, file: !21, line: 3404, baseType: !891, size: 1664)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_optimization_option", file: !21, line: 3337, size: 1664, elements: !892)
!892 = !{!893, !894}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !891, file: !21, line: 3338, baseType: !333, size: 192)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !891, file: !21, line: 3341, baseType: !895, size: 1472, offset: 192)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cl_optimization", file: !896, line: 410, size: 1472, elements: !897)
!896 = !DIFile(filename: "./options.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!897 = !{!898, !899, !900, !901, !902, !903, !904, !905, !906, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "align_functions", scope: !895, file: !896, line: 412, baseType: !250, size: 32)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "align_jumps", scope: !895, file: !896, line: 413, baseType: !250, size: 32, offset: 32)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "align_labels", scope: !895, file: !896, line: 414, baseType: !250, size: 32, offset: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "align_loops", scope: !895, file: !896, line: 415, baseType: !250, size: 32, offset: 96)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_stalled_insns", scope: !895, file: !896, line: 416, baseType: !250, size: 32, offset: 128)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_stalled_insns_dep", scope: !895, file: !896, line: 417, baseType: !250, size: 32, offset: 160)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "optimize", scope: !895, file: !896, line: 418, baseType: !249, size: 8, offset: 192)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_size", scope: !895, file: !896, line: 419, baseType: !249, size: 8, offset: 200)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "flag_argument_noalias", scope: !895, file: !896, line: 420, baseType: !907, size: 8, offset: 208)
!907 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "flag_asynchronous_unwind_tables", scope: !895, file: !896, line: 421, baseType: !907, size: 8, offset: 216)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_on_count_reg", scope: !895, file: !896, line: 422, baseType: !907, size: 8, offset: 224)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_probabilities", scope: !895, file: !896, line: 423, baseType: !907, size: 8, offset: 232)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_target_load_optimize", scope: !895, file: !896, line: 424, baseType: !907, size: 8, offset: 240)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_target_load_optimize2", scope: !895, file: !896, line: 425, baseType: !907, size: 8, offset: 248)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "flag_btr_bb_exclusive", scope: !895, file: !896, line: 426, baseType: !907, size: 8, offset: 256)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "flag_caller_saves", scope: !895, file: !896, line: 427, baseType: !907, size: 8, offset: 264)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "flag_no_common", scope: !895, file: !896, line: 428, baseType: !907, size: 8, offset: 272)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "flag_conserve_stack", scope: !895, file: !896, line: 429, baseType: !907, size: 8, offset: 280)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cprop_registers", scope: !895, file: !896, line: 430, baseType: !907, size: 8, offset: 288)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "flag_crossjumping", scope: !895, file: !896, line: 431, baseType: !907, size: 8, offset: 296)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cse_follow_jumps", scope: !895, file: !896, line: 432, baseType: !907, size: 8, offset: 304)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cx_fortran_rules", scope: !895, file: !896, line: 433, baseType: !907, size: 8, offset: 312)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cx_limited_range", scope: !895, file: !896, line: 434, baseType: !907, size: 8, offset: 320)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "flag_data_sections", scope: !895, file: !896, line: 435, baseType: !907, size: 8, offset: 328)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "flag_dce", scope: !895, file: !896, line: 436, baseType: !907, size: 8, offset: 336)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "flag_defer_pop", scope: !895, file: !896, line: 437, baseType: !907, size: 8, offset: 344)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "flag_delayed_branch", scope: !895, file: !896, line: 438, baseType: !907, size: 8, offset: 352)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "flag_delete_null_pointer_checks", scope: !895, file: !896, line: 439, baseType: !907, size: 8, offset: 360)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "flag_dse", scope: !895, file: !896, line: 440, baseType: !907, size: 8, offset: 368)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "flag_early_inlining", scope: !895, file: !896, line: 441, baseType: !907, size: 8, offset: 376)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "flag_exceptions", scope: !895, file: !896, line: 442, baseType: !907, size: 8, offset: 384)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "flag_expensive_optimizations", scope: !895, file: !896, line: 443, baseType: !907, size: 8, offset: 392)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "flag_finite_math_only", scope: !895, file: !896, line: 444, baseType: !907, size: 8, offset: 400)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "flag_float_store", scope: !895, file: !896, line: 445, baseType: !907, size: 8, offset: 408)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "flag_forward_propagate", scope: !895, file: !896, line: 446, baseType: !907, size: 8, offset: 416)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse", scope: !895, file: !896, line: 447, baseType: !907, size: 8, offset: 424)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_after_reload", scope: !895, file: !896, line: 448, baseType: !907, size: 8, offset: 432)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_las", scope: !895, file: !896, line: 449, baseType: !907, size: 8, offset: 440)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_lm", scope: !895, file: !896, line: 450, baseType: !907, size: 8, offset: 448)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_sm", scope: !895, file: !896, line: 451, baseType: !907, size: 8, offset: 456)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "flag_graphite_identity", scope: !895, file: !896, line: 452, baseType: !907, size: 8, offset: 464)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "flag_guess_branch_prob", scope: !895, file: !896, line: 453, baseType: !907, size: 8, offset: 472)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "flag_if_conversion", scope: !895, file: !896, line: 454, baseType: !907, size: 8, offset: 480)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "flag_if_conversion2", scope: !895, file: !896, line: 455, baseType: !907, size: 8, offset: 488)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_functions", scope: !895, file: !896, line: 456, baseType: !907, size: 8, offset: 496)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_functions_called_once", scope: !895, file: !896, line: 457, baseType: !907, size: 8, offset: 504)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_small_functions", scope: !895, file: !896, line: 458, baseType: !907, size: 8, offset: 512)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_cp", scope: !895, file: !896, line: 459, baseType: !907, size: 8, offset: 520)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_cp_clone", scope: !895, file: !896, line: 460, baseType: !907, size: 8, offset: 528)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_matrix_reorg", scope: !895, file: !896, line: 461, baseType: !907, size: 8, offset: 536)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_pta", scope: !895, file: !896, line: 462, baseType: !907, size: 8, offset: 544)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_pure_const", scope: !895, file: !896, line: 463, baseType: !907, size: 8, offset: 552)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_reference", scope: !895, file: !896, line: 464, baseType: !907, size: 8, offset: 560)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_sra", scope: !895, file: !896, line: 465, baseType: !907, size: 8, offset: 568)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_type_escape", scope: !895, file: !896, line: 466, baseType: !907, size: 8, offset: 576)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ivopts", scope: !895, file: !896, line: 467, baseType: !907, size: 8, offset: 584)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "flag_jump_tables", scope: !895, file: !896, line: 468, baseType: !907, size: 8, offset: 592)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_block", scope: !895, file: !896, line: 469, baseType: !907, size: 8, offset: 600)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_interchange", scope: !895, file: !896, line: 470, baseType: !907, size: 8, offset: 608)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_parallelize_all", scope: !895, file: !896, line: 471, baseType: !907, size: 8, offset: 616)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_strip_mine", scope: !895, file: !896, line: 472, baseType: !907, size: 8, offset: 624)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "flag_lto_report", scope: !895, file: !896, line: 473, baseType: !907, size: 8, offset: 632)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ltrans", scope: !895, file: !896, line: 474, baseType: !907, size: 8, offset: 640)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "flag_errno_math", scope: !895, file: !896, line: 475, baseType: !907, size: 8, offset: 648)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "flag_merge_constants", scope: !895, file: !896, line: 476, baseType: !907, size: 8, offset: 656)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "flag_modulo_sched", scope: !895, file: !896, line: 477, baseType: !907, size: 8, offset: 664)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "flag_move_loop_invariants", scope: !895, file: !896, line: 478, baseType: !907, size: 8, offset: 672)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "flag_non_call_exceptions", scope: !895, file: !896, line: 479, baseType: !907, size: 8, offset: 680)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "flag_omit_frame_pointer", scope: !895, file: !896, line: 480, baseType: !907, size: 8, offset: 688)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "flag_regmove", scope: !895, file: !896, line: 481, baseType: !907, size: 8, offset: 696)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "flag_optimize_sibling_calls", scope: !895, file: !896, line: 482, baseType: !907, size: 8, offset: 704)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "flag_pack_struct", scope: !895, file: !896, line: 483, baseType: !907, size: 8, offset: 712)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "flag_peel_loops", scope: !895, file: !896, line: 484, baseType: !907, size: 8, offset: 720)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "flag_no_peephole", scope: !895, file: !896, line: 485, baseType: !907, size: 8, offset: 728)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "flag_peephole2", scope: !895, file: !896, line: 486, baseType: !907, size: 8, offset: 736)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "flag_predictive_commoning", scope: !895, file: !896, line: 487, baseType: !907, size: 8, offset: 744)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "flag_prefetch_loop_arrays", scope: !895, file: !896, line: 488, baseType: !907, size: 8, offset: 752)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "flag_pcc_struct_return", scope: !895, file: !896, line: 489, baseType: !907, size: 8, offset: 760)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "flag_rename_registers", scope: !895, file: !896, line: 490, baseType: !907, size: 8, offset: 768)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "flag_reorder_blocks", scope: !895, file: !896, line: 491, baseType: !907, size: 8, offset: 776)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "flag_reorder_blocks_and_partition", scope: !895, file: !896, line: 492, baseType: !907, size: 8, offset: 784)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "flag_reorder_functions", scope: !895, file: !896, line: 493, baseType: !907, size: 8, offset: 792)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "flag_rerun_cse_after_loop", scope: !895, file: !896, line: 494, baseType: !907, size: 8, offset: 800)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "flag_resched_modulo_sched", scope: !895, file: !896, line: 495, baseType: !907, size: 8, offset: 808)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "flag_rounding_math", scope: !895, file: !896, line: 496, baseType: !907, size: 8, offset: 816)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_critical_path_heuristic", scope: !895, file: !896, line: 497, baseType: !907, size: 8, offset: 824)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_dep_count_heuristic", scope: !895, file: !896, line: 498, baseType: !907, size: 8, offset: 832)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_group_heuristic", scope: !895, file: !896, line: 499, baseType: !907, size: 8, offset: 840)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_interblock", scope: !895, file: !896, line: 500, baseType: !907, size: 8, offset: 848)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_last_insn_heuristic", scope: !895, file: !896, line: 501, baseType: !907, size: 8, offset: 856)
