; ModuleID = 'double-int.bc'
source_filename = "double-int.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.stat64 = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }

!178 = !DIEnumerator(name: "CASE_LABEL_EXPR", value: 139, isUnsigned: true)
!179 = !DIEnumerator(name: "ASM_EXPR", value: 140, isUnsigned: true)
!180 = !DIEnumerator(name: "SSA_NAME", value: 141, isUnsigned: true)
!181 = !DIEnumerator(name: "CATCH_EXPR", value: 142, isUnsigned: true)
!182 = !DIEnumerator(name: "EH_FILTER_EXPR", value: 143, isUnsigned: true)
!183 = !DIEnumerator(name: "SCEV_KNOWN", value: 144, isUnsigned: true)
!184 = !DIEnumerator(name: "SCEV_NOT_KNOWN", value: 145, isUnsigned: true)
!185 = !DIEnumerator(name: "POLYNOMIAL_CHREC", value: 146, isUnsigned: true)
!186 = !DIEnumerator(name: "STATEMENT_LIST", value: 147, isUnsigned: true)
!187 = !DIEnumerator(name: "ASSERT_EXPR", value: 148, isUnsigned: true)
!188 = !DIEnumerator(name: "TREE_BINFO", value: 149, isUnsigned: true)
!189 = !DIEnumerator(name: "WITH_SIZE_EXPR", value: 150, isUnsigned: true)
!190 = !DIEnumerator(name: "REALIGN_LOAD_EXPR", value: 151, isUnsigned: true)
!191 = !DIEnumerator(name: "TARGET_MEM_REF", value: 152, isUnsigned: true)
!192 = !DIEnumerator(name: "OMP_PARALLEL", value: 153, isUnsigned: true)
!193 = !DIEnumerator(name: "OMP_TASK", value: 154, isUnsigned: true)
!194 = !DIEnumerator(name: "OMP_FOR", value: 155, isUnsigned: true)
!195 = !DIEnumerator(name: "OMP_SECTIONS", value: 156, isUnsigned: true)
!196 = !DIEnumerator(name: "OMP_SINGLE", value: 157, isUnsigned: true)
!197 = !DIEnumerator(name: "OMP_SECTION", value: 158, isUnsigned: true)
!198 = !DIEnumerator(name: "OMP_MASTER", value: 159, isUnsigned: true)
!199 = !DIEnumerator(name: "OMP_ORDERED", value: 160, isUnsigned: true)
!200 = !DIEnumerator(name: "OMP_CRITICAL", value: 161, isUnsigned: true)
!201 = !DIEnumerator(name: "OMP_ATOMIC", value: 162, isUnsigned: true)
!202 = !DIEnumerator(name: "OMP_CLAUSE", value: 163, isUnsigned: true)
!203 = !DIEnumerator(name: "REDUC_MAX_EXPR", value: 164, isUnsigned: true)
!204 = !DIEnumerator(name: "REDUC_MIN_EXPR", value: 165, isUnsigned: true)
!205 = !DIEnumerator(name: "REDUC_PLUS_EXPR", value: 166, isUnsigned: true)
!206 = !DIEnumerator(name: "DOT_PROD_EXPR", value: 167, isUnsigned: true)
!207 = !DIEnumerator(name: "WIDEN_SUM_EXPR", value: 168, isUnsigned: true)
!208 = !DIEnumerator(name: "WIDEN_MULT_EXPR", value: 169, isUnsigned: true)
!209 = !DIEnumerator(name: "VEC_LSHIFT_EXPR", value: 170, isUnsigned: true)
!210 = !DIEnumerator(name: "VEC_RSHIFT_EXPR", value: 171, isUnsigned: true)
!211 = !DIEnumerator(name: "VEC_WIDEN_MULT_HI_EXPR", value: 172, isUnsigned: true)
!212 = !DIEnumerator(name: "VEC_WIDEN_MULT_LO_EXPR", value: 173, isUnsigned: true)
!213 = !DIEnumerator(name: "VEC_UNPACK_HI_EXPR", value: 174, isUnsigned: true)
!214 = !DIEnumerator(name: "VEC_UNPACK_LO_EXPR", value: 175, isUnsigned: true)
!215 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_HI_EXPR", value: 176, isUnsigned: true)
!216 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_LO_EXPR", value: 177, isUnsigned: true)
!217 = !DIEnumerator(name: "VEC_PACK_TRUNC_EXPR", value: 178, isUnsigned: true)
!218 = !DIEnumerator(name: "VEC_PACK_SAT_EXPR", value: 179, isUnsigned: true)
!219 = !DIEnumerator(name: "VEC_PACK_FIX_TRUNC_EXPR", value: 180, isUnsigned: true)
!220 = !DIEnumerator(name: "VEC_EXTRACT_EVEN_EXPR", value: 181, isUnsigned: true)
!221 = !DIEnumerator(name: "VEC_EXTRACT_ODD_EXPR", value: 182, isUnsigned: true)
!222 = !DIEnumerator(name: "VEC_INTERLEAVE_HIGH_EXPR", value: 183, isUnsigned: true)
!223 = !DIEnumerator(name: "VEC_INTERLEAVE_LOW_EXPR", value: 184, isUnsigned: true)
!224 = !DIEnumerator(name: "PREDICT_EXPR", value: 185, isUnsigned: true)
!225 = !DIEnumerator(name: "OPTIMIZATION_NODE", value: 186, isUnsigned: true)
!226 = !DIEnumerator(name: "TARGET_OPTION_NODE", value: 187, isUnsigned: true)
!227 = !DIEnumerator(name: "LAST_AND_UNUSED_TREE_CODE", value: 188, isUnsigned: true)
!228 = !DIEnumerator(name: "C_MAYBE_CONST_EXPR", value: 189, isUnsigned: true)
!229 = !DIEnumerator(name: "EXCESS_PRECISION_EXPR", value: 190, isUnsigned: true)
!230 = !DIEnumerator(name: "MAX_TREE_CODES", value: 191, isUnsigned: true)
!231 = !{!232, !233, !234, !235, !238, !239, !241, !242, !37, !243}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!234 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !237)
!241 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!242 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!244 = !{i32 2, !"Dwarf Version", i32 4}
!245 = !{i32 2, !"Debug Info Version", i32 3}
!246 = !{i32 1, !"wchar_size", i32 4}
!247 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!248 = distinct !DISubprogram(name: "vprintf", scope: !249, file: !249, line: 39, type: !250, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !260)
!249 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!250 = !DISubroutineType(types: !251)
!251 = !{!234, !252, !253}
!252 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !239)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, elements: !255)
!255 = !{!256, !257, !258, !259}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !254, file: !1, baseType: !5, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !254, file: !1, baseType: !5, size: 32, offset: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !254, file: !1, baseType: !238, size: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !254, file: !1, baseType: !238, size: 64, offset: 128)
!260 = !{!261, !262}
!261 = !DILocalVariable(name: "__fmt", arg: 1, scope: !248, file: !249, line: 39, type: !252)
!262 = !DILocalVariable(name: "__arg", arg: 2, scope: !248, file: !249, line: 39, type: !253)
!263 = !DILocation(line: 0, scope: !248)
!264 = !DILocation(line: 41, column: 20, scope: !248)
!265 = !DILocation(line: 41, column: 10, scope: !248)
!266 = !DILocation(line: 41, column: 3, scope: !248)
!267 = distinct !DISubprogram(name: "getchar", scope: !249, file: !249, line: 47, type: !268, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !270)
!268 = !DISubroutineType(types: !269)
!269 = !{!234}
!270 = !{}
!271 = !DILocation(line: 49, column: 16, scope: !267)
!272 = !DILocation(line: 49, column: 10, scope: !267)
!273 = !DILocation(line: 49, column: 3, scope: !267)
!274 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !249, file: !249, line: 56, type: !275, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !334)
!275 = !DISubroutineType(types: !276)
!276 = !{!234, !277}
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !279, line: 7, baseType: !280)
!279 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !281, line: 49, size: 1728, elements: !282)
!281 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!282 = !{!283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !298, !300, !301, !302, !305, !307, !309, !313, !316, !318, !321, !324, !325, !326, !329, !330}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !280, file: !281, line: 51, baseType: !234, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !280, file: !281, line: 54, baseType: !236, size: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !280, file: !281, line: 55, baseType: !236, size: 64, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !280, file: !281, line: 56, baseType: !236, size: 64, offset: 192)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !280, file: !281, line: 57, baseType: !236, size: 64, offset: 256)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !280, file: !281, line: 58, baseType: !236, size: 64, offset: 320)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !280, file: !281, line: 59, baseType: !236, size: 64, offset: 384)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !280, file: !281, line: 60, baseType: !236, size: 64, offset: 448)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !280, file: !281, line: 61, baseType: !236, size: 64, offset: 512)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !280, file: !281, line: 64, baseType: !236, size: 64, offset: 576)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !280, file: !281, line: 65, baseType: !236, size: 64, offset: 640)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !280, file: !281, line: 66, baseType: !236, size: 64, offset: 704)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !280, file: !281, line: 68, baseType: !296, size: 64, offset: 768)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !281, line: 36, flags: DIFlagFwdDecl)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !280, file: !281, line: 70, baseType: !299, size: 64, offset: 832)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !280, file: !281, line: 72, baseType: !234, size: 32, offset: 896)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !280, file: !281, line: 73, baseType: !234, size: 32, offset: 928)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !280, file: !281, line: 74, baseType: !303, size: 64, offset: 960)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !304, line: 152, baseType: !242)
!304 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !280, file: !281, line: 77, baseType: !306, size: 16, offset: 1024)
!306 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !280, file: !281, line: 78, baseType: !308, size: 8, offset: 1040)
!308 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !280, file: !281, line: 79, baseType: !310, size: 8, offset: 1048)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 8, elements: !311)
!311 = !{!312}
!312 = !DISubrange(count: 1)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !280, file: !281, line: 81, baseType: !314, size: 64, offset: 1088)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !281, line: 43, baseType: null)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !280, file: !281, line: 89, baseType: !317, size: 64, offset: 1152)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !304, line: 153, baseType: !242)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !280, file: !281, line: 91, baseType: !319, size: 64, offset: 1216)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !281, line: 37, flags: DIFlagFwdDecl)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !280, file: !281, line: 92, baseType: !322, size: 64, offset: 1280)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !281, line: 38, flags: DIFlagFwdDecl)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !280, file: !281, line: 93, baseType: !299, size: 64, offset: 1344)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !280, file: !281, line: 94, baseType: !238, size: 64, offset: 1408)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !280, file: !281, line: 95, baseType: !327, size: 64, offset: 1472)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !328, line: 46, baseType: !241)
!328 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !280, file: !281, line: 96, baseType: !234, size: 32, offset: 1536)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !280, file: !281, line: 98, baseType: !331, size: 160, offset: 1568)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 160, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 20)
!334 = !{!335}
!335 = !DILocalVariable(name: "__fp", arg: 1, scope: !274, file: !249, line: 56, type: !277)
!336 = !DILocation(line: 0, scope: !274)
!337 = !DILocation(line: 58, column: 10, scope: !274)
!338 = !DILocation(line: 58, column: 3, scope: !274)
!339 = distinct !DISubprogram(name: "getc_unlocked", scope: !249, file: !249, line: 66, type: !275, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !340)
!340 = !{!341}
!341 = !DILocalVariable(name: "__fp", arg: 1, scope: !339, file: !249, line: 66, type: !277)
!342 = !DILocation(line: 0, scope: !339)
!343 = !DILocation(line: 68, column: 10, scope: !339)
!344 = !DILocation(line: 68, column: 3, scope: !339)
!345 = distinct !DISubprogram(name: "getchar_unlocked", scope: !249, file: !249, line: 73, type: !268, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !270)
!346 = !DILocation(line: 75, column: 10, scope: !345)
!347 = !DILocation(line: 75, column: 3, scope: !345)
!348 = distinct !DISubprogram(name: "putchar", scope: !249, file: !249, line: 82, type: !349, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !351)
!349 = !DISubroutineType(types: !350)
!350 = !{!234, !234}
!351 = !{!352}
!352 = !DILocalVariable(name: "__c", arg: 1, scope: !348, file: !249, line: 82, type: !234)
!353 = !DILocation(line: 0, scope: !348)
!354 = !DILocation(line: 84, column: 21, scope: !348)
!355 = !DILocation(line: 84, column: 10, scope: !348)
!356 = !DILocation(line: 84, column: 3, scope: !348)
!357 = distinct !DISubprogram(name: "fputc_unlocked", scope: !249, file: !249, line: 91, type: !358, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !360)
!358 = !DISubroutineType(types: !359)
!359 = !{!234, !234, !277}
!360 = !{!361, !362}
!361 = !DILocalVariable(name: "__c", arg: 1, scope: !357, file: !249, line: 91, type: !234)
!362 = !DILocalVariable(name: "__stream", arg: 2, scope: !357, file: !249, line: 91, type: !277)
!363 = !DILocation(line: 0, scope: !357)
!364 = !DILocation(line: 93, column: 10, scope: !357)
!365 = !DILocation(line: 93, column: 3, scope: !357)
!366 = distinct !DISubprogram(name: "putc_unlocked", scope: !249, file: !249, line: 101, type: !358, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !367)
!367 = !{!368, !369}
!368 = !DILocalVariable(name: "__c", arg: 1, scope: !366, file: !249, line: 101, type: !234)
!369 = !DILocalVariable(name: "__stream", arg: 2, scope: !366, file: !249, line: 101, type: !277)
!370 = !DILocation(line: 0, scope: !366)
!371 = !DILocation(line: 103, column: 10, scope: !366)
!372 = !DILocation(line: 103, column: 3, scope: !366)
!373 = distinct !DISubprogram(name: "putchar_unlocked", scope: !249, file: !249, line: 108, type: !349, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !374)
!374 = !{!375}
!375 = !DILocalVariable(name: "__c", arg: 1, scope: !373, file: !249, line: 108, type: !234)
!376 = !DILocation(line: 0, scope: !373)
!377 = !DILocation(line: 110, column: 10, scope: !373)
!378 = !DILocation(line: 110, column: 3, scope: !373)
!379 = distinct !DISubprogram(name: "getline", scope: !249, file: !249, line: 118, type: !380, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !384)
!380 = !DISubroutineType(types: !381)
!381 = !{!382, !235, !383, !277}
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !304, line: 193, baseType: !242)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!384 = !{!385, !386, !387}
!385 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !379, file: !249, line: 118, type: !235)
!386 = !DILocalVariable(name: "__n", arg: 2, scope: !379, file: !249, line: 118, type: !383)
!387 = !DILocalVariable(name: "__stream", arg: 3, scope: !379, file: !249, line: 118, type: !277)
!388 = !DILocation(line: 0, scope: !379)
!389 = !DILocation(line: 120, column: 10, scope: !379)
!390 = !DILocation(line: 120, column: 3, scope: !379)
!391 = distinct !DISubprogram(name: "feof_unlocked", scope: !249, file: !249, line: 128, type: !275, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !392)
!392 = !{!393}
!393 = !DILocalVariable(name: "__stream", arg: 1, scope: !391, file: !249, line: 128, type: !277)
!394 = !DILocation(line: 0, scope: !391)
!395 = !DILocation(line: 130, column: 10, scope: !391)
!396 = !DILocation(line: 130, column: 3, scope: !391)
!397 = distinct !DISubprogram(name: "ferror_unlocked", scope: !249, file: !249, line: 135, type: !275, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !398)
!398 = !{!399}
!399 = !DILocalVariable(name: "__stream", arg: 1, scope: !397, file: !249, line: 135, type: !277)
!400 = !DILocation(line: 0, scope: !397)
!401 = !DILocation(line: 137, column: 10, scope: !397)
!402 = !DILocation(line: 137, column: 3, scope: !397)
!403 = distinct !DISubprogram(name: "tolower", scope: !404, file: !404, line: 207, type: !349, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !405)
!404 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!405 = !{!406}
!406 = !DILocalVariable(name: "__c", arg: 1, scope: !403, file: !404, line: 207, type: !234)
!407 = !DILocation(line: 0, scope: !403)
!408 = !DILocation(line: 209, column: 22, scope: !403)
!409 = !DILocation(line: 209, column: 39, scope: !403)
!410 = !DILocation(line: 209, column: 38, scope: !403)
!411 = !DILocation(line: 209, column: 37, scope: !403)
!412 = !DILocation(line: 209, column: 10, scope: !403)
!413 = !DILocation(line: 209, column: 3, scope: !403)
!414 = distinct !DISubprogram(name: "toupper", scope: !404, file: !404, line: 213, type: !349, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !415)
!415 = !{!416}
!416 = !DILocalVariable(name: "__c", arg: 1, scope: !414, file: !404, line: 213, type: !234)
!417 = !DILocation(line: 0, scope: !414)
!418 = !DILocation(line: 215, column: 22, scope: !414)
!419 = !DILocation(line: 215, column: 39, scope: !414)
!420 = !DILocation(line: 215, column: 38, scope: !414)
!421 = !DILocation(line: 215, column: 37, scope: !414)
!422 = !DILocation(line: 215, column: 10, scope: !414)
!423 = !DILocation(line: 215, column: 3, scope: !414)
!424 = distinct !DISubprogram(name: "atoi", scope: !425, file: !425, line: 361, type: !426, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !428)
!425 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!426 = !DISubroutineType(types: !427)
!427 = !{!234, !239}
!428 = !{!429}
!429 = !DILocalVariable(name: "__nptr", arg: 1, scope: !424, file: !425, line: 361, type: !239)
!430 = !DILocation(line: 0, scope: !424)
!431 = !DILocation(line: 363, column: 16, scope: !424)
!432 = !DILocation(line: 363, column: 10, scope: !424)
!433 = !DILocation(line: 363, column: 3, scope: !424)
!434 = distinct !DISubprogram(name: "atol", scope: !425, file: !425, line: 366, type: !435, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !437)
!435 = !DISubroutineType(types: !436)
!436 = !{!242, !239}
!437 = !{!438}
!438 = !DILocalVariable(name: "__nptr", arg: 1, scope: !434, file: !425, line: 366, type: !239)
!439 = !DILocation(line: 0, scope: !434)
!440 = !DILocation(line: 368, column: 10, scope: !434)
!441 = !DILocation(line: 368, column: 3, scope: !434)
!442 = distinct !DISubprogram(name: "atoll", scope: !425, file: !425, line: 373, type: !443, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !446)
!443 = !DISubroutineType(types: !444)
!444 = !{!445, !239}
!445 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!446 = !{!447}
!447 = !DILocalVariable(name: "__nptr", arg: 1, scope: !442, file: !425, line: 373, type: !239)
!448 = !DILocation(line: 0, scope: !442)
!449 = !DILocation(line: 375, column: 10, scope: !442)
!450 = !DILocation(line: 375, column: 3, scope: !442)
!451 = distinct !DISubprogram(name: "bsearch", scope: !452, file: !452, line: 20, type: !453, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !461)
!452 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!453 = !DISubroutineType(types: !454)
!454 = !{!238, !455, !455, !327, !327, !457}
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !425, line: 808, baseType: !458)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{!234, !455, !455}
!461 = !{!462, !463, !464, !465, !466, !467, !468, !469, !470, !471}
!462 = !DILocalVariable(name: "__key", arg: 1, scope: !451, file: !452, line: 20, type: !455)
!463 = !DILocalVariable(name: "__base", arg: 2, scope: !451, file: !452, line: 20, type: !455)
!464 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !451, file: !452, line: 20, type: !327)
!465 = !DILocalVariable(name: "__size", arg: 4, scope: !451, file: !452, line: 20, type: !327)
!466 = !DILocalVariable(name: "__compar", arg: 5, scope: !451, file: !452, line: 21, type: !457)
!467 = !DILocalVariable(name: "__l", scope: !451, file: !452, line: 23, type: !327)
!468 = !DILocalVariable(name: "__u", scope: !451, file: !452, line: 23, type: !327)
!469 = !DILocalVariable(name: "__idx", scope: !451, file: !452, line: 23, type: !327)
!470 = !DILocalVariable(name: "__p", scope: !451, file: !452, line: 24, type: !455)
!471 = !DILocalVariable(name: "__comparison", scope: !451, file: !452, line: 25, type: !234)
!472 = !DILocation(line: 0, scope: !451)
!473 = !DILocation(line: 29, column: 3, scope: !451)
!474 = !DILocation(line: 27, column: 7, scope: !451)
!475 = !DILocation(line: 29, column: 14, scope: !451)
!476 = !DILocation(line: 31, column: 20, scope: !477)
!477 = distinct !DILexicalBlock(scope: !451, file: !452, line: 30, column: 5)
!478 = !DILocation(line: 31, column: 27, scope: !477)
!479 = !DILocation(line: 32, column: 56, scope: !477)
!480 = !DILocation(line: 32, column: 47, scope: !477)
!481 = !DILocation(line: 33, column: 22, scope: !477)
!482 = !DILocation(line: 34, column: 24, scope: !483)
!483 = distinct !DILexicalBlock(scope: !477, file: !452, line: 34, column: 11)
!484 = !DILocation(line: 34, column: 11, scope: !477)
!485 = !DILocation(line: 36, column: 29, scope: !486)
!486 = distinct !DILexicalBlock(scope: !483, file: !452, line: 36, column: 16)
!487 = !DILocation(line: 36, column: 16, scope: !483)
!488 = !DILocation(line: 37, column: 14, scope: !486)
!489 = distinct !{!489, !473, !490}
!490 = !DILocation(line: 40, column: 5, scope: !451)
!491 = !DILocation(line: 43, column: 1, scope: !451)
!492 = distinct !DISubprogram(name: "atof", scope: !493, file: !493, line: 25, type: !494, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !497)
!493 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!494 = !DISubroutineType(types: !495)
!495 = !{!496, !239}
!496 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!497 = !{!498}
!498 = !DILocalVariable(name: "__nptr", arg: 1, scope: !492, file: !493, line: 25, type: !239)
!499 = !DILocation(line: 0, scope: !492)
!500 = !DILocation(line: 27, column: 10, scope: !492)
!501 = !DILocation(line: 27, column: 3, scope: !492)
!502 = distinct !DISubprogram(name: "strtoimax", scope: !503, file: !503, line: 324, type: !504, scopeLine: 326, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !510)
!503 = !DIFile(filename: "/usr/include/inttypes.h", directory: "")
!504 = !DISubroutineType(types: !505)
!505 = !{!506, !252, !509, !234}
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !507, line: 101, baseType: !508)
!507 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !304, line: 72, baseType: !242)
!509 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !235)
!510 = !{!511, !512, !513}
!511 = !DILocalVariable(name: "nptr", arg: 1, scope: !502, file: !503, line: 324, type: !252)
!512 = !DILocalVariable(name: "endptr", arg: 2, scope: !502, file: !503, line: 324, type: !509)
!513 = !DILocalVariable(name: "base", arg: 3, scope: !502, file: !503, line: 324, type: !234)
!514 = !DILocation(line: 0, scope: !502)
!515 = !DILocation(line: 327, column: 10, scope: !502)
!516 = !DILocation(line: 327, column: 3, scope: !502)
!517 = distinct !DISubprogram(name: "strtoumax", scope: !503, file: !503, line: 336, type: !518, scopeLine: 338, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !522)
!518 = !DISubroutineType(types: !519)
!519 = !{!520, !252, !509, !234}
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !507, line: 102, baseType: !521)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !304, line: 73, baseType: !241)
!522 = !{!523, !524, !525}
!523 = !DILocalVariable(name: "nptr", arg: 1, scope: !517, file: !503, line: 336, type: !252)
!524 = !DILocalVariable(name: "endptr", arg: 2, scope: !517, file: !503, line: 336, type: !509)
!525 = !DILocalVariable(name: "base", arg: 3, scope: !517, file: !503, line: 336, type: !234)
!526 = !DILocation(line: 0, scope: !517)
!527 = !DILocation(line: 339, column: 10, scope: !517)
!528 = !DILocation(line: 339, column: 3, scope: !517)
!529 = distinct !DISubprogram(name: "wcstoimax", scope: !503, file: !503, line: 348, type: !530, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !539)
!530 = !DISubroutineType(types: !531)
!531 = !{!506, !532, !536, !234}
!532 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !533)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !535)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gwchar_t", file: !503, line: 34, baseType: !234)
!536 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !537)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!539 = !{!540, !541, !542}
!540 = !DILocalVariable(name: "nptr", arg: 1, scope: !529, file: !503, line: 348, type: !532)
!541 = !DILocalVariable(name: "endptr", arg: 2, scope: !529, file: !503, line: 348, type: !536)
!542 = !DILocalVariable(name: "base", arg: 3, scope: !529, file: !503, line: 348, type: !234)
!543 = !DILocation(line: 0, scope: !529)
!544 = !DILocation(line: 351, column: 10, scope: !529)
!545 = !DILocation(line: 351, column: 3, scope: !529)
!546 = distinct !DISubprogram(name: "wcstoumax", scope: !503, file: !503, line: 362, type: !547, scopeLine: 364, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !549)
!547 = !DISubroutineType(types: !548)
!548 = !{!520, !532, !536, !234}
!549 = !{!550, !551, !552}
!550 = !DILocalVariable(name: "nptr", arg: 1, scope: !546, file: !503, line: 362, type: !532)
!551 = !DILocalVariable(name: "endptr", arg: 2, scope: !546, file: !503, line: 362, type: !536)
!552 = !DILocalVariable(name: "base", arg: 3, scope: !546, file: !503, line: 362, type: !234)
!553 = !DILocation(line: 0, scope: !546)
!554 = !DILocation(line: 365, column: 10, scope: !546)
!555 = !DILocation(line: 365, column: 3, scope: !546)
!556 = distinct !DISubprogram(name: "stat", scope: !557, file: !557, line: 453, type: !558, scopeLine: 454, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !597)
!557 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "")
!558 = !DISubroutineType(types: !559)
!559 = !{!234, !239, !560}
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !562, line: 46, size: 1152, elements: !563)
!562 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!563 = !{!564, !566, !568, !570, !572, !574, !576, !577, !578, !579, !581, !583, !591, !592, !593}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !561, file: !562, line: 48, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !304, line: 145, baseType: !241)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !561, file: !562, line: 53, baseType: !567, size: 64, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !304, line: 148, baseType: !241)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !561, file: !562, line: 61, baseType: !569, size: 64, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !304, line: 151, baseType: !241)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !561, file: !562, line: 62, baseType: !571, size: 32, offset: 192)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !304, line: 150, baseType: !5)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !561, file: !562, line: 64, baseType: !573, size: 32, offset: 224)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !304, line: 146, baseType: !5)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !561, file: !562, line: 65, baseType: !575, size: 32, offset: 256)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !304, line: 147, baseType: !5)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !561, file: !562, line: 67, baseType: !234, size: 32, offset: 288)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !561, file: !562, line: 69, baseType: !565, size: 64, offset: 320)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !561, file: !562, line: 74, baseType: !303, size: 64, offset: 384)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !561, file: !562, line: 78, baseType: !580, size: 64, offset: 448)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !304, line: 174, baseType: !242)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !561, file: !562, line: 80, baseType: !582, size: 64, offset: 512)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !304, line: 179, baseType: !242)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !561, file: !562, line: 91, baseType: !584, size: 128, offset: 576)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !585, line: 10, size: 128, elements: !586)
!585 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!586 = !{!587, !589}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !584, file: !585, line: 12, baseType: !588, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !304, line: 160, baseType: !242)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !584, file: !585, line: 16, baseType: !590, size: 64, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !304, line: 196, baseType: !242)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !561, file: !562, line: 92, baseType: !584, size: 128, offset: 704)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !561, file: !562, line: 93, baseType: !584, size: 128, offset: 832)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !561, file: !562, line: 106, baseType: !594, size: 192, offset: 960)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !590, size: 192, elements: !595)
!595 = !{!596}
!596 = !DISubrange(count: 3)
!597 = !{!598, !599}
!598 = !DILocalVariable(name: "__path", arg: 1, scope: !556, file: !557, line: 453, type: !239)
!599 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !556, file: !557, line: 453, type: !560)
!600 = !DILocation(line: 0, scope: !556)
!601 = !DILocation(line: 455, column: 10, scope: !556)
!602 = !DILocation(line: 455, column: 3, scope: !556)
!603 = distinct !DISubprogram(name: "lstat", scope: !557, file: !557, line: 460, type: !558, scopeLine: 461, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !604)
!604 = !{!605, !606}
!605 = !DILocalVariable(name: "__path", arg: 1, scope: !603, file: !557, line: 460, type: !239)
!606 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !603, file: !557, line: 460, type: !560)
!607 = !DILocation(line: 0, scope: !603)
!608 = !DILocation(line: 462, column: 10, scope: !603)
!609 = !DILocation(line: 462, column: 3, scope: !603)
!610 = distinct !DISubprogram(name: "fstat", scope: !557, file: !557, line: 467, type: !611, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !613)
!611 = !DISubroutineType(types: !612)
!612 = !{!234, !234, !560}
!613 = !{!614, !615}
!614 = !DILocalVariable(name: "__fd", arg: 1, scope: !610, file: !557, line: 467, type: !234)
!615 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !610, file: !557, line: 467, type: !560)
!616 = !DILocation(line: 0, scope: !610)
!617 = !DILocation(line: 469, column: 10, scope: !610)
!618 = !DILocation(line: 469, column: 3, scope: !610)
!619 = distinct !DISubprogram(name: "fstatat", scope: !557, file: !557, line: 474, type: !620, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !622)
!620 = !DISubroutineType(types: !621)
!621 = !{!234, !234, !239, !560, !234}
!622 = !{!623, !624, !625, !626}
!623 = !DILocalVariable(name: "__fd", arg: 1, scope: !619, file: !557, line: 474, type: !234)
!624 = !DILocalVariable(name: "__filename", arg: 2, scope: !619, file: !557, line: 474, type: !239)
!625 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !619, file: !557, line: 474, type: !560)
!626 = !DILocalVariable(name: "__flag", arg: 4, scope: !619, file: !557, line: 474, type: !234)
!627 = !DILocation(line: 0, scope: !619)
!628 = !DILocation(line: 477, column: 10, scope: !619)
!629 = !DILocation(line: 477, column: 3, scope: !619)
!630 = distinct !DISubprogram(name: "mknod", scope: !557, file: !557, line: 483, type: !631, scopeLine: 484, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !633)
!631 = !DISubroutineType(types: !632)
!632 = !{!234, !239, !571, !565}
!633 = !{!634, !635, !636}
!634 = !DILocalVariable(name: "__path", arg: 1, scope: !630, file: !557, line: 483, type: !239)
!635 = !DILocalVariable(name: "__mode", arg: 2, scope: !630, file: !557, line: 483, type: !571)
!636 = !DILocalVariable(name: "__dev", arg: 3, scope: !630, file: !557, line: 483, type: !565)
!637 = !DILocation(line: 0, scope: !630)
!638 = !DILocation(line: 485, column: 10, scope: !630)
!639 = !DILocation(line: 485, column: 3, scope: !630)
!640 = distinct !DISubprogram(name: "mknodat", scope: !557, file: !557, line: 491, type: !641, scopeLine: 493, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !643)
!641 = !DISubroutineType(types: !642)
!642 = !{!234, !234, !239, !571, !565}
!643 = !{!644, !645, !646, !647}
!644 = !DILocalVariable(name: "__fd", arg: 1, scope: !640, file: !557, line: 491, type: !234)
!645 = !DILocalVariable(name: "__path", arg: 2, scope: !640, file: !557, line: 491, type: !239)
!646 = !DILocalVariable(name: "__mode", arg: 3, scope: !640, file: !557, line: 491, type: !571)
!647 = !DILocalVariable(name: "__dev", arg: 4, scope: !640, file: !557, line: 491, type: !565)
!648 = !DILocation(line: 0, scope: !640)
!649 = !DILocation(line: 494, column: 10, scope: !640)
!650 = !DILocation(line: 494, column: 3, scope: !640)
!651 = distinct !DISubprogram(name: "stat64", scope: !557, file: !557, line: 502, type: !652, scopeLine: 503, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !674)
!652 = !DISubroutineType(types: !653)
!653 = !{!234, !239, !654}
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !562, line: 119, size: 1152, elements: !656)
!656 = !{!657, !658, !660, !661, !662, !663, !664, !665, !666, !667, !668, !670, !671, !672, !673}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !655, file: !562, line: 121, baseType: !565, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !655, file: !562, line: 123, baseType: !659, size: 64, offset: 64)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !304, line: 149, baseType: !241)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !655, file: !562, line: 124, baseType: !569, size: 64, offset: 128)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !655, file: !562, line: 125, baseType: !571, size: 32, offset: 192)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !655, file: !562, line: 132, baseType: !573, size: 32, offset: 224)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !655, file: !562, line: 133, baseType: !575, size: 32, offset: 256)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !655, file: !562, line: 135, baseType: !234, size: 32, offset: 288)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !655, file: !562, line: 136, baseType: !565, size: 64, offset: 320)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !655, file: !562, line: 137, baseType: !303, size: 64, offset: 384)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !655, file: !562, line: 143, baseType: !580, size: 64, offset: 448)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !655, file: !562, line: 144, baseType: !669, size: 64, offset: 512)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !304, line: 180, baseType: !242)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !655, file: !562, line: 152, baseType: !584, size: 128, offset: 576)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !655, file: !562, line: 153, baseType: !584, size: 128, offset: 704)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !655, file: !562, line: 154, baseType: !584, size: 128, offset: 832)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !655, file: !562, line: 164, baseType: !594, size: 192, offset: 960)
!674 = !{!675, !676}
!675 = !DILocalVariable(name: "__path", arg: 1, scope: !651, file: !557, line: 502, type: !239)
!676 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !651, file: !557, line: 502, type: !654)
!677 = !DILocation(line: 0, scope: !651)
!678 = !DILocation(line: 504, column: 10, scope: !651)
!679 = !DILocation(line: 504, column: 3, scope: !651)
!680 = distinct !DISubprogram(name: "lstat64", scope: !557, file: !557, line: 509, type: !652, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !681)
!681 = !{!682, !683}
!682 = !DILocalVariable(name: "__path", arg: 1, scope: !680, file: !557, line: 509, type: !239)
!683 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !680, file: !557, line: 509, type: !654)
!684 = !DILocation(line: 0, scope: !680)
!685 = !DILocation(line: 511, column: 10, scope: !680)
!686 = !DILocation(line: 511, column: 3, scope: !680)
!687 = distinct !DISubprogram(name: "fstat64", scope: !557, file: !557, line: 516, type: !688, scopeLine: 517, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !690)
!688 = !DISubroutineType(types: !689)
!689 = !{!234, !234, !654}
!690 = !{!691, !692}
!691 = !DILocalVariable(name: "__fd", arg: 1, scope: !687, file: !557, line: 516, type: !234)
!692 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !687, file: !557, line: 516, type: !654)
!693 = !DILocation(line: 0, scope: !687)
!694 = !DILocation(line: 518, column: 10, scope: !687)
!695 = !DILocation(line: 518, column: 3, scope: !687)
!696 = distinct !DISubprogram(name: "fstatat64", scope: !557, file: !557, line: 523, type: !697, scopeLine: 525, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !699)
!697 = !DISubroutineType(types: !698)
!698 = !{!234, !234, !239, !654, !234}
!699 = !{!700, !701, !702, !703}
!700 = !DILocalVariable(name: "__fd", arg: 1, scope: !696, file: !557, line: 523, type: !234)
!701 = !DILocalVariable(name: "__filename", arg: 2, scope: !696, file: !557, line: 523, type: !239)
!702 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !696, file: !557, line: 523, type: !654)
!703 = !DILocalVariable(name: "__flag", arg: 4, scope: !696, file: !557, line: 523, type: !234)
!704 = !DILocation(line: 0, scope: !696)
!705 = !DILocation(line: 526, column: 10, scope: !696)
!706 = !DILocation(line: 526, column: 3, scope: !696)
!707 = distinct !DISubprogram(name: "double_int_mask", scope: !1, file: !1, line: 29, type: !708, scopeLine: 30, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !716)
!708 = !DISubroutineType(types: !709)
!709 = !{!710, !5}
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !711, line: 58, baseType: !712)
!711 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !711, line: 54, size: 128, elements: !713)
!713 = !{!714, !715}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !712, file: !711, line: 56, baseType: !241, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !712, file: !711, line: 57, baseType: !242, size: 64, offset: 64)
!716 = !{!717, !718, !719}
!717 = !DILocalVariable(name: "prec", arg: 1, scope: !707, file: !1, line: 29, type: !5)
!718 = !DILocalVariable(name: "m", scope: !707, file: !1, line: 31, type: !241)
!719 = !DILocalVariable(name: "mask", scope: !707, file: !1, line: 32, type: !710)
!720 = !DILocation(line: 0, scope: !707)
!721 = !DILocation(line: 34, column: 12, scope: !722)
!722 = distinct !DILexicalBlock(scope: !707, file: !1, line: 34, column: 7)
!723 = !DILocation(line: 34, column: 7, scope: !707)
!724 = !DILocation(line: 37, column: 48, scope: !725)
!725 = distinct !DILexicalBlock(scope: !722, file: !1, line: 35, column: 5)
!726 = !DILocation(line: 37, column: 39, scope: !725)
!727 = !DILocation(line: 37, column: 54, scope: !725)
!728 = !DILocation(line: 40, column: 5, scope: !725)
!729 = !DILocation(line: 44, column: 55, scope: !730)
!730 = distinct !DILexicalBlock(scope: !722, file: !1, line: 42, column: 5)
!731 = !DILocation(line: 44, column: 46, scope: !730)
!732 = !DILocation(line: 44, column: 61, scope: !730)
!733 = !DILocation(line: 48, column: 1, scope: !707)
!734 = distinct !DISubprogram(name: "double_int_ext", scope: !1, file: !1, line: 58, type: !735, scopeLine: 59, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !737)
!735 = !DISubroutineType(types: !736)
!736 = !{!710, !710, !5, !233}
!737 = !{!738, !739, !740}
!738 = !DILocalVariable(name: "cst", arg: 1, scope: !734, file: !1, line: 58, type: !710)
!739 = !DILocalVariable(name: "prec", arg: 2, scope: !734, file: !1, line: 58, type: !5)
!740 = !DILocalVariable(name: "uns", arg: 3, scope: !734, file: !1, line: 58, type: !233)
!741 = !DILocation(line: 0, scope: !734)
!742 = !DILocation(line: 60, column: 7, scope: !743)
!743 = distinct !DILexicalBlock(scope: !734, file: !1, line: 60, column: 7)
!744 = !DILocation(line: 60, column: 7, scope: !734)
!745 = !DILocation(line: 61, column: 12, scope: !743)
!746 = !DILocation(line: 61, column: 5, scope: !743)
!747 = !DILocation(line: 63, column: 12, scope: !743)
!748 = !DILocation(line: 63, column: 5, scope: !743)
!749 = !DILocation(line: 64, column: 1, scope: !734)
!750 = distinct !DISubprogram(name: "double_int_zext", scope: !1, file: !1, line: 69, type: !751, scopeLine: 70, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !753)
!751 = !DISubroutineType(types: !752)
!752 = !{!710, !710, !5}
!753 = !{!754, !755, !756, !757}
!754 = !DILocalVariable(name: "cst", arg: 1, scope: !750, file: !1, line: 69, type: !710)
!755 = !DILocalVariable(name: "prec", arg: 2, scope: !750, file: !1, line: 69, type: !5)
!756 = !DILocalVariable(name: "mask", scope: !750, file: !1, line: 71, type: !710)
!757 = !DILocalVariable(name: "r", scope: !750, file: !1, line: 72, type: !710)
!758 = !DILocation(line: 0, scope: !750)
!759 = !DILocation(line: 71, column: 21, scope: !750)
!760 = !DILocation(line: 74, column: 19, scope: !750)
!761 = !DILocation(line: 75, column: 21, scope: !750)
!762 = !DILocation(line: 78, column: 1, scope: !750)
!763 = distinct !DISubprogram(name: "double_int_sext", scope: !1, file: !1, line: 83, type: !751, scopeLine: 84, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !764)
!764 = !{!765, !766, !767, !768, !769}
!765 = !DILocalVariable(name: "cst", arg: 1, scope: !763, file: !1, line: 83, type: !710)
!766 = !DILocalVariable(name: "prec", arg: 2, scope: !763, file: !1, line: 83, type: !5)
!767 = !DILocalVariable(name: "mask", scope: !763, file: !1, line: 85, type: !710)
!768 = !DILocalVariable(name: "r", scope: !763, file: !1, line: 86, type: !710)
!769 = !DILocalVariable(name: "snum", scope: !763, file: !1, line: 87, type: !241)
!770 = !DILocation(line: 0, scope: !763)
!771 = !DILocation(line: 85, column: 21, scope: !763)
!772 = !DILocation(line: 89, column: 12, scope: !773)
!773 = distinct !DILexicalBlock(scope: !763, file: !1, line: 89, column: 7)
!774 = !DILocation(line: 89, column: 7, scope: !763)
!775 = !DILocation(line: 96, column: 23, scope: !776)
!776 = distinct !DILexicalBlock(scope: !763, file: !1, line: 96, column: 7)
!777 = !DILocation(line: 96, column: 14, scope: !776)
!778 = !DILocation(line: 96, column: 34, scope: !776)
!779 = !DILocation(line: 96, column: 7, scope: !763)
!780 = !DILocation(line: 98, column: 25, scope: !781)
!781 = distinct !DILexicalBlock(scope: !776, file: !1, line: 97, column: 5)
!782 = !DILocation(line: 98, column: 23, scope: !781)
!783 = !DILocation(line: 99, column: 27, scope: !781)
!784 = !DILocation(line: 99, column: 25, scope: !781)
!785 = !DILocation(line: 100, column: 5, scope: !781)
!786 = !DILocation(line: 103, column: 23, scope: !787)
!787 = distinct !DILexicalBlock(scope: !776, file: !1, line: 102, column: 5)
!788 = !DILocation(line: 104, column: 25, scope: !787)
!789 = !DILocation(line: 108, column: 1, scope: !763)
!790 = distinct !DISubprogram(name: "tree_to_double_int", scope: !1, file: !1, line: 115, type: !791, scopeLine: 116, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1424)
!791 = !DISubroutineType(types: !792)
!792 = !{!710, !793}
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_tree", file: !794, line: 59, baseType: !795)
!794 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !797)
!797 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !4, line: 3371, size: 1792, elements: !798)
!798 = !{!799, !832, !840, !845, !852, !859, !864, !870, !876, !889, !901, !939, !947, !975, !983, !984, !989, !998, !1004, !1009, !1013, !1017, !1046, !1095, !1101, !1108, !1115, !1141, !1166, !1183, !1195, !1217, !1235, !1406}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !797, file: !4, line: 3372, baseType: !800, size: 64)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !4, line: 360, size: 64, elements: !801)
!801 = !{!802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !800, file: !4, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !800, file: !4, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !800, file: !4, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !800, file: !4, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !800, file: !4, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !800, file: !4, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !800, file: !4, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !800, file: !4, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !800, file: !4, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !800, file: !4, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !800, file: !4, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !800, file: !4, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !800, file: !4, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !800, file: !4, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !800, file: !4, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !800, file: !4, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !800, file: !4, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !800, file: !4, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !800, file: !4, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !800, file: !4, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !800, file: !4, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !800, file: !4, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !800, file: !4, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !800, file: !4, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !800, file: !4, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !800, file: !4, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !800, file: !4, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !800, file: !4, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !800, file: !4, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !800, file: !4, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !797, file: !4, line: 3373, baseType: !833, size: 192)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !4, line: 402, size: 192, elements: !834)
!834 = !{!835, !836, !839}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !833, file: !4, line: 403, baseType: !800, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !833, file: !4, line: 404, baseType: !837, size: 64, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !794, line: 56, baseType: !838)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !833, file: !4, line: 405, baseType: !837, size: 64, offset: 128)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !797, file: !4, line: 3374, baseType: !841, size: 320)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !4, line: 1384, size: 320, elements: !842)
!842 = !{!843, !844}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !841, file: !4, line: 1385, baseType: !833, size: 192)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !841, file: !4, line: 1386, baseType: !710, size: 128, offset: 192)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !797, file: !4, line: 3375, baseType: !846, size: 256)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !4, line: 1397, size: 256, elements: !847)
!847 = !{!848, !849}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !846, file: !4, line: 1398, baseType: !833, size: 192)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !846, file: !4, line: 1399, baseType: !850, size: 64, offset: 192)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !4, line: 1392, flags: DIFlagFwdDecl)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !797, file: !4, line: 3376, baseType: !853, size: 256)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !4, line: 1408, size: 256, elements: !854)
!854 = !{!855, !856}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !853, file: !4, line: 1409, baseType: !833, size: 192)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !853, file: !4, line: 1410, baseType: !857, size: 64, offset: 192)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !4, line: 1403, flags: DIFlagFwdDecl)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !797, file: !4, line: 3377, baseType: !860, size: 256)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !4, line: 1437, size: 256, elements: !861)
!861 = !{!862, !863}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !860, file: !4, line: 1438, baseType: !833, size: 192)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !860, file: !4, line: 1439, baseType: !837, size: 64, offset: 192)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !797, file: !4, line: 3378, baseType: !865, size: 256)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !4, line: 1418, size: 256, elements: !866)
!866 = !{!867, !868, !869}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !865, file: !4, line: 1419, baseType: !833, size: 192)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !865, file: !4, line: 1420, baseType: !234, size: 32, offset: 192)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !865, file: !4, line: 1421, baseType: !310, size: 8, offset: 224)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !797, file: !4, line: 3379, baseType: !871, size: 320)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !4, line: 1428, size: 320, elements: !872)
!872 = !{!873, !874, !875}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !871, file: !4, line: 1429, baseType: !833, size: 192)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !871, file: !4, line: 1430, baseType: !837, size: 64, offset: 192)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !871, file: !4, line: 1431, baseType: !837, size: 64, offset: 256)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !797, file: !4, line: 3380, baseType: !877, size: 320)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !4, line: 1460, size: 320, elements: !878)
!878 = !{!879, !880}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !877, file: !4, line: 1461, baseType: !833, size: 192)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !877, file: !4, line: 1462, baseType: !881, size: 128, offset: 192)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !882, line: 31, size: 128, elements: !883)
!882 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!883 = !{!884, !887, !888}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !881, file: !882, line: 32, baseType: !885, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !233)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !881, file: !882, line: 33, baseType: !5, size: 32, offset: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !881, file: !882, line: 34, baseType: !5, size: 32, offset: 96)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !797, file: !4, line: 3381, baseType: !890, size: 384)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !4, line: 2507, size: 384, elements: !891)
!891 = !{!892, !893, !898, !899, !900}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !890, file: !4, line: 2508, baseType: !833, size: 192)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !890, file: !4, line: 2509, baseType: !894, size: 32, offset: 192)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !895, line: 58, baseType: !896)
!895 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !897, line: 44, baseType: !5)
!897 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!898 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !890, file: !4, line: 2510, baseType: !5, size: 32, offset: 224)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !890, file: !4, line: 2511, baseType: !837, size: 64, offset: 256)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !890, file: !4, line: 2512, baseType: !837, size: 64, offset: 320)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !797, file: !4, line: 3382, baseType: !902, size: 896)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !4, line: 2652, size: 896, elements: !903)
!903 = !{!904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !902, file: !4, line: 2653, baseType: !890, size: 384)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !902, file: !4, line: 2654, baseType: !837, size: 64, offset: 384)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !902, file: !4, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !902, file: !4, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !902, file: !4, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !902, file: !4, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !902, file: !4, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !902, file: !4, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !902, file: !4, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !902, file: !4, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !902, file: !4, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !902, file: !4, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !902, file: !4, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !902, file: !4, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !902, file: !4, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !902, file: !4, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !902, file: !4, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !902, file: !4, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !902, file: !4, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !902, file: !4, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !902, file: !4, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !902, file: !4, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !902, file: !4, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !902, file: !4, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !902, file: !4, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !902, file: !4, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !902, file: !4, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !902, file: !4, line: 2703, baseType: !5, size: 32, offset: 512)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !902, file: !4, line: 2705, baseType: !837, size: 64, offset: 576)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !902, file: !4, line: 2706, baseType: !837, size: 64, offset: 640)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !902, file: !4, line: 2707, baseType: !837, size: 64, offset: 704)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !902, file: !4, line: 2708, baseType: !837, size: 64, offset: 768)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !902, file: !4, line: 2711, baseType: !937, size: 64, offset: 832)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !4, line: 2711, flags: DIFlagFwdDecl)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !797, file: !4, line: 3383, baseType: !940, size: 960)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !4, line: 2756, size: 960, elements: !941)
!941 = !{!942, !943}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !940, file: !4, line: 2757, baseType: !902, size: 896)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !940, file: !4, line: 2758, baseType: !944, size: 64, offset: 896)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !794, line: 50, baseType: !945)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !794, line: 49, flags: DIFlagFwdDecl)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !797, file: !4, line: 3384, baseType: !948, size: 1472)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !4, line: 3114, size: 1472, elements: !949)
!949 = !{!950, !971, !972, !973, !974}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !948, file: !4, line: 3115, baseType: !951, size: 1216)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !4, line: 2984, size: 1216, elements: !952)
!952 = !{!953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !951, file: !4, line: 2985, baseType: !940, size: 960)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !951, file: !4, line: 2986, baseType: !837, size: 64, offset: 960)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !951, file: !4, line: 2987, baseType: !837, size: 64, offset: 1024)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !951, file: !4, line: 2988, baseType: !837, size: 64, offset: 1088)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !951, file: !4, line: 2991, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !951, file: !4, line: 2992, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !951, file: !4, line: 2993, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !951, file: !4, line: 2994, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !951, file: !4, line: 2995, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !951, file: !4, line: 2996, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !951, file: !4, line: 2998, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !951, file: !4, line: 3000, baseType: !5, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !951, file: !4, line: 3002, baseType: !5, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !951, file: !4, line: 3003, baseType: !5, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !951, file: !4, line: 3004, baseType: !5, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !951, file: !4, line: 3005, baseType: !5, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !951, file: !4, line: 3007, baseType: !5, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !951, file: !4, line: 3010, baseType: !5, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !948, file: !4, line: 3117, baseType: !837, size: 64, offset: 1216)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !948, file: !4, line: 3119, baseType: !837, size: 64, offset: 1280)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !948, file: !4, line: 3121, baseType: !837, size: 64, offset: 1344)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !948, file: !4, line: 3123, baseType: !837, size: 64, offset: 1408)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !797, file: !4, line: 3385, baseType: !976, size: 1088)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !4, line: 2874, size: 1088, elements: !977)
!977 = !{!978, !979, !980}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !976, file: !4, line: 2875, baseType: !940, size: 960)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !976, file: !4, line: 2876, baseType: !944, size: 64, offset: 960)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !976, file: !4, line: 2877, baseType: !981, size: 64, offset: 1024)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !4, line: 2856, flags: DIFlagFwdDecl)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !797, file: !4, line: 3386, baseType: !951, size: 1216)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !797, file: !4, line: 3387, baseType: !985, size: 1280)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !4, line: 3093, size: 1280, elements: !986)
!986 = !{!987, !988}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !985, file: !4, line: 3094, baseType: !951, size: 1216)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !985, file: !4, line: 3095, baseType: !981, size: 64, offset: 1216)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !797, file: !4, line: 3388, baseType: !990, size: 1216)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !4, line: 2824, size: 1216, elements: !991)
!991 = !{!992, !993, !994, !995, !996, !997}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !990, file: !4, line: 2825, baseType: !902, size: 896)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !990, file: !4, line: 2827, baseType: !837, size: 64, offset: 896)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !990, file: !4, line: 2828, baseType: !837, size: 64, offset: 960)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !990, file: !4, line: 2829, baseType: !837, size: 64, offset: 1024)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !990, file: !4, line: 2830, baseType: !837, size: 64, offset: 1088)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !990, file: !4, line: 2831, baseType: !837, size: 64, offset: 1152)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !797, file: !4, line: 3389, baseType: !999, size: 1024)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !4, line: 2850, size: 1024, elements: !1000)
!1000 = !{!1001, !1002, !1003}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !999, file: !4, line: 2851, baseType: !940, size: 960)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !999, file: !4, line: 2852, baseType: !234, size: 32, offset: 960)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !999, file: !4, line: 2853, baseType: !234, size: 32, offset: 992)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !797, file: !4, line: 3390, baseType: !1005, size: 1024)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !4, line: 2857, size: 1024, elements: !1006)
!1006 = !{!1007, !1008}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1005, file: !4, line: 2858, baseType: !940, size: 960)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1005, file: !4, line: 2859, baseType: !981, size: 64, offset: 960)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !797, file: !4, line: 3391, baseType: !1010, size: 960)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !4, line: 2862, size: 960, elements: !1011)
!1011 = !{!1012}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1010, file: !4, line: 2863, baseType: !940, size: 960)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !797, file: !4, line: 3392, baseType: !1014, size: 1472)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !4, line: 3304, size: 1472, elements: !1015)
!1015 = !{!1016}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1014, file: !4, line: 3305, baseType: !948, size: 1472)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !797, file: !4, line: 3393, baseType: !1018, size: 1792)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !4, line: 3248, size: 1792, elements: !1019)
!1019 = !{!1020, !1021, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1018, file: !4, line: 3249, baseType: !948, size: 1472)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1018, file: !4, line: 3251, baseType: !1022, size: 64, offset: 1472)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1024, line: 41, flags: DIFlagFwdDecl)
!1024 = !DIFile(filename: "./statistics.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1018, file: !4, line: 3254, baseType: !837, size: 64, offset: 1536)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1018, file: !4, line: 3257, baseType: !837, size: 64, offset: 1600)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1018, file: !4, line: 3258, baseType: !837, size: 64, offset: 1664)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1018, file: !4, line: 3264, baseType: !5, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1018, file: !4, line: 3265, baseType: !5, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1018, file: !4, line: 3267, baseType: !5, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1018, file: !4, line: 3268, baseType: !5, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1018, file: !4, line: 3269, baseType: !5, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1018, file: !4, line: 3271, baseType: !5, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1018, file: !4, line: 3272, baseType: !5, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1018, file: !4, line: 3273, baseType: !5, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1018, file: !4, line: 3274, baseType: !5, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1018, file: !4, line: 3275, baseType: !5, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1018, file: !4, line: 3276, baseType: !5, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1018, file: !4, line: 3277, baseType: !5, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1018, file: !4, line: 3279, baseType: !5, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1018, file: !4, line: 3280, baseType: !5, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1018, file: !4, line: 3281, baseType: !5, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1018, file: !4, line: 3282, baseType: !5, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1018, file: !4, line: 3283, baseType: !5, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1018, file: !4, line: 3284, baseType: !5, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !797, file: !4, line: 3394, baseType: !1047, size: 1344)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !4, line: 2279, size: 1344, elements: !1048)
!1048 = !{!1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1074, !1075, !1076, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1047, file: !4, line: 2280, baseType: !833, size: 192)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1047, file: !4, line: 2281, baseType: !837, size: 64, offset: 192)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1047, file: !4, line: 2282, baseType: !837, size: 64, offset: 256)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1047, file: !4, line: 2283, baseType: !837, size: 64, offset: 320)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1047, file: !4, line: 2284, baseType: !837, size: 64, offset: 384)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1047, file: !4, line: 2285, baseType: !5, size: 32, offset: 448)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1047, file: !4, line: 2287, baseType: !5, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1047, file: !4, line: 2288, baseType: !5, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1047, file: !4, line: 2289, baseType: !5, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1047, file: !4, line: 2290, baseType: !5, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1047, file: !4, line: 2291, baseType: !5, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1047, file: !4, line: 2292, baseType: !5, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1047, file: !4, line: 2294, baseType: !5, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1047, file: !4, line: 2296, baseType: !5, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1047, file: !4, line: 2297, baseType: !5, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1047, file: !4, line: 2298, baseType: !5, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1047, file: !4, line: 2299, baseType: !5, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1047, file: !4, line: 2300, baseType: !5, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1047, file: !4, line: 2301, baseType: !5, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1047, file: !4, line: 2302, baseType: !5, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1047, file: !4, line: 2303, baseType: !5, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1047, file: !4, line: 2305, baseType: !5, size: 32, offset: 512)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1047, file: !4, line: 2306, baseType: !1072, size: 32, offset: 544)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1073, line: 31, baseType: !234)
!1073 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1047, file: !4, line: 2307, baseType: !837, size: 64, offset: 576)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1047, file: !4, line: 2308, baseType: !837, size: 64, offset: 640)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1047, file: !4, line: 2314, baseType: !1077, size: 64, offset: 704)
!1077 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !4, line: 2309, size: 64, elements: !1078)
!1078 = !{!1079, !1080, !1081}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1077, file: !4, line: 2310, baseType: !234, size: 32)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1077, file: !4, line: 2311, baseType: !239, size: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1077, file: !4, line: 2312, baseType: !1082, size: 64)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
!1083 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !4, line: 2277, flags: DIFlagFwdDecl)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1047, file: !4, line: 2315, baseType: !837, size: 64, offset: 768)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1047, file: !4, line: 2316, baseType: !837, size: 64, offset: 832)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1047, file: !4, line: 2317, baseType: !837, size: 64, offset: 896)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1047, file: !4, line: 2318, baseType: !837, size: 64, offset: 960)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1047, file: !4, line: 2319, baseType: !837, size: 64, offset: 1024)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1047, file: !4, line: 2320, baseType: !837, size: 64, offset: 1088)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1047, file: !4, line: 2321, baseType: !837, size: 64, offset: 1152)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1047, file: !4, line: 2322, baseType: !837, size: 64, offset: 1216)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1047, file: !4, line: 2324, baseType: !1093, size: 64, offset: 1280)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !4, line: 2324, flags: DIFlagFwdDecl)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !797, file: !4, line: 3395, baseType: !1096, size: 320)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !4, line: 1469, size: 320, elements: !1097)
!1097 = !{!1098, !1099, !1100}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1096, file: !4, line: 1470, baseType: !833, size: 192)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1096, file: !4, line: 1471, baseType: !837, size: 64, offset: 192)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1096, file: !4, line: 1472, baseType: !837, size: 64, offset: 256)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !797, file: !4, line: 3396, baseType: !1102, size: 320)
!1102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !4, line: 1482, size: 320, elements: !1103)
!1103 = !{!1104, !1105, !1106}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1102, file: !4, line: 1483, baseType: !833, size: 192)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1102, file: !4, line: 1484, baseType: !234, size: 32, offset: 192)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1102, file: !4, line: 1485, baseType: !1107, size: 64, offset: 256)
!1107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !837, size: 64, elements: !311)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !797, file: !4, line: 3397, baseType: !1109, size: 384)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !4, line: 1829, size: 384, elements: !1110)
!1110 = !{!1111, !1112, !1113, !1114}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1109, file: !4, line: 1830, baseType: !833, size: 192)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1109, file: !4, line: 1831, baseType: !894, size: 32, offset: 192)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1109, file: !4, line: 1832, baseType: !837, size: 64, offset: 256)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1109, file: !4, line: 1835, baseType: !1107, size: 64, offset: 320)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !797, file: !4, line: 3398, baseType: !1116, size: 704)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !4, line: 1898, size: 704, elements: !1117)
!1117 = !{!1118, !1119, !1120, !1124, !1125, !1128}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1116, file: !4, line: 1899, baseType: !833, size: 192)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1116, file: !4, line: 1902, baseType: !837, size: 64, offset: 192)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1116, file: !4, line: 1905, baseType: !1121, size: 64, offset: 256)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !794, line: 58, baseType: !1122)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !794, line: 57, flags: DIFlagFwdDecl)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1116, file: !4, line: 1908, baseType: !5, size: 32, offset: 320)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1116, file: !4, line: 1911, baseType: !1126, size: 64, offset: 384)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !4, line: 1876, flags: DIFlagFwdDecl)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1116, file: !4, line: 1914, baseType: !1129, size: 256, offset: 448)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !4, line: 1883, size: 256, elements: !1130)
!1130 = !{!1131, !1133, !1134, !1139}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1129, file: !4, line: 1884, baseType: !1132, size: 64)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1129, file: !4, line: 1885, baseType: !1132, size: 64, offset: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1129, file: !4, line: 1891, baseType: !1135, size: 64, offset: 128)
!1135 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1129, file: !4, line: 1891, size: 64, elements: !1136)
!1136 = !{!1137, !1138}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1135, file: !4, line: 1891, baseType: !1121, size: 64)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1135, file: !4, line: 1891, baseType: !837, size: 64)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1129, file: !4, line: 1892, baseType: !1140, size: 64, offset: 192)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !797, file: !4, line: 3399, baseType: !1142, size: 704)
!1142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !4, line: 2008, size: 704, elements: !1143)
!1143 = !{!1144, !1145, !1146, !1147, !1148, !1149, !1161, !1162, !1163, !1164, !1165}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1142, file: !4, line: 2009, baseType: !833, size: 192)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1142, file: !4, line: 2011, baseType: !5, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !1142, file: !4, line: 2012, baseType: !5, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1142, file: !4, line: 2014, baseType: !894, size: 32, offset: 224)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1142, file: !4, line: 2016, baseType: !837, size: 64, offset: 256)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !1142, file: !4, line: 2017, baseType: !1150, size: 64, offset: 320)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1151 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !4, line: 183, baseType: !1152)
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !4, line: 183, size: 128, elements: !1153)
!1153 = !{!1154}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1152, file: !4, line: 183, baseType: !1155, size: 128)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !4, line: 182, baseType: !1156)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !4, line: 182, size: 128, elements: !1157)
!1157 = !{!1158, !1159, !1160}
