; ModuleID = 'dyn-string.bc'
source_filename = "dyn-string.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.dyn_string = type { i32, i32, i8* }

@stdout = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@stdin = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8

; Function Attrs: inlinehint nounwind uwtable
define dso_local i32 @vprintf(i8* noalias %__fmt, %struct.__va_list_tag* %__arg) local_unnamed_addr #0 !dbg !24 {
entry:
  call void @llvm.dbg.value(metadata i8* %__fmt, metadata !38, metadata !DIExpression()), !dbg !40
  call void @llvm.dbg.value(metadata %struct.__va_list_tag* %__arg, metadata !39, metadata !DIExpression()), !dbg !40
  %0 = load %struct._IO_FILE*, %struct._IO_FILE** @stdout, align 8, !dbg !41
  %call = tail call i32 @vfprintf(%struct._IO_FILE* %0, i8* %__fmt, %struct.__va_list_tag* %__arg) #5, !dbg !42
  ret i32 %call, !dbg !43
}

declare dso_local i32 @vfprintf(%struct._IO_FILE*, i8*, %struct.__va_list_tag*) local_unnamed_addr #1


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, nameTableKind: None)
!1 = !DIFile(filename: "dyn-string.c", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2 = !{}
!3 = !{!4, !5, !6, !7, !10, !11, !8, !13}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dyn_string", file: !15, line: 30, size: 128, elements: !16)
!15 = !DIFile(filename: "./include/dyn-string.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!16 = !{!17, !18, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !14, file: !15, line: 32, baseType: !6, size: 32)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !14, file: !15, line: 33, baseType: !6, size: 32, offset: 32)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !14, file: !15, line: 34, baseType: !8, size: 64, offset: 64)
!20 = !{i32 2, !"Dwarf Version", i32 4}
!21 = !{i32 2, !"Debug Info Version", i32 3}
!22 = !{i32 1, !"wchar_size", i32 4}
!23 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!24 = distinct !DISubprogram(name: "vprintf", scope: !25, file: !25, line: 39, type: !26, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !37)
!25 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!26 = !DISubroutineType(types: !27)
!27 = !{!6, !28, !29}
!28 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !11)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, elements: !31)
!31 = !{!32, !34, !35, !36}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !30, file: !1, baseType: !33, size: 32)
!33 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !30, file: !1, baseType: !33, size: 32, offset: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !30, file: !1, baseType: !10, size: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !30, file: !1, baseType: !10, size: 64, offset: 128)
!37 = !{!38, !39}
!38 = !DILocalVariable(name: "__fmt", arg: 1, scope: !24, file: !25, line: 39, type: !28)
!39 = !DILocalVariable(name: "__arg", arg: 2, scope: !24, file: !25, line: 39, type: !29)
!40 = !DILocation(line: 0, scope: !24)
!41 = !DILocation(line: 41, column: 20, scope: !24)
!42 = !DILocation(line: 41, column: 10, scope: !24)
!43 = !DILocation(line: 41, column: 3, scope: !24)
!44 = distinct !DISubprogram(name: "getchar", scope: !25, file: !25, line: 47, type: !45, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !2)
!45 = !DISubroutineType(types: !46)
!46 = !{!6}
!47 = !DILocation(line: 49, column: 16, scope: !44)
!48 = !DILocation(line: 49, column: 10, scope: !44)
!49 = !DILocation(line: 49, column: 3, scope: !44)
!50 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !25, file: !25, line: 56, type: !51, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !112)
!51 = !DISubroutineType(types: !52)
!52 = !{!6, !53}
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !55, line: 7, baseType: !56)
!55 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !57, line: 49, size: 1728, elements: !58)
!57 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!58 = !{!59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !74, !76, !77, !78, !82, !84, !86, !90, !93, !95, !98, !101, !102, !103, !107, !108}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !56, file: !57, line: 51, baseType: !6, size: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !56, file: !57, line: 54, baseType: !8, size: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !56, file: !57, line: 55, baseType: !8, size: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !56, file: !57, line: 56, baseType: !8, size: 64, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !56, file: !57, line: 57, baseType: !8, size: 64, offset: 256)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !56, file: !57, line: 58, baseType: !8, size: 64, offset: 320)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !56, file: !57, line: 59, baseType: !8, size: 64, offset: 384)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !56, file: !57, line: 60, baseType: !8, size: 64, offset: 448)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !56, file: !57, line: 61, baseType: !8, size: 64, offset: 512)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !56, file: !57, line: 64, baseType: !8, size: 64, offset: 576)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !56, file: !57, line: 65, baseType: !8, size: 64, offset: 640)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !56, file: !57, line: 66, baseType: !8, size: 64, offset: 704)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !56, file: !57, line: 68, baseType: !72, size: 64, offset: 768)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !57, line: 36, flags: DIFlagFwdDecl)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !56, file: !57, line: 70, baseType: !75, size: 64, offset: 832)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !56, file: !57, line: 72, baseType: !6, size: 32, offset: 896)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !56, file: !57, line: 73, baseType: !6, size: 32, offset: 928)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !56, file: !57, line: 74, baseType: !79, size: 64, offset: 960)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !80, line: 152, baseType: !81)
!80 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!81 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !56, file: !57, line: 77, baseType: !83, size: 16, offset: 1024)
!83 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !56, file: !57, line: 78, baseType: !85, size: 8, offset: 1040)
!85 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !56, file: !57, line: 79, baseType: !87, size: 8, offset: 1048)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 1)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !56, file: !57, line: 81, baseType: !91, size: 64, offset: 1088)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !57, line: 43, baseType: null)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !56, file: !57, line: 89, baseType: !94, size: 64, offset: 1152)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !80, line: 153, baseType: !81)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !56, file: !57, line: 91, baseType: !96, size: 64, offset: 1216)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !57, line: 37, flags: DIFlagFwdDecl)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !56, file: !57, line: 92, baseType: !99, size: 64, offset: 1280)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !57, line: 38, flags: DIFlagFwdDecl)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !56, file: !57, line: 93, baseType: !75, size: 64, offset: 1344)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !56, file: !57, line: 94, baseType: !10, size: 64, offset: 1408)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !56, file: !57, line: 95, baseType: !104, size: 64, offset: 1472)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !105, line: 46, baseType: !106)
!105 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!106 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !56, file: !57, line: 96, baseType: !6, size: 32, offset: 1536)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !56, file: !57, line: 98, baseType: !109, size: 160, offset: 1568)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 160, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 20)
!112 = !{!113}
!113 = !DILocalVariable(name: "__fp", arg: 1, scope: !50, file: !25, line: 56, type: !53)
!114 = !DILocation(line: 0, scope: !50)
!115 = !DILocation(line: 58, column: 10, scope: !50)
!116 = !DILocation(line: 58, column: 3, scope: !50)
!117 = distinct !DISubprogram(name: "getc_unlocked", scope: !25, file: !25, line: 66, type: !51, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !118)
!118 = !{!119}
!119 = !DILocalVariable(name: "__fp", arg: 1, scope: !117, file: !25, line: 66, type: !53)
!120 = !DILocation(line: 0, scope: !117)
!121 = !DILocation(line: 68, column: 10, scope: !117)
!122 = !DILocation(line: 68, column: 3, scope: !117)
!123 = distinct !DISubprogram(name: "getchar_unlocked", scope: !25, file: !25, line: 73, type: !45, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !2)
!124 = !DILocation(line: 75, column: 10, scope: !123)
!125 = !DILocation(line: 75, column: 3, scope: !123)
!126 = distinct !DISubprogram(name: "putchar", scope: !25, file: !25, line: 82, type: !127, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !129)
!127 = !DISubroutineType(types: !128)
!128 = !{!6, !6}
!129 = !{!130}
!130 = !DILocalVariable(name: "__c", arg: 1, scope: !126, file: !25, line: 82, type: !6)
!131 = !DILocation(line: 0, scope: !126)
!132 = !DILocation(line: 84, column: 21, scope: !126)
!133 = !DILocation(line: 84, column: 10, scope: !126)
!134 = !DILocation(line: 84, column: 3, scope: !126)
!135 = distinct !DISubprogram(name: "fputc_unlocked", scope: !25, file: !25, line: 91, type: !136, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !138)
!136 = !DISubroutineType(types: !137)
!137 = !{!6, !6, !53}
!138 = !{!139, !140}
!139 = !DILocalVariable(name: "__c", arg: 1, scope: !135, file: !25, line: 91, type: !6)
!140 = !DILocalVariable(name: "__stream", arg: 2, scope: !135, file: !25, line: 91, type: !53)
!141 = !DILocation(line: 0, scope: !135)
!142 = !DILocation(line: 93, column: 10, scope: !135)
!143 = !DILocation(line: 93, column: 3, scope: !135)
!144 = distinct !DISubprogram(name: "putc_unlocked", scope: !25, file: !25, line: 101, type: !136, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !145)
!145 = !{!146, !147}
!146 = !DILocalVariable(name: "__c", arg: 1, scope: !144, file: !25, line: 101, type: !6)
!147 = !DILocalVariable(name: "__stream", arg: 2, scope: !144, file: !25, line: 101, type: !53)
!148 = !DILocation(line: 0, scope: !144)
!149 = !DILocation(line: 103, column: 10, scope: !144)
!150 = !DILocation(line: 103, column: 3, scope: !144)
!151 = distinct !DISubprogram(name: "putchar_unlocked", scope: !25, file: !25, line: 108, type: !127, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !152)
!152 = !{!153}
!153 = !DILocalVariable(name: "__c", arg: 1, scope: !151, file: !25, line: 108, type: !6)
!154 = !DILocation(line: 0, scope: !151)
!155 = !DILocation(line: 110, column: 10, scope: !151)
!156 = !DILocation(line: 110, column: 3, scope: !151)
!157 = distinct !DISubprogram(name: "getline", scope: !25, file: !25, line: 118, type: !158, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !162)
!158 = !DISubroutineType(types: !159)
!159 = !{!160, !7, !161, !53}
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !80, line: 193, baseType: !81)
