; ModuleID = 'ebitmap.bc'
source_filename = "ebitmap.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.stat64 = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.ebitmap_def = type { i32, %struct.simple_bitmap_def*, i32, i32, i64*, i64* }
%struct.simple_bitmap_def = type { i8*, i32, i32, [1 x i64] }
%struct.ebitmap_iterator = type { i64*, i32, i32, i32, i64, %struct.sbitmap_iterator }
%struct.sbitmap_iterator = type { i64*, i32, i32, i32, i64 }

@stdout = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@stdin = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [10 x i8] c"ebitmap.c\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"?\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, nameTableKind: None)
!1 = !DIFile(filename: "ebitmap.c", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2 = !{}
!3 = !{!4, !5, !6, !7, !10, !11, !13, !18, !30, !36}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ebitmap_def", file: !15, line: 28, size: 320, elements: !16)
!15 = !DIFile(filename: "./ebitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!16 = !{!17, !19, !33, !34, !35, !37}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "n_elts", scope: !14, file: !15, line: 30, baseType: !18, size: 32)
!18 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "wordmask", scope: !14, file: !15, line: 31, baseType: !20, size: 64, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "sbitmap", file: !21, line: 45, baseType: !22)
!21 = !DIFile(filename: "./sbitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "simple_bitmap_def", file: !21, line: 39, size: 192, elements: !24)
!24 = !{!25, !26, !27, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "popcount", scope: !23, file: !21, line: 41, baseType: !4, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "n_bits", scope: !23, file: !21, line: 42, baseType: !18, size: 32, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !23, file: !21, line: 43, baseType: !18, size: 32, offset: 96)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "elms", scope: !23, file: !21, line: 44, baseType: !29, size: 64, offset: 128)
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 64, elements: !31)
!30 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!31 = !{!32}
!32 = !DISubrange(count: 1)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "numwords", scope: !14, file: !15, line: 33, baseType: !18, size: 32, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "cacheindex", scope: !14, file: !15, line: 34, baseType: !18, size: 32, offset: 160)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !14, file: !15, line: 35, baseType: !36, size: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !14, file: !15, line: 36, baseType: !36, size: 64, offset: 256)
!38 = !{i32 2, !"Dwarf Version", i32 4}
!39 = !{i32 2, !"Debug Info Version", i32 3}
!40 = !{i32 1, !"wchar_size", i32 4}
!41 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!42 = distinct !DISubprogram(name: "vprintf", scope: !43, file: !43, line: 39, type: !44, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !54)
!43 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!44 = !DISubroutineType(types: !45)
!45 = !{!6, !46, !47}
!46 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !11)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, elements: !49)
!49 = !{!50, !51, !52, !53}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !48, file: !1, baseType: !18, size: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !48, file: !1, baseType: !18, size: 32, offset: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !48, file: !1, baseType: !10, size: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !48, file: !1, baseType: !10, size: 64, offset: 128)
!54 = !{!55, !56}
!55 = !DILocalVariable(name: "__fmt", arg: 1, scope: !42, file: !43, line: 39, type: !46)
!56 = !DILocalVariable(name: "__arg", arg: 2, scope: !42, file: !43, line: 39, type: !47)
!57 = !DILocation(line: 0, scope: !42)
!58 = !DILocation(line: 41, column: 20, scope: !42)
!59 = !DILocation(line: 41, column: 10, scope: !42)
!60 = !DILocation(line: 41, column: 3, scope: !42)
!61 = distinct !DISubprogram(name: "getchar", scope: !43, file: !43, line: 47, type: !62, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !2)
!62 = !DISubroutineType(types: !63)
!63 = !{!6}
!64 = !DILocation(line: 49, column: 16, scope: !61)
!65 = !DILocation(line: 49, column: 10, scope: !61)
!66 = !DILocation(line: 49, column: 3, scope: !61)
!67 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !43, file: !43, line: 56, type: !68, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !126)
!68 = !DISubroutineType(types: !69)
!69 = !{!6, !70}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !72, line: 7, baseType: !73)
!72 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !74, line: 49, size: 1728, elements: !75)
!74 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!75 = !{!76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !91, !93, !94, !95, !99, !101, !103, !105, !108, !110, !113, !116, !117, !118, !121, !122}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !73, file: !74, line: 51, baseType: !6, size: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !73, file: !74, line: 54, baseType: !8, size: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !73, file: !74, line: 55, baseType: !8, size: 64, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !73, file: !74, line: 56, baseType: !8, size: 64, offset: 192)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !73, file: !74, line: 57, baseType: !8, size: 64, offset: 256)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !73, file: !74, line: 58, baseType: !8, size: 64, offset: 320)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !73, file: !74, line: 59, baseType: !8, size: 64, offset: 384)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !73, file: !74, line: 60, baseType: !8, size: 64, offset: 448)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !73, file: !74, line: 61, baseType: !8, size: 64, offset: 512)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !73, file: !74, line: 64, baseType: !8, size: 64, offset: 576)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !73, file: !74, line: 65, baseType: !8, size: 64, offset: 640)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !73, file: !74, line: 66, baseType: !8, size: 64, offset: 704)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !73, file: !74, line: 68, baseType: !89, size: 64, offset: 768)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !74, line: 36, flags: DIFlagFwdDecl)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !73, file: !74, line: 70, baseType: !92, size: 64, offset: 832)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !73, file: !74, line: 72, baseType: !6, size: 32, offset: 896)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !73, file: !74, line: 73, baseType: !6, size: 32, offset: 928)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !73, file: !74, line: 74, baseType: !96, size: 64, offset: 960)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !97, line: 152, baseType: !98)
!97 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!98 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !73, file: !74, line: 77, baseType: !100, size: 16, offset: 1024)
!100 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !73, file: !74, line: 78, baseType: !102, size: 8, offset: 1040)
!102 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !73, file: !74, line: 79, baseType: !104, size: 8, offset: 1048)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8, elements: !31)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !73, file: !74, line: 81, baseType: !106, size: 64, offset: 1088)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !74, line: 43, baseType: null)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !73, file: !74, line: 89, baseType: !109, size: 64, offset: 1152)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !97, line: 153, baseType: !98)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !73, file: !74, line: 91, baseType: !111, size: 64, offset: 1216)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !74, line: 37, flags: DIFlagFwdDecl)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !73, file: !74, line: 92, baseType: !114, size: 64, offset: 1280)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !74, line: 38, flags: DIFlagFwdDecl)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !73, file: !74, line: 93, baseType: !92, size: 64, offset: 1344)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !73, file: !74, line: 94, baseType: !10, size: 64, offset: 1408)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !73, file: !74, line: 95, baseType: !119, size: 64, offset: 1472)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !120, line: 46, baseType: !30)
!120 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !73, file: !74, line: 96, baseType: !6, size: 32, offset: 1536)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !73, file: !74, line: 98, baseType: !123, size: 160, offset: 1568)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 160, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 20)
!126 = !{!127}
!127 = !DILocalVariable(name: "__fp", arg: 1, scope: !67, file: !43, line: 56, type: !70)
!128 = !DILocation(line: 0, scope: !67)
!129 = !DILocation(line: 58, column: 10, scope: !67)
!130 = !DILocation(line: 58, column: 3, scope: !67)
!131 = distinct !DISubprogram(name: "getc_unlocked", scope: !43, file: !43, line: 66, type: !68, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !132)
!132 = !{!133}
!133 = !DILocalVariable(name: "__fp", arg: 1, scope: !131, file: !43, line: 66, type: !70)
!134 = !DILocation(line: 0, scope: !131)
!135 = !DILocation(line: 68, column: 10, scope: !131)
!136 = !DILocation(line: 68, column: 3, scope: !131)
!137 = distinct !DISubprogram(name: "getchar_unlocked", scope: !43, file: !43, line: 73, type: !62, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !2)
!138 = !DILocation(line: 75, column: 10, scope: !137)
!139 = !DILocation(line: 75, column: 3, scope: !137)
!140 = distinct !DISubprogram(name: "putchar", scope: !43, file: !43, line: 82, type: !141, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !143)
!141 = !DISubroutineType(types: !142)
!142 = !{!6, !6}
!143 = !{!144}
!144 = !DILocalVariable(name: "__c", arg: 1, scope: !140, file: !43, line: 82, type: !6)
!145 = !DILocation(line: 0, scope: !140)
!146 = !DILocation(line: 84, column: 21, scope: !140)
!147 = !DILocation(line: 84, column: 10, scope: !140)
!148 = !DILocation(line: 84, column: 3, scope: !140)
!149 = distinct !DISubprogram(name: "fputc_unlocked", scope: !43, file: !43, line: 91, type: !150, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !152)
!150 = !DISubroutineType(types: !151)
!151 = !{!6, !6, !70}
!152 = !{!153, !154}
!153 = !DILocalVariable(name: "__c", arg: 1, scope: !149, file: !43, line: 91, type: !6)
!154 = !DILocalVariable(name: "__stream", arg: 2, scope: !149, file: !43, line: 91, type: !70)
!155 = !DILocation(line: 0, scope: !149)
!156 = !DILocation(line: 93, column: 10, scope: !149)
!157 = !DILocation(line: 93, column: 3, scope: !149)
!158 = distinct !DISubprogram(name: "putc_unlocked", scope: !43, file: !43, line: 101, type: !150, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !159)
!159 = !{!160, !161}
!160 = !DILocalVariable(name: "__c", arg: 1, scope: !158, file: !43, line: 101, type: !6)
!161 = !DILocalVariable(name: "__stream", arg: 2, scope: !158, file: !43, line: 101, type: !70)
!162 = !DILocation(line: 0, scope: !158)
!163 = !DILocation(line: 103, column: 10, scope: !158)
!164 = !DILocation(line: 103, column: 3, scope: !158)
!165 = distinct !DISubprogram(name: "putchar_unlocked", scope: !43, file: !43, line: 108, type: !141, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !166)
!166 = !{!167}
!167 = !DILocalVariable(name: "__c", arg: 1, scope: !165, file: !43, line: 108, type: !6)
!168 = !DILocation(line: 0, scope: !165)
!169 = !DILocation(line: 110, column: 10, scope: !165)
!170 = !DILocation(line: 110, column: 3, scope: !165)
!171 = distinct !DISubprogram(name: "getline", scope: !43, file: !43, line: 118, type: !172, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !176)
!172 = !DISubroutineType(types: !173)
!173 = !{!174, !7, !175, !70}
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !97, line: 193, baseType: !98)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!176 = !{!177, !178, !179}
!177 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !171, file: !43, line: 118, type: !7)
!178 = !DILocalVariable(name: "__n", arg: 2, scope: !171, file: !43, line: 118, type: !175)
!179 = !DILocalVariable(name: "__stream", arg: 3, scope: !171, file: !43, line: 118, type: !70)
!180 = !DILocation(line: 0, scope: !171)
!181 = !DILocation(line: 120, column: 10, scope: !171)
!182 = !DILocation(line: 120, column: 3, scope: !171)
!183 = distinct !DISubprogram(name: "feof_unlocked", scope: !43, file: !43, line: 128, type: !68, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !184)
!184 = !{!185}
!185 = !DILocalVariable(name: "__stream", arg: 1, scope: !183, file: !43, line: 128, type: !70)
!186 = !DILocation(line: 0, scope: !183)
!187 = !DILocation(line: 130, column: 10, scope: !183)
!188 = !DILocation(line: 130, column: 3, scope: !183)
!189 = distinct !DISubprogram(name: "ferror_unlocked", scope: !43, file: !43, line: 135, type: !68, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !190)
!190 = !{!191}
!191 = !DILocalVariable(name: "__stream", arg: 1, scope: !189, file: !43, line: 135, type: !70)
!192 = !DILocation(line: 0, scope: !189)
!193 = !DILocation(line: 137, column: 10, scope: !189)
!194 = !DILocation(line: 137, column: 3, scope: !189)
!195 = distinct !DISubprogram(name: "tolower", scope: !196, file: !196, line: 207, type: !141, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !197)
!196 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!197 = !{!198}
!198 = !DILocalVariable(name: "__c", arg: 1, scope: !195, file: !196, line: 207, type: !6)
!199 = !DILocation(line: 0, scope: !195)
!200 = !DILocation(line: 209, column: 22, scope: !195)
!201 = !DILocation(line: 209, column: 39, scope: !195)
!202 = !DILocation(line: 209, column: 38, scope: !195)
!203 = !DILocation(line: 209, column: 37, scope: !195)
!204 = !DILocation(line: 209, column: 10, scope: !195)
!205 = !DILocation(line: 209, column: 3, scope: !195)
!206 = distinct !DISubprogram(name: "toupper", scope: !196, file: !196, line: 213, type: !141, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !207)
!207 = !{!208}
!208 = !DILocalVariable(name: "__c", arg: 1, scope: !206, file: !196, line: 213, type: !6)
!209 = !DILocation(line: 0, scope: !206)
!210 = !DILocation(line: 215, column: 22, scope: !206)
!211 = !DILocation(line: 215, column: 39, scope: !206)
!212 = !DILocation(line: 215, column: 38, scope: !206)
!213 = !DILocation(line: 215, column: 37, scope: !206)
!214 = !DILocation(line: 215, column: 10, scope: !206)
!215 = !DILocation(line: 215, column: 3, scope: !206)
!216 = distinct !DISubprogram(name: "atoi", scope: !217, file: !217, line: 361, type: !218, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !220)
!217 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!218 = !DISubroutineType(types: !219)
!219 = !{!6, !11}
!220 = !{!221}
!221 = !DILocalVariable(name: "__nptr", arg: 1, scope: !216, file: !217, line: 361, type: !11)
!222 = !DILocation(line: 0, scope: !216)
!223 = !DILocation(line: 363, column: 16, scope: !216)
!224 = !DILocation(line: 363, column: 10, scope: !216)
!225 = !DILocation(line: 363, column: 3, scope: !216)
!226 = distinct !DISubprogram(name: "atol", scope: !217, file: !217, line: 366, type: !227, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !229)
!227 = !DISubroutineType(types: !228)
!228 = !{!98, !11}
!229 = !{!230}
!230 = !DILocalVariable(name: "__nptr", arg: 1, scope: !226, file: !217, line: 366, type: !11)
!231 = !DILocation(line: 0, scope: !226)
!232 = !DILocation(line: 368, column: 10, scope: !226)
!233 = !DILocation(line: 368, column: 3, scope: !226)
!234 = distinct !DISubprogram(name: "atoll", scope: !217, file: !217, line: 373, type: !235, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !238)
!235 = !DISubroutineType(types: !236)
!236 = !{!237, !11}
!237 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!238 = !{!239}
!239 = !DILocalVariable(name: "__nptr", arg: 1, scope: !234, file: !217, line: 373, type: !11)
!240 = !DILocation(line: 0, scope: !234)
!241 = !DILocation(line: 375, column: 10, scope: !234)
!242 = !DILocation(line: 375, column: 3, scope: !234)
!243 = distinct !DISubprogram(name: "bsearch", scope: !244, file: !244, line: 20, type: !245, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !253)
!244 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!245 = !DISubroutineType(types: !246)
!246 = !{!10, !247, !247, !119, !119, !249}
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !217, line: 808, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{!6, !247, !247}
!253 = !{!254, !255, !256, !257, !258, !259, !260, !261, !262, !263}
!254 = !DILocalVariable(name: "__key", arg: 1, scope: !243, file: !244, line: 20, type: !247)
!255 = !DILocalVariable(name: "__base", arg: 2, scope: !243, file: !244, line: 20, type: !247)
!256 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !243, file: !244, line: 20, type: !119)
!257 = !DILocalVariable(name: "__size", arg: 4, scope: !243, file: !244, line: 20, type: !119)
!258 = !DILocalVariable(name: "__compar", arg: 5, scope: !243, file: !244, line: 21, type: !249)
!259 = !DILocalVariable(name: "__l", scope: !243, file: !244, line: 23, type: !119)
!260 = !DILocalVariable(name: "__u", scope: !243, file: !244, line: 23, type: !119)
!261 = !DILocalVariable(name: "__idx", scope: !243, file: !244, line: 23, type: !119)
!262 = !DILocalVariable(name: "__p", scope: !243, file: !244, line: 24, type: !247)
!263 = !DILocalVariable(name: "__comparison", scope: !243, file: !244, line: 25, type: !6)
!264 = !DILocation(line: 0, scope: !243)
!265 = !DILocation(line: 29, column: 3, scope: !243)
!266 = !DILocation(line: 27, column: 7, scope: !243)
!267 = !DILocation(line: 29, column: 14, scope: !243)
!268 = !DILocation(line: 31, column: 20, scope: !269)
!269 = distinct !DILexicalBlock(scope: !243, file: !244, line: 30, column: 5)
!270 = !DILocation(line: 31, column: 27, scope: !269)
!271 = !DILocation(line: 32, column: 56, scope: !269)
!272 = !DILocation(line: 32, column: 47, scope: !269)
!273 = !DILocation(line: 33, column: 22, scope: !269)
!274 = !DILocation(line: 34, column: 24, scope: !275)
!275 = distinct !DILexicalBlock(scope: !269, file: !244, line: 34, column: 11)
!276 = !DILocation(line: 34, column: 11, scope: !269)
!277 = !DILocation(line: 36, column: 29, scope: !278)
!278 = distinct !DILexicalBlock(scope: !275, file: !244, line: 36, column: 16)
!279 = !DILocation(line: 36, column: 16, scope: !275)
!280 = !DILocation(line: 37, column: 14, scope: !278)
!281 = distinct !{!281, !265, !282}
!282 = !DILocation(line: 40, column: 5, scope: !243)
!283 = !DILocation(line: 43, column: 1, scope: !243)
!284 = distinct !DISubprogram(name: "atof", scope: !285, file: !285, line: 25, type: !286, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !289)
!285 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!286 = !DISubroutineType(types: !287)
!287 = !{!288, !11}
!288 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!289 = !{!290}
!290 = !DILocalVariable(name: "__nptr", arg: 1, scope: !284, file: !285, line: 25, type: !11)
!291 = !DILocation(line: 0, scope: !284)
!292 = !DILocation(line: 27, column: 10, scope: !284)
!293 = !DILocation(line: 27, column: 3, scope: !284)
!294 = distinct !DISubprogram(name: "strtoimax", scope: !295, file: !295, line: 324, type: !296, scopeLine: 326, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !302)
!295 = !DIFile(filename: "/usr/include/inttypes.h", directory: "")
!296 = !DISubroutineType(types: !297)
!297 = !{!298, !46, !301, !6}
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !299, line: 101, baseType: !300)
!299 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !97, line: 72, baseType: !98)
!301 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !7)
!302 = !{!303, !304, !305}
!303 = !DILocalVariable(name: "nptr", arg: 1, scope: !294, file: !295, line: 324, type: !46)
!304 = !DILocalVariable(name: "endptr", arg: 2, scope: !294, file: !295, line: 324, type: !301)
!305 = !DILocalVariable(name: "base", arg: 3, scope: !294, file: !295, line: 324, type: !6)
!306 = !DILocation(line: 0, scope: !294)
!307 = !DILocation(line: 327, column: 10, scope: !294)
!308 = !DILocation(line: 327, column: 3, scope: !294)
!309 = distinct !DISubprogram(name: "strtoumax", scope: !295, file: !295, line: 336, type: !310, scopeLine: 338, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !314)
!310 = !DISubroutineType(types: !311)
!311 = !{!312, !46, !301, !6}
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !299, line: 102, baseType: !313)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !97, line: 73, baseType: !30)
!314 = !{!315, !316, !317}
!315 = !DILocalVariable(name: "nptr", arg: 1, scope: !309, file: !295, line: 336, type: !46)
!316 = !DILocalVariable(name: "endptr", arg: 2, scope: !309, file: !295, line: 336, type: !301)
!317 = !DILocalVariable(name: "base", arg: 3, scope: !309, file: !295, line: 336, type: !6)
!318 = !DILocation(line: 0, scope: !309)
!319 = !DILocation(line: 339, column: 10, scope: !309)
!320 = !DILocation(line: 339, column: 3, scope: !309)
!321 = distinct !DISubprogram(name: "wcstoimax", scope: !295, file: !295, line: 348, type: !322, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !331)
!322 = !DISubroutineType(types: !323)
!323 = !{!298, !324, !328, !6}
!324 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gwchar_t", file: !295, line: 34, baseType: !6)
!328 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!331 = !{!332, !333, !334}
!332 = !DILocalVariable(name: "nptr", arg: 1, scope: !321, file: !295, line: 348, type: !324)
!333 = !DILocalVariable(name: "endptr", arg: 2, scope: !321, file: !295, line: 348, type: !328)
!334 = !DILocalVariable(name: "base", arg: 3, scope: !321, file: !295, line: 348, type: !6)
!335 = !DILocation(line: 0, scope: !321)
!336 = !DILocation(line: 351, column: 10, scope: !321)
!337 = !DILocation(line: 351, column: 3, scope: !321)
!338 = distinct !DISubprogram(name: "wcstoumax", scope: !295, file: !295, line: 362, type: !339, scopeLine: 364, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !341)
!339 = !DISubroutineType(types: !340)
!340 = !{!312, !324, !328, !6}
!341 = !{!342, !343, !344}
!342 = !DILocalVariable(name: "nptr", arg: 1, scope: !338, file: !295, line: 362, type: !324)
!343 = !DILocalVariable(name: "endptr", arg: 2, scope: !338, file: !295, line: 362, type: !328)
!344 = !DILocalVariable(name: "base", arg: 3, scope: !338, file: !295, line: 362, type: !6)
!345 = !DILocation(line: 0, scope: !338)
!346 = !DILocation(line: 365, column: 10, scope: !338)
!347 = !DILocation(line: 365, column: 3, scope: !338)
!348 = distinct !DISubprogram(name: "stat", scope: !349, file: !349, line: 453, type: !350, scopeLine: 454, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !389)
!349 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "")
!350 = !DISubroutineType(types: !351)
!351 = !{!6, !11, !352}
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !354, line: 46, size: 1152, elements: !355)
!354 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!355 = !{!356, !358, !360, !362, !364, !366, !368, !369, !370, !371, !373, !375, !383, !384, !385}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !353, file: !354, line: 48, baseType: !357, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !97, line: 145, baseType: !30)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !353, file: !354, line: 53, baseType: !359, size: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !97, line: 148, baseType: !30)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !353, file: !354, line: 61, baseType: !361, size: 64, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !97, line: 151, baseType: !30)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !353, file: !354, line: 62, baseType: !363, size: 32, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !97, line: 150, baseType: !18)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !353, file: !354, line: 64, baseType: !365, size: 32, offset: 224)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !97, line: 146, baseType: !18)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !353, file: !354, line: 65, baseType: !367, size: 32, offset: 256)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !97, line: 147, baseType: !18)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !353, file: !354, line: 67, baseType: !6, size: 32, offset: 288)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !353, file: !354, line: 69, baseType: !357, size: 64, offset: 320)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !353, file: !354, line: 74, baseType: !96, size: 64, offset: 384)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !353, file: !354, line: 78, baseType: !372, size: 64, offset: 448)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !97, line: 174, baseType: !98)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !353, file: !354, line: 80, baseType: !374, size: 64, offset: 512)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !97, line: 179, baseType: !98)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !353, file: !354, line: 91, baseType: !376, size: 128, offset: 576)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !377, line: 10, size: 128, elements: !378)
!377 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!378 = !{!379, !381}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !376, file: !377, line: 12, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !97, line: 160, baseType: !98)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !376, file: !377, line: 16, baseType: !382, size: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !97, line: 196, baseType: !98)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !353, file: !354, line: 92, baseType: !376, size: 128, offset: 704)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !353, file: !354, line: 93, baseType: !376, size: 128, offset: 832)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !353, file: !354, line: 106, baseType: !386, size: 192, offset: 960)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !382, size: 192, elements: !387)
!387 = !{!388}
!388 = !DISubrange(count: 3)
!389 = !{!390, !391}
!390 = !DILocalVariable(name: "__path", arg: 1, scope: !348, file: !349, line: 453, type: !11)
!391 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !348, file: !349, line: 453, type: !352)
!392 = !DILocation(line: 0, scope: !348)
!393 = !DILocation(line: 455, column: 10, scope: !348)
!394 = !DILocation(line: 455, column: 3, scope: !348)
!395 = distinct !DISubprogram(name: "lstat", scope: !349, file: !349, line: 460, type: !350, scopeLine: 461, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !396)
!396 = !{!397, !398}
!397 = !DILocalVariable(name: "__path", arg: 1, scope: !395, file: !349, line: 460, type: !11)
!398 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !395, file: !349, line: 460, type: !352)
!399 = !DILocation(line: 0, scope: !395)
!400 = !DILocation(line: 462, column: 10, scope: !395)
!401 = !DILocation(line: 462, column: 3, scope: !395)
!402 = distinct !DISubprogram(name: "fstat", scope: !349, file: !349, line: 467, type: !403, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !405)
!403 = !DISubroutineType(types: !404)
!404 = !{!6, !6, !352}
!405 = !{!406, !407}
!406 = !DILocalVariable(name: "__fd", arg: 1, scope: !402, file: !349, line: 467, type: !6)
!407 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !402, file: !349, line: 467, type: !352)
!408 = !DILocation(line: 0, scope: !402)
!409 = !DILocation(line: 469, column: 10, scope: !402)
!410 = !DILocation(line: 469, column: 3, scope: !402)
!411 = distinct !DISubprogram(name: "fstatat", scope: !349, file: !349, line: 474, type: !412, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !414)
!412 = !DISubroutineType(types: !413)
!413 = !{!6, !6, !11, !352, !6}
!414 = !{!415, !416, !417, !418}
!415 = !DILocalVariable(name: "__fd", arg: 1, scope: !411, file: !349, line: 474, type: !6)
!416 = !DILocalVariable(name: "__filename", arg: 2, scope: !411, file: !349, line: 474, type: !11)
!417 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !411, file: !349, line: 474, type: !352)
!418 = !DILocalVariable(name: "__flag", arg: 4, scope: !411, file: !349, line: 474, type: !6)
!419 = !DILocation(line: 0, scope: !411)
!420 = !DILocation(line: 477, column: 10, scope: !411)
!421 = !DILocation(line: 477, column: 3, scope: !411)
!422 = distinct !DISubprogram(name: "mknod", scope: !349, file: !349, line: 483, type: !423, scopeLine: 484, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !425)
!423 = !DISubroutineType(types: !424)
!424 = !{!6, !11, !363, !357}
!425 = !{!426, !427, !428}
!426 = !DILocalVariable(name: "__path", arg: 1, scope: !422, file: !349, line: 483, type: !11)
!427 = !DILocalVariable(name: "__mode", arg: 2, scope: !422, file: !349, line: 483, type: !363)
!428 = !DILocalVariable(name: "__dev", arg: 3, scope: !422, file: !349, line: 483, type: !357)
!429 = !DILocation(line: 0, scope: !422)
!430 = !DILocation(line: 485, column: 10, scope: !422)
!431 = !DILocation(line: 485, column: 3, scope: !422)
!432 = distinct !DISubprogram(name: "mknodat", scope: !349, file: !349, line: 491, type: !433, scopeLine: 493, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !435)
!433 = !DISubroutineType(types: !434)
!434 = !{!6, !6, !11, !363, !357}
!435 = !{!436, !437, !438, !439}
!436 = !DILocalVariable(name: "__fd", arg: 1, scope: !432, file: !349, line: 491, type: !6)
!437 = !DILocalVariable(name: "__path", arg: 2, scope: !432, file: !349, line: 491, type: !11)
!438 = !DILocalVariable(name: "__mode", arg: 3, scope: !432, file: !349, line: 491, type: !363)
!439 = !DILocalVariable(name: "__dev", arg: 4, scope: !432, file: !349, line: 491, type: !357)
!440 = !DILocation(line: 0, scope: !432)
!441 = !DILocation(line: 494, column: 10, scope: !432)
!442 = !DILocation(line: 494, column: 3, scope: !432)
!443 = distinct !DISubprogram(name: "stat64", scope: !349, file: !349, line: 502, type: !444, scopeLine: 503, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !466)
!444 = !DISubroutineType(types: !445)
!445 = !{!6, !11, !446}
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !354, line: 119, size: 1152, elements: !448)
!448 = !{!449, !450, !452, !453, !454, !455, !456, !457, !458, !459, !460, !462, !463, !464, !465}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !447, file: !354, line: 121, baseType: !357, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !447, file: !354, line: 123, baseType: !451, size: 64, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !97, line: 149, baseType: !30)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !447, file: !354, line: 124, baseType: !361, size: 64, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !447, file: !354, line: 125, baseType: !363, size: 32, offset: 192)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !447, file: !354, line: 132, baseType: !365, size: 32, offset: 224)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !447, file: !354, line: 133, baseType: !367, size: 32, offset: 256)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !447, file: !354, line: 135, baseType: !6, size: 32, offset: 288)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !447, file: !354, line: 136, baseType: !357, size: 64, offset: 320)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !447, file: !354, line: 137, baseType: !96, size: 64, offset: 384)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !447, file: !354, line: 143, baseType: !372, size: 64, offset: 448)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !447, file: !354, line: 144, baseType: !461, size: 64, offset: 512)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !97, line: 180, baseType: !98)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !447, file: !354, line: 152, baseType: !376, size: 128, offset: 576)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !447, file: !354, line: 153, baseType: !376, size: 128, offset: 704)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !447, file: !354, line: 154, baseType: !376, size: 128, offset: 832)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !447, file: !354, line: 164, baseType: !386, size: 192, offset: 960)
!466 = !{!467, !468}
!467 = !DILocalVariable(name: "__path", arg: 1, scope: !443, file: !349, line: 502, type: !11)
!468 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !443, file: !349, line: 502, type: !446)
!469 = !DILocation(line: 0, scope: !443)
!470 = !DILocation(line: 504, column: 10, scope: !443)
!471 = !DILocation(line: 504, column: 3, scope: !443)
!472 = distinct !DISubprogram(name: "lstat64", scope: !349, file: !349, line: 509, type: !444, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !473)
!473 = !{!474, !475}
!474 = !DILocalVariable(name: "__path", arg: 1, scope: !472, file: !349, line: 509, type: !11)
!475 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !472, file: !349, line: 509, type: !446)
!476 = !DILocation(line: 0, scope: !472)
!477 = !DILocation(line: 511, column: 10, scope: !472)
!478 = !DILocation(line: 511, column: 3, scope: !472)
!479 = distinct !DISubprogram(name: "fstat64", scope: !349, file: !349, line: 516, type: !480, scopeLine: 517, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !482)
!480 = !DISubroutineType(types: !481)
!481 = !{!6, !6, !446}
!482 = !{!483, !484}
!483 = !DILocalVariable(name: "__fd", arg: 1, scope: !479, file: !349, line: 516, type: !6)
!484 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !479, file: !349, line: 516, type: !446)
!485 = !DILocation(line: 0, scope: !479)
!486 = !DILocation(line: 518, column: 10, scope: !479)
!487 = !DILocation(line: 518, column: 3, scope: !479)
!488 = distinct !DISubprogram(name: "fstatat64", scope: !349, file: !349, line: 523, type: !489, scopeLine: 525, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !491)
!489 = !DISubroutineType(types: !490)
!490 = !{!6, !6, !11, !446, !6}
!491 = !{!492, !493, !494, !495}
!492 = !DILocalVariable(name: "__fd", arg: 1, scope: !488, file: !349, line: 523, type: !6)
!493 = !DILocalVariable(name: "__filename", arg: 2, scope: !488, file: !349, line: 523, type: !11)
!494 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !488, file: !349, line: 523, type: !446)
!495 = !DILocalVariable(name: "__flag", arg: 4, scope: !488, file: !349, line: 523, type: !6)
!496 = !DILocation(line: 0, scope: !488)
!497 = !DILocation(line: 526, column: 10, scope: !488)
!498 = !DILocation(line: 526, column: 3, scope: !488)
!499 = distinct !DISubprogram(name: "ebitmap_last_set_bit", scope: !1, file: !1, line: 86, type: !500, scopeLine: 87, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !503)
!500 = !DISubroutineType(types: !501)
!501 = !{!6, !502}
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "ebitmap", file: !15, line: 37, baseType: !13)
!503 = !{!504, !505, !506, !526}
!504 = !DILocalVariable(name: "map", arg: 1, scope: !499, file: !1, line: 86, type: !502)
!505 = !DILocalVariable(name: "i", scope: !499, file: !1, line: 88, type: !18)
!506 = !DILocalVariable(name: "ebi", scope: !499, file: !1, line: 89, type: !507)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "ebitmap_iterator", file: !15, line: 88, baseType: !508)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 70, size: 512, elements: !509)
!509 = !{!510, !511, !512, !513, !514, !515}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !508, file: !15, line: 72, baseType: !36, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "eltnum", scope: !508, file: !15, line: 75, baseType: !18, size: 32, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !508, file: !15, line: 78, baseType: !18, size: 32, offset: 96)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "bit_num", scope: !508, file: !15, line: 81, baseType: !18, size: 32, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !508, file: !15, line: 84, baseType: !30, size: 64, offset: 192)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "maskiter", scope: !508, file: !15, line: 87, baseType: !516, size: 256, offset: 256)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "sbitmap_iterator", file: !21, line: 111, baseType: !517)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 96, size: 256, elements: !518)
!518 = !{!519, !522, !523, !524, !525}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !517, file: !21, line: 98, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !517, file: !21, line: 101, baseType: !18, size: 32, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "word_num", scope: !517, file: !21, line: 104, baseType: !18, size: 32, offset: 96)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "bit_num", scope: !517, file: !21, line: 107, baseType: !18, size: 32, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !517, file: !21, line: 110, baseType: !30, size: 64, offset: 192)
!526 = !DILocalVariable(name: "foundbit", scope: !499, file: !1, line: 90, type: !5)
!527 = !DILocation(line: 0, scope: !499)
!528 = !DILocation(line: 88, column: 3, scope: !499)
!529 = !DILocation(line: 88, column: 16, scope: !499)
!530 = !DILocation(line: 89, column: 3, scope: !499)
!531 = !DILocation(line: 95, column: 3, scope: !532)
!532 = distinct !DILexicalBlock(scope: !499, file: !1, line: 95, column: 3)
!533 = !DILocation(line: 95, column: 3, scope: !534)
!534 = distinct !DILexicalBlock(scope: !532, file: !1, line: 95, column: 3)
!535 = distinct !{!535, !531, !536}
!536 = !DILocation(line: 98, column: 5, scope: !532)
!537 = !DILocation(line: 101, column: 7, scope: !538)
!538 = distinct !DILexicalBlock(scope: !499, file: !1, line: 101, column: 7)
!539 = !DILocation(line: 101, column: 7, scope: !499)
!540 = !DILocation(line: 104, column: 1, scope: !499)
!541 = distinct !DISubprogram(name: "ebitmap_iter_init", scope: !15, file: !15, line: 91, type: !542, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !545)
!542 = !DISubroutineType(types: !543)
!543 = !{null, !544, !502, !18}
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!545 = !{!546, !547, !548, !549, !554}
!546 = !DILocalVariable(name: "i", arg: 1, scope: !541, file: !15, line: 91, type: !544)
!547 = !DILocalVariable(name: "bmp", arg: 2, scope: !541, file: !15, line: 91, type: !502)
!548 = !DILocalVariable(name: "min", arg: 3, scope: !541, file: !15, line: 91, type: !18)
!549 = !DILocalVariable(name: "wordindex", scope: !550, file: !15, line: 118, type: !18)
!550 = distinct !DILexicalBlock(scope: !551, file: !15, line: 117, column: 2)
!551 = distinct !DILexicalBlock(scope: !552, file: !15, line: 114, column: 11)
!552 = distinct !DILexicalBlock(scope: !553, file: !15, line: 113, column: 5)
!553 = distinct !DILexicalBlock(scope: !541, file: !15, line: 108, column: 7)
!554 = !DILocalVariable(name: "count", scope: !550, file: !15, line: 119, type: !18)
!555 = !DILocation(line: 0, scope: !541)
!556 = !DILocation(line: 93, column: 26, scope: !541)
!557 = !DILocation(line: 93, column: 41, scope: !541)
!558 = !DILocation(line: 93, column: 3, scope: !541)
!559 = !DILocation(line: 95, column: 18, scope: !541)
!560 = !DILocation(line: 95, column: 6, scope: !541)
!561 = !DILocation(line: 95, column: 11, scope: !541)
!562 = !DILocation(line: 96, column: 15, scope: !563)
!563 = distinct !DILexicalBlock(scope: !541, file: !15, line: 96, column: 7)
!564 = !DILocation(line: 96, column: 7, scope: !541)
!565 = !DILocation(line: 98, column: 10, scope: !566)
!566 = distinct !DILexicalBlock(scope: !563, file: !15, line: 97, column: 5)
!567 = !DILocation(line: 98, column: 14, scope: !566)
!568 = !DILocation(line: 99, column: 10, scope: !566)
!569 = !DILocation(line: 99, column: 17, scope: !566)
!570 = !DILocation(line: 100, column: 10, scope: !566)
!571 = !DILocation(line: 100, column: 18, scope: !566)
!572 = !DILocation(line: 101, column: 10, scope: !566)
!573 = !DILocation(line: 101, column: 15, scope: !566)
!574 = !DILocation(line: 102, column: 7, scope: !566)
!575 = !DILocation(line: 104, column: 17, scope: !541)
!576 = !DILocation(line: 104, column: 10, scope: !541)
!577 = !DILocation(line: 105, column: 6, scope: !541)
!578 = !DILocation(line: 105, column: 14, scope: !541)
!579 = !DILocation(line: 106, column: 6, scope: !541)
!580 = !DILocation(line: 106, column: 13, scope: !541)
!581 = !DILocation(line: 108, column: 40, scope: !553)
!582 = !DILocation(line: 108, column: 50, scope: !553)
!583 = !DILocation(line: 108, column: 32, scope: !553)
!584 = !DILocation(line: 108, column: 7, scope: !541)
!585 = !DILocation(line: 110, column: 10, scope: !586)
!586 = distinct !DILexicalBlock(scope: !553, file: !15, line: 109, column: 5)
