; ModuleID = 'emit-rtl.bc'
source_filename = "emit-rtl.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.rtx_def = type { i32, %union.u }
%union.u = type { %struct.block_symbol }
%struct.block_symbol = type { [3 x %union.rtunion_def], %struct.object_block*, i64 }
%union.rtunion_def = type { i8* }
%struct.object_block = type { %union.section*, i32, i64, %struct.VEC_rtx_gc*, %struct.VEC_rtx_gc* }
%union.section = type opaque
%struct.VEC_rtx_gc = type { %struct.VEC_rtx_base }
%struct.VEC_rtx_base = type { i32, i32, [1 x %struct.rtx_def*] }
%struct.htab = type { i32 (i8*)*, i32 (i8*, i8*)*, void (i8*)*, i8**, i64, i64, i64, i32, i32, i8* (i64, i64)*, void (i8*)*, i8*, i8* (i8*, i64, i64)*, void (i8*, i8*)*, i32 }

!722 = !DIEnumerator(name: "TV_PLUGIN_RUN", value: 170, isUnsigned: true)
!723 = !DIEnumerator(name: "TV_REST_OF_COMPILATION", value: 171, isUnsigned: true)
!724 = !DIEnumerator(name: "TIMEVAR_LAST", value: 172, isUnsigned: true)
!725 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "reg_note", file: !400, line: 836, baseType: !7, size: 32, elements: !726)
!726 = !{!727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758}
!727 = !DIEnumerator(name: "REG_DEP_TRUE", value: 0, isUnsigned: true)
!728 = !DIEnumerator(name: "REG_DEAD", value: 1, isUnsigned: true)
!729 = !DIEnumerator(name: "REG_INC", value: 2, isUnsigned: true)
!730 = !DIEnumerator(name: "REG_EQUIV", value: 3, isUnsigned: true)
!731 = !DIEnumerator(name: "REG_EQUAL", value: 4, isUnsigned: true)
!732 = !DIEnumerator(name: "REG_NONNEG", value: 5, isUnsigned: true)
!733 = !DIEnumerator(name: "REG_UNUSED", value: 6, isUnsigned: true)
!734 = !DIEnumerator(name: "REG_CC_SETTER", value: 7, isUnsigned: true)
!735 = !DIEnumerator(name: "REG_CC_USER", value: 8, isUnsigned: true)
!736 = !DIEnumerator(name: "REG_LABEL_TARGET", value: 9, isUnsigned: true)
!737 = !DIEnumerator(name: "REG_LABEL_OPERAND", value: 10, isUnsigned: true)
!738 = !DIEnumerator(name: "REG_DEP_OUTPUT", value: 11, isUnsigned: true)
!739 = !DIEnumerator(name: "REG_DEP_ANTI", value: 12, isUnsigned: true)
!740 = !DIEnumerator(name: "REG_BR_PROB", value: 13, isUnsigned: true)
!741 = !DIEnumerator(name: "REG_VALUE_PROFILE", value: 14, isUnsigned: true)
!742 = !DIEnumerator(name: "REG_NOALIAS", value: 15, isUnsigned: true)
!743 = !DIEnumerator(name: "REG_BR_PRED", value: 16, isUnsigned: true)
!744 = !DIEnumerator(name: "REG_FRAME_RELATED_EXPR", value: 17, isUnsigned: true)
!745 = !DIEnumerator(name: "REG_CFA_DEF_CFA", value: 18, isUnsigned: true)
!746 = !DIEnumerator(name: "REG_CFA_ADJUST_CFA", value: 19, isUnsigned: true)
!747 = !DIEnumerator(name: "REG_CFA_OFFSET", value: 20, isUnsigned: true)
!748 = !DIEnumerator(name: "REG_CFA_REGISTER", value: 21, isUnsigned: true)
!749 = !DIEnumerator(name: "REG_CFA_RESTORE", value: 22, isUnsigned: true)
!750 = !DIEnumerator(name: "REG_CFA_SET_VDRAP", value: 23, isUnsigned: true)
!751 = !DIEnumerator(name: "REG_EH_CONTEXT", value: 24, isUnsigned: true)
!752 = !DIEnumerator(name: "REG_EH_REGION", value: 25, isUnsigned: true)
!753 = !DIEnumerator(name: "REG_SAVE_NOTE", value: 26, isUnsigned: true)
!754 = !DIEnumerator(name: "REG_NORETURN", value: 27, isUnsigned: true)
!755 = !DIEnumerator(name: "REG_NON_LOCAL_GOTO", value: 28, isUnsigned: true)
!756 = !DIEnumerator(name: "REG_CROSSING_JUMP", value: 29, isUnsigned: true)
!757 = !DIEnumerator(name: "REG_SETJMP", value: 30, isUnsigned: true)
!758 = !DIEnumerator(name: "REG_NOTE_MAX", value: 31, isUnsigned: true)
!759 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "insn_note", file: !400, line: 956, baseType: !7, size: 32, elements: !760)
!760 = !{!761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774}
!761 = !DIEnumerator(name: "NOTE_INSN_DELETED", value: 0, isUnsigned: true)
!762 = !DIEnumerator(name: "NOTE_INSN_DELETED_LABEL", value: 1, isUnsigned: true)
!763 = !DIEnumerator(name: "NOTE_INSN_BLOCK_BEG", value: 2, isUnsigned: true)
!764 = !DIEnumerator(name: "NOTE_INSN_BLOCK_END", value: 3, isUnsigned: true)
!765 = !DIEnumerator(name: "NOTE_INSN_FUNCTION_BEG", value: 4, isUnsigned: true)
!766 = !DIEnumerator(name: "NOTE_INSN_PROLOGUE_END", value: 5, isUnsigned: true)
!767 = !DIEnumerator(name: "NOTE_INSN_EPILOGUE_BEG", value: 6, isUnsigned: true)
!768 = !DIEnumerator(name: "NOTE_INSN_EH_REGION_BEG", value: 7, isUnsigned: true)
!769 = !DIEnumerator(name: "NOTE_INSN_EH_REGION_END", value: 8, isUnsigned: true)
!770 = !DIEnumerator(name: "NOTE_INSN_VAR_LOCATION", value: 9, isUnsigned: true)
!771 = !DIEnumerator(name: "NOTE_INSN_BASIC_BLOCK", value: 10, isUnsigned: true)
!772 = !DIEnumerator(name: "NOTE_INSN_SWITCH_TEXT_SECTIONS", value: 11, isUnsigned: true)
!773 = !DIEnumerator(name: "NOTE_INSN_CFA_RESTORE_STATE", value: 12, isUnsigned: true)
!774 = !DIEnumerator(name: "NOTE_INSN_MAX", value: 13, isUnsigned: true)
!775 = !{!776, !777, !778, !779, !782, !783, !785, !787, !377, !1823, !7, !5, !399, !815, !780, !1824, !183, !903, !1025, !857, !874, !725, !1825, !1781, !1770, !1831, !1834, !1836, !1838, !1840, !1291, !1842}
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!778 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !781)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !786, line: 47, baseType: !7)
!786 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !788, line: 50, baseType: !789)
!788 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !400, line: 240, size: 384, elements: !791)
!791 = !{!792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !790, file: !400, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !790, file: !400, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !790, file: !400, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !790, file: !400, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !790, file: !400, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !790, file: !400, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !790, file: !400, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !790, file: !400, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !790, file: !400, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !790, file: !400, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !790, file: !400, line: 321, baseType: !803, size: 320, offset: 64)
!803 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !400, line: 315, size: 320, elements: !804)
!804 = !{!805, !1790, !1792, !1821, !1822}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !803, file: !400, line: 316, baseType: !806, size: 64)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !807, size: 64, elements: !822)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !400, line: 183, baseType: !808)
!808 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !400, line: 166, size: 64, elements: !809)
!809 = !{!810, !811, !812, !813, !814, !824, !825, !837, !840, !902, !1768, !1769, !1780, !1787}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !808, file: !400, line: 168, baseType: !778, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !808, file: !400, line: 169, baseType: !7, size: 32)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !808, file: !400, line: 170, baseType: !783, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !808, file: !400, line: 171, baseType: !787, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !808, file: !400, line: 172, baseType: !815, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !788, line: 53, baseType: !816)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !400, line: 359, size: 128, elements: !818)
!818 = !{!819, !820}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !817, file: !400, line: 360, baseType: !778, size: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !817, file: !400, line: 361, baseType: !821, size: 64, offset: 64)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !787, size: 64, elements: !822)
!822 = !{!823}
!823 = !DISubrange(count: 1)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !808, file: !400, line: 173, baseType: !5, size: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !808, file: !400, line: 174, baseType: !826, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !400, line: 133, baseType: !827)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !400, line: 115, size: 32, elements: !828)
!828 = !{!829, !830, !831, !832, !833, !834, !835, !836}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !827, file: !400, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !827, file: !400, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !827, file: !400, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !827, file: !400, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !827, file: !400, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !827, file: !400, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !827, file: !400, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !827, file: !400, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !808, file: !400, line: 175, baseType: !838, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !400, line: 175, flags: DIFlagFwdDecl)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !808, file: !400, line: 176, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !843, line: 75, size: 256, elements: !844)
!843 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!844 = !{!845, !860, !861, !862}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !842, file: !843, line: 76, baseType: !846, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !843, line: 68, baseType: !848)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !843, line: 63, size: 320, elements: !849)
!849 = !{!850, !852, !853, !854}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !848, file: !843, line: 64, baseType: !851, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !848, file: !843, line: 65, baseType: !851, size: 64, offset: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !848, file: !843, line: 66, baseType: !7, size: 32, offset: 128)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !848, file: !843, line: 67, baseType: !855, size: 128, offset: 192)
!855 = !DICompositeType(tag: DW_TAG_array_type, baseType: !856, size: 128, elements: !858)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !843, line: 29, baseType: !857)
!857 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!858 = !{!859}
!859 = !DISubrange(count: 2)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !842, file: !843, line: 77, baseType: !846, size: 64, offset: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !842, file: !843, line: 78, baseType: !7, size: 32, offset: 128)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !842, file: !843, line: 79, baseType: !863, size: 64, offset: 192)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !843, line: 49, baseType: !865)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !843, line: 45, size: 832, elements: !866)
!866 = !{!867, !868, !869}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !865, file: !843, line: 46, baseType: !851, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !865, file: !843, line: 47, baseType: !841, size: 64, offset: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !865, file: !843, line: 48, baseType: !870, size: 704, offset: 128)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !871, line: 164, size: 704, elements: !872)
!871 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!872 = !{!873, !875, !885, !886, !887, !888, !889, !890, !894, !898, !899, !900, !901}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !870, file: !871, line: 166, baseType: !874, size: 64)
!874 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !870, file: !871, line: 167, baseType: !876, size: 64, offset: 64)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !871, line: 157, size: 192, elements: !878)
!878 = !{!879, !880, !881}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !877, file: !871, line: 159, baseType: !780, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !877, file: !871, line: 160, baseType: !876, size: 64, offset: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !877, file: !871, line: 161, baseType: !882, size: 32, offset: 128)
!882 = !DICompositeType(tag: DW_TAG_array_type, baseType: !781, size: 32, elements: !883)
!883 = !{!884}
!884 = !DISubrange(count: 4)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !870, file: !871, line: 168, baseType: !780, size: 64, offset: 128)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !870, file: !871, line: 169, baseType: !780, size: 64, offset: 192)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !870, file: !871, line: 170, baseType: !780, size: 64, offset: 256)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !870, file: !871, line: 171, baseType: !874, size: 64, offset: 320)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !870, file: !871, line: 172, baseType: !778, size: 32, offset: 384)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !870, file: !871, line: 176, baseType: !891, size: 64, offset: 448)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DISubroutineType(types: !893)
!893 = !{!876, !782, !874}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !870, file: !871, line: 177, baseType: !895, size: 64, offset: 512)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DISubroutineType(types: !897)
!897 = !{null, !782, !876}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !870, file: !871, line: 178, baseType: !782, size: 64, offset: 576)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !870, file: !871, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !870, file: !871, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !870, file: !871, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !808, file: !400, line: 177, baseType: !903, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !788, line: 56, baseType: !904)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !151, line: 3371, size: 1792, elements: !906)
!906 = !{!907, !940, !946, !957, !976, !987, !992, !999, !1005, !1018, !1030, !1068, !1073, !1101, !1109, !1110, !1115, !1124, !1130, !1135, !1139, !1143, !1392, !1441, !1447, !1454, !1461, !1487, !1512, !1529, !1541, !1563, !1578, !1750}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !905, file: !151, line: 3372, baseType: !908, size: 64)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !151, line: 360, size: 64, elements: !909)
!909 = !{!910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !908, file: !151, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !908, file: !151, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !908, file: !151, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !908, file: !151, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !908, file: !151, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !908, file: !151, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !908, file: !151, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !908, file: !151, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !908, file: !151, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !908, file: !151, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !908, file: !151, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !908, file: !151, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !908, file: !151, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !908, file: !151, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !908, file: !151, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !908, file: !151, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !908, file: !151, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !908, file: !151, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !908, file: !151, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !908, file: !151, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !908, file: !151, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !908, file: !151, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !908, file: !151, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !908, file: !151, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !908, file: !151, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !908, file: !151, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !908, file: !151, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !908, file: !151, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !908, file: !151, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !908, file: !151, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !905, file: !151, line: 3373, baseType: !941, size: 192)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !151, line: 402, size: 192, elements: !942)
!942 = !{!943, !944, !945}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !941, file: !151, line: 403, baseType: !908, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !941, file: !151, line: 404, baseType: !903, size: 64, offset: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !941, file: !151, line: 405, baseType: !903, size: 64, offset: 128)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !905, file: !151, line: 3374, baseType: !947, size: 320)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !151, line: 1384, size: 320, elements: !948)
!948 = !{!949, !950}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !947, file: !151, line: 1385, baseType: !941, size: 192)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !947, file: !151, line: 1386, baseType: !951, size: 128, offset: 192)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !952, line: 58, baseType: !953)
!952 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !952, line: 54, size: 128, elements: !954)
!954 = !{!955, !956}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !953, file: !952, line: 56, baseType: !857, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !953, file: !952, line: 57, baseType: !874, size: 64, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !905, file: !151, line: 3375, baseType: !958, size: 256)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !151, line: 1397, size: 256, elements: !959)
!959 = !{!960, !961}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !958, file: !151, line: 1398, baseType: !941, size: 192)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !958, file: !151, line: 1399, baseType: !962, size: 64, offset: 192)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !964, line: 52, size: 256, elements: !965)
!964 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!965 = !{!966, !967, !968, !969, !970, !971, !972}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !963, file: !964, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !963, file: !964, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !963, file: !964, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !963, file: !964, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !963, file: !964, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !963, file: !964, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !963, file: !964, line: 62, baseType: !973, size: 192, offset: 64)
!973 = !DICompositeType(tag: DW_TAG_array_type, baseType: !857, size: 192, elements: !974)
!974 = !{!975}
!975 = !DISubrange(count: 3)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !905, file: !151, line: 3376, baseType: !977, size: 256)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !151, line: 1408, size: 256, elements: !978)
!978 = !{!979, !980}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !977, file: !151, line: 1409, baseType: !941, size: 192)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !977, file: !151, line: 1410, baseType: !981, size: 64, offset: 192)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !983, line: 27, size: 192, elements: !984)
!983 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!984 = !{!985, !986}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !982, file: !983, line: 29, baseType: !951, size: 128)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !982, file: !983, line: 30, baseType: !5, size: 32, offset: 128)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !905, file: !151, line: 3377, baseType: !988, size: 256)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !151, line: 1437, size: 256, elements: !989)
!989 = !{!990, !991}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !988, file: !151, line: 1438, baseType: !941, size: 192)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !988, file: !151, line: 1439, baseType: !903, size: 64, offset: 192)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !905, file: !151, line: 3378, baseType: !993, size: 256)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !151, line: 1418, size: 256, elements: !994)
!994 = !{!995, !996, !997}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !993, file: !151, line: 1419, baseType: !941, size: 192)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !993, file: !151, line: 1420, baseType: !778, size: 32, offset: 192)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !993, file: !151, line: 1421, baseType: !998, size: 8, offset: 224)
!998 = !DICompositeType(tag: DW_TAG_array_type, baseType: !781, size: 8, elements: !822)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !905, file: !151, line: 3379, baseType: !1000, size: 320)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !151, line: 1428, size: 320, elements: !1001)
!1001 = !{!1002, !1003, !1004}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1000, file: !151, line: 1429, baseType: !941, size: 192)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !1000, file: !151, line: 1430, baseType: !903, size: 64, offset: 192)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !1000, file: !151, line: 1431, baseType: !903, size: 64, offset: 256)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !905, file: !151, line: 3380, baseType: !1006, size: 320)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !151, line: 1460, size: 320, elements: !1007)
!1007 = !{!1008, !1009}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1006, file: !151, line: 1461, baseType: !941, size: 192)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1006, file: !151, line: 1462, baseType: !1010, size: 128, offset: 192)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1011, line: 31, size: 128, elements: !1012)
!1011 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1012 = !{!1013, !1016, !1017}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1010, file: !1011, line: 32, baseType: !1014, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !777)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1010, file: !1011, line: 33, baseType: !7, size: 32, offset: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1010, file: !1011, line: 34, baseType: !7, size: 32, offset: 96)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !905, file: !151, line: 3381, baseType: !1019, size: 384)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !151, line: 2507, size: 384, elements: !1020)
!1020 = !{!1021, !1022, !1027, !1028, !1029}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1019, file: !151, line: 2508, baseType: !941, size: 192)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1019, file: !151, line: 2509, baseType: !1023, size: 32, offset: 192)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1024, line: 58, baseType: !1025)
!1024 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1026, line: 44, baseType: !7)
!1026 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1019, file: !151, line: 2510, baseType: !7, size: 32, offset: 224)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1019, file: !151, line: 2511, baseType: !903, size: 64, offset: 256)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1019, file: !151, line: 2512, baseType: !903, size: 64, offset: 320)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !905, file: !151, line: 3382, baseType: !1031, size: 896)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !151, line: 2652, size: 896, elements: !1032)
!1032 = !{!1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1031, file: !151, line: 2653, baseType: !1019, size: 384)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1031, file: !151, line: 2654, baseType: !903, size: 64, offset: 384)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1031, file: !151, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1031, file: !151, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1031, file: !151, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1031, file: !151, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1031, file: !151, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1031, file: !151, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1031, file: !151, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1031, file: !151, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1031, file: !151, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1031, file: !151, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1031, file: !151, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1031, file: !151, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1031, file: !151, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1031, file: !151, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1031, file: !151, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1031, file: !151, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1031, file: !151, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1031, file: !151, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1031, file: !151, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1031, file: !151, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1031, file: !151, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1031, file: !151, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1031, file: !151, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1031, file: !151, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1031, file: !151, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1031, file: !151, line: 2703, baseType: !7, size: 32, offset: 512)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1031, file: !151, line: 2705, baseType: !903, size: 64, offset: 576)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1031, file: !151, line: 2706, baseType: !903, size: 64, offset: 640)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1031, file: !151, line: 2707, baseType: !903, size: 64, offset: 704)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1031, file: !151, line: 2708, baseType: !903, size: 64, offset: 768)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1031, file: !151, line: 2711, baseType: !1066, size: 64, offset: 832)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !151, line: 2711, flags: DIFlagFwdDecl)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !905, file: !151, line: 3383, baseType: !1069, size: 960)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !151, line: 2756, size: 960, elements: !1070)
!1070 = !{!1071, !1072}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1069, file: !151, line: 2757, baseType: !1031, size: 896)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1069, file: !151, line: 2758, baseType: !787, size: 64, offset: 896)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !905, file: !151, line: 3384, baseType: !1074, size: 1472)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !151, line: 3114, size: 1472, elements: !1075)
!1075 = !{!1076, !1097, !1098, !1099, !1100}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1074, file: !151, line: 3115, baseType: !1077, size: 1216)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !151, line: 2984, size: 1216, elements: !1078)
!1078 = !{!1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1077, file: !151, line: 2985, baseType: !1069, size: 960)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1077, file: !151, line: 2986, baseType: !903, size: 64, offset: 960)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1077, file: !151, line: 2987, baseType: !903, size: 64, offset: 1024)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1077, file: !151, line: 2988, baseType: !903, size: 64, offset: 1088)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1077, file: !151, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1077, file: !151, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1077, file: !151, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1077, file: !151, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1077, file: !151, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1077, file: !151, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1077, file: !151, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1077, file: !151, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1077, file: !151, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1077, file: !151, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1077, file: !151, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1077, file: !151, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1077, file: !151, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1077, file: !151, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1074, file: !151, line: 3117, baseType: !903, size: 64, offset: 1216)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1074, file: !151, line: 3119, baseType: !903, size: 64, offset: 1280)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1074, file: !151, line: 3121, baseType: !903, size: 64, offset: 1344)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1074, file: !151, line: 3123, baseType: !903, size: 64, offset: 1408)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !905, file: !151, line: 3385, baseType: !1102, size: 1088)
!1102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !151, line: 2874, size: 1088, elements: !1103)
!1103 = !{!1104, !1105, !1106}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1102, file: !151, line: 2875, baseType: !1069, size: 960)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1102, file: !151, line: 2876, baseType: !787, size: 64, offset: 960)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1102, file: !151, line: 2877, baseType: !1107, size: 64, offset: 1024)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !151, line: 2856, flags: DIFlagFwdDecl)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !905, file: !151, line: 3386, baseType: !1077, size: 1216)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !905, file: !151, line: 3387, baseType: !1111, size: 1280)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !151, line: 3093, size: 1280, elements: !1112)
!1112 = !{!1113, !1114}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1111, file: !151, line: 3094, baseType: !1077, size: 1216)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1111, file: !151, line: 3095, baseType: !1107, size: 64, offset: 1216)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !905, file: !151, line: 3388, baseType: !1116, size: 1216)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !151, line: 2824, size: 1216, elements: !1117)
!1117 = !{!1118, !1119, !1120, !1121, !1122, !1123}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1116, file: !151, line: 2825, baseType: !1031, size: 896)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1116, file: !151, line: 2827, baseType: !903, size: 64, offset: 896)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1116, file: !151, line: 2828, baseType: !903, size: 64, offset: 960)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1116, file: !151, line: 2829, baseType: !903, size: 64, offset: 1024)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1116, file: !151, line: 2830, baseType: !903, size: 64, offset: 1088)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1116, file: !151, line: 2831, baseType: !903, size: 64, offset: 1152)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !905, file: !151, line: 3389, baseType: !1125, size: 1024)
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !151, line: 2850, size: 1024, elements: !1126)
!1126 = !{!1127, !1128, !1129}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1125, file: !151, line: 2851, baseType: !1069, size: 960)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1125, file: !151, line: 2852, baseType: !778, size: 32, offset: 960)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1125, file: !151, line: 2853, baseType: !778, size: 32, offset: 992)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !905, file: !151, line: 3390, baseType: !1131, size: 1024)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !151, line: 2857, size: 1024, elements: !1132)
!1132 = !{!1133, !1134}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1131, file: !151, line: 2858, baseType: !1069, size: 960)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1131, file: !151, line: 2859, baseType: !1107, size: 64, offset: 960)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !905, file: !151, line: 3391, baseType: !1136, size: 960)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !151, line: 2862, size: 960, elements: !1137)
!1137 = !{!1138}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1136, file: !151, line: 2863, baseType: !1069, size: 960)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !905, file: !151, line: 3392, baseType: !1140, size: 1472)
!1140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !151, line: 3304, size: 1472, elements: !1141)
!1141 = !{!1142}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1140, file: !151, line: 3305, baseType: !1074, size: 1472)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !905, file: !151, line: 3393, baseType: !1144, size: 1792)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !151, line: 3248, size: 1792, elements: !1145)
!1145 = !{!1146, !1147, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1144, file: !151, line: 3249, baseType: !1074, size: 1472)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1144, file: !151, line: 3251, baseType: !1148, size: 64, offset: 1472)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1150, line: 463, size: 1152, elements: !1151)
!1150 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1151 = !{!1152, !1155, !1259, !1260, !1263, !1266, !1316, !1317, !1318, !1319, !1320, !1344, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1149, file: !1150, line: 464, baseType: !1153, size: 64)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64)
!1154 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1150, line: 464, flags: DIFlagFwdDecl)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1149, file: !1150, line: 467, baseType: !1156, size: 64, offset: 64)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !135, line: 374, size: 640, elements: !1158)
!1158 = !{!1159, !1234, !1235, !1248, !1249, !1250, !1251, !1252, !1253, !1255, !1257, !1258}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1157, file: !135, line: 377, baseType: !1160, size: 64)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !788, line: 111, baseType: !1161)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !135, line: 217, size: 832, elements: !1163)
!1163 = !{!1164, !1199, !1200, !1201, !1204, !1208, !1209, !1210, !1228, !1229, !1230, !1231, !1232, !1233}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1162, file: !135, line: 219, baseType: !1165, size: 64)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !135, line: 151, baseType: !1167)
!1167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !135, line: 151, size: 128, elements: !1168)
!1168 = !{!1169}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1167, file: !135, line: 151, baseType: !1170, size: 128)
!1170 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !135, line: 150, baseType: !1171)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !135, line: 150, size: 128, elements: !1172)
!1172 = !{!1173, !1174, !1175}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1171, file: !135, line: 150, baseType: !7, size: 32)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1171, file: !135, line: 150, baseType: !7, size: 32, offset: 32)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1171, file: !135, line: 150, baseType: !1176, size: 64, offset: 64)
!1176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1177, size: 64, elements: !822)
!1177 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !788, line: 108, baseType: !1178)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64)
!1179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !135, line: 122, size: 512, elements: !1180)
!1180 = !{!1181, !1182, !1183, !1191, !1192, !1193, !1194, !1195, !1196, !1197}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1179, file: !135, line: 124, baseType: !1161, size: 64)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1179, file: !135, line: 125, baseType: !1161, size: 64, offset: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1179, file: !135, line: 131, baseType: !1184, size: 64, offset: 128)
!1184 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !135, line: 128, size: 64, elements: !1185)
!1185 = !{!1186, !1190}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1184, file: !135, line: 129, baseType: !1187, size: 64)
!1187 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !788, line: 66, baseType: !1188)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64)
!1189 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !788, line: 65, flags: DIFlagFwdDecl)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1184, file: !135, line: 130, baseType: !787, size: 64)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1179, file: !135, line: 134, baseType: !782, size: 64, offset: 192)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1179, file: !135, line: 137, baseType: !903, size: 64, offset: 256)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1179, file: !135, line: 138, baseType: !1023, size: 32, offset: 320)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1179, file: !135, line: 142, baseType: !7, size: 32, offset: 352)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1179, file: !135, line: 144, baseType: !778, size: 32, offset: 384)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1179, file: !135, line: 145, baseType: !778, size: 32, offset: 416)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1179, file: !135, line: 146, baseType: !1198, size: 64, offset: 448)
!1198 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !135, line: 119, baseType: !874)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1162, file: !135, line: 220, baseType: !1165, size: 64, offset: 64)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1162, file: !135, line: 223, baseType: !782, size: 64, offset: 128)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1162, file: !135, line: 226, baseType: !1202, size: 64, offset: 192)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64)
!1203 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !135, line: 185, flags: DIFlagFwdDecl)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1162, file: !135, line: 229, baseType: !1205, size: 128, offset: 256)
!1205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1206, size: 128, elements: !858)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64)
!1207 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !135, line: 229, flags: DIFlagFwdDecl)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1162, file: !135, line: 232, baseType: !1161, size: 64, offset: 384)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1162, file: !135, line: 233, baseType: !1161, size: 64, offset: 448)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1162, file: !135, line: 238, baseType: !1211, size: 64, offset: 512)
!1211 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !135, line: 235, size: 64, elements: !1212)
!1212 = !{!1213, !1219}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1211, file: !135, line: 236, baseType: !1214, size: 64)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64)
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !135, line: 273, size: 128, elements: !1216)
!1216 = !{!1217, !1218}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1215, file: !135, line: 275, baseType: !1187, size: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1215, file: !135, line: 278, baseType: !1187, size: 64, offset: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1211, file: !135, line: 237, baseType: !1220, size: 64)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !135, line: 259, size: 320, elements: !1222)
!1222 = !{!1223, !1224, !1225, !1226, !1227}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1221, file: !135, line: 261, baseType: !787, size: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1221, file: !135, line: 262, baseType: !787, size: 64, offset: 64)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1221, file: !135, line: 266, baseType: !787, size: 64, offset: 128)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1221, file: !135, line: 267, baseType: !787, size: 64, offset: 192)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1221, file: !135, line: 270, baseType: !778, size: 32, offset: 256)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1162, file: !135, line: 241, baseType: !1198, size: 64, offset: 576)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1162, file: !135, line: 244, baseType: !778, size: 32, offset: 640)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1162, file: !135, line: 247, baseType: !778, size: 32, offset: 672)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1162, file: !135, line: 250, baseType: !778, size: 32, offset: 704)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1162, file: !135, line: 253, baseType: !778, size: 32, offset: 736)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1162, file: !135, line: 256, baseType: !778, size: 32, offset: 768)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1157, file: !135, line: 378, baseType: !1160, size: 64, offset: 64)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1157, file: !135, line: 381, baseType: !1236, size: 64, offset: 128)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64)
!1237 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !135, line: 282, baseType: !1238)
!1238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !135, line: 282, size: 128, elements: !1239)
!1239 = !{!1240}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1238, file: !135, line: 282, baseType: !1241, size: 128)
!1241 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !135, line: 281, baseType: !1242)
!1242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !135, line: 281, size: 128, elements: !1243)
!1243 = !{!1244, !1245, !1246}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1242, file: !135, line: 281, baseType: !7, size: 32)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1242, file: !135, line: 281, baseType: !7, size: 32, offset: 32)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1242, file: !135, line: 281, baseType: !1247, size: 64, offset: 64)
!1247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1160, size: 64, elements: !822)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1157, file: !135, line: 384, baseType: !778, size: 32, offset: 192)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1157, file: !135, line: 387, baseType: !778, size: 32, offset: 224)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1157, file: !135, line: 390, baseType: !778, size: 32, offset: 256)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1157, file: !135, line: 394, baseType: !1236, size: 64, offset: 320)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1157, file: !135, line: 396, baseType: !134, size: 32, offset: 384)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1157, file: !135, line: 399, baseType: !1254, size: 64, offset: 416)
!1254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 64, elements: !858)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1157, file: !135, line: 402, baseType: !1256, size: 64, offset: 480)
!1256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !858)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1157, file: !135, line: 406, baseType: !778, size: 32, offset: 544)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1157, file: !135, line: 409, baseType: !778, size: 32, offset: 576)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1149, file: !1150, line: 470, baseType: !1188, size: 64, offset: 128)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1149, file: !1150, line: 473, baseType: !1261, size: 64, offset: 192)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64)
!1262 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1150, line: 166, flags: DIFlagFwdDecl)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1149, file: !1150, line: 476, baseType: !1264, size: 64, offset: 256)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64)
!1265 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1150, line: 476, flags: DIFlagFwdDecl)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1149, file: !1150, line: 479, baseType: !1267, size: 64, offset: 320)
!1267 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !786, line: 144, baseType: !1268)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64)
!1269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !786, line: 100, size: 896, elements: !1270)
!1270 = !{!1271, !1278, !1283, !1288, !1290, !1293, !1294, !1295, !1296, !1297, !1302, !1304, !1305, !1310, !1315}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1269, file: !786, line: 102, baseType: !1272, size: 64)
!1272 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !786, line: 52, baseType: !1273)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64)
!1274 = !DISubroutineType(types: !1275)
!1275 = !{!785, !1276}
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64)
!1277 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1269, file: !786, line: 105, baseType: !1279, size: 64, offset: 64)
!1279 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !786, line: 59, baseType: !1280)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64)
!1281 = !DISubroutineType(types: !1282)
!1282 = !{!778, !1276, !1276}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1269, file: !786, line: 108, baseType: !1284, size: 64, offset: 128)
!1284 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !786, line: 63, baseType: !1285)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64)
!1286 = !DISubroutineType(types: !1287)
!1287 = !{null, !782}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1269, file: !786, line: 111, baseType: !1289, size: 64, offset: 192)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1269, file: !786, line: 114, baseType: !1291, size: 64, offset: 256)
!1291 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1292, line: 46, baseType: !857)
!1292 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1269, file: !786, line: 117, baseType: !1291, size: 64, offset: 320)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1269, file: !786, line: 120, baseType: !1291, size: 64, offset: 384)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1269, file: !786, line: 124, baseType: !7, size: 32, offset: 448)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1269, file: !786, line: 128, baseType: !7, size: 32, offset: 480)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1269, file: !786, line: 131, baseType: !1298, size: 64, offset: 512)
!1298 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !786, line: 75, baseType: !1299)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64)
!1300 = !DISubroutineType(types: !1301)
!1301 = !{!782, !1291, !1291}
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1269, file: !786, line: 132, baseType: !1303, size: 64, offset: 576)
!1303 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !786, line: 78, baseType: !1285)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1269, file: !786, line: 135, baseType: !782, size: 64, offset: 640)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1269, file: !786, line: 136, baseType: !1306, size: 64, offset: 704)
!1306 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !786, line: 82, baseType: !1307)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64)
!1308 = !DISubroutineType(types: !1309)
!1309 = !{!782, !782, !1291, !1291}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1269, file: !786, line: 137, baseType: !1311, size: 64, offset: 768)
!1311 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !786, line: 83, baseType: !1312)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64)
!1313 = !DISubroutineType(types: !1314)
!1314 = !{null, !782, !782}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1269, file: !786, line: 141, baseType: !7, size: 32, offset: 832)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1149, file: !1150, line: 484, baseType: !903, size: 64, offset: 384)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1149, file: !1150, line: 488, baseType: !903, size: 64, offset: 448)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1149, file: !1150, line: 493, baseType: !903, size: 64, offset: 512)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1149, file: !1150, line: 496, baseType: !903, size: 64, offset: 576)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1149, file: !1150, line: 501, baseType: !1321, size: 64, offset: 640)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64)
!1322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !146, line: 2355, size: 576, elements: !1323)
!1323 = !{!1324, !1327, !1328, !1329, !1330, !1332, !1333, !1338, !1339, !1340, !1341, !1342, !1343}
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1322, file: !146, line: 2356, baseType: !1325, size: 64)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64)
!1326 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !146, line: 2356, flags: DIFlagFwdDecl)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1322, file: !146, line: 2357, baseType: !783, size: 64, offset: 64)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1322, file: !146, line: 2358, baseType: !778, size: 32, offset: 128)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1322, file: !146, line: 2359, baseType: !778, size: 32, offset: 160)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1322, file: !146, line: 2360, baseType: !1331, size: 128, offset: 192)
!1331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !778, size: 128, elements: !883)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1322, file: !146, line: 2364, baseType: !778, size: 32, offset: 320)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1322, file: !146, line: 2367, baseType: !1334, size: 128, offset: 384)
!1334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !146, line: 2349, size: 128, elements: !1335)
!1335 = !{!1336, !1337}
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1334, file: !146, line: 2351, baseType: !787, size: 64)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1334, file: !146, line: 2352, baseType: !874, size: 64, offset: 64)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1322, file: !146, line: 2371, baseType: !145, size: 32, offset: 512)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1322, file: !146, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1322, file: !146, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1322, file: !146, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1322, file: !146, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1322, file: !146, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1149, file: !1150, line: 504, baseType: !1345, size: 64, offset: 704)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64)
!1346 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1150, line: 504, flags: DIFlagFwdDecl)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1149, file: !1150, line: 507, baseType: !1267, size: 64, offset: 768)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1149, file: !1150, line: 510, baseType: !778, size: 32, offset: 832)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1149, file: !1150, line: 513, baseType: !778, size: 32, offset: 864)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1149, file: !1150, line: 516, baseType: !1023, size: 32, offset: 896)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1149, file: !1150, line: 519, baseType: !1023, size: 32, offset: 928)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1149, file: !1150, line: 522, baseType: !7, size: 32, offset: 960)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1149, file: !1150, line: 523, baseType: !7, size: 32, offset: 992)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1149, file: !1150, line: 528, baseType: !783, size: 64, offset: 1024)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1149, file: !1150, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1149, file: !1150, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1149, file: !1150, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1149, file: !1150, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1149, file: !1150, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1149, file: !1150, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1149, file: !1150, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1149, file: !1150, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1149, file: !1150, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1149, file: !1150, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1149, file: !1150, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1149, file: !1150, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1149, file: !1150, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1149, file: !1150, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1149, file: !1150, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1149, file: !1150, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1144, file: !151, line: 3254, baseType: !903, size: 64, offset: 1536)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1144, file: !151, line: 3257, baseType: !903, size: 64, offset: 1600)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1144, file: !151, line: 3258, baseType: !903, size: 64, offset: 1664)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1144, file: !151, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1144, file: !151, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1144, file: !151, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1144, file: !151, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1144, file: !151, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1144, file: !151, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1144, file: !151, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1144, file: !151, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1144, file: !151, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1144, file: !151, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1144, file: !151, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1144, file: !151, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1144, file: !151, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1144, file: !151, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1144, file: !151, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1144, file: !151, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1144, file: !151, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1144, file: !151, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !905, file: !151, line: 3394, baseType: !1393, size: 1344)
!1393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !151, line: 2279, size: 1344, elements: !1394)
!1394 = !{!1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1420, !1421, !1422, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438}
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1393, file: !151, line: 2280, baseType: !941, size: 192)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1393, file: !151, line: 2281, baseType: !903, size: 64, offset: 192)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1393, file: !151, line: 2282, baseType: !903, size: 64, offset: 256)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1393, file: !151, line: 2283, baseType: !903, size: 64, offset: 320)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1393, file: !151, line: 2284, baseType: !903, size: 64, offset: 384)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1393, file: !151, line: 2285, baseType: !7, size: 32, offset: 448)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1393, file: !151, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1393, file: !151, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1393, file: !151, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1393, file: !151, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1393, file: !151, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1393, file: !151, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1393, file: !151, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1393, file: !151, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1393, file: !151, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1393, file: !151, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1393, file: !151, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1393, file: !151, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1393, file: !151, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1393, file: !151, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1393, file: !151, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1393, file: !151, line: 2305, baseType: !7, size: 32, offset: 512)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1393, file: !151, line: 2306, baseType: !1418, size: 32, offset: 544)
!1418 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1419, line: 31, baseType: !778)
!1419 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1393, file: !151, line: 2307, baseType: !903, size: 64, offset: 576)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1393, file: !151, line: 2308, baseType: !903, size: 64, offset: 640)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1393, file: !151, line: 2314, baseType: !1423, size: 64, offset: 704)
!1423 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !151, line: 2309, size: 64, elements: !1424)
!1424 = !{!1425, !1426, !1427}
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1423, file: !151, line: 2310, baseType: !778, size: 32)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1423, file: !151, line: 2311, baseType: !783, size: 64)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1423, file: !151, line: 2312, baseType: !1428, size: 64)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64)
!1429 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !151, line: 2277, flags: DIFlagFwdDecl)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1393, file: !151, line: 2315, baseType: !903, size: 64, offset: 768)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1393, file: !151, line: 2316, baseType: !903, size: 64, offset: 832)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1393, file: !151, line: 2317, baseType: !903, size: 64, offset: 896)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1393, file: !151, line: 2318, baseType: !903, size: 64, offset: 960)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1393, file: !151, line: 2319, baseType: !903, size: 64, offset: 1024)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1393, file: !151, line: 2320, baseType: !903, size: 64, offset: 1088)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1393, file: !151, line: 2321, baseType: !903, size: 64, offset: 1152)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1393, file: !151, line: 2322, baseType: !903, size: 64, offset: 1216)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1393, file: !151, line: 2324, baseType: !1439, size: 64, offset: 1280)
!1439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1440, size: 64)
!1440 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !151, line: 2324, flags: DIFlagFwdDecl)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !905, file: !151, line: 3395, baseType: !1442, size: 320)
!1442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !151, line: 1469, size: 320, elements: !1443)
!1443 = !{!1444, !1445, !1446}
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1442, file: !151, line: 1470, baseType: !941, size: 192)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1442, file: !151, line: 1471, baseType: !903, size: 64, offset: 192)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1442, file: !151, line: 1472, baseType: !903, size: 64, offset: 256)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !905, file: !151, line: 3396, baseType: !1448, size: 320)
!1448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !151, line: 1482, size: 320, elements: !1449)
!1449 = !{!1450, !1451, !1452}
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1448, file: !151, line: 1483, baseType: !941, size: 192)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1448, file: !151, line: 1484, baseType: !778, size: 32, offset: 192)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1448, file: !151, line: 1485, baseType: !1453, size: 64, offset: 256)
!1453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 64, elements: !822)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !905, file: !151, line: 3397, baseType: !1455, size: 384)
!1455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !151, line: 1829, size: 384, elements: !1456)
!1456 = !{!1457, !1458, !1459, !1460}
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1455, file: !151, line: 1830, baseType: !941, size: 192)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1455, file: !151, line: 1831, baseType: !1023, size: 32, offset: 192)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1455, file: !151, line: 1832, baseType: !903, size: 64, offset: 256)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1455, file: !151, line: 1835, baseType: !1453, size: 64, offset: 320)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !905, file: !151, line: 3398, baseType: !1462, size: 704)
!1462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !151, line: 1898, size: 704, elements: !1463)
!1463 = !{!1464, !1465, !1466, !1470, !1471, !1474}
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1462, file: !151, line: 1899, baseType: !941, size: 192)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1462, file: !151, line: 1902, baseType: !903, size: 64, offset: 192)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1462, file: !151, line: 1905, baseType: !1467, size: 64, offset: 256)
!1467 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !788, line: 58, baseType: !1468)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64)
!1469 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !788, line: 57, flags: DIFlagFwdDecl)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1462, file: !151, line: 1908, baseType: !7, size: 32, offset: 320)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1462, file: !151, line: 1911, baseType: !1472, size: 64, offset: 384)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1473, size: 64)
!1473 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !151, line: 1876, flags: DIFlagFwdDecl)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1462, file: !151, line: 1914, baseType: !1475, size: 256, offset: 448)
!1475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !151, line: 1883, size: 256, elements: !1476)
!1476 = !{!1477, !1479, !1480, !1485}
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1475, file: !151, line: 1884, baseType: !1478, size: 64)
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1475, size: 64)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1475, file: !151, line: 1885, baseType: !1478, size: 64, offset: 64)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1475, file: !151, line: 1891, baseType: !1481, size: 64, offset: 128)
!1481 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1475, file: !151, line: 1891, size: 64, elements: !1482)
!1482 = !{!1483, !1484}
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1481, file: !151, line: 1891, baseType: !1467, size: 64)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1481, file: !151, line: 1891, baseType: !903, size: 64)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1475, file: !151, line: 1892, baseType: !1486, size: 64, offset: 192)
!1486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !905, file: !151, line: 3399, baseType: !1488, size: 704)
!1488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !151, line: 2008, size: 704, elements: !1489)
!1489 = !{!1490, !1491, !1492, !1493, !1494, !1495, !1507, !1508, !1509, !1510, !1511}
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1488, file: !151, line: 2009, baseType: !941, size: 192)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1488, file: !151, line: 2011, baseType: !7, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !1488, file: !151, line: 2012, baseType: !7, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1488, file: !151, line: 2014, baseType: !1023, size: 32, offset: 224)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1488, file: !151, line: 2016, baseType: !903, size: 64, offset: 256)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !1488, file: !151, line: 2017, baseType: !1496, size: 64, offset: 320)
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64)
!1497 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !151, line: 183, baseType: !1498)
!1498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !151, line: 183, size: 128, elements: !1499)
!1499 = !{!1500}
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1498, file: !151, line: 183, baseType: !1501, size: 128)
!1501 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !151, line: 182, baseType: !1502)
!1502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !151, line: 182, size: 128, elements: !1503)
!1503 = !{!1504, !1505, !1506}
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1502, file: !151, line: 182, baseType: !7, size: 32)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1502, file: !151, line: 182, baseType: !7, size: 32, offset: 32)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1502, file: !151, line: 182, baseType: !1453, size: 64, offset: 64)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !1488, file: !151, line: 2019, baseType: !903, size: 64, offset: 384)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !1488, file: !151, line: 2020, baseType: !903, size: 64, offset: 448)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1488, file: !151, line: 2021, baseType: !903, size: 64, offset: 512)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !1488, file: !151, line: 2022, baseType: !903, size: 64, offset: 576)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !1488, file: !151, line: 2023, baseType: !903, size: 64, offset: 640)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !905, file: !151, line: 3400, baseType: !1513, size: 832)
!1513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !151, line: 2430, size: 832, elements: !1514)
!1514 = !{!1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524}
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1513, file: !151, line: 2431, baseType: !941, size: 192)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1513, file: !151, line: 2433, baseType: !903, size: 64, offset: 192)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !1513, file: !151, line: 2434, baseType: !903, size: 64, offset: 256)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !1513, file: !151, line: 2435, baseType: !903, size: 64, offset: 320)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !1513, file: !151, line: 2436, baseType: !903, size: 64, offset: 384)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "base_accesses", scope: !1513, file: !151, line: 2437, baseType: !1496, size: 64, offset: 448)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "inheritance", scope: !1513, file: !151, line: 2438, baseType: !903, size: 64, offset: 512)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_subvtt", scope: !1513, file: !151, line: 2440, baseType: !903, size: 64, offset: 576)
