; ModuleID = 'et-forest.bc'
source_filename = "et-forest.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.alloc_pool_def = type { i8*, i64, %struct.alloc_pool_list_def*, i8*, i64, i64, i64, i64, %struct.alloc_pool_list_def*, i64, i64 }
%struct.alloc_pool_list_def = type { %struct.alloc_pool_list_def* }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.stat64 = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.et_node = type { i8*, i32, i32, %struct.et_node*, %struct.et_node*, %struct.et_node*, %struct.et_node*, %struct.et_occ*, %struct.et_occ* }
%struct.et_occ = type { %struct.et_node*, %struct.et_occ*, %struct.et_occ*, %struct.et_occ*, i32, i32, %struct.et_occ* }

@stdout = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "et_nodes", scope: !2, file: !3, line: 58, type: !41, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !38, nameTableKind: None)
!3 = !DIFile(filename: "et-forest.c", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!4 = !{}
!5 = !{!6, !7, !8, !9, !12, !13, !15, !27}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!8 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !17, line: 59, size: 512, elements: !18)
!17 = !DIFile(filename: "./et-forest.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!18 = !{!19, !20, !21, !22, !23, !24, !25, !26, !37}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !16, file: !17, line: 61, baseType: !12, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "dfs_num_in", scope: !16, file: !17, line: 63, baseType: !8, size: 32, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "dfs_num_out", scope: !16, file: !17, line: 63, baseType: !8, size: 32, offset: 96)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "father", scope: !16, file: !17, line: 65, baseType: !15, size: 64, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "son", scope: !16, file: !17, line: 66, baseType: !15, size: 64, offset: 192)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !16, file: !17, line: 67, baseType: !15, size: 64, offset: 256)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !16, file: !17, line: 68, baseType: !15, size: 64, offset: 320)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "rightmost_occ", scope: !16, file: !17, line: 70, baseType: !27, size: 64, offset: 384)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "et_occ", file: !3, line: 41, size: 384, elements: !29)
!29 = !{!30, !31, !32, !33, !34, !35, !36}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "of", scope: !28, file: !3, line: 43, baseType: !15, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !28, file: !3, line: 45, baseType: !27, size: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !28, file: !3, line: 46, baseType: !27, size: 64, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !28, file: !3, line: 47, baseType: !27, size: 64, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !28, file: !3, line: 49, baseType: !8, size: 32, offset: 256)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !28, file: !3, line: 51, baseType: !8, size: 32, offset: 288)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "min_occ", scope: !28, file: !3, line: 54, baseType: !27, size: 64, offset: 320)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "parent_occ", scope: !16, file: !17, line: 71, baseType: !27, size: 64, offset: 448)
!38 = !{!0, !39}
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "et_occurrences", scope: !2, file: !3, line: 59, type: !41, isLocal: true, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_pool", file: !42, line: 58, baseType: !43)
!42 = !DIFile(filename: "./alloc-pool.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "alloc_pool_def", file: !42, line: 32, size: 704, elements: !45)
!45 = !{!46, !47, !51, !57, !58, !59, !60, !61, !62, !63, !64}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !44, file: !42, line: 34, baseType: !13, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "elts_per_block", scope: !44, file: !42, line: 38, baseType: !48, size: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !49, line: 46, baseType: !50)
!49 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!50 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "returned_free_list", scope: !44, file: !42, line: 41, baseType: !52, size: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_pool_list", file: !42, line: 30, baseType: !53)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "alloc_pool_list_def", file: !42, line: 26, size: 64, elements: !55)
!55 = !{!56}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !54, file: !42, line: 28, baseType: !53, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "virgin_free_list", scope: !44, file: !42, line: 45, baseType: !10, size: 64, offset: 192)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "virgin_elts_remaining", scope: !44, file: !42, line: 49, baseType: !48, size: 64, offset: 256)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "elts_allocated", scope: !44, file: !42, line: 51, baseType: !48, size: 64, offset: 320)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "elts_free", scope: !44, file: !42, line: 52, baseType: !48, size: 64, offset: 384)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_allocated", scope: !44, file: !42, line: 53, baseType: !48, size: 64, offset: 448)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "block_list", scope: !44, file: !42, line: 54, baseType: !52, size: 64, offset: 512)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !44, file: !42, line: 55, baseType: !48, size: 64, offset: 576)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "elt_size", scope: !44, file: !42, line: 56, baseType: !48, size: 64, offset: 640)
!65 = !{i32 2, !"Dwarf Version", i32 4}
!66 = !{i32 2, !"Debug Info Version", i32 3}
!67 = !{i32 1, !"wchar_size", i32 4}
!68 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!69 = distinct !DISubprogram(name: "vprintf", scope: !70, file: !70, line: 39, type: !71, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !82)
!70 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!71 = !DISubroutineType(types: !72)
!72 = !{!8, !73, !74}
!73 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !13)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, size: 192, elements: !76)
!76 = !{!77, !79, !80, !81}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !75, file: !3, baseType: !78, size: 32)
!78 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !75, file: !3, baseType: !78, size: 32, offset: 32)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !75, file: !3, baseType: !12, size: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !75, file: !3, baseType: !12, size: 64, offset: 128)
!82 = !{!83, !84}
!83 = !DILocalVariable(name: "__fmt", arg: 1, scope: !69, file: !70, line: 39, type: !73)
!84 = !DILocalVariable(name: "__arg", arg: 2, scope: !69, file: !70, line: 39, type: !74)
!85 = !DILocation(line: 0, scope: !69)
!86 = !DILocation(line: 41, column: 20, scope: !69)
!87 = !DILocation(line: 41, column: 10, scope: !69)
!88 = !DILocation(line: 41, column: 3, scope: !69)
!89 = distinct !DISubprogram(name: "getchar", scope: !70, file: !70, line: 47, type: !90, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!90 = !DISubroutineType(types: !91)
!91 = !{!8}
!92 = !DILocation(line: 49, column: 16, scope: !89)
!93 = !DILocation(line: 49, column: 10, scope: !89)
!94 = !DILocation(line: 49, column: 3, scope: !89)
!95 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !70, file: !70, line: 56, type: !96, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !154)
!96 = !DISubroutineType(types: !97)
!97 = !{!8, !98}
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !100, line: 7, baseType: !101)
!100 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !102, line: 49, size: 1728, elements: !103)
!102 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!103 = !{!104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !119, !121, !122, !123, !127, !129, !131, !135, !138, !140, !143, !146, !147, !148, !149, !150}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !101, file: !102, line: 51, baseType: !8, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !101, file: !102, line: 54, baseType: !10, size: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !101, file: !102, line: 55, baseType: !10, size: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !101, file: !102, line: 56, baseType: !10, size: 64, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !101, file: !102, line: 57, baseType: !10, size: 64, offset: 256)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !101, file: !102, line: 58, baseType: !10, size: 64, offset: 320)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !101, file: !102, line: 59, baseType: !10, size: 64, offset: 384)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !101, file: !102, line: 60, baseType: !10, size: 64, offset: 448)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !101, file: !102, line: 61, baseType: !10, size: 64, offset: 512)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !101, file: !102, line: 64, baseType: !10, size: 64, offset: 576)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !101, file: !102, line: 65, baseType: !10, size: 64, offset: 640)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !101, file: !102, line: 66, baseType: !10, size: 64, offset: 704)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !101, file: !102, line: 68, baseType: !117, size: 64, offset: 768)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !102, line: 36, flags: DIFlagFwdDecl)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !101, file: !102, line: 70, baseType: !120, size: 64, offset: 832)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !101, file: !102, line: 72, baseType: !8, size: 32, offset: 896)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !101, file: !102, line: 73, baseType: !8, size: 32, offset: 928)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !101, file: !102, line: 74, baseType: !124, size: 64, offset: 960)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !125, line: 152, baseType: !126)
!125 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!126 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !101, file: !102, line: 77, baseType: !128, size: 16, offset: 1024)
!128 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !101, file: !102, line: 78, baseType: !130, size: 8, offset: 1040)
!130 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !101, file: !102, line: 79, baseType: !132, size: 8, offset: 1048)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 8, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 1)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !101, file: !102, line: 81, baseType: !136, size: 64, offset: 1088)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !102, line: 43, baseType: null)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !101, file: !102, line: 89, baseType: !139, size: 64, offset: 1152)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !125, line: 153, baseType: !126)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !101, file: !102, line: 91, baseType: !141, size: 64, offset: 1216)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !102, line: 37, flags: DIFlagFwdDecl)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !101, file: !102, line: 92, baseType: !144, size: 64, offset: 1280)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !102, line: 38, flags: DIFlagFwdDecl)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !101, file: !102, line: 93, baseType: !120, size: 64, offset: 1344)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !101, file: !102, line: 94, baseType: !12, size: 64, offset: 1408)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !101, file: !102, line: 95, baseType: !48, size: 64, offset: 1472)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !101, file: !102, line: 96, baseType: !8, size: 32, offset: 1536)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !101, file: !102, line: 98, baseType: !151, size: 160, offset: 1568)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 160, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 20)
!154 = !{!155}
!155 = !DILocalVariable(name: "__fp", arg: 1, scope: !95, file: !70, line: 56, type: !98)
!156 = !DILocation(line: 0, scope: !95)
!157 = !DILocation(line: 58, column: 10, scope: !95)
!158 = !DILocation(line: 58, column: 3, scope: !95)
!159 = distinct !DISubprogram(name: "getc_unlocked", scope: !70, file: !70, line: 66, type: !96, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !160)
!160 = !{!161}
!161 = !DILocalVariable(name: "__fp", arg: 1, scope: !159, file: !70, line: 66, type: !98)
!162 = !DILocation(line: 0, scope: !159)
!163 = !DILocation(line: 68, column: 10, scope: !159)
!164 = !DILocation(line: 68, column: 3, scope: !159)
!165 = distinct !DISubprogram(name: "getchar_unlocked", scope: !70, file: !70, line: 73, type: !90, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!166 = !DILocation(line: 75, column: 10, scope: !165)
!167 = !DILocation(line: 75, column: 3, scope: !165)
!168 = distinct !DISubprogram(name: "putchar", scope: !70, file: !70, line: 82, type: !169, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !171)
!169 = !DISubroutineType(types: !170)
!170 = !{!8, !8}
!171 = !{!172}
!172 = !DILocalVariable(name: "__c", arg: 1, scope: !168, file: !70, line: 82, type: !8)
!173 = !DILocation(line: 0, scope: !168)
!174 = !DILocation(line: 84, column: 21, scope: !168)
!175 = !DILocation(line: 84, column: 10, scope: !168)
!176 = !DILocation(line: 84, column: 3, scope: !168)
!177 = distinct !DISubprogram(name: "fputc_unlocked", scope: !70, file: !70, line: 91, type: !178, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !180)
!178 = !DISubroutineType(types: !179)
!179 = !{!8, !8, !98}
!180 = !{!181, !182}
!181 = !DILocalVariable(name: "__c", arg: 1, scope: !177, file: !70, line: 91, type: !8)
!182 = !DILocalVariable(name: "__stream", arg: 2, scope: !177, file: !70, line: 91, type: !98)
!183 = !DILocation(line: 0, scope: !177)
!184 = !DILocation(line: 93, column: 10, scope: !177)
!185 = !DILocation(line: 93, column: 3, scope: !177)
!186 = distinct !DISubprogram(name: "putc_unlocked", scope: !70, file: !70, line: 101, type: !178, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !187)
!187 = !{!188, !189}
!188 = !DILocalVariable(name: "__c", arg: 1, scope: !186, file: !70, line: 101, type: !8)
!189 = !DILocalVariable(name: "__stream", arg: 2, scope: !186, file: !70, line: 101, type: !98)
!190 = !DILocation(line: 0, scope: !186)
!191 = !DILocation(line: 103, column: 10, scope: !186)
!192 = !DILocation(line: 103, column: 3, scope: !186)
!193 = distinct !DISubprogram(name: "putchar_unlocked", scope: !70, file: !70, line: 108, type: !169, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !194)
!194 = !{!195}
!195 = !DILocalVariable(name: "__c", arg: 1, scope: !193, file: !70, line: 108, type: !8)
!196 = !DILocation(line: 0, scope: !193)
!197 = !DILocation(line: 110, column: 10, scope: !193)
!198 = !DILocation(line: 110, column: 3, scope: !193)
!199 = distinct !DISubprogram(name: "getline", scope: !70, file: !70, line: 118, type: !200, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !204)
!200 = !DISubroutineType(types: !201)
!201 = !{!202, !9, !203, !98}
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !125, line: 193, baseType: !126)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!204 = !{!205, !206, !207}
!205 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !199, file: !70, line: 118, type: !9)
!206 = !DILocalVariable(name: "__n", arg: 2, scope: !199, file: !70, line: 118, type: !203)
!207 = !DILocalVariable(name: "__stream", arg: 3, scope: !199, file: !70, line: 118, type: !98)
!208 = !DILocation(line: 0, scope: !199)
!209 = !DILocation(line: 120, column: 10, scope: !199)
!210 = !DILocation(line: 120, column: 3, scope: !199)
!211 = distinct !DISubprogram(name: "feof_unlocked", scope: !70, file: !70, line: 128, type: !96, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !212)
!212 = !{!213}
!213 = !DILocalVariable(name: "__stream", arg: 1, scope: !211, file: !70, line: 128, type: !98)
!214 = !DILocation(line: 0, scope: !211)
!215 = !DILocation(line: 130, column: 10, scope: !211)
!216 = !DILocation(line: 130, column: 3, scope: !211)
!217 = distinct !DISubprogram(name: "ferror_unlocked", scope: !70, file: !70, line: 135, type: !96, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !218)
!218 = !{!219}
!219 = !DILocalVariable(name: "__stream", arg: 1, scope: !217, file: !70, line: 135, type: !98)
!220 = !DILocation(line: 0, scope: !217)
!221 = !DILocation(line: 137, column: 10, scope: !217)
!222 = !DILocation(line: 137, column: 3, scope: !217)
!223 = distinct !DISubprogram(name: "tolower", scope: !224, file: !224, line: 207, type: !169, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !225)
!224 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!225 = !{!226}
!226 = !DILocalVariable(name: "__c", arg: 1, scope: !223, file: !224, line: 207, type: !8)
!227 = !DILocation(line: 0, scope: !223)
!228 = !DILocation(line: 209, column: 22, scope: !223)
!229 = !DILocation(line: 209, column: 39, scope: !223)
!230 = !DILocation(line: 209, column: 38, scope: !223)
!231 = !DILocation(line: 209, column: 37, scope: !223)
!232 = !DILocation(line: 209, column: 10, scope: !223)
!233 = !DILocation(line: 209, column: 3, scope: !223)
!234 = distinct !DISubprogram(name: "toupper", scope: !224, file: !224, line: 213, type: !169, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !235)
!235 = !{!236}
!236 = !DILocalVariable(name: "__c", arg: 1, scope: !234, file: !224, line: 213, type: !8)
!237 = !DILocation(line: 0, scope: !234)
!238 = !DILocation(line: 215, column: 22, scope: !234)
!239 = !DILocation(line: 215, column: 39, scope: !234)
!240 = !DILocation(line: 215, column: 38, scope: !234)
!241 = !DILocation(line: 215, column: 37, scope: !234)
!242 = !DILocation(line: 215, column: 10, scope: !234)
!243 = !DILocation(line: 215, column: 3, scope: !234)
!244 = distinct !DISubprogram(name: "atoi", scope: !245, file: !245, line: 361, type: !246, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !248)
!245 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!246 = !DISubroutineType(types: !247)
!247 = !{!8, !13}
!248 = !{!249}
!249 = !DILocalVariable(name: "__nptr", arg: 1, scope: !244, file: !245, line: 361, type: !13)
!250 = !DILocation(line: 0, scope: !244)
!251 = !DILocation(line: 363, column: 16, scope: !244)
!252 = !DILocation(line: 363, column: 10, scope: !244)
!253 = !DILocation(line: 363, column: 3, scope: !244)
!254 = distinct !DISubprogram(name: "atol", scope: !245, file: !245, line: 366, type: !255, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !257)
!255 = !DISubroutineType(types: !256)
!256 = !{!126, !13}
!257 = !{!258}
!258 = !DILocalVariable(name: "__nptr", arg: 1, scope: !254, file: !245, line: 366, type: !13)
!259 = !DILocation(line: 0, scope: !254)
!260 = !DILocation(line: 368, column: 10, scope: !254)
!261 = !DILocation(line: 368, column: 3, scope: !254)
!262 = distinct !DISubprogram(name: "atoll", scope: !245, file: !245, line: 373, type: !263, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !266)
!263 = !DISubroutineType(types: !264)
!264 = !{!265, !13}
!265 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!266 = !{!267}
!267 = !DILocalVariable(name: "__nptr", arg: 1, scope: !262, file: !245, line: 373, type: !13)
!268 = !DILocation(line: 0, scope: !262)
!269 = !DILocation(line: 375, column: 10, scope: !262)
!270 = !DILocation(line: 375, column: 3, scope: !262)
!271 = distinct !DISubprogram(name: "bsearch", scope: !272, file: !272, line: 20, type: !273, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !281)
!272 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!273 = !DISubroutineType(types: !274)
!274 = !{!12, !275, !275, !48, !48, !277}
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !245, line: 808, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!8, !275, !275}
!281 = !{!282, !283, !284, !285, !286, !287, !288, !289, !290, !291}
!282 = !DILocalVariable(name: "__key", arg: 1, scope: !271, file: !272, line: 20, type: !275)
!283 = !DILocalVariable(name: "__base", arg: 2, scope: !271, file: !272, line: 20, type: !275)
!284 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !271, file: !272, line: 20, type: !48)
!285 = !DILocalVariable(name: "__size", arg: 4, scope: !271, file: !272, line: 20, type: !48)
!286 = !DILocalVariable(name: "__compar", arg: 5, scope: !271, file: !272, line: 21, type: !277)
!287 = !DILocalVariable(name: "__l", scope: !271, file: !272, line: 23, type: !48)
!288 = !DILocalVariable(name: "__u", scope: !271, file: !272, line: 23, type: !48)
!289 = !DILocalVariable(name: "__idx", scope: !271, file: !272, line: 23, type: !48)
!290 = !DILocalVariable(name: "__p", scope: !271, file: !272, line: 24, type: !275)
!291 = !DILocalVariable(name: "__comparison", scope: !271, file: !272, line: 25, type: !8)
!292 = !DILocation(line: 0, scope: !271)
!293 = !DILocation(line: 29, column: 3, scope: !271)
!294 = !DILocation(line: 27, column: 7, scope: !271)
!295 = !DILocation(line: 29, column: 14, scope: !271)
!296 = !DILocation(line: 31, column: 20, scope: !297)
!297 = distinct !DILexicalBlock(scope: !271, file: !272, line: 30, column: 5)
!298 = !DILocation(line: 31, column: 27, scope: !297)
!299 = !DILocation(line: 32, column: 56, scope: !297)
!300 = !DILocation(line: 32, column: 47, scope: !297)
!301 = !DILocation(line: 33, column: 22, scope: !297)
!302 = !DILocation(line: 34, column: 24, scope: !303)
!303 = distinct !DILexicalBlock(scope: !297, file: !272, line: 34, column: 11)
!304 = !DILocation(line: 34, column: 11, scope: !297)
!305 = !DILocation(line: 36, column: 29, scope: !306)
!306 = distinct !DILexicalBlock(scope: !303, file: !272, line: 36, column: 16)
!307 = !DILocation(line: 36, column: 16, scope: !303)
!308 = !DILocation(line: 37, column: 14, scope: !306)
!309 = distinct !{!309, !293, !310}
!310 = !DILocation(line: 40, column: 5, scope: !271)
!311 = !DILocation(line: 43, column: 1, scope: !271)
!312 = distinct !DISubprogram(name: "atof", scope: !313, file: !313, line: 25, type: !314, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !317)
!313 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!314 = !DISubroutineType(types: !315)
!315 = !{!316, !13}
!316 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!317 = !{!318}
!318 = !DILocalVariable(name: "__nptr", arg: 1, scope: !312, file: !313, line: 25, type: !13)
!319 = !DILocation(line: 0, scope: !312)
!320 = !DILocation(line: 27, column: 10, scope: !312)
!321 = !DILocation(line: 27, column: 3, scope: !312)
!322 = distinct !DISubprogram(name: "strtoimax", scope: !323, file: !323, line: 324, type: !324, scopeLine: 326, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !330)
!323 = !DIFile(filename: "/usr/include/inttypes.h", directory: "")
!324 = !DISubroutineType(types: !325)
!325 = !{!326, !73, !329, !8}
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !327, line: 101, baseType: !328)
!327 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !125, line: 72, baseType: !126)
!329 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !9)
!330 = !{!331, !332, !333}
!331 = !DILocalVariable(name: "nptr", arg: 1, scope: !322, file: !323, line: 324, type: !73)
!332 = !DILocalVariable(name: "endptr", arg: 2, scope: !322, file: !323, line: 324, type: !329)
!333 = !DILocalVariable(name: "base", arg: 3, scope: !322, file: !323, line: 324, type: !8)
!334 = !DILocation(line: 0, scope: !322)
!335 = !DILocation(line: 327, column: 10, scope: !322)
!336 = !DILocation(line: 327, column: 3, scope: !322)
!337 = distinct !DISubprogram(name: "strtoumax", scope: !323, file: !323, line: 336, type: !338, scopeLine: 338, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !342)
!338 = !DISubroutineType(types: !339)
!339 = !{!340, !73, !329, !8}
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !327, line: 102, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !125, line: 73, baseType: !50)
!342 = !{!343, !344, !345}
!343 = !DILocalVariable(name: "nptr", arg: 1, scope: !337, file: !323, line: 336, type: !73)
!344 = !DILocalVariable(name: "endptr", arg: 2, scope: !337, file: !323, line: 336, type: !329)
!345 = !DILocalVariable(name: "base", arg: 3, scope: !337, file: !323, line: 336, type: !8)
!346 = !DILocation(line: 0, scope: !337)
!347 = !DILocation(line: 339, column: 10, scope: !337)
!348 = !DILocation(line: 339, column: 3, scope: !337)
!349 = distinct !DISubprogram(name: "wcstoimax", scope: !323, file: !323, line: 348, type: !350, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !359)
!350 = !DISubroutineType(types: !351)
!351 = !{!326, !352, !356, !8}
!352 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !355)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gwchar_t", file: !323, line: 34, baseType: !8)
!356 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !357)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!359 = !{!360, !361, !362}
!360 = !DILocalVariable(name: "nptr", arg: 1, scope: !349, file: !323, line: 348, type: !352)
!361 = !DILocalVariable(name: "endptr", arg: 2, scope: !349, file: !323, line: 348, type: !356)
!362 = !DILocalVariable(name: "base", arg: 3, scope: !349, file: !323, line: 348, type: !8)
!363 = !DILocation(line: 0, scope: !349)
!364 = !DILocation(line: 351, column: 10, scope: !349)
!365 = !DILocation(line: 351, column: 3, scope: !349)
!366 = distinct !DISubprogram(name: "wcstoumax", scope: !323, file: !323, line: 362, type: !367, scopeLine: 364, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !369)
!367 = !DISubroutineType(types: !368)
!368 = !{!340, !352, !356, !8}
!369 = !{!370, !371, !372}
!370 = !DILocalVariable(name: "nptr", arg: 1, scope: !366, file: !323, line: 362, type: !352)
!371 = !DILocalVariable(name: "endptr", arg: 2, scope: !366, file: !323, line: 362, type: !356)
!372 = !DILocalVariable(name: "base", arg: 3, scope: !366, file: !323, line: 362, type: !8)
!373 = !DILocation(line: 0, scope: !366)
!374 = !DILocation(line: 365, column: 10, scope: !366)
!375 = !DILocation(line: 365, column: 3, scope: !366)
!376 = distinct !DISubprogram(name: "stat", scope: !377, file: !377, line: 453, type: !378, scopeLine: 454, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !417)
!377 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "")
!378 = !DISubroutineType(types: !379)
!379 = !{!8, !13, !380}
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !382, line: 46, size: 1152, elements: !383)
!382 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!383 = !{!384, !386, !388, !390, !392, !394, !396, !397, !398, !399, !401, !403, !411, !412, !413}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !381, file: !382, line: 48, baseType: !385, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !125, line: 145, baseType: !50)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !381, file: !382, line: 53, baseType: !387, size: 64, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !125, line: 148, baseType: !50)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !381, file: !382, line: 61, baseType: !389, size: 64, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !125, line: 151, baseType: !50)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !381, file: !382, line: 62, baseType: !391, size: 32, offset: 192)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !125, line: 150, baseType: !78)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !381, file: !382, line: 64, baseType: !393, size: 32, offset: 224)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !125, line: 146, baseType: !78)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !381, file: !382, line: 65, baseType: !395, size: 32, offset: 256)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !125, line: 147, baseType: !78)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !381, file: !382, line: 67, baseType: !8, size: 32, offset: 288)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !381, file: !382, line: 69, baseType: !385, size: 64, offset: 320)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !381, file: !382, line: 74, baseType: !124, size: 64, offset: 384)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !381, file: !382, line: 78, baseType: !400, size: 64, offset: 448)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !125, line: 174, baseType: !126)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !381, file: !382, line: 80, baseType: !402, size: 64, offset: 512)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !125, line: 179, baseType: !126)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !381, file: !382, line: 91, baseType: !404, size: 128, offset: 576)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !405, line: 10, size: 128, elements: !406)
!405 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!406 = !{!407, !409}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !404, file: !405, line: 12, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !125, line: 160, baseType: !126)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !404, file: !405, line: 16, baseType: !410, size: 64, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !125, line: 196, baseType: !126)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !381, file: !382, line: 92, baseType: !404, size: 128, offset: 704)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !381, file: !382, line: 93, baseType: !404, size: 128, offset: 832)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !381, file: !382, line: 106, baseType: !414, size: 192, offset: 960)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 192, elements: !415)
!415 = !{!416}
!416 = !DISubrange(count: 3)
!417 = !{!418, !419}
!418 = !DILocalVariable(name: "__path", arg: 1, scope: !376, file: !377, line: 453, type: !13)
!419 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !376, file: !377, line: 453, type: !380)
!420 = !DILocation(line: 0, scope: !376)
!421 = !DILocation(line: 455, column: 10, scope: !376)
!422 = !DILocation(line: 455, column: 3, scope: !376)
!423 = distinct !DISubprogram(name: "lstat", scope: !377, file: !377, line: 460, type: !378, scopeLine: 461, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !424)
!424 = !{!425, !426}
!425 = !DILocalVariable(name: "__path", arg: 1, scope: !423, file: !377, line: 460, type: !13)
!426 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !423, file: !377, line: 460, type: !380)
!427 = !DILocation(line: 0, scope: !423)
!428 = !DILocation(line: 462, column: 10, scope: !423)
!429 = !DILocation(line: 462, column: 3, scope: !423)
!430 = distinct !DISubprogram(name: "fstat", scope: !377, file: !377, line: 467, type: !431, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !433)
!431 = !DISubroutineType(types: !432)
!432 = !{!8, !8, !380}
!433 = !{!434, !435}
!434 = !DILocalVariable(name: "__fd", arg: 1, scope: !430, file: !377, line: 467, type: !8)
!435 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !430, file: !377, line: 467, type: !380)
!436 = !DILocation(line: 0, scope: !430)
!437 = !DILocation(line: 469, column: 10, scope: !430)
!438 = !DILocation(line: 469, column: 3, scope: !430)
!439 = distinct !DISubprogram(name: "fstatat", scope: !377, file: !377, line: 474, type: !440, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !442)
!440 = !DISubroutineType(types: !441)
!441 = !{!8, !8, !13, !380, !8}
!442 = !{!443, !444, !445, !446}
!443 = !DILocalVariable(name: "__fd", arg: 1, scope: !439, file: !377, line: 474, type: !8)
!444 = !DILocalVariable(name: "__filename", arg: 2, scope: !439, file: !377, line: 474, type: !13)
!445 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !439, file: !377, line: 474, type: !380)
!446 = !DILocalVariable(name: "__flag", arg: 4, scope: !439, file: !377, line: 474, type: !8)
!447 = !DILocation(line: 0, scope: !439)
!448 = !DILocation(line: 477, column: 10, scope: !439)
!449 = !DILocation(line: 477, column: 3, scope: !439)
!450 = distinct !DISubprogram(name: "mknod", scope: !377, file: !377, line: 483, type: !451, scopeLine: 484, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !453)
!451 = !DISubroutineType(types: !452)
!452 = !{!8, !13, !391, !385}
!453 = !{!454, !455, !456}
!454 = !DILocalVariable(name: "__path", arg: 1, scope: !450, file: !377, line: 483, type: !13)
!455 = !DILocalVariable(name: "__mode", arg: 2, scope: !450, file: !377, line: 483, type: !391)
!456 = !DILocalVariable(name: "__dev", arg: 3, scope: !450, file: !377, line: 483, type: !385)
!457 = !DILocation(line: 0, scope: !450)
!458 = !DILocation(line: 485, column: 10, scope: !450)
!459 = !DILocation(line: 485, column: 3, scope: !450)
!460 = distinct !DISubprogram(name: "mknodat", scope: !377, file: !377, line: 491, type: !461, scopeLine: 493, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !463)
!461 = !DISubroutineType(types: !462)
!462 = !{!8, !8, !13, !391, !385}
!463 = !{!464, !465, !466, !467}
!464 = !DILocalVariable(name: "__fd", arg: 1, scope: !460, file: !377, line: 491, type: !8)
!465 = !DILocalVariable(name: "__path", arg: 2, scope: !460, file: !377, line: 491, type: !13)
!466 = !DILocalVariable(name: "__mode", arg: 3, scope: !460, file: !377, line: 491, type: !391)
!467 = !DILocalVariable(name: "__dev", arg: 4, scope: !460, file: !377, line: 491, type: !385)
!468 = !DILocation(line: 0, scope: !460)
!469 = !DILocation(line: 494, column: 10, scope: !460)
!470 = !DILocation(line: 494, column: 3, scope: !460)
!471 = distinct !DISubprogram(name: "stat64", scope: !377, file: !377, line: 502, type: !472, scopeLine: 503, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !494)
!472 = !DISubroutineType(types: !473)
!473 = !{!8, !13, !474}
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !382, line: 119, size: 1152, elements: !476)
!476 = !{!477, !478, !480, !481, !482, !483, !484, !485, !486, !487, !488, !490, !491, !492, !493}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !475, file: !382, line: 121, baseType: !385, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !475, file: !382, line: 123, baseType: !479, size: 64, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !125, line: 149, baseType: !50)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !475, file: !382, line: 124, baseType: !389, size: 64, offset: 128)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !475, file: !382, line: 125, baseType: !391, size: 32, offset: 192)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !475, file: !382, line: 132, baseType: !393, size: 32, offset: 224)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !475, file: !382, line: 133, baseType: !395, size: 32, offset: 256)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !475, file: !382, line: 135, baseType: !8, size: 32, offset: 288)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !475, file: !382, line: 136, baseType: !385, size: 64, offset: 320)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !475, file: !382, line: 137, baseType: !124, size: 64, offset: 384)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !475, file: !382, line: 143, baseType: !400, size: 64, offset: 448)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !475, file: !382, line: 144, baseType: !489, size: 64, offset: 512)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !125, line: 180, baseType: !126)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !475, file: !382, line: 152, baseType: !404, size: 128, offset: 576)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !475, file: !382, line: 153, baseType: !404, size: 128, offset: 704)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !475, file: !382, line: 154, baseType: !404, size: 128, offset: 832)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !475, file: !382, line: 164, baseType: !414, size: 192, offset: 960)
!494 = !{!495, !496}
!495 = !DILocalVariable(name: "__path", arg: 1, scope: !471, file: !377, line: 502, type: !13)
!496 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !471, file: !377, line: 502, type: !474)
!497 = !DILocation(line: 0, scope: !471)
!498 = !DILocation(line: 504, column: 10, scope: !471)
!499 = !DILocation(line: 504, column: 3, scope: !471)
!500 = distinct !DISubprogram(name: "lstat64", scope: !377, file: !377, line: 509, type: !472, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !501)
!501 = !{!502, !503}
!502 = !DILocalVariable(name: "__path", arg: 1, scope: !500, file: !377, line: 509, type: !13)
!503 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !500, file: !377, line: 509, type: !474)
!504 = !DILocation(line: 0, scope: !500)
!505 = !DILocation(line: 511, column: 10, scope: !500)
!506 = !DILocation(line: 511, column: 3, scope: !500)
!507 = distinct !DISubprogram(name: "fstat64", scope: !377, file: !377, line: 516, type: !508, scopeLine: 517, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !510)
!508 = !DISubroutineType(types: !509)
!509 = !{!8, !8, !474}
!510 = !{!511, !512}
!511 = !DILocalVariable(name: "__fd", arg: 1, scope: !507, file: !377, line: 516, type: !8)
!512 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !507, file: !377, line: 516, type: !474)
!513 = !DILocation(line: 0, scope: !507)
!514 = !DILocation(line: 518, column: 10, scope: !507)
!515 = !DILocation(line: 518, column: 3, scope: !507)
!516 = distinct !DISubprogram(name: "fstatat64", scope: !377, file: !377, line: 523, type: !517, scopeLine: 525, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !519)
!517 = !DISubroutineType(types: !518)
!518 = !{!8, !8, !13, !474, !8}
!519 = !{!520, !521, !522, !523}
!520 = !DILocalVariable(name: "__fd", arg: 1, scope: !516, file: !377, line: 523, type: !8)
!521 = !DILocalVariable(name: "__filename", arg: 2, scope: !516, file: !377, line: 523, type: !13)
!522 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !516, file: !377, line: 523, type: !474)
!523 = !DILocalVariable(name: "__flag", arg: 4, scope: !516, file: !377, line: 523, type: !8)
!524 = !DILocation(line: 0, scope: !516)
!525 = !DILocation(line: 526, column: 10, scope: !516)
!526 = !DILocation(line: 526, column: 3, scope: !516)
!527 = distinct !DISubprogram(name: "et_new_tree", scope: !3, file: !3, line: 467, type: !528, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !530)
!528 = !DISubroutineType(types: !529)
!529 = !{!15, !12}
!530 = !{!531, !532}
!531 = !DILocalVariable(name: "data", arg: 1, scope: !527, file: !3, line: 467, type: !12)
!532 = !DILocalVariable(name: "nw", scope: !527, file: !3, line: 469, type: !15)
!533 = !DILocation(line: 0, scope: !527)
!534 = !DILocation(line: 471, column: 8, scope: !535)
!535 = distinct !DILexicalBlock(scope: !527, file: !3, line: 471, column: 7)
!536 = !DILocation(line: 471, column: 7, scope: !527)
!537 = !DILocation(line: 472, column: 16, scope: !535)
!538 = !DILocation(line: 472, column: 14, scope: !535)
!539 = !DILocation(line: 472, column: 5, scope: !535)
!540 = !DILocation(line: 473, column: 39, scope: !527)
!541 = !DILocation(line: 473, column: 27, scope: !527)
!542 = !DILocation(line: 473, column: 8, scope: !527)
!543 = !DILocation(line: 475, column: 7, scope: !527)
!544 = !DILocation(line: 475, column: 12, scope: !527)
!545 = !DILocation(line: 476, column: 7, scope: !527)
!546 = !DILocation(line: 476, column: 14, scope: !527)
!547 = !DILocation(line: 477, column: 7, scope: !527)
!548 = !DILocation(line: 477, column: 12, scope: !527)
!549 = !DILocation(line: 478, column: 7, scope: !527)
