; ModuleID = 'except.bc'
source_filename = "except.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.htab = type { i32 (i8*)*, i32 (i8*, i8*)*, void (i8*)*, i8**, i64, i64, i64, i32, i32, i8* (i64, i64)*, void (i8*)*, i8*, i8* (i8*, i64, i64)*, void (i8*, i8*)*, i32 }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type { %struct.eh_region_d*, %struct.VEC_eh_region_gc*, %struct.VEC_eh_landing_pad_gc*, %struct.htab*, %struct.VEC_tree_gc*, %union.eh_status_u }
%struct.eh_region_d = type { %struct.eh_region_d*, %struct.eh_region_d*, %struct.eh_region_d*, i32, i32, %union.eh_region_u, %struct.eh_landing_pad_d*, %struct.rtx_def*, %struct.rtx_def*, i8 }
%union.eh_region_u = type { %struct.eh_region_u_allowed }

!700 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!701 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!702 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!703 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!704 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!705 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!706 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!707 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!708 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!709 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!710 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!711 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!712 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!713 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!714 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eh_personality_kind", file: !10, line: 352, baseType: !11, size: 32, elements: !715)
!715 = !{!716, !717, !718}
!716 = !DIEnumerator(name: "eh_personality_none", value: 0, isUnsigned: true)
!717 = !DIEnumerator(name: "eh_personality_any", value: 1, isUnsigned: true)
!718 = !DIEnumerator(name: "eh_personality_lang", value: 2, isUnsigned: true)
!719 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !720, line: 309, baseType: !11, size: 32, elements: !721)
!720 = !DIFile(filename: "./cgraph.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!721 = !{!722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741}
!722 = !DIEnumerator(name: "CIF_OK", value: 0, isUnsigned: true)
!723 = !DIEnumerator(name: "CIF_UNSPECIFIED", value: 1, isUnsigned: true)
!724 = !DIEnumerator(name: "CIF_FUNCTION_NOT_CONSIDERED", value: 2, isUnsigned: true)
!725 = !DIEnumerator(name: "CIF_BODY_NOT_AVAILABLE", value: 3, isUnsigned: true)
!726 = !DIEnumerator(name: "CIF_REDEFINED_EXTERN_INLINE", value: 4, isUnsigned: true)
!727 = !DIEnumerator(name: "CIF_FUNCTION_NOT_INLINABLE", value: 5, isUnsigned: true)
!728 = !DIEnumerator(name: "CIF_FUNCTION_NOT_INLINE_CANDIDATE", value: 6, isUnsigned: true)
!729 = !DIEnumerator(name: "CIF_LARGE_FUNCTION_GROWTH_LIMIT", value: 7, isUnsigned: true)
!730 = !DIEnumerator(name: "CIF_LARGE_STACK_FRAME_GROWTH_LIMIT", value: 8, isUnsigned: true)
!731 = !DIEnumerator(name: "CIF_MAX_INLINE_INSNS_SINGLE_LIMIT", value: 9, isUnsigned: true)
!732 = !DIEnumerator(name: "CIF_MAX_INLINE_INSNS_AUTO_LIMIT", value: 10, isUnsigned: true)
!733 = !DIEnumerator(name: "CIF_INLINE_UNIT_GROWTH_LIMIT", value: 11, isUnsigned: true)
!734 = !DIEnumerator(name: "CIF_RECURSIVE_INLINING", value: 12, isUnsigned: true)
!735 = !DIEnumerator(name: "CIF_UNLIKELY_CALL", value: 13, isUnsigned: true)
!736 = !DIEnumerator(name: "CIF_NOT_DECLARED_INLINED", value: 14, isUnsigned: true)
!737 = !DIEnumerator(name: "CIF_OPTIMIZING_FOR_SIZE", value: 15, isUnsigned: true)
!738 = !DIEnumerator(name: "CIF_TARGET_OPTION_MISMATCH", value: 16, isUnsigned: true)
!739 = !DIEnumerator(name: "CIF_MISMATCHED_ARGUMENTS", value: 17, isUnsigned: true)
!740 = !DIEnumerator(name: "CIF_ORIGINALLY_INDIRECT_CALL", value: 18, isUnsigned: true)
!741 = !DIEnumerator(name: "CIF_N_REASONS", value: 19, isUnsigned: true)
!742 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "expand_modifier", file: !743, line: 52, baseType: !11, size: 32, elements: !744)
!743 = !DIFile(filename: "./expr.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!744 = !{!745, !746, !747, !748, !749, !750, !751}
!745 = !DIEnumerator(name: "EXPAND_NORMAL", value: 0, isUnsigned: true)
!746 = !DIEnumerator(name: "EXPAND_STACK_PARM", value: 1, isUnsigned: true)
!747 = !DIEnumerator(name: "EXPAND_SUM", value: 2, isUnsigned: true)
!748 = !DIEnumerator(name: "EXPAND_CONST_ADDRESS", value: 3, isUnsigned: true)
!749 = !DIEnumerator(name: "EXPAND_INITIALIZER", value: 4, isUnsigned: true)
!750 = !DIEnumerator(name: "EXPAND_WRITE", value: 5, isUnsigned: true)
!751 = !DIEnumerator(name: "EXPAND_MEMORY", value: 6, isUnsigned: true)
!752 = !{!753, !754, !6, !755, !758, !759, !761, !145, !787, !781, !2126, !11, !1146, !1257, !571, !962, !17, !2185, !2138, !2151, !766, !841, !2190, !1636, !2171, !2193, !765, !2199, !2200, !2163, !2201, !2202, !2209, !2210, !2211, !756, !2184, !789, !2191}
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !757)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !10, line: 194, size: 384, elements: !763)
!763 = !{!764, !2137, !2150, !2164, !2165, !2166}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !762, file: !10, line: 197, baseType: !765, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !10, line: 182, baseType: !766)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !10, line: 116, size: 704, elements: !768)
!768 = !{!769, !770, !771, !772, !773, !774, !2125, !2134, !2135, !2136}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !767, file: !10, line: 119, baseType: !766, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !767, file: !10, line: 122, baseType: !766, size: 64, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !767, file: !10, line: 123, baseType: !766, size: 64, offset: 128)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !767, file: !10, line: 126, baseType: !6, size: 32, offset: 192)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !767, file: !10, line: 129, baseType: !9, size: 32, offset: 224)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !767, file: !10, line: 165, baseType: !775, size: 192, offset: 256)
!775 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !10, line: 132, size: 192, elements: !776)
!776 = !{!777, !2114, !2120}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !775, file: !10, line: 137, baseType: !778, size: 128)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !10, line: 133, size: 128, elements: !779)
!779 = !{!780, !2113}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !778, file: !10, line: 135, baseType: !781, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !10, line: 93, size: 320, elements: !783)
!783 = !{!784, !785, !786, !2111, !2112}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !782, file: !10, line: 96, baseType: !781, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !782, file: !10, line: 97, baseType: !781, size: 64, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !782, file: !10, line: 101, baseType: !787, size: 64, offset: 128)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !788, line: 56, baseType: !789)
!788 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !146, line: 3371, size: 1792, elements: !791)
!791 = !{!792, !825, !831, !844, !863, !874, !879, !888, !894, !907, !919, !957, !1449, !1477, !1494, !1495, !1500, !1509, !1515, !1520, !1524, !1528, !1762, !1809, !1815, !1821, !1828, !1841, !1855, !1872, !1884, !1906, !1921, !2093}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !790, file: !146, line: 3372, baseType: !793, size: 64)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !146, line: 360, size: 64, elements: !794)
!794 = !{!795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !793, file: !146, line: 361, baseType: !11, size: 16, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !793, file: !146, line: 363, baseType: !11, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !793, file: !146, line: 364, baseType: !11, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !793, file: !146, line: 365, baseType: !11, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !793, file: !146, line: 366, baseType: !11, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !793, file: !146, line: 367, baseType: !11, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !793, file: !146, line: 368, baseType: !11, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !793, file: !146, line: 369, baseType: !11, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !793, file: !146, line: 370, baseType: !11, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !793, file: !146, line: 372, baseType: !11, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !793, file: !146, line: 373, baseType: !11, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !793, file: !146, line: 374, baseType: !11, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !793, file: !146, line: 375, baseType: !11, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !793, file: !146, line: 376, baseType: !11, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !793, file: !146, line: 377, baseType: !11, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !793, file: !146, line: 378, baseType: !11, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !793, file: !146, line: 379, baseType: !11, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !793, file: !146, line: 381, baseType: !11, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !793, file: !146, line: 382, baseType: !11, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !793, file: !146, line: 383, baseType: !11, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !793, file: !146, line: 384, baseType: !11, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !793, file: !146, line: 385, baseType: !11, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !793, file: !146, line: 386, baseType: !11, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !793, file: !146, line: 387, baseType: !11, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !793, file: !146, line: 388, baseType: !11, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !793, file: !146, line: 390, baseType: !11, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !793, file: !146, line: 391, baseType: !11, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !793, file: !146, line: 392, baseType: !11, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !793, file: !146, line: 394, baseType: !11, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !793, file: !146, line: 399, baseType: !11, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !790, file: !146, line: 3373, baseType: !826, size: 192)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !146, line: 402, size: 192, elements: !827)
!827 = !{!828, !829, !830}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !826, file: !146, line: 403, baseType: !793, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !826, file: !146, line: 404, baseType: !787, size: 64, offset: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !826, file: !146, line: 405, baseType: !787, size: 64, offset: 128)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !790, file: !146, line: 3374, baseType: !832, size: 320)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !146, line: 1384, size: 320, elements: !833)
!833 = !{!834, !835}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !832, file: !146, line: 1385, baseType: !826, size: 192)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !832, file: !146, line: 1386, baseType: !836, size: 128, offset: 192)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !837, line: 58, baseType: !838)
!837 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !837, line: 54, size: 128, elements: !839)
!839 = !{!840, !842}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !838, file: !837, line: 56, baseType: !841, size: 64)
!841 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !838, file: !837, line: 57, baseType: !843, size: 64, offset: 64)
!843 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !790, file: !146, line: 3375, baseType: !845, size: 256)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !146, line: 1397, size: 256, elements: !846)
!846 = !{!847, !848}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !845, file: !146, line: 1398, baseType: !826, size: 192)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !845, file: !146, line: 1399, baseType: !849, size: 64, offset: 192)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !851, line: 52, size: 256, elements: !852)
!851 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!852 = !{!853, !854, !855, !856, !857, !858, !859}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !850, file: !851, line: 56, baseType: !11, size: 2, flags: DIFlagBitField, extraData: i64 0)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !850, file: !851, line: 57, baseType: !11, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !850, file: !851, line: 58, baseType: !11, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !850, file: !851, line: 59, baseType: !11, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !850, file: !851, line: 60, baseType: !11, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !850, file: !851, line: 61, baseType: !11, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !850, file: !851, line: 62, baseType: !860, size: 192, offset: 64)
!860 = !DICompositeType(tag: DW_TAG_array_type, baseType: !841, size: 192, elements: !861)
!861 = !{!862}
!862 = !DISubrange(count: 3)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !790, file: !146, line: 3376, baseType: !864, size: 256)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !146, line: 1408, size: 256, elements: !865)
!865 = !{!866, !867}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !864, file: !146, line: 1409, baseType: !826, size: 192)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !864, file: !146, line: 1410, baseType: !868, size: 64, offset: 192)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !870, line: 27, size: 192, elements: !871)
!870 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!871 = !{!872, !873}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !869, file: !870, line: 29, baseType: !836, size: 128)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !869, file: !870, line: 30, baseType: !17, size: 32, offset: 128)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !790, file: !146, line: 3377, baseType: !875, size: 256)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !146, line: 1437, size: 256, elements: !876)
!876 = !{!877, !878}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !875, file: !146, line: 1438, baseType: !826, size: 192)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !875, file: !146, line: 1439, baseType: !787, size: 64, offset: 192)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !790, file: !146, line: 3378, baseType: !880, size: 256)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !146, line: 1418, size: 256, elements: !881)
!881 = !{!882, !883, !884}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !880, file: !146, line: 1419, baseType: !826, size: 192)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !880, file: !146, line: 1420, baseType: !6, size: 32, offset: 192)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !880, file: !146, line: 1421, baseType: !885, size: 8, offset: 224)
!885 = !DICompositeType(tag: DW_TAG_array_type, baseType: !757, size: 8, elements: !886)
!886 = !{!887}
!887 = !DISubrange(count: 1)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !790, file: !146, line: 3379, baseType: !889, size: 320)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !146, line: 1428, size: 320, elements: !890)
!890 = !{!891, !892, !893}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !889, file: !146, line: 1429, baseType: !826, size: 192)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !889, file: !146, line: 1430, baseType: !787, size: 64, offset: 192)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !889, file: !146, line: 1431, baseType: !787, size: 64, offset: 256)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !790, file: !146, line: 3380, baseType: !895, size: 320)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !146, line: 1460, size: 320, elements: !896)
!896 = !{!897, !898}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !895, file: !146, line: 1461, baseType: !826, size: 192)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !895, file: !146, line: 1462, baseType: !899, size: 128, offset: 192)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !900, line: 31, size: 128, elements: !901)
!900 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!901 = !{!902, !905, !906}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !899, file: !900, line: 32, baseType: !903, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !754)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !899, file: !900, line: 33, baseType: !11, size: 32, offset: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !899, file: !900, line: 34, baseType: !11, size: 32, offset: 96)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !790, file: !146, line: 3381, baseType: !908, size: 384)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !146, line: 2507, size: 384, elements: !909)
!909 = !{!910, !911, !916, !917, !918}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !908, file: !146, line: 2508, baseType: !826, size: 192)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !908, file: !146, line: 2509, baseType: !912, size: 32, offset: 192)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !913, line: 58, baseType: !914)
!913 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !915, line: 44, baseType: !11)
!915 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!916 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !908, file: !146, line: 2510, baseType: !11, size: 32, offset: 224)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !908, file: !146, line: 2511, baseType: !787, size: 64, offset: 256)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !908, file: !146, line: 2512, baseType: !787, size: 64, offset: 320)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !790, file: !146, line: 3382, baseType: !920, size: 896)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !146, line: 2652, size: 896, elements: !921)
!921 = !{!922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !920, file: !146, line: 2653, baseType: !908, size: 384)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !920, file: !146, line: 2654, baseType: !787, size: 64, offset: 384)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !920, file: !146, line: 2656, baseType: !11, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !920, file: !146, line: 2658, baseType: !11, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !920, file: !146, line: 2659, baseType: !11, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !920, file: !146, line: 2660, baseType: !11, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !920, file: !146, line: 2661, baseType: !11, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !920, file: !146, line: 2662, baseType: !11, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !920, file: !146, line: 2663, baseType: !11, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !920, file: !146, line: 2664, baseType: !11, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !920, file: !146, line: 2666, baseType: !11, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !920, file: !146, line: 2667, baseType: !11, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !920, file: !146, line: 2668, baseType: !11, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !920, file: !146, line: 2669, baseType: !11, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !920, file: !146, line: 2670, baseType: !11, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !920, file: !146, line: 2671, baseType: !11, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !920, file: !146, line: 2672, baseType: !11, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !920, file: !146, line: 2673, baseType: !11, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !920, file: !146, line: 2674, baseType: !11, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !920, file: !146, line: 2678, baseType: !11, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !920, file: !146, line: 2682, baseType: !11, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !920, file: !146, line: 2685, baseType: !11, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !920, file: !146, line: 2688, baseType: !11, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !920, file: !146, line: 2690, baseType: !11, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !920, file: !146, line: 2692, baseType: !11, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !920, file: !146, line: 2695, baseType: !11, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !920, file: !146, line: 2698, baseType: !11, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !920, file: !146, line: 2703, baseType: !11, size: 32, offset: 512)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !920, file: !146, line: 2705, baseType: !787, size: 64, offset: 576)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !920, file: !146, line: 2706, baseType: !787, size: 64, offset: 640)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !920, file: !146, line: 2707, baseType: !787, size: 64, offset: 704)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !920, file: !146, line: 2708, baseType: !787, size: 64, offset: 768)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !920, file: !146, line: 2711, baseType: !955, size: 64, offset: 832)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !146, line: 2711, flags: DIFlagFwdDecl)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !790, file: !146, line: 3383, baseType: !958, size: 960)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !146, line: 2756, size: 960, elements: !959)
!959 = !{!960, !961}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !958, file: !146, line: 2757, baseType: !920, size: 896)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !958, file: !146, line: 2758, baseType: !962, size: 64, offset: 896)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !788, line: 50, baseType: !963)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !572, line: 240, size: 384, elements: !965)
!965 = !{!966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !964, file: !572, line: 242, baseType: !11, size: 16, flags: DIFlagBitField, extraData: i64 0)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !964, file: !572, line: 245, baseType: !11, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !964, file: !572, line: 252, baseType: !11, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !964, file: !572, line: 257, baseType: !11, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !964, file: !572, line: 265, baseType: !11, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !964, file: !572, line: 277, baseType: !11, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !964, file: !572, line: 291, baseType: !11, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !964, file: !572, line: 298, baseType: !11, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !964, file: !572, line: 305, baseType: !11, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !964, file: !572, line: 310, baseType: !11, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !964, file: !572, line: 321, baseType: !977, size: 320, offset: 64)
!977 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !572, line: 315, size: 320, elements: !978)
!978 = !{!979, !1382, !1384, !1447, !1448}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !977, file: !572, line: 316, baseType: !980, size: 64)
!980 = !DICompositeType(tag: DW_TAG_array_type, baseType: !981, size: 64, elements: !886)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !572, line: 183, baseType: !982)
!982 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !572, line: 166, size: 64, elements: !983)
!983 = !{!984, !985, !986, !987, !988, !996, !997, !1009, !1012, !1072, !1073, !1359, !1372, !1379}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !982, file: !572, line: 168, baseType: !6, size: 32)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !982, file: !572, line: 169, baseType: !11, size: 32)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !982, file: !572, line: 170, baseType: !759, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !982, file: !572, line: 171, baseType: !962, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !982, file: !572, line: 172, baseType: !989, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !788, line: 53, baseType: !990)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !572, line: 359, size: 128, elements: !992)
!992 = !{!993, !994}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !991, file: !572, line: 360, baseType: !6, size: 32)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !991, file: !572, line: 361, baseType: !995, size: 64, offset: 64)
!995 = !DICompositeType(tag: DW_TAG_array_type, baseType: !962, size: 64, elements: !886)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !982, file: !572, line: 173, baseType: !17, size: 32)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !982, file: !572, line: 174, baseType: !998, size: 32)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !572, line: 133, baseType: !999)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !572, line: 115, size: 32, elements: !1000)
!1000 = !{!1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !999, file: !572, line: 118, baseType: !11, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !999, file: !572, line: 120, baseType: !11, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !999, file: !572, line: 121, baseType: !11, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !999, file: !572, line: 123, baseType: !11, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !999, file: !572, line: 125, baseType: !11, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !999, file: !572, line: 127, baseType: !11, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !999, file: !572, line: 130, baseType: !11, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !999, file: !572, line: 132, baseType: !11, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !982, file: !572, line: 175, baseType: !1010, size: 64)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !572, line: 175, flags: DIFlagFwdDecl)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !982, file: !572, line: 176, baseType: !1013, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1015, line: 75, size: 256, elements: !1016)
!1015 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1016 = !{!1017, !1031, !1032, !1033}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1014, file: !1015, line: 76, baseType: !1018, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1015, line: 68, baseType: !1020)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1015, line: 63, size: 320, elements: !1021)
!1021 = !{!1022, !1024, !1025, !1026}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1020, file: !1015, line: 64, baseType: !1023, size: 64)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1020, file: !1015, line: 65, baseType: !1023, size: 64, offset: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1020, file: !1015, line: 66, baseType: !11, size: 32, offset: 128)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1020, file: !1015, line: 67, baseType: !1027, size: 128, offset: 192)
!1027 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1028, size: 128, elements: !1029)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1015, line: 29, baseType: !841)
!1029 = !{!1030}
!1030 = !DISubrange(count: 2)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1014, file: !1015, line: 77, baseType: !1018, size: 64, offset: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1014, file: !1015, line: 78, baseType: !11, size: 32, offset: 128)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1014, file: !1015, line: 79, baseType: !1034, size: 64, offset: 192)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1015, line: 49, baseType: !1036)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1015, line: 45, size: 832, elements: !1037)
!1037 = !{!1038, !1039, !1040}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1036, file: !1015, line: 46, baseType: !1023, size: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1036, file: !1015, line: 47, baseType: !1013, size: 64, offset: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1036, file: !1015, line: 48, baseType: !1041, size: 704, offset: 128)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1042, line: 164, size: 704, elements: !1043)
!1042 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1043 = !{!1044, !1045, !1055, !1056, !1057, !1058, !1059, !1060, !1064, !1068, !1069, !1070, !1071}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1041, file: !1042, line: 166, baseType: !843, size: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1041, file: !1042, line: 167, baseType: !1046, size: 64, offset: 64)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1042, line: 157, size: 192, elements: !1048)
!1048 = !{!1049, !1050, !1051}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1047, file: !1042, line: 159, baseType: !756, size: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1047, file: !1042, line: 160, baseType: !1046, size: 64, offset: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1047, file: !1042, line: 161, baseType: !1052, size: 32, offset: 128)
!1052 = !DICompositeType(tag: DW_TAG_array_type, baseType: !757, size: 32, elements: !1053)
!1053 = !{!1054}
!1054 = !DISubrange(count: 4)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1041, file: !1042, line: 168, baseType: !756, size: 64, offset: 128)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1041, file: !1042, line: 169, baseType: !756, size: 64, offset: 192)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1041, file: !1042, line: 170, baseType: !756, size: 64, offset: 256)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1041, file: !1042, line: 171, baseType: !843, size: 64, offset: 320)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1041, file: !1042, line: 172, baseType: !6, size: 32, offset: 384)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1041, file: !1042, line: 176, baseType: !1061, size: 64, offset: 448)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{!1046, !758, !843}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1041, file: !1042, line: 177, baseType: !1065, size: 64, offset: 512)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = !DISubroutineType(types: !1067)
!1067 = !{null, !758, !1046}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1041, file: !1042, line: 178, baseType: !758, size: 64, offset: 576)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1041, file: !1042, line: 179, baseType: !11, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1041, file: !1042, line: 180, baseType: !11, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1041, file: !1042, line: 184, baseType: !11, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !982, file: !572, line: 177, baseType: !787, size: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !982, file: !572, line: 178, baseType: !1074, size: 64)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !341, line: 217, size: 832, elements: !1076)
!1076 = !{!1077, !1324, !1325, !1326, !1329, !1333, !1334, !1335, !1353, !1354, !1355, !1356, !1357, !1358}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1075, file: !341, line: 219, baseType: !1078, size: 64)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !341, line: 151, baseType: !1080)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !341, line: 151, size: 128, elements: !1081)
!1081 = !{!1082}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1080, file: !341, line: 151, baseType: !1083, size: 128)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !341, line: 150, baseType: !1084)
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !341, line: 150, size: 128, elements: !1085)
!1085 = !{!1086, !1087, !1088}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1084, file: !341, line: 150, baseType: !11, size: 32)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1084, file: !341, line: 150, baseType: !11, size: 32, offset: 32)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1084, file: !341, line: 150, baseType: !1089, size: 64, offset: 64)
!1089 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1090, size: 64, elements: !886)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !788, line: 108, baseType: !1091)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !341, line: 122, size: 512, elements: !1093)
!1093 = !{!1094, !1095, !1096, !1316, !1317, !1318, !1319, !1320, !1321, !1322}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1092, file: !341, line: 124, baseType: !1074, size: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1092, file: !341, line: 125, baseType: !1074, size: 64, offset: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1092, file: !341, line: 131, baseType: !1097, size: 64, offset: 128)
!1097 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !341, line: 128, size: 64, elements: !1098)
!1098 = !{!1099, !1315}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1097, file: !341, line: 129, baseType: !1100, size: 64)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !788, line: 66, baseType: !1101)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !1103, line: 143, size: 192, elements: !1104)
!1103 = !DIFile(filename: "./gimple.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1104 = !{!1105, !1313, !1314}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1102, file: !1103, line: 145, baseType: !1106, size: 64)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !788, line: 69, baseType: !1107)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !1103, line: 136, size: 192, elements: !1109)
!1109 = !{!1110, !1311, !1312}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1108, file: !1103, line: 137, baseType: !1111, size: 64)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !788, line: 58, baseType: !1112)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64)
!1113 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !1103, line: 737, size: 768, elements: !1114)
!1114 = !{!1115, !1132, !1166, !1172, !1177, !1182, !1189, !1195, !1201, !1206, !1220, !1225, !1231, !1236, !1246, !1251, !1269, !1276, !1283, !1289, !1294, !1300, !1306}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1113, file: !1103, line: 738, baseType: !1116, size: 256)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !1103, line: 271, size: 256, elements: !1117)
!1117 = !{!1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1116, file: !1103, line: 274, baseType: !11, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !1116, file: !1103, line: 277, baseType: !11, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1116, file: !1103, line: 281, baseType: !11, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !1116, file: !1103, line: 284, baseType: !11, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !1116, file: !1103, line: 291, baseType: !11, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !1116, file: !1103, line: 295, baseType: !11, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !1116, file: !1103, line: 298, baseType: !11, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1116, file: !1103, line: 301, baseType: !11, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !1116, file: !1103, line: 307, baseType: !11, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1116, file: !1103, line: 312, baseType: !11, size: 32, offset: 32)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !1116, file: !1103, line: 316, baseType: !912, size: 32, offset: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !1116, file: !1103, line: 319, baseType: !11, size: 32, offset: 96)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1116, file: !1103, line: 323, baseType: !1074, size: 64, offset: 128)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1116, file: !1103, line: 327, baseType: !787, size: 64, offset: 192)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !1113, file: !1103, line: 739, baseType: !1133, size: 448)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !1103, line: 350, size: 448, elements: !1134)
!1134 = !{!1135, !1164}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1133, file: !1103, line: 353, baseType: !1136, size: 384)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !1103, line: 333, size: 384, elements: !1137)
!1137 = !{!1138, !1139, !1147}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1136, file: !1103, line: 336, baseType: !1116, size: 256)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !1136, file: !1103, line: 343, baseType: !1140, size: 64, offset: 256)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1142, line: 37, size: 128, elements: !1143)
!1142 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1143 = !{!1144, !1145}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1141, file: !1142, line: 39, baseType: !1140, size: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1141, file: !1142, line: 40, baseType: !1146, size: 64, offset: 64)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !1136, file: !1103, line: 344, baseType: !1148, size: 64, offset: 320)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1142, line: 45, size: 320, elements: !1150)
!1150 = !{!1151, !1152}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1149, file: !1142, line: 47, baseType: !1148, size: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1149, file: !1142, line: 48, baseType: !1153, size: 256, offset: 64)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !146, line: 1883, size: 256, elements: !1154)
!1154 = !{!1155, !1157, !1158, !1163}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1153, file: !146, line: 1884, baseType: !1156, size: 64)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1153, file: !146, line: 1885, baseType: !1156, size: 64, offset: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1153, file: !146, line: 1891, baseType: !1159, size: 64, offset: 128)
!1159 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1153, file: !146, line: 1891, size: 64, elements: !1160)
!1160 = !{!1161, !1162}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1159, file: !146, line: 1891, baseType: !1111, size: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1159, file: !146, line: 1891, baseType: !787, size: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1153, file: !146, line: 1892, baseType: !1146, size: 64, offset: 192)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1133, file: !1103, line: 359, baseType: !1165, size: 64, offset: 384)
!1165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !787, size: 64, elements: !886)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !1113, file: !1103, line: 740, baseType: !1167, size: 512)
!1167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !1103, line: 365, size: 512, elements: !1168)
!1168 = !{!1169, !1170, !1171}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1167, file: !1103, line: 368, baseType: !1136, size: 384)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1167, file: !1103, line: 373, baseType: !787, size: 64, offset: 384)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1167, file: !1103, line: 374, baseType: !787, size: 64, offset: 448)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !1113, file: !1103, line: 741, baseType: !1173, size: 576)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !1103, line: 380, size: 576, elements: !1174)
!1174 = !{!1175, !1176}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1173, file: !1103, line: 383, baseType: !1167, size: 512)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1173, file: !1103, line: 389, baseType: !1165, size: 64, offset: 512)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1113, file: !1103, line: 742, baseType: !1178, size: 320)
!1178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !1103, line: 395, size: 320, elements: !1179)
!1179 = !{!1180, !1181}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1178, file: !1103, line: 397, baseType: !1116, size: 256)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1178, file: !1103, line: 400, baseType: !1100, size: 64, offset: 256)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !1113, file: !1103, line: 743, baseType: !1183, size: 448)
!1183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !1103, line: 406, size: 448, elements: !1184)
!1184 = !{!1185, !1186, !1187, !1188}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1183, file: !1103, line: 408, baseType: !1116, size: 256)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1183, file: !1103, line: 412, baseType: !787, size: 64, offset: 256)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1183, file: !1103, line: 420, baseType: !787, size: 64, offset: 320)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1183, file: !1103, line: 423, baseType: !1100, size: 64, offset: 384)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !1113, file: !1103, line: 744, baseType: !1190, size: 384)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !1103, line: 429, size: 384, elements: !1191)
!1191 = !{!1192, !1193, !1194}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1190, file: !1103, line: 431, baseType: !1116, size: 256)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1190, file: !1103, line: 434, baseType: !787, size: 64, offset: 256)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1190, file: !1103, line: 437, baseType: !1100, size: 64, offset: 320)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !1113, file: !1103, line: 745, baseType: !1196, size: 384)
!1196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !1103, line: 443, size: 384, elements: !1197)
!1197 = !{!1198, !1199, !1200}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1196, file: !1103, line: 445, baseType: !1116, size: 256)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1196, file: !1103, line: 449, baseType: !787, size: 64, offset: 256)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1196, file: !1103, line: 453, baseType: !1100, size: 64, offset: 320)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !1113, file: !1103, line: 746, baseType: !1202, size: 320)
!1202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !1103, line: 459, size: 320, elements: !1203)
!1203 = !{!1204, !1205}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1202, file: !1103, line: 461, baseType: !1116, size: 256)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1202, file: !1103, line: 464, baseType: !787, size: 64, offset: 256)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !1113, file: !1103, line: 747, baseType: !1207, size: 768)
!1207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !1103, line: 469, size: 768, elements: !1208)
!1208 = !{!1209, !1210, !1211, !1212, !1213}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1207, file: !1103, line: 471, baseType: !1116, size: 256)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1207, file: !1103, line: 474, baseType: !11, size: 32, offset: 256)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1207, file: !1103, line: 475, baseType: !11, size: 32, offset: 288)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1207, file: !1103, line: 478, baseType: !787, size: 64, offset: 320)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1207, file: !1103, line: 481, baseType: !1214, size: 384, offset: 384)
!1214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1215, size: 384, elements: !886)
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !146, line: 1917, size: 384, elements: !1216)
!1216 = !{!1217, !1218, !1219}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1215, file: !146, line: 1920, baseType: !1153, size: 256)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1215, file: !146, line: 1921, baseType: !787, size: 64, offset: 256)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1215, file: !146, line: 1922, baseType: !912, size: 32, offset: 320)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !1113, file: !1103, line: 748, baseType: !1221, size: 320)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !1103, line: 487, size: 320, elements: !1222)
!1222 = !{!1223, !1224}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1221, file: !1103, line: 490, baseType: !1116, size: 256)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1221, file: !1103, line: 494, baseType: !6, size: 32, offset: 256)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !1113, file: !1103, line: 749, baseType: !1226, size: 384)
!1226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !1103, line: 500, size: 384, elements: !1227)
!1227 = !{!1228, !1229, !1230}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1226, file: !1103, line: 502, baseType: !1116, size: 256)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1226, file: !1103, line: 506, baseType: !1100, size: 64, offset: 256)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1226, file: !1103, line: 510, baseType: !1100, size: 64, offset: 320)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !1113, file: !1103, line: 750, baseType: !1232, size: 320)
!1232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !1103, line: 529, size: 320, elements: !1233)
!1233 = !{!1234, !1235}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1232, file: !1103, line: 531, baseType: !1116, size: 256)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1232, file: !1103, line: 540, baseType: !1100, size: 64, offset: 256)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !1113, file: !1103, line: 751, baseType: !1237, size: 704)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !1103, line: 546, size: 704, elements: !1238)
!1238 = !{!1239, !1240, !1241, !1242, !1243, !1244, !1245}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1237, file: !1103, line: 549, baseType: !1167, size: 512)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1237, file: !1103, line: 553, baseType: !759, size: 64, offset: 512)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1237, file: !1103, line: 557, baseType: !754, size: 8, offset: 576)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1237, file: !1103, line: 558, baseType: !754, size: 8, offset: 584)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1237, file: !1103, line: 559, baseType: !754, size: 8, offset: 592)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1237, file: !1103, line: 560, baseType: !754, size: 8, offset: 600)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1237, file: !1103, line: 566, baseType: !1165, size: 64, offset: 640)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !1113, file: !1103, line: 752, baseType: !1247, size: 384)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !1103, line: 571, size: 384, elements: !1248)
!1248 = !{!1249, !1250}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1247, file: !1103, line: 573, baseType: !1178, size: 320)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1247, file: !1103, line: 577, baseType: !787, size: 64, offset: 320)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !1113, file: !1103, line: 753, baseType: !1252, size: 576)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !1103, line: 600, size: 576, elements: !1253)
!1253 = !{!1254, !1255, !1256, !1259, !1268}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1252, file: !1103, line: 602, baseType: !1178, size: 320)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1252, file: !1103, line: 605, baseType: !787, size: 64, offset: 320)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1252, file: !1103, line: 609, baseType: !1257, size: 64, offset: 384)
!1257 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1258, line: 46, baseType: !841)
!1258 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1252, file: !1103, line: 612, baseType: !1260, size: 64, offset: 448)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64)
!1261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !1103, line: 581, size: 320, elements: !1262)
!1262 = !{!1263, !1264, !1265, !1266, !1267}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1261, file: !1103, line: 583, baseType: !145, size: 32)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1261, file: !1103, line: 586, baseType: !787, size: 64, offset: 64)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1261, file: !1103, line: 589, baseType: !787, size: 64, offset: 128)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1261, file: !1103, line: 592, baseType: !787, size: 64, offset: 192)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1261, file: !1103, line: 595, baseType: !787, size: 64, offset: 256)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1252, file: !1103, line: 616, baseType: !1100, size: 64, offset: 512)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !1113, file: !1103, line: 754, baseType: !1270, size: 512)
!1270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !1103, line: 622, size: 512, elements: !1271)
!1271 = !{!1272, !1273, !1274, !1275}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1270, file: !1103, line: 624, baseType: !1178, size: 320)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1270, file: !1103, line: 628, baseType: !787, size: 64, offset: 320)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1270, file: !1103, line: 632, baseType: !787, size: 64, offset: 384)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1270, file: !1103, line: 636, baseType: !787, size: 64, offset: 448)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !1113, file: !1103, line: 755, baseType: !1277, size: 704)
!1277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !1103, line: 642, size: 704, elements: !1278)
!1278 = !{!1279, !1280, !1281, !1282}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1277, file: !1103, line: 644, baseType: !1270, size: 512)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1277, file: !1103, line: 648, baseType: !787, size: 64, offset: 512)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1277, file: !1103, line: 652, baseType: !787, size: 64, offset: 576)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1277, file: !1103, line: 653, baseType: !787, size: 64, offset: 640)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !1113, file: !1103, line: 756, baseType: !1284, size: 448)
!1284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !1103, line: 663, size: 448, elements: !1285)
!1285 = !{!1286, !1287, !1288}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1284, file: !1103, line: 665, baseType: !1178, size: 320)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1284, file: !1103, line: 668, baseType: !787, size: 64, offset: 320)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1284, file: !1103, line: 673, baseType: !787, size: 64, offset: 384)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !1113, file: !1103, line: 757, baseType: !1290, size: 384)
!1290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !1103, line: 694, size: 384, elements: !1291)
!1291 = !{!1292, !1293}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1290, file: !1103, line: 696, baseType: !1178, size: 320)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1290, file: !1103, line: 699, baseType: !787, size: 64, offset: 320)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !1113, file: !1103, line: 758, baseType: !1295, size: 384)
!1295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !1103, line: 681, size: 384, elements: !1296)
!1296 = !{!1297, !1298, !1299}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1295, file: !1103, line: 683, baseType: !1116, size: 256)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1295, file: !1103, line: 686, baseType: !787, size: 64, offset: 256)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1295, file: !1103, line: 689, baseType: !787, size: 64, offset: 320)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !1113, file: !1103, line: 759, baseType: !1301, size: 384)
!1301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !1103, line: 707, size: 384, elements: !1302)
!1302 = !{!1303, !1304, !1305}
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1301, file: !1103, line: 709, baseType: !1116, size: 256)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1301, file: !1103, line: 712, baseType: !787, size: 64, offset: 256)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1301, file: !1103, line: 712, baseType: !787, size: 64, offset: 320)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !1113, file: !1103, line: 760, baseType: !1307, size: 320)
!1307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !1103, line: 718, size: 320, elements: !1308)
!1308 = !{!1309, !1310}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1307, file: !1103, line: 720, baseType: !1116, size: 256)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1307, file: !1103, line: 723, baseType: !787, size: 64, offset: 256)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1108, file: !1103, line: 138, baseType: !1107, size: 64, offset: 64)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1108, file: !1103, line: 139, baseType: !1107, size: 64, offset: 128)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1102, file: !1103, line: 146, baseType: !1106, size: 64, offset: 64)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1102, file: !1103, line: 152, baseType: !1100, size: 64, offset: 128)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1097, file: !341, line: 130, baseType: !962, size: 64)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1092, file: !341, line: 134, baseType: !758, size: 64, offset: 192)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1092, file: !341, line: 137, baseType: !787, size: 64, offset: 256)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1092, file: !341, line: 138, baseType: !912, size: 32, offset: 320)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1092, file: !341, line: 142, baseType: !11, size: 32, offset: 352)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1092, file: !341, line: 144, baseType: !6, size: 32, offset: 384)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1092, file: !341, line: 145, baseType: !6, size: 32, offset: 416)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1092, file: !341, line: 146, baseType: !1323, size: 64, offset: 448)
!1323 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !341, line: 119, baseType: !843)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1075, file: !341, line: 220, baseType: !1078, size: 64, offset: 64)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1075, file: !341, line: 223, baseType: !758, size: 64, offset: 128)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1075, file: !341, line: 226, baseType: !1327, size: 64, offset: 192)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64)
!1328 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !341, line: 185, flags: DIFlagFwdDecl)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1075, file: !341, line: 229, baseType: !1330, size: 128, offset: 256)
!1330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1331, size: 128, elements: !1029)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64)
!1332 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !341, line: 229, flags: DIFlagFwdDecl)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1075, file: !341, line: 232, baseType: !1074, size: 64, offset: 384)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1075, file: !341, line: 233, baseType: !1074, size: 64, offset: 448)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1075, file: !341, line: 238, baseType: !1336, size: 64, offset: 512)
!1336 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !341, line: 235, size: 64, elements: !1337)
!1337 = !{!1338, !1344}
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1336, file: !341, line: 236, baseType: !1339, size: 64)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64)
!1340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !341, line: 273, size: 128, elements: !1341)
!1341 = !{!1342, !1343}
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1340, file: !341, line: 275, baseType: !1100, size: 64)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1340, file: !341, line: 278, baseType: !1100, size: 64, offset: 64)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1336, file: !341, line: 237, baseType: !1345, size: 64)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64)
!1346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !341, line: 259, size: 320, elements: !1347)
!1347 = !{!1348, !1349, !1350, !1351, !1352}
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1346, file: !341, line: 261, baseType: !962, size: 64)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1346, file: !341, line: 262, baseType: !962, size: 64, offset: 64)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1346, file: !341, line: 266, baseType: !962, size: 64, offset: 128)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1346, file: !341, line: 267, baseType: !962, size: 64, offset: 192)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1346, file: !341, line: 270, baseType: !6, size: 32, offset: 256)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1075, file: !341, line: 241, baseType: !1323, size: 64, offset: 576)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1075, file: !341, line: 244, baseType: !6, size: 32, offset: 640)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1075, file: !341, line: 247, baseType: !6, size: 32, offset: 672)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1075, file: !341, line: 250, baseType: !6, size: 32, offset: 704)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1075, file: !341, line: 253, baseType: !6, size: 32, offset: 736)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1075, file: !341, line: 256, baseType: !6, size: 32, offset: 768)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !982, file: !572, line: 179, baseType: !1360, size: 64)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64)
!1361 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !572, line: 150, baseType: !1362)
!1362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !572, line: 142, size: 320, elements: !1363)
!1363 = !{!1364, !1365, !1366, !1367, !1370, !1371}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1362, file: !572, line: 144, baseType: !787, size: 64)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1362, file: !572, line: 145, baseType: !962, size: 64, offset: 64)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1362, file: !572, line: 146, baseType: !962, size: 64, offset: 128)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1362, file: !572, line: 147, baseType: !1368, size: 32, offset: 192)
!1368 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1369, line: 31, baseType: !6)
!1369 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1362, file: !572, line: 148, baseType: !11, size: 32, offset: 224)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1362, file: !572, line: 149, baseType: !754, size: 8, offset: 256)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !982, file: !572, line: 180, baseType: !1373, size: 64)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64)
!1374 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !572, line: 162, baseType: !1375)
!1375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !572, line: 159, size: 128, elements: !1376)
!1376 = !{!1377, !1378}
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1375, file: !572, line: 160, baseType: !787, size: 64)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1375, file: !572, line: 161, baseType: !843, size: 64, offset: 64)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !982, file: !572, line: 181, baseType: !1380, size: 64)
!1380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1381, size: 64)
!1381 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !572, line: 181, flags: DIFlagFwdDecl)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !977, file: !572, line: 317, baseType: !1383, size: 64)
!1383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !843, size: 64, elements: !886)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !977, file: !572, line: 318, baseType: !1385, size: 320)
!1385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !572, line: 188, size: 320, elements: !1386)
!1386 = !{!1387, !1389, !1446}
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1385, file: !572, line: 190, baseType: !1388, size: 192)
!1388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !981, size: 192, elements: !861)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1385, file: !572, line: 193, baseType: !1390, size: 64, offset: 192)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64)
!1391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !572, line: 206, size: 320, elements: !1392)
!1392 = !{!1393, !1431, !1432, !1433, !1445}
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1391, file: !572, line: 208, baseType: !1394, size: 64)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1395, size: 64)
!1395 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !788, line: 62, baseType: !1396)
!1396 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1397, line: 538, size: 256, elements: !1398)
!1397 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1398 = !{!1399, !1403, !1409, !1422}
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1396, file: !1397, line: 539, baseType: !1400, size: 32)
!1400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1397, line: 482, size: 32, elements: !1401)
!1401 = !{!1402}
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1400, file: !1397, line: 484, baseType: !11, size: 32)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1396, file: !1397, line: 540, baseType: !1404, size: 192)
!1404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1397, line: 488, size: 192, elements: !1405)
!1405 = !{!1406, !1407, !1408}
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1404, file: !1397, line: 489, baseType: !1400, size: 32)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1404, file: !1397, line: 492, baseType: !759, size: 64, offset: 64)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1404, file: !1397, line: 496, baseType: !787, size: 64, offset: 128)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1396, file: !1397, line: 541, baseType: !1410, size: 256)
!1410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1397, line: 504, size: 256, elements: !1411)
!1411 = !{!1412, !1413, !1420, !1421}
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1410, file: !1397, line: 505, baseType: !1400, size: 32)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1410, file: !1397, line: 509, baseType: !1414, size: 64, offset: 64)
!1414 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1397, line: 501, baseType: !1415)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64)
!1416 = !DISubroutineType(types: !1417)
!1417 = !{null, !1418}
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64)
!1419 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1410, file: !1397, line: 510, baseType: !1418, size: 64, offset: 128)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1410, file: !1397, line: 513, baseType: !1394, size: 64, offset: 192)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1396, file: !1397, line: 542, baseType: !1423, size: 128)
!1423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1397, line: 530, size: 128, elements: !1424)
!1424 = !{!1425, !1426}
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1423, file: !1397, line: 531, baseType: !1400, size: 32)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1423, file: !1397, line: 534, baseType: !1427, size: 64, offset: 64)
!1427 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1397, line: 525, baseType: !1428)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64)
!1429 = !DISubroutineType(types: !1430)
!1430 = !{!754, !787, !759, !841, !841}
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1391, file: !572, line: 211, baseType: !11, size: 32, offset: 64)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1391, file: !572, line: 214, baseType: !843, size: 64, offset: 128)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1391, file: !572, line: 224, baseType: !1434, size: 64, offset: 192)
!1434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1435, size: 64)
!1435 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !572, line: 202, baseType: !1436)
!1436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !572, line: 202, size: 128, elements: !1437)
!1437 = !{!1438}
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1436, file: !572, line: 202, baseType: !1439, size: 128)
!1439 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !572, line: 200, baseType: !1440)
!1440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !572, line: 200, size: 128, elements: !1441)
!1441 = !{!1442, !1443, !1444}
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1440, file: !572, line: 200, baseType: !11, size: 32)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1440, file: !572, line: 200, baseType: !11, size: 32, offset: 32)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1440, file: !572, line: 200, baseType: !995, size: 64, offset: 64)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1391, file: !572, line: 234, baseType: !1434, size: 64, offset: 256)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1385, file: !572, line: 197, baseType: !843, size: 64, offset: 256)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !977, file: !572, line: 319, baseType: !850, size: 256)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !977, file: !572, line: 320, baseType: !869, size: 192)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !790, file: !146, line: 3384, baseType: !1450, size: 1472)
!1450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !146, line: 3114, size: 1472, elements: !1451)
!1451 = !{!1452, !1473, !1474, !1475, !1476}
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1450, file: !146, line: 3115, baseType: !1453, size: 1216)
!1453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !146, line: 2984, size: 1216, elements: !1454)
!1454 = !{!1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472}
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1453, file: !146, line: 2985, baseType: !958, size: 960)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1453, file: !146, line: 2986, baseType: !787, size: 64, offset: 960)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1453, file: !146, line: 2987, baseType: !787, size: 64, offset: 1024)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1453, file: !146, line: 2988, baseType: !787, size: 64, offset: 1088)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1453, file: !146, line: 2991, baseType: !11, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1453, file: !146, line: 2992, baseType: !11, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1453, file: !146, line: 2993, baseType: !11, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1453, file: !146, line: 2994, baseType: !11, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1453, file: !146, line: 2995, baseType: !11, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1453, file: !146, line: 2996, baseType: !11, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1453, file: !146, line: 2998, baseType: !11, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1453, file: !146, line: 3000, baseType: !11, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1453, file: !146, line: 3002, baseType: !11, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1453, file: !146, line: 3003, baseType: !11, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1453, file: !146, line: 3004, baseType: !11, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1453, file: !146, line: 3005, baseType: !11, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1453, file: !146, line: 3007, baseType: !11, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1453, file: !146, line: 3010, baseType: !11, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1450, file: !146, line: 3117, baseType: !787, size: 64, offset: 1216)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1450, file: !146, line: 3119, baseType: !787, size: 64, offset: 1280)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1450, file: !146, line: 3121, baseType: !787, size: 64, offset: 1344)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1450, file: !146, line: 3123, baseType: !787, size: 64, offset: 1408)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !790, file: !146, line: 3385, baseType: !1478, size: 1088)
!1478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !146, line: 2874, size: 1088, elements: !1479)
!1479 = !{!1480, !1481, !1482}
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1478, file: !146, line: 2875, baseType: !958, size: 960)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1478, file: !146, line: 2876, baseType: !962, size: 64, offset: 960)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1478, file: !146, line: 2877, baseType: !1483, size: 64, offset: 1024)
!1483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1484, size: 64)
!1484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1485, line: 172, size: 128, elements: !1486)
!1485 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1486 = !{!1487, !1488, !1489, !1490, !1491, !1492, !1493}
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1484, file: !1485, line: 174, baseType: !11, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1484, file: !1485, line: 178, baseType: !11, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1484, file: !1485, line: 183, baseType: !11, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1484, file: !1485, line: 187, baseType: !11, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1484, file: !1485, line: 192, baseType: !11, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1484, file: !1485, line: 195, baseType: !11, size: 32, offset: 32)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1484, file: !1485, line: 199, baseType: !787, size: 64, offset: 64)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !790, file: !146, line: 3386, baseType: !1453, size: 1216)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !790, file: !146, line: 3387, baseType: !1496, size: 1280)
!1496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !146, line: 3093, size: 1280, elements: !1497)
!1497 = !{!1498, !1499}
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1496, file: !146, line: 3094, baseType: !1453, size: 1216)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1496, file: !146, line: 3095, baseType: !1483, size: 64, offset: 1216)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !790, file: !146, line: 3388, baseType: !1501, size: 1216)
!1501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !146, line: 2824, size: 1216, elements: !1502)
!1502 = !{!1503, !1504, !1505, !1506, !1507, !1508}
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1501, file: !146, line: 2825, baseType: !920, size: 896)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1501, file: !146, line: 2827, baseType: !787, size: 64, offset: 896)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1501, file: !146, line: 2828, baseType: !787, size: 64, offset: 960)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1501, file: !146, line: 2829, baseType: !787, size: 64, offset: 1024)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1501, file: !146, line: 2830, baseType: !787, size: 64, offset: 1088)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1501, file: !146, line: 2831, baseType: !787, size: 64, offset: 1152)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !790, file: !146, line: 3389, baseType: !1510, size: 1024)
!1510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !146, line: 2850, size: 1024, elements: !1511)
!1511 = !{!1512, !1513, !1514}
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1510, file: !146, line: 2851, baseType: !958, size: 960)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1510, file: !146, line: 2852, baseType: !6, size: 32, offset: 960)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1510, file: !146, line: 2853, baseType: !6, size: 32, offset: 992)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !790, file: !146, line: 3390, baseType: !1516, size: 1024)
!1516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !146, line: 2857, size: 1024, elements: !1517)
!1517 = !{!1518, !1519}
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1516, file: !146, line: 2858, baseType: !958, size: 960)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1516, file: !146, line: 2859, baseType: !1483, size: 64, offset: 960)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !790, file: !146, line: 3391, baseType: !1521, size: 960)
!1521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !146, line: 2862, size: 960, elements: !1522)
!1522 = !{!1523}
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1521, file: !146, line: 2863, baseType: !958, size: 960)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !790, file: !146, line: 3392, baseType: !1525, size: 1472)
!1525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !146, line: 3304, size: 1472, elements: !1526)
!1526 = !{!1527}
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1525, file: !146, line: 3305, baseType: !1450, size: 1472)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !790, file: !146, line: 3393, baseType: !1529, size: 1792)
!1529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !146, line: 3248, size: 1792, elements: !1530)
!1530 = !{!1531, !1532, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761}
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1529, file: !146, line: 3249, baseType: !1450, size: 1472)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1529, file: !146, line: 3251, baseType: !1533, size: 64, offset: 1472)
!1533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1534, size: 64)
