; ModuleID = 'explow.bc'
source_filename = "explow.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.rtx_def = type { i32, %union.u }
%union.u = type { %struct.block_symbol }
%struct.block_symbol = type { [3 x %union.rtunion_def], %struct.object_block*, i64 }
%union.rtunion_def = type { i8* }
%struct.object_block = type { %union.section*, i32, i64, %struct.VEC_rtx_gc*, %struct.VEC_rtx_gc* }
%union.section = type { %struct.unnamed_section }
%struct.unnamed_section = type { %struct.section_common, void (i8*)*, i8*, %union.section* }
%struct.section_common = type { i32 }
%struct.VEC_rtx_gc = type { %struct.VEC_rtx_base }
%struct.VEC_rtx_base = type { i32, i32, [1 x %struct.rtx_def*] }
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }

!501 = !DIEnumerator(name: "FLOAT", value: 103, isUnsigned: true)
!502 = !DIEnumerator(name: "FIX", value: 104, isUnsigned: true)
!503 = !DIEnumerator(name: "UNSIGNED_FLOAT", value: 105, isUnsigned: true)
!504 = !DIEnumerator(name: "UNSIGNED_FIX", value: 106, isUnsigned: true)
!505 = !DIEnumerator(name: "FRACT_CONVERT", value: 107, isUnsigned: true)
!506 = !DIEnumerator(name: "UNSIGNED_FRACT_CONVERT", value: 108, isUnsigned: true)
!507 = !DIEnumerator(name: "SAT_FRACT", value: 109, isUnsigned: true)
!508 = !DIEnumerator(name: "UNSIGNED_SAT_FRACT", value: 110, isUnsigned: true)
!509 = !DIEnumerator(name: "ABS", value: 111, isUnsigned: true)
!510 = !DIEnumerator(name: "SQRT", value: 112, isUnsigned: true)
!511 = !DIEnumerator(name: "BSWAP", value: 113, isUnsigned: true)
!512 = !DIEnumerator(name: "FFS", value: 114, isUnsigned: true)
!513 = !DIEnumerator(name: "CLZ", value: 115, isUnsigned: true)
!514 = !DIEnumerator(name: "CTZ", value: 116, isUnsigned: true)
!515 = !DIEnumerator(name: "POPCOUNT", value: 117, isUnsigned: true)
!516 = !DIEnumerator(name: "PARITY", value: 118, isUnsigned: true)
!517 = !DIEnumerator(name: "SIGN_EXTRACT", value: 119, isUnsigned: true)
!518 = !DIEnumerator(name: "ZERO_EXTRACT", value: 120, isUnsigned: true)
!519 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!520 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!521 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!522 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!523 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!524 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!525 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!526 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!527 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!528 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!529 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!530 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!531 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!532 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!533 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!534 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!535 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!536 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!537 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!538 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tls_model", file: !539, line: 97, baseType: !7, size: 32, elements: !540)
!539 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!540 = !{!541, !542, !543, !544, !545, !546, !547}
!541 = !DIEnumerator(name: "TLS_MODEL_NONE", value: 0, isUnsigned: true)
!542 = !DIEnumerator(name: "TLS_MODEL_EMULATED", value: 1, isUnsigned: true)
!543 = !DIEnumerator(name: "TLS_MODEL_REAL", value: 2, isUnsigned: true)
!544 = !DIEnumerator(name: "TLS_MODEL_GLOBAL_DYNAMIC", value: 2, isUnsigned: true)
!545 = !DIEnumerator(name: "TLS_MODEL_LOCAL_DYNAMIC", value: 3, isUnsigned: true)
!546 = !DIEnumerator(name: "TLS_MODEL_INITIAL_EXEC", value: 4, isUnsigned: true)
!547 = !DIEnumerator(name: "TLS_MODEL_LOCAL_EXEC", value: 5, isUnsigned: true)
!548 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "save_level", file: !549, line: 769, baseType: !7, size: 32, elements: !550)
!549 = !DIFile(filename: "./expr.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!550 = !{!551, !552, !553}
!551 = !DIEnumerator(name: "SAVE_BLOCK", value: 0, isUnsigned: true)
!552 = !DIEnumerator(name: "SAVE_FUNCTION", value: 1, isUnsigned: true)
!553 = !DIEnumerator(name: "SAVE_NONLOCAL", value: 2, isUnsigned: true)
!554 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "expand_modifier", file: !549, line: 52, baseType: !7, size: 32, elements: !555)
!555 = !{!556, !557, !558, !559, !560, !561, !562}
!556 = !DIEnumerator(name: "EXPAND_NORMAL", value: 0, isUnsigned: true)
!557 = !DIEnumerator(name: "EXPAND_STACK_PARM", value: 1, isUnsigned: true)
!558 = !DIEnumerator(name: "EXPAND_SUM", value: 2, isUnsigned: true)
!559 = !DIEnumerator(name: "EXPAND_CONST_ADDRESS", value: 3, isUnsigned: true)
!560 = !DIEnumerator(name: "EXPAND_INITIALIZER", value: 4, isUnsigned: true)
!561 = !DIEnumerator(name: "EXPAND_WRITE", value: 5, isUnsigned: true)
!562 = !DIEnumerator(name: "EXPAND_MEMORY", value: 6, isUnsigned: true)
!563 = !{!564, !565, !566, !567, !570, !571, !573, !134, !395, !5, !201, !574, !538, !630}
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!566 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !569)
!573 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !539, line: 50, baseType: !575)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !396, line: 240, size: 384, elements: !577)
!577 = !{!578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !576, file: !396, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !576, file: !396, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !576, file: !396, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !576, file: !396, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !576, file: !396, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !576, file: !396, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !576, file: !396, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !576, file: !396, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !576, file: !396, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !576, file: !396, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !576, file: !396, line: 321, baseType: !589, size: 320, offset: 64)
!589 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !396, line: 315, size: 320, elements: !590)
!590 = !{!591, !1525, !1527, !1588, !1589}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !589, file: !396, line: 316, baseType: !592, size: 64)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !593, size: 64, elements: !608)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !396, line: 183, baseType: !594)
!594 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !396, line: 166, size: 64, elements: !595)
!595 = !{!596, !597, !598, !599, !600, !610, !611, !623, !626, !629, !1501, !1504, !1515, !1522}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !594, file: !396, line: 168, baseType: !566, size: 32)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !594, file: !396, line: 169, baseType: !7, size: 32)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !594, file: !396, line: 170, baseType: !571, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !594, file: !396, line: 171, baseType: !574, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !594, file: !396, line: 172, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !539, line: 53, baseType: !602)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !396, line: 359, size: 128, elements: !604)
!604 = !{!605, !606}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !603, file: !396, line: 360, baseType: !566, size: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !603, file: !396, line: 361, baseType: !607, size: 64, offset: 64)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !574, size: 64, elements: !608)
!608 = !{!609}
!609 = !DISubrange(count: 1)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !594, file: !396, line: 173, baseType: !5, size: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !594, file: !396, line: 174, baseType: !612, size: 32)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !396, line: 133, baseType: !613)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !396, line: 115, size: 32, elements: !614)
!614 = !{!615, !616, !617, !618, !619, !620, !621, !622}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !613, file: !396, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !613, file: !396, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !613, file: !396, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !613, file: !396, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !613, file: !396, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !613, file: !396, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !613, file: !396, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !613, file: !396, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !594, file: !396, line: 175, baseType: !624, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !396, line: 175, flags: DIFlagFwdDecl)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !594, file: !396, line: 176, baseType: !627, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !539, line: 46, flags: DIFlagFwdDecl)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !594, file: !396, line: 177, baseType: !630, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !539, line: 56, baseType: !631)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !169, line: 3371, size: 1792, elements: !633)
!633 = !{!634, !667, !673, !686, !705, !716, !721, !728, !734, !747, !759, !797, !802, !830, !838, !839, !844, !853, !859, !864, !868, !872, !1136, !1185, !1191, !1197, !1204, !1230, !1244, !1261, !1273, !1295, !1311, !1483}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !632, file: !169, line: 3372, baseType: !635, size: 64)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !169, line: 360, size: 64, elements: !636)
!636 = !{!637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !635, file: !169, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !635, file: !169, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !635, file: !169, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !635, file: !169, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !635, file: !169, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !635, file: !169, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !635, file: !169, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !635, file: !169, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !635, file: !169, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !635, file: !169, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !635, file: !169, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !635, file: !169, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !635, file: !169, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !635, file: !169, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !635, file: !169, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !635, file: !169, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !635, file: !169, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !635, file: !169, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !635, file: !169, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !635, file: !169, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !635, file: !169, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !635, file: !169, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !635, file: !169, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !635, file: !169, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !635, file: !169, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !635, file: !169, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !635, file: !169, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !635, file: !169, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !635, file: !169, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !635, file: !169, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !632, file: !169, line: 3373, baseType: !668, size: 192)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !169, line: 402, size: 192, elements: !669)
!669 = !{!670, !671, !672}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !668, file: !169, line: 403, baseType: !635, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !668, file: !169, line: 404, baseType: !630, size: 64, offset: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !668, file: !169, line: 405, baseType: !630, size: 64, offset: 128)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !632, file: !169, line: 3374, baseType: !674, size: 320)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !169, line: 1384, size: 320, elements: !675)
!675 = !{!676, !677}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !674, file: !169, line: 1385, baseType: !668, size: 192)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !674, file: !169, line: 1386, baseType: !678, size: 128, offset: 192)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !679, line: 58, baseType: !680)
!679 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !679, line: 54, size: 128, elements: !681)
!681 = !{!682, !684}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !680, file: !679, line: 56, baseType: !683, size: 64)
!683 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !680, file: !679, line: 57, baseType: !685, size: 64, offset: 64)
!685 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !632, file: !169, line: 3375, baseType: !687, size: 256)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !169, line: 1397, size: 256, elements: !688)
!688 = !{!689, !690}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !687, file: !169, line: 1398, baseType: !668, size: 192)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !687, file: !169, line: 1399, baseType: !691, size: 64, offset: 192)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !693, line: 52, size: 256, elements: !694)
!693 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!694 = !{!695, !696, !697, !698, !699, !700, !701}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !692, file: !693, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !692, file: !693, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !692, file: !693, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !692, file: !693, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !692, file: !693, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !692, file: !693, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !692, file: !693, line: 62, baseType: !702, size: 192, offset: 64)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !683, size: 192, elements: !703)
!703 = !{!704}
!704 = !DISubrange(count: 3)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !632, file: !169, line: 3376, baseType: !706, size: 256)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !169, line: 1408, size: 256, elements: !707)
!707 = !{!708, !709}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !706, file: !169, line: 1409, baseType: !668, size: 192)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !706, file: !169, line: 1410, baseType: !710, size: 64, offset: 192)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !712, line: 27, size: 192, elements: !713)
!712 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!713 = !{!714, !715}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !711, file: !712, line: 29, baseType: !678, size: 128)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !711, file: !712, line: 30, baseType: !5, size: 32, offset: 128)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !632, file: !169, line: 3377, baseType: !717, size: 256)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !169, line: 1437, size: 256, elements: !718)
!718 = !{!719, !720}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !717, file: !169, line: 1438, baseType: !668, size: 192)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !717, file: !169, line: 1439, baseType: !630, size: 64, offset: 192)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !632, file: !169, line: 3378, baseType: !722, size: 256)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !169, line: 1418, size: 256, elements: !723)
!723 = !{!724, !725, !726}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !722, file: !169, line: 1419, baseType: !668, size: 192)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !722, file: !169, line: 1420, baseType: !566, size: 32, offset: 192)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !722, file: !169, line: 1421, baseType: !727, size: 8, offset: 224)
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 8, elements: !608)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !632, file: !169, line: 3379, baseType: !729, size: 320)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !169, line: 1428, size: 320, elements: !730)
!730 = !{!731, !732, !733}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !729, file: !169, line: 1429, baseType: !668, size: 192)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !729, file: !169, line: 1430, baseType: !630, size: 64, offset: 192)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !729, file: !169, line: 1431, baseType: !630, size: 64, offset: 256)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !632, file: !169, line: 3380, baseType: !735, size: 320)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !169, line: 1460, size: 320, elements: !736)
!736 = !{!737, !738}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !735, file: !169, line: 1461, baseType: !668, size: 192)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !735, file: !169, line: 1462, baseType: !739, size: 128, offset: 192)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !740, line: 31, size: 128, elements: !741)
!740 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!741 = !{!742, !745, !746}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !739, file: !740, line: 32, baseType: !743, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !565)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !739, file: !740, line: 33, baseType: !7, size: 32, offset: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !739, file: !740, line: 34, baseType: !7, size: 32, offset: 96)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !632, file: !169, line: 3381, baseType: !748, size: 384)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !169, line: 2507, size: 384, elements: !749)
!749 = !{!750, !751, !756, !757, !758}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !748, file: !169, line: 2508, baseType: !668, size: 192)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !748, file: !169, line: 2509, baseType: !752, size: 32, offset: 192)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !753, line: 58, baseType: !754)
!753 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !755, line: 44, baseType: !7)
!755 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!756 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !748, file: !169, line: 2510, baseType: !7, size: 32, offset: 224)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !748, file: !169, line: 2511, baseType: !630, size: 64, offset: 256)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !748, file: !169, line: 2512, baseType: !630, size: 64, offset: 320)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !632, file: !169, line: 3382, baseType: !760, size: 896)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !169, line: 2652, size: 896, elements: !761)
!761 = !{!762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !760, file: !169, line: 2653, baseType: !748, size: 384)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !760, file: !169, line: 2654, baseType: !630, size: 64, offset: 384)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !760, file: !169, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !760, file: !169, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !760, file: !169, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !760, file: !169, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !760, file: !169, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !760, file: !169, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !760, file: !169, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !760, file: !169, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !760, file: !169, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !760, file: !169, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !760, file: !169, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !760, file: !169, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !760, file: !169, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !760, file: !169, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !760, file: !169, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !760, file: !169, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !760, file: !169, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !760, file: !169, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !760, file: !169, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !760, file: !169, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !760, file: !169, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !760, file: !169, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !760, file: !169, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !760, file: !169, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !760, file: !169, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !760, file: !169, line: 2703, baseType: !7, size: 32, offset: 512)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !760, file: !169, line: 2705, baseType: !630, size: 64, offset: 576)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !760, file: !169, line: 2706, baseType: !630, size: 64, offset: 640)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !760, file: !169, line: 2707, baseType: !630, size: 64, offset: 704)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !760, file: !169, line: 2708, baseType: !630, size: 64, offset: 768)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !760, file: !169, line: 2711, baseType: !795, size: 64, offset: 832)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !169, line: 2711, flags: DIFlagFwdDecl)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !632, file: !169, line: 3383, baseType: !798, size: 960)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !169, line: 2756, size: 960, elements: !799)
!799 = !{!800, !801}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !798, file: !169, line: 2757, baseType: !760, size: 896)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !798, file: !169, line: 2758, baseType: !574, size: 64, offset: 896)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !632, file: !169, line: 3384, baseType: !803, size: 1472)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !169, line: 3114, size: 1472, elements: !804)
!804 = !{!805, !826, !827, !828, !829}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !803, file: !169, line: 3115, baseType: !806, size: 1216)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !169, line: 2984, size: 1216, elements: !807)
!807 = !{!808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !806, file: !169, line: 2985, baseType: !798, size: 960)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !806, file: !169, line: 2986, baseType: !630, size: 64, offset: 960)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !806, file: !169, line: 2987, baseType: !630, size: 64, offset: 1024)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !806, file: !169, line: 2988, baseType: !630, size: 64, offset: 1088)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !806, file: !169, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !806, file: !169, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !806, file: !169, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !806, file: !169, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !806, file: !169, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !806, file: !169, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !806, file: !169, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !806, file: !169, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !806, file: !169, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !806, file: !169, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !806, file: !169, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !806, file: !169, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !806, file: !169, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !806, file: !169, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !803, file: !169, line: 3117, baseType: !630, size: 64, offset: 1216)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !803, file: !169, line: 3119, baseType: !630, size: 64, offset: 1280)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !803, file: !169, line: 3121, baseType: !630, size: 64, offset: 1344)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !803, file: !169, line: 3123, baseType: !630, size: 64, offset: 1408)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !632, file: !169, line: 3385, baseType: !831, size: 1088)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !169, line: 2874, size: 1088, elements: !832)
!832 = !{!833, !834, !835}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !831, file: !169, line: 2875, baseType: !798, size: 960)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !831, file: !169, line: 2876, baseType: !574, size: 64, offset: 960)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !831, file: !169, line: 2877, baseType: !836, size: 64, offset: 1024)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !169, line: 2856, flags: DIFlagFwdDecl)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !632, file: !169, line: 3386, baseType: !806, size: 1216)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !632, file: !169, line: 3387, baseType: !840, size: 1280)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !169, line: 3093, size: 1280, elements: !841)
!841 = !{!842, !843}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !840, file: !169, line: 3094, baseType: !806, size: 1216)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !840, file: !169, line: 3095, baseType: !836, size: 64, offset: 1216)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !632, file: !169, line: 3388, baseType: !845, size: 1216)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !169, line: 2824, size: 1216, elements: !846)
!846 = !{!847, !848, !849, !850, !851, !852}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !845, file: !169, line: 2825, baseType: !760, size: 896)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !845, file: !169, line: 2827, baseType: !630, size: 64, offset: 896)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !845, file: !169, line: 2828, baseType: !630, size: 64, offset: 960)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !845, file: !169, line: 2829, baseType: !630, size: 64, offset: 1024)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !845, file: !169, line: 2830, baseType: !630, size: 64, offset: 1088)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !845, file: !169, line: 2831, baseType: !630, size: 64, offset: 1152)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !632, file: !169, line: 3389, baseType: !854, size: 1024)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !169, line: 2850, size: 1024, elements: !855)
!855 = !{!856, !857, !858}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !854, file: !169, line: 2851, baseType: !798, size: 960)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !854, file: !169, line: 2852, baseType: !566, size: 32, offset: 960)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !854, file: !169, line: 2853, baseType: !566, size: 32, offset: 992)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !632, file: !169, line: 3390, baseType: !860, size: 1024)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !169, line: 2857, size: 1024, elements: !861)
!861 = !{!862, !863}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !860, file: !169, line: 2858, baseType: !798, size: 960)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !860, file: !169, line: 2859, baseType: !836, size: 64, offset: 960)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !632, file: !169, line: 3391, baseType: !865, size: 960)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !169, line: 2862, size: 960, elements: !866)
!866 = !{!867}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !865, file: !169, line: 2863, baseType: !798, size: 960)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !632, file: !169, line: 3392, baseType: !869, size: 1472)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !169, line: 3304, size: 1472, elements: !870)
!870 = !{!871}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !869, file: !169, line: 3305, baseType: !803, size: 1472)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !632, file: !169, line: 3393, baseType: !873, size: 1792)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !169, line: 3248, size: 1792, elements: !874)
!874 = !{!875, !876, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !873, file: !169, line: 3249, baseType: !803, size: 1472)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !873, file: !169, line: 3251, baseType: !877, size: 64, offset: 1472)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !879, line: 463, size: 1152, elements: !880)
!879 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!880 = !{!881, !1045, !1048, !1051, !1054, !1057, !1058, !1059, !1060, !1061, !1062, !1088, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !878, file: !879, line: 464, baseType: !882, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !157, line: 194, size: 384, elements: !884)
!884 = !{!885, !934, !947, !961, !1013, !1026}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !883, file: !157, line: 197, baseType: !886, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !157, line: 182, baseType: !887)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !157, line: 116, size: 704, elements: !889)
!889 = !{!890, !891, !892, !893, !894, !895, !922, !931, !932, !933}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !888, file: !157, line: 119, baseType: !887, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !888, file: !157, line: 122, baseType: !887, size: 64, offset: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !888, file: !157, line: 123, baseType: !887, size: 64, offset: 128)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !888, file: !157, line: 126, baseType: !566, size: 32, offset: 192)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !888, file: !157, line: 129, baseType: !156, size: 32, offset: 224)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !888, file: !157, line: 165, baseType: !896, size: 192, offset: 256)
!896 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !157, line: 132, size: 192, elements: !897)
!897 = !{!898, !911, !917}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !896, file: !157, line: 137, baseType: !899, size: 128)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !157, line: 133, size: 128, elements: !900)
!900 = !{!901, !910}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !899, file: !157, line: 135, baseType: !902, size: 64)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !157, line: 93, size: 320, elements: !904)
!904 = !{!905, !906, !907, !908, !909}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !903, file: !157, line: 96, baseType: !902, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !903, file: !157, line: 97, baseType: !902, size: 64, offset: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !903, file: !157, line: 101, baseType: !630, size: 64, offset: 128)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !903, file: !157, line: 106, baseType: !630, size: 64, offset: 192)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !903, file: !157, line: 111, baseType: !630, size: 64, offset: 256)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !899, file: !157, line: 136, baseType: !902, size: 64, offset: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !896, file: !157, line: 151, baseType: !912, size: 192)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !157, line: 139, size: 192, elements: !913)
!913 = !{!914, !915, !916}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !912, file: !157, line: 141, baseType: !630, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !912, file: !157, line: 145, baseType: !630, size: 64, offset: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !912, file: !157, line: 150, baseType: !566, size: 32, offset: 128)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !896, file: !157, line: 164, baseType: !918, size: 128)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !157, line: 153, size: 128, elements: !919)
!919 = !{!920, !921}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !918, file: !157, line: 161, baseType: !630, size: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !918, file: !157, line: 163, baseType: !752, size: 32, offset: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !888, file: !157, line: 168, baseType: !923, size: 64, offset: 448)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !157, line: 67, size: 320, elements: !925)
!925 = !{!926, !927, !928, !929, !930}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !924, file: !157, line: 70, baseType: !923, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !924, file: !157, line: 73, baseType: !887, size: 64, offset: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !924, file: !157, line: 78, baseType: !630, size: 64, offset: 128)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !924, file: !157, line: 85, baseType: !574, size: 64, offset: 192)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !924, file: !157, line: 88, baseType: !566, size: 32, offset: 256)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !888, file: !157, line: 173, baseType: !574, size: 64, offset: 512)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !888, file: !157, line: 173, baseType: !574, size: 64, offset: 576)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !888, file: !157, line: 177, baseType: !565, size: 8, offset: 640)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !883, file: !157, line: 200, baseType: !935, size: 64, offset: 64)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !157, line: 185, baseType: !937)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !157, line: 185, size: 128, elements: !938)
!938 = !{!939}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !937, file: !157, line: 185, baseType: !940, size: 128)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !157, line: 184, baseType: !941)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !157, line: 184, size: 128, elements: !942)
!942 = !{!943, !944, !945}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !941, file: !157, line: 184, baseType: !7, size: 32)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !941, file: !157, line: 184, baseType: !7, size: 32, offset: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !941, file: !157, line: 184, baseType: !946, size: 64, offset: 64)
!946 = !DICompositeType(tag: DW_TAG_array_type, baseType: !886, size: 64, elements: !608)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !883, file: !157, line: 203, baseType: !948, size: 64, offset: 128)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !157, line: 189, baseType: !950)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !157, line: 189, size: 128, elements: !951)
!951 = !{!952}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !950, file: !157, line: 189, baseType: !953, size: 128)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !157, line: 188, baseType: !954)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !157, line: 188, size: 128, elements: !955)
!955 = !{!956, !957, !958}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !954, file: !157, line: 188, baseType: !7, size: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !954, file: !157, line: 188, baseType: !7, size: 32, offset: 32)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !954, file: !157, line: 188, baseType: !959, size: 64, offset: 64)
!959 = !DICompositeType(tag: DW_TAG_array_type, baseType: !960, size: 64, elements: !608)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !157, line: 180, baseType: !923)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !883, file: !157, line: 207, baseType: !962, size: 64, offset: 192)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !963, line: 144, baseType: !964)
!963 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !963, line: 100, size: 896, elements: !966)
!966 = !{!967, !975, !980, !985, !987, !990, !991, !992, !993, !994, !999, !1001, !1002, !1007, !1012}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !965, file: !963, line: 102, baseType: !968, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !963, line: 52, baseType: !969)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DISubroutineType(types: !971)
!971 = !{!972, !973}
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !963, line: 47, baseType: !7)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !965, file: !963, line: 105, baseType: !976, size: 64, offset: 64)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !963, line: 59, baseType: !977)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DISubroutineType(types: !979)
!979 = !{!566, !973, !973}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !965, file: !963, line: 108, baseType: !981, size: 64, offset: 128)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !963, line: 63, baseType: !982)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DISubroutineType(types: !984)
!984 = !{null, !570}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !965, file: !963, line: 111, baseType: !986, size: 64, offset: 192)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !965, file: !963, line: 114, baseType: !988, size: 64, offset: 256)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !989, line: 46, baseType: !683)
!989 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!990 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !965, file: !963, line: 117, baseType: !988, size: 64, offset: 320)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !965, file: !963, line: 120, baseType: !988, size: 64, offset: 384)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !965, file: !963, line: 124, baseType: !7, size: 32, offset: 448)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !965, file: !963, line: 128, baseType: !7, size: 32, offset: 480)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !965, file: !963, line: 131, baseType: !995, size: 64, offset: 512)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !963, line: 75, baseType: !996)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DISubroutineType(types: !998)
!998 = !{!570, !988, !988}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !965, file: !963, line: 132, baseType: !1000, size: 64, offset: 576)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !963, line: 78, baseType: !982)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !965, file: !963, line: 135, baseType: !570, size: 64, offset: 640)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !965, file: !963, line: 136, baseType: !1003, size: 64, offset: 704)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !963, line: 82, baseType: !1004)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!570, !570, !988, !988}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !965, file: !963, line: 137, baseType: !1008, size: 64, offset: 768)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !963, line: 83, baseType: !1009)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{null, !570, !570}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !965, file: !963, line: 141, baseType: !7, size: 32, offset: 832)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !883, file: !157, line: 211, baseType: !1014, size: 64, offset: 256)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !169, line: 183, baseType: !1016)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !169, line: 183, size: 128, elements: !1017)
!1017 = !{!1018}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1016, file: !169, line: 183, baseType: !1019, size: 128)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !169, line: 182, baseType: !1020)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !169, line: 182, size: 128, elements: !1021)
!1021 = !{!1022, !1023, !1024}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1020, file: !169, line: 182, baseType: !7, size: 32)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1020, file: !169, line: 182, baseType: !7, size: 32, offset: 32)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1020, file: !169, line: 182, baseType: !1025, size: 64, offset: 64)
!1025 = !DICompositeType(tag: DW_TAG_array_type, baseType: !630, size: 64, elements: !608)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !883, file: !157, line: 220, baseType: !1027, size: 64, offset: 320)
!1027 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !157, line: 217, size: 64, elements: !1028)
!1028 = !{!1029, !1030}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !1027, file: !157, line: 218, baseType: !1014, size: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !1027, file: !157, line: 219, baseType: !1031, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !1033, line: 29, baseType: !1034)
!1033 = !DIFile(filename: "./vecprim.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !1033, line: 29, size: 96, elements: !1035)
!1035 = !{!1036}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1034, file: !1033, line: 29, baseType: !1037, size: 96)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !1033, line: 27, baseType: !1038)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !1033, line: 27, size: 96, elements: !1039)
!1039 = !{!1040, !1041, !1042}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1038, file: !1033, line: 27, baseType: !7, size: 32)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1038, file: !1033, line: 27, baseType: !7, size: 32, offset: 32)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1038, file: !1033, line: 27, baseType: !1043, size: 8, offset: 64)
!1043 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1044, size: 8, elements: !608)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !1033, line: 26, baseType: !565)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !878, file: !879, line: 467, baseType: !1046, size: 64, offset: 64)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !879, line: 467, flags: DIFlagFwdDecl)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !878, file: !879, line: 470, baseType: !1049, size: 64, offset: 128)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !539, line: 65, flags: DIFlagFwdDecl)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !878, file: !879, line: 473, baseType: !1052, size: 64, offset: 192)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !879, line: 166, flags: DIFlagFwdDecl)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !878, file: !879, line: 476, baseType: !1055, size: 64, offset: 256)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !879, line: 476, flags: DIFlagFwdDecl)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !878, file: !879, line: 479, baseType: !962, size: 64, offset: 320)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !878, file: !879, line: 484, baseType: !630, size: 64, offset: 384)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !878, file: !879, line: 488, baseType: !630, size: 64, offset: 448)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !878, file: !879, line: 493, baseType: !630, size: 64, offset: 512)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !878, file: !879, line: 496, baseType: !630, size: 64, offset: 576)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !878, file: !879, line: 501, baseType: !1063, size: 64, offset: 640)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !164, line: 2355, size: 576, elements: !1065)
!1065 = !{!1066, !1069, !1070, !1071, !1072, !1076, !1077, !1082, !1083, !1084, !1085, !1086, !1087}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1064, file: !164, line: 2356, baseType: !1067, size: 64)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !164, line: 2356, flags: DIFlagFwdDecl)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1064, file: !164, line: 2357, baseType: !571, size: 64, offset: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1064, file: !164, line: 2358, baseType: !566, size: 32, offset: 128)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1064, file: !164, line: 2359, baseType: !566, size: 32, offset: 160)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1064, file: !164, line: 2360, baseType: !1073, size: 128, offset: 192)
!1073 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 128, elements: !1074)
!1074 = !{!1075}
!1075 = !DISubrange(count: 4)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1064, file: !164, line: 2364, baseType: !566, size: 32, offset: 320)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1064, file: !164, line: 2367, baseType: !1078, size: 128, offset: 384)
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !164, line: 2349, size: 128, elements: !1079)
!1079 = !{!1080, !1081}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1078, file: !164, line: 2351, baseType: !574, size: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1078, file: !164, line: 2352, baseType: !685, size: 64, offset: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1064, file: !164, line: 2371, baseType: !163, size: 32, offset: 512)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1064, file: !164, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1064, file: !164, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1064, file: !164, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1064, file: !164, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1064, file: !164, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !878, file: !879, line: 504, baseType: !1089, size: 64, offset: 704)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !879, line: 504, flags: DIFlagFwdDecl)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !878, file: !879, line: 507, baseType: !962, size: 64, offset: 768)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !878, file: !879, line: 510, baseType: !566, size: 32, offset: 832)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !878, file: !879, line: 513, baseType: !566, size: 32, offset: 864)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !878, file: !879, line: 516, baseType: !752, size: 32, offset: 896)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !878, file: !879, line: 519, baseType: !752, size: 32, offset: 928)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !878, file: !879, line: 522, baseType: !7, size: 32, offset: 960)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !878, file: !879, line: 523, baseType: !7, size: 32, offset: 992)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !878, file: !879, line: 528, baseType: !571, size: 64, offset: 1024)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !878, file: !879, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !878, file: !879, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !878, file: !879, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !878, file: !879, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !878, file: !879, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !878, file: !879, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !878, file: !879, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !878, file: !879, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !878, file: !879, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !878, file: !879, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !878, file: !879, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !878, file: !879, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !878, file: !879, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !878, file: !879, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !878, file: !879, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !878, file: !879, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !873, file: !169, line: 3254, baseType: !630, size: 64, offset: 1536)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !873, file: !169, line: 3257, baseType: !630, size: 64, offset: 1600)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !873, file: !169, line: 3258, baseType: !630, size: 64, offset: 1664)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !873, file: !169, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !873, file: !169, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !873, file: !169, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !873, file: !169, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !873, file: !169, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !873, file: !169, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !873, file: !169, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !873, file: !169, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !873, file: !169, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !873, file: !169, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !873, file: !169, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !873, file: !169, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !873, file: !169, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !873, file: !169, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !873, file: !169, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !873, file: !169, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !873, file: !169, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !873, file: !169, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !632, file: !169, line: 3394, baseType: !1137, size: 1344)
!1137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !169, line: 2279, size: 1344, elements: !1138)
!1138 = !{!1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1164, !1165, !1166, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1137, file: !169, line: 2280, baseType: !668, size: 192)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1137, file: !169, line: 2281, baseType: !630, size: 64, offset: 192)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1137, file: !169, line: 2282, baseType: !630, size: 64, offset: 256)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1137, file: !169, line: 2283, baseType: !630, size: 64, offset: 320)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1137, file: !169, line: 2284, baseType: !630, size: 64, offset: 384)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1137, file: !169, line: 2285, baseType: !7, size: 32, offset: 448)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1137, file: !169, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1137, file: !169, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1137, file: !169, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1137, file: !169, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1137, file: !169, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1137, file: !169, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1137, file: !169, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1137, file: !169, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1137, file: !169, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1137, file: !169, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1137, file: !169, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1137, file: !169, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1137, file: !169, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1137, file: !169, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1137, file: !169, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1137, file: !169, line: 2305, baseType: !7, size: 32, offset: 512)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1137, file: !169, line: 2306, baseType: !1162, size: 32, offset: 544)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1163, line: 31, baseType: !566)
!1163 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1137, file: !169, line: 2307, baseType: !630, size: 64, offset: 576)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1137, file: !169, line: 2308, baseType: !630, size: 64, offset: 640)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1137, file: !169, line: 2314, baseType: !1167, size: 64, offset: 704)
!1167 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !169, line: 2309, size: 64, elements: !1168)
!1168 = !{!1169, !1170, !1171}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1167, file: !169, line: 2310, baseType: !566, size: 32)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1167, file: !169, line: 2311, baseType: !571, size: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1167, file: !169, line: 2312, baseType: !1172, size: 64)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64)
!1173 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !169, line: 2277, flags: DIFlagFwdDecl)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1137, file: !169, line: 2315, baseType: !630, size: 64, offset: 768)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1137, file: !169, line: 2316, baseType: !630, size: 64, offset: 832)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1137, file: !169, line: 2317, baseType: !630, size: 64, offset: 896)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1137, file: !169, line: 2318, baseType: !630, size: 64, offset: 960)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1137, file: !169, line: 2319, baseType: !630, size: 64, offset: 1024)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1137, file: !169, line: 2320, baseType: !630, size: 64, offset: 1088)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1137, file: !169, line: 2321, baseType: !630, size: 64, offset: 1152)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1137, file: !169, line: 2322, baseType: !630, size: 64, offset: 1216)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1137, file: !169, line: 2324, baseType: !1183, size: 64, offset: 1280)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64)
!1184 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !169, line: 2324, flags: DIFlagFwdDecl)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !632, file: !169, line: 3395, baseType: !1186, size: 320)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !169, line: 1469, size: 320, elements: !1187)
!1187 = !{!1188, !1189, !1190}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1186, file: !169, line: 1470, baseType: !668, size: 192)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1186, file: !169, line: 1471, baseType: !630, size: 64, offset: 192)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1186, file: !169, line: 1472, baseType: !630, size: 64, offset: 256)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !632, file: !169, line: 3396, baseType: !1192, size: 320)
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !169, line: 1482, size: 320, elements: !1193)
!1193 = !{!1194, !1195, !1196}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1192, file: !169, line: 1483, baseType: !668, size: 192)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1192, file: !169, line: 1484, baseType: !566, size: 32, offset: 192)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1192, file: !169, line: 1485, baseType: !1025, size: 64, offset: 256)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !632, file: !169, line: 3397, baseType: !1198, size: 384)
!1198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !169, line: 1829, size: 384, elements: !1199)
!1199 = !{!1200, !1201, !1202, !1203}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1198, file: !169, line: 1830, baseType: !668, size: 192)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1198, file: !169, line: 1831, baseType: !752, size: 32, offset: 192)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1198, file: !169, line: 1832, baseType: !630, size: 64, offset: 256)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1198, file: !169, line: 1835, baseType: !1025, size: 64, offset: 320)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !632, file: !169, line: 3398, baseType: !1205, size: 704)
!1205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !169, line: 1898, size: 704, elements: !1206)
!1206 = !{!1207, !1208, !1209, !1213, !1214, !1217}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1205, file: !169, line: 1899, baseType: !668, size: 192)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1205, file: !169, line: 1902, baseType: !630, size: 64, offset: 192)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1205, file: !169, line: 1905, baseType: !1210, size: 64, offset: 256)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !539, line: 58, baseType: !1211)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64)
!1212 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !539, line: 57, flags: DIFlagFwdDecl)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1205, file: !169, line: 1908, baseType: !7, size: 32, offset: 320)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1205, file: !169, line: 1911, baseType: !1215, size: 64, offset: 384)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64)
!1216 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !169, line: 1876, flags: DIFlagFwdDecl)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1205, file: !169, line: 1914, baseType: !1218, size: 256, offset: 448)
!1218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !169, line: 1883, size: 256, elements: !1219)
!1219 = !{!1220, !1222, !1223, !1228}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1218, file: !169, line: 1884, baseType: !1221, size: 64)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1218, file: !169, line: 1885, baseType: !1221, size: 64, offset: 64)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1218, file: !169, line: 1891, baseType: !1224, size: 64, offset: 128)
!1224 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1218, file: !169, line: 1891, size: 64, elements: !1225)
!1225 = !{!1226, !1227}
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1224, file: !169, line: 1891, baseType: !1210, size: 64)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1224, file: !169, line: 1891, baseType: !630, size: 64)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1218, file: !169, line: 1892, baseType: !1229, size: 64, offset: 192)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !632, file: !169, line: 3399, baseType: !1231, size: 704)
!1231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !169, line: 2008, size: 704, elements: !1232)
!1232 = !{!1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1231, file: !169, line: 2009, baseType: !668, size: 192)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1231, file: !169, line: 2011, baseType: !7, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !1231, file: !169, line: 2012, baseType: !7, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1231, file: !169, line: 2014, baseType: !752, size: 32, offset: 224)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1231, file: !169, line: 2016, baseType: !630, size: 64, offset: 256)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !1231, file: !169, line: 2017, baseType: !1014, size: 64, offset: 320)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !1231, file: !169, line: 2019, baseType: !630, size: 64, offset: 384)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !1231, file: !169, line: 2020, baseType: !630, size: 64, offset: 448)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1231, file: !169, line: 2021, baseType: !630, size: 64, offset: 512)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !1231, file: !169, line: 2022, baseType: !630, size: 64, offset: 576)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !1231, file: !169, line: 2023, baseType: !630, size: 64, offset: 640)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !632, file: !169, line: 3400, baseType: !1245, size: 832)
!1245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !169, line: 2430, size: 832, elements: !1246)
!1246 = !{!1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1245, file: !169, line: 2431, baseType: !668, size: 192)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1245, file: !169, line: 2433, baseType: !630, size: 64, offset: 192)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !1245, file: !169, line: 2434, baseType: !630, size: 64, offset: 256)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !1245, file: !169, line: 2435, baseType: !630, size: 64, offset: 320)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !1245, file: !169, line: 2436, baseType: !630, size: 64, offset: 384)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "base_accesses", scope: !1245, file: !169, line: 2437, baseType: !1014, size: 64, offset: 448)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "inheritance", scope: !1245, file: !169, line: 2438, baseType: !630, size: 64, offset: 512)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_subvtt", scope: !1245, file: !169, line: 2440, baseType: !630, size: 64, offset: 576)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_vptr", scope: !1245, file: !169, line: 2441, baseType: !630, size: 64, offset: 640)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "base_binfos", scope: !1245, file: !169, line: 2443, baseType: !1257, size: 128, offset: 704)
!1257 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_none", file: !169, line: 182, baseType: !1258)
!1258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_none", file: !169, line: 182, size: 128, elements: !1259)
!1259 = !{!1260}
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1258, file: !169, line: 182, baseType: !1019, size: 128)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "stmt_list", scope: !632, file: !169, line: 3401, baseType: !1262, size: 320)
!1262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list", file: !169, line: 3327, size: 320, elements: !1263)
!1263 = !{!1264, !1265, !1272}
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1262, file: !169, line: 3329, baseType: !668, size: 192)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1262, file: !169, line: 3330, baseType: !1266, size: 64, offset: 192)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64)
!1267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list_node", file: !169, line: 3320, size: 192, elements: !1268)
!1268 = !{!1269, !1270, !1271}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1267, file: !169, line: 3322, baseType: !1266, size: 64)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1267, file: !169, line: 3323, baseType: !1266, size: 64, offset: 64)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1267, file: !169, line: 3324, baseType: !630, size: 64, offset: 128)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1262, file: !169, line: 3331, baseType: !1266, size: 64, offset: 256)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "constructor", scope: !632, file: !169, line: 3402, baseType: !1274, size: 256)
!1274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_constructor", file: !169, line: 1540, size: 256, elements: !1275)
!1275 = !{!1276, !1277}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1274, file: !169, line: 1541, baseType: !668, size: 192)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !1274, file: !169, line: 1542, baseType: !1278, size: 64, offset: 192)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64)
!1279 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_gc", file: !169, line: 1538, baseType: !1280)
!1280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_gc", file: !169, line: 1538, size: 192, elements: !1281)
!1281 = !{!1282}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1280, file: !169, line: 1538, baseType: !1283, size: 192)
!1283 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_base", file: !169, line: 1537, baseType: !1284)
!1284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_base", file: !169, line: 1537, size: 192, elements: !1285)
!1285 = !{!1286, !1287, !1288}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1284, file: !169, line: 1537, baseType: !7, size: 32)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1284, file: !169, line: 1537, baseType: !7, size: 32, offset: 32)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1284, file: !169, line: 1537, baseType: !1289, size: 128, offset: 64)
!1289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1290, size: 128, elements: !608)
!1290 = !DIDerivedType(tag: DW_TAG_typedef, name: "constructor_elt", file: !169, line: 1535, baseType: !1291)
!1291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "constructor_elt_d", file: !169, line: 1532, size: 128, elements: !1292)
!1292 = !{!1293, !1294}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1291, file: !169, line: 1533, baseType: !630, size: 64)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1291, file: !169, line: 1534, baseType: !630, size: 64, offset: 64)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "omp_clause", scope: !632, file: !169, line: 3403, baseType: !1296, size: 512)
!1296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_omp_clause", file: !169, line: 1938, size: 512, elements: !1297)
!1297 = !{!1298, !1299, !1300, !1301, !1307, !1309, !1310}
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1296, file: !169, line: 1939, baseType: !668, size: 192)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1296, file: !169, line: 1940, baseType: !752, size: 32, offset: 192)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1296, file: !169, line: 1941, baseType: !168, size: 32, offset: 224)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !1296, file: !169, line: 1946, baseType: !1302, size: 32, offset: 256)
!1302 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "omp_clause_subcode", file: !169, line: 1942, size: 32, elements: !1303)
!1303 = !{!1304, !1305, !1306}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "default_kind", scope: !1302, file: !169, line: 1943, baseType: !187, size: 32)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "schedule_kind", scope: !1302, file: !169, line: 1944, baseType: !194, size: 32)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "reduction_code", scope: !1302, file: !169, line: 1945, baseType: !201, size: 32)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reduction_init", scope: !1296, file: !169, line: 1950, baseType: !1308, size: 64, offset: 320)
!1308 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !539, line: 66, baseType: !1049)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reduction_merge", scope: !1296, file: !169, line: 1951, baseType: !1308, size: 64, offset: 384)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1296, file: !169, line: 1953, baseType: !1025, size: 64, offset: 448)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "optimization", scope: !632, file: !169, line: 3404, baseType: !1312, size: 1664)
!1312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_optimization_option", file: !169, line: 3337, size: 1664, elements: !1313)
