; ModuleID = 'expmed.bc'
source_filename = "expmed.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.rtl_data = type { %struct.expr_status, %struct.emit_status, %struct.varasm_status, %struct.incoming_args, %struct.function_subsections, %struct.rtl_eh, i32, %struct.rtx_def*, %struct.initial_value_struct*, %union.tree_node*, %struct.rtx_def*, %struct.rtx_def*, %struct.rtx_def*, %struct.rtx_def*, %struct.rtx_def*, %struct.rtx_def*, %struct.rtx_def*, i64, %struct.rtx_def*, %struct.VEC_temp_slot_p_gc*, %struct.temp_slot*, i32, i32, i32, i32, i32, i32, %struct.rtx_def*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.expr_status = type { i32, i32, i32, %struct.rtx_def*, %struct.rtx_def*, %struct.rtx_def* }
%struct.emit_status = type { i32, i32, %struct.rtx_def*, %struct.rtx_def*, %struct.sequence_stack*, i32, i32, i32, i32, i8* }
%struct.sequence_stack = type { %struct.rtx_def*, %struct.rtx_def*, %struct.sequence_stack* }
%struct.varasm_status = type { %struct.rtx_constant_pool*, i32 }

!2013 = !DIEnumerator(name: "CODE_FOR_avx_vzeroall", value: 2924, isUnsigned: true)
!2014 = !DIEnumerator(name: "CODE_FOR_avx_vzeroupper", value: 2925, isUnsigned: true)
!2015 = !DIEnumerator(name: "CODE_FOR_avx_vpermilv2df", value: 2932, isUnsigned: true)
!2016 = !DIEnumerator(name: "CODE_FOR_avx_vpermilv4df", value: 2933, isUnsigned: true)
!2017 = !DIEnumerator(name: "CODE_FOR_avx_vpermilv4sf", value: 2934, isUnsigned: true)
!2018 = !DIEnumerator(name: "CODE_FOR_avx_vpermilv8sf", value: 2935, isUnsigned: true)
!2019 = !DIEnumerator(name: "CODE_FOR_avx_vperm2f128v8si3", value: 2936, isUnsigned: true)
!2020 = !DIEnumerator(name: "CODE_FOR_avx_vperm2f128v8sf3", value: 2937, isUnsigned: true)
!2021 = !DIEnumerator(name: "CODE_FOR_avx_vperm2f128v4df3", value: 2938, isUnsigned: true)
!2022 = !DIEnumerator(name: "CODE_FOR_avx_vinsertf128v32qi", value: 2939, isUnsigned: true)
!2023 = !DIEnumerator(name: "CODE_FOR_avx_vinsertf128v16hi", value: 2940, isUnsigned: true)
!2024 = !DIEnumerator(name: "CODE_FOR_avx_vinsertf128v8si", value: 2941, isUnsigned: true)
!2025 = !DIEnumerator(name: "CODE_FOR_avx_vinsertf128v4di", value: 2942, isUnsigned: true)
!2026 = !DIEnumerator(name: "CODE_FOR_avx_vinsertf128v8sf", value: 2943, isUnsigned: true)
!2027 = !DIEnumerator(name: "CODE_FOR_avx_vinsertf128v4df", value: 2944, isUnsigned: true)
!2028 = !DIEnumerator(name: "CODE_FOR_vec_initv32qi", value: 2945, isUnsigned: true)
!2029 = !DIEnumerator(name: "CODE_FOR_vec_initv16hi", value: 2946, isUnsigned: true)
!2030 = !DIEnumerator(name: "CODE_FOR_vec_initv8si", value: 2947, isUnsigned: true)
!2031 = !DIEnumerator(name: "CODE_FOR_vec_initv4di", value: 2948, isUnsigned: true)
!2032 = !DIEnumerator(name: "CODE_FOR_vec_initv8sf", value: 2949, isUnsigned: true)
!2033 = !DIEnumerator(name: "CODE_FOR_vec_initv4df", value: 2950, isUnsigned: true)
!2034 = !DIEnumerator(name: "CODE_FOR_memory_barrier", value: 2951, isUnsigned: true)
!2035 = !DIEnumerator(name: "CODE_FOR_sync_compare_and_swapqi", value: 2952, isUnsigned: true)
!2036 = !DIEnumerator(name: "CODE_FOR_sync_compare_and_swaphi", value: 2953, isUnsigned: true)
!2037 = !DIEnumerator(name: "CODE_FOR_sync_compare_and_swapsi", value: 2954, isUnsigned: true)
!2038 = !DIEnumerator(name: "CODE_FOR_sync_compare_and_swapdi", value: 2955, isUnsigned: true)
!2039 = !DIEnumerator(name: "CODE_FOR_nothing", value: 2956, isUnsigned: true)
!2040 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "optab_methods", file: !378, line: 291, baseType: !7, size: 32, elements: !2041)
!2041 = !{!2042, !2043, !2044, !2045, !2046}
!2042 = !DIEnumerator(name: "OPTAB_DIRECT", value: 0, isUnsigned: true)
!2043 = !DIEnumerator(name: "OPTAB_LIB", value: 1, isUnsigned: true)
!2044 = !DIEnumerator(name: "OPTAB_WIDEN", value: 2, isUnsigned: true)
!2045 = !DIEnumerator(name: "OPTAB_LIB_WIDEN", value: 3, isUnsigned: true)
!2046 = !DIEnumerator(name: "OPTAB_MUST_WIDEN", value: 4, isUnsigned: true)
!2047 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mult_variant", file: !3, line: 2389, baseType: !7, size: 32, elements: !2048)
!2048 = !{!2049, !2050, !2051}
!2049 = !DIEnumerator(name: "basic_variant", value: 0, isUnsigned: true)
!2050 = !DIEnumerator(name: "negate_variant", value: 1, isUnsigned: true)
!2051 = !DIEnumerator(name: "add_variant", value: 2, isUnsigned: true)
!2052 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "alg_code", file: !3, line: 2278, baseType: !7, size: 32, elements: !2053)
!2053 = !{!2054, !2055, !2056, !2057, !2058, !2059, !2060, !2061, !2062, !2063, !2064}
!2054 = !DIEnumerator(name: "alg_unknown", value: 0, isUnsigned: true)
!2055 = !DIEnumerator(name: "alg_zero", value: 1, isUnsigned: true)
!2056 = !DIEnumerator(name: "alg_m", value: 2, isUnsigned: true)
!2057 = !DIEnumerator(name: "alg_shift", value: 3, isUnsigned: true)
!2058 = !DIEnumerator(name: "alg_add_t_m2", value: 4, isUnsigned: true)
!2059 = !DIEnumerator(name: "alg_sub_t_m2", value: 5, isUnsigned: true)
!2060 = !DIEnumerator(name: "alg_add_factor", value: 6, isUnsigned: true)
!2061 = !DIEnumerator(name: "alg_sub_factor", value: 7, isUnsigned: true)
!2062 = !DIEnumerator(name: "alg_add_t2_m", value: 8, isUnsigned: true)
!2063 = !DIEnumerator(name: "alg_sub_t2_m", value: 9, isUnsigned: true)
!2064 = !DIEnumerator(name: "alg_impossible", value: 10, isUnsigned: true)
!2065 = !{!2066, !2067, !2068, !2069, !2072, !2073, !2075, !5, !2076, !2077, !383, !526, !183, !2314, !2192, !3114, !2147, !3116, !7}
!2066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2067, size: 64)
!2067 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!2068 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!2069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2070, size: 64)
!2070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2071, size: 64)
!2071 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!2072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!2073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2074, size: 64)
!2074 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !2071)
!2075 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!2076 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!2077 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !2078, line: 50, baseType: !2079)
!2078 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2080, size: 64)
!2080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !384, line: 240, size: 384, elements: !2081)
!2081 = !{!2082, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092}
!2082 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !2080, file: !384, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!2083 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !2080, file: !384, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!2084 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !2080, file: !384, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!2085 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !2080, file: !384, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!2086 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !2080, file: !384, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!2087 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !2080, file: !384, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!2088 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !2080, file: !384, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!2089 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !2080, file: !384, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!2090 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !2080, file: !384, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!2091 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !2080, file: !384, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!2092 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !2080, file: !384, line: 321, baseType: !2093, size: 320, offset: 64)
!2093 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !384, line: 315, size: 320, elements: !2094)
!2094 = !{!2095, !3081, !3083, !3112, !3113}
!2095 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !2093, file: !384, line: 316, baseType: !2096, size: 64)
!2096 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2097, size: 64, elements: !2112)
!2097 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !384, line: 183, baseType: !2098)
!2098 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !384, line: 166, size: 64, elements: !2099)
!2099 = !{!2100, !2101, !2102, !2103, !2104, !2114, !2115, !2127, !2130, !2191, !3059, !3060, !3071, !3078}
!2100 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !2098, file: !384, line: 168, baseType: !2068, size: 32)
!2101 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !2098, file: !384, line: 169, baseType: !7, size: 32)
!2102 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !2098, file: !384, line: 170, baseType: !2073, size: 64)
!2103 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !2098, file: !384, line: 171, baseType: !2077, size: 64)
!2104 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !2098, file: !384, line: 172, baseType: !2105, size: 64)
!2105 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !2078, line: 53, baseType: !2106)
!2106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2107, size: 64)
!2107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !384, line: 359, size: 128, elements: !2108)
!2108 = !{!2109, !2110}
!2109 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !2107, file: !384, line: 360, baseType: !2068, size: 32)
!2110 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !2107, file: !384, line: 361, baseType: !2111, size: 64, offset: 64)
!2111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2077, size: 64, elements: !2112)
!2112 = !{!2113}
!2113 = !DISubrange(count: 1)
!2114 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !2098, file: !384, line: 173, baseType: !5, size: 32)
!2115 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !2098, file: !384, line: 174, baseType: !2116, size: 32)
!2116 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !384, line: 133, baseType: !2117)
!2117 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !384, line: 115, size: 32, elements: !2118)
!2118 = !{!2119, !2120, !2121, !2122, !2123, !2124, !2125, !2126}
!2119 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !2117, file: !384, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!2120 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !2117, file: !384, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!2121 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !2117, file: !384, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!2122 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !2117, file: !384, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!2123 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !2117, file: !384, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!2124 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !2117, file: !384, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!2125 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !2117, file: !384, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!2126 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !2117, file: !384, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!2127 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !2098, file: !384, line: 175, baseType: !2128, size: 64)
!2128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2129, size: 64)
!2129 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !384, line: 175, flags: DIFlagFwdDecl)
!2130 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !2098, file: !384, line: 176, baseType: !2131, size: 64)
!2131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2132, size: 64)
!2132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !2133, line: 75, size: 256, elements: !2134)
!2133 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2134 = !{!2135, !2150, !2151, !2152}
!2135 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !2132, file: !2133, line: 76, baseType: !2136, size: 64)
!2136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2137, size: 64)
!2137 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !2133, line: 68, baseType: !2138)
!2138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !2133, line: 63, size: 320, elements: !2139)
!2139 = !{!2140, !2142, !2143, !2144}
!2140 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2138, file: !2133, line: 64, baseType: !2141, size: 64)
!2141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2138, size: 64)
!2142 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2138, file: !2133, line: 65, baseType: !2141, size: 64, offset: 64)
!2143 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !2138, file: !2133, line: 66, baseType: !7, size: 32, offset: 128)
!2144 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !2138, file: !2133, line: 67, baseType: !2145, size: 128, offset: 192)
!2145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2146, size: 128, elements: !2148)
!2146 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !2133, line: 29, baseType: !2147)
!2147 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!2148 = !{!2149}
!2149 = !DISubrange(count: 2)
!2150 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !2132, file: !2133, line: 77, baseType: !2136, size: 64, offset: 64)
!2151 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !2132, file: !2133, line: 78, baseType: !7, size: 32, offset: 128)
!2152 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !2132, file: !2133, line: 79, baseType: !2153, size: 64, offset: 192)
!2153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2154, size: 64)
!2154 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !2133, line: 49, baseType: !2155)
!2155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !2133, line: 45, size: 832, elements: !2156)
!2156 = !{!2157, !2158, !2159}
!2157 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !2155, file: !2133, line: 46, baseType: !2141, size: 64)
!2158 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !2155, file: !2133, line: 47, baseType: !2131, size: 64, offset: 64)
!2159 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !2155, file: !2133, line: 48, baseType: !2160, size: 704, offset: 128)
!2160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !2161, line: 164, size: 704, elements: !2162)
!2161 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2162 = !{!2163, !2164, !2174, !2175, !2176, !2177, !2178, !2179, !2183, !2187, !2188, !2189, !2190}
!2163 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !2160, file: !2161, line: 166, baseType: !2075, size: 64)
!2164 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !2160, file: !2161, line: 167, baseType: !2165, size: 64, offset: 64)
!2165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2166, size: 64)
!2166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !2161, line: 157, size: 192, elements: !2167)
!2167 = !{!2168, !2169, !2170}
!2168 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !2166, file: !2161, line: 159, baseType: !2070, size: 64)
!2169 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2166, file: !2161, line: 160, baseType: !2165, size: 64, offset: 64)
!2170 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !2166, file: !2161, line: 161, baseType: !2171, size: 32, offset: 128)
!2171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2071, size: 32, elements: !2172)
!2172 = !{!2173}
!2173 = !DISubrange(count: 4)
!2174 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !2160, file: !2161, line: 168, baseType: !2070, size: 64, offset: 128)
!2175 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !2160, file: !2161, line: 169, baseType: !2070, size: 64, offset: 192)
!2176 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !2160, file: !2161, line: 170, baseType: !2070, size: 64, offset: 256)
!2177 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !2160, file: !2161, line: 171, baseType: !2075, size: 64, offset: 320)
!2178 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !2160, file: !2161, line: 172, baseType: !2068, size: 32, offset: 384)
!2179 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !2160, file: !2161, line: 176, baseType: !2180, size: 64, offset: 448)
!2180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2181, size: 64)
!2181 = !DISubroutineType(types: !2182)
!2182 = !{!2165, !2072, !2075}
!2183 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !2160, file: !2161, line: 177, baseType: !2184, size: 64, offset: 512)
!2184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2185, size: 64)
!2185 = !DISubroutineType(types: !2186)
!2186 = !{null, !2072, !2165}
!2187 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !2160, file: !2161, line: 178, baseType: !2072, size: 64, offset: 576)
!2188 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !2160, file: !2161, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!2189 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !2160, file: !2161, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!2190 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !2160, file: !2161, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!2191 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !2098, file: !384, line: 177, baseType: !2192, size: 64)
!2192 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !2078, line: 56, baseType: !2193)
!2193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2194, size: 64)
!2194 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !151, line: 3371, size: 1792, elements: !2195)
!2195 = !{!2196, !2229, !2235, !2246, !2265, !2276, !2281, !2288, !2294, !2307, !2319, !2357, !2362, !2390, !2398, !2399, !2404, !2413, !2419, !2424, !2428, !2432, !2683, !2732, !2738, !2745, !2752, !2778, !2803, !2820, !2832, !2854, !2869, !3041}
!2196 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2194, file: !151, line: 3372, baseType: !2197, size: 64)
!2197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !151, line: 360, size: 64, elements: !2198)
!2198 = !{!2199, !2200, !2201, !2202, !2203, !2204, !2205, !2206, !2207, !2208, !2209, !2210, !2211, !2212, !2213, !2214, !2215, !2216, !2217, !2218, !2219, !2220, !2221, !2222, !2223, !2224, !2225, !2226, !2227, !2228}
!2199 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !2197, file: !151, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!2200 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !2197, file: !151, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!2201 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !2197, file: !151, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!2202 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !2197, file: !151, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!2203 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !2197, file: !151, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!2204 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !2197, file: !151, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!2205 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !2197, file: !151, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!2206 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !2197, file: !151, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!2207 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !2197, file: !151, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!2208 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !2197, file: !151, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!2209 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !2197, file: !151, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!2210 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !2197, file: !151, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!2211 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !2197, file: !151, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!2212 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !2197, file: !151, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!2213 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !2197, file: !151, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!2214 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !2197, file: !151, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!2215 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !2197, file: !151, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!2216 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !2197, file: !151, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!2217 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !2197, file: !151, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!2218 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !2197, file: !151, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!2219 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !2197, file: !151, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!2220 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !2197, file: !151, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!2221 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !2197, file: !151, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!2222 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !2197, file: !151, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!2223 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !2197, file: !151, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!2224 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !2197, file: !151, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!2225 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !2197, file: !151, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!2226 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !2197, file: !151, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!2227 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !2197, file: !151, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!2228 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !2197, file: !151, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!2229 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2194, file: !151, line: 3373, baseType: !2230, size: 192)
!2230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !151, line: 402, size: 192, elements: !2231)
!2231 = !{!2232, !2233, !2234}
!2232 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2230, file: !151, line: 403, baseType: !2197, size: 64)
!2233 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !2230, file: !151, line: 404, baseType: !2192, size: 64, offset: 64)
!2234 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !2230, file: !151, line: 405, baseType: !2192, size: 64, offset: 128)
!2235 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !2194, file: !151, line: 3374, baseType: !2236, size: 320)
!2236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !151, line: 1384, size: 320, elements: !2237)
!2237 = !{!2238, !2239}
!2238 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2236, file: !151, line: 1385, baseType: !2230, size: 192)
!2239 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !2236, file: !151, line: 1386, baseType: !2240, size: 128, offset: 192)
!2240 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !2241, line: 58, baseType: !2242)
!2241 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2242 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2241, line: 54, size: 128, elements: !2243)
!2243 = !{!2244, !2245}
!2244 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !2242, file: !2241, line: 56, baseType: !2147, size: 64)
!2245 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !2242, file: !2241, line: 57, baseType: !2075, size: 64, offset: 64)
!2246 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !2194, file: !151, line: 3375, baseType: !2247, size: 256)
!2247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !151, line: 1397, size: 256, elements: !2248)
!2248 = !{!2249, !2250}
!2249 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2247, file: !151, line: 1398, baseType: !2230, size: 192)
!2250 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !2247, file: !151, line: 1399, baseType: !2251, size: 64, offset: 192)
!2251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2252, size: 64)
!2252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !2253, line: 52, size: 256, elements: !2254)
!2253 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2254 = !{!2255, !2256, !2257, !2258, !2259, !2260, !2261}
!2255 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !2252, file: !2253, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!2256 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !2252, file: !2253, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!2257 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !2252, file: !2253, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!2258 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !2252, file: !2253, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!2259 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !2252, file: !2253, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!2260 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !2252, file: !2253, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!2261 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !2252, file: !2253, line: 62, baseType: !2262, size: 192, offset: 64)
!2262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2147, size: 192, elements: !2263)
!2263 = !{!2264}
!2264 = !DISubrange(count: 3)
!2265 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !2194, file: !151, line: 3376, baseType: !2266, size: 256)
!2266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !151, line: 1408, size: 256, elements: !2267)
!2267 = !{!2268, !2269}
!2268 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2266, file: !151, line: 1409, baseType: !2230, size: 192)
!2269 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !2266, file: !151, line: 1410, baseType: !2270, size: 64, offset: 192)
!2270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2271, size: 64)
!2271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !2272, line: 27, size: 192, elements: !2273)
!2272 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2273 = !{!2274, !2275}
!2274 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !2271, file: !2272, line: 29, baseType: !2240, size: 128)
!2275 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !2271, file: !2272, line: 30, baseType: !5, size: 32, offset: 128)
!2276 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !2194, file: !151, line: 3377, baseType: !2277, size: 256)
!2277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !151, line: 1437, size: 256, elements: !2278)
!2278 = !{!2279, !2280}
!2279 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2277, file: !151, line: 1438, baseType: !2230, size: 192)
!2280 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !2277, file: !151, line: 1439, baseType: !2192, size: 64, offset: 192)
!2281 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !2194, file: !151, line: 3378, baseType: !2282, size: 256)
!2282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !151, line: 1418, size: 256, elements: !2283)
!2283 = !{!2284, !2285, !2286}
!2284 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2282, file: !151, line: 1419, baseType: !2230, size: 192)
!2285 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !2282, file: !151, line: 1420, baseType: !2068, size: 32, offset: 192)
!2286 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !2282, file: !151, line: 1421, baseType: !2287, size: 8, offset: 224)
!2287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2071, size: 8, elements: !2112)
!2288 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !2194, file: !151, line: 3379, baseType: !2289, size: 320)
!2289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !151, line: 1428, size: 320, elements: !2290)
!2290 = !{!2291, !2292, !2293}
!2291 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2289, file: !151, line: 1429, baseType: !2230, size: 192)
!2292 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !2289, file: !151, line: 1430, baseType: !2192, size: 64, offset: 192)
!2293 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !2289, file: !151, line: 1431, baseType: !2192, size: 64, offset: 256)
!2294 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !2194, file: !151, line: 3380, baseType: !2295, size: 320)
!2295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !151, line: 1460, size: 320, elements: !2296)
!2296 = !{!2297, !2298}
!2297 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2295, file: !151, line: 1461, baseType: !2230, size: 192)
!2298 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !2295, file: !151, line: 1462, baseType: !2299, size: 128, offset: 192)
!2299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !2300, line: 31, size: 128, elements: !2301)
!2300 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2301 = !{!2302, !2305, !2306}
!2302 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !2299, file: !2300, line: 32, baseType: !2303, size: 64)
!2303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2304, size: 64)
!2304 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !2067)
!2305 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !2299, file: !2300, line: 33, baseType: !7, size: 32, offset: 64)
!2306 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !2299, file: !2300, line: 34, baseType: !7, size: 32, offset: 96)
!2307 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !2194, file: !151, line: 3381, baseType: !2308, size: 384)
!2308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !151, line: 2507, size: 384, elements: !2309)
!2309 = !{!2310, !2311, !2316, !2317, !2318}
!2310 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2308, file: !151, line: 2508, baseType: !2230, size: 192)
!2311 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !2308, file: !151, line: 2509, baseType: !2312, size: 32, offset: 192)
!2312 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !2313, line: 58, baseType: !2314)
!2313 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2314 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !2315, line: 44, baseType: !7)
!2315 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2316 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !2308, file: !151, line: 2510, baseType: !7, size: 32, offset: 224)
!2317 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2308, file: !151, line: 2511, baseType: !2192, size: 64, offset: 256)
!2318 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !2308, file: !151, line: 2512, baseType: !2192, size: 64, offset: 320)
!2319 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !2194, file: !151, line: 3382, baseType: !2320, size: 896)
!2320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !151, line: 2652, size: 896, elements: !2321)
!2321 = !{!2322, !2323, !2324, !2325, !2326, !2327, !2328, !2329, !2330, !2331, !2332, !2333, !2334, !2335, !2336, !2337, !2338, !2339, !2340, !2341, !2342, !2343, !2344, !2345, !2346, !2347, !2348, !2349, !2350, !2351, !2352, !2353, !2354}
!2322 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2320, file: !151, line: 2653, baseType: !2308, size: 384)
!2323 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2320, file: !151, line: 2654, baseType: !2192, size: 64, offset: 384)
!2324 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !2320, file: !151, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!2325 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !2320, file: !151, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!2326 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !2320, file: !151, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!2327 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !2320, file: !151, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!2328 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !2320, file: !151, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!2329 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !2320, file: !151, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!2330 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !2320, file: !151, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!2331 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !2320, file: !151, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!2332 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !2320, file: !151, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!2333 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !2320, file: !151, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!2334 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !2320, file: !151, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!2335 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !2320, file: !151, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!2336 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !2320, file: !151, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!2337 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !2320, file: !151, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!2338 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !2320, file: !151, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!2339 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !2320, file: !151, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!2340 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !2320, file: !151, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!2341 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !2320, file: !151, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!2342 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !2320, file: !151, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!2343 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !2320, file: !151, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!2344 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !2320, file: !151, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!2345 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !2320, file: !151, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!2346 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !2320, file: !151, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!2347 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !2320, file: !151, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!2348 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !2320, file: !151, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!2349 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !2320, file: !151, line: 2703, baseType: !7, size: 32, offset: 512)
!2350 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !2320, file: !151, line: 2705, baseType: !2192, size: 64, offset: 576)
!2351 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !2320, file: !151, line: 2706, baseType: !2192, size: 64, offset: 640)
!2352 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !2320, file: !151, line: 2707, baseType: !2192, size: 64, offset: 704)
!2353 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !2320, file: !151, line: 2708, baseType: !2192, size: 64, offset: 768)
!2354 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !2320, file: !151, line: 2711, baseType: !2355, size: 64, offset: 832)
!2355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2356, size: 64)
!2356 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !151, line: 2711, flags: DIFlagFwdDecl)
!2357 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !2194, file: !151, line: 3383, baseType: !2358, size: 960)
!2358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !151, line: 2756, size: 960, elements: !2359)
!2359 = !{!2360, !2361}
!2360 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2358, file: !151, line: 2757, baseType: !2320, size: 896)
!2361 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !2358, file: !151, line: 2758, baseType: !2077, size: 64, offset: 896)
!2362 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !2194, file: !151, line: 3384, baseType: !2363, size: 1472)
!2363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !151, line: 3114, size: 1472, elements: !2364)
!2364 = !{!2365, !2386, !2387, !2388, !2389}
!2365 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2363, file: !151, line: 3115, baseType: !2366, size: 1216)
!2366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !151, line: 2984, size: 1216, elements: !2367)
!2367 = !{!2368, !2369, !2370, !2371, !2372, !2373, !2374, !2375, !2376, !2377, !2378, !2379, !2380, !2381, !2382, !2383, !2384, !2385}
!2368 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2366, file: !151, line: 2985, baseType: !2358, size: 960)
!2369 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !2366, file: !151, line: 2986, baseType: !2192, size: 64, offset: 960)
!2370 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !2366, file: !151, line: 2987, baseType: !2192, size: 64, offset: 1024)
!2371 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !2366, file: !151, line: 2988, baseType: !2192, size: 64, offset: 1088)
!2372 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !2366, file: !151, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!2373 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !2366, file: !151, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!2374 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !2366, file: !151, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!2375 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !2366, file: !151, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!2376 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !2366, file: !151, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!2377 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !2366, file: !151, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!2378 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !2366, file: !151, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!2379 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !2366, file: !151, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!2380 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !2366, file: !151, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!2381 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !2366, file: !151, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!2382 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !2366, file: !151, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!2383 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !2366, file: !151, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!2384 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !2366, file: !151, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!2385 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !2366, file: !151, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!2386 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !2363, file: !151, line: 3117, baseType: !2192, size: 64, offset: 1216)
!2387 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !2363, file: !151, line: 3119, baseType: !2192, size: 64, offset: 1280)
!2388 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !2363, file: !151, line: 3121, baseType: !2192, size: 64, offset: 1344)
!2389 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !2363, file: !151, line: 3123, baseType: !2192, size: 64, offset: 1408)
!2390 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !2194, file: !151, line: 3385, baseType: !2391, size: 1088)
!2391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !151, line: 2874, size: 1088, elements: !2392)
!2392 = !{!2393, !2394, !2395}
!2393 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2391, file: !151, line: 2875, baseType: !2358, size: 960)
!2394 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !2391, file: !151, line: 2876, baseType: !2077, size: 64, offset: 960)
!2395 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2391, file: !151, line: 2877, baseType: !2396, size: 64, offset: 1024)
!2396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2397, size: 64)
!2397 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !151, line: 2856, flags: DIFlagFwdDecl)
!2398 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !2194, file: !151, line: 3386, baseType: !2366, size: 1216)
!2399 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !2194, file: !151, line: 3387, baseType: !2400, size: 1280)
!2400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !151, line: 3093, size: 1280, elements: !2401)
!2401 = !{!2402, !2403}
!2402 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2400, file: !151, line: 3094, baseType: !2366, size: 1216)
!2403 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2400, file: !151, line: 3095, baseType: !2396, size: 64, offset: 1216)
!2404 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !2194, file: !151, line: 3388, baseType: !2405, size: 1216)
!2405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !151, line: 2824, size: 1216, elements: !2406)
!2406 = !{!2407, !2408, !2409, !2410, !2411, !2412}
!2407 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2405, file: !151, line: 2825, baseType: !2320, size: 896)
!2408 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2405, file: !151, line: 2827, baseType: !2192, size: 64, offset: 896)
!2409 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !2405, file: !151, line: 2828, baseType: !2192, size: 64, offset: 960)
!2410 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !2405, file: !151, line: 2829, baseType: !2192, size: 64, offset: 1024)
!2411 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !2405, file: !151, line: 2830, baseType: !2192, size: 64, offset: 1088)
!2412 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !2405, file: !151, line: 2831, baseType: !2192, size: 64, offset: 1152)
!2413 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !2194, file: !151, line: 3389, baseType: !2414, size: 1024)
!2414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !151, line: 2850, size: 1024, elements: !2415)
!2415 = !{!2416, !2417, !2418}
!2416 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2414, file: !151, line: 2851, baseType: !2358, size: 960)
!2417 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !2414, file: !151, line: 2852, baseType: !2068, size: 32, offset: 960)
!2418 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !2414, file: !151, line: 2853, baseType: !2068, size: 32, offset: 992)
!2419 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !2194, file: !151, line: 3390, baseType: !2420, size: 1024)
!2420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !151, line: 2857, size: 1024, elements: !2421)
!2421 = !{!2422, !2423}
!2422 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2420, file: !151, line: 2858, baseType: !2358, size: 960)
!2423 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2420, file: !151, line: 2859, baseType: !2396, size: 64, offset: 960)
!2424 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !2194, file: !151, line: 3391, baseType: !2425, size: 960)
!2425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !151, line: 2862, size: 960, elements: !2426)
!2426 = !{!2427}
!2427 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2425, file: !151, line: 2863, baseType: !2358, size: 960)
!2428 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !2194, file: !151, line: 3392, baseType: !2429, size: 1472)
!2429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !151, line: 3304, size: 1472, elements: !2430)
!2430 = !{!2431}
!2431 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2429, file: !151, line: 3305, baseType: !2363, size: 1472)
!2432 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !2194, file: !151, line: 3393, baseType: !2433, size: 1792)
!2433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !151, line: 3248, size: 1792, elements: !2434)
!2434 = !{!2435, !2436, !2662, !2663, !2664, !2665, !2666, !2667, !2668, !2669, !2670, !2671, !2672, !2673, !2674, !2675, !2676, !2677, !2678, !2679, !2680, !2681, !2682}
!2435 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2433, file: !151, line: 3249, baseType: !2363, size: 1472)
!2436 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !2433, file: !151, line: 3251, baseType: !2437, size: 64, offset: 1472)
!2437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2438, size: 64)
!2438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !2439, line: 463, size: 1152, elements: !2440)
!2439 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2440 = !{!2441, !2444, !2548, !2549, !2552, !2555, !2607, !2608, !2609, !2610, !2611, !2635, !2638, !2639, !2640, !2641, !2642, !2643, !2644, !2645, !2646, !2647, !2648, !2649, !2650, !2651, !2652, !2653, !2654, !2655, !2656, !2657, !2658, !2659, !2660, !2661}
!2441 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !2438, file: !2439, line: 464, baseType: !2442, size: 64)
!2442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2443, size: 64)
!2443 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !2439, line: 464, flags: DIFlagFwdDecl)
!2444 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !2438, file: !2439, line: 467, baseType: !2445, size: 64, offset: 64)
!2445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2446, size: 64)
!2446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !135, line: 374, size: 640, elements: !2447)
!2447 = !{!2448, !2523, !2524, !2537, !2538, !2539, !2540, !2541, !2542, !2544, !2546, !2547}
!2448 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !2446, file: !135, line: 377, baseType: !2449, size: 64)
!2449 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !2078, line: 111, baseType: !2450)
!2450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2451, size: 64)
!2451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !135, line: 217, size: 832, elements: !2452)
!2452 = !{!2453, !2488, !2489, !2490, !2493, !2497, !2498, !2499, !2517, !2518, !2519, !2520, !2521, !2522}
!2453 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !2451, file: !135, line: 219, baseType: !2454, size: 64)
!2454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2455, size: 64)
!2455 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !135, line: 151, baseType: !2456)
!2456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !135, line: 151, size: 128, elements: !2457)
!2457 = !{!2458}
!2458 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2456, file: !135, line: 151, baseType: !2459, size: 128)
!2459 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !135, line: 150, baseType: !2460)
!2460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !135, line: 150, size: 128, elements: !2461)
!2461 = !{!2462, !2463, !2464}
!2462 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2460, file: !135, line: 150, baseType: !7, size: 32)
!2463 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2460, file: !135, line: 150, baseType: !7, size: 32, offset: 32)
!2464 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2460, file: !135, line: 150, baseType: !2465, size: 64, offset: 64)
!2465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2466, size: 64, elements: !2112)
!2466 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !2078, line: 108, baseType: !2467)
!2467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2468, size: 64)
!2468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !135, line: 122, size: 512, elements: !2469)
!2469 = !{!2470, !2471, !2472, !2480, !2481, !2482, !2483, !2484, !2485, !2486}
!2470 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !2468, file: !135, line: 124, baseType: !2450, size: 64)
!2471 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !2468, file: !135, line: 125, baseType: !2450, size: 64, offset: 64)
!2472 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !2468, file: !135, line: 131, baseType: !2473, size: 64, offset: 128)
!2473 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !135, line: 128, size: 64, elements: !2474)
!2474 = !{!2475, !2479}
!2475 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !2473, file: !135, line: 129, baseType: !2476, size: 64)
!2476 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !2078, line: 66, baseType: !2477)
!2477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2478, size: 64)
!2478 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !2078, line: 65, flags: DIFlagFwdDecl)
!2479 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !2473, file: !135, line: 130, baseType: !2077, size: 64)
!2480 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !2468, file: !135, line: 134, baseType: !2072, size: 64, offset: 192)
!2481 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !2468, file: !135, line: 137, baseType: !2192, size: 64, offset: 256)
!2482 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !2468, file: !135, line: 138, baseType: !2312, size: 32, offset: 320)
!2483 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !2468, file: !135, line: 142, baseType: !7, size: 32, offset: 352)
!2484 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !2468, file: !135, line: 144, baseType: !2068, size: 32, offset: 384)
!2485 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !2468, file: !135, line: 145, baseType: !2068, size: 32, offset: 416)
!2486 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !2468, file: !135, line: 146, baseType: !2487, size: 64, offset: 448)
!2487 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !135, line: 119, baseType: !2075)
!2488 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !2451, file: !135, line: 220, baseType: !2454, size: 64, offset: 64)
!2489 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !2451, file: !135, line: 223, baseType: !2072, size: 64, offset: 128)
!2490 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !2451, file: !135, line: 226, baseType: !2491, size: 64, offset: 192)
!2491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2492, size: 64)
!2492 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !135, line: 185, flags: DIFlagFwdDecl)
!2493 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !2451, file: !135, line: 229, baseType: !2494, size: 128, offset: 256)
!2494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2495, size: 128, elements: !2148)
!2495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2496, size: 64)
!2496 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !135, line: 229, flags: DIFlagFwdDecl)
!2497 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !2451, file: !135, line: 232, baseType: !2450, size: 64, offset: 384)
!2498 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !2451, file: !135, line: 233, baseType: !2450, size: 64, offset: 448)
!2499 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !2451, file: !135, line: 238, baseType: !2500, size: 64, offset: 512)
!2500 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !135, line: 235, size: 64, elements: !2501)
!2501 = !{!2502, !2508}
!2502 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !2500, file: !135, line: 236, baseType: !2503, size: 64)
!2503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2504, size: 64)
!2504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !135, line: 273, size: 128, elements: !2505)
!2505 = !{!2506, !2507}
!2506 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !2504, file: !135, line: 275, baseType: !2476, size: 64)
!2507 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !2504, file: !135, line: 278, baseType: !2476, size: 64, offset: 64)
!2508 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !2500, file: !135, line: 237, baseType: !2509, size: 64)
!2509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2510, size: 64)
!2510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !135, line: 259, size: 320, elements: !2511)
!2511 = !{!2512, !2513, !2514, !2515, !2516}
!2512 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !2510, file: !135, line: 261, baseType: !2077, size: 64)
!2513 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !2510, file: !135, line: 262, baseType: !2077, size: 64, offset: 64)
!2514 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !2510, file: !135, line: 266, baseType: !2077, size: 64, offset: 128)
!2515 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !2510, file: !135, line: 267, baseType: !2077, size: 64, offset: 192)
!2516 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !2510, file: !135, line: 270, baseType: !2068, size: 32, offset: 256)
!2517 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !2451, file: !135, line: 241, baseType: !2487, size: 64, offset: 576)
!2518 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !2451, file: !135, line: 244, baseType: !2068, size: 32, offset: 640)
!2519 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !2451, file: !135, line: 247, baseType: !2068, size: 32, offset: 672)
!2520 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !2451, file: !135, line: 250, baseType: !2068, size: 32, offset: 704)
!2521 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !2451, file: !135, line: 253, baseType: !2068, size: 32, offset: 736)
!2522 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !2451, file: !135, line: 256, baseType: !2068, size: 32, offset: 768)
!2523 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !2446, file: !135, line: 378, baseType: !2449, size: 64, offset: 64)
!2524 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !2446, file: !135, line: 381, baseType: !2525, size: 64, offset: 128)
!2525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2526, size: 64)
!2526 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !135, line: 282, baseType: !2527)
!2527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !135, line: 282, size: 128, elements: !2528)
!2528 = !{!2529}
!2529 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2527, file: !135, line: 282, baseType: !2530, size: 128)
!2530 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !135, line: 281, baseType: !2531)
!2531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !135, line: 281, size: 128, elements: !2532)
!2532 = !{!2533, !2534, !2535}
!2533 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2531, file: !135, line: 281, baseType: !7, size: 32)
!2534 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2531, file: !135, line: 281, baseType: !7, size: 32, offset: 32)
!2535 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2531, file: !135, line: 281, baseType: !2536, size: 64, offset: 64)
!2536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2449, size: 64, elements: !2112)
!2537 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !2446, file: !135, line: 384, baseType: !2068, size: 32, offset: 192)
!2538 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !2446, file: !135, line: 387, baseType: !2068, size: 32, offset: 224)
!2539 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !2446, file: !135, line: 390, baseType: !2068, size: 32, offset: 256)
!2540 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !2446, file: !135, line: 394, baseType: !2525, size: 64, offset: 320)
!2541 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !2446, file: !135, line: 396, baseType: !134, size: 32, offset: 384)
!2542 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !2446, file: !135, line: 399, baseType: !2543, size: 64, offset: 416)
!2543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 64, elements: !2148)
!2544 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !2446, file: !135, line: 402, baseType: !2545, size: 64, offset: 480)
!2545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !2148)
!2546 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !2446, file: !135, line: 406, baseType: !2068, size: 32, offset: 544)
!2547 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !2446, file: !135, line: 409, baseType: !2068, size: 32, offset: 576)
!2548 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !2438, file: !2439, line: 470, baseType: !2477, size: 64, offset: 128)
!2549 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !2438, file: !2439, line: 473, baseType: !2550, size: 64, offset: 192)
!2550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2551, size: 64)
!2551 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !2439, line: 166, flags: DIFlagFwdDecl)
!2552 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !2438, file: !2439, line: 476, baseType: !2553, size: 64, offset: 256)
!2553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2554, size: 64)
!2554 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !2439, line: 476, flags: DIFlagFwdDecl)
!2555 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !2438, file: !2439, line: 479, baseType: !2556, size: 64, offset: 320)
!2556 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !2557, line: 144, baseType: !2558)
!2557 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2559, size: 64)
!2559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !2557, line: 100, size: 896, elements: !2560)
!2560 = !{!2561, !2569, !2574, !2579, !2581, !2584, !2585, !2586, !2587, !2588, !2593, !2595, !2596, !2601, !2606}
!2561 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !2559, file: !2557, line: 102, baseType: !2562, size: 64)
!2562 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !2557, line: 52, baseType: !2563)
!2563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2564, size: 64)
!2564 = !DISubroutineType(types: !2565)
!2565 = !{!2566, !2567}
!2566 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !2557, line: 47, baseType: !7)
!2567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2568, size: 64)
!2568 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!2569 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !2559, file: !2557, line: 105, baseType: !2570, size: 64, offset: 64)
!2570 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !2557, line: 59, baseType: !2571)
!2571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2572, size: 64)
!2572 = !DISubroutineType(types: !2573)
!2573 = !{!2068, !2567, !2567}
!2574 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !2559, file: !2557, line: 108, baseType: !2575, size: 64, offset: 128)
!2575 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !2557, line: 63, baseType: !2576)
!2576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2577, size: 64)
!2577 = !DISubroutineType(types: !2578)
!2578 = !{null, !2072}
!2579 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !2559, file: !2557, line: 111, baseType: !2580, size: 64, offset: 192)
!2580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2072, size: 64)
!2581 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2559, file: !2557, line: 114, baseType: !2582, size: 64, offset: 256)
!2582 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !2583, line: 46, baseType: !2147)
!2583 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!2584 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !2559, file: !2557, line: 117, baseType: !2582, size: 64, offset: 320)
!2585 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !2559, file: !2557, line: 120, baseType: !2582, size: 64, offset: 384)
!2586 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !2559, file: !2557, line: 124, baseType: !7, size: 32, offset: 448)
!2587 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !2559, file: !2557, line: 128, baseType: !7, size: 32, offset: 480)
!2588 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !2559, file: !2557, line: 131, baseType: !2589, size: 64, offset: 512)
!2589 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !2557, line: 75, baseType: !2590)
!2590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2591, size: 64)
!2591 = !DISubroutineType(types: !2592)
!2592 = !{!2072, !2582, !2582}
!2593 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !2559, file: !2557, line: 132, baseType: !2594, size: 64, offset: 576)
!2594 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !2557, line: 78, baseType: !2576)
!2595 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !2559, file: !2557, line: 135, baseType: !2072, size: 64, offset: 640)
!2596 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !2559, file: !2557, line: 136, baseType: !2597, size: 64, offset: 704)
!2597 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !2557, line: 82, baseType: !2598)
!2598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2599, size: 64)
!2599 = !DISubroutineType(types: !2600)
!2600 = !{!2072, !2072, !2582, !2582}
!2601 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !2559, file: !2557, line: 137, baseType: !2602, size: 64, offset: 768)
!2602 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !2557, line: 83, baseType: !2603)
!2603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2604, size: 64)
!2604 = !DISubroutineType(types: !2605)
!2605 = !{null, !2072, !2072}
!2606 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !2559, file: !2557, line: 141, baseType: !7, size: 32, offset: 832)
!2607 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !2438, file: !2439, line: 484, baseType: !2192, size: 64, offset: 384)
!2608 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !2438, file: !2439, line: 488, baseType: !2192, size: 64, offset: 448)
!2609 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !2438, file: !2439, line: 493, baseType: !2192, size: 64, offset: 512)
!2610 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !2438, file: !2439, line: 496, baseType: !2192, size: 64, offset: 576)
!2611 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !2438, file: !2439, line: 501, baseType: !2612, size: 64, offset: 640)
!2612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2613, size: 64)
!2613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !146, line: 2355, size: 576, elements: !2614)
!2614 = !{!2615, !2618, !2619, !2620, !2621, !2623, !2624, !2629, !2630, !2631, !2632, !2633, !2634}
!2615 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !2613, file: !146, line: 2356, baseType: !2616, size: 64)
!2616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2617, size: 64)
!2617 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !146, line: 2356, flags: DIFlagFwdDecl)
!2618 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !2613, file: !146, line: 2357, baseType: !2073, size: 64, offset: 64)
!2619 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !2613, file: !146, line: 2358, baseType: !2068, size: 32, offset: 128)
!2620 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !2613, file: !146, line: 2359, baseType: !2068, size: 32, offset: 160)
!2621 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !2613, file: !146, line: 2360, baseType: !2622, size: 128, offset: 192)
!2622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2068, size: 128, elements: !2172)
!2623 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !2613, file: !146, line: 2364, baseType: !2068, size: 32, offset: 320)
!2624 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !2613, file: !146, line: 2367, baseType: !2625, size: 128, offset: 384)
!2625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !146, line: 2349, size: 128, elements: !2626)
!2626 = !{!2627, !2628}
!2627 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !2625, file: !146, line: 2351, baseType: !2077, size: 64)
!2628 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2625, file: !146, line: 2352, baseType: !2075, size: 64, offset: 64)
!2629 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !2613, file: !146, line: 2371, baseType: !145, size: 32, offset: 512)
!2630 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !2613, file: !146, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!2631 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !2613, file: !146, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!2632 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !2613, file: !146, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!2633 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !2613, file: !146, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!2634 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !2613, file: !146, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!2635 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !2438, file: !2439, line: 504, baseType: !2636, size: 64, offset: 704)
!2636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2637, size: 64)
!2637 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !2439, line: 504, flags: DIFlagFwdDecl)
!2638 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !2438, file: !2439, line: 507, baseType: !2556, size: 64, offset: 768)
!2639 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !2438, file: !2439, line: 510, baseType: !2068, size: 32, offset: 832)
!2640 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !2438, file: !2439, line: 513, baseType: !2068, size: 32, offset: 864)
!2641 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !2438, file: !2439, line: 516, baseType: !2312, size: 32, offset: 896)
!2642 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !2438, file: !2439, line: 519, baseType: !2312, size: 32, offset: 928)
!2643 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !2438, file: !2439, line: 522, baseType: !7, size: 32, offset: 960)
!2644 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !2438, file: !2439, line: 523, baseType: !7, size: 32, offset: 992)
!2645 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !2438, file: !2439, line: 528, baseType: !2073, size: 64, offset: 1024)
!2646 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !2438, file: !2439, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!2647 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !2438, file: !2439, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!2648 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !2438, file: !2439, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!2649 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !2438, file: !2439, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!2650 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !2438, file: !2439, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!2651 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !2438, file: !2439, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!2652 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !2438, file: !2439, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!2653 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !2438, file: !2439, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!2654 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !2438, file: !2439, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!2655 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !2438, file: !2439, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!2656 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !2438, file: !2439, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!2657 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !2438, file: !2439, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!2658 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !2438, file: !2439, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!2659 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !2438, file: !2439, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!2660 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !2438, file: !2439, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!2661 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !2438, file: !2439, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!2662 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !2433, file: !151, line: 3254, baseType: !2192, size: 64, offset: 1536)
!2663 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !2433, file: !151, line: 3257, baseType: !2192, size: 64, offset: 1600)
!2664 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !2433, file: !151, line: 3258, baseType: !2192, size: 64, offset: 1664)
!2665 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !2433, file: !151, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!2666 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !2433, file: !151, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!2667 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !2433, file: !151, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!2668 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !2433, file: !151, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!2669 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !2433, file: !151, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!2670 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !2433, file: !151, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!2671 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !2433, file: !151, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!2672 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !2433, file: !151, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!2673 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !2433, file: !151, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!2674 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !2433, file: !151, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!2675 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !2433, file: !151, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!2676 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !2433, file: !151, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!2677 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !2433, file: !151, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!2678 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !2433, file: !151, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!2679 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !2433, file: !151, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!2680 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !2433, file: !151, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!2681 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !2433, file: !151, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!2682 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !2433, file: !151, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!2683 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !2194, file: !151, line: 3394, baseType: !2684, size: 1344)
!2684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !151, line: 2279, size: 1344, elements: !2685)
!2685 = !{!2686, !2687, !2688, !2689, !2690, !2691, !2692, !2693, !2694, !2695, !2696, !2697, !2698, !2699, !2700, !2701, !2702, !2703, !2704, !2705, !2706, !2707, !2708, !2711, !2712, !2713, !2721, !2722, !2723, !2724, !2725, !2726, !2727, !2728, !2729}
!2686 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2684, file: !151, line: 2280, baseType: !2230, size: 192)
!2687 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !2684, file: !151, line: 2281, baseType: !2192, size: 64, offset: 192)
!2688 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2684, file: !151, line: 2282, baseType: !2192, size: 64, offset: 256)
!2689 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !2684, file: !151, line: 2283, baseType: !2192, size: 64, offset: 320)
!2690 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !2684, file: !151, line: 2284, baseType: !2192, size: 64, offset: 384)
!2691 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !2684, file: !151, line: 2285, baseType: !7, size: 32, offset: 448)
!2692 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !2684, file: !151, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!2693 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !2684, file: !151, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!2694 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !2684, file: !151, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!2695 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !2684, file: !151, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!2696 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !2684, file: !151, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!2697 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !2684, file: !151, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!2698 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !2684, file: !151, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!2699 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !2684, file: !151, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!2700 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !2684, file: !151, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!2701 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !2684, file: !151, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!2702 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !2684, file: !151, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!2703 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !2684, file: !151, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!2704 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !2684, file: !151, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!2705 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !2684, file: !151, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!2706 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !2684, file: !151, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!2707 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !2684, file: !151, line: 2305, baseType: !7, size: 32, offset: 512)
!2708 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !2684, file: !151, line: 2306, baseType: !2709, size: 32, offset: 544)
!2709 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !2710, line: 31, baseType: !2068)
!2710 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2711 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !2684, file: !151, line: 2307, baseType: !2192, size: 64, offset: 576)
!2712 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !2684, file: !151, line: 2308, baseType: !2192, size: 64, offset: 640)
!2713 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !2684, file: !151, line: 2314, baseType: !2714, size: 64, offset: 704)
!2714 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !151, line: 2309, size: 64, elements: !2715)
!2715 = !{!2716, !2717, !2718}
!2716 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !2714, file: !151, line: 2310, baseType: !2068, size: 32)
!2717 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !2714, file: !151, line: 2311, baseType: !2073, size: 64)
!2718 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !2714, file: !151, line: 2312, baseType: !2719, size: 64)
!2719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2720, size: 64)
!2720 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !151, line: 2277, flags: DIFlagFwdDecl)
!2721 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2684, file: !151, line: 2315, baseType: !2192, size: 64, offset: 768)
!2722 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !2684, file: !151, line: 2316, baseType: !2192, size: 64, offset: 832)
!2723 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !2684, file: !151, line: 2317, baseType: !2192, size: 64, offset: 896)
!2724 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !2684, file: !151, line: 2318, baseType: !2192, size: 64, offset: 960)
!2725 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !2684, file: !151, line: 2319, baseType: !2192, size: 64, offset: 1024)
!2726 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !2684, file: !151, line: 2320, baseType: !2192, size: 64, offset: 1088)
!2727 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !2684, file: !151, line: 2321, baseType: !2192, size: 64, offset: 1152)
!2728 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !2684, file: !151, line: 2322, baseType: !2192, size: 64, offset: 1216)
!2729 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !2684, file: !151, line: 2324, baseType: !2730, size: 64, offset: 1280)
!2730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2731, size: 64)
!2731 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !151, line: 2324, flags: DIFlagFwdDecl)
!2732 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !2194, file: !151, line: 3395, baseType: !2733, size: 320)
!2733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !151, line: 1469, size: 320, elements: !2734)
!2734 = !{!2735, !2736, !2737}
!2735 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2733, file: !151, line: 1470, baseType: !2230, size: 192)
!2736 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !2733, file: !151, line: 1471, baseType: !2192, size: 64, offset: 192)
!2737 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !2733, file: !151, line: 1472, baseType: !2192, size: 64, offset: 256)
!2738 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2194, file: !151, line: 3396, baseType: !2739, size: 320)
!2739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !151, line: 1482, size: 320, elements: !2740)
!2740 = !{!2741, !2742, !2743}
!2741 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2739, file: !151, line: 1483, baseType: !2230, size: 192)
!2742 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !2739, file: !151, line: 1484, baseType: !2068, size: 32, offset: 192)
!2743 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !2739, file: !151, line: 1485, baseType: !2744, size: 64, offset: 256)
!2744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2192, size: 64, elements: !2112)
!2745 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !2194, file: !151, line: 3397, baseType: !2746, size: 384)
!2746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !151, line: 1829, size: 384, elements: !2747)
!2747 = !{!2748, !2749, !2750, !2751}
!2748 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2746, file: !151, line: 1830, baseType: !2230, size: 192)
!2749 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !2746, file: !151, line: 1831, baseType: !2312, size: 32, offset: 192)
!2750 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !2746, file: !151, line: 1832, baseType: !2192, size: 64, offset: 256)
!2751 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !2746, file: !151, line: 1835, baseType: !2744, size: 64, offset: 320)
!2752 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !2194, file: !151, line: 3398, baseType: !2753, size: 704)
!2753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !151, line: 1898, size: 704, elements: !2754)
!2754 = !{!2755, !2756, !2757, !2761, !2762, !2765}
!2755 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2753, file: !151, line: 1899, baseType: !2230, size: 192)
!2756 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !2753, file: !151, line: 1902, baseType: !2192, size: 64, offset: 192)
!2757 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !2753, file: !151, line: 1905, baseType: !2758, size: 64, offset: 256)
!2758 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !2078, line: 58, baseType: !2759)
!2759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2760, size: 64)
!2760 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !2078, line: 57, flags: DIFlagFwdDecl)
!2761 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !2753, file: !151, line: 1908, baseType: !7, size: 32, offset: 320)
!2762 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !2753, file: !151, line: 1911, baseType: !2763, size: 64, offset: 384)
!2763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2764, size: 64)
!2764 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !151, line: 1876, flags: DIFlagFwdDecl)
!2765 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !2753, file: !151, line: 1914, baseType: !2766, size: 256, offset: 448)
!2766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !151, line: 1883, size: 256, elements: !2767)
!2767 = !{!2768, !2770, !2771, !2776}
!2768 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2766, file: !151, line: 1884, baseType: !2769, size: 64)
!2769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2766, size: 64)
!2770 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2766, file: !151, line: 1885, baseType: !2769, size: 64, offset: 64)
!2771 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !2766, file: !151, line: 1891, baseType: !2772, size: 64, offset: 128)
!2772 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !2766, file: !151, line: 1891, size: 64, elements: !2773)
!2773 = !{!2774, !2775}
!2774 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !2772, file: !151, line: 1891, baseType: !2758, size: 64)
!2775 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !2772, file: !151, line: 1891, baseType: !2192, size: 64)
!2776 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !2766, file: !151, line: 1892, baseType: !2777, size: 64, offset: 192)
!2777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2192, size: 64)
!2778 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !2194, file: !151, line: 3399, baseType: !2779, size: 704)
!2779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !151, line: 2008, size: 704, elements: !2780)
!2780 = !{!2781, !2782, !2783, !2784, !2785, !2786, !2798, !2799, !2800, !2801, !2802}
!2781 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2779, file: !151, line: 2009, baseType: !2230, size: 192)
!2782 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !2779, file: !151, line: 2011, baseType: !7, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!2783 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !2779, file: !151, line: 2012, baseType: !7, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!2784 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !2779, file: !151, line: 2014, baseType: !2312, size: 32, offset: 224)
!2785 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !2779, file: !151, line: 2016, baseType: !2192, size: 64, offset: 256)
!2786 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !2779, file: !151, line: 2017, baseType: !2787, size: 64, offset: 320)
!2787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2788, size: 64)
!2788 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !151, line: 183, baseType: !2789)
!2789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !151, line: 183, size: 128, elements: !2790)
!2790 = !{!2791}
!2791 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2789, file: !151, line: 183, baseType: !2792, size: 128)
!2792 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !151, line: 182, baseType: !2793)
!2793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !151, line: 182, size: 128, elements: !2794)
!2794 = !{!2795, !2796, !2797}
!2795 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2793, file: !151, line: 182, baseType: !7, size: 32)
!2796 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2793, file: !151, line: 182, baseType: !7, size: 32, offset: 32)
!2797 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2793, file: !151, line: 182, baseType: !2744, size: 64, offset: 64)
!2798 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !2779, file: !151, line: 2019, baseType: !2192, size: 64, offset: 384)
!2799 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !2779, file: !151, line: 2020, baseType: !2192, size: 64, offset: 448)
!2800 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !2779, file: !151, line: 2021, baseType: !2192, size: 64, offset: 512)
!2801 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !2779, file: !151, line: 2022, baseType: !2192, size: 64, offset: 576)
!2802 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !2779, file: !151, line: 2023, baseType: !2192, size: 64, offset: 640)
!2803 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !2194, file: !151, line: 3400, baseType: !2804, size: 832)
