; ModuleID = 'expr.bc'
source_filename = "expr.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.rtx_def = type { i32, %union.u }
%union.u = type { %struct.block_symbol }
%struct.block_symbol = type { [3 x %union.rtunion_def], %struct.object_block*, i64 }
%union.rtunion_def = type { i8* }
%struct.object_block = type { %union.section*, i32, i64, %struct.VEC_rtx_gc*, %struct.VEC_rtx_gc* }
%union.section = type { %struct.unnamed_section }
%struct.unnamed_section = type { %struct.section_common, void (i8*)*, i8*, %union.section* }
%struct.section_common = type { i32 }
%struct.VEC_rtx_gc = type { %struct.VEC_rtx_base }
%struct.VEC_rtx_base = type { i32, i32, [1 x %struct.rtx_def*] }
%struct.insn_data = type { i8*, %union.anon.0, %struct.rtx_def* (%struct.rtx_def*, ...)*, %struct.insn_operand_data*, i8, i8, i8, i8 }
%union.anon.0 = type { i8* }
%struct.insn_operand_data = type { i32 (%struct.rtx_def*, i32)*, i8*, i16, i8, i8 }

!2115 = !DIEnumerator(name: "GIMPLE_SWITCH", value: 5, isUnsigned: true)
!2116 = !DIEnumerator(name: "GIMPLE_ASSIGN", value: 6, isUnsigned: true)
!2117 = !DIEnumerator(name: "GIMPLE_ASM", value: 7, isUnsigned: true)
!2118 = !DIEnumerator(name: "GIMPLE_CALL", value: 8, isUnsigned: true)
!2119 = !DIEnumerator(name: "GIMPLE_RETURN", value: 9, isUnsigned: true)
!2120 = !DIEnumerator(name: "GIMPLE_BIND", value: 10, isUnsigned: true)
!2121 = !DIEnumerator(name: "GIMPLE_CATCH", value: 11, isUnsigned: true)
!2122 = !DIEnumerator(name: "GIMPLE_EH_FILTER", value: 12, isUnsigned: true)
!2123 = !DIEnumerator(name: "GIMPLE_EH_MUST_NOT_THROW", value: 13, isUnsigned: true)
!2124 = !DIEnumerator(name: "GIMPLE_RESX", value: 14, isUnsigned: true)
!2125 = !DIEnumerator(name: "GIMPLE_EH_DISPATCH", value: 15, isUnsigned: true)
!2126 = !DIEnumerator(name: "GIMPLE_PHI", value: 16, isUnsigned: true)
!2127 = !DIEnumerator(name: "GIMPLE_TRY", value: 17, isUnsigned: true)
!2128 = !DIEnumerator(name: "GIMPLE_NOP", value: 18, isUnsigned: true)
!2129 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!2130 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!2131 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!2132 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!2133 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!2134 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!2135 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!2136 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!2137 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!2138 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!2139 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!2140 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!2141 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!2142 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!2143 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!2144 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!2145 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!2146 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !2102, line: 727, baseType: !7, size: 32, elements: !2147)
!2147 = !{!2148, !2149, !2150, !2151, !2152, !2153, !2154, !2155, !2156, !2157, !2158, !2159, !2160, !2161, !2162, !2163, !2164, !2165, !2166, !2167, !2168, !2169, !2170, !2171}
!2148 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!2149 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!2150 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!2151 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!2152 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!2153 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!2154 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!2155 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!2156 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!2157 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!2158 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!2159 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!2160 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!2161 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!2162 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!2163 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!2164 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!2165 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!2166 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!2167 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!2168 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!2169 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!2170 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!2171 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!2172 = !{!2173, !2174, !2175, !2176, !2179, !2180, !2182, !5, !1876, !1898, !3605, !2298, !2269, !7, !141, !2420, !3606, !2048, !2252, !2177, !2299, !3607, !3609, !2101, !2763, !3611, !2797}
!2173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2174, size: 64)
!2174 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!2175 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!2176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2177, size: 64)
!2177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2178, size: 64)
!2178 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!2179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!2180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2181, size: 64)
!2181 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !2178)
!2182 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !2183, line: 50, baseType: !2184)
!2183 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2185, size: 64)
!2185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !1899, line: 240, size: 384, elements: !2186)
!2186 = !{!2187, !2188, !2189, !2190, !2191, !2192, !2193, !2194, !2195, !2196, !2197}
!2187 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !2185, file: !1899, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!2188 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !2185, file: !1899, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!2189 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !2185, file: !1899, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!2190 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !2185, file: !1899, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!2191 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !2185, file: !1899, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!2192 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !2185, file: !1899, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!2193 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !2185, file: !1899, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!2194 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !2185, file: !1899, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!2195 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !2185, file: !1899, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!2196 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !2185, file: !1899, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!2197 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !2185, file: !1899, line: 321, baseType: !2198, size: 320, offset: 64)
!2198 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !1899, line: 315, size: 320, elements: !2199)
!2199 = !{!2200, !3540, !3542, !3603, !3604}
!2200 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !2198, file: !1899, line: 316, baseType: !2201, size: 64)
!2201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2202, size: 64, elements: !2217)
!2202 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !1899, line: 183, baseType: !2203)
!2203 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !1899, line: 166, size: 64, elements: !2204)
!2204 = !{!2205, !2206, !2207, !2208, !2209, !2219, !2220, !2232, !2235, !2297, !3518, !3519, !3530, !3537}
!2205 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !2203, file: !1899, line: 168, baseType: !2175, size: 32)
!2206 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !2203, file: !1899, line: 169, baseType: !7, size: 32)
!2207 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !2203, file: !1899, line: 170, baseType: !2180, size: 64)
!2208 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !2203, file: !1899, line: 171, baseType: !2182, size: 64)
!2209 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !2203, file: !1899, line: 172, baseType: !2210, size: 64)
!2210 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !2183, line: 53, baseType: !2211)
!2211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2212, size: 64)
!2212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !1899, line: 359, size: 128, elements: !2213)
!2213 = !{!2214, !2215}
!2214 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !2212, file: !1899, line: 360, baseType: !2175, size: 32)
!2215 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !2212, file: !1899, line: 361, baseType: !2216, size: 64, offset: 64)
!2216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2182, size: 64, elements: !2217)
!2217 = !{!2218}
!2218 = !DISubrange(count: 1)
!2219 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !2203, file: !1899, line: 173, baseType: !5, size: 32)
!2220 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !2203, file: !1899, line: 174, baseType: !2221, size: 32)
!2221 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !1899, line: 133, baseType: !2222)
!2222 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1899, line: 115, size: 32, elements: !2223)
!2223 = !{!2224, !2225, !2226, !2227, !2228, !2229, !2230, !2231}
!2224 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !2222, file: !1899, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!2225 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !2222, file: !1899, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!2226 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !2222, file: !1899, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!2227 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !2222, file: !1899, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!2228 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !2222, file: !1899, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!2229 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !2222, file: !1899, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!2230 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !2222, file: !1899, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!2231 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !2222, file: !1899, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!2232 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !2203, file: !1899, line: 175, baseType: !2233, size: 64)
!2233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2234, size: 64)
!2234 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !1899, line: 175, flags: DIFlagFwdDecl)
!2235 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !2203, file: !1899, line: 176, baseType: !2236, size: 64)
!2236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2237, size: 64)
!2237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !2238, line: 75, size: 256, elements: !2239)
!2238 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2239 = !{!2240, !2255, !2256, !2257}
!2240 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !2237, file: !2238, line: 76, baseType: !2241, size: 64)
!2241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2242, size: 64)
!2242 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !2238, line: 68, baseType: !2243)
!2243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !2238, line: 63, size: 320, elements: !2244)
!2244 = !{!2245, !2247, !2248, !2249}
!2245 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2243, file: !2238, line: 64, baseType: !2246, size: 64)
!2246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2243, size: 64)
!2247 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2243, file: !2238, line: 65, baseType: !2246, size: 64, offset: 64)
!2248 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !2243, file: !2238, line: 66, baseType: !7, size: 32, offset: 128)
!2249 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !2243, file: !2238, line: 67, baseType: !2250, size: 128, offset: 192)
!2250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2251, size: 128, elements: !2253)
!2251 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !2238, line: 29, baseType: !2252)
!2252 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!2253 = !{!2254}
!2254 = !DISubrange(count: 2)
!2255 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !2237, file: !2238, line: 77, baseType: !2241, size: 64, offset: 64)
!2256 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !2237, file: !2238, line: 78, baseType: !7, size: 32, offset: 128)
!2257 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !2237, file: !2238, line: 79, baseType: !2258, size: 64, offset: 192)
!2258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2259, size: 64)
!2259 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !2238, line: 49, baseType: !2260)
!2260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !2238, line: 45, size: 832, elements: !2261)
!2261 = !{!2262, !2263, !2264}
!2262 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !2260, file: !2238, line: 46, baseType: !2246, size: 64)
!2263 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !2260, file: !2238, line: 47, baseType: !2236, size: 64, offset: 64)
!2264 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !2260, file: !2238, line: 48, baseType: !2265, size: 704, offset: 128)
!2265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !2266, line: 164, size: 704, elements: !2267)
!2266 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2267 = !{!2268, !2270, !2280, !2281, !2282, !2283, !2284, !2285, !2289, !2293, !2294, !2295, !2296}
!2268 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !2265, file: !2266, line: 166, baseType: !2269, size: 64)
!2269 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!2270 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !2265, file: !2266, line: 167, baseType: !2271, size: 64, offset: 64)
!2271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2272, size: 64)
!2272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !2266, line: 157, size: 192, elements: !2273)
!2273 = !{!2274, !2275, !2276}
!2274 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !2272, file: !2266, line: 159, baseType: !2177, size: 64)
!2275 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2272, file: !2266, line: 160, baseType: !2271, size: 64, offset: 64)
!2276 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !2272, file: !2266, line: 161, baseType: !2277, size: 32, offset: 128)
!2277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2178, size: 32, elements: !2278)
!2278 = !{!2279}
!2279 = !DISubrange(count: 4)
!2280 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !2265, file: !2266, line: 168, baseType: !2177, size: 64, offset: 128)
!2281 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !2265, file: !2266, line: 169, baseType: !2177, size: 64, offset: 192)
!2282 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !2265, file: !2266, line: 170, baseType: !2177, size: 64, offset: 256)
!2283 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !2265, file: !2266, line: 171, baseType: !2269, size: 64, offset: 320)
!2284 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !2265, file: !2266, line: 172, baseType: !2175, size: 32, offset: 384)
!2285 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !2265, file: !2266, line: 176, baseType: !2286, size: 64, offset: 448)
!2286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2287, size: 64)
!2287 = !DISubroutineType(types: !2288)
!2288 = !{!2271, !2179, !2269}
!2289 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !2265, file: !2266, line: 177, baseType: !2290, size: 64, offset: 512)
!2290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2291, size: 64)
!2291 = !DISubroutineType(types: !2292)
!2292 = !{null, !2179, !2271}
!2293 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !2265, file: !2266, line: 178, baseType: !2179, size: 64, offset: 576)
!2294 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !2265, file: !2266, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!2295 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !2265, file: !2266, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!2296 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !2265, file: !2266, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!2297 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !2203, file: !1899, line: 177, baseType: !2298, size: 64)
!2298 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !2183, line: 56, baseType: !2299)
!2299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2300, size: 64)
!2300 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !142, line: 3371, size: 1792, elements: !2301)
!2301 = !{!2302, !2335, !2341, !2352, !2371, !2382, !2387, !2394, !2400, !2413, !2425, !2463, !2468, !2496, !2513, !2514, !2519, !2528, !2534, !2539, !2543, !2547, !3167, !3216, !3222, !3228, !3235, !3248, !3262, !3279, !3291, !3313, !3328, !3500}
!2302 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2300, file: !142, line: 3372, baseType: !2303, size: 64)
!2303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !142, line: 360, size: 64, elements: !2304)
!2304 = !{!2305, !2306, !2307, !2308, !2309, !2310, !2311, !2312, !2313, !2314, !2315, !2316, !2317, !2318, !2319, !2320, !2321, !2322, !2323, !2324, !2325, !2326, !2327, !2328, !2329, !2330, !2331, !2332, !2333, !2334}
!2305 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !2303, file: !142, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!2306 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !2303, file: !142, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!2307 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !2303, file: !142, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!2308 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !2303, file: !142, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!2309 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !2303, file: !142, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!2310 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !2303, file: !142, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!2311 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !2303, file: !142, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!2312 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !2303, file: !142, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!2313 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !2303, file: !142, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!2314 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !2303, file: !142, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!2315 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !2303, file: !142, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!2316 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !2303, file: !142, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!2317 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !2303, file: !142, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!2318 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !2303, file: !142, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!2319 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !2303, file: !142, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!2320 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !2303, file: !142, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!2321 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !2303, file: !142, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!2322 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !2303, file: !142, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!2323 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !2303, file: !142, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!2324 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !2303, file: !142, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!2325 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !2303, file: !142, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!2326 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !2303, file: !142, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!2327 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !2303, file: !142, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!2328 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !2303, file: !142, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!2329 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !2303, file: !142, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!2330 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !2303, file: !142, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!2331 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !2303, file: !142, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!2332 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !2303, file: !142, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!2333 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !2303, file: !142, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!2334 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !2303, file: !142, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!2335 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2300, file: !142, line: 3373, baseType: !2336, size: 192)
!2336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !142, line: 402, size: 192, elements: !2337)
!2337 = !{!2338, !2339, !2340}
!2338 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2336, file: !142, line: 403, baseType: !2303, size: 64)
!2339 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !2336, file: !142, line: 404, baseType: !2298, size: 64, offset: 64)
!2340 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !2336, file: !142, line: 405, baseType: !2298, size: 64, offset: 128)
!2341 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !2300, file: !142, line: 3374, baseType: !2342, size: 320)
!2342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !142, line: 1384, size: 320, elements: !2343)
!2343 = !{!2344, !2345}
!2344 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2342, file: !142, line: 1385, baseType: !2336, size: 192)
!2345 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !2342, file: !142, line: 1386, baseType: !2346, size: 128, offset: 192)
!2346 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !2347, line: 58, baseType: !2348)
!2347 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2348 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2347, line: 54, size: 128, elements: !2349)
!2349 = !{!2350, !2351}
!2350 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !2348, file: !2347, line: 56, baseType: !2252, size: 64)
!2351 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !2348, file: !2347, line: 57, baseType: !2269, size: 64, offset: 64)
!2352 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !2300, file: !142, line: 3375, baseType: !2353, size: 256)
!2353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !142, line: 1397, size: 256, elements: !2354)
!2354 = !{!2355, !2356}
!2355 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2353, file: !142, line: 1398, baseType: !2336, size: 192)
!2356 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !2353, file: !142, line: 1399, baseType: !2357, size: 64, offset: 192)
!2357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2358, size: 64)
!2358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !2359, line: 52, size: 256, elements: !2360)
!2359 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2360 = !{!2361, !2362, !2363, !2364, !2365, !2366, !2367}
!2361 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !2358, file: !2359, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!2362 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !2358, file: !2359, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!2363 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !2358, file: !2359, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!2364 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !2358, file: !2359, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!2365 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !2358, file: !2359, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!2366 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !2358, file: !2359, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!2367 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !2358, file: !2359, line: 62, baseType: !2368, size: 192, offset: 64)
!2368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2252, size: 192, elements: !2369)
!2369 = !{!2370}
!2370 = !DISubrange(count: 3)
!2371 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !2300, file: !142, line: 3376, baseType: !2372, size: 256)
!2372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !142, line: 1408, size: 256, elements: !2373)
!2373 = !{!2374, !2375}
!2374 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2372, file: !142, line: 1409, baseType: !2336, size: 192)
!2375 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !2372, file: !142, line: 1410, baseType: !2376, size: 64, offset: 192)
!2376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2377, size: 64)
!2377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !2378, line: 27, size: 192, elements: !2379)
!2378 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2379 = !{!2380, !2381}
!2380 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !2377, file: !2378, line: 29, baseType: !2346, size: 128)
!2381 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !2377, file: !2378, line: 30, baseType: !5, size: 32, offset: 128)
!2382 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !2300, file: !142, line: 3377, baseType: !2383, size: 256)
!2383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !142, line: 1437, size: 256, elements: !2384)
!2384 = !{!2385, !2386}
!2385 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2383, file: !142, line: 1438, baseType: !2336, size: 192)
!2386 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !2383, file: !142, line: 1439, baseType: !2298, size: 64, offset: 192)
!2387 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !2300, file: !142, line: 3378, baseType: !2388, size: 256)
!2388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !142, line: 1418, size: 256, elements: !2389)
!2389 = !{!2390, !2391, !2392}
!2390 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2388, file: !142, line: 1419, baseType: !2336, size: 192)
!2391 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !2388, file: !142, line: 1420, baseType: !2175, size: 32, offset: 192)
!2392 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !2388, file: !142, line: 1421, baseType: !2393, size: 8, offset: 224)
!2393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2178, size: 8, elements: !2217)
!2394 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !2300, file: !142, line: 3379, baseType: !2395, size: 320)
!2395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !142, line: 1428, size: 320, elements: !2396)
!2396 = !{!2397, !2398, !2399}
!2397 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2395, file: !142, line: 1429, baseType: !2336, size: 192)
!2398 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !2395, file: !142, line: 1430, baseType: !2298, size: 64, offset: 192)
!2399 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !2395, file: !142, line: 1431, baseType: !2298, size: 64, offset: 256)
!2400 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !2300, file: !142, line: 3380, baseType: !2401, size: 320)
!2401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !142, line: 1460, size: 320, elements: !2402)
!2402 = !{!2403, !2404}
!2403 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2401, file: !142, line: 1461, baseType: !2336, size: 192)
!2404 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !2401, file: !142, line: 1462, baseType: !2405, size: 128, offset: 192)
!2405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !2406, line: 31, size: 128, elements: !2407)
!2406 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2407 = !{!2408, !2411, !2412}
!2408 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !2405, file: !2406, line: 32, baseType: !2409, size: 64)
!2409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2410, size: 64)
!2410 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !2174)
!2411 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !2405, file: !2406, line: 33, baseType: !7, size: 32, offset: 64)
!2412 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !2405, file: !2406, line: 34, baseType: !7, size: 32, offset: 96)
!2413 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !2300, file: !142, line: 3381, baseType: !2414, size: 384)
!2414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !142, line: 2507, size: 384, elements: !2415)
!2415 = !{!2416, !2417, !2422, !2423, !2424}
!2416 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2414, file: !142, line: 2508, baseType: !2336, size: 192)
!2417 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !2414, file: !142, line: 2509, baseType: !2418, size: 32, offset: 192)
!2418 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !2419, line: 58, baseType: !2420)
!2419 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2420 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !2421, line: 44, baseType: !7)
!2421 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2422 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !2414, file: !142, line: 2510, baseType: !7, size: 32, offset: 224)
!2423 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2414, file: !142, line: 2511, baseType: !2298, size: 64, offset: 256)
!2424 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !2414, file: !142, line: 2512, baseType: !2298, size: 64, offset: 320)
!2425 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !2300, file: !142, line: 3382, baseType: !2426, size: 896)
!2426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !142, line: 2652, size: 896, elements: !2427)
!2427 = !{!2428, !2429, !2430, !2431, !2432, !2433, !2434, !2435, !2436, !2437, !2438, !2439, !2440, !2441, !2442, !2443, !2444, !2445, !2446, !2447, !2448, !2449, !2450, !2451, !2452, !2453, !2454, !2455, !2456, !2457, !2458, !2459, !2460}
!2428 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2426, file: !142, line: 2653, baseType: !2414, size: 384)
!2429 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2426, file: !142, line: 2654, baseType: !2298, size: 64, offset: 384)
!2430 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !2426, file: !142, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!2431 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !2426, file: !142, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!2432 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !2426, file: !142, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!2433 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !2426, file: !142, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!2434 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !2426, file: !142, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!2435 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !2426, file: !142, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!2436 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !2426, file: !142, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!2437 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !2426, file: !142, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!2438 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !2426, file: !142, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!2439 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !2426, file: !142, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!2440 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !2426, file: !142, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!2441 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !2426, file: !142, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!2442 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !2426, file: !142, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!2443 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !2426, file: !142, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!2444 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !2426, file: !142, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!2445 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !2426, file: !142, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!2446 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !2426, file: !142, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!2447 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !2426, file: !142, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!2448 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !2426, file: !142, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!2449 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !2426, file: !142, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!2450 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !2426, file: !142, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!2451 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !2426, file: !142, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!2452 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !2426, file: !142, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!2453 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !2426, file: !142, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!2454 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !2426, file: !142, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!2455 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !2426, file: !142, line: 2703, baseType: !7, size: 32, offset: 512)
!2456 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !2426, file: !142, line: 2705, baseType: !2298, size: 64, offset: 576)
!2457 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !2426, file: !142, line: 2706, baseType: !2298, size: 64, offset: 640)
!2458 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !2426, file: !142, line: 2707, baseType: !2298, size: 64, offset: 704)
!2459 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !2426, file: !142, line: 2708, baseType: !2298, size: 64, offset: 768)
!2460 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !2426, file: !142, line: 2711, baseType: !2461, size: 64, offset: 832)
!2461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2462, size: 64)
!2462 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !142, line: 2711, flags: DIFlagFwdDecl)
!2463 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !2300, file: !142, line: 3383, baseType: !2464, size: 960)
!2464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !142, line: 2756, size: 960, elements: !2465)
!2465 = !{!2466, !2467}
!2466 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2464, file: !142, line: 2757, baseType: !2426, size: 896)
!2467 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !2464, file: !142, line: 2758, baseType: !2182, size: 64, offset: 896)
!2468 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !2300, file: !142, line: 3384, baseType: !2469, size: 1472)
!2469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !142, line: 3114, size: 1472, elements: !2470)
!2470 = !{!2471, !2492, !2493, !2494, !2495}
!2471 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2469, file: !142, line: 3115, baseType: !2472, size: 1216)
!2472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !142, line: 2984, size: 1216, elements: !2473)
!2473 = !{!2474, !2475, !2476, !2477, !2478, !2479, !2480, !2481, !2482, !2483, !2484, !2485, !2486, !2487, !2488, !2489, !2490, !2491}
!2474 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2472, file: !142, line: 2985, baseType: !2464, size: 960)
!2475 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !2472, file: !142, line: 2986, baseType: !2298, size: 64, offset: 960)
!2476 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !2472, file: !142, line: 2987, baseType: !2298, size: 64, offset: 1024)
!2477 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !2472, file: !142, line: 2988, baseType: !2298, size: 64, offset: 1088)
!2478 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !2472, file: !142, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!2479 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !2472, file: !142, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!2480 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !2472, file: !142, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!2481 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !2472, file: !142, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!2482 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !2472, file: !142, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!2483 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !2472, file: !142, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!2484 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !2472, file: !142, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!2485 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !2472, file: !142, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!2486 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !2472, file: !142, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!2487 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !2472, file: !142, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!2488 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !2472, file: !142, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!2489 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !2472, file: !142, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!2490 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !2472, file: !142, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!2491 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !2472, file: !142, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!2492 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !2469, file: !142, line: 3117, baseType: !2298, size: 64, offset: 1216)
!2493 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !2469, file: !142, line: 3119, baseType: !2298, size: 64, offset: 1280)
!2494 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !2469, file: !142, line: 3121, baseType: !2298, size: 64, offset: 1344)
!2495 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !2469, file: !142, line: 3123, baseType: !2298, size: 64, offset: 1408)
!2496 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !2300, file: !142, line: 3385, baseType: !2497, size: 1088)
!2497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !142, line: 2874, size: 1088, elements: !2498)
!2498 = !{!2499, !2500, !2501}
!2499 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2497, file: !142, line: 2875, baseType: !2464, size: 960)
!2500 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !2497, file: !142, line: 2876, baseType: !2182, size: 64, offset: 960)
!2501 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2497, file: !142, line: 2877, baseType: !2502, size: 64, offset: 1024)
!2502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2503, size: 64)
!2503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !2504, line: 172, size: 128, elements: !2505)
!2504 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2505 = !{!2506, !2507, !2508, !2509, !2510, !2511, !2512}
!2506 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !2503, file: !2504, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!2507 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !2503, file: !2504, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!2508 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !2503, file: !2504, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!2509 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !2503, file: !2504, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!2510 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !2503, file: !2504, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!2511 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !2503, file: !2504, line: 195, baseType: !7, size: 32, offset: 32)
!2512 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !2503, file: !2504, line: 199, baseType: !2298, size: 64, offset: 64)
!2513 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !2300, file: !142, line: 3386, baseType: !2472, size: 1216)
!2514 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !2300, file: !142, line: 3387, baseType: !2515, size: 1280)
!2515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !142, line: 3093, size: 1280, elements: !2516)
!2516 = !{!2517, !2518}
!2517 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2515, file: !142, line: 3094, baseType: !2472, size: 1216)
!2518 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2515, file: !142, line: 3095, baseType: !2502, size: 64, offset: 1216)
!2519 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !2300, file: !142, line: 3388, baseType: !2520, size: 1216)
!2520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !142, line: 2824, size: 1216, elements: !2521)
!2521 = !{!2522, !2523, !2524, !2525, !2526, !2527}
!2522 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2520, file: !142, line: 2825, baseType: !2426, size: 896)
!2523 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2520, file: !142, line: 2827, baseType: !2298, size: 64, offset: 896)
!2524 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !2520, file: !142, line: 2828, baseType: !2298, size: 64, offset: 960)
!2525 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !2520, file: !142, line: 2829, baseType: !2298, size: 64, offset: 1024)
!2526 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !2520, file: !142, line: 2830, baseType: !2298, size: 64, offset: 1088)
!2527 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !2520, file: !142, line: 2831, baseType: !2298, size: 64, offset: 1152)
!2528 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !2300, file: !142, line: 3389, baseType: !2529, size: 1024)
!2529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !142, line: 2850, size: 1024, elements: !2530)
!2530 = !{!2531, !2532, !2533}
!2531 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2529, file: !142, line: 2851, baseType: !2464, size: 960)
!2532 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !2529, file: !142, line: 2852, baseType: !2175, size: 32, offset: 960)
!2533 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !2529, file: !142, line: 2853, baseType: !2175, size: 32, offset: 992)
!2534 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !2300, file: !142, line: 3390, baseType: !2535, size: 1024)
!2535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !142, line: 2857, size: 1024, elements: !2536)
!2536 = !{!2537, !2538}
!2537 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2535, file: !142, line: 2858, baseType: !2464, size: 960)
!2538 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2535, file: !142, line: 2859, baseType: !2502, size: 64, offset: 960)
!2539 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !2300, file: !142, line: 3391, baseType: !2540, size: 960)
!2540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !142, line: 2862, size: 960, elements: !2541)
!2541 = !{!2542}
!2542 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2540, file: !142, line: 2863, baseType: !2464, size: 960)
!2543 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !2300, file: !142, line: 3392, baseType: !2544, size: 1472)
!2544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !142, line: 3304, size: 1472, elements: !2545)
!2545 = !{!2546}
!2546 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2544, file: !142, line: 3305, baseType: !2469, size: 1472)
!2547 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !2300, file: !142, line: 3393, baseType: !2548, size: 1792)
!2548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !142, line: 3248, size: 1792, elements: !2549)
!2549 = !{!2550, !2551, !3146, !3147, !3148, !3149, !3150, !3151, !3152, !3153, !3154, !3155, !3156, !3157, !3158, !3159, !3160, !3161, !3162, !3163, !3164, !3165, !3166}
!2550 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2548, file: !142, line: 3249, baseType: !2469, size: 1472)
!2551 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !2548, file: !142, line: 3251, baseType: !2552, size: 64, offset: 1472)
!2552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2553, size: 64)
!2553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !2554, line: 463, size: 1152, elements: !2555)
!2554 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2555 = !{!2556, !2720, !3032, !3033, !3087, !3090, !3091, !3092, !3093, !3094, !3095, !3119, !3122, !3123, !3124, !3125, !3126, !3127, !3128, !3129, !3130, !3131, !3132, !3133, !3134, !3135, !3136, !3137, !3138, !3139, !3140, !3141, !3142, !3143, !3144, !3145}
!2556 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !2553, file: !2554, line: 464, baseType: !2557, size: 64)
!2557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2558, size: 64)
!2558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !135, line: 194, size: 384, elements: !2559)
!2559 = !{!2560, !2609, !2622, !2636, !2688, !2701}
!2560 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !2558, file: !135, line: 197, baseType: !2561, size: 64)
!2561 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !135, line: 182, baseType: !2562)
!2562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2563, size: 64)
!2563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !135, line: 116, size: 704, elements: !2564)
!2564 = !{!2565, !2566, !2567, !2568, !2569, !2570, !2597, !2606, !2607, !2608}
!2565 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !2563, file: !135, line: 119, baseType: !2562, size: 64)
!2566 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !2563, file: !135, line: 122, baseType: !2562, size: 64, offset: 64)
!2567 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !2563, file: !135, line: 123, baseType: !2562, size: 64, offset: 128)
!2568 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !2563, file: !135, line: 126, baseType: !2175, size: 32, offset: 192)
!2569 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !2563, file: !135, line: 129, baseType: !134, size: 32, offset: 224)
!2570 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !2563, file: !135, line: 165, baseType: !2571, size: 192, offset: 256)
!2571 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !135, line: 132, size: 192, elements: !2572)
!2572 = !{!2573, !2586, !2592}
!2573 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !2571, file: !135, line: 137, baseType: !2574, size: 128)
!2574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !135, line: 133, size: 128, elements: !2575)
!2575 = !{!2576, !2585}
!2576 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !2574, file: !135, line: 135, baseType: !2577, size: 64)
!2577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2578, size: 64)
!2578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !135, line: 93, size: 320, elements: !2579)
!2579 = !{!2580, !2581, !2582, !2583, !2584}
!2580 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !2578, file: !135, line: 96, baseType: !2577, size: 64)
!2581 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !2578, file: !135, line: 97, baseType: !2577, size: 64, offset: 64)
!2582 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !2578, file: !135, line: 101, baseType: !2298, size: 64, offset: 128)
!2583 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !2578, file: !135, line: 106, baseType: !2298, size: 64, offset: 192)
!2584 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !2578, file: !135, line: 111, baseType: !2298, size: 64, offset: 256)
!2585 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !2574, file: !135, line: 136, baseType: !2577, size: 64, offset: 64)
!2586 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !2571, file: !135, line: 151, baseType: !2587, size: 192)
!2587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !135, line: 139, size: 192, elements: !2588)
!2588 = !{!2589, !2590, !2591}
!2589 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !2587, file: !135, line: 141, baseType: !2298, size: 64)
!2590 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !2587, file: !135, line: 145, baseType: !2298, size: 64, offset: 64)
!2591 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !2587, file: !135, line: 150, baseType: !2175, size: 32, offset: 128)
!2592 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !2571, file: !135, line: 164, baseType: !2593, size: 128)
!2593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !135, line: 153, size: 128, elements: !2594)
!2594 = !{!2595, !2596}
!2595 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !2593, file: !135, line: 161, baseType: !2298, size: 64)
!2596 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !2593, file: !135, line: 163, baseType: !2418, size: 32, offset: 64)
!2597 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !2563, file: !135, line: 168, baseType: !2598, size: 64, offset: 448)
!2598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2599, size: 64)
!2599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !135, line: 67, size: 320, elements: !2600)
!2600 = !{!2601, !2602, !2603, !2604, !2605}
!2601 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !2599, file: !135, line: 70, baseType: !2598, size: 64)
!2602 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !2599, file: !135, line: 73, baseType: !2562, size: 64, offset: 64)
!2603 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !2599, file: !135, line: 78, baseType: !2298, size: 64, offset: 128)
!2604 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !2599, file: !135, line: 85, baseType: !2182, size: 64, offset: 192)
!2605 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !2599, file: !135, line: 88, baseType: !2175, size: 32, offset: 256)
!2606 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !2563, file: !135, line: 173, baseType: !2182, size: 64, offset: 512)
!2607 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !2563, file: !135, line: 173, baseType: !2182, size: 64, offset: 576)
!2608 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !2563, file: !135, line: 177, baseType: !2174, size: 8, offset: 640)
!2609 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !2558, file: !135, line: 200, baseType: !2610, size: 64, offset: 64)
!2610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2611, size: 64)
!2611 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !135, line: 185, baseType: !2612)
!2612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !135, line: 185, size: 128, elements: !2613)
!2613 = !{!2614}
!2614 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2612, file: !135, line: 185, baseType: !2615, size: 128)
!2615 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !135, line: 184, baseType: !2616)
!2616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !135, line: 184, size: 128, elements: !2617)
!2617 = !{!2618, !2619, !2620}
!2618 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2616, file: !135, line: 184, baseType: !7, size: 32)
!2619 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2616, file: !135, line: 184, baseType: !7, size: 32, offset: 32)
!2620 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2616, file: !135, line: 184, baseType: !2621, size: 64, offset: 64)
!2621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2561, size: 64, elements: !2217)
!2622 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !2558, file: !135, line: 203, baseType: !2623, size: 64, offset: 128)
!2623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2624, size: 64)
!2624 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, baseType: !2625)
!2625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, size: 128, elements: !2626)
!2626 = !{!2627}
!2627 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2625, file: !135, line: 189, baseType: !2628, size: 128)
!2628 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !135, line: 188, baseType: !2629)
!2629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !135, line: 188, size: 128, elements: !2630)
!2630 = !{!2631, !2632, !2633}
!2631 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2629, file: !135, line: 188, baseType: !7, size: 32)
!2632 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2629, file: !135, line: 188, baseType: !7, size: 32, offset: 32)
!2633 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2629, file: !135, line: 188, baseType: !2634, size: 64, offset: 64)
!2634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2635, size: 64, elements: !2217)
!2635 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !135, line: 180, baseType: !2598)
!2636 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !2558, file: !135, line: 207, baseType: !2637, size: 64, offset: 192)
!2637 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !2638, line: 144, baseType: !2639)
!2638 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2640, size: 64)
!2640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !2638, line: 100, size: 896, elements: !2641)
!2641 = !{!2642, !2650, !2655, !2660, !2662, !2665, !2666, !2667, !2668, !2669, !2674, !2676, !2677, !2682, !2687}
!2642 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !2640, file: !2638, line: 102, baseType: !2643, size: 64)
!2643 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !2638, line: 52, baseType: !2644)
!2644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2645, size: 64)
!2645 = !DISubroutineType(types: !2646)
!2646 = !{!2647, !2648}
!2647 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !2638, line: 47, baseType: !7)
!2648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2649, size: 64)
!2649 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!2650 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !2640, file: !2638, line: 105, baseType: !2651, size: 64, offset: 64)
!2651 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !2638, line: 59, baseType: !2652)
!2652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2653, size: 64)
!2653 = !DISubroutineType(types: !2654)
!2654 = !{!2175, !2648, !2648}
!2655 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !2640, file: !2638, line: 108, baseType: !2656, size: 64, offset: 128)
!2656 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !2638, line: 63, baseType: !2657)
!2657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2658, size: 64)
!2658 = !DISubroutineType(types: !2659)
!2659 = !{null, !2179}
!2660 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !2640, file: !2638, line: 111, baseType: !2661, size: 64, offset: 192)
!2661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2179, size: 64)
!2662 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2640, file: !2638, line: 114, baseType: !2663, size: 64, offset: 256)
!2663 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !2664, line: 46, baseType: !2252)
!2664 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!2665 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !2640, file: !2638, line: 117, baseType: !2663, size: 64, offset: 320)
!2666 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !2640, file: !2638, line: 120, baseType: !2663, size: 64, offset: 384)
!2667 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !2640, file: !2638, line: 124, baseType: !7, size: 32, offset: 448)
!2668 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !2640, file: !2638, line: 128, baseType: !7, size: 32, offset: 480)
!2669 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !2640, file: !2638, line: 131, baseType: !2670, size: 64, offset: 512)
!2670 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !2638, line: 75, baseType: !2671)
!2671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2672, size: 64)
!2672 = !DISubroutineType(types: !2673)
!2673 = !{!2179, !2663, !2663}
!2674 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !2640, file: !2638, line: 132, baseType: !2675, size: 64, offset: 576)
!2675 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !2638, line: 78, baseType: !2657)
!2676 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !2640, file: !2638, line: 135, baseType: !2179, size: 64, offset: 640)
!2677 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !2640, file: !2638, line: 136, baseType: !2678, size: 64, offset: 704)
!2678 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !2638, line: 82, baseType: !2679)
!2679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2680, size: 64)
!2680 = !DISubroutineType(types: !2681)
!2681 = !{!2179, !2179, !2663, !2663}
!2682 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !2640, file: !2638, line: 137, baseType: !2683, size: 64, offset: 768)
!2683 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !2638, line: 83, baseType: !2684)
!2684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2685, size: 64)
!2685 = !DISubroutineType(types: !2686)
!2686 = !{null, !2179, !2179}
!2687 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !2640, file: !2638, line: 141, baseType: !7, size: 32, offset: 832)
!2688 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !2558, file: !135, line: 211, baseType: !2689, size: 64, offset: 256)
!2689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2690, size: 64)
!2690 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !142, line: 183, baseType: !2691)
!2691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !142, line: 183, size: 128, elements: !2692)
!2692 = !{!2693}
!2693 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2691, file: !142, line: 183, baseType: !2694, size: 128)
!2694 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !142, line: 182, baseType: !2695)
!2695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !142, line: 182, size: 128, elements: !2696)
!2696 = !{!2697, !2698, !2699}
!2697 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2695, file: !142, line: 182, baseType: !7, size: 32)
!2698 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2695, file: !142, line: 182, baseType: !7, size: 32, offset: 32)
!2699 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2695, file: !142, line: 182, baseType: !2700, size: 64, offset: 64)
!2700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2298, size: 64, elements: !2217)
!2701 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !2558, file: !135, line: 220, baseType: !2702, size: 64, offset: 320)
!2702 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !135, line: 217, size: 64, elements: !2703)
!2703 = !{!2704, !2705}
!2704 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !2702, file: !135, line: 218, baseType: !2689, size: 64)
!2705 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !2702, file: !135, line: 219, baseType: !2706, size: 64)
!2706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2707, size: 64)
!2707 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !2708, line: 29, baseType: !2709)
!2708 = !DIFile(filename: "./vecprim.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !2708, line: 29, size: 96, elements: !2710)
!2710 = !{!2711}
!2711 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2709, file: !2708, line: 29, baseType: !2712, size: 96)
!2712 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !2708, line: 27, baseType: !2713)
!2713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !2708, line: 27, size: 96, elements: !2714)
!2714 = !{!2715, !2716, !2717}
!2715 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2713, file: !2708, line: 27, baseType: !7, size: 32)
!2716 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2713, file: !2708, line: 27, baseType: !7, size: 32, offset: 32)
!2717 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2713, file: !2708, line: 27, baseType: !2718, size: 8, offset: 64)
!2718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2719, size: 8, elements: !2217)
!2719 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !2708, line: 26, baseType: !2174)
!2720 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !2553, file: !2554, line: 467, baseType: !2721, size: 64, offset: 64)
!2721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2722, size: 64)
!2722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !337, line: 374, size: 640, elements: !2723)
!2723 = !{!2724, !3007, !3008, !3021, !3022, !3023, !3024, !3025, !3026, !3028, !3030, !3031}
!2724 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !2722, file: !337, line: 377, baseType: !2725, size: 64)
!2725 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !2183, line: 111, baseType: !2726)
!2726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2727, size: 64)
!2727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !337, line: 217, size: 832, elements: !2728)
!2728 = !{!2729, !2972, !2973, !2974, !2977, !2981, !2982, !2983, !3001, !3002, !3003, !3004, !3005, !3006}
!2729 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !2727, file: !337, line: 219, baseType: !2730, size: 64)
!2730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2731, size: 64)
!2731 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !337, line: 151, baseType: !2732)
!2732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !337, line: 151, size: 128, elements: !2733)
!2733 = !{!2734}
!2734 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2732, file: !337, line: 151, baseType: !2735, size: 128)
!2735 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !337, line: 150, baseType: !2736)
!2736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !337, line: 150, size: 128, elements: !2737)
!2737 = !{!2738, !2739, !2740}
!2738 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2736, file: !337, line: 150, baseType: !7, size: 32)
!2739 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2736, file: !337, line: 150, baseType: !7, size: 32, offset: 32)
!2740 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2736, file: !337, line: 150, baseType: !2741, size: 64, offset: 64)
!2741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2742, size: 64, elements: !2217)
!2742 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !2183, line: 108, baseType: !2743)
!2743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2744, size: 64)
!2744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !337, line: 122, size: 512, elements: !2745)
!2745 = !{!2746, !2747, !2748, !2964, !2965, !2966, !2967, !2968, !2969, !2970}
!2746 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !2744, file: !337, line: 124, baseType: !2726, size: 64)
!2747 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !2744, file: !337, line: 125, baseType: !2726, size: 64, offset: 64)
!2748 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !2744, file: !337, line: 131, baseType: !2749, size: 64, offset: 128)
!2749 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !337, line: 128, size: 64, elements: !2750)
!2750 = !{!2751, !2963}
!2751 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !2749, file: !337, line: 129, baseType: !2752, size: 64)
!2752 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !2183, line: 66, baseType: !2753)
!2753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2754, size: 64)
!2754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !2102, line: 143, size: 192, elements: !2755)
!2755 = !{!2756, !2961, !2962}
!2756 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !2754, file: !2102, line: 145, baseType: !2757, size: 64)
!2757 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !2183, line: 69, baseType: !2758)
!2758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2759, size: 64)
!2759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !2102, line: 136, size: 192, elements: !2760)
!2760 = !{!2761, !2959, !2960}
!2761 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !2759, file: !2102, line: 137, baseType: !2762, size: 64)
!2762 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !2183, line: 58, baseType: !2763)
!2763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2764, size: 64)
!2764 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !2102, line: 737, size: 768, elements: !2765)
!2765 = !{!2766, !2783, !2816, !2822, !2827, !2832, !2839, !2845, !2851, !2856, !2870, !2875, !2881, !2886, !2896, !2901, !2917, !2924, !2931, !2937, !2942, !2948, !2954}
!2766 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2764, file: !2102, line: 738, baseType: !2767, size: 256)
!2767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !2102, line: 271, size: 256, elements: !2768)
!2768 = !{!2769, !2770, !2771, !2772, !2773, !2774, !2775, !2776, !2777, !2778, !2779, !2780, !2781, !2782}
!2769 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !2767, file: !2102, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!2770 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !2767, file: !2102, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!2771 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !2767, file: !2102, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!2772 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !2767, file: !2102, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!2773 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !2767, file: !2102, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!2774 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !2767, file: !2102, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!2775 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !2767, file: !2102, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!2776 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !2767, file: !2102, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!2777 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !2767, file: !2102, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!2778 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !2767, file: !2102, line: 312, baseType: !7, size: 32, offset: 32)
!2779 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !2767, file: !2102, line: 316, baseType: !2418, size: 32, offset: 64)
!2780 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !2767, file: !2102, line: 319, baseType: !7, size: 32, offset: 96)
!2781 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !2767, file: !2102, line: 323, baseType: !2726, size: 64, offset: 128)
!2782 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !2767, file: !2102, line: 327, baseType: !2298, size: 64, offset: 192)
!2783 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !2764, file: !2102, line: 739, baseType: !2784, size: 448)
!2784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !2102, line: 350, size: 448, elements: !2785)
!2785 = !{!2786, !2815}
!2786 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !2784, file: !2102, line: 353, baseType: !2787, size: 384)
!2787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !2102, line: 333, size: 384, elements: !2788)
!2788 = !{!2789, !2790, !2798}
!2789 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2787, file: !2102, line: 336, baseType: !2767, size: 256)
!2790 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !2787, file: !2102, line: 343, baseType: !2791, size: 64, offset: 256)
!2791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2792, size: 64)
!2792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !2793, line: 37, size: 128, elements: !2794)
!2793 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2794 = !{!2795, !2796}
!2795 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2792, file: !2793, line: 39, baseType: !2791, size: 64)
!2796 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !2792, file: !2793, line: 40, baseType: !2797, size: 64, offset: 64)
!2797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2298, size: 64)
!2798 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !2787, file: !2102, line: 344, baseType: !2799, size: 64, offset: 320)
!2799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2800, size: 64)
!2800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !2793, line: 45, size: 320, elements: !2801)
!2801 = !{!2802, !2803}
!2802 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2800, file: !2793, line: 47, baseType: !2799, size: 64)
!2803 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !2800, file: !2793, line: 48, baseType: !2804, size: 256, offset: 64)
!2804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !142, line: 1883, size: 256, elements: !2805)
!2805 = !{!2806, !2808, !2809, !2814}
!2806 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2804, file: !142, line: 1884, baseType: !2807, size: 64)
!2807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2804, size: 64)
!2808 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2804, file: !142, line: 1885, baseType: !2807, size: 64, offset: 64)
!2809 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !2804, file: !142, line: 1891, baseType: !2810, size: 64, offset: 128)
!2810 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !2804, file: !142, line: 1891, size: 64, elements: !2811)
!2811 = !{!2812, !2813}
!2812 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !2810, file: !142, line: 1891, baseType: !2762, size: 64)
!2813 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !2810, file: !142, line: 1891, baseType: !2298, size: 64)
!2814 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !2804, file: !142, line: 1892, baseType: !2797, size: 64, offset: 192)
!2815 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !2784, file: !2102, line: 359, baseType: !2700, size: 64, offset: 384)
!2816 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !2764, file: !2102, line: 740, baseType: !2817, size: 512)
!2817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !2102, line: 365, size: 512, elements: !2818)
!2818 = !{!2819, !2820, !2821}
!2819 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !2817, file: !2102, line: 368, baseType: !2787, size: 384)
!2820 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !2817, file: !2102, line: 373, baseType: !2298, size: 64, offset: 384)
!2821 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !2817, file: !2102, line: 374, baseType: !2298, size: 64, offset: 448)
!2822 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !2764, file: !2102, line: 741, baseType: !2823, size: 576)
!2823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !2102, line: 380, size: 576, elements: !2824)
!2824 = !{!2825, !2826}
!2825 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !2823, file: !2102, line: 383, baseType: !2817, size: 512)
!2826 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !2823, file: !2102, line: 389, baseType: !2700, size: 64, offset: 512)
!2827 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !2764, file: !2102, line: 742, baseType: !2828, size: 320)
!2828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !2102, line: 395, size: 320, elements: !2829)
!2829 = !{!2830, !2831}
!2830 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2828, file: !2102, line: 397, baseType: !2767, size: 256)
!2831 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !2828, file: !2102, line: 400, baseType: !2752, size: 64, offset: 256)
!2832 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !2764, file: !2102, line: 743, baseType: !2833, size: 448)
!2833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !2102, line: 406, size: 448, elements: !2834)
!2834 = !{!2835, !2836, !2837, !2838}
!2835 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2833, file: !2102, line: 408, baseType: !2767, size: 256)
!2836 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !2833, file: !2102, line: 412, baseType: !2298, size: 64, offset: 256)
!2837 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !2833, file: !2102, line: 420, baseType: !2298, size: 64, offset: 320)
!2838 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !2833, file: !2102, line: 423, baseType: !2752, size: 64, offset: 384)
!2839 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !2764, file: !2102, line: 744, baseType: !2840, size: 384)
!2840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !2102, line: 429, size: 384, elements: !2841)
!2841 = !{!2842, !2843, !2844}
!2842 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2840, file: !2102, line: 431, baseType: !2767, size: 256)
!2843 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !2840, file: !2102, line: 434, baseType: !2298, size: 64, offset: 256)
!2844 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !2840, file: !2102, line: 437, baseType: !2752, size: 64, offset: 320)
!2845 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !2764, file: !2102, line: 745, baseType: !2846, size: 384)
!2846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !2102, line: 443, size: 384, elements: !2847)
!2847 = !{!2848, !2849, !2850}
!2848 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2846, file: !2102, line: 445, baseType: !2767, size: 256)
!2849 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !2846, file: !2102, line: 449, baseType: !2298, size: 64, offset: 256)
!2850 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !2846, file: !2102, line: 453, baseType: !2752, size: 64, offset: 320)
!2851 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !2764, file: !2102, line: 746, baseType: !2852, size: 320)
!2852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !2102, line: 459, size: 320, elements: !2853)
!2853 = !{!2854, !2855}
!2854 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2852, file: !2102, line: 461, baseType: !2767, size: 256)
!2855 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !2852, file: !2102, line: 464, baseType: !2298, size: 64, offset: 256)
!2856 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !2764, file: !2102, line: 747, baseType: !2857, size: 768)
!2857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !2102, line: 469, size: 768, elements: !2858)
!2858 = !{!2859, !2860, !2861, !2862, !2863}
!2859 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2857, file: !2102, line: 471, baseType: !2767, size: 256)
!2860 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !2857, file: !2102, line: 474, baseType: !7, size: 32, offset: 256)
!2861 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !2857, file: !2102, line: 475, baseType: !7, size: 32, offset: 288)
!2862 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !2857, file: !2102, line: 478, baseType: !2298, size: 64, offset: 320)
!2863 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !2857, file: !2102, line: 481, baseType: !2864, size: 384, offset: 384)
!2864 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2865, size: 384, elements: !2217)
!2865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !142, line: 1917, size: 384, elements: !2866)
!2866 = !{!2867, !2868, !2869}
!2867 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !2865, file: !142, line: 1920, baseType: !2804, size: 256)
!2868 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !2865, file: !142, line: 1921, baseType: !2298, size: 64, offset: 256)
!2869 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !2865, file: !142, line: 1922, baseType: !2418, size: 32, offset: 320)
!2870 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !2764, file: !2102, line: 748, baseType: !2871, size: 320)
!2871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !2102, line: 487, size: 320, elements: !2872)
!2872 = !{!2873, !2874}
!2873 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2871, file: !2102, line: 490, baseType: !2767, size: 256)
!2874 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !2871, file: !2102, line: 494, baseType: !2175, size: 32, offset: 256)
!2875 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !2764, file: !2102, line: 749, baseType: !2876, size: 384)
!2876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !2102, line: 500, size: 384, elements: !2877)
!2877 = !{!2878, !2879, !2880}
!2878 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2876, file: !2102, line: 502, baseType: !2767, size: 256)
!2879 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !2876, file: !2102, line: 506, baseType: !2752, size: 64, offset: 256)
!2880 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !2876, file: !2102, line: 510, baseType: !2752, size: 64, offset: 320)
!2881 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !2764, file: !2102, line: 750, baseType: !2882, size: 320)
!2882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !2102, line: 529, size: 320, elements: !2883)
!2883 = !{!2884, !2885}
!2884 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2882, file: !2102, line: 531, baseType: !2767, size: 256)
!2885 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !2882, file: !2102, line: 540, baseType: !2752, size: 64, offset: 256)
!2886 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !2764, file: !2102, line: 751, baseType: !2887, size: 704)
!2887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !2102, line: 546, size: 704, elements: !2888)
!2888 = !{!2889, !2890, !2891, !2892, !2893, !2894, !2895}
!2889 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !2887, file: !2102, line: 549, baseType: !2817, size: 512)
!2890 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !2887, file: !2102, line: 553, baseType: !2180, size: 64, offset: 512)
!2891 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !2887, file: !2102, line: 557, baseType: !2174, size: 8, offset: 576)
!2892 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !2887, file: !2102, line: 558, baseType: !2174, size: 8, offset: 584)
!2893 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !2887, file: !2102, line: 559, baseType: !2174, size: 8, offset: 592)
!2894 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !2887, file: !2102, line: 560, baseType: !2174, size: 8, offset: 600)
!2895 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !2887, file: !2102, line: 566, baseType: !2700, size: 64, offset: 640)
!2896 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !2764, file: !2102, line: 752, baseType: !2897, size: 384)
!2897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !2102, line: 571, size: 384, elements: !2898)
!2898 = !{!2899, !2900}
!2899 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !2897, file: !2102, line: 573, baseType: !2828, size: 320)
!2900 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2897, file: !2102, line: 577, baseType: !2298, size: 64, offset: 320)
!2901 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !2764, file: !2102, line: 753, baseType: !2902, size: 576)
!2902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !2102, line: 600, size: 576, elements: !2903)
!2903 = !{!2904, !2905, !2906, !2907, !2916}
!2904 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !2902, file: !2102, line: 602, baseType: !2828, size: 320)
!2905 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !2902, file: !2102, line: 605, baseType: !2298, size: 64, offset: 320)
!2906 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !2902, file: !2102, line: 609, baseType: !2663, size: 64, offset: 384)
!2907 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !2902, file: !2102, line: 612, baseType: !2908, size: 64, offset: 448)
!2908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2909, size: 64)
!2909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !2102, line: 581, size: 320, elements: !2910)
!2910 = !{!2911, !2912, !2913, !2914, !2915}
!2911 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !2909, file: !2102, line: 583, baseType: !141, size: 32)
!2912 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !2909, file: !2102, line: 586, baseType: !2298, size: 64, offset: 64)
!2913 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !2909, file: !2102, line: 589, baseType: !2298, size: 64, offset: 128)
!2914 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !2909, file: !2102, line: 592, baseType: !2298, size: 64, offset: 192)
!2915 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !2909, file: !2102, line: 595, baseType: !2298, size: 64, offset: 256)
!2916 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !2902, file: !2102, line: 616, baseType: !2752, size: 64, offset: 512)
!2917 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !2764, file: !2102, line: 754, baseType: !2918, size: 512)
!2918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !2102, line: 622, size: 512, elements: !2919)
!2919 = !{!2920, !2921, !2922, !2923}
!2920 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !2918, file: !2102, line: 624, baseType: !2828, size: 320)
!2921 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !2918, file: !2102, line: 628, baseType: !2298, size: 64, offset: 320)
!2922 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !2918, file: !2102, line: 632, baseType: !2298, size: 64, offset: 384)
!2923 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !2918, file: !2102, line: 636, baseType: !2298, size: 64, offset: 448)
!2924 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !2764, file: !2102, line: 755, baseType: !2925, size: 704)
!2925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !2102, line: 642, size: 704, elements: !2926)
!2926 = !{!2927, !2928, !2929, !2930}
!2927 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !2925, file: !2102, line: 644, baseType: !2918, size: 512)
!2928 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !2925, file: !2102, line: 648, baseType: !2298, size: 64, offset: 512)
!2929 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !2925, file: !2102, line: 652, baseType: !2298, size: 64, offset: 576)
!2930 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !2925, file: !2102, line: 653, baseType: !2298, size: 64, offset: 640)
!2931 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !2764, file: !2102, line: 756, baseType: !2932, size: 448)
!2932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !2102, line: 663, size: 448, elements: !2933)
!2933 = !{!2934, !2935, !2936}
!2934 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !2932, file: !2102, line: 665, baseType: !2828, size: 320)
!2935 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !2932, file: !2102, line: 668, baseType: !2298, size: 64, offset: 320)
!2936 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !2932, file: !2102, line: 673, baseType: !2298, size: 64, offset: 384)
!2937 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !2764, file: !2102, line: 757, baseType: !2938, size: 384)
!2938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !2102, line: 694, size: 384, elements: !2939)
!2939 = !{!2940, !2941}
!2940 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !2938, file: !2102, line: 696, baseType: !2828, size: 320)
!2941 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !2938, file: !2102, line: 699, baseType: !2298, size: 64, offset: 320)
!2942 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !2764, file: !2102, line: 758, baseType: !2943, size: 384)
!2943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !2102, line: 681, size: 384, elements: !2944)
!2944 = !{!2945, !2946, !2947}
!2945 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2943, file: !2102, line: 683, baseType: !2767, size: 256)
!2946 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !2943, file: !2102, line: 686, baseType: !2298, size: 64, offset: 256)
!2947 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !2943, file: !2102, line: 689, baseType: !2298, size: 64, offset: 320)
!2948 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !2764, file: !2102, line: 759, baseType: !2949, size: 384)
!2949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !2102, line: 707, size: 384, elements: !2950)
!2950 = !{!2951, !2952, !2953}
!2951 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2949, file: !2102, line: 709, baseType: !2767, size: 256)
!2952 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !2949, file: !2102, line: 712, baseType: !2298, size: 64, offset: 256)
