; ModuleID = 'fibheap.bc'
source_filename = "fibheap.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.fibheap = type { i64, %struct.fibnode*, %struct.fibnode* }
%struct.fibnode = type { %struct.fibnode*, %struct.fibnode*, %struct.fibnode*, %struct.fibnode*, i64, i8*, i32 }

@stdout = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@stdin = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@stderr = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [33 x i8] c"Can't force minimum on fibheap.\0A\00", align 1

; Function Attrs: inlinehint nounwind uwtable
define dso_local i32 @atoi(i8* %__nptr) local_unnamed_addr #0 !dbg !43 {
entry:
  call void @llvm.dbg.value(metadata i8* %__nptr, metadata !48, metadata !DIExpression()), !dbg !49
  %call = tail call i64 @strtol(i8* %__nptr, i8** null, i32 10) #6, !dbg !50
  %conv = trunc i64 %call to i32, !dbg !51
  ret i32 %conv, !dbg !52
}


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, nameTableKind: None)
!1 = !DIFile(filename: "fibheap.c", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2 = !{}
!3 = !{!4, !5, !8, !9, !11, !12, !13, !38}
!4 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "fibheap_t", file: !14, line: 57, baseType: !15)
!14 = !DIFile(filename: "./include/fibheap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fibheap", file: !14, line: 52, size: 192, elements: !17)
!17 = !{!18, !22, !37}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !16, file: !14, line: 54, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !20, line: 46, baseType: !21)
!20 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!21 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !16, file: !14, line: 55, baseType: !23, size: 64, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fibnode", file: !14, line: 59, size: 448, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !33, !34, !36}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !24, file: !14, line: 61, baseType: !23, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !24, file: !14, line: 62, baseType: !23, size: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !24, file: !14, line: 63, baseType: !23, size: 64, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !24, file: !14, line: 64, baseType: !23, size: 64, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !24, file: !14, line: 65, baseType: !31, size: 64, offset: 256)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "fibheapkey_t", file: !14, line: 50, baseType: !32)
!32 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !24, file: !14, line: 66, baseType: !8, size: 64, offset: 320)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "degree", scope: !24, file: !14, line: 71, baseType: !35, size: 31, offset: 384, flags: DIFlagBitField, extraData: i64 384)
!35 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !24, file: !14, line: 72, baseType: !35, size: 1, offset: 415, flags: DIFlagBitField, extraData: i64 384)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !16, file: !14, line: 56, baseType: !23, size: 64, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "fibnode_t", file: !14, line: 74, baseType: !23)
!39 = !{i32 2, !"Dwarf Version", i32 4}
!40 = !{i32 2, !"Debug Info Version", i32 3}
!41 = !{i32 1, !"wchar_size", i32 4}
!42 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!43 = distinct !DISubprogram(name: "atoi", scope: !44, file: !44, line: 361, type: !45, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !47)
!44 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!45 = !DISubroutineType(types: !46)
!46 = !{!4, !9}
!47 = !{!48}
!48 = !DILocalVariable(name: "__nptr", arg: 1, scope: !43, file: !44, line: 361, type: !9)
!49 = !DILocation(line: 0, scope: !43)
!50 = !DILocation(line: 363, column: 16, scope: !43)
!51 = !DILocation(line: 363, column: 10, scope: !43)
!52 = !DILocation(line: 363, column: 3, scope: !43)
!53 = distinct !DISubprogram(name: "atol", scope: !44, file: !44, line: 366, type: !54, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !56)
!54 = !DISubroutineType(types: !55)
!55 = !{!32, !9}
!56 = !{!57}
!57 = !DILocalVariable(name: "__nptr", arg: 1, scope: !53, file: !44, line: 366, type: !9)
!58 = !DILocation(line: 0, scope: !53)
!59 = !DILocation(line: 368, column: 10, scope: !53)
!60 = !DILocation(line: 368, column: 3, scope: !53)
!61 = distinct !DISubprogram(name: "atoll", scope: !44, file: !44, line: 373, type: !62, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !65)
!62 = !DISubroutineType(types: !63)
!63 = !{!64, !9}
!64 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!65 = !{!66}
!66 = !DILocalVariable(name: "__nptr", arg: 1, scope: !61, file: !44, line: 373, type: !9)
!67 = !DILocation(line: 0, scope: !61)
!68 = !DILocation(line: 375, column: 10, scope: !61)
!69 = !DILocation(line: 375, column: 3, scope: !61)
!70 = distinct !DISubprogram(name: "bsearch", scope: !71, file: !71, line: 20, type: !72, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !80)
!71 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!72 = !DISubroutineType(types: !73)
!73 = !{!8, !74, !74, !19, !19, !76}
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !44, line: 808, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{!4, !74, !74}
!80 = !{!81, !82, !83, !84, !85, !86, !87, !88, !89, !90}
!81 = !DILocalVariable(name: "__key", arg: 1, scope: !70, file: !71, line: 20, type: !74)
!82 = !DILocalVariable(name: "__base", arg: 2, scope: !70, file: !71, line: 20, type: !74)
!83 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !70, file: !71, line: 20, type: !19)
!84 = !DILocalVariable(name: "__size", arg: 4, scope: !70, file: !71, line: 20, type: !19)
!85 = !DILocalVariable(name: "__compar", arg: 5, scope: !70, file: !71, line: 21, type: !76)
!86 = !DILocalVariable(name: "__l", scope: !70, file: !71, line: 23, type: !19)
!87 = !DILocalVariable(name: "__u", scope: !70, file: !71, line: 23, type: !19)
!88 = !DILocalVariable(name: "__idx", scope: !70, file: !71, line: 23, type: !19)
!89 = !DILocalVariable(name: "__p", scope: !70, file: !71, line: 24, type: !74)
!90 = !DILocalVariable(name: "__comparison", scope: !70, file: !71, line: 25, type: !4)
!91 = !DILocation(line: 0, scope: !70)
!92 = !DILocation(line: 29, column: 3, scope: !70)
!93 = !DILocation(line: 27, column: 7, scope: !70)
!94 = !DILocation(line: 29, column: 14, scope: !70)
!95 = !DILocation(line: 31, column: 20, scope: !96)
!96 = distinct !DILexicalBlock(scope: !70, file: !71, line: 30, column: 5)
!97 = !DILocation(line: 31, column: 27, scope: !96)
!98 = !DILocation(line: 32, column: 56, scope: !96)
!99 = !DILocation(line: 32, column: 47, scope: !96)
!100 = !DILocation(line: 33, column: 22, scope: !96)
!101 = !DILocation(line: 34, column: 24, scope: !102)
!102 = distinct !DILexicalBlock(scope: !96, file: !71, line: 34, column: 11)
!103 = !DILocation(line: 34, column: 11, scope: !96)
!104 = !DILocation(line: 36, column: 29, scope: !105)
!105 = distinct !DILexicalBlock(scope: !102, file: !71, line: 36, column: 16)
!106 = !DILocation(line: 36, column: 16, scope: !102)
!107 = !DILocation(line: 37, column: 14, scope: !105)
!108 = distinct !{!108, !92, !109}
!109 = !DILocation(line: 40, column: 5, scope: !70)
!110 = !DILocation(line: 43, column: 1, scope: !70)
!111 = distinct !DISubprogram(name: "atof", scope: !112, file: !112, line: 25, type: !113, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !116)
!112 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!113 = !DISubroutineType(types: !114)
!114 = !{!115, !9}
!115 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!116 = !{!117}
!117 = !DILocalVariable(name: "__nptr", arg: 1, scope: !111, file: !112, line: 25, type: !9)
!118 = !DILocation(line: 0, scope: !111)
!119 = !DILocation(line: 27, column: 10, scope: !111)
!120 = !DILocation(line: 27, column: 3, scope: !111)
!121 = distinct !DISubprogram(name: "vprintf", scope: !122, file: !122, line: 39, type: !123, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !133)
!122 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!123 = !DISubroutineType(types: !124)
!124 = !{!4, !125, !126}
!125 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !9)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 28, size: 192, elements: !128)
!128 = !{!129, !130, !131, !132}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !127, file: !1, line: 28, baseType: !35, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !127, file: !1, line: 28, baseType: !35, size: 32, offset: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !127, file: !1, line: 28, baseType: !8, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !127, file: !1, line: 28, baseType: !8, size: 64, offset: 128)
!133 = !{!134, !135}
!134 = !DILocalVariable(name: "__fmt", arg: 1, scope: !121, file: !122, line: 39, type: !125)
!135 = !DILocalVariable(name: "__arg", arg: 2, scope: !121, file: !122, line: 39, type: !126)
!136 = !DILocation(line: 0, scope: !121)
!137 = !DILocation(line: 41, column: 20, scope: !121)
!138 = !DILocation(line: 41, column: 10, scope: !121)
!139 = !DILocation(line: 41, column: 3, scope: !121)
!140 = distinct !DISubprogram(name: "getchar", scope: !122, file: !122, line: 47, type: !141, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !2)
!141 = !DISubroutineType(types: !142)
!142 = !{!4}
!143 = !DILocation(line: 49, column: 16, scope: !140)
!144 = !DILocation(line: 49, column: 10, scope: !140)
!145 = !DILocation(line: 49, column: 3, scope: !140)
!146 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !122, file: !122, line: 56, type: !147, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !204)
!147 = !DISubroutineType(types: !148)
!148 = !{!4, !149}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !151, line: 7, baseType: !152)
!151 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !153, line: 49, size: 1728, elements: !154)
!153 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!154 = !{!155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !170, !172, !173, !174, !177, !179, !181, !185, !188, !190, !193, !196, !197, !198, !199, !200}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !152, file: !153, line: 51, baseType: !4, size: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !152, file: !153, line: 54, baseType: !6, size: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !152, file: !153, line: 55, baseType: !6, size: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !152, file: !153, line: 56, baseType: !6, size: 64, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !152, file: !153, line: 57, baseType: !6, size: 64, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !152, file: !153, line: 58, baseType: !6, size: 64, offset: 320)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !152, file: !153, line: 59, baseType: !6, size: 64, offset: 384)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !152, file: !153, line: 60, baseType: !6, size: 64, offset: 448)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !152, file: !153, line: 61, baseType: !6, size: 64, offset: 512)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !152, file: !153, line: 64, baseType: !6, size: 64, offset: 576)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !152, file: !153, line: 65, baseType: !6, size: 64, offset: 640)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !152, file: !153, line: 66, baseType: !6, size: 64, offset: 704)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !152, file: !153, line: 68, baseType: !168, size: 64, offset: 768)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !153, line: 36, flags: DIFlagFwdDecl)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !152, file: !153, line: 70, baseType: !171, size: 64, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !152, file: !153, line: 72, baseType: !4, size: 32, offset: 896)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !152, file: !153, line: 73, baseType: !4, size: 32, offset: 928)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !152, file: !153, line: 74, baseType: !175, size: 64, offset: 960)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !176, line: 152, baseType: !32)
!176 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !152, file: !153, line: 77, baseType: !178, size: 16, offset: 1024)
!178 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !152, file: !153, line: 78, baseType: !180, size: 8, offset: 1040)
!180 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !152, file: !153, line: 79, baseType: !182, size: 8, offset: 1048)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 1)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !152, file: !153, line: 81, baseType: !186, size: 64, offset: 1088)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !153, line: 43, baseType: null)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !152, file: !153, line: 89, baseType: !189, size: 64, offset: 1152)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !176, line: 153, baseType: !32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !152, file: !153, line: 91, baseType: !191, size: 64, offset: 1216)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !153, line: 37, flags: DIFlagFwdDecl)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !152, file: !153, line: 92, baseType: !194, size: 64, offset: 1280)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !153, line: 38, flags: DIFlagFwdDecl)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !152, file: !153, line: 93, baseType: !171, size: 64, offset: 1344)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !152, file: !153, line: 94, baseType: !8, size: 64, offset: 1408)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !152, file: !153, line: 95, baseType: !19, size: 64, offset: 1472)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !152, file: !153, line: 96, baseType: !4, size: 32, offset: 1536)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !152, file: !153, line: 98, baseType: !201, size: 160, offset: 1568)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 160, elements: !202)
!202 = !{!203}
!203 = !DISubrange(count: 20)
!204 = !{!205}
!205 = !DILocalVariable(name: "__fp", arg: 1, scope: !146, file: !122, line: 56, type: !149)
!206 = !DILocation(line: 0, scope: !146)
!207 = !DILocation(line: 58, column: 10, scope: !146)
!208 = !DILocation(line: 58, column: 3, scope: !146)
!209 = distinct !DISubprogram(name: "getc_unlocked", scope: !122, file: !122, line: 66, type: !147, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !210)
!210 = !{!211}
!211 = !DILocalVariable(name: "__fp", arg: 1, scope: !209, file: !122, line: 66, type: !149)
!212 = !DILocation(line: 0, scope: !209)
!213 = !DILocation(line: 68, column: 10, scope: !209)
!214 = !DILocation(line: 68, column: 3, scope: !209)
!215 = distinct !DISubprogram(name: "getchar_unlocked", scope: !122, file: !122, line: 73, type: !141, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !2)
!216 = !DILocation(line: 75, column: 10, scope: !215)
!217 = !DILocation(line: 75, column: 3, scope: !215)
!218 = distinct !DISubprogram(name: "putchar", scope: !122, file: !122, line: 82, type: !219, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !221)
!219 = !DISubroutineType(types: !220)
!220 = !{!4, !4}
!221 = !{!222}
!222 = !DILocalVariable(name: "__c", arg: 1, scope: !218, file: !122, line: 82, type: !4)
!223 = !DILocation(line: 0, scope: !218)
!224 = !DILocation(line: 84, column: 21, scope: !218)
!225 = !DILocation(line: 84, column: 10, scope: !218)
!226 = !DILocation(line: 84, column: 3, scope: !218)
!227 = distinct !DISubprogram(name: "fputc_unlocked", scope: !122, file: !122, line: 91, type: !228, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !230)
!228 = !DISubroutineType(types: !229)
!229 = !{!4, !4, !149}
!230 = !{!231, !232}
!231 = !DILocalVariable(name: "__c", arg: 1, scope: !227, file: !122, line: 91, type: !4)
!232 = !DILocalVariable(name: "__stream", arg: 2, scope: !227, file: !122, line: 91, type: !149)
!233 = !DILocation(line: 0, scope: !227)
!234 = !DILocation(line: 93, column: 10, scope: !227)
!235 = !DILocation(line: 93, column: 3, scope: !227)
!236 = distinct !DISubprogram(name: "putc_unlocked", scope: !122, file: !122, line: 101, type: !228, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !237)
!237 = !{!238, !239}
!238 = !DILocalVariable(name: "__c", arg: 1, scope: !236, file: !122, line: 101, type: !4)
!239 = !DILocalVariable(name: "__stream", arg: 2, scope: !236, file: !122, line: 101, type: !149)
!240 = !DILocation(line: 0, scope: !236)
!241 = !DILocation(line: 103, column: 10, scope: !236)
!242 = !DILocation(line: 103, column: 3, scope: !236)
!243 = distinct !DISubprogram(name: "putchar_unlocked", scope: !122, file: !122, line: 108, type: !219, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !244)
!244 = !{!245}
!245 = !DILocalVariable(name: "__c", arg: 1, scope: !243, file: !122, line: 108, type: !4)
!246 = !DILocation(line: 0, scope: !243)
!247 = !DILocation(line: 110, column: 10, scope: !243)
!248 = !DILocation(line: 110, column: 3, scope: !243)
!249 = distinct !DISubprogram(name: "getline", scope: !122, file: !122, line: 118, type: !250, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !254)
!250 = !DISubroutineType(types: !251)
!251 = !{!252, !5, !253, !149}
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !176, line: 193, baseType: !32)
