; ModuleID = 'final.bc'
source_filename = "final.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.rtx_def = type { i32, %union.u }
%union.u = type { %struct.block_symbol }
%struct.block_symbol = type { [3 x %union.rtunion_def], %struct.object_block*, i64 }
%union.rtunion_def = type { i8* }
%struct.object_block = type { %union.section*, i32, i64, %struct.VEC_rtx_gc*, %struct.VEC_rtx_gc* }
%union.section = type { %struct.unnamed_section }
%struct.unnamed_section = type { %struct.section_common, void (i8*)*, i8*, %union.section* }
%struct.section_common = type { i32 }
%struct.VEC_rtx_gc = type { %struct.VEC_rtx_base }
%struct.VEC_rtx_base = type { i32, i32, [1 x %struct.rtx_def*] }
%struct.VEC_int_heap = type { %struct.VEC_int_base }
%struct.VEC_int_base = type { i32, i32, [1 x i32] }
%struct.label_alignment = type { i16, i16 }

!689 = !DIEnumerator(name: "TV_VPT", value: 139, isUnsigned: true)
!690 = !DIEnumerator(name: "TV_COMBINE", value: 140, isUnsigned: true)
!691 = !DIEnumerator(name: "TV_IFCVT", value: 141, isUnsigned: true)
!692 = !DIEnumerator(name: "TV_REGMOVE", value: 142, isUnsigned: true)
!693 = !DIEnumerator(name: "TV_MODE_SWITCH", value: 143, isUnsigned: true)
!694 = !DIEnumerator(name: "TV_SMS", value: 144, isUnsigned: true)
!695 = !DIEnumerator(name: "TV_SCHED", value: 145, isUnsigned: true)
!696 = !DIEnumerator(name: "TV_LOCAL_ALLOC", value: 146, isUnsigned: true)
!697 = !DIEnumerator(name: "TV_GLOBAL_ALLOC", value: 147, isUnsigned: true)
!698 = !DIEnumerator(name: "TV_IRA", value: 148, isUnsigned: true)
!699 = !DIEnumerator(name: "TV_RELOAD", value: 149, isUnsigned: true)
!700 = !DIEnumerator(name: "TV_RELOAD_CSE_REGS", value: 150, isUnsigned: true)
!701 = !DIEnumerator(name: "TV_SEQABSTR", value: 151, isUnsigned: true)
!702 = !DIEnumerator(name: "TV_GCSE_AFTER_RELOAD", value: 152, isUnsigned: true)
!703 = !DIEnumerator(name: "TV_THREAD_PROLOGUE_AND_EPILOGUE", value: 153, isUnsigned: true)
!704 = !DIEnumerator(name: "TV_IFCVT2", value: 154, isUnsigned: true)
!705 = !DIEnumerator(name: "TV_COMBINE_STACK_ADJUST", value: 155, isUnsigned: true)
!706 = !DIEnumerator(name: "TV_PEEPHOLE2", value: 156, isUnsigned: true)
!707 = !DIEnumerator(name: "TV_RENAME_REGISTERS", value: 157, isUnsigned: true)
!708 = !DIEnumerator(name: "TV_CPROP_REGISTERS", value: 158, isUnsigned: true)
!709 = !DIEnumerator(name: "TV_SCHED2", value: 159, isUnsigned: true)
!710 = !DIEnumerator(name: "TV_MACH_DEP", value: 160, isUnsigned: true)
!711 = !DIEnumerator(name: "TV_DBR_SCHED", value: 161, isUnsigned: true)
!712 = !DIEnumerator(name: "TV_REORDER_BLOCKS", value: 162, isUnsigned: true)
!713 = !DIEnumerator(name: "TV_SHORTEN_BRANCH", value: 163, isUnsigned: true)
!714 = !DIEnumerator(name: "TV_REG_STACK", value: 164, isUnsigned: true)
!715 = !DIEnumerator(name: "TV_FINAL", value: 165, isUnsigned: true)
!716 = !DIEnumerator(name: "TV_SYMOUT", value: 166, isUnsigned: true)
!717 = !DIEnumerator(name: "TV_VAR_TRACKING", value: 167, isUnsigned: true)
!718 = !DIEnumerator(name: "TV_TREE_IFCOMBINE", value: 168, isUnsigned: true)
!719 = !DIEnumerator(name: "TV_PLUGIN_INIT", value: 169, isUnsigned: true)
!720 = !DIEnumerator(name: "TV_PLUGIN_RUN", value: 170, isUnsigned: true)
!721 = !DIEnumerator(name: "TV_REST_OF_COMPILATION", value: 171, isUnsigned: true)
!722 = !DIEnumerator(name: "TIMEVAR_LAST", value: 172, isUnsigned: true)
!723 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "label_kind", file: !398, line: 982, baseType: !7, size: 32, elements: !724)
!724 = !{!725, !726, !727, !728}
!725 = !DIEnumerator(name: "LABEL_NORMAL", value: 0, isUnsigned: true)
!726 = !DIEnumerator(name: "LABEL_STATIC_ENTRY", value: 1, isUnsigned: true)
!727 = !DIEnumerator(name: "LABEL_GLOBAL_ENTRY", value: 2, isUnsigned: true)
!728 = !DIEnumerator(name: "LABEL_WEAK_ENTRY", value: 3, isUnsigned: true)
!729 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mode_class", file: !730, line: 36, baseType: !7, size: 32, elements: !731)
!730 = !DIFile(filename: "./machmode.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!731 = !{!732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750}
!732 = !DIEnumerator(name: "MODE_RANDOM", value: 0, isUnsigned: true)
!733 = !DIEnumerator(name: "MODE_CC", value: 1, isUnsigned: true)
!734 = !DIEnumerator(name: "MODE_INT", value: 2, isUnsigned: true)
!735 = !DIEnumerator(name: "MODE_PARTIAL_INT", value: 3, isUnsigned: true)
!736 = !DIEnumerator(name: "MODE_FRACT", value: 4, isUnsigned: true)
!737 = !DIEnumerator(name: "MODE_UFRACT", value: 5, isUnsigned: true)
!738 = !DIEnumerator(name: "MODE_ACCUM", value: 6, isUnsigned: true)
!739 = !DIEnumerator(name: "MODE_UACCUM", value: 7, isUnsigned: true)
!740 = !DIEnumerator(name: "MODE_FLOAT", value: 8, isUnsigned: true)
!741 = !DIEnumerator(name: "MODE_DECIMAL_FLOAT", value: 9, isUnsigned: true)
!742 = !DIEnumerator(name: "MODE_COMPLEX_INT", value: 10, isUnsigned: true)
!743 = !DIEnumerator(name: "MODE_COMPLEX_FLOAT", value: 11, isUnsigned: true)
!744 = !DIEnumerator(name: "MODE_VECTOR_INT", value: 12, isUnsigned: true)
!745 = !DIEnumerator(name: "MODE_VECTOR_FRACT", value: 13, isUnsigned: true)
!746 = !DIEnumerator(name: "MODE_VECTOR_UFRACT", value: 14, isUnsigned: true)
!747 = !DIEnumerator(name: "MODE_VECTOR_ACCUM", value: 15, isUnsigned: true)
!748 = !DIEnumerator(name: "MODE_VECTOR_UACCUM", value: 16, isUnsigned: true)
!749 = !DIEnumerator(name: "MODE_VECTOR_FLOAT", value: 17, isUnsigned: true)
!750 = !DIEnumerator(name: "MAX_MODE_CLASS", value: 18, isUnsigned: true)
!751 = !{!752, !753, !754, !755, !758, !759, !397, !761, !767, !756, !768, !769, !2251, !5, !2252, !7, !723, !839, !856, !2262, !729, !2264, !1385, !2266}
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!754 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !757)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "label_alignment", file: !3, line: 340, size: 32, elements: !763)
!763 = !{!764, !766}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !762, file: !3, line: 342, baseType: !765, size: 16)
!765 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "max_skip", scope: !762, file: !3, line: 343, baseType: !765, size: 16, offset: 16)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !770, line: 50, baseType: !771)
!770 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !398, line: 240, size: 384, elements: !773)
!773 = !{!774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !772, file: !398, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !772, file: !398, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !772, file: !398, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !772, file: !398, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !772, file: !398, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !772, file: !398, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !772, file: !398, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !772, file: !398, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !772, file: !398, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !772, file: !398, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !772, file: !398, line: 321, baseType: !785, size: 320, offset: 64)
!785 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !398, line: 315, size: 320, elements: !786)
!786 = !{!787, !2186, !2188, !2249, !2250}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !785, file: !398, line: 316, baseType: !788, size: 64)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !789, size: 64, elements: !804)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !398, line: 183, baseType: !790)
!790 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !398, line: 166, size: 64, elements: !791)
!791 = !{!792, !793, !794, !795, !796, !806, !807, !819, !822, !884, !2164, !2165, !2176, !2183}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !790, file: !398, line: 168, baseType: !754, size: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !790, file: !398, line: 169, baseType: !7, size: 32)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !790, file: !398, line: 170, baseType: !759, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !790, file: !398, line: 171, baseType: !769, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !790, file: !398, line: 172, baseType: !797, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !770, line: 53, baseType: !798)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !398, line: 359, size: 128, elements: !800)
!800 = !{!801, !802}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !799, file: !398, line: 360, baseType: !754, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !799, file: !398, line: 361, baseType: !803, size: 64, offset: 64)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 64, elements: !804)
!804 = !{!805}
!805 = !DISubrange(count: 1)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !790, file: !398, line: 173, baseType: !5, size: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !790, file: !398, line: 174, baseType: !808, size: 32)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !398, line: 133, baseType: !809)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !398, line: 115, size: 32, elements: !810)
!810 = !{!811, !812, !813, !814, !815, !816, !817, !818}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !809, file: !398, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !809, file: !398, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !809, file: !398, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !809, file: !398, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !809, file: !398, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !809, file: !398, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !809, file: !398, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !809, file: !398, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !790, file: !398, line: 175, baseType: !820, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !398, line: 175, flags: DIFlagFwdDecl)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !790, file: !398, line: 176, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !825, line: 75, size: 256, elements: !826)
!825 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!826 = !{!827, !842, !843, !844}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !824, file: !825, line: 76, baseType: !828, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !825, line: 68, baseType: !830)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !825, line: 63, size: 320, elements: !831)
!831 = !{!832, !834, !835, !836}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !830, file: !825, line: 64, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !830, file: !825, line: 65, baseType: !833, size: 64, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !830, file: !825, line: 66, baseType: !7, size: 32, offset: 128)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !830, file: !825, line: 67, baseType: !837, size: 128, offset: 192)
!837 = !DICompositeType(tag: DW_TAG_array_type, baseType: !838, size: 128, elements: !840)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !825, line: 29, baseType: !839)
!839 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!840 = !{!841}
!841 = !DISubrange(count: 2)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !824, file: !825, line: 77, baseType: !828, size: 64, offset: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !824, file: !825, line: 78, baseType: !7, size: 32, offset: 128)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !824, file: !825, line: 79, baseType: !845, size: 64, offset: 192)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !825, line: 49, baseType: !847)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !825, line: 45, size: 832, elements: !848)
!848 = !{!849, !850, !851}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !847, file: !825, line: 46, baseType: !833, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !847, file: !825, line: 47, baseType: !823, size: 64, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !847, file: !825, line: 48, baseType: !852, size: 704, offset: 128)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !853, line: 164, size: 704, elements: !854)
!853 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!854 = !{!855, !857, !867, !868, !869, !870, !871, !872, !876, !880, !881, !882, !883}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !852, file: !853, line: 166, baseType: !856, size: 64)
!856 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !852, file: !853, line: 167, baseType: !858, size: 64, offset: 64)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !853, line: 157, size: 192, elements: !860)
!860 = !{!861, !862, !863}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !859, file: !853, line: 159, baseType: !756, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !859, file: !853, line: 160, baseType: !858, size: 64, offset: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !859, file: !853, line: 161, baseType: !864, size: 32, offset: 128)
!864 = !DICompositeType(tag: DW_TAG_array_type, baseType: !757, size: 32, elements: !865)
!865 = !{!866}
!866 = !DISubrange(count: 4)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !852, file: !853, line: 168, baseType: !756, size: 64, offset: 128)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !852, file: !853, line: 169, baseType: !756, size: 64, offset: 192)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !852, file: !853, line: 170, baseType: !756, size: 64, offset: 256)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !852, file: !853, line: 171, baseType: !856, size: 64, offset: 320)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !852, file: !853, line: 172, baseType: !754, size: 32, offset: 384)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !852, file: !853, line: 176, baseType: !873, size: 64, offset: 448)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DISubroutineType(types: !875)
!875 = !{!858, !758, !856}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !852, file: !853, line: 177, baseType: !877, size: 64, offset: 512)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DISubroutineType(types: !879)
!879 = !{null, !758, !858}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !852, file: !853, line: 178, baseType: !758, size: 64, offset: 576)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !852, file: !853, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !852, file: !853, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !852, file: !853, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !790, file: !398, line: 177, baseType: !885, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !770, line: 56, baseType: !886)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !142, line: 3371, size: 1792, elements: !888)
!888 = !{!889, !922, !928, !939, !958, !969, !974, !981, !987, !1000, !1012, !1050, !1055, !1083, !1100, !1101, !1106, !1115, !1121, !1126, !1130, !1134, !1813, !1862, !1868, !1874, !1881, !1894, !1908, !1925, !1937, !1959, !1974, !2146}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !887, file: !142, line: 3372, baseType: !890, size: 64)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !142, line: 360, size: 64, elements: !891)
!891 = !{!892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !890, file: !142, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !890, file: !142, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !890, file: !142, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !890, file: !142, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !890, file: !142, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !890, file: !142, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !890, file: !142, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !890, file: !142, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !890, file: !142, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !890, file: !142, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !890, file: !142, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !890, file: !142, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !890, file: !142, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !890, file: !142, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !890, file: !142, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !890, file: !142, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !890, file: !142, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !890, file: !142, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !890, file: !142, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !890, file: !142, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !890, file: !142, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !890, file: !142, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !890, file: !142, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !890, file: !142, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !890, file: !142, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !890, file: !142, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !890, file: !142, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !890, file: !142, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !890, file: !142, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !890, file: !142, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !887, file: !142, line: 3373, baseType: !923, size: 192)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !142, line: 402, size: 192, elements: !924)
!924 = !{!925, !926, !927}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !923, file: !142, line: 403, baseType: !890, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !923, file: !142, line: 404, baseType: !885, size: 64, offset: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !923, file: !142, line: 405, baseType: !885, size: 64, offset: 128)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !887, file: !142, line: 3374, baseType: !929, size: 320)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !142, line: 1384, size: 320, elements: !930)
!930 = !{!931, !932}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !929, file: !142, line: 1385, baseType: !923, size: 192)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !929, file: !142, line: 1386, baseType: !933, size: 128, offset: 192)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !934, line: 58, baseType: !935)
!934 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !934, line: 54, size: 128, elements: !936)
!936 = !{!937, !938}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !935, file: !934, line: 56, baseType: !839, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !935, file: !934, line: 57, baseType: !856, size: 64, offset: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !887, file: !142, line: 3375, baseType: !940, size: 256)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !142, line: 1397, size: 256, elements: !941)
!941 = !{!942, !943}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !940, file: !142, line: 1398, baseType: !923, size: 192)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !940, file: !142, line: 1399, baseType: !944, size: 64, offset: 192)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !946, line: 52, size: 256, elements: !947)
!946 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!947 = !{!948, !949, !950, !951, !952, !953, !954}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !945, file: !946, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !945, file: !946, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !945, file: !946, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !945, file: !946, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !945, file: !946, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !945, file: !946, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !945, file: !946, line: 62, baseType: !955, size: 192, offset: 64)
!955 = !DICompositeType(tag: DW_TAG_array_type, baseType: !839, size: 192, elements: !956)
!956 = !{!957}
!957 = !DISubrange(count: 3)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !887, file: !142, line: 3376, baseType: !959, size: 256)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !142, line: 1408, size: 256, elements: !960)
!960 = !{!961, !962}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !959, file: !142, line: 1409, baseType: !923, size: 192)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !959, file: !142, line: 1410, baseType: !963, size: 64, offset: 192)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !965, line: 27, size: 192, elements: !966)
!965 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!966 = !{!967, !968}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !964, file: !965, line: 29, baseType: !933, size: 128)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !964, file: !965, line: 30, baseType: !5, size: 32, offset: 128)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !887, file: !142, line: 3377, baseType: !970, size: 256)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !142, line: 1437, size: 256, elements: !971)
!971 = !{!972, !973}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !970, file: !142, line: 1438, baseType: !923, size: 192)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !970, file: !142, line: 1439, baseType: !885, size: 64, offset: 192)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !887, file: !142, line: 3378, baseType: !975, size: 256)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !142, line: 1418, size: 256, elements: !976)
!976 = !{!977, !978, !979}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !975, file: !142, line: 1419, baseType: !923, size: 192)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !975, file: !142, line: 1420, baseType: !754, size: 32, offset: 192)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !975, file: !142, line: 1421, baseType: !980, size: 8, offset: 224)
!980 = !DICompositeType(tag: DW_TAG_array_type, baseType: !757, size: 8, elements: !804)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !887, file: !142, line: 3379, baseType: !982, size: 320)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !142, line: 1428, size: 320, elements: !983)
!983 = !{!984, !985, !986}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !982, file: !142, line: 1429, baseType: !923, size: 192)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !982, file: !142, line: 1430, baseType: !885, size: 64, offset: 192)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !982, file: !142, line: 1431, baseType: !885, size: 64, offset: 256)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !887, file: !142, line: 3380, baseType: !988, size: 320)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !142, line: 1460, size: 320, elements: !989)
!989 = !{!990, !991}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !988, file: !142, line: 1461, baseType: !923, size: 192)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !988, file: !142, line: 1462, baseType: !992, size: 128, offset: 192)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !993, line: 31, size: 128, elements: !994)
!993 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!994 = !{!995, !998, !999}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !992, file: !993, line: 32, baseType: !996, size: 64)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !753)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !992, file: !993, line: 33, baseType: !7, size: 32, offset: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !992, file: !993, line: 34, baseType: !7, size: 32, offset: 96)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !887, file: !142, line: 3381, baseType: !1001, size: 384)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !142, line: 2507, size: 384, elements: !1002)
!1002 = !{!1003, !1004, !1009, !1010, !1011}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1001, file: !142, line: 2508, baseType: !923, size: 192)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1001, file: !142, line: 2509, baseType: !1005, size: 32, offset: 192)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1006, line: 58, baseType: !1007)
!1006 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1008, line: 44, baseType: !7)
!1008 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1001, file: !142, line: 2510, baseType: !7, size: 32, offset: 224)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1001, file: !142, line: 2511, baseType: !885, size: 64, offset: 256)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1001, file: !142, line: 2512, baseType: !885, size: 64, offset: 320)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !887, file: !142, line: 3382, baseType: !1013, size: 896)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !142, line: 2652, size: 896, elements: !1014)
!1014 = !{!1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1013, file: !142, line: 2653, baseType: !1001, size: 384)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1013, file: !142, line: 2654, baseType: !885, size: 64, offset: 384)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1013, file: !142, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1013, file: !142, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1013, file: !142, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1013, file: !142, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1013, file: !142, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1013, file: !142, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1013, file: !142, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1013, file: !142, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1013, file: !142, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1013, file: !142, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1013, file: !142, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1013, file: !142, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1013, file: !142, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1013, file: !142, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1013, file: !142, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1013, file: !142, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1013, file: !142, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1013, file: !142, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1013, file: !142, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1013, file: !142, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1013, file: !142, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1013, file: !142, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1013, file: !142, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1013, file: !142, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1013, file: !142, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1013, file: !142, line: 2703, baseType: !7, size: 32, offset: 512)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1013, file: !142, line: 2705, baseType: !885, size: 64, offset: 576)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1013, file: !142, line: 2706, baseType: !885, size: 64, offset: 640)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1013, file: !142, line: 2707, baseType: !885, size: 64, offset: 704)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1013, file: !142, line: 2708, baseType: !885, size: 64, offset: 768)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1013, file: !142, line: 2711, baseType: !1048, size: 64, offset: 832)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !142, line: 2711, flags: DIFlagFwdDecl)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !887, file: !142, line: 3383, baseType: !1051, size: 960)
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !142, line: 2756, size: 960, elements: !1052)
!1052 = !{!1053, !1054}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1051, file: !142, line: 2757, baseType: !1013, size: 896)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1051, file: !142, line: 2758, baseType: !769, size: 64, offset: 896)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !887, file: !142, line: 3384, baseType: !1056, size: 1472)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !142, line: 3114, size: 1472, elements: !1057)
!1057 = !{!1058, !1079, !1080, !1081, !1082}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1056, file: !142, line: 3115, baseType: !1059, size: 1216)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !142, line: 2984, size: 1216, elements: !1060)
!1060 = !{!1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1059, file: !142, line: 2985, baseType: !1051, size: 960)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1059, file: !142, line: 2986, baseType: !885, size: 64, offset: 960)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1059, file: !142, line: 2987, baseType: !885, size: 64, offset: 1024)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1059, file: !142, line: 2988, baseType: !885, size: 64, offset: 1088)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1059, file: !142, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1059, file: !142, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1059, file: !142, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1059, file: !142, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1059, file: !142, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1059, file: !142, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1059, file: !142, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1059, file: !142, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1059, file: !142, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1059, file: !142, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1059, file: !142, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1059, file: !142, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1059, file: !142, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1059, file: !142, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1056, file: !142, line: 3117, baseType: !885, size: 64, offset: 1216)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1056, file: !142, line: 3119, baseType: !885, size: 64, offset: 1280)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1056, file: !142, line: 3121, baseType: !885, size: 64, offset: 1344)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1056, file: !142, line: 3123, baseType: !885, size: 64, offset: 1408)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !887, file: !142, line: 3385, baseType: !1084, size: 1088)
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !142, line: 2874, size: 1088, elements: !1085)
!1085 = !{!1086, !1087, !1088}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1084, file: !142, line: 2875, baseType: !1051, size: 960)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1084, file: !142, line: 2876, baseType: !769, size: 64, offset: 960)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1084, file: !142, line: 2877, baseType: !1089, size: 64, offset: 1024)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1091, line: 172, size: 128, elements: !1092)
!1091 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1092 = !{!1093, !1094, !1095, !1096, !1097, !1098, !1099}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1090, file: !1091, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1090, file: !1091, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1090, file: !1091, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1090, file: !1091, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1090, file: !1091, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1090, file: !1091, line: 195, baseType: !7, size: 32, offset: 32)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1090, file: !1091, line: 199, baseType: !885, size: 64, offset: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !887, file: !142, line: 3386, baseType: !1059, size: 1216)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !887, file: !142, line: 3387, baseType: !1102, size: 1280)
!1102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !142, line: 3093, size: 1280, elements: !1103)
!1103 = !{!1104, !1105}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1102, file: !142, line: 3094, baseType: !1059, size: 1216)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1102, file: !142, line: 3095, baseType: !1089, size: 64, offset: 1216)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !887, file: !142, line: 3388, baseType: !1107, size: 1216)
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !142, line: 2824, size: 1216, elements: !1108)
!1108 = !{!1109, !1110, !1111, !1112, !1113, !1114}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1107, file: !142, line: 2825, baseType: !1013, size: 896)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1107, file: !142, line: 2827, baseType: !885, size: 64, offset: 896)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1107, file: !142, line: 2828, baseType: !885, size: 64, offset: 960)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1107, file: !142, line: 2829, baseType: !885, size: 64, offset: 1024)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1107, file: !142, line: 2830, baseType: !885, size: 64, offset: 1088)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1107, file: !142, line: 2831, baseType: !885, size: 64, offset: 1152)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !887, file: !142, line: 3389, baseType: !1116, size: 1024)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !142, line: 2850, size: 1024, elements: !1117)
!1117 = !{!1118, !1119, !1120}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1116, file: !142, line: 2851, baseType: !1051, size: 960)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1116, file: !142, line: 2852, baseType: !754, size: 32, offset: 960)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1116, file: !142, line: 2853, baseType: !754, size: 32, offset: 992)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !887, file: !142, line: 3390, baseType: !1122, size: 1024)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !142, line: 2857, size: 1024, elements: !1123)
!1123 = !{!1124, !1125}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1122, file: !142, line: 2858, baseType: !1051, size: 960)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1122, file: !142, line: 2859, baseType: !1089, size: 64, offset: 960)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !887, file: !142, line: 3391, baseType: !1127, size: 960)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !142, line: 2862, size: 960, elements: !1128)
!1128 = !{!1129}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1127, file: !142, line: 2863, baseType: !1051, size: 960)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !887, file: !142, line: 3392, baseType: !1131, size: 1472)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !142, line: 3304, size: 1472, elements: !1132)
!1132 = !{!1133}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1131, file: !142, line: 3305, baseType: !1056, size: 1472)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !887, file: !142, line: 3393, baseType: !1135, size: 1792)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !142, line: 3248, size: 1792, elements: !1136)
!1136 = !{!1137, !1138, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1135, file: !142, line: 3249, baseType: !1056, size: 1472)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1135, file: !142, line: 3251, baseType: !1139, size: 64, offset: 1472)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64)
!1140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1141, line: 463, size: 1152, elements: !1142)
!1141 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1142 = !{!1143, !1307, !1673, !1674, !1728, !1736, !1737, !1738, !1739, !1740, !1741, !1765, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1140, file: !1141, line: 464, baseType: !1144, size: 64)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !135, line: 194, size: 384, elements: !1146)
!1146 = !{!1147, !1196, !1209, !1223, !1275, !1288}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !1145, file: !135, line: 197, baseType: !1148, size: 64)
!1148 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !135, line: 182, baseType: !1149)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64)
!1150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !135, line: 116, size: 704, elements: !1151)
!1151 = !{!1152, !1153, !1154, !1155, !1156, !1157, !1184, !1193, !1194, !1195}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !1150, file: !135, line: 119, baseType: !1149, size: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1150, file: !135, line: 122, baseType: !1149, size: 64, offset: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !1150, file: !135, line: 123, baseType: !1149, size: 64, offset: 128)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1150, file: !135, line: 126, baseType: !754, size: 32, offset: 192)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1150, file: !135, line: 129, baseType: !134, size: 32, offset: 224)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1150, file: !135, line: 165, baseType: !1158, size: 192, offset: 256)
!1158 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !135, line: 132, size: 192, elements: !1159)
!1159 = !{!1160, !1173, !1179}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !1158, file: !135, line: 137, baseType: !1161, size: 128)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !135, line: 133, size: 128, elements: !1162)
!1162 = !{!1163, !1172}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !1161, file: !135, line: 135, baseType: !1164, size: 64)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64)
!1165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !135, line: 93, size: 320, elements: !1166)
!1166 = !{!1167, !1168, !1169, !1170, !1171}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !1165, file: !135, line: 96, baseType: !1164, size: 64)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !1165, file: !135, line: 97, baseType: !1164, size: 64, offset: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1165, file: !135, line: 101, baseType: !885, size: 64, offset: 128)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !1165, file: !135, line: 106, baseType: !885, size: 64, offset: 192)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1165, file: !135, line: 111, baseType: !885, size: 64, offset: 256)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !1161, file: !135, line: 136, baseType: !1164, size: 64, offset: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !1158, file: !135, line: 151, baseType: !1174, size: 192)
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !135, line: 139, size: 192, elements: !1175)
!1175 = !{!1176, !1177, !1178}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1174, file: !135, line: 141, baseType: !885, size: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1174, file: !135, line: 145, baseType: !885, size: 64, offset: 64)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1174, file: !135, line: 150, baseType: !754, size: 32, offset: 128)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !1158, file: !135, line: 164, baseType: !1180, size: 128)
!1180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !135, line: 153, size: 128, elements: !1181)
!1181 = !{!1182, !1183}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !1180, file: !135, line: 161, baseType: !885, size: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !1180, file: !135, line: 163, baseType: !1005, size: 32, offset: 64)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !1150, file: !135, line: 168, baseType: !1185, size: 64, offset: 448)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !135, line: 67, size: 320, elements: !1187)
!1187 = !{!1188, !1189, !1190, !1191, !1192}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !1186, file: !135, line: 70, baseType: !1185, size: 64)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1186, file: !135, line: 73, baseType: !1149, size: 64, offset: 64)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !1186, file: !135, line: 78, baseType: !885, size: 64, offset: 128)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !1186, file: !135, line: 85, baseType: !769, size: 64, offset: 192)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1186, file: !135, line: 88, baseType: !754, size: 32, offset: 256)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !1150, file: !135, line: 173, baseType: !769, size: 64, offset: 512)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !1150, file: !135, line: 173, baseType: !769, size: 64, offset: 576)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !1150, file: !135, line: 177, baseType: !753, size: 8, offset: 640)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !1145, file: !135, line: 200, baseType: !1197, size: 64, offset: 64)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64)
!1198 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !135, line: 185, baseType: !1199)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !135, line: 185, size: 128, elements: !1200)
!1200 = !{!1201}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1199, file: !135, line: 185, baseType: !1202, size: 128)
!1202 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !135, line: 184, baseType: !1203)
!1203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !135, line: 184, size: 128, elements: !1204)
!1204 = !{!1205, !1206, !1207}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1203, file: !135, line: 184, baseType: !7, size: 32)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1203, file: !135, line: 184, baseType: !7, size: 32, offset: 32)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1203, file: !135, line: 184, baseType: !1208, size: 64, offset: 64)
!1208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1148, size: 64, elements: !804)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !1145, file: !135, line: 203, baseType: !1210, size: 64, offset: 128)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, baseType: !1212)
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, size: 128, elements: !1213)
!1213 = !{!1214}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1212, file: !135, line: 189, baseType: !1215, size: 128)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !135, line: 188, baseType: !1216)
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !135, line: 188, size: 128, elements: !1217)
!1217 = !{!1218, !1219, !1220}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1216, file: !135, line: 188, baseType: !7, size: 32)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1216, file: !135, line: 188, baseType: !7, size: 32, offset: 32)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1216, file: !135, line: 188, baseType: !1221, size: 64, offset: 64)
!1221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1222, size: 64, elements: !804)
!1222 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !135, line: 180, baseType: !1185)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !1145, file: !135, line: 207, baseType: !1224, size: 64, offset: 192)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1225, line: 144, baseType: !1226)
!1225 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64)
!1227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1225, line: 100, size: 896, elements: !1228)
!1228 = !{!1229, !1237, !1242, !1247, !1249, !1252, !1253, !1254, !1255, !1256, !1261, !1263, !1264, !1269, !1274}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1227, file: !1225, line: 102, baseType: !1230, size: 64)
!1230 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1225, line: 52, baseType: !1231)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64)
!1232 = !DISubroutineType(types: !1233)
!1233 = !{!1234, !1235}
!1234 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1225, line: 47, baseType: !7)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64)
!1236 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1227, file: !1225, line: 105, baseType: !1238, size: 64, offset: 64)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1225, line: 59, baseType: !1239)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64)
!1240 = !DISubroutineType(types: !1241)
!1241 = !{!754, !1235, !1235}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1227, file: !1225, line: 108, baseType: !1243, size: 64, offset: 128)
!1243 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1225, line: 63, baseType: !1244)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64)
!1245 = !DISubroutineType(types: !1246)
!1246 = !{null, !758}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1227, file: !1225, line: 111, baseType: !1248, size: 64, offset: 192)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1227, file: !1225, line: 114, baseType: !1250, size: 64, offset: 256)
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1251, line: 46, baseType: !839)
!1251 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1227, file: !1225, line: 117, baseType: !1250, size: 64, offset: 320)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1227, file: !1225, line: 120, baseType: !1250, size: 64, offset: 384)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1227, file: !1225, line: 124, baseType: !7, size: 32, offset: 448)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1227, file: !1225, line: 128, baseType: !7, size: 32, offset: 480)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1227, file: !1225, line: 131, baseType: !1257, size: 64, offset: 512)
!1257 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1225, line: 75, baseType: !1258)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64)
!1259 = !DISubroutineType(types: !1260)
!1260 = !{!758, !1250, !1250}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1227, file: !1225, line: 132, baseType: !1262, size: 64, offset: 576)
!1262 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1225, line: 78, baseType: !1244)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1227, file: !1225, line: 135, baseType: !758, size: 64, offset: 640)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1227, file: !1225, line: 136, baseType: !1265, size: 64, offset: 704)
!1265 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1225, line: 82, baseType: !1266)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64)
!1267 = !DISubroutineType(types: !1268)
!1268 = !{!758, !758, !1250, !1250}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1227, file: !1225, line: 137, baseType: !1270, size: 64, offset: 768)
!1270 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1225, line: 83, baseType: !1271)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64)
!1272 = !DISubroutineType(types: !1273)
!1273 = !{null, !758, !758}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1227, file: !1225, line: 141, baseType: !7, size: 32, offset: 832)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !1145, file: !135, line: 211, baseType: !1276, size: 64, offset: 256)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64)
!1277 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !142, line: 183, baseType: !1278)
!1278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !142, line: 183, size: 128, elements: !1279)
!1279 = !{!1280}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1278, file: !142, line: 183, baseType: !1281, size: 128)
!1281 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !142, line: 182, baseType: !1282)
!1282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !142, line: 182, size: 128, elements: !1283)
!1283 = !{!1284, !1285, !1286}
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1282, file: !142, line: 182, baseType: !7, size: 32)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1282, file: !142, line: 182, baseType: !7, size: 32, offset: 32)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1282, file: !142, line: 182, baseType: !1287, size: 64, offset: 64)
!1287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !885, size: 64, elements: !804)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !1145, file: !135, line: 220, baseType: !1289, size: 64, offset: 320)
!1289 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !135, line: 217, size: 64, elements: !1290)
!1290 = !{!1291, !1292}
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !1289, file: !135, line: 218, baseType: !1276, size: 64)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !1289, file: !135, line: 219, baseType: !1293, size: 64)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64)
!1294 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !1295, line: 29, baseType: !1296)
!1295 = !DIFile(filename: "./vecprim.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !1295, line: 29, size: 96, elements: !1297)
!1297 = !{!1298}
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1296, file: !1295, line: 29, baseType: !1299, size: 96)
!1299 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !1295, line: 27, baseType: !1300)
!1300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !1295, line: 27, size: 96, elements: !1301)
!1301 = !{!1302, !1303, !1304}
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1300, file: !1295, line: 27, baseType: !7, size: 32)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1300, file: !1295, line: 27, baseType: !7, size: 32, offset: 32)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1300, file: !1295, line: 27, baseType: !1305, size: 8, offset: 64)
!1305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1306, size: 8, elements: !804)
!1306 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !1295, line: 26, baseType: !753)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1140, file: !1141, line: 467, baseType: !1308, size: 64, offset: 64)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64)
!1309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !350, line: 374, size: 640, elements: !1310)
!1310 = !{!1311, !1648, !1649, !1662, !1663, !1664, !1665, !1666, !1667, !1669, !1671, !1672}
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1309, file: !350, line: 377, baseType: !1312, size: 64)
!1312 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !770, line: 111, baseType: !1313)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64)
!1314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !350, line: 217, size: 832, elements: !1315)
!1315 = !{!1316, !1560, !1561, !1562, !1618, !1622, !1623, !1624, !1642, !1643, !1644, !1645, !1646, !1647}
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1314, file: !350, line: 219, baseType: !1317, size: 64)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64)
!1318 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !350, line: 151, baseType: !1319)
!1319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !350, line: 151, size: 128, elements: !1320)
!1320 = !{!1321}
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1319, file: !350, line: 151, baseType: !1322, size: 128)
!1322 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !350, line: 150, baseType: !1323)
!1323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !350, line: 150, size: 128, elements: !1324)
!1324 = !{!1325, !1326, !1327}
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1323, file: !350, line: 150, baseType: !7, size: 32)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1323, file: !350, line: 150, baseType: !7, size: 32, offset: 32)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1323, file: !350, line: 150, baseType: !1328, size: 64, offset: 64)
!1328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1329, size: 64, elements: !804)
!1329 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !770, line: 108, baseType: !1330)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64)
!1331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !350, line: 122, size: 512, elements: !1332)
!1332 = !{!1333, !1334, !1335, !1552, !1553, !1554, !1555, !1556, !1557, !1558}
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1331, file: !350, line: 124, baseType: !1313, size: 64)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1331, file: !350, line: 125, baseType: !1313, size: 64, offset: 64)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1331, file: !350, line: 131, baseType: !1336, size: 64, offset: 128)
!1336 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !350, line: 128, size: 64, elements: !1337)
!1337 = !{!1338, !1551}
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1336, file: !350, line: 129, baseType: !1339, size: 64)
!1339 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !770, line: 66, baseType: !1340)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64)
!1341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !1342, line: 143, size: 192, elements: !1343)
!1342 = !DIFile(filename: "./gimple.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1343 = !{!1344, !1549, !1550}
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1341, file: !1342, line: 145, baseType: !1345, size: 64)
!1345 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !770, line: 69, baseType: !1346)
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1347, size: 64)
!1347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !1342, line: 136, size: 192, elements: !1348)
!1348 = !{!1349, !1547, !1548}
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1347, file: !1342, line: 137, baseType: !1350, size: 64)
!1350 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !770, line: 58, baseType: !1351)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64)
!1352 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !1342, line: 737, size: 768, elements: !1353)
!1353 = !{!1354, !1371, !1404, !1410, !1415, !1420, !1427, !1433, !1439, !1444, !1458, !1463, !1469, !1474, !1484, !1489, !1505, !1512, !1519, !1525, !1530, !1536, !1542}
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1352, file: !1342, line: 738, baseType: !1355, size: 256)
!1355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !1342, line: 271, size: 256, elements: !1356)
!1356 = !{!1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370}
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1355, file: !1342, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !1355, file: !1342, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1355, file: !1342, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !1355, file: !1342, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !1355, file: !1342, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !1355, file: !1342, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !1355, file: !1342, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1355, file: !1342, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !1355, file: !1342, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1355, file: !1342, line: 312, baseType: !7, size: 32, offset: 32)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !1355, file: !1342, line: 316, baseType: !1005, size: 32, offset: 64)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !1355, file: !1342, line: 319, baseType: !7, size: 32, offset: 96)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1355, file: !1342, line: 323, baseType: !1313, size: 64, offset: 128)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1355, file: !1342, line: 327, baseType: !885, size: 64, offset: 192)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !1352, file: !1342, line: 739, baseType: !1372, size: 448)
!1372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !1342, line: 350, size: 448, elements: !1373)
!1373 = !{!1374, !1403}
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1372, file: !1342, line: 353, baseType: !1375, size: 384)
!1375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !1342, line: 333, size: 384, elements: !1376)
!1376 = !{!1377, !1378, !1386}
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1375, file: !1342, line: 336, baseType: !1355, size: 256)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !1375, file: !1342, line: 343, baseType: !1379, size: 64, offset: 256)
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64)
!1380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1381, line: 37, size: 128, elements: !1382)
!1381 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1382 = !{!1383, !1384}
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1380, file: !1381, line: 39, baseType: !1379, size: 64)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1380, file: !1381, line: 40, baseType: !1385, size: 64, offset: 64)
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !1375, file: !1342, line: 344, baseType: !1387, size: 64, offset: 320)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1388, size: 64)
!1388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1381, line: 45, size: 320, elements: !1389)
!1389 = !{!1390, !1391}
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1388, file: !1381, line: 47, baseType: !1387, size: 64)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1388, file: !1381, line: 48, baseType: !1392, size: 256, offset: 64)
!1392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !142, line: 1883, size: 256, elements: !1393)
!1393 = !{!1394, !1396, !1397, !1402}
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1392, file: !142, line: 1884, baseType: !1395, size: 64)
!1395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1392, size: 64)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1392, file: !142, line: 1885, baseType: !1395, size: 64, offset: 64)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1392, file: !142, line: 1891, baseType: !1398, size: 64, offset: 128)
!1398 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1392, file: !142, line: 1891, size: 64, elements: !1399)
!1399 = !{!1400, !1401}
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1398, file: !142, line: 1891, baseType: !1350, size: 64)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1398, file: !142, line: 1891, baseType: !885, size: 64)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1392, file: !142, line: 1892, baseType: !1385, size: 64, offset: 192)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1372, file: !1342, line: 359, baseType: !1287, size: 64, offset: 384)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !1352, file: !1342, line: 740, baseType: !1405, size: 512)
!1405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !1342, line: 365, size: 512, elements: !1406)
!1406 = !{!1407, !1408, !1409}
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1405, file: !1342, line: 368, baseType: !1375, size: 384)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1405, file: !1342, line: 373, baseType: !885, size: 64, offset: 384)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1405, file: !1342, line: 374, baseType: !885, size: 64, offset: 448)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !1352, file: !1342, line: 741, baseType: !1411, size: 576)
!1411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !1342, line: 380, size: 576, elements: !1412)
!1412 = !{!1413, !1414}
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1411, file: !1342, line: 383, baseType: !1405, size: 512)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1411, file: !1342, line: 389, baseType: !1287, size: 64, offset: 512)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1352, file: !1342, line: 742, baseType: !1416, size: 320)
!1416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !1342, line: 395, size: 320, elements: !1417)
!1417 = !{!1418, !1419}
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1416, file: !1342, line: 397, baseType: !1355, size: 256)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1416, file: !1342, line: 400, baseType: !1339, size: 64, offset: 256)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !1352, file: !1342, line: 743, baseType: !1421, size: 448)
!1421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !1342, line: 406, size: 448, elements: !1422)
!1422 = !{!1423, !1424, !1425, !1426}
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1421, file: !1342, line: 408, baseType: !1355, size: 256)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1421, file: !1342, line: 412, baseType: !885, size: 64, offset: 256)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1421, file: !1342, line: 420, baseType: !885, size: 64, offset: 320)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1421, file: !1342, line: 423, baseType: !1339, size: 64, offset: 384)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !1352, file: !1342, line: 744, baseType: !1428, size: 384)
!1428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !1342, line: 429, size: 384, elements: !1429)
!1429 = !{!1430, !1431, !1432}
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1428, file: !1342, line: 431, baseType: !1355, size: 256)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1428, file: !1342, line: 434, baseType: !885, size: 64, offset: 256)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1428, file: !1342, line: 437, baseType: !1339, size: 64, offset: 320)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !1352, file: !1342, line: 745, baseType: !1434, size: 384)
!1434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !1342, line: 443, size: 384, elements: !1435)
!1435 = !{!1436, !1437, !1438}
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1434, file: !1342, line: 445, baseType: !1355, size: 256)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1434, file: !1342, line: 449, baseType: !885, size: 64, offset: 256)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1434, file: !1342, line: 453, baseType: !1339, size: 64, offset: 320)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !1352, file: !1342, line: 746, baseType: !1440, size: 320)
!1440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !1342, line: 459, size: 320, elements: !1441)
!1441 = !{!1442, !1443}
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1440, file: !1342, line: 461, baseType: !1355, size: 256)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1440, file: !1342, line: 464, baseType: !885, size: 64, offset: 256)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !1352, file: !1342, line: 747, baseType: !1445, size: 768)
!1445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !1342, line: 469, size: 768, elements: !1446)
!1446 = !{!1447, !1448, !1449, !1450, !1451}
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1445, file: !1342, line: 471, baseType: !1355, size: 256)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1445, file: !1342, line: 474, baseType: !7, size: 32, offset: 256)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1445, file: !1342, line: 475, baseType: !7, size: 32, offset: 288)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1445, file: !1342, line: 478, baseType: !885, size: 64, offset: 320)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1445, file: !1342, line: 481, baseType: !1452, size: 384, offset: 384)
!1452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1453, size: 384, elements: !804)
!1453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !142, line: 1917, size: 384, elements: !1454)
!1454 = !{!1455, !1456, !1457}
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1453, file: !142, line: 1920, baseType: !1392, size: 256)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1453, file: !142, line: 1921, baseType: !885, size: 64, offset: 256)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1453, file: !142, line: 1922, baseType: !1005, size: 32, offset: 320)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !1352, file: !1342, line: 748, baseType: !1459, size: 320)
!1459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !1342, line: 487, size: 320, elements: !1460)
!1460 = !{!1461, !1462}
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1459, file: !1342, line: 490, baseType: !1355, size: 256)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1459, file: !1342, line: 494, baseType: !754, size: 32, offset: 256)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !1352, file: !1342, line: 749, baseType: !1464, size: 384)
!1464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !1342, line: 500, size: 384, elements: !1465)
!1465 = !{!1466, !1467, !1468}
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1464, file: !1342, line: 502, baseType: !1355, size: 256)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1464, file: !1342, line: 506, baseType: !1339, size: 64, offset: 256)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1464, file: !1342, line: 510, baseType: !1339, size: 64, offset: 320)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !1352, file: !1342, line: 750, baseType: !1470, size: 320)
!1470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !1342, line: 529, size: 320, elements: !1471)
!1471 = !{!1472, !1473}
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1470, file: !1342, line: 531, baseType: !1355, size: 256)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1470, file: !1342, line: 540, baseType: !1339, size: 64, offset: 256)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !1352, file: !1342, line: 751, baseType: !1475, size: 704)
!1475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !1342, line: 546, size: 704, elements: !1476)
!1476 = !{!1477, !1478, !1479, !1480, !1481, !1482, !1483}
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1475, file: !1342, line: 549, baseType: !1405, size: 512)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1475, file: !1342, line: 553, baseType: !759, size: 64, offset: 512)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1475, file: !1342, line: 557, baseType: !753, size: 8, offset: 576)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1475, file: !1342, line: 558, baseType: !753, size: 8, offset: 584)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1475, file: !1342, line: 559, baseType: !753, size: 8, offset: 592)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1475, file: !1342, line: 560, baseType: !753, size: 8, offset: 600)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1475, file: !1342, line: 566, baseType: !1287, size: 64, offset: 640)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !1352, file: !1342, line: 752, baseType: !1485, size: 384)
!1485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !1342, line: 571, size: 384, elements: !1486)
!1486 = !{!1487, !1488}
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1485, file: !1342, line: 573, baseType: !1416, size: 320)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1485, file: !1342, line: 577, baseType: !885, size: 64, offset: 320)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !1352, file: !1342, line: 753, baseType: !1490, size: 576)
!1490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !1342, line: 600, size: 576, elements: !1491)
!1491 = !{!1492, !1493, !1494, !1495, !1504}
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1490, file: !1342, line: 602, baseType: !1416, size: 320)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1490, file: !1342, line: 605, baseType: !885, size: 64, offset: 320)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1490, file: !1342, line: 609, baseType: !1250, size: 64, offset: 384)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1490, file: !1342, line: 612, baseType: !1496, size: 64, offset: 448)
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64)
!1497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !1342, line: 581, size: 320, elements: !1498)
!1498 = !{!1499, !1500, !1501, !1502, !1503}
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1497, file: !1342, line: 583, baseType: !141, size: 32)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1497, file: !1342, line: 586, baseType: !885, size: 64, offset: 64)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1497, file: !1342, line: 589, baseType: !885, size: 64, offset: 128)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1497, file: !1342, line: 592, baseType: !885, size: 64, offset: 192)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1497, file: !1342, line: 595, baseType: !885, size: 64, offset: 256)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1490, file: !1342, line: 616, baseType: !1339, size: 64, offset: 512)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !1352, file: !1342, line: 754, baseType: !1506, size: 512)
!1506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !1342, line: 622, size: 512, elements: !1507)
!1507 = !{!1508, !1509, !1510, !1511}
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1506, file: !1342, line: 624, baseType: !1416, size: 320)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1506, file: !1342, line: 628, baseType: !885, size: 64, offset: 320)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1506, file: !1342, line: 632, baseType: !885, size: 64, offset: 384)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1506, file: !1342, line: 636, baseType: !885, size: 64, offset: 448)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !1352, file: !1342, line: 755, baseType: !1513, size: 704)
!1513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !1342, line: 642, size: 704, elements: !1514)
!1514 = !{!1515, !1516, !1517, !1518}
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1513, file: !1342, line: 644, baseType: !1506, size: 512)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1513, file: !1342, line: 648, baseType: !885, size: 64, offset: 512)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1513, file: !1342, line: 652, baseType: !885, size: 64, offset: 576)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1513, file: !1342, line: 653, baseType: !885, size: 64, offset: 640)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !1352, file: !1342, line: 756, baseType: !1520, size: 448)
!1520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !1342, line: 663, size: 448, elements: !1521)
!1521 = !{!1522, !1523, !1524}
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1520, file: !1342, line: 665, baseType: !1416, size: 320)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1520, file: !1342, line: 668, baseType: !885, size: 64, offset: 320)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1520, file: !1342, line: 673, baseType: !885, size: 64, offset: 384)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !1352, file: !1342, line: 757, baseType: !1526, size: 384)
!1526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !1342, line: 694, size: 384, elements: !1527)
!1527 = !{!1528, !1529}
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1526, file: !1342, line: 696, baseType: !1416, size: 320)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1526, file: !1342, line: 699, baseType: !885, size: 64, offset: 320)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !1352, file: !1342, line: 758, baseType: !1531, size: 384)
!1531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !1342, line: 681, size: 384, elements: !1532)
!1532 = !{!1533, !1534, !1535}
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1531, file: !1342, line: 683, baseType: !1355, size: 256)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1531, file: !1342, line: 686, baseType: !885, size: 64, offset: 256)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1531, file: !1342, line: 689, baseType: !885, size: 64, offset: 320)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !1352, file: !1342, line: 759, baseType: !1537, size: 384)
!1537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !1342, line: 707, size: 384, elements: !1538)
!1538 = !{!1539, !1540, !1541}
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1537, file: !1342, line: 709, baseType: !1355, size: 256)
