; ModuleID = 'fixed-value.bc'
source_filename = "fixed-value.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.stat64 = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.fixed_value = type { %struct.double_int, i32 }
%struct.double_int = type { i64, i64 }
%struct.real_value = type { i32, [3 x i64] }

@stdout = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@stdin = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@mode_fbit = external dso_local local_unnamed_addr constant [87 x i8], align 16
@mode_class = external dso_local local_unnamed_addr constant [87 x i8], align 16

!301 = !DIEnumerator(name: "SWITCH_EXPR", value: 138, isUnsigned: true)
!302 = !DIEnumerator(name: "CASE_LABEL_EXPR", value: 139, isUnsigned: true)
!303 = !DIEnumerator(name: "ASM_EXPR", value: 140, isUnsigned: true)
!304 = !DIEnumerator(name: "SSA_NAME", value: 141, isUnsigned: true)
!305 = !DIEnumerator(name: "CATCH_EXPR", value: 142, isUnsigned: true)
!306 = !DIEnumerator(name: "EH_FILTER_EXPR", value: 143, isUnsigned: true)
!307 = !DIEnumerator(name: "SCEV_KNOWN", value: 144, isUnsigned: true)
!308 = !DIEnumerator(name: "SCEV_NOT_KNOWN", value: 145, isUnsigned: true)
!309 = !DIEnumerator(name: "POLYNOMIAL_CHREC", value: 146, isUnsigned: true)
!310 = !DIEnumerator(name: "STATEMENT_LIST", value: 147, isUnsigned: true)
!311 = !DIEnumerator(name: "ASSERT_EXPR", value: 148, isUnsigned: true)
!312 = !DIEnumerator(name: "TREE_BINFO", value: 149, isUnsigned: true)
!313 = !DIEnumerator(name: "WITH_SIZE_EXPR", value: 150, isUnsigned: true)
!314 = !DIEnumerator(name: "REALIGN_LOAD_EXPR", value: 151, isUnsigned: true)
!315 = !DIEnumerator(name: "TARGET_MEM_REF", value: 152, isUnsigned: true)
!316 = !DIEnumerator(name: "OMP_PARALLEL", value: 153, isUnsigned: true)
!317 = !DIEnumerator(name: "OMP_TASK", value: 154, isUnsigned: true)
!318 = !DIEnumerator(name: "OMP_FOR", value: 155, isUnsigned: true)
!319 = !DIEnumerator(name: "OMP_SECTIONS", value: 156, isUnsigned: true)
!320 = !DIEnumerator(name: "OMP_SINGLE", value: 157, isUnsigned: true)
!321 = !DIEnumerator(name: "OMP_SECTION", value: 158, isUnsigned: true)
!322 = !DIEnumerator(name: "OMP_MASTER", value: 159, isUnsigned: true)
!323 = !DIEnumerator(name: "OMP_ORDERED", value: 160, isUnsigned: true)
!324 = !DIEnumerator(name: "OMP_CRITICAL", value: 161, isUnsigned: true)
!325 = !DIEnumerator(name: "OMP_ATOMIC", value: 162, isUnsigned: true)
!326 = !DIEnumerator(name: "OMP_CLAUSE", value: 163, isUnsigned: true)
!327 = !DIEnumerator(name: "REDUC_MAX_EXPR", value: 164, isUnsigned: true)
!328 = !DIEnumerator(name: "REDUC_MIN_EXPR", value: 165, isUnsigned: true)
!329 = !DIEnumerator(name: "REDUC_PLUS_EXPR", value: 166, isUnsigned: true)
!330 = !DIEnumerator(name: "DOT_PROD_EXPR", value: 167, isUnsigned: true)
!331 = !DIEnumerator(name: "WIDEN_SUM_EXPR", value: 168, isUnsigned: true)
!332 = !DIEnumerator(name: "WIDEN_MULT_EXPR", value: 169, isUnsigned: true)
!333 = !DIEnumerator(name: "VEC_LSHIFT_EXPR", value: 170, isUnsigned: true)
!334 = !DIEnumerator(name: "VEC_RSHIFT_EXPR", value: 171, isUnsigned: true)
!335 = !DIEnumerator(name: "VEC_WIDEN_MULT_HI_EXPR", value: 172, isUnsigned: true)
!336 = !DIEnumerator(name: "VEC_WIDEN_MULT_LO_EXPR", value: 173, isUnsigned: true)
!337 = !DIEnumerator(name: "VEC_UNPACK_HI_EXPR", value: 174, isUnsigned: true)
!338 = !DIEnumerator(name: "VEC_UNPACK_LO_EXPR", value: 175, isUnsigned: true)
!339 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_HI_EXPR", value: 176, isUnsigned: true)
!340 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_LO_EXPR", value: 177, isUnsigned: true)
!341 = !DIEnumerator(name: "VEC_PACK_TRUNC_EXPR", value: 178, isUnsigned: true)
!342 = !DIEnumerator(name: "VEC_PACK_SAT_EXPR", value: 179, isUnsigned: true)
!343 = !DIEnumerator(name: "VEC_PACK_FIX_TRUNC_EXPR", value: 180, isUnsigned: true)
!344 = !DIEnumerator(name: "VEC_EXTRACT_EVEN_EXPR", value: 181, isUnsigned: true)
!345 = !DIEnumerator(name: "VEC_EXTRACT_ODD_EXPR", value: 182, isUnsigned: true)
!346 = !DIEnumerator(name: "VEC_INTERLEAVE_HIGH_EXPR", value: 183, isUnsigned: true)
!347 = !DIEnumerator(name: "VEC_INTERLEAVE_LOW_EXPR", value: 184, isUnsigned: true)
!348 = !DIEnumerator(name: "PREDICT_EXPR", value: 185, isUnsigned: true)
!349 = !DIEnumerator(name: "OPTIMIZATION_NODE", value: 186, isUnsigned: true)
!350 = !DIEnumerator(name: "TARGET_OPTION_NODE", value: 187, isUnsigned: true)
!351 = !DIEnumerator(name: "LAST_AND_UNUSED_TREE_CODE", value: 188, isUnsigned: true)
!352 = !DIEnumerator(name: "C_MAYBE_CONST_EXPR", value: 189, isUnsigned: true)
!353 = !DIEnumerator(name: "EXCESS_PRECISION_EXPR", value: 190, isUnsigned: true)
!354 = !DIEnumerator(name: "MAX_TREE_CODES", value: 191, isUnsigned: true)
!355 = !{!356, !357, !358, !359, !362, !363, !5, !138, !365, !160}
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!358 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !361)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!367 = !{i32 2, !"Dwarf Version", i32 4}
!368 = !{i32 2, !"Debug Info Version", i32 3}
!369 = !{i32 1, !"wchar_size", i32 4}
!370 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!371 = distinct !DISubprogram(name: "vprintf", scope: !372, file: !372, line: 39, type: !373, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !383)
!372 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!373 = !DISubroutineType(types: !374)
!374 = !{!358, !375, !376}
!375 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !363)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, elements: !378)
!378 = !{!379, !380, !381, !382}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !377, file: !1, baseType: !5, size: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !377, file: !1, baseType: !5, size: 32, offset: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !377, file: !1, baseType: !362, size: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !377, file: !1, baseType: !362, size: 64, offset: 128)
!383 = !{!384, !385}
!384 = !DILocalVariable(name: "__fmt", arg: 1, scope: !371, file: !372, line: 39, type: !375)
!385 = !DILocalVariable(name: "__arg", arg: 2, scope: !371, file: !372, line: 39, type: !376)
!386 = !DILocation(line: 0, scope: !371)
!387 = !DILocation(line: 41, column: 20, scope: !371)
!388 = !DILocation(line: 41, column: 10, scope: !371)
!389 = !DILocation(line: 41, column: 3, scope: !371)
!390 = distinct !DISubprogram(name: "getchar", scope: !372, file: !372, line: 47, type: !391, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !393)
!391 = !DISubroutineType(types: !392)
!392 = !{!358}
!393 = !{}
!394 = !DILocation(line: 49, column: 16, scope: !390)
!395 = !DILocation(line: 49, column: 10, scope: !390)
!396 = !DILocation(line: 49, column: 3, scope: !390)
!397 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !372, file: !372, line: 56, type: !398, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !458)
!398 = !DISubroutineType(types: !399)
!399 = !{!358, !400}
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !402, line: 7, baseType: !403)
!402 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !404, line: 49, size: 1728, elements: !405)
!404 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!405 = !{!406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !421, !423, !424, !425, !428, !430, !432, !436, !439, !441, !444, !447, !448, !449, !453, !454}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !403, file: !404, line: 51, baseType: !358, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !403, file: !404, line: 54, baseType: !360, size: 64, offset: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !403, file: !404, line: 55, baseType: !360, size: 64, offset: 128)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !403, file: !404, line: 56, baseType: !360, size: 64, offset: 192)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !403, file: !404, line: 57, baseType: !360, size: 64, offset: 256)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !403, file: !404, line: 58, baseType: !360, size: 64, offset: 320)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !403, file: !404, line: 59, baseType: !360, size: 64, offset: 384)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !403, file: !404, line: 60, baseType: !360, size: 64, offset: 448)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !403, file: !404, line: 61, baseType: !360, size: 64, offset: 512)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !403, file: !404, line: 64, baseType: !360, size: 64, offset: 576)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !403, file: !404, line: 65, baseType: !360, size: 64, offset: 640)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !403, file: !404, line: 66, baseType: !360, size: 64, offset: 704)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !403, file: !404, line: 68, baseType: !419, size: 64, offset: 768)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !404, line: 36, flags: DIFlagFwdDecl)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !403, file: !404, line: 70, baseType: !422, size: 64, offset: 832)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !403, file: !404, line: 72, baseType: !358, size: 32, offset: 896)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !403, file: !404, line: 73, baseType: !358, size: 32, offset: 928)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !403, file: !404, line: 74, baseType: !426, size: 64, offset: 960)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !427, line: 152, baseType: !366)
!427 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !403, file: !404, line: 77, baseType: !429, size: 16, offset: 1024)
!429 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !403, file: !404, line: 78, baseType: !431, size: 8, offset: 1040)
!431 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !403, file: !404, line: 79, baseType: !433, size: 8, offset: 1048)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 8, elements: !434)
!434 = !{!435}
!435 = !DISubrange(count: 1)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !403, file: !404, line: 81, baseType: !437, size: 64, offset: 1088)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !404, line: 43, baseType: null)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !403, file: !404, line: 89, baseType: !440, size: 64, offset: 1152)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !427, line: 153, baseType: !366)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !403, file: !404, line: 91, baseType: !442, size: 64, offset: 1216)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !404, line: 37, flags: DIFlagFwdDecl)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !403, file: !404, line: 92, baseType: !445, size: 64, offset: 1280)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !404, line: 38, flags: DIFlagFwdDecl)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !403, file: !404, line: 93, baseType: !422, size: 64, offset: 1344)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !403, file: !404, line: 94, baseType: !362, size: 64, offset: 1408)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !403, file: !404, line: 95, baseType: !450, size: 64, offset: 1472)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !451, line: 46, baseType: !452)
!451 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!452 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !403, file: !404, line: 96, baseType: !358, size: 32, offset: 1536)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !403, file: !404, line: 98, baseType: !455, size: 160, offset: 1568)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 160, elements: !456)
!456 = !{!457}
!457 = !DISubrange(count: 20)
!458 = !{!459}
!459 = !DILocalVariable(name: "__fp", arg: 1, scope: !397, file: !372, line: 56, type: !400)
!460 = !DILocation(line: 0, scope: !397)
!461 = !DILocation(line: 58, column: 10, scope: !397)
!462 = !DILocation(line: 58, column: 3, scope: !397)
!463 = distinct !DISubprogram(name: "getc_unlocked", scope: !372, file: !372, line: 66, type: !398, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !464)
!464 = !{!465}
!465 = !DILocalVariable(name: "__fp", arg: 1, scope: !463, file: !372, line: 66, type: !400)
!466 = !DILocation(line: 0, scope: !463)
!467 = !DILocation(line: 68, column: 10, scope: !463)
!468 = !DILocation(line: 68, column: 3, scope: !463)
!469 = distinct !DISubprogram(name: "getchar_unlocked", scope: !372, file: !372, line: 73, type: !391, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !393)
!470 = !DILocation(line: 75, column: 10, scope: !469)
!471 = !DILocation(line: 75, column: 3, scope: !469)
!472 = distinct !DISubprogram(name: "putchar", scope: !372, file: !372, line: 82, type: !473, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !475)
!473 = !DISubroutineType(types: !474)
!474 = !{!358, !358}
!475 = !{!476}
!476 = !DILocalVariable(name: "__c", arg: 1, scope: !472, file: !372, line: 82, type: !358)
!477 = !DILocation(line: 0, scope: !472)
!478 = !DILocation(line: 84, column: 21, scope: !472)
!479 = !DILocation(line: 84, column: 10, scope: !472)
!480 = !DILocation(line: 84, column: 3, scope: !472)
!481 = distinct !DISubprogram(name: "fputc_unlocked", scope: !372, file: !372, line: 91, type: !482, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !484)
!482 = !DISubroutineType(types: !483)
!483 = !{!358, !358, !400}
!484 = !{!485, !486}
!485 = !DILocalVariable(name: "__c", arg: 1, scope: !481, file: !372, line: 91, type: !358)
!486 = !DILocalVariable(name: "__stream", arg: 2, scope: !481, file: !372, line: 91, type: !400)
!487 = !DILocation(line: 0, scope: !481)
!488 = !DILocation(line: 93, column: 10, scope: !481)
!489 = !DILocation(line: 93, column: 3, scope: !481)
!490 = distinct !DISubprogram(name: "putc_unlocked", scope: !372, file: !372, line: 101, type: !482, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !491)
!491 = !{!492, !493}
!492 = !DILocalVariable(name: "__c", arg: 1, scope: !490, file: !372, line: 101, type: !358)
!493 = !DILocalVariable(name: "__stream", arg: 2, scope: !490, file: !372, line: 101, type: !400)
!494 = !DILocation(line: 0, scope: !490)
!495 = !DILocation(line: 103, column: 10, scope: !490)
!496 = !DILocation(line: 103, column: 3, scope: !490)
!497 = distinct !DISubprogram(name: "putchar_unlocked", scope: !372, file: !372, line: 108, type: !473, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !498)
!498 = !{!499}
!499 = !DILocalVariable(name: "__c", arg: 1, scope: !497, file: !372, line: 108, type: !358)
!500 = !DILocation(line: 0, scope: !497)
!501 = !DILocation(line: 110, column: 10, scope: !497)
!502 = !DILocation(line: 110, column: 3, scope: !497)
!503 = distinct !DISubprogram(name: "getline", scope: !372, file: !372, line: 118, type: !504, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !508)
!504 = !DISubroutineType(types: !505)
!505 = !{!506, !359, !507, !400}
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !427, line: 193, baseType: !366)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!508 = !{!509, !510, !511}
!509 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !503, file: !372, line: 118, type: !359)
!510 = !DILocalVariable(name: "__n", arg: 2, scope: !503, file: !372, line: 118, type: !507)
!511 = !DILocalVariable(name: "__stream", arg: 3, scope: !503, file: !372, line: 118, type: !400)
!512 = !DILocation(line: 0, scope: !503)
!513 = !DILocation(line: 120, column: 10, scope: !503)
!514 = !DILocation(line: 120, column: 3, scope: !503)
!515 = distinct !DISubprogram(name: "feof_unlocked", scope: !372, file: !372, line: 128, type: !398, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !516)
!516 = !{!517}
!517 = !DILocalVariable(name: "__stream", arg: 1, scope: !515, file: !372, line: 128, type: !400)
!518 = !DILocation(line: 0, scope: !515)
!519 = !DILocation(line: 130, column: 10, scope: !515)
!520 = !DILocation(line: 130, column: 3, scope: !515)
!521 = distinct !DISubprogram(name: "ferror_unlocked", scope: !372, file: !372, line: 135, type: !398, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !522)
!522 = !{!523}
!523 = !DILocalVariable(name: "__stream", arg: 1, scope: !521, file: !372, line: 135, type: !400)
!524 = !DILocation(line: 0, scope: !521)
!525 = !DILocation(line: 137, column: 10, scope: !521)
!526 = !DILocation(line: 137, column: 3, scope: !521)
!527 = distinct !DISubprogram(name: "tolower", scope: !528, file: !528, line: 207, type: !473, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !529)
!528 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!529 = !{!530}
!530 = !DILocalVariable(name: "__c", arg: 1, scope: !527, file: !528, line: 207, type: !358)
!531 = !DILocation(line: 0, scope: !527)
!532 = !DILocation(line: 209, column: 22, scope: !527)
!533 = !DILocation(line: 209, column: 39, scope: !527)
!534 = !DILocation(line: 209, column: 38, scope: !527)
!535 = !DILocation(line: 209, column: 37, scope: !527)
!536 = !DILocation(line: 209, column: 10, scope: !527)
!537 = !DILocation(line: 209, column: 3, scope: !527)
!538 = distinct !DISubprogram(name: "toupper", scope: !528, file: !528, line: 213, type: !473, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !539)
!539 = !{!540}
!540 = !DILocalVariable(name: "__c", arg: 1, scope: !538, file: !528, line: 213, type: !358)
!541 = !DILocation(line: 0, scope: !538)
!542 = !DILocation(line: 215, column: 22, scope: !538)
!543 = !DILocation(line: 215, column: 39, scope: !538)
!544 = !DILocation(line: 215, column: 38, scope: !538)
!545 = !DILocation(line: 215, column: 37, scope: !538)
!546 = !DILocation(line: 215, column: 10, scope: !538)
!547 = !DILocation(line: 215, column: 3, scope: !538)
!548 = distinct !DISubprogram(name: "atoi", scope: !549, file: !549, line: 361, type: !550, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !552)
!549 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!550 = !DISubroutineType(types: !551)
!551 = !{!358, !363}
!552 = !{!553}
!553 = !DILocalVariable(name: "__nptr", arg: 1, scope: !548, file: !549, line: 361, type: !363)
!554 = !DILocation(line: 0, scope: !548)
!555 = !DILocation(line: 363, column: 16, scope: !548)
!556 = !DILocation(line: 363, column: 10, scope: !548)
!557 = !DILocation(line: 363, column: 3, scope: !548)
!558 = distinct !DISubprogram(name: "atol", scope: !549, file: !549, line: 366, type: !559, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !561)
!559 = !DISubroutineType(types: !560)
!560 = !{!366, !363}
!561 = !{!562}
!562 = !DILocalVariable(name: "__nptr", arg: 1, scope: !558, file: !549, line: 366, type: !363)
!563 = !DILocation(line: 0, scope: !558)
!564 = !DILocation(line: 368, column: 10, scope: !558)
!565 = !DILocation(line: 368, column: 3, scope: !558)
!566 = distinct !DISubprogram(name: "atoll", scope: !549, file: !549, line: 373, type: !567, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !570)
!567 = !DISubroutineType(types: !568)
!568 = !{!569, !363}
!569 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!570 = !{!571}
!571 = !DILocalVariable(name: "__nptr", arg: 1, scope: !566, file: !549, line: 373, type: !363)
!572 = !DILocation(line: 0, scope: !566)
!573 = !DILocation(line: 375, column: 10, scope: !566)
!574 = !DILocation(line: 375, column: 3, scope: !566)
!575 = distinct !DISubprogram(name: "bsearch", scope: !576, file: !576, line: 20, type: !577, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !585)
!576 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!577 = !DISubroutineType(types: !578)
!578 = !{!362, !579, !579, !450, !450, !581}
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !549, line: 808, baseType: !582)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{!358, !579, !579}
!585 = !{!586, !587, !588, !589, !590, !591, !592, !593, !594, !595}
!586 = !DILocalVariable(name: "__key", arg: 1, scope: !575, file: !576, line: 20, type: !579)
!587 = !DILocalVariable(name: "__base", arg: 2, scope: !575, file: !576, line: 20, type: !579)
!588 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !575, file: !576, line: 20, type: !450)
!589 = !DILocalVariable(name: "__size", arg: 4, scope: !575, file: !576, line: 20, type: !450)
!590 = !DILocalVariable(name: "__compar", arg: 5, scope: !575, file: !576, line: 21, type: !581)
!591 = !DILocalVariable(name: "__l", scope: !575, file: !576, line: 23, type: !450)
!592 = !DILocalVariable(name: "__u", scope: !575, file: !576, line: 23, type: !450)
!593 = !DILocalVariable(name: "__idx", scope: !575, file: !576, line: 23, type: !450)
!594 = !DILocalVariable(name: "__p", scope: !575, file: !576, line: 24, type: !579)
!595 = !DILocalVariable(name: "__comparison", scope: !575, file: !576, line: 25, type: !358)
!596 = !DILocation(line: 0, scope: !575)
!597 = !DILocation(line: 29, column: 3, scope: !575)
!598 = !DILocation(line: 27, column: 7, scope: !575)
!599 = !DILocation(line: 29, column: 14, scope: !575)
!600 = !DILocation(line: 31, column: 20, scope: !601)
!601 = distinct !DILexicalBlock(scope: !575, file: !576, line: 30, column: 5)
!602 = !DILocation(line: 31, column: 27, scope: !601)
!603 = !DILocation(line: 32, column: 56, scope: !601)
!604 = !DILocation(line: 32, column: 47, scope: !601)
!605 = !DILocation(line: 33, column: 22, scope: !601)
!606 = !DILocation(line: 34, column: 24, scope: !607)
!607 = distinct !DILexicalBlock(scope: !601, file: !576, line: 34, column: 11)
!608 = !DILocation(line: 34, column: 11, scope: !601)
!609 = !DILocation(line: 36, column: 29, scope: !610)
!610 = distinct !DILexicalBlock(scope: !607, file: !576, line: 36, column: 16)
!611 = !DILocation(line: 36, column: 16, scope: !607)
!612 = !DILocation(line: 37, column: 14, scope: !610)
!613 = distinct !{!613, !597, !614}
!614 = !DILocation(line: 40, column: 5, scope: !575)
!615 = !DILocation(line: 43, column: 1, scope: !575)
!616 = distinct !DISubprogram(name: "atof", scope: !617, file: !617, line: 25, type: !618, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !621)
!617 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!618 = !DISubroutineType(types: !619)
!619 = !{!620, !363}
!620 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!621 = !{!622}
!622 = !DILocalVariable(name: "__nptr", arg: 1, scope: !616, file: !617, line: 25, type: !363)
!623 = !DILocation(line: 0, scope: !616)
!624 = !DILocation(line: 27, column: 10, scope: !616)
!625 = !DILocation(line: 27, column: 3, scope: !616)
!626 = distinct !DISubprogram(name: "strtoimax", scope: !627, file: !627, line: 324, type: !628, scopeLine: 326, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !634)
!627 = !DIFile(filename: "/usr/include/inttypes.h", directory: "")
!628 = !DISubroutineType(types: !629)
!629 = !{!630, !375, !633, !358}
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !631, line: 101, baseType: !632)
!631 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !427, line: 72, baseType: !366)
!633 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !359)
!634 = !{!635, !636, !637}
!635 = !DILocalVariable(name: "nptr", arg: 1, scope: !626, file: !627, line: 324, type: !375)
!636 = !DILocalVariable(name: "endptr", arg: 2, scope: !626, file: !627, line: 324, type: !633)
!637 = !DILocalVariable(name: "base", arg: 3, scope: !626, file: !627, line: 324, type: !358)
!638 = !DILocation(line: 0, scope: !626)
!639 = !DILocation(line: 327, column: 10, scope: !626)
!640 = !DILocation(line: 327, column: 3, scope: !626)
!641 = distinct !DISubprogram(name: "strtoumax", scope: !627, file: !627, line: 336, type: !642, scopeLine: 338, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !646)
!642 = !DISubroutineType(types: !643)
!643 = !{!644, !375, !633, !358}
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !631, line: 102, baseType: !645)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !427, line: 73, baseType: !452)
!646 = !{!647, !648, !649}
!647 = !DILocalVariable(name: "nptr", arg: 1, scope: !641, file: !627, line: 336, type: !375)
!648 = !DILocalVariable(name: "endptr", arg: 2, scope: !641, file: !627, line: 336, type: !633)
!649 = !DILocalVariable(name: "base", arg: 3, scope: !641, file: !627, line: 336, type: !358)
!650 = !DILocation(line: 0, scope: !641)
!651 = !DILocation(line: 339, column: 10, scope: !641)
!652 = !DILocation(line: 339, column: 3, scope: !641)
!653 = distinct !DISubprogram(name: "wcstoimax", scope: !627, file: !627, line: 348, type: !654, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !663)
!654 = !DISubroutineType(types: !655)
!655 = !{!630, !656, !660, !358}
!656 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !657)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !659)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gwchar_t", file: !627, line: 34, baseType: !358)
!660 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !661)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!663 = !{!664, !665, !666}
!664 = !DILocalVariable(name: "nptr", arg: 1, scope: !653, file: !627, line: 348, type: !656)
!665 = !DILocalVariable(name: "endptr", arg: 2, scope: !653, file: !627, line: 348, type: !660)
!666 = !DILocalVariable(name: "base", arg: 3, scope: !653, file: !627, line: 348, type: !358)
!667 = !DILocation(line: 0, scope: !653)
!668 = !DILocation(line: 351, column: 10, scope: !653)
!669 = !DILocation(line: 351, column: 3, scope: !653)
!670 = distinct !DISubprogram(name: "wcstoumax", scope: !627, file: !627, line: 362, type: !671, scopeLine: 364, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !673)
!671 = !DISubroutineType(types: !672)
!672 = !{!644, !656, !660, !358}
!673 = !{!674, !675, !676}
!674 = !DILocalVariable(name: "nptr", arg: 1, scope: !670, file: !627, line: 362, type: !656)
!675 = !DILocalVariable(name: "endptr", arg: 2, scope: !670, file: !627, line: 362, type: !660)
!676 = !DILocalVariable(name: "base", arg: 3, scope: !670, file: !627, line: 362, type: !358)
!677 = !DILocation(line: 0, scope: !670)
!678 = !DILocation(line: 365, column: 10, scope: !670)
!679 = !DILocation(line: 365, column: 3, scope: !670)
!680 = distinct !DISubprogram(name: "stat", scope: !681, file: !681, line: 453, type: !682, scopeLine: 454, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !721)
!681 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "")
!682 = !DISubroutineType(types: !683)
!683 = !{!358, !363, !684}
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !686, line: 46, size: 1152, elements: !687)
!686 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!687 = !{!688, !690, !692, !694, !696, !698, !700, !701, !702, !703, !705, !707, !715, !716, !717}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !685, file: !686, line: 48, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !427, line: 145, baseType: !452)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !685, file: !686, line: 53, baseType: !691, size: 64, offset: 64)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !427, line: 148, baseType: !452)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !685, file: !686, line: 61, baseType: !693, size: 64, offset: 128)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !427, line: 151, baseType: !452)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !685, file: !686, line: 62, baseType: !695, size: 32, offset: 192)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !427, line: 150, baseType: !5)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !685, file: !686, line: 64, baseType: !697, size: 32, offset: 224)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !427, line: 146, baseType: !5)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !685, file: !686, line: 65, baseType: !699, size: 32, offset: 256)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !427, line: 147, baseType: !5)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !685, file: !686, line: 67, baseType: !358, size: 32, offset: 288)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !685, file: !686, line: 69, baseType: !689, size: 64, offset: 320)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !685, file: !686, line: 74, baseType: !426, size: 64, offset: 384)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !685, file: !686, line: 78, baseType: !704, size: 64, offset: 448)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !427, line: 174, baseType: !366)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !685, file: !686, line: 80, baseType: !706, size: 64, offset: 512)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !427, line: 179, baseType: !366)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !685, file: !686, line: 91, baseType: !708, size: 128, offset: 576)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !709, line: 10, size: 128, elements: !710)
!709 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!710 = !{!711, !713}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !708, file: !709, line: 12, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !427, line: 160, baseType: !366)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !708, file: !709, line: 16, baseType: !714, size: 64, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !427, line: 196, baseType: !366)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !685, file: !686, line: 92, baseType: !708, size: 128, offset: 704)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !685, file: !686, line: 93, baseType: !708, size: 128, offset: 832)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !685, file: !686, line: 106, baseType: !718, size: 192, offset: 960)
!718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !714, size: 192, elements: !719)
!719 = !{!720}
!720 = !DISubrange(count: 3)
!721 = !{!722, !723}
!722 = !DILocalVariable(name: "__path", arg: 1, scope: !680, file: !681, line: 453, type: !363)
!723 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !680, file: !681, line: 453, type: !684)
!724 = !DILocation(line: 0, scope: !680)
!725 = !DILocation(line: 455, column: 10, scope: !680)
!726 = !DILocation(line: 455, column: 3, scope: !680)
!727 = distinct !DISubprogram(name: "lstat", scope: !681, file: !681, line: 460, type: !682, scopeLine: 461, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !728)
!728 = !{!729, !730}
!729 = !DILocalVariable(name: "__path", arg: 1, scope: !727, file: !681, line: 460, type: !363)
!730 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !727, file: !681, line: 460, type: !684)
!731 = !DILocation(line: 0, scope: !727)
!732 = !DILocation(line: 462, column: 10, scope: !727)
!733 = !DILocation(line: 462, column: 3, scope: !727)
!734 = distinct !DISubprogram(name: "fstat", scope: !681, file: !681, line: 467, type: !735, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !737)
!735 = !DISubroutineType(types: !736)
!736 = !{!358, !358, !684}
!737 = !{!738, !739}
!738 = !DILocalVariable(name: "__fd", arg: 1, scope: !734, file: !681, line: 467, type: !358)
!739 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !734, file: !681, line: 467, type: !684)
!740 = !DILocation(line: 0, scope: !734)
!741 = !DILocation(line: 469, column: 10, scope: !734)
!742 = !DILocation(line: 469, column: 3, scope: !734)
!743 = distinct !DISubprogram(name: "fstatat", scope: !681, file: !681, line: 474, type: !744, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !746)
!744 = !DISubroutineType(types: !745)
!745 = !{!358, !358, !363, !684, !358}
!746 = !{!747, !748, !749, !750}
!747 = !DILocalVariable(name: "__fd", arg: 1, scope: !743, file: !681, line: 474, type: !358)
!748 = !DILocalVariable(name: "__filename", arg: 2, scope: !743, file: !681, line: 474, type: !363)
!749 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !743, file: !681, line: 474, type: !684)
!750 = !DILocalVariable(name: "__flag", arg: 4, scope: !743, file: !681, line: 474, type: !358)
!751 = !DILocation(line: 0, scope: !743)
!752 = !DILocation(line: 477, column: 10, scope: !743)
!753 = !DILocation(line: 477, column: 3, scope: !743)
!754 = distinct !DISubprogram(name: "mknod", scope: !681, file: !681, line: 483, type: !755, scopeLine: 484, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !757)
!755 = !DISubroutineType(types: !756)
!756 = !{!358, !363, !695, !689}
!757 = !{!758, !759, !760}
!758 = !DILocalVariable(name: "__path", arg: 1, scope: !754, file: !681, line: 483, type: !363)
!759 = !DILocalVariable(name: "__mode", arg: 2, scope: !754, file: !681, line: 483, type: !695)
!760 = !DILocalVariable(name: "__dev", arg: 3, scope: !754, file: !681, line: 483, type: !689)
!761 = !DILocation(line: 0, scope: !754)
!762 = !DILocation(line: 485, column: 10, scope: !754)
!763 = !DILocation(line: 485, column: 3, scope: !754)
!764 = distinct !DISubprogram(name: "mknodat", scope: !681, file: !681, line: 491, type: !765, scopeLine: 493, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !767)
!765 = !DISubroutineType(types: !766)
!766 = !{!358, !358, !363, !695, !689}
!767 = !{!768, !769, !770, !771}
!768 = !DILocalVariable(name: "__fd", arg: 1, scope: !764, file: !681, line: 491, type: !358)
!769 = !DILocalVariable(name: "__path", arg: 2, scope: !764, file: !681, line: 491, type: !363)
!770 = !DILocalVariable(name: "__mode", arg: 3, scope: !764, file: !681, line: 491, type: !695)
!771 = !DILocalVariable(name: "__dev", arg: 4, scope: !764, file: !681, line: 491, type: !689)
!772 = !DILocation(line: 0, scope: !764)
!773 = !DILocation(line: 494, column: 10, scope: !764)
!774 = !DILocation(line: 494, column: 3, scope: !764)
!775 = distinct !DISubprogram(name: "stat64", scope: !681, file: !681, line: 502, type: !776, scopeLine: 503, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !798)
!776 = !DISubroutineType(types: !777)
!777 = !{!358, !363, !778}
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !686, line: 119, size: 1152, elements: !780)
!780 = !{!781, !782, !784, !785, !786, !787, !788, !789, !790, !791, !792, !794, !795, !796, !797}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !779, file: !686, line: 121, baseType: !689, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !779, file: !686, line: 123, baseType: !783, size: 64, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !427, line: 149, baseType: !452)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !779, file: !686, line: 124, baseType: !693, size: 64, offset: 128)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !779, file: !686, line: 125, baseType: !695, size: 32, offset: 192)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !779, file: !686, line: 132, baseType: !697, size: 32, offset: 224)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !779, file: !686, line: 133, baseType: !699, size: 32, offset: 256)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !779, file: !686, line: 135, baseType: !358, size: 32, offset: 288)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !779, file: !686, line: 136, baseType: !689, size: 64, offset: 320)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !779, file: !686, line: 137, baseType: !426, size: 64, offset: 384)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !779, file: !686, line: 143, baseType: !704, size: 64, offset: 448)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !779, file: !686, line: 144, baseType: !793, size: 64, offset: 512)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !427, line: 180, baseType: !366)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !779, file: !686, line: 152, baseType: !708, size: 128, offset: 576)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !779, file: !686, line: 153, baseType: !708, size: 128, offset: 704)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !779, file: !686, line: 154, baseType: !708, size: 128, offset: 832)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !779, file: !686, line: 164, baseType: !718, size: 192, offset: 960)
!798 = !{!799, !800}
!799 = !DILocalVariable(name: "__path", arg: 1, scope: !775, file: !681, line: 502, type: !363)
!800 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !775, file: !681, line: 502, type: !778)
!801 = !DILocation(line: 0, scope: !775)
!802 = !DILocation(line: 504, column: 10, scope: !775)
!803 = !DILocation(line: 504, column: 3, scope: !775)
!804 = distinct !DISubprogram(name: "lstat64", scope: !681, file: !681, line: 509, type: !776, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !805)
!805 = !{!806, !807}
!806 = !DILocalVariable(name: "__path", arg: 1, scope: !804, file: !681, line: 509, type: !363)
!807 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !804, file: !681, line: 509, type: !778)
!808 = !DILocation(line: 0, scope: !804)
!809 = !DILocation(line: 511, column: 10, scope: !804)
!810 = !DILocation(line: 511, column: 3, scope: !804)
!811 = distinct !DISubprogram(name: "fstat64", scope: !681, file: !681, line: 516, type: !812, scopeLine: 517, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !814)
!812 = !DISubroutineType(types: !813)
!813 = !{!358, !358, !778}
!814 = !{!815, !816}
!815 = !DILocalVariable(name: "__fd", arg: 1, scope: !811, file: !681, line: 516, type: !358)
!816 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !811, file: !681, line: 516, type: !778)
!817 = !DILocation(line: 0, scope: !811)
!818 = !DILocation(line: 518, column: 10, scope: !811)
!819 = !DILocation(line: 518, column: 3, scope: !811)
!820 = distinct !DISubprogram(name: "fstatat64", scope: !681, file: !681, line: 523, type: !821, scopeLine: 525, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !823)
!821 = !DISubroutineType(types: !822)
!822 = !{!358, !358, !363, !778, !358}
!823 = !{!824, !825, !826, !827}
!824 = !DILocalVariable(name: "__fd", arg: 1, scope: !820, file: !681, line: 523, type: !358)
!825 = !DILocalVariable(name: "__filename", arg: 2, scope: !820, file: !681, line: 523, type: !363)
!826 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !820, file: !681, line: 523, type: !778)
!827 = !DILocalVariable(name: "__flag", arg: 4, scope: !820, file: !681, line: 523, type: !358)
!828 = !DILocation(line: 0, scope: !820)
!829 = !DILocation(line: 526, column: 10, scope: !820)
!830 = !DILocation(line: 526, column: 3, scope: !820)
!831 = distinct !DISubprogram(name: "fixed_identical", scope: !1, file: !1, line: 31, type: !832, scopeLine: 32, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !847)
!832 = !DISubroutineType(types: !833)
!833 = !{!357, !834, !834}
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !836)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !837, line: 27, size: 192, elements: !838)
!837 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!838 = !{!839, !846}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !836, file: !837, line: 29, baseType: !840, size: 128)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !841, line: 58, baseType: !842)
!841 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !841, line: 54, size: 128, elements: !843)
!843 = !{!844, !845}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !842, file: !841, line: 56, baseType: !452, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !842, file: !841, line: 57, baseType: !366, size: 64, offset: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !836, file: !837, line: 30, baseType: !3, size: 32, offset: 128)
!847 = !{!848, !849}
!848 = !DILocalVariable(name: "a", arg: 1, scope: !831, file: !1, line: 31, type: !834)
!849 = !DILocalVariable(name: "b", arg: 2, scope: !831, file: !1, line: 31, type: !834)
!850 = !DILocation(line: 0, scope: !831)
!851 = !DILocation(line: 33, column: 14, scope: !831)
!852 = !DILocation(line: 33, column: 25, scope: !831)
!853 = !DILocation(line: 33, column: 19, scope: !831)
!854 = !DILocation(line: 34, column: 4, scope: !831)
!855 = !DILocation(line: 34, column: 15, scope: !831)
!856 = !DILocation(line: 34, column: 31, scope: !831)
!857 = !DILocation(line: 34, column: 20, scope: !831)
!858 = !DILocation(line: 35, column: 4, scope: !831)
!859 = !DILocation(line: 35, column: 15, scope: !831)
!860 = !DILocation(line: 35, column: 30, scope: !831)
!861 = !DILocation(line: 35, column: 19, scope: !831)
!862 = !DILocation(line: 33, column: 3, scope: !831)
!863 = distinct !DISubprogram(name: "fixed_hash", scope: !1, file: !1, line: 41, type: !864, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !866)
!864 = !DISubroutineType(types: !865)
!865 = !{!5, !834}
!866 = !{!867}
!867 = !DILocalVariable(name: "f", arg: 1, scope: !863, file: !1, line: 41, type: !834)
!868 = !DILocation(line: 0, scope: !863)
!869 = !DILocation(line: 43, column: 34, scope: !863)
!870 = !DILocation(line: 43, column: 48, scope: !863)
!871 = !DILocation(line: 43, column: 38, scope: !863)
!872 = !DILocation(line: 43, column: 10, scope: !863)
!873 = !DILocation(line: 43, column: 3, scope: !863)
!874 = distinct !DISubprogram(name: "fixed_from_string", scope: !1, file: !1, line: 88, type: !875, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !878)
!875 = !DISubroutineType(types: !876)
!876 = !{null, !877, !363, !3}
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!878 = !{!879, !880, !881, !882, !894, !895, !896, !897}
!879 = !DILocalVariable(name: "f", arg: 1, scope: !874, file: !1, line: 88, type: !877)
!880 = !DILocalVariable(name: "str", arg: 2, scope: !874, file: !1, line: 88, type: !363)
!881 = !DILocalVariable(name: "mode", arg: 3, scope: !874, file: !1, line: 88, type: !3)
!882 = !DILocalVariable(name: "real_value", scope: !874, file: !1, line: 90, type: !883)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !884, line: 52, size: 256, elements: !885)
!884 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!885 = !{!886, !887, !888, !889, !890, !891, !892}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !883, file: !884, line: 56, baseType: !5, size: 2, flags: DIFlagBitField, extraData: i64 0)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !883, file: !884, line: 57, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !883, file: !884, line: 58, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !883, file: !884, line: 59, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !883, file: !884, line: 60, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !883, file: !884, line: 61, baseType: !5, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !883, file: !884, line: 62, baseType: !893, size: 192, offset: 64)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !452, size: 192, elements: !719)
!894 = !DILocalVariable(name: "fixed_value", scope: !874, file: !1, line: 90, type: !883)
!895 = !DILocalVariable(name: "base_value", scope: !874, file: !1, line: 90, type: !883)
!896 = !DILocalVariable(name: "fbit", scope: !874, file: !1, line: 91, type: !5)
!897 = !DILocalVariable(name: "temp", scope: !874, file: !1, line: 92, type: !132)
!898 = !DILocation(line: 0, scope: !874)
!899 = !DILocation(line: 90, column: 3, scope: !874)
!900 = !DILocation(line: 94, column: 6, scope: !874)
!901 = !DILocation(line: 94, column: 11, scope: !874)
!902 = !DILocation(line: 95, column: 10, scope: !874)
!903 = !DILocation(line: 97, column: 3, scope: !874)
!904 = !DILocation(line: 98, column: 53, scope: !874)
!905 = !DILocation(line: 98, column: 10, scope: !874)
!906 = !DILocation(line: 101, column: 7, scope: !907)
!907 = distinct !DILexicalBlock(scope: !874, file: !1, line: 100, column: 7)
!908 = !DILocation(line: 102, column: 36, scope: !907)
!909 = !DILocation(line: 100, column: 7, scope: !874)
!910 = !DILocation(line: 103, column: 5, scope: !907)
!911 = !DILocation(line: 105, column: 3, scope: !874)
!912 = !DILocation(line: 106, column: 3, scope: !874)
!913 = !DILocation(line: 107, column: 47, scope: !874)
!914 = !DILocation(line: 107, column: 61, scope: !874)
!915 = !DILocation(line: 107, column: 3, scope: !874)
!916 = !DILocation(line: 110, column: 12, scope: !917)
!917 = distinct !DILexicalBlock(scope: !874, file: !1, line: 110, column: 7)
!918 = !DILocation(line: 110, column: 29, scope: !917)
!919 = !DILocation(line: 121, column: 10, scope: !917)
!920 = !DILocation(line: 0, scope: !917)
!921 = !DILocation(line: 110, column: 32, scope: !917)
!922 = !DILocation(line: 110, column: 7, scope: !874)
!923 = !DILocation(line: 113, column: 19, scope: !924)
!924 = distinct !DILexicalBlock(scope: !917, file: !1, line: 111, column: 5)
!925 = !DILocation(line: 114, column: 20, scope: !924)
!926 = !DILocation(line: 115, column: 17, scope: !924)
!927 = !DILocation(line: 116, column: 5, scope: !924)
!928 = !DILocation(line: 117, column: 7, scope: !924)
!929 = !DILocation(line: 117, column: 5, scope: !924)
!930 = !DILocation(line: 118, column: 5, scope: !924)
!931 = !DILocation(line: 120, column: 15, scope: !917)
!932 = !DILocation(line: 122, column: 12, scope: !917)
!933 = !DILocation(line: 122, column: 10, scope: !917)
!934 = !DILocation(line: 123, column: 12, scope: !917)
!935 = !DILocation(line: 123, column: 10, scope: !917)
!936 = !DILocation(line: 124, column: 10, scope: !917)
!937 = !DILocation(line: 125, column: 1, scope: !874)
!938 = distinct !DISubprogram(name: "check_real_for_fixed_mode", scope: !1, file: !1, line: 63, type: !939, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !942)
!939 = !DISubroutineType(types: !940)
!940 = !{!132, !941, !3}
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!942 = !{!943, !944, !945, !946, !947}
!943 = !DILocalVariable(name: "real_value", arg: 1, scope: !938, file: !1, line: 63, type: !941)
!944 = !DILocalVariable(name: "mode", arg: 2, scope: !938, file: !1, line: 63, type: !3)
!945 = !DILocalVariable(name: "max_value", scope: !938, file: !1, line: 65, type: !883)
!946 = !DILocalVariable(name: "min_value", scope: !938, file: !1, line: 65, type: !883)
!947 = !DILocalVariable(name: "epsilon_value", scope: !938, file: !1, line: 65, type: !883)
!948 = !DILocation(line: 0, scope: !938)
!949 = !DILocation(line: 65, column: 3, scope: !938)
!950 = !DILocation(line: 67, column: 27, scope: !938)
!951 = !DILocation(line: 67, column: 3, scope: !938)
!952 = !DILocation(line: 68, column: 32, scope: !938)
!953 = !DILocation(line: 68, column: 31, scope: !938)
!954 = !DILocation(line: 68, column: 3, scope: !938)
