; ModuleID = 'floatformat.bc'
source_filename = "floatformat.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.floatformat = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, {}*, %struct.floatformat* }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stdout = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@stdin = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [28 x i8] c"floatformat_ieee_single_big\00", align 1
@floatformat_ieee_single_big = dso_local local_unnamed_addr constant { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i32 (%struct.floatformat*, i8*)*, %struct.floatformat* } { i32 1, i32 32, i32 0, i32 1, i32 8, i32 127, i32 255, i32 9, i32 23, i32 1, i8* getelementptr inbounds ([28 x i8], [28 x i8]* @.str, i32 0, i32 0), i32 (%struct.floatformat*, i8*)* @floatformat_always_valid, %struct.floatformat* null }, align 8, !dbg !0
@.str.1 = private unnamed_addr constant [31 x i8] c"floatformat_ieee_single_little\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "floatformat_ieee_single_big", scope: !2, file: !3, line: 81, type: !27, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !17, globals: !24, nameTableKind: None)
!3 = !DIFile(filename: "floatformat.c", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!4 = !{!5, !13}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "floatformat_byteorders", file: !6, line: 34, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/floatformat.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "floatformat_little", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "floatformat_big", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "floatformat_littlebyte_bigword", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "floatformat_vax", value: 3, isUnsigned: true)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "floatformat_intbit", file: !6, line: 54, baseType: !7, size: 32, elements: !14)
!14 = !{!15, !16}
!15 = !DIEnumerator(name: "floatformat_intbit_yes", value: 0, isUnsigned: true)
!16 = !DIEnumerator(name: "floatformat_intbit_no", value: 1, isUnsigned: true)
!17 = !{!18, !19, !20, !22, !23, !7}
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!22 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!23 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!24 = !{!0, !25, !53, !55, !57, !59, !61, !63, !65, !67, !69, !71, !73, !75, !77, !79, !81, !83, !85, !87}
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "floatformat_ieee_single_little", scope: !2, file: !3, line: 89, type: !27, isLocal: false, isDefinition: true)
!27 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "floatformat", file: !6, line: 56, size: 512, elements: !29)
!29 = !{!30, !31, !32, !33, !34, !35, !37, !38, !39, !40, !41, !45, !52}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "byteorder", scope: !28, file: !6, line: 58, baseType: !5, size: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "totalsize", scope: !28, file: !6, line: 59, baseType: !7, size: 32, offset: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "sign_start", scope: !28, file: !6, line: 62, baseType: !7, size: 32, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "exp_start", scope: !28, file: !6, line: 64, baseType: !7, size: 32, offset: 96)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "exp_len", scope: !28, file: !6, line: 65, baseType: !7, size: 32, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "exp_bias", scope: !28, file: !6, line: 71, baseType: !36, size: 32, offset: 160)
!36 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "exp_nan", scope: !28, file: !6, line: 75, baseType: !7, size: 32, offset: 192)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "man_start", scope: !28, file: !6, line: 77, baseType: !7, size: 32, offset: 224)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "man_len", scope: !28, file: !6, line: 78, baseType: !7, size: 32, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "intbit", scope: !28, file: !6, line: 81, baseType: !13, size: 32, offset: 288)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !28, file: !6, line: 84, baseType: !42, size: 64, offset: 320)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!44 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "is_valid", scope: !28, file: !6, line: 87, baseType: !46, size: 64, offset: 384)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{!36, !49, !50}
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "split_half", scope: !28, file: !6, line: 94, baseType: !49, size: 64, offset: 448)
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(name: "floatformat_ieee_double_big", scope: !2, file: !3, line: 97, type: !27, isLocal: false, isDefinition: true)
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(name: "floatformat_ieee_double_little", scope: !2, file: !3, line: 105, type: !27, isLocal: false, isDefinition: true)
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(name: "floatformat_ieee_double_littlebyte_bigword", scope: !2, file: !3, line: 117, type: !27, isLocal: false, isDefinition: true)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "floatformat_vax_f", scope: !2, file: !3, line: 128, type: !27, isLocal: false, isDefinition: true)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "floatformat_vax_d", scope: !2, file: !3, line: 136, type: !27, isLocal: false, isDefinition: true)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "floatformat_vax_g", scope: !2, file: !3, line: 144, type: !27, isLocal: false, isDefinition: true)
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(name: "floatformat_i387_ext", scope: !2, file: !3, line: 177, type: !27, isLocal: false, isDefinition: true)
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression())
!68 = distinct !DIGlobalVariable(name: "floatformat_m68881_ext", scope: !2, file: !3, line: 185, type: !27, isLocal: false, isDefinition: true)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "floatformat_i960_ext", scope: !2, file: !3, line: 194, type: !27, isLocal: false, isDefinition: true)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "floatformat_m88110_ext", scope: !2, file: !3, line: 203, type: !27, isLocal: false, isDefinition: true)
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(name: "floatformat_m88110_harris_ext", scope: !2, file: !3, line: 211, type: !27, isLocal: false, isDefinition: true)
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(name: "floatformat_arm_ext_big", scope: !2, file: !3, line: 221, type: !27, isLocal: false, isDefinition: true)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "floatformat_arm_ext_littlebyte_bigword", scope: !2, file: !3, line: 230, type: !27, isLocal: false, isDefinition: true)
!79 = !DIGlobalVariableExpression(var: !80, expr: !DIExpression())
!80 = distinct !DIGlobalVariable(name: "floatformat_ia64_spill_big", scope: !2, file: !3, line: 239, type: !27, isLocal: false, isDefinition: true)
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(name: "floatformat_ia64_spill_little", scope: !2, file: !3, line: 247, type: !27, isLocal: false, isDefinition: true)
!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression())
!84 = distinct !DIGlobalVariable(name: "floatformat_ia64_quad_big", scope: !2, file: !3, line: 255, type: !27, isLocal: false, isDefinition: true)
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(name: "floatformat_ia64_quad_little", scope: !2, file: !3, line: 263, type: !27, isLocal: false, isDefinition: true)
!87 = !DIGlobalVariableExpression(var: !88, expr: !DIExpression())
!88 = distinct !DIGlobalVariable(name: "floatformat_ibm_long_double", scope: !2, file: !3, line: 358, type: !27, isLocal: false, isDefinition: true)
!89 = !{i32 2, !"Dwarf Version", i32 4}
!90 = !{i32 2, !"Debug Info Version", i32 3}
!91 = !{i32 1, !"wchar_size", i32 4}
!92 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!93 = distinct !DISubprogram(name: "vprintf", scope: !94, file: !94, line: 39, type: !95, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !106)
!94 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!95 = !DISubroutineType(types: !96)
!96 = !{!36, !97, !98}
!97 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !42)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, size: 192, elements: !100)
!100 = !{!101, !102, !103, !105}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !99, file: !3, baseType: !7, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !99, file: !3, baseType: !7, size: 32, offset: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !99, file: !3, baseType: !104, size: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !99, file: !3, baseType: !104, size: 64, offset: 128)
!106 = !{!107, !108}
!107 = !DILocalVariable(name: "__fmt", arg: 1, scope: !93, file: !94, line: 39, type: !97)
!108 = !DILocalVariable(name: "__arg", arg: 2, scope: !93, file: !94, line: 39, type: !98)
!109 = !DILocation(line: 0, scope: !93)
!110 = !DILocation(line: 41, column: 20, scope: !93)
!111 = !DILocation(line: 41, column: 10, scope: !93)
!112 = !DILocation(line: 41, column: 3, scope: !93)
!113 = distinct !DISubprogram(name: "getchar", scope: !94, file: !94, line: 47, type: !114, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !116)
!114 = !DISubroutineType(types: !115)
!115 = !{!36}
!116 = !{}
!117 = !DILocation(line: 49, column: 16, scope: !113)
!118 = !DILocation(line: 49, column: 10, scope: !113)
!119 = !DILocation(line: 49, column: 3, scope: !113)
!120 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !94, file: !94, line: 56, type: !121, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !182)
!121 = !DISubroutineType(types: !122)
!122 = !{!36, !123}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !125, line: 7, baseType: !126)
!125 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !127, line: 49, size: 1728, elements: !128)
!127 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!128 = !{!129, !130, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !145, !147, !148, !149, !153, !155, !157, !161, !164, !166, !169, !172, !173, !174, !177, !178}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !126, file: !127, line: 51, baseType: !36, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !126, file: !127, line: 54, baseType: !131, size: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !126, file: !127, line: 55, baseType: !131, size: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !126, file: !127, line: 56, baseType: !131, size: 64, offset: 192)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !126, file: !127, line: 57, baseType: !131, size: 64, offset: 256)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !126, file: !127, line: 58, baseType: !131, size: 64, offset: 320)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !126, file: !127, line: 59, baseType: !131, size: 64, offset: 384)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !126, file: !127, line: 60, baseType: !131, size: 64, offset: 448)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !126, file: !127, line: 61, baseType: !131, size: 64, offset: 512)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !126, file: !127, line: 64, baseType: !131, size: 64, offset: 576)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !126, file: !127, line: 65, baseType: !131, size: 64, offset: 640)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !126, file: !127, line: 66, baseType: !131, size: 64, offset: 704)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !126, file: !127, line: 68, baseType: !143, size: 64, offset: 768)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !127, line: 36, flags: DIFlagFwdDecl)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !126, file: !127, line: 70, baseType: !146, size: 64, offset: 832)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !126, file: !127, line: 72, baseType: !36, size: 32, offset: 896)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !126, file: !127, line: 73, baseType: !36, size: 32, offset: 928)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !126, file: !127, line: 74, baseType: !150, size: 64, offset: 960)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !151, line: 152, baseType: !152)
!151 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!152 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !126, file: !127, line: 77, baseType: !154, size: 16, offset: 1024)
!154 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !126, file: !127, line: 78, baseType: !156, size: 8, offset: 1040)
!156 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !126, file: !127, line: 79, baseType: !158, size: 8, offset: 1048)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 8, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 1)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !126, file: !127, line: 81, baseType: !162, size: 64, offset: 1088)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !127, line: 43, baseType: null)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !126, file: !127, line: 89, baseType: !165, size: 64, offset: 1152)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !151, line: 153, baseType: !152)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !126, file: !127, line: 91, baseType: !167, size: 64, offset: 1216)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !127, line: 37, flags: DIFlagFwdDecl)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !126, file: !127, line: 92, baseType: !170, size: 64, offset: 1280)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !127, line: 38, flags: DIFlagFwdDecl)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !126, file: !127, line: 93, baseType: !146, size: 64, offset: 1344)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !126, file: !127, line: 94, baseType: !104, size: 64, offset: 1408)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !126, file: !127, line: 95, baseType: !175, size: 64, offset: 1472)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !176, line: 46, baseType: !22)
!176 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !126, file: !127, line: 96, baseType: !36, size: 32, offset: 1536)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !126, file: !127, line: 98, baseType: !179, size: 160, offset: 1568)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 160, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 20)
!182 = !{!183}
!183 = !DILocalVariable(name: "__fp", arg: 1, scope: !120, file: !94, line: 56, type: !123)
!184 = !DILocation(line: 0, scope: !120)
!185 = !DILocation(line: 58, column: 10, scope: !120)
!186 = !DILocation(line: 58, column: 3, scope: !120)
!187 = distinct !DISubprogram(name: "getc_unlocked", scope: !94, file: !94, line: 66, type: !121, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !188)
!188 = !{!189}
!189 = !DILocalVariable(name: "__fp", arg: 1, scope: !187, file: !94, line: 66, type: !123)
!190 = !DILocation(line: 0, scope: !187)
!191 = !DILocation(line: 68, column: 10, scope: !187)
!192 = !DILocation(line: 68, column: 3, scope: !187)
!193 = distinct !DISubprogram(name: "getchar_unlocked", scope: !94, file: !94, line: 73, type: !114, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !116)
!194 = !DILocation(line: 75, column: 10, scope: !193)
!195 = !DILocation(line: 75, column: 3, scope: !193)
!196 = distinct !DISubprogram(name: "putchar", scope: !94, file: !94, line: 82, type: !197, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !199)
!197 = !DISubroutineType(types: !198)
!198 = !{!36, !36}
!199 = !{!200}
!200 = !DILocalVariable(name: "__c", arg: 1, scope: !196, file: !94, line: 82, type: !36)
!201 = !DILocation(line: 0, scope: !196)
!202 = !DILocation(line: 84, column: 21, scope: !196)
!203 = !DILocation(line: 84, column: 10, scope: !196)
!204 = !DILocation(line: 84, column: 3, scope: !196)
!205 = distinct !DISubprogram(name: "fputc_unlocked", scope: !94, file: !94, line: 91, type: !206, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !208)
!206 = !DISubroutineType(types: !207)
!207 = !{!36, !36, !123}
!208 = !{!209, !210}
!209 = !DILocalVariable(name: "__c", arg: 1, scope: !205, file: !94, line: 91, type: !36)
!210 = !DILocalVariable(name: "__stream", arg: 2, scope: !205, file: !94, line: 91, type: !123)
!211 = !DILocation(line: 0, scope: !205)
!212 = !DILocation(line: 93, column: 10, scope: !205)
!213 = !DILocation(line: 93, column: 3, scope: !205)
!214 = distinct !DISubprogram(name: "putc_unlocked", scope: !94, file: !94, line: 101, type: !206, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !215)
!215 = !{!216, !217}
!216 = !DILocalVariable(name: "__c", arg: 1, scope: !214, file: !94, line: 101, type: !36)
!217 = !DILocalVariable(name: "__stream", arg: 2, scope: !214, file: !94, line: 101, type: !123)
!218 = !DILocation(line: 0, scope: !214)
!219 = !DILocation(line: 103, column: 10, scope: !214)
!220 = !DILocation(line: 103, column: 3, scope: !214)
!221 = distinct !DISubprogram(name: "putchar_unlocked", scope: !94, file: !94, line: 108, type: !197, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !222)
!222 = !{!223}
!223 = !DILocalVariable(name: "__c", arg: 1, scope: !221, file: !94, line: 108, type: !36)
!224 = !DILocation(line: 0, scope: !221)
!225 = !DILocation(line: 110, column: 10, scope: !221)
!226 = !DILocation(line: 110, column: 3, scope: !221)
!227 = distinct !DISubprogram(name: "getline", scope: !94, file: !94, line: 118, type: !228, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !233)
!228 = !DISubroutineType(types: !229)
!229 = !{!230, !231, !232, !123}
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !151, line: 193, baseType: !152)
