; ModuleID = 'function.bc'
source_filename = "function.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type { %struct.eh_region_d*, %struct.VEC_eh_region_gc*, %struct.VEC_eh_landing_pad_gc*, %struct.htab*, %struct.VEC_tree_gc*, %union.eh_status_u }
%struct.eh_region_d = type { %struct.eh_region_d*, %struct.eh_region_d*, %struct.eh_region_d*, i32, i32, %union.eh_region_u, %struct.eh_landing_pad_d*, %struct.rtx_def*, %struct.rtx_def*, i8 }
%union.eh_region_u = type { %struct.eh_region_u_allowed }
%struct.eh_region_u_allowed = type { %union.tree_node*, %union.tree_node*, i32 }
%struct.eh_landing_pad_d = type { %struct.eh_landing_pad_d*, %struct.eh_region_d*, %union.tree_node*, %struct.rtx_def*, i32 }

!689 = !DIEnumerator(name: "TV_GCSE_AFTER_RELOAD", value: 152, isUnsigned: true)
!690 = !DIEnumerator(name: "TV_THREAD_PROLOGUE_AND_EPILOGUE", value: 153, isUnsigned: true)
!691 = !DIEnumerator(name: "TV_IFCVT2", value: 154, isUnsigned: true)
!692 = !DIEnumerator(name: "TV_COMBINE_STACK_ADJUST", value: 155, isUnsigned: true)
!693 = !DIEnumerator(name: "TV_PEEPHOLE2", value: 156, isUnsigned: true)
!694 = !DIEnumerator(name: "TV_RENAME_REGISTERS", value: 157, isUnsigned: true)
!695 = !DIEnumerator(name: "TV_CPROP_REGISTERS", value: 158, isUnsigned: true)
!696 = !DIEnumerator(name: "TV_SCHED2", value: 159, isUnsigned: true)
!697 = !DIEnumerator(name: "TV_MACH_DEP", value: 160, isUnsigned: true)
!698 = !DIEnumerator(name: "TV_DBR_SCHED", value: 161, isUnsigned: true)
!699 = !DIEnumerator(name: "TV_REORDER_BLOCKS", value: 162, isUnsigned: true)
!700 = !DIEnumerator(name: "TV_SHORTEN_BRANCH", value: 163, isUnsigned: true)
!701 = !DIEnumerator(name: "TV_REG_STACK", value: 164, isUnsigned: true)
!702 = !DIEnumerator(name: "TV_FINAL", value: 165, isUnsigned: true)
!703 = !DIEnumerator(name: "TV_SYMOUT", value: 166, isUnsigned: true)
!704 = !DIEnumerator(name: "TV_VAR_TRACKING", value: 167, isUnsigned: true)
!705 = !DIEnumerator(name: "TV_TREE_IFCOMBINE", value: 168, isUnsigned: true)
!706 = !DIEnumerator(name: "TV_PLUGIN_INIT", value: 169, isUnsigned: true)
!707 = !DIEnumerator(name: "TV_PLUGIN_RUN", value: 170, isUnsigned: true)
!708 = !DIEnumerator(name: "TV_REST_OF_COMPILATION", value: 171, isUnsigned: true)
!709 = !DIEnumerator(name: "TIMEVAR_LAST", value: 172, isUnsigned: true)
!710 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "direction", file: !711, line: 95, baseType: !7, size: 32, elements: !712)
!711 = !DIFile(filename: "./expr.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!712 = !{!713, !714, !715}
!713 = !DIEnumerator(name: "none", value: 0, isUnsigned: true)
!714 = !DIEnumerator(name: "upward", value: 1, isUnsigned: true)
!715 = !DIEnumerator(name: "downward", value: 2, isUnsigned: true)
!716 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mode_class", file: !717, line: 36, baseType: !7, size: 32, elements: !718)
!717 = !DIFile(filename: "./machmode.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!718 = !{!719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737}
!719 = !DIEnumerator(name: "MODE_RANDOM", value: 0, isUnsigned: true)
!720 = !DIEnumerator(name: "MODE_CC", value: 1, isUnsigned: true)
!721 = !DIEnumerator(name: "MODE_INT", value: 2, isUnsigned: true)
!722 = !DIEnumerator(name: "MODE_PARTIAL_INT", value: 3, isUnsigned: true)
!723 = !DIEnumerator(name: "MODE_FRACT", value: 4, isUnsigned: true)
!724 = !DIEnumerator(name: "MODE_UFRACT", value: 5, isUnsigned: true)
!725 = !DIEnumerator(name: "MODE_ACCUM", value: 6, isUnsigned: true)
!726 = !DIEnumerator(name: "MODE_UACCUM", value: 7, isUnsigned: true)
!727 = !DIEnumerator(name: "MODE_FLOAT", value: 8, isUnsigned: true)
!728 = !DIEnumerator(name: "MODE_DECIMAL_FLOAT", value: 9, isUnsigned: true)
!729 = !DIEnumerator(name: "MODE_COMPLEX_INT", value: 10, isUnsigned: true)
!730 = !DIEnumerator(name: "MODE_COMPLEX_FLOAT", value: 11, isUnsigned: true)
!731 = !DIEnumerator(name: "MODE_VECTOR_INT", value: 12, isUnsigned: true)
!732 = !DIEnumerator(name: "MODE_VECTOR_FRACT", value: 13, isUnsigned: true)
!733 = !DIEnumerator(name: "MODE_VECTOR_UFRACT", value: 14, isUnsigned: true)
!734 = !DIEnumerator(name: "MODE_VECTOR_ACCUM", value: 15, isUnsigned: true)
!735 = !DIEnumerator(name: "MODE_VECTOR_UACCUM", value: 16, isUnsigned: true)
!736 = !DIEnumerator(name: "MODE_VECTOR_FLOAT", value: 17, isUnsigned: true)
!737 = !DIEnumerator(name: "MAX_MODE_CLASS", value: 18, isUnsigned: true)
!738 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "expand_modifier", file: !711, line: 52, baseType: !7, size: 32, elements: !739)
!739 = !{!740, !741, !742, !743, !744, !745, !746}
!740 = !DIEnumerator(name: "EXPAND_NORMAL", value: 0, isUnsigned: true)
!741 = !DIEnumerator(name: "EXPAND_STACK_PARM", value: 1, isUnsigned: true)
!742 = !DIEnumerator(name: "EXPAND_SUM", value: 2, isUnsigned: true)
!743 = !DIEnumerator(name: "EXPAND_CONST_ADDRESS", value: 3, isUnsigned: true)
!744 = !DIEnumerator(name: "EXPAND_INITIALIZER", value: 4, isUnsigned: true)
!745 = !DIEnumerator(name: "EXPAND_WRITE", value: 5, isUnsigned: true)
!746 = !DIEnumerator(name: "EXPAND_MEMORY", value: 6, isUnsigned: true)
!747 = !{!748, !749, !750, !751, !754, !755, !757, !758, !7, !13, !759, !141, !880, !384, !1002, !1125, !765, !716, !2135, !2141, !2142, !1212, !1236, !2148, !2161, !2174, !2176, !2181, !1371}
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!750 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !753)
!757 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!758 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "temp_slot", file: !3, line: 456, size: 576, elements: !761)
!761 = !{!762, !763, !764, !2126, !2127, !2128, !2129, !2130, !2131, !2132, !2133, !2134}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !760, file: !3, line: 458, baseType: !759, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !760, file: !3, line: 460, baseType: !759, size: 64, offset: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !760, file: !3, line: 462, baseType: !765, size: 64, offset: 128)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !766, line: 50, baseType: !767)
!766 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !385, line: 240, size: 384, elements: !769)
!769 = !{!770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !768, file: !385, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !768, file: !385, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !768, file: !385, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !768, file: !385, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !768, file: !385, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !768, file: !385, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !768, file: !385, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !768, file: !385, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !768, file: !385, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !768, file: !385, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !768, file: !385, line: 321, baseType: !781, size: 320, offset: 64)
!781 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !385, line: 315, size: 320, elements: !782)
!782 = !{!783, !2061, !2063, !2124, !2125}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !781, file: !385, line: 316, baseType: !784, size: 64)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !785, size: 64, elements: !800)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !385, line: 183, baseType: !786)
!786 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !385, line: 166, size: 64, elements: !787)
!787 = !{!788, !789, !790, !791, !792, !802, !803, !815, !818, !879, !2039, !2040, !2051, !2058}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !786, file: !385, line: 168, baseType: !750, size: 32)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !786, file: !385, line: 169, baseType: !7, size: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !786, file: !385, line: 170, baseType: !755, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !786, file: !385, line: 171, baseType: !765, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !786, file: !385, line: 172, baseType: !793, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !766, line: 53, baseType: !794)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !385, line: 359, size: 128, elements: !796)
!796 = !{!797, !798}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !795, file: !385, line: 360, baseType: !750, size: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !795, file: !385, line: 361, baseType: !799, size: 64, offset: 64)
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !765, size: 64, elements: !800)
!800 = !{!801}
!801 = !DISubrange(count: 1)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !786, file: !385, line: 173, baseType: !13, size: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !786, file: !385, line: 174, baseType: !804, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !385, line: 133, baseType: !805)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !385, line: 115, size: 32, elements: !806)
!806 = !{!807, !808, !809, !810, !811, !812, !813, !814}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !805, file: !385, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !805, file: !385, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !805, file: !385, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !805, file: !385, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !805, file: !385, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !805, file: !385, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !805, file: !385, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !805, file: !385, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !786, file: !385, line: 175, baseType: !816, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !385, line: 175, flags: DIFlagFwdDecl)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !786, file: !385, line: 176, baseType: !819, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !821, line: 75, size: 256, elements: !822)
!821 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!822 = !{!823, !837, !838, !839}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !820, file: !821, line: 76, baseType: !824, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !821, line: 68, baseType: !826)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !821, line: 63, size: 320, elements: !827)
!827 = !{!828, !830, !831, !832}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !826, file: !821, line: 64, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !826, file: !821, line: 65, baseType: !829, size: 64, offset: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !826, file: !821, line: 66, baseType: !7, size: 32, offset: 128)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !826, file: !821, line: 67, baseType: !833, size: 128, offset: 192)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !834, size: 128, elements: !835)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !821, line: 29, baseType: !757)
!835 = !{!836}
!836 = !DISubrange(count: 2)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !820, file: !821, line: 77, baseType: !824, size: 64, offset: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !820, file: !821, line: 78, baseType: !7, size: 32, offset: 128)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !820, file: !821, line: 79, baseType: !840, size: 64, offset: 192)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !821, line: 49, baseType: !842)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !821, line: 45, size: 832, elements: !843)
!843 = !{!844, !845, !846}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !842, file: !821, line: 46, baseType: !829, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !842, file: !821, line: 47, baseType: !819, size: 64, offset: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !842, file: !821, line: 48, baseType: !847, size: 704, offset: 128)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !848, line: 164, size: 704, elements: !849)
!848 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!849 = !{!850, !852, !862, !863, !864, !865, !866, !867, !871, !875, !876, !877, !878}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !847, file: !848, line: 166, baseType: !851, size: 64)
!851 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !847, file: !848, line: 167, baseType: !853, size: 64, offset: 64)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !848, line: 157, size: 192, elements: !855)
!855 = !{!856, !857, !858}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !854, file: !848, line: 159, baseType: !752, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !854, file: !848, line: 160, baseType: !853, size: 64, offset: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !854, file: !848, line: 161, baseType: !859, size: 32, offset: 128)
!859 = !DICompositeType(tag: DW_TAG_array_type, baseType: !753, size: 32, elements: !860)
!860 = !{!861}
!861 = !DISubrange(count: 4)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !847, file: !848, line: 168, baseType: !752, size: 64, offset: 128)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !847, file: !848, line: 169, baseType: !752, size: 64, offset: 192)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !847, file: !848, line: 170, baseType: !752, size: 64, offset: 256)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !847, file: !848, line: 171, baseType: !851, size: 64, offset: 320)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !847, file: !848, line: 172, baseType: !750, size: 32, offset: 384)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !847, file: !848, line: 176, baseType: !868, size: 64, offset: 448)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DISubroutineType(types: !870)
!870 = !{!853, !754, !851}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !847, file: !848, line: 177, baseType: !872, size: 64, offset: 512)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DISubroutineType(types: !874)
!874 = !{null, !754, !853}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !847, file: !848, line: 178, baseType: !754, size: 64, offset: 576)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !847, file: !848, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !847, file: !848, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !847, file: !848, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !786, file: !385, line: 177, baseType: !880, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !766, line: 56, baseType: !881)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !142, line: 3371, size: 1792, elements: !883)
!883 = !{!884, !917, !923, !934, !953, !964, !969, !976, !982, !995, !1007, !1045, !1050, !1078, !1086, !1087, !1092, !1101, !1107, !1112, !1116, !1120, !1690, !1739, !1745, !1751, !1758, !1769, !1783, !1800, !1812, !1834, !1849, !2021}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !882, file: !142, line: 3372, baseType: !885, size: 64)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !142, line: 360, size: 64, elements: !886)
!886 = !{!887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !885, file: !142, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !885, file: !142, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !885, file: !142, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !885, file: !142, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !885, file: !142, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !885, file: !142, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !885, file: !142, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !885, file: !142, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !885, file: !142, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !885, file: !142, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !885, file: !142, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !885, file: !142, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !885, file: !142, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !885, file: !142, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !885, file: !142, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !885, file: !142, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !885, file: !142, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !885, file: !142, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !885, file: !142, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !885, file: !142, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !885, file: !142, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !885, file: !142, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !885, file: !142, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !885, file: !142, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !885, file: !142, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !885, file: !142, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !885, file: !142, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !885, file: !142, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !885, file: !142, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !885, file: !142, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !882, file: !142, line: 3373, baseType: !918, size: 192)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !142, line: 402, size: 192, elements: !919)
!919 = !{!920, !921, !922}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !918, file: !142, line: 403, baseType: !885, size: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !918, file: !142, line: 404, baseType: !880, size: 64, offset: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !918, file: !142, line: 405, baseType: !880, size: 64, offset: 128)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !882, file: !142, line: 3374, baseType: !924, size: 320)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !142, line: 1384, size: 320, elements: !925)
!925 = !{!926, !927}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !924, file: !142, line: 1385, baseType: !918, size: 192)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !924, file: !142, line: 1386, baseType: !928, size: 128, offset: 192)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !929, line: 58, baseType: !930)
!929 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !929, line: 54, size: 128, elements: !931)
!931 = !{!932, !933}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !930, file: !929, line: 56, baseType: !757, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !930, file: !929, line: 57, baseType: !851, size: 64, offset: 64)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !882, file: !142, line: 3375, baseType: !935, size: 256)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !142, line: 1397, size: 256, elements: !936)
!936 = !{!937, !938}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !935, file: !142, line: 1398, baseType: !918, size: 192)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !935, file: !142, line: 1399, baseType: !939, size: 64, offset: 192)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !941, line: 52, size: 256, elements: !942)
!941 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!942 = !{!943, !944, !945, !946, !947, !948, !949}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !940, file: !941, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !940, file: !941, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !940, file: !941, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !940, file: !941, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !940, file: !941, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !940, file: !941, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !940, file: !941, line: 62, baseType: !950, size: 192, offset: 64)
!950 = !DICompositeType(tag: DW_TAG_array_type, baseType: !757, size: 192, elements: !951)
!951 = !{!952}
!952 = !DISubrange(count: 3)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !882, file: !142, line: 3376, baseType: !954, size: 256)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !142, line: 1408, size: 256, elements: !955)
!955 = !{!956, !957}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !954, file: !142, line: 1409, baseType: !918, size: 192)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !954, file: !142, line: 1410, baseType: !958, size: 64, offset: 192)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !960, line: 27, size: 192, elements: !961)
!960 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!961 = !{!962, !963}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !959, file: !960, line: 29, baseType: !928, size: 128)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !959, file: !960, line: 30, baseType: !13, size: 32, offset: 128)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !882, file: !142, line: 3377, baseType: !965, size: 256)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !142, line: 1437, size: 256, elements: !966)
!966 = !{!967, !968}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !965, file: !142, line: 1438, baseType: !918, size: 192)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !965, file: !142, line: 1439, baseType: !880, size: 64, offset: 192)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !882, file: !142, line: 3378, baseType: !970, size: 256)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !142, line: 1418, size: 256, elements: !971)
!971 = !{!972, !973, !974}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !970, file: !142, line: 1419, baseType: !918, size: 192)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !970, file: !142, line: 1420, baseType: !750, size: 32, offset: 192)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !970, file: !142, line: 1421, baseType: !975, size: 8, offset: 224)
!975 = !DICompositeType(tag: DW_TAG_array_type, baseType: !753, size: 8, elements: !800)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !882, file: !142, line: 3379, baseType: !977, size: 320)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !142, line: 1428, size: 320, elements: !978)
!978 = !{!979, !980, !981}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !977, file: !142, line: 1429, baseType: !918, size: 192)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !977, file: !142, line: 1430, baseType: !880, size: 64, offset: 192)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !977, file: !142, line: 1431, baseType: !880, size: 64, offset: 256)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !882, file: !142, line: 3380, baseType: !983, size: 320)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !142, line: 1460, size: 320, elements: !984)
!984 = !{!985, !986}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !983, file: !142, line: 1461, baseType: !918, size: 192)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !983, file: !142, line: 1462, baseType: !987, size: 128, offset: 192)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !988, line: 31, size: 128, elements: !989)
!988 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!989 = !{!990, !993, !994}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !987, file: !988, line: 32, baseType: !991, size: 64)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !749)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !987, file: !988, line: 33, baseType: !7, size: 32, offset: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !987, file: !988, line: 34, baseType: !7, size: 32, offset: 96)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !882, file: !142, line: 3381, baseType: !996, size: 384)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !142, line: 2507, size: 384, elements: !997)
!997 = !{!998, !999, !1004, !1005, !1006}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !996, file: !142, line: 2508, baseType: !918, size: 192)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !996, file: !142, line: 2509, baseType: !1000, size: 32, offset: 192)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1001, line: 58, baseType: !1002)
!1001 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1003, line: 44, baseType: !7)
!1003 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !996, file: !142, line: 2510, baseType: !7, size: 32, offset: 224)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !996, file: !142, line: 2511, baseType: !880, size: 64, offset: 256)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !996, file: !142, line: 2512, baseType: !880, size: 64, offset: 320)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !882, file: !142, line: 3382, baseType: !1008, size: 896)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !142, line: 2652, size: 896, elements: !1009)
!1009 = !{!1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1008, file: !142, line: 2653, baseType: !996, size: 384)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1008, file: !142, line: 2654, baseType: !880, size: 64, offset: 384)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1008, file: !142, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1008, file: !142, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1008, file: !142, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1008, file: !142, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1008, file: !142, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1008, file: !142, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1008, file: !142, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1008, file: !142, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1008, file: !142, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1008, file: !142, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1008, file: !142, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1008, file: !142, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1008, file: !142, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1008, file: !142, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1008, file: !142, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1008, file: !142, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1008, file: !142, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1008, file: !142, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1008, file: !142, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1008, file: !142, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1008, file: !142, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1008, file: !142, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1008, file: !142, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1008, file: !142, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1008, file: !142, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1008, file: !142, line: 2703, baseType: !7, size: 32, offset: 512)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1008, file: !142, line: 2705, baseType: !880, size: 64, offset: 576)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1008, file: !142, line: 2706, baseType: !880, size: 64, offset: 640)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1008, file: !142, line: 2707, baseType: !880, size: 64, offset: 704)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1008, file: !142, line: 2708, baseType: !880, size: 64, offset: 768)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1008, file: !142, line: 2711, baseType: !1043, size: 64, offset: 832)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !142, line: 2711, flags: DIFlagFwdDecl)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !882, file: !142, line: 3383, baseType: !1046, size: 960)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !142, line: 2756, size: 960, elements: !1047)
!1047 = !{!1048, !1049}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1046, file: !142, line: 2757, baseType: !1008, size: 896)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1046, file: !142, line: 2758, baseType: !765, size: 64, offset: 896)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !882, file: !142, line: 3384, baseType: !1051, size: 1472)
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !142, line: 3114, size: 1472, elements: !1052)
!1052 = !{!1053, !1074, !1075, !1076, !1077}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1051, file: !142, line: 3115, baseType: !1054, size: 1216)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !142, line: 2984, size: 1216, elements: !1055)
!1055 = !{!1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1054, file: !142, line: 2985, baseType: !1046, size: 960)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1054, file: !142, line: 2986, baseType: !880, size: 64, offset: 960)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1054, file: !142, line: 2987, baseType: !880, size: 64, offset: 1024)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1054, file: !142, line: 2988, baseType: !880, size: 64, offset: 1088)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1054, file: !142, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1054, file: !142, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1054, file: !142, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1054, file: !142, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1054, file: !142, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1054, file: !142, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1054, file: !142, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1054, file: !142, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1054, file: !142, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1054, file: !142, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1054, file: !142, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1054, file: !142, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1054, file: !142, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1054, file: !142, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1051, file: !142, line: 3117, baseType: !880, size: 64, offset: 1216)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1051, file: !142, line: 3119, baseType: !880, size: 64, offset: 1280)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1051, file: !142, line: 3121, baseType: !880, size: 64, offset: 1344)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1051, file: !142, line: 3123, baseType: !880, size: 64, offset: 1408)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !882, file: !142, line: 3385, baseType: !1079, size: 1088)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !142, line: 2874, size: 1088, elements: !1080)
!1080 = !{!1081, !1082, !1083}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1079, file: !142, line: 2875, baseType: !1046, size: 960)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1079, file: !142, line: 2876, baseType: !765, size: 64, offset: 960)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1079, file: !142, line: 2877, baseType: !1084, size: 64, offset: 1024)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64)
!1085 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !142, line: 2856, flags: DIFlagFwdDecl)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !882, file: !142, line: 3386, baseType: !1054, size: 1216)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !882, file: !142, line: 3387, baseType: !1088, size: 1280)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !142, line: 3093, size: 1280, elements: !1089)
!1089 = !{!1090, !1091}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1088, file: !142, line: 3094, baseType: !1054, size: 1216)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1088, file: !142, line: 3095, baseType: !1084, size: 64, offset: 1216)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !882, file: !142, line: 3388, baseType: !1093, size: 1216)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !142, line: 2824, size: 1216, elements: !1094)
!1094 = !{!1095, !1096, !1097, !1098, !1099, !1100}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1093, file: !142, line: 2825, baseType: !1008, size: 896)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1093, file: !142, line: 2827, baseType: !880, size: 64, offset: 896)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1093, file: !142, line: 2828, baseType: !880, size: 64, offset: 960)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1093, file: !142, line: 2829, baseType: !880, size: 64, offset: 1024)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1093, file: !142, line: 2830, baseType: !880, size: 64, offset: 1088)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1093, file: !142, line: 2831, baseType: !880, size: 64, offset: 1152)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !882, file: !142, line: 3389, baseType: !1102, size: 1024)
!1102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !142, line: 2850, size: 1024, elements: !1103)
!1103 = !{!1104, !1105, !1106}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1102, file: !142, line: 2851, baseType: !1046, size: 960)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1102, file: !142, line: 2852, baseType: !750, size: 32, offset: 960)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1102, file: !142, line: 2853, baseType: !750, size: 32, offset: 992)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !882, file: !142, line: 3390, baseType: !1108, size: 1024)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !142, line: 2857, size: 1024, elements: !1109)
!1109 = !{!1110, !1111}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1108, file: !142, line: 2858, baseType: !1046, size: 960)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1108, file: !142, line: 2859, baseType: !1084, size: 64, offset: 960)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !882, file: !142, line: 3391, baseType: !1113, size: 960)
!1113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !142, line: 2862, size: 960, elements: !1114)
!1114 = !{!1115}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1113, file: !142, line: 2863, baseType: !1046, size: 960)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !882, file: !142, line: 3392, baseType: !1117, size: 1472)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !142, line: 3304, size: 1472, elements: !1118)
!1118 = !{!1119}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1117, file: !142, line: 3305, baseType: !1051, size: 1472)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !882, file: !142, line: 3393, baseType: !1121, size: 1792)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !142, line: 3248, size: 1792, elements: !1122)
!1122 = !{!1123, !1124, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1121, file: !142, line: 3249, baseType: !1051, size: 1472)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1121, file: !142, line: 3251, baseType: !1125, size: 64, offset: 1472)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1127, line: 463, size: 1152, elements: !1128)
!1127 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1128 = !{!1129, !1293, !1606, !1607, !1610, !1613, !1614, !1615, !1616, !1617, !1618, !1642, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1126, file: !1127, line: 464, baseType: !1130, size: 64)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !6, line: 194, size: 384, elements: !1132)
!1132 = !{!1133, !1182, !1195, !1209, !1261, !1274}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !1131, file: !6, line: 197, baseType: !1134, size: 64)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !6, line: 182, baseType: !1135)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !6, line: 116, size: 704, elements: !1137)
!1137 = !{!1138, !1139, !1140, !1141, !1142, !1143, !1170, !1179, !1180, !1181}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !1136, file: !6, line: 119, baseType: !1135, size: 64)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1136, file: !6, line: 122, baseType: !1135, size: 64, offset: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !1136, file: !6, line: 123, baseType: !1135, size: 64, offset: 128)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1136, file: !6, line: 126, baseType: !750, size: 32, offset: 192)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1136, file: !6, line: 129, baseType: !5, size: 32, offset: 224)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1136, file: !6, line: 165, baseType: !1144, size: 192, offset: 256)
!1144 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !6, line: 132, size: 192, elements: !1145)
!1145 = !{!1146, !1159, !1165}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !1144, file: !6, line: 137, baseType: !1147, size: 128)
!1147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !6, line: 133, size: 128, elements: !1148)
!1148 = !{!1149, !1158}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !1147, file: !6, line: 135, baseType: !1150, size: 64)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !6, line: 93, size: 320, elements: !1152)
!1152 = !{!1153, !1154, !1155, !1156, !1157}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !1151, file: !6, line: 96, baseType: !1150, size: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !1151, file: !6, line: 97, baseType: !1150, size: 64, offset: 64)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1151, file: !6, line: 101, baseType: !880, size: 64, offset: 128)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !1151, file: !6, line: 106, baseType: !880, size: 64, offset: 192)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1151, file: !6, line: 111, baseType: !880, size: 64, offset: 256)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !1147, file: !6, line: 136, baseType: !1150, size: 64, offset: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !1144, file: !6, line: 151, baseType: !1160, size: 192)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !6, line: 139, size: 192, elements: !1161)
!1161 = !{!1162, !1163, !1164}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1160, file: !6, line: 141, baseType: !880, size: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1160, file: !6, line: 145, baseType: !880, size: 64, offset: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1160, file: !6, line: 150, baseType: !750, size: 32, offset: 128)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !1144, file: !6, line: 164, baseType: !1166, size: 128)
!1166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !6, line: 153, size: 128, elements: !1167)
!1167 = !{!1168, !1169}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !1166, file: !6, line: 161, baseType: !880, size: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !1166, file: !6, line: 163, baseType: !1000, size: 32, offset: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !1136, file: !6, line: 168, baseType: !1171, size: 64, offset: 448)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !6, line: 67, size: 320, elements: !1173)
!1173 = !{!1174, !1175, !1176, !1177, !1178}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !1172, file: !6, line: 70, baseType: !1171, size: 64)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1172, file: !6, line: 73, baseType: !1135, size: 64, offset: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !1172, file: !6, line: 78, baseType: !880, size: 64, offset: 128)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !1172, file: !6, line: 85, baseType: !765, size: 64, offset: 192)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1172, file: !6, line: 88, baseType: !750, size: 32, offset: 256)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !1136, file: !6, line: 173, baseType: !765, size: 64, offset: 512)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !1136, file: !6, line: 173, baseType: !765, size: 64, offset: 576)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !1136, file: !6, line: 177, baseType: !749, size: 8, offset: 640)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !1131, file: !6, line: 200, baseType: !1183, size: 64, offset: 64)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64)
!1184 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !6, line: 185, baseType: !1185)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !6, line: 185, size: 128, elements: !1186)
!1186 = !{!1187}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1185, file: !6, line: 185, baseType: !1188, size: 128)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !6, line: 184, baseType: !1189)
!1189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !6, line: 184, size: 128, elements: !1190)
!1190 = !{!1191, !1192, !1193}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1189, file: !6, line: 184, baseType: !7, size: 32)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1189, file: !6, line: 184, baseType: !7, size: 32, offset: 32)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1189, file: !6, line: 184, baseType: !1194, size: 64, offset: 64)
!1194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1134, size: 64, elements: !800)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !1131, file: !6, line: 203, baseType: !1196, size: 64, offset: 128)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !6, line: 189, baseType: !1198)
!1198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !6, line: 189, size: 128, elements: !1199)
!1199 = !{!1200}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1198, file: !6, line: 189, baseType: !1201, size: 128)
!1201 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !6, line: 188, baseType: !1202)
!1202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !6, line: 188, size: 128, elements: !1203)
!1203 = !{!1204, !1205, !1206}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1202, file: !6, line: 188, baseType: !7, size: 32)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1202, file: !6, line: 188, baseType: !7, size: 32, offset: 32)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1202, file: !6, line: 188, baseType: !1207, size: 64, offset: 64)
!1207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1208, size: 64, elements: !800)
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !6, line: 180, baseType: !1171)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !1131, file: !6, line: 207, baseType: !1210, size: 64, offset: 192)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1211, line: 144, baseType: !1212)
!1211 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64)
!1213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1211, line: 100, size: 896, elements: !1214)
!1214 = !{!1215, !1223, !1228, !1233, !1235, !1238, !1239, !1240, !1241, !1242, !1247, !1249, !1250, !1255, !1260}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1213, file: !1211, line: 102, baseType: !1216, size: 64)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1211, line: 52, baseType: !1217)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64)
!1218 = !DISubroutineType(types: !1219)
!1219 = !{!1220, !1221}
!1220 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1211, line: 47, baseType: !7)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64)
!1222 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1213, file: !1211, line: 105, baseType: !1224, size: 64, offset: 64)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1211, line: 59, baseType: !1225)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64)
!1226 = !DISubroutineType(types: !1227)
!1227 = !{!750, !1221, !1221}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1213, file: !1211, line: 108, baseType: !1229, size: 64, offset: 128)
!1229 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1211, line: 63, baseType: !1230)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64)
!1231 = !DISubroutineType(types: !1232)
!1232 = !{null, !754}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1213, file: !1211, line: 111, baseType: !1234, size: 64, offset: 192)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1213, file: !1211, line: 114, baseType: !1236, size: 64, offset: 256)
!1236 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1237, line: 46, baseType: !757)
!1237 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1213, file: !1211, line: 117, baseType: !1236, size: 64, offset: 320)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1213, file: !1211, line: 120, baseType: !1236, size: 64, offset: 384)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1213, file: !1211, line: 124, baseType: !7, size: 32, offset: 448)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1213, file: !1211, line: 128, baseType: !7, size: 32, offset: 480)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1213, file: !1211, line: 131, baseType: !1243, size: 64, offset: 512)
!1243 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1211, line: 75, baseType: !1244)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64)
!1245 = !DISubroutineType(types: !1246)
!1246 = !{!754, !1236, !1236}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1213, file: !1211, line: 132, baseType: !1248, size: 64, offset: 576)
!1248 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1211, line: 78, baseType: !1230)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1213, file: !1211, line: 135, baseType: !754, size: 64, offset: 640)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1213, file: !1211, line: 136, baseType: !1251, size: 64, offset: 704)
!1251 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1211, line: 82, baseType: !1252)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64)
!1253 = !DISubroutineType(types: !1254)
!1254 = !{!754, !754, !1236, !1236}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1213, file: !1211, line: 137, baseType: !1256, size: 64, offset: 768)
!1256 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1211, line: 83, baseType: !1257)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64)
!1258 = !DISubroutineType(types: !1259)
!1259 = !{null, !754, !754}
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1213, file: !1211, line: 141, baseType: !7, size: 32, offset: 832)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !1131, file: !6, line: 211, baseType: !1262, size: 64, offset: 256)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64)
!1263 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !142, line: 183, baseType: !1264)
!1264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !142, line: 183, size: 128, elements: !1265)
!1265 = !{!1266}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1264, file: !142, line: 183, baseType: !1267, size: 128)
!1267 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !142, line: 182, baseType: !1268)
!1268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !142, line: 182, size: 128, elements: !1269)
!1269 = !{!1270, !1271, !1272}
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1268, file: !142, line: 182, baseType: !7, size: 32)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1268, file: !142, line: 182, baseType: !7, size: 32, offset: 32)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1268, file: !142, line: 182, baseType: !1273, size: 64, offset: 64)
!1273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !880, size: 64, elements: !800)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !1131, file: !6, line: 220, baseType: !1275, size: 64, offset: 320)
!1275 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !6, line: 217, size: 64, elements: !1276)
!1276 = !{!1277, !1278}
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !1275, file: !6, line: 218, baseType: !1262, size: 64)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !1275, file: !6, line: 219, baseType: !1279, size: 64)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64)
!1280 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !1281, line: 29, baseType: !1282)
!1281 = !DIFile(filename: "./vecprim.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !1281, line: 29, size: 96, elements: !1283)
!1283 = !{!1284}
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1282, file: !1281, line: 29, baseType: !1285, size: 96)
!1285 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !1281, line: 27, baseType: !1286)
!1286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !1281, line: 27, size: 96, elements: !1287)
!1287 = !{!1288, !1289, !1290}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1286, file: !1281, line: 27, baseType: !7, size: 32)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1286, file: !1281, line: 27, baseType: !7, size: 32, offset: 32)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1286, file: !1281, line: 27, baseType: !1291, size: 8, offset: 64)
!1291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1292, size: 8, elements: !800)
!1292 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !1281, line: 26, baseType: !749)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1126, file: !1127, line: 467, baseType: !1294, size: 64, offset: 64)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64)
!1295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !369, line: 374, size: 640, elements: !1296)
!1296 = !{!1297, !1581, !1582, !1595, !1596, !1597, !1598, !1599, !1600, !1602, !1604, !1605}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1295, file: !369, line: 377, baseType: !1298, size: 64)
!1298 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !766, line: 111, baseType: !1299)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64)
!1300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !369, line: 217, size: 832, elements: !1301)
!1301 = !{!1302, !1546, !1547, !1548, !1551, !1555, !1556, !1557, !1575, !1576, !1577, !1578, !1579, !1580}
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1300, file: !369, line: 219, baseType: !1303, size: 64)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64)
!1304 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !369, line: 151, baseType: !1305)
!1305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !369, line: 151, size: 128, elements: !1306)
!1306 = !{!1307}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1305, file: !369, line: 151, baseType: !1308, size: 128)
!1308 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !369, line: 150, baseType: !1309)
!1309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !369, line: 150, size: 128, elements: !1310)
!1310 = !{!1311, !1312, !1313}
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1309, file: !369, line: 150, baseType: !7, size: 32)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1309, file: !369, line: 150, baseType: !7, size: 32, offset: 32)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1309, file: !369, line: 150, baseType: !1314, size: 64, offset: 64)
!1314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1315, size: 64, elements: !800)
!1315 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !766, line: 108, baseType: !1316)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64)
!1317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !369, line: 122, size: 512, elements: !1318)
!1318 = !{!1319, !1320, !1321, !1538, !1539, !1540, !1541, !1542, !1543, !1544}
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1317, file: !369, line: 124, baseType: !1299, size: 64)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1317, file: !369, line: 125, baseType: !1299, size: 64, offset: 64)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1317, file: !369, line: 131, baseType: !1322, size: 64, offset: 128)
!1322 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !369, line: 128, size: 64, elements: !1323)
!1323 = !{!1324, !1537}
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1322, file: !369, line: 129, baseType: !1325, size: 64)
!1325 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !766, line: 66, baseType: !1326)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64)
!1327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !1328, line: 143, size: 192, elements: !1329)
!1328 = !DIFile(filename: "./gimple.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1329 = !{!1330, !1535, !1536}
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1327, file: !1328, line: 145, baseType: !1331, size: 64)
!1331 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !766, line: 69, baseType: !1332)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64)
!1333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !1328, line: 136, size: 192, elements: !1334)
!1334 = !{!1335, !1533, !1534}
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1333, file: !1328, line: 137, baseType: !1336, size: 64)
!1336 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !766, line: 58, baseType: !1337)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64)
!1338 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !1328, line: 737, size: 768, elements: !1339)
!1339 = !{!1340, !1357, !1390, !1396, !1401, !1406, !1413, !1419, !1425, !1430, !1444, !1449, !1455, !1460, !1470, !1475, !1491, !1498, !1505, !1511, !1516, !1522, !1528}
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1338, file: !1328, line: 738, baseType: !1341, size: 256)
!1341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !1328, line: 271, size: 256, elements: !1342)
!1342 = !{!1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1341, file: !1328, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !1341, file: !1328, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1341, file: !1328, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !1341, file: !1328, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !1341, file: !1328, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !1341, file: !1328, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !1341, file: !1328, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1341, file: !1328, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !1341, file: !1328, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1341, file: !1328, line: 312, baseType: !7, size: 32, offset: 32)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !1341, file: !1328, line: 316, baseType: !1000, size: 32, offset: 64)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !1341, file: !1328, line: 319, baseType: !7, size: 32, offset: 96)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1341, file: !1328, line: 323, baseType: !1299, size: 64, offset: 128)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1341, file: !1328, line: 327, baseType: !880, size: 64, offset: 192)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !1338, file: !1328, line: 739, baseType: !1358, size: 448)
!1358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !1328, line: 350, size: 448, elements: !1359)
!1359 = !{!1360, !1389}
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1358, file: !1328, line: 353, baseType: !1361, size: 384)
!1361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !1328, line: 333, size: 384, elements: !1362)
!1362 = !{!1363, !1364, !1372}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1361, file: !1328, line: 336, baseType: !1341, size: 256)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !1361, file: !1328, line: 343, baseType: !1365, size: 64, offset: 256)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64)
!1366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1367, line: 37, size: 128, elements: !1368)
!1367 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1368 = !{!1369, !1370}
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1366, file: !1367, line: 39, baseType: !1365, size: 64)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1366, file: !1367, line: 40, baseType: !1371, size: 64, offset: 64)
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !1361, file: !1328, line: 344, baseType: !1373, size: 64, offset: 320)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64)
!1374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1367, line: 45, size: 320, elements: !1375)
!1375 = !{!1376, !1377}
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1374, file: !1367, line: 47, baseType: !1373, size: 64)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1374, file: !1367, line: 48, baseType: !1378, size: 256, offset: 64)
!1378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !142, line: 1883, size: 256, elements: !1379)
!1379 = !{!1380, !1382, !1383, !1388}
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1378, file: !142, line: 1884, baseType: !1381, size: 64)
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1378, size: 64)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1378, file: !142, line: 1885, baseType: !1381, size: 64, offset: 64)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1378, file: !142, line: 1891, baseType: !1384, size: 64, offset: 128)
!1384 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1378, file: !142, line: 1891, size: 64, elements: !1385)
!1385 = !{!1386, !1387}
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1384, file: !142, line: 1891, baseType: !1336, size: 64)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1384, file: !142, line: 1891, baseType: !880, size: 64)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1378, file: !142, line: 1892, baseType: !1371, size: 64, offset: 192)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1358, file: !1328, line: 359, baseType: !1273, size: 64, offset: 384)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !1338, file: !1328, line: 740, baseType: !1391, size: 512)
!1391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !1328, line: 365, size: 512, elements: !1392)
!1392 = !{!1393, !1394, !1395}
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1391, file: !1328, line: 368, baseType: !1361, size: 384)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1391, file: !1328, line: 373, baseType: !880, size: 64, offset: 384)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1391, file: !1328, line: 374, baseType: !880, size: 64, offset: 448)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !1338, file: !1328, line: 741, baseType: !1397, size: 576)
!1397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !1328, line: 380, size: 576, elements: !1398)
!1398 = !{!1399, !1400}
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1397, file: !1328, line: 383, baseType: !1391, size: 512)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1397, file: !1328, line: 389, baseType: !1273, size: 64, offset: 512)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1338, file: !1328, line: 742, baseType: !1402, size: 320)
!1402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !1328, line: 395, size: 320, elements: !1403)
!1403 = !{!1404, !1405}
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1402, file: !1328, line: 397, baseType: !1341, size: 256)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1402, file: !1328, line: 400, baseType: !1325, size: 64, offset: 256)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !1338, file: !1328, line: 743, baseType: !1407, size: 448)
!1407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !1328, line: 406, size: 448, elements: !1408)
!1408 = !{!1409, !1410, !1411, !1412}
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1407, file: !1328, line: 408, baseType: !1341, size: 256)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1407, file: !1328, line: 412, baseType: !880, size: 64, offset: 256)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1407, file: !1328, line: 420, baseType: !880, size: 64, offset: 320)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1407, file: !1328, line: 423, baseType: !1325, size: 64, offset: 384)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !1338, file: !1328, line: 744, baseType: !1414, size: 384)
!1414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !1328, line: 429, size: 384, elements: !1415)
!1415 = !{!1416, !1417, !1418}
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1414, file: !1328, line: 431, baseType: !1341, size: 256)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1414, file: !1328, line: 434, baseType: !880, size: 64, offset: 256)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1414, file: !1328, line: 437, baseType: !1325, size: 64, offset: 320)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !1338, file: !1328, line: 745, baseType: !1420, size: 384)
!1420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !1328, line: 443, size: 384, elements: !1421)
!1421 = !{!1422, !1423, !1424}
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1420, file: !1328, line: 445, baseType: !1341, size: 256)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1420, file: !1328, line: 449, baseType: !880, size: 64, offset: 256)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1420, file: !1328, line: 453, baseType: !1325, size: 64, offset: 320)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !1338, file: !1328, line: 746, baseType: !1426, size: 320)
!1426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !1328, line: 459, size: 320, elements: !1427)
!1427 = !{!1428, !1429}
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1426, file: !1328, line: 461, baseType: !1341, size: 256)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1426, file: !1328, line: 464, baseType: !880, size: 64, offset: 256)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !1338, file: !1328, line: 747, baseType: !1431, size: 768)
!1431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !1328, line: 469, size: 768, elements: !1432)
!1432 = !{!1433, !1434, !1435, !1436, !1437}
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1431, file: !1328, line: 471, baseType: !1341, size: 256)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1431, file: !1328, line: 474, baseType: !7, size: 32, offset: 256)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1431, file: !1328, line: 475, baseType: !7, size: 32, offset: 288)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1431, file: !1328, line: 478, baseType: !880, size: 64, offset: 320)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1431, file: !1328, line: 481, baseType: !1438, size: 384, offset: 384)
!1438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1439, size: 384, elements: !800)
!1439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !142, line: 1917, size: 384, elements: !1440)
!1440 = !{!1441, !1442, !1443}
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1439, file: !142, line: 1920, baseType: !1378, size: 256)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1439, file: !142, line: 1921, baseType: !880, size: 64, offset: 256)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1439, file: !142, line: 1922, baseType: !1000, size: 32, offset: 320)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !1338, file: !1328, line: 748, baseType: !1445, size: 320)
!1445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !1328, line: 487, size: 320, elements: !1446)
!1446 = !{!1447, !1448}
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1445, file: !1328, line: 490, baseType: !1341, size: 256)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1445, file: !1328, line: 494, baseType: !750, size: 32, offset: 256)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !1338, file: !1328, line: 749, baseType: !1450, size: 384)
!1450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !1328, line: 500, size: 384, elements: !1451)
!1451 = !{!1452, !1453, !1454}
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1450, file: !1328, line: 502, baseType: !1341, size: 256)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1450, file: !1328, line: 506, baseType: !1325, size: 64, offset: 256)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1450, file: !1328, line: 510, baseType: !1325, size: 64, offset: 320)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !1338, file: !1328, line: 750, baseType: !1456, size: 320)
!1456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !1328, line: 529, size: 320, elements: !1457)
!1457 = !{!1458, !1459}
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1456, file: !1328, line: 531, baseType: !1341, size: 256)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1456, file: !1328, line: 540, baseType: !1325, size: 64, offset: 256)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !1338, file: !1328, line: 751, baseType: !1461, size: 704)
!1461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !1328, line: 546, size: 704, elements: !1462)
!1462 = !{!1463, !1464, !1465, !1466, !1467, !1468, !1469}
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1461, file: !1328, line: 549, baseType: !1391, size: 512)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1461, file: !1328, line: 553, baseType: !755, size: 64, offset: 512)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1461, file: !1328, line: 557, baseType: !749, size: 8, offset: 576)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1461, file: !1328, line: 558, baseType: !749, size: 8, offset: 584)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1461, file: !1328, line: 559, baseType: !749, size: 8, offset: 592)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1461, file: !1328, line: 560, baseType: !749, size: 8, offset: 600)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1461, file: !1328, line: 566, baseType: !1273, size: 64, offset: 640)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !1338, file: !1328, line: 752, baseType: !1471, size: 384)
!1471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !1328, line: 571, size: 384, elements: !1472)
!1472 = !{!1473, !1474}
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1471, file: !1328, line: 573, baseType: !1402, size: 320)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1471, file: !1328, line: 577, baseType: !880, size: 64, offset: 320)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !1338, file: !1328, line: 753, baseType: !1476, size: 576)
!1476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !1328, line: 600, size: 576, elements: !1477)
!1477 = !{!1478, !1479, !1480, !1481, !1490}
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1476, file: !1328, line: 602, baseType: !1402, size: 320)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1476, file: !1328, line: 605, baseType: !880, size: 64, offset: 320)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1476, file: !1328, line: 609, baseType: !1236, size: 64, offset: 384)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1476, file: !1328, line: 612, baseType: !1482, size: 64, offset: 448)
!1482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1483, size: 64)
!1483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !1328, line: 581, size: 320, elements: !1484)
!1484 = !{!1485, !1486, !1487, !1488, !1489}
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1483, file: !1328, line: 583, baseType: !141, size: 32)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1483, file: !1328, line: 586, baseType: !880, size: 64, offset: 64)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1483, file: !1328, line: 589, baseType: !880, size: 64, offset: 128)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1483, file: !1328, line: 592, baseType: !880, size: 64, offset: 192)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1483, file: !1328, line: 595, baseType: !880, size: 64, offset: 256)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1476, file: !1328, line: 616, baseType: !1325, size: 64, offset: 512)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !1338, file: !1328, line: 754, baseType: !1492, size: 512)
!1492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !1328, line: 622, size: 512, elements: !1493)
!1493 = !{!1494, !1495, !1496, !1497}
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1492, file: !1328, line: 624, baseType: !1402, size: 320)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1492, file: !1328, line: 628, baseType: !880, size: 64, offset: 320)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1492, file: !1328, line: 632, baseType: !880, size: 64, offset: 384)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1492, file: !1328, line: 636, baseType: !880, size: 64, offset: 448)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !1338, file: !1328, line: 755, baseType: !1499, size: 704)
!1499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !1328, line: 642, size: 704, elements: !1500)
!1500 = !{!1501, !1502, !1503, !1504}
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1499, file: !1328, line: 644, baseType: !1492, size: 512)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1499, file: !1328, line: 648, baseType: !880, size: 64, offset: 512)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1499, file: !1328, line: 652, baseType: !880, size: 64, offset: 576)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1499, file: !1328, line: 653, baseType: !880, size: 64, offset: 640)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !1338, file: !1328, line: 756, baseType: !1506, size: 448)
!1506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !1328, line: 663, size: 448, elements: !1507)
!1507 = !{!1508, !1509, !1510}
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1506, file: !1328, line: 665, baseType: !1402, size: 320)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1506, file: !1328, line: 668, baseType: !880, size: 64, offset: 320)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1506, file: !1328, line: 673, baseType: !880, size: 64, offset: 384)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !1338, file: !1328, line: 757, baseType: !1512, size: 384)
!1512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !1328, line: 694, size: 384, elements: !1513)
!1513 = !{!1514, !1515}
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1512, file: !1328, line: 696, baseType: !1402, size: 320)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1512, file: !1328, line: 699, baseType: !880, size: 64, offset: 320)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !1338, file: !1328, line: 758, baseType: !1517, size: 384)
!1517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !1328, line: 681, size: 384, elements: !1518)
!1518 = !{!1519, !1520, !1521}
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1517, file: !1328, line: 683, baseType: !1341, size: 256)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1517, file: !1328, line: 686, baseType: !880, size: 64, offset: 256)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1517, file: !1328, line: 689, baseType: !880, size: 64, offset: 320)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !1338, file: !1328, line: 759, baseType: !1523, size: 384)
!1523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !1328, line: 707, size: 384, elements: !1524)
!1524 = !{!1525, !1526, !1527}
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1523, file: !1328, line: 709, baseType: !1341, size: 256)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1523, file: !1328, line: 712, baseType: !880, size: 64, offset: 256)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1523, file: !1328, line: 712, baseType: !880, size: 64, offset: 320)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !1338, file: !1328, line: 760, baseType: !1529, size: 320)
!1529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !1328, line: 718, size: 320, elements: !1530)
!1530 = !{!1531, !1532}
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1529, file: !1328, line: 720, baseType: !1341, size: 256)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1529, file: !1328, line: 723, baseType: !880, size: 64, offset: 256)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1333, file: !1328, line: 138, baseType: !1332, size: 64, offset: 64)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1333, file: !1328, line: 139, baseType: !1332, size: 64, offset: 128)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1327, file: !1328, line: 146, baseType: !1331, size: 64, offset: 64)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1327, file: !1328, line: 152, baseType: !1325, size: 64, offset: 128)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1322, file: !369, line: 130, baseType: !765, size: 64)
