; ModuleID = 'fwprop.bc'
source_filename = "fwprop.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.rtl_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.df = type { [8 x %struct.dataflow*], [8 x %struct.dataflow*], %struct.bitmap_head_def*, %struct.df_ref_info, %struct.df_ref_info, %struct.df_reg_info**, %struct.df_reg_info**, %struct.df_reg_info**, i32, i32, %struct.df_insn_info**, i32, i32, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, i32*, i32*, i32, i32, i32*, i32, i8, i8, i8 }
%struct.dataflow = type { %struct.df_problem*, i8**, i32, %struct.alloc_pool_def*, %struct.bitmap_head_def*, i8*, i32, i8, i8, i8 }

!668 = !DIEnumerator(name: "UNEQ", value: 92, isUnsigned: true)
!669 = !DIEnumerator(name: "UNGE", value: 93, isUnsigned: true)
!670 = !DIEnumerator(name: "UNGT", value: 94, isUnsigned: true)
!671 = !DIEnumerator(name: "UNLE", value: 95, isUnsigned: true)
!672 = !DIEnumerator(name: "UNLT", value: 96, isUnsigned: true)
!673 = !DIEnumerator(name: "LTGT", value: 97, isUnsigned: true)
!674 = !DIEnumerator(name: "SIGN_EXTEND", value: 98, isUnsigned: true)
!675 = !DIEnumerator(name: "ZERO_EXTEND", value: 99, isUnsigned: true)
!676 = !DIEnumerator(name: "TRUNCATE", value: 100, isUnsigned: true)
!677 = !DIEnumerator(name: "FLOAT_EXTEND", value: 101, isUnsigned: true)
!678 = !DIEnumerator(name: "FLOAT_TRUNCATE", value: 102, isUnsigned: true)
!679 = !DIEnumerator(name: "FLOAT", value: 103, isUnsigned: true)
!680 = !DIEnumerator(name: "FIX", value: 104, isUnsigned: true)
!681 = !DIEnumerator(name: "UNSIGNED_FLOAT", value: 105, isUnsigned: true)
!682 = !DIEnumerator(name: "UNSIGNED_FIX", value: 106, isUnsigned: true)
!683 = !DIEnumerator(name: "FRACT_CONVERT", value: 107, isUnsigned: true)
!684 = !DIEnumerator(name: "UNSIGNED_FRACT_CONVERT", value: 108, isUnsigned: true)
!685 = !DIEnumerator(name: "SAT_FRACT", value: 109, isUnsigned: true)
!686 = !DIEnumerator(name: "UNSIGNED_SAT_FRACT", value: 110, isUnsigned: true)
!687 = !DIEnumerator(name: "ABS", value: 111, isUnsigned: true)
!688 = !DIEnumerator(name: "SQRT", value: 112, isUnsigned: true)
!689 = !DIEnumerator(name: "BSWAP", value: 113, isUnsigned: true)
!690 = !DIEnumerator(name: "FFS", value: 114, isUnsigned: true)
!691 = !DIEnumerator(name: "CLZ", value: 115, isUnsigned: true)
!692 = !DIEnumerator(name: "CTZ", value: 116, isUnsigned: true)
!693 = !DIEnumerator(name: "POPCOUNT", value: 117, isUnsigned: true)
!694 = !DIEnumerator(name: "PARITY", value: 118, isUnsigned: true)
!695 = !DIEnumerator(name: "SIGN_EXTRACT", value: 119, isUnsigned: true)
!696 = !DIEnumerator(name: "ZERO_EXTRACT", value: 120, isUnsigned: true)
!697 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!698 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!699 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!700 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!701 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!702 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!703 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!704 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!705 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!706 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!707 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!708 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!709 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!710 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!711 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!712 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!713 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!714 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!715 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!716 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "df_ref_type", file: !717, line: 81, baseType: !7, size: 32, elements: !718)
!717 = !DIFile(filename: "./df.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!718 = !{!719, !720, !721, !722}
!719 = !DIEnumerator(name: "DF_REF_REG_DEF", value: 0, isUnsigned: true)
!720 = !DIEnumerator(name: "DF_REF_REG_USE", value: 1, isUnsigned: true)
!721 = !DIEnumerator(name: "DF_REF_REG_MEM_LOAD", value: 2, isUnsigned: true)
!722 = !DIEnumerator(name: "DF_REF_REG_MEM_STORE", value: 3, isUnsigned: true)
!723 = !{!724, !725, !726, !727, !730, !731, !733, !796, !7, !573, !1935, !1943, !1950, !819, !189, !1955, !768, !1956}
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!726 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !729)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !734, line: 47, baseType: !735)
!734 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !737, line: 75, size: 256, elements: !738)
!737 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!738 = !{!739, !754, !755, !756}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !736, file: !737, line: 76, baseType: !740, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !737, line: 68, baseType: !742)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !737, line: 63, size: 320, elements: !743)
!743 = !{!744, !746, !747, !748}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !742, file: !737, line: 64, baseType: !745, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !742, file: !737, line: 65, baseType: !745, size: 64, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !742, file: !737, line: 66, baseType: !7, size: 32, offset: 128)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !742, file: !737, line: 67, baseType: !749, size: 128, offset: 192)
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !750, size: 128, elements: !752)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !737, line: 29, baseType: !751)
!751 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!752 = !{!753}
!753 = !DISubrange(count: 2)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !736, file: !737, line: 77, baseType: !740, size: 64, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !736, file: !737, line: 78, baseType: !7, size: 32, offset: 128)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !736, file: !737, line: 79, baseType: !757, size: 64, offset: 192)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !737, line: 49, baseType: !759)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !737, line: 45, size: 832, elements: !760)
!760 = !{!761, !762, !763}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !759, file: !737, line: 46, baseType: !745, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !759, file: !737, line: 47, baseType: !735, size: 64, offset: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !759, file: !737, line: 48, baseType: !764, size: 704, offset: 128)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !765, line: 164, size: 704, elements: !766)
!765 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!766 = !{!767, !769, !779, !780, !781, !782, !783, !784, !788, !792, !793, !794, !795}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !764, file: !765, line: 166, baseType: !768, size: 64)
!768 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !764, file: !765, line: 167, baseType: !770, size: 64, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !765, line: 157, size: 192, elements: !772)
!772 = !{!773, !774, !775}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !771, file: !765, line: 159, baseType: !728, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !771, file: !765, line: 160, baseType: !770, size: 64, offset: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !771, file: !765, line: 161, baseType: !776, size: 32, offset: 128)
!776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !729, size: 32, elements: !777)
!777 = !{!778}
!778 = !DISubrange(count: 4)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !764, file: !765, line: 168, baseType: !728, size: 64, offset: 128)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !764, file: !765, line: 169, baseType: !728, size: 64, offset: 192)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !764, file: !765, line: 170, baseType: !728, size: 64, offset: 256)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !764, file: !765, line: 171, baseType: !768, size: 64, offset: 320)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !764, file: !765, line: 172, baseType: !726, size: 32, offset: 384)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !764, file: !765, line: 176, baseType: !785, size: 64, offset: 448)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DISubroutineType(types: !787)
!787 = !{!770, !730, !768}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !764, file: !765, line: 177, baseType: !789, size: 64, offset: 512)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DISubroutineType(types: !791)
!791 = !{null, !730, !770}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !764, file: !765, line: 178, baseType: !730, size: 64, offset: 576)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !764, file: !765, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !764, file: !765, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !764, file: !765, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_df_ref_heap", file: !3, line: 121, baseType: !798)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_df_ref_heap", file: !3, line: 121, size: 128, elements: !799)
!799 = !{!800}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !798, file: !3, line: 121, baseType: !801, size: 128)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_df_ref_base", file: !3, line: 120, baseType: !802)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_df_ref_base", file: !3, line: 120, size: 128, elements: !803)
!803 = !{!804, !805, !806}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !802, file: !3, line: 120, baseType: !7, size: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !802, file: !3, line: 120, baseType: !7, size: 32, offset: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !802, file: !3, line: 120, baseType: !807, size: 64, offset: 64)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !808, size: 64, elements: !853)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "df_ref", file: !717, line: 429, baseType: !809)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "df_ref_d", file: !717, line: 422, size: 704, elements: !811)
!811 = !{!812, !1917, !1923, !1928}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !810, file: !717, line: 424, baseType: !813, size: 512)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "df_base_ref", file: !717, line: 356, size: 512, elements: !814)
!814 = !{!815, !816, !817, !818, !1885, !1891, !1912, !1913, !1914, !1915, !1916}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !813, file: !717, line: 360, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !813, file: !717, line: 362, baseType: !7, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !813, file: !717, line: 364, baseType: !726, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !813, file: !717, line: 365, baseType: !819, size: 64, offset: 64)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !734, line: 50, baseType: !820)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !574, line: 240, size: 384, elements: !822)
!822 = !{!823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !821, file: !574, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !821, file: !574, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !821, file: !574, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !821, file: !574, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !821, file: !574, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !821, file: !574, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !821, file: !574, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !821, file: !574, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !821, file: !574, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !821, file: !574, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !821, file: !574, line: 321, baseType: !834, size: 320, offset: 64)
!834 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !574, line: 315, size: 320, elements: !835)
!835 = !{!836, !1820, !1822, !1883, !1884}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !834, file: !574, line: 316, baseType: !837, size: 64)
!837 = !DICompositeType(tag: DW_TAG_array_type, baseType: !838, size: 64, elements: !853)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !574, line: 183, baseType: !839)
!839 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !574, line: 166, size: 64, elements: !840)
!840 = !{!841, !842, !843, !844, !845, !855, !856, !868, !871, !872, !1798, !1799, !1810, !1817}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !839, file: !574, line: 168, baseType: !726, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !839, file: !574, line: 169, baseType: !7, size: 32)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !839, file: !574, line: 170, baseType: !731, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !839, file: !574, line: 171, baseType: !819, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !839, file: !574, line: 172, baseType: !846, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !734, line: 53, baseType: !847)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !574, line: 359, size: 128, elements: !849)
!849 = !{!850, !851}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !848, file: !574, line: 360, baseType: !726, size: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !848, file: !574, line: 361, baseType: !852, size: 64, offset: 64)
!852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !819, size: 64, elements: !853)
!853 = !{!854}
!854 = !DISubrange(count: 1)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !839, file: !574, line: 173, baseType: !189, size: 32)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !839, file: !574, line: 174, baseType: !857, size: 32)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !574, line: 133, baseType: !858)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !574, line: 115, size: 32, elements: !859)
!859 = !{!860, !861, !862, !863, !864, !865, !866, !867}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !858, file: !574, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !858, file: !574, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !858, file: !574, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !858, file: !574, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !858, file: !574, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !858, file: !574, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !858, file: !574, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !858, file: !574, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !839, file: !574, line: 175, baseType: !869, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !574, line: 175, flags: DIFlagFwdDecl)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !839, file: !574, line: 176, baseType: !735, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !839, file: !574, line: 177, baseType: !873, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !734, line: 56, baseType: !874)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !347, line: 3371, size: 1792, elements: !876)
!876 = !{!877, !910, !916, !927, !946, !957, !962, !969, !975, !988, !1000, !1038, !1043, !1071, !1079, !1080, !1085, !1094, !1100, !1105, !1109, !1113, !1425, !1474, !1480, !1487, !1494, !1517, !1542, !1559, !1571, !1593, !1608, !1780}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !875, file: !347, line: 3372, baseType: !878, size: 64)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !347, line: 360, size: 64, elements: !879)
!879 = !{!880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !878, file: !347, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !878, file: !347, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !878, file: !347, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !878, file: !347, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !878, file: !347, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !878, file: !347, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !878, file: !347, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !878, file: !347, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !878, file: !347, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !878, file: !347, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !878, file: !347, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !878, file: !347, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !878, file: !347, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !878, file: !347, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !878, file: !347, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !878, file: !347, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !878, file: !347, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !878, file: !347, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !878, file: !347, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !878, file: !347, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !878, file: !347, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !878, file: !347, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !878, file: !347, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !878, file: !347, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !878, file: !347, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !878, file: !347, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !878, file: !347, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !878, file: !347, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !878, file: !347, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !878, file: !347, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !875, file: !347, line: 3373, baseType: !911, size: 192)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !347, line: 402, size: 192, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !911, file: !347, line: 403, baseType: !878, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !911, file: !347, line: 404, baseType: !873, size: 64, offset: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !911, file: !347, line: 405, baseType: !873, size: 64, offset: 128)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !875, file: !347, line: 3374, baseType: !917, size: 320)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !347, line: 1384, size: 320, elements: !918)
!918 = !{!919, !920}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !917, file: !347, line: 1385, baseType: !911, size: 192)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !917, file: !347, line: 1386, baseType: !921, size: 128, offset: 192)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !922, line: 58, baseType: !923)
!922 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !922, line: 54, size: 128, elements: !924)
!924 = !{!925, !926}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !923, file: !922, line: 56, baseType: !751, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !923, file: !922, line: 57, baseType: !768, size: 64, offset: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !875, file: !347, line: 3375, baseType: !928, size: 256)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !347, line: 1397, size: 256, elements: !929)
!929 = !{!930, !931}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !928, file: !347, line: 1398, baseType: !911, size: 192)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !928, file: !347, line: 1399, baseType: !932, size: 64, offset: 192)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !934, line: 52, size: 256, elements: !935)
!934 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!935 = !{!936, !937, !938, !939, !940, !941, !942}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !933, file: !934, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !933, file: !934, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !933, file: !934, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !933, file: !934, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !933, file: !934, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !933, file: !934, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !933, file: !934, line: 62, baseType: !943, size: 192, offset: 64)
!943 = !DICompositeType(tag: DW_TAG_array_type, baseType: !751, size: 192, elements: !944)
!944 = !{!945}
!945 = !DISubrange(count: 3)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !875, file: !347, line: 3376, baseType: !947, size: 256)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !347, line: 1408, size: 256, elements: !948)
!948 = !{!949, !950}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !947, file: !347, line: 1409, baseType: !911, size: 192)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !947, file: !347, line: 1410, baseType: !951, size: 64, offset: 192)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !953, line: 27, size: 192, elements: !954)
!953 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!954 = !{!955, !956}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !952, file: !953, line: 29, baseType: !921, size: 128)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !952, file: !953, line: 30, baseType: !189, size: 32, offset: 128)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !875, file: !347, line: 3377, baseType: !958, size: 256)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !347, line: 1437, size: 256, elements: !959)
!959 = !{!960, !961}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !958, file: !347, line: 1438, baseType: !911, size: 192)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !958, file: !347, line: 1439, baseType: !873, size: 64, offset: 192)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !875, file: !347, line: 3378, baseType: !963, size: 256)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !347, line: 1418, size: 256, elements: !964)
!964 = !{!965, !966, !967}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !963, file: !347, line: 1419, baseType: !911, size: 192)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !963, file: !347, line: 1420, baseType: !726, size: 32, offset: 192)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !963, file: !347, line: 1421, baseType: !968, size: 8, offset: 224)
!968 = !DICompositeType(tag: DW_TAG_array_type, baseType: !729, size: 8, elements: !853)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !875, file: !347, line: 3379, baseType: !970, size: 320)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !347, line: 1428, size: 320, elements: !971)
!971 = !{!972, !973, !974}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !970, file: !347, line: 1429, baseType: !911, size: 192)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !970, file: !347, line: 1430, baseType: !873, size: 64, offset: 192)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !970, file: !347, line: 1431, baseType: !873, size: 64, offset: 256)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !875, file: !347, line: 3380, baseType: !976, size: 320)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !347, line: 1460, size: 320, elements: !977)
!977 = !{!978, !979}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !976, file: !347, line: 1461, baseType: !911, size: 192)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !976, file: !347, line: 1462, baseType: !980, size: 128, offset: 192)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !981, line: 31, size: 128, elements: !982)
!981 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!982 = !{!983, !986, !987}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !980, file: !981, line: 32, baseType: !984, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !725)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !980, file: !981, line: 33, baseType: !7, size: 32, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !980, file: !981, line: 34, baseType: !7, size: 32, offset: 96)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !875, file: !347, line: 3381, baseType: !989, size: 384)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !347, line: 2507, size: 384, elements: !990)
!990 = !{!991, !992, !997, !998, !999}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !989, file: !347, line: 2508, baseType: !911, size: 192)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !989, file: !347, line: 2509, baseType: !993, size: 32, offset: 192)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !994, line: 58, baseType: !995)
!994 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !996, line: 44, baseType: !7)
!996 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!997 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !989, file: !347, line: 2510, baseType: !7, size: 32, offset: 224)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !989, file: !347, line: 2511, baseType: !873, size: 64, offset: 256)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !989, file: !347, line: 2512, baseType: !873, size: 64, offset: 320)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !875, file: !347, line: 3382, baseType: !1001, size: 896)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !347, line: 2652, size: 896, elements: !1002)
!1002 = !{!1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1001, file: !347, line: 2653, baseType: !989, size: 384)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1001, file: !347, line: 2654, baseType: !873, size: 64, offset: 384)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1001, file: !347, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1001, file: !347, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1001, file: !347, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1001, file: !347, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1001, file: !347, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1001, file: !347, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1001, file: !347, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1001, file: !347, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1001, file: !347, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1001, file: !347, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1001, file: !347, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1001, file: !347, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1001, file: !347, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1001, file: !347, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1001, file: !347, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1001, file: !347, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1001, file: !347, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1001, file: !347, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1001, file: !347, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1001, file: !347, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1001, file: !347, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1001, file: !347, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1001, file: !347, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1001, file: !347, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1001, file: !347, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1001, file: !347, line: 2703, baseType: !7, size: 32, offset: 512)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1001, file: !347, line: 2705, baseType: !873, size: 64, offset: 576)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1001, file: !347, line: 2706, baseType: !873, size: 64, offset: 640)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1001, file: !347, line: 2707, baseType: !873, size: 64, offset: 704)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1001, file: !347, line: 2708, baseType: !873, size: 64, offset: 768)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1001, file: !347, line: 2711, baseType: !1036, size: 64, offset: 832)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !347, line: 2711, flags: DIFlagFwdDecl)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !875, file: !347, line: 3383, baseType: !1039, size: 960)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !347, line: 2756, size: 960, elements: !1040)
!1040 = !{!1041, !1042}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1039, file: !347, line: 2757, baseType: !1001, size: 896)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1039, file: !347, line: 2758, baseType: !819, size: 64, offset: 896)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !875, file: !347, line: 3384, baseType: !1044, size: 1472)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !347, line: 3114, size: 1472, elements: !1045)
!1045 = !{!1046, !1067, !1068, !1069, !1070}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1044, file: !347, line: 3115, baseType: !1047, size: 1216)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !347, line: 2984, size: 1216, elements: !1048)
!1048 = !{!1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1047, file: !347, line: 2985, baseType: !1039, size: 960)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1047, file: !347, line: 2986, baseType: !873, size: 64, offset: 960)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1047, file: !347, line: 2987, baseType: !873, size: 64, offset: 1024)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1047, file: !347, line: 2988, baseType: !873, size: 64, offset: 1088)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1047, file: !347, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1047, file: !347, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1047, file: !347, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1047, file: !347, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1047, file: !347, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1047, file: !347, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1047, file: !347, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1047, file: !347, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1047, file: !347, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1047, file: !347, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1047, file: !347, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1047, file: !347, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1047, file: !347, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1047, file: !347, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1044, file: !347, line: 3117, baseType: !873, size: 64, offset: 1216)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1044, file: !347, line: 3119, baseType: !873, size: 64, offset: 1280)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1044, file: !347, line: 3121, baseType: !873, size: 64, offset: 1344)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1044, file: !347, line: 3123, baseType: !873, size: 64, offset: 1408)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !875, file: !347, line: 3385, baseType: !1072, size: 1088)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !347, line: 2874, size: 1088, elements: !1073)
!1073 = !{!1074, !1075, !1076}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1072, file: !347, line: 2875, baseType: !1039, size: 960)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1072, file: !347, line: 2876, baseType: !819, size: 64, offset: 960)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1072, file: !347, line: 2877, baseType: !1077, size: 64, offset: 1024)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !347, line: 2856, flags: DIFlagFwdDecl)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !875, file: !347, line: 3386, baseType: !1047, size: 1216)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !875, file: !347, line: 3387, baseType: !1081, size: 1280)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !347, line: 3093, size: 1280, elements: !1082)
!1082 = !{!1083, !1084}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1081, file: !347, line: 3094, baseType: !1047, size: 1216)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1081, file: !347, line: 3095, baseType: !1077, size: 64, offset: 1216)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !875, file: !347, line: 3388, baseType: !1086, size: 1216)
!1086 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !347, line: 2824, size: 1216, elements: !1087)
!1087 = !{!1088, !1089, !1090, !1091, !1092, !1093}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1086, file: !347, line: 2825, baseType: !1001, size: 896)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1086, file: !347, line: 2827, baseType: !873, size: 64, offset: 896)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1086, file: !347, line: 2828, baseType: !873, size: 64, offset: 960)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1086, file: !347, line: 2829, baseType: !873, size: 64, offset: 1024)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1086, file: !347, line: 2830, baseType: !873, size: 64, offset: 1088)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1086, file: !347, line: 2831, baseType: !873, size: 64, offset: 1152)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !875, file: !347, line: 3389, baseType: !1095, size: 1024)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !347, line: 2850, size: 1024, elements: !1096)
!1096 = !{!1097, !1098, !1099}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1095, file: !347, line: 2851, baseType: !1039, size: 960)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1095, file: !347, line: 2852, baseType: !726, size: 32, offset: 960)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1095, file: !347, line: 2853, baseType: !726, size: 32, offset: 992)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !875, file: !347, line: 3390, baseType: !1101, size: 1024)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !347, line: 2857, size: 1024, elements: !1102)
!1102 = !{!1103, !1104}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1101, file: !347, line: 2858, baseType: !1039, size: 960)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1101, file: !347, line: 2859, baseType: !1077, size: 64, offset: 960)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !875, file: !347, line: 3391, baseType: !1106, size: 960)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !347, line: 2862, size: 960, elements: !1107)
!1107 = !{!1108}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1106, file: !347, line: 2863, baseType: !1039, size: 960)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !875, file: !347, line: 3392, baseType: !1110, size: 1472)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !347, line: 3304, size: 1472, elements: !1111)
!1111 = !{!1112}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1110, file: !347, line: 3305, baseType: !1044, size: 1472)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !875, file: !347, line: 3393, baseType: !1114, size: 1792)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !347, line: 3248, size: 1792, elements: !1115)
!1115 = !{!1116, !1117, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1114, file: !347, line: 3249, baseType: !1044, size: 1472)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1114, file: !347, line: 3251, baseType: !1118, size: 64, offset: 1472)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1120, line: 463, size: 1152, elements: !1121)
!1120 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1121 = !{!1122, !1125, !1285, !1286, !1289, !1348, !1349, !1350, !1351, !1352, !1353, !1377, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1119, file: !1120, line: 464, baseType: !1123, size: 64)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1120, line: 464, flags: DIFlagFwdDecl)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1119, file: !1120, line: 467, baseType: !1126, size: 64, offset: 64)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !331, line: 374, size: 640, elements: !1128)
!1128 = !{!1129, !1260, !1261, !1274, !1275, !1276, !1277, !1278, !1279, !1281, !1283, !1284}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1127, file: !331, line: 377, baseType: !1130, size: 64)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !734, line: 111, baseType: !1131)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64)
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !331, line: 217, size: 832, elements: !1133)
!1133 = !{!1134, !1169, !1170, !1171, !1230, !1234, !1235, !1236, !1254, !1255, !1256, !1257, !1258, !1259}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1132, file: !331, line: 219, baseType: !1135, size: 64)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !331, line: 151, baseType: !1137)
!1137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !331, line: 151, size: 128, elements: !1138)
!1138 = !{!1139}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1137, file: !331, line: 151, baseType: !1140, size: 128)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !331, line: 150, baseType: !1141)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !331, line: 150, size: 128, elements: !1142)
!1142 = !{!1143, !1144, !1145}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1141, file: !331, line: 150, baseType: !7, size: 32)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1141, file: !331, line: 150, baseType: !7, size: 32, offset: 32)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1141, file: !331, line: 150, baseType: !1146, size: 64, offset: 64)
!1146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1147, size: 64, elements: !853)
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !734, line: 108, baseType: !1148)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !331, line: 122, size: 512, elements: !1150)
!1150 = !{!1151, !1152, !1153, !1161, !1162, !1163, !1164, !1165, !1166, !1167}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1149, file: !331, line: 124, baseType: !1131, size: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1149, file: !331, line: 125, baseType: !1131, size: 64, offset: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1149, file: !331, line: 131, baseType: !1154, size: 64, offset: 128)
!1154 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !331, line: 128, size: 64, elements: !1155)
!1155 = !{!1156, !1160}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1154, file: !331, line: 129, baseType: !1157, size: 64)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !734, line: 66, baseType: !1158)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !734, line: 65, flags: DIFlagFwdDecl)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1154, file: !331, line: 130, baseType: !819, size: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1149, file: !331, line: 134, baseType: !730, size: 64, offset: 192)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1149, file: !331, line: 137, baseType: !873, size: 64, offset: 256)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1149, file: !331, line: 138, baseType: !993, size: 32, offset: 320)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1149, file: !331, line: 142, baseType: !7, size: 32, offset: 352)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1149, file: !331, line: 144, baseType: !726, size: 32, offset: 384)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1149, file: !331, line: 145, baseType: !726, size: 32, offset: 416)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1149, file: !331, line: 146, baseType: !1168, size: 64, offset: 448)
!1168 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !331, line: 119, baseType: !768)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1132, file: !331, line: 220, baseType: !1135, size: 64, offset: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1132, file: !331, line: 223, baseType: !730, size: 64, offset: 128)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1132, file: !331, line: 226, baseType: !1172, size: 64, offset: 192)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !318, line: 100, size: 1216, elements: !1174)
!1174 = !{!1175, !1176, !1177, !1178, !1179, !1184, !1185, !1186, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1220, !1228, !1229}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1173, file: !318, line: 102, baseType: !726, size: 32)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1173, file: !318, line: 105, baseType: !7, size: 32, offset: 32)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1173, file: !318, line: 108, baseType: !1131, size: 64, offset: 64)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1173, file: !318, line: 111, baseType: !1131, size: 64, offset: 128)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1173, file: !318, line: 114, baseType: !1180, size: 64, offset: 192)
!1180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !318, line: 41, size: 64, elements: !1181)
!1181 = !{!1182, !1183}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1180, file: !318, line: 42, baseType: !317, size: 32)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1180, file: !318, line: 43, baseType: !7, size: 32, offset: 32)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1173, file: !318, line: 117, baseType: !7, size: 32, offset: 256)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1173, file: !318, line: 120, baseType: !7, size: 32, offset: 288)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1173, file: !318, line: 123, baseType: !1187, size: 64, offset: 320)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !318, line: 87, baseType: !1189)
!1189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !318, line: 87, size: 128, elements: !1190)
!1190 = !{!1191}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1189, file: !318, line: 87, baseType: !1192, size: 128)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !318, line: 85, baseType: !1193)
!1193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !318, line: 85, size: 128, elements: !1194)
!1194 = !{!1195, !1196, !1197}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1193, file: !318, line: 85, baseType: !7, size: 32)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1193, file: !318, line: 85, baseType: !7, size: 32, offset: 32)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1193, file: !318, line: 85, baseType: !1198, size: 64, offset: 64)
!1198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1199, size: 64, elements: !853)
!1199 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !318, line: 84, baseType: !1172)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1173, file: !318, line: 126, baseType: !1172, size: 64, offset: 384)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1173, file: !318, line: 129, baseType: !1172, size: 64, offset: 448)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1173, file: !318, line: 132, baseType: !730, size: 64, offset: 512)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1173, file: !318, line: 139, baseType: !873, size: 64, offset: 576)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1173, file: !318, line: 143, baseType: !921, size: 128, offset: 640)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1173, file: !318, line: 146, baseType: !921, size: 128, offset: 768)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1173, file: !318, line: 148, baseType: !725, size: 8, offset: 896)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1173, file: !318, line: 149, baseType: !725, size: 8, offset: 904)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1173, file: !318, line: 153, baseType: !326, size: 32, offset: 928)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1173, file: !318, line: 156, baseType: !1210, size: 64, offset: 960)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64)
!1211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !318, line: 48, size: 320, elements: !1212)
!1212 = !{!1213, !1217, !1218, !1219}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1211, file: !318, line: 50, baseType: !1214, size: 64)
!1214 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !734, line: 58, baseType: !1215)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64)
!1216 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !734, line: 57, flags: DIFlagFwdDecl)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1211, file: !318, line: 59, baseType: !921, size: 128, offset: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1211, file: !318, line: 64, baseType: !725, size: 8, offset: 192)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1211, file: !318, line: 67, baseType: !1210, size: 64, offset: 256)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1173, file: !318, line: 159, baseType: !1221, size: 64, offset: 1024)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64)
!1222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !318, line: 72, size: 256, elements: !1223)
!1223 = !{!1224, !1225, !1226, !1227}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1222, file: !318, line: 74, baseType: !1148, size: 64)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1222, file: !318, line: 77, baseType: !1221, size: 64, offset: 64)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1222, file: !318, line: 78, baseType: !1221, size: 64, offset: 128)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1222, file: !318, line: 81, baseType: !1221, size: 64, offset: 192)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1173, file: !318, line: 162, baseType: !725, size: 8, offset: 1088)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1173, file: !318, line: 166, baseType: !873, size: 64, offset: 1152)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1132, file: !331, line: 229, baseType: !1231, size: 128, offset: 256)
!1231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1232, size: 128, elements: !752)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64)
!1233 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !331, line: 229, flags: DIFlagFwdDecl)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1132, file: !331, line: 232, baseType: !1131, size: 64, offset: 384)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1132, file: !331, line: 233, baseType: !1131, size: 64, offset: 448)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1132, file: !331, line: 238, baseType: !1237, size: 64, offset: 512)
!1237 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !331, line: 235, size: 64, elements: !1238)
!1238 = !{!1239, !1245}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1237, file: !331, line: 236, baseType: !1240, size: 64)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64)
!1241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !331, line: 273, size: 128, elements: !1242)
!1242 = !{!1243, !1244}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1241, file: !331, line: 275, baseType: !1157, size: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1241, file: !331, line: 278, baseType: !1157, size: 64, offset: 64)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1237, file: !331, line: 237, baseType: !1246, size: 64)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !331, line: 259, size: 320, elements: !1248)
!1248 = !{!1249, !1250, !1251, !1252, !1253}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1247, file: !331, line: 261, baseType: !819, size: 64)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1247, file: !331, line: 262, baseType: !819, size: 64, offset: 64)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1247, file: !331, line: 266, baseType: !819, size: 64, offset: 128)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1247, file: !331, line: 267, baseType: !819, size: 64, offset: 192)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1247, file: !331, line: 270, baseType: !726, size: 32, offset: 256)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1132, file: !331, line: 241, baseType: !1168, size: 64, offset: 576)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1132, file: !331, line: 244, baseType: !726, size: 32, offset: 640)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1132, file: !331, line: 247, baseType: !726, size: 32, offset: 672)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1132, file: !331, line: 250, baseType: !726, size: 32, offset: 704)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1132, file: !331, line: 253, baseType: !726, size: 32, offset: 736)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1132, file: !331, line: 256, baseType: !726, size: 32, offset: 768)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1127, file: !331, line: 378, baseType: !1130, size: 64, offset: 64)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1127, file: !331, line: 381, baseType: !1262, size: 64, offset: 128)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64)
!1263 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !331, line: 282, baseType: !1264)
!1264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !331, line: 282, size: 128, elements: !1265)
!1265 = !{!1266}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1264, file: !331, line: 282, baseType: !1267, size: 128)
!1267 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !331, line: 281, baseType: !1268)
!1268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !331, line: 281, size: 128, elements: !1269)
!1269 = !{!1270, !1271, !1272}
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1268, file: !331, line: 281, baseType: !7, size: 32)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1268, file: !331, line: 281, baseType: !7, size: 32, offset: 32)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1268, file: !331, line: 281, baseType: !1273, size: 64, offset: 64)
!1273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1130, size: 64, elements: !853)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1127, file: !331, line: 384, baseType: !726, size: 32, offset: 192)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1127, file: !331, line: 387, baseType: !726, size: 32, offset: 224)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1127, file: !331, line: 390, baseType: !726, size: 32, offset: 256)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1127, file: !331, line: 394, baseType: !1262, size: 64, offset: 320)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1127, file: !331, line: 396, baseType: !330, size: 32, offset: 384)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1127, file: !331, line: 399, baseType: !1280, size: 64, offset: 416)
!1280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !336, size: 64, elements: !752)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1127, file: !331, line: 402, baseType: !1282, size: 64, offset: 480)
!1282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !752)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1127, file: !331, line: 406, baseType: !726, size: 32, offset: 544)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1127, file: !331, line: 409, baseType: !726, size: 32, offset: 576)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1119, file: !1120, line: 470, baseType: !1158, size: 64, offset: 128)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1119, file: !1120, line: 473, baseType: !1287, size: 64, offset: 192)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64)
!1288 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1120, line: 166, flags: DIFlagFwdDecl)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1119, file: !1120, line: 476, baseType: !1290, size: 64, offset: 256)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64)
!1291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !318, line: 187, size: 256, elements: !1292)
!1292 = !{!1293, !1294, !1295, !1347}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1291, file: !318, line: 189, baseType: !726, size: 32)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !1291, file: !318, line: 192, baseType: !1187, size: 64, offset: 64)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1291, file: !318, line: 197, baseType: !1296, size: 64, offset: 128)
!1296 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1297, line: 144, baseType: !1298)
!1297 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64)
!1299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1297, line: 100, size: 896, elements: !1300)
!1300 = !{!1301, !1309, !1314, !1319, !1321, !1324, !1325, !1326, !1327, !1328, !1333, !1335, !1336, !1341, !1346}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1299, file: !1297, line: 102, baseType: !1302, size: 64)
!1302 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1297, line: 52, baseType: !1303)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64)
!1304 = !DISubroutineType(types: !1305)
!1305 = !{!1306, !1307}
!1306 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1297, line: 47, baseType: !7)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64)
!1308 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1299, file: !1297, line: 105, baseType: !1310, size: 64, offset: 64)
!1310 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1297, line: 59, baseType: !1311)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64)
!1312 = !DISubroutineType(types: !1313)
!1313 = !{!726, !1307, !1307}
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1299, file: !1297, line: 108, baseType: !1315, size: 64, offset: 128)
!1315 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1297, line: 63, baseType: !1316)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64)
!1317 = !DISubroutineType(types: !1318)
!1318 = !{null, !730}
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1299, file: !1297, line: 111, baseType: !1320, size: 64, offset: 192)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1299, file: !1297, line: 114, baseType: !1322, size: 64, offset: 256)
!1322 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1323, line: 46, baseType: !751)
!1323 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1299, file: !1297, line: 117, baseType: !1322, size: 64, offset: 320)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1299, file: !1297, line: 120, baseType: !1322, size: 64, offset: 384)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1299, file: !1297, line: 124, baseType: !7, size: 32, offset: 448)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1299, file: !1297, line: 128, baseType: !7, size: 32, offset: 480)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1299, file: !1297, line: 131, baseType: !1329, size: 64, offset: 512)
!1329 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1297, line: 75, baseType: !1330)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64)
!1331 = !DISubroutineType(types: !1332)
!1332 = !{!730, !1322, !1322}
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1299, file: !1297, line: 132, baseType: !1334, size: 64, offset: 576)
!1334 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1297, line: 78, baseType: !1316)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1299, file: !1297, line: 135, baseType: !730, size: 64, offset: 640)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1299, file: !1297, line: 136, baseType: !1337, size: 64, offset: 704)
!1337 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1297, line: 82, baseType: !1338)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64)
!1339 = !DISubroutineType(types: !1340)
!1340 = !{!730, !730, !1322, !1322}
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1299, file: !1297, line: 137, baseType: !1342, size: 64, offset: 768)
!1342 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1297, line: 83, baseType: !1343)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64)
!1344 = !DISubroutineType(types: !1345)
!1345 = !{null, !730, !730}
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1299, file: !1297, line: 141, baseType: !7, size: 32, offset: 832)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !1291, file: !318, line: 200, baseType: !1172, size: 64, offset: 192)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1119, file: !1120, line: 479, baseType: !1296, size: 64, offset: 320)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1119, file: !1120, line: 484, baseType: !873, size: 64, offset: 384)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1119, file: !1120, line: 488, baseType: !873, size: 64, offset: 448)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1119, file: !1120, line: 493, baseType: !873, size: 64, offset: 512)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1119, file: !1120, line: 496, baseType: !873, size: 64, offset: 576)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1119, file: !1120, line: 501, baseType: !1354, size: 64, offset: 640)
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1355, size: 64)
!1355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !342, line: 2355, size: 576, elements: !1356)
!1356 = !{!1357, !1360, !1361, !1362, !1363, !1365, !1366, !1371, !1372, !1373, !1374, !1375, !1376}
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1355, file: !342, line: 2356, baseType: !1358, size: 64)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64)
!1359 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !342, line: 2356, flags: DIFlagFwdDecl)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1355, file: !342, line: 2357, baseType: !731, size: 64, offset: 64)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1355, file: !342, line: 2358, baseType: !726, size: 32, offset: 128)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1355, file: !342, line: 2359, baseType: !726, size: 32, offset: 160)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1355, file: !342, line: 2360, baseType: !1364, size: 128, offset: 192)
!1364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !726, size: 128, elements: !777)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1355, file: !342, line: 2364, baseType: !726, size: 32, offset: 320)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1355, file: !342, line: 2367, baseType: !1367, size: 128, offset: 384)
!1367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !342, line: 2349, size: 128, elements: !1368)
!1368 = !{!1369, !1370}
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1367, file: !342, line: 2351, baseType: !819, size: 64)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1367, file: !342, line: 2352, baseType: !768, size: 64, offset: 64)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1355, file: !342, line: 2371, baseType: !341, size: 32, offset: 512)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1355, file: !342, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1355, file: !342, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1355, file: !342, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1355, file: !342, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1355, file: !342, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1119, file: !1120, line: 504, baseType: !1378, size: 64, offset: 704)
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64)
!1379 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1120, line: 504, flags: DIFlagFwdDecl)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1119, file: !1120, line: 507, baseType: !1296, size: 64, offset: 768)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1119, file: !1120, line: 510, baseType: !726, size: 32, offset: 832)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1119, file: !1120, line: 513, baseType: !726, size: 32, offset: 864)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1119, file: !1120, line: 516, baseType: !993, size: 32, offset: 896)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1119, file: !1120, line: 519, baseType: !993, size: 32, offset: 928)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1119, file: !1120, line: 522, baseType: !7, size: 32, offset: 960)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1119, file: !1120, line: 523, baseType: !7, size: 32, offset: 992)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1119, file: !1120, line: 528, baseType: !731, size: 64, offset: 1024)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1119, file: !1120, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1119, file: !1120, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1119, file: !1120, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1119, file: !1120, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1119, file: !1120, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1119, file: !1120, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1119, file: !1120, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1119, file: !1120, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1119, file: !1120, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1119, file: !1120, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1119, file: !1120, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1119, file: !1120, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1119, file: !1120, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1119, file: !1120, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1119, file: !1120, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1119, file: !1120, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1114, file: !347, line: 3254, baseType: !873, size: 64, offset: 1536)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1114, file: !347, line: 3257, baseType: !873, size: 64, offset: 1600)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1114, file: !347, line: 3258, baseType: !873, size: 64, offset: 1664)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1114, file: !347, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1114, file: !347, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1114, file: !347, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1114, file: !347, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1114, file: !347, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1114, file: !347, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1114, file: !347, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1114, file: !347, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1114, file: !347, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1114, file: !347, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1114, file: !347, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1114, file: !347, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1114, file: !347, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1114, file: !347, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1114, file: !347, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1114, file: !347, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1114, file: !347, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1114, file: !347, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !875, file: !347, line: 3394, baseType: !1426, size: 1344)
!1426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !347, line: 2279, size: 1344, elements: !1427)
!1427 = !{!1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1453, !1454, !1455, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471}
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1426, file: !347, line: 2280, baseType: !911, size: 192)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1426, file: !347, line: 2281, baseType: !873, size: 64, offset: 192)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1426, file: !347, line: 2282, baseType: !873, size: 64, offset: 256)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1426, file: !347, line: 2283, baseType: !873, size: 64, offset: 320)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1426, file: !347, line: 2284, baseType: !873, size: 64, offset: 384)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1426, file: !347, line: 2285, baseType: !7, size: 32, offset: 448)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1426, file: !347, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1426, file: !347, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1426, file: !347, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1426, file: !347, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1426, file: !347, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1426, file: !347, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1426, file: !347, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1426, file: !347, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1426, file: !347, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1426, file: !347, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1426, file: !347, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1426, file: !347, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1426, file: !347, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1426, file: !347, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1426, file: !347, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1426, file: !347, line: 2305, baseType: !7, size: 32, offset: 512)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1426, file: !347, line: 2306, baseType: !1451, size: 32, offset: 544)
!1451 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1452, line: 31, baseType: !726)
!1452 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1426, file: !347, line: 2307, baseType: !873, size: 64, offset: 576)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1426, file: !347, line: 2308, baseType: !873, size: 64, offset: 640)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1426, file: !347, line: 2314, baseType: !1456, size: 64, offset: 704)
!1456 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !347, line: 2309, size: 64, elements: !1457)
!1457 = !{!1458, !1459, !1460}
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1456, file: !347, line: 2310, baseType: !726, size: 32)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1456, file: !347, line: 2311, baseType: !731, size: 64)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1456, file: !347, line: 2312, baseType: !1461, size: 64)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64)
!1462 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !347, line: 2277, flags: DIFlagFwdDecl)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1426, file: !347, line: 2315, baseType: !873, size: 64, offset: 768)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1426, file: !347, line: 2316, baseType: !873, size: 64, offset: 832)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1426, file: !347, line: 2317, baseType: !873, size: 64, offset: 896)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1426, file: !347, line: 2318, baseType: !873, size: 64, offset: 960)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1426, file: !347, line: 2319, baseType: !873, size: 64, offset: 1024)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1426, file: !347, line: 2320, baseType: !873, size: 64, offset: 1088)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1426, file: !347, line: 2321, baseType: !873, size: 64, offset: 1152)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1426, file: !347, line: 2322, baseType: !873, size: 64, offset: 1216)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1426, file: !347, line: 2324, baseType: !1472, size: 64, offset: 1280)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1473, size: 64)
!1473 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !347, line: 2324, flags: DIFlagFwdDecl)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !875, file: !347, line: 3395, baseType: !1475, size: 320)
