; ModuleID = 'genrtl.bc'
source_filename = "genrtl.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.stat64 = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.rtx_def = type { i32, %union.u }
%union.u = type { %struct.block_symbol }
%struct.block_symbol = type { [3 x %union.rtunion_def], %struct.object_block*, i64 }
%union.rtunion_def = type { i8* }
%struct.object_block = type { %union.section*, i32, i64, %struct.VEC_rtx_gc*, %struct.VEC_rtx_gc* }
%union.section = type opaque
%struct.VEC_rtx_gc = type { %struct.VEC_rtx_base }
%struct.VEC_rtx_base = type { i32, i32, [1 x %struct.rtx_def*] }
%struct.rtvec_def = type { i32, [1 x %struct.rtx_def*] }
%struct.basic_block_def = type opaque
%union.tree_node = type opaque


!207 = !DIEnumerator(name: "UMIN", value: 72, isUnsigned: true)
!208 = !DIEnumerator(name: "UMAX", value: 73, isUnsigned: true)
!209 = !DIEnumerator(name: "PRE_DEC", value: 74, isUnsigned: true)
!210 = !DIEnumerator(name: "PRE_INC", value: 75, isUnsigned: true)
!211 = !DIEnumerator(name: "POST_DEC", value: 76, isUnsigned: true)
!212 = !DIEnumerator(name: "POST_INC", value: 77, isUnsigned: true)
!213 = !DIEnumerator(name: "PRE_MODIFY", value: 78, isUnsigned: true)
!214 = !DIEnumerator(name: "POST_MODIFY", value: 79, isUnsigned: true)
!215 = !DIEnumerator(name: "NE", value: 80, isUnsigned: true)
!216 = !DIEnumerator(name: "EQ", value: 81, isUnsigned: true)
!217 = !DIEnumerator(name: "GE", value: 82, isUnsigned: true)
!218 = !DIEnumerator(name: "GT", value: 83, isUnsigned: true)
!219 = !DIEnumerator(name: "LE", value: 84, isUnsigned: true)
!220 = !DIEnumerator(name: "LT", value: 85, isUnsigned: true)
!221 = !DIEnumerator(name: "GEU", value: 86, isUnsigned: true)
!222 = !DIEnumerator(name: "GTU", value: 87, isUnsigned: true)
!223 = !DIEnumerator(name: "LEU", value: 88, isUnsigned: true)
!224 = !DIEnumerator(name: "LTU", value: 89, isUnsigned: true)
!225 = !DIEnumerator(name: "UNORDERED", value: 90, isUnsigned: true)
!226 = !DIEnumerator(name: "ORDERED", value: 91, isUnsigned: true)
!227 = !DIEnumerator(name: "UNEQ", value: 92, isUnsigned: true)
!228 = !DIEnumerator(name: "UNGE", value: 93, isUnsigned: true)
!229 = !DIEnumerator(name: "UNGT", value: 94, isUnsigned: true)
!230 = !DIEnumerator(name: "UNLE", value: 95, isUnsigned: true)
!231 = !DIEnumerator(name: "UNLT", value: 96, isUnsigned: true)
!232 = !DIEnumerator(name: "LTGT", value: 97, isUnsigned: true)
!233 = !DIEnumerator(name: "SIGN_EXTEND", value: 98, isUnsigned: true)
!234 = !DIEnumerator(name: "ZERO_EXTEND", value: 99, isUnsigned: true)
!235 = !DIEnumerator(name: "TRUNCATE", value: 100, isUnsigned: true)
!236 = !DIEnumerator(name: "FLOAT_EXTEND", value: 101, isUnsigned: true)
!237 = !DIEnumerator(name: "FLOAT_TRUNCATE", value: 102, isUnsigned: true)
!238 = !DIEnumerator(name: "FLOAT", value: 103, isUnsigned: true)
!239 = !DIEnumerator(name: "FIX", value: 104, isUnsigned: true)
!240 = !DIEnumerator(name: "UNSIGNED_FLOAT", value: 105, isUnsigned: true)
!241 = !DIEnumerator(name: "UNSIGNED_FIX", value: 106, isUnsigned: true)
!242 = !DIEnumerator(name: "FRACT_CONVERT", value: 107, isUnsigned: true)
!243 = !DIEnumerator(name: "UNSIGNED_FRACT_CONVERT", value: 108, isUnsigned: true)
!244 = !DIEnumerator(name: "SAT_FRACT", value: 109, isUnsigned: true)
!245 = !DIEnumerator(name: "UNSIGNED_SAT_FRACT", value: 110, isUnsigned: true)
!246 = !DIEnumerator(name: "ABS", value: 111, isUnsigned: true)
!247 = !DIEnumerator(name: "SQRT", value: 112, isUnsigned: true)
!248 = !DIEnumerator(name: "BSWAP", value: 113, isUnsigned: true)
!249 = !DIEnumerator(name: "FFS", value: 114, isUnsigned: true)
!250 = !DIEnumerator(name: "CLZ", value: 115, isUnsigned: true)
!251 = !DIEnumerator(name: "CTZ", value: 116, isUnsigned: true)
!252 = !DIEnumerator(name: "POPCOUNT", value: 117, isUnsigned: true)
!253 = !DIEnumerator(name: "PARITY", value: 118, isUnsigned: true)
!254 = !DIEnumerator(name: "SIGN_EXTRACT", value: 119, isUnsigned: true)
!255 = !DIEnumerator(name: "ZERO_EXTRACT", value: 120, isUnsigned: true)
!256 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!257 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!258 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!259 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!260 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!261 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!262 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!263 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!264 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!265 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!266 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!267 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!268 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!269 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!270 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!271 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!272 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!273 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!274 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!275 = !{!276, !277, !278, !279, !282, !283, !285}
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!278 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !281)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !286, line: 50, baseType: !287)
!286 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !133, line: 240, size: 384, elements: !289)
!289 = !{!290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !288, file: !133, line: 242, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !288, file: !133, line: 245, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !288, file: !133, line: 252, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !288, file: !133, line: 257, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !288, file: !133, line: 265, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !288, file: !133, line: 277, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !288, file: !133, line: 291, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !288, file: !133, line: 298, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !288, file: !133, line: 305, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !288, file: !133, line: 310, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !288, file: !133, line: 321, baseType: !301, size: 320, offset: 64)
!301 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !133, line: 315, size: 320, elements: !302)
!302 = !{!303, !372, !374, !405, !418}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !301, file: !133, line: 316, baseType: !304, size: 64)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 64, elements: !320)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !133, line: 183, baseType: !306)
!306 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !133, line: 166, size: 64, elements: !307)
!307 = !{!308, !309, !310, !311, !312, !322, !323, !335, !338, !341, !345, !348, !361, !369}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !306, file: !133, line: 168, baseType: !278, size: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !306, file: !133, line: 169, baseType: !5, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !306, file: !133, line: 170, baseType: !283, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !306, file: !133, line: 171, baseType: !285, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !306, file: !133, line: 172, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !286, line: 53, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !133, line: 359, size: 128, elements: !316)
!316 = !{!317, !318}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !315, file: !133, line: 360, baseType: !278, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !315, file: !133, line: 361, baseType: !319, size: 64, offset: 64)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !285, size: 64, elements: !320)
!320 = !{!321}
!321 = !DISubrange(count: 1)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !306, file: !133, line: 173, baseType: !3, size: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !306, file: !133, line: 174, baseType: !324, size: 32)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !133, line: 133, baseType: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !133, line: 115, size: 32, elements: !326)
!326 = !{!327, !328, !329, !330, !331, !332, !333, !334}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !325, file: !133, line: 118, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !325, file: !133, line: 120, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !325, file: !133, line: 121, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !325, file: !133, line: 123, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !325, file: !133, line: 125, baseType: !5, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !325, file: !133, line: 127, baseType: !5, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !325, file: !133, line: 130, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !325, file: !133, line: 132, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !306, file: !133, line: 175, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !133, line: 175, flags: DIFlagFwdDecl)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !306, file: !133, line: 176, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !286, line: 46, flags: DIFlagFwdDecl)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !306, file: !133, line: 177, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !286, line: 56, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !286, line: 55, flags: DIFlagFwdDecl)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !306, file: !133, line: 178, baseType: !346, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !286, line: 110, flags: DIFlagFwdDecl)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !306, file: !133, line: 179, baseType: !349, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !133, line: 150, baseType: !351)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !133, line: 142, size: 320, elements: !352)
!352 = !{!353, !354, !355, !356, !359, !360}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !351, file: !133, line: 144, baseType: !342, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !351, file: !133, line: 145, baseType: !285, size: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !351, file: !133, line: 146, baseType: !285, size: 64, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !351, file: !133, line: 147, baseType: !357, size: 32, offset: 192)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !358, line: 31, baseType: !278)
!358 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!359 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !351, file: !133, line: 148, baseType: !5, size: 32, offset: 224)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !351, file: !133, line: 149, baseType: !277, size: 8, offset: 256)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !306, file: !133, line: 180, baseType: !362, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !133, line: 162, baseType: !364)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !133, line: 159, size: 128, elements: !365)
!365 = !{!366, !367}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !364, file: !133, line: 160, baseType: !342, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !364, file: !133, line: 161, baseType: !368, size: 64, offset: 64)
!368 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !306, file: !133, line: 181, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !133, line: 181, flags: DIFlagFwdDecl)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !301, file: !133, line: 317, baseType: !373, size: 64)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 64, elements: !320)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !301, file: !133, line: 318, baseType: !375, size: 320)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !133, line: 188, size: 320, elements: !376)
!376 = !{!377, !381, !404}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !375, file: !133, line: 190, baseType: !378, size: 192)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 192, elements: !379)
!379 = !{!380}
!380 = !DISubrange(count: 3)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !375, file: !133, line: 193, baseType: !382, size: 64, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !133, line: 206, size: 320, elements: !384)
!384 = !{!385, !389, !390, !391, !403}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !383, file: !133, line: 208, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !286, line: 62, baseType: !388)
!388 = !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !286, line: 61, flags: DIFlagFwdDecl)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !383, file: !133, line: 211, baseType: !5, size: 32, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !383, file: !133, line: 214, baseType: !368, size: 64, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !383, file: !133, line: 224, baseType: !392, size: 64, offset: 192)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !133, line: 202, baseType: !394)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !133, line: 202, size: 128, elements: !395)
!395 = !{!396}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !394, file: !133, line: 202, baseType: !397, size: 128)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !133, line: 200, baseType: !398)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !133, line: 200, size: 128, elements: !399)
!399 = !{!400, !401, !402}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !398, file: !133, line: 200, baseType: !5, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !398, file: !133, line: 200, baseType: !5, size: 32, offset: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !398, file: !133, line: 200, baseType: !319, size: 64, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !383, file: !133, line: 234, baseType: !392, size: 64, offset: 256)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !375, file: !133, line: 197, baseType: !368, size: 64, offset: 256)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !301, file: !133, line: 319, baseType: !406, size: 256)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !407, line: 52, size: 256, elements: !408)
!407 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!408 = !{!409, !410, !411, !412, !413, !414, !415}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !406, file: !407, line: 56, baseType: !5, size: 2, flags: DIFlagBitField, extraData: i64 0)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !406, file: !407, line: 57, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !406, file: !407, line: 58, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !406, file: !407, line: 59, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !406, file: !407, line: 60, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !406, file: !407, line: 61, baseType: !5, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !406, file: !407, line: 62, baseType: !416, size: 192, offset: 64)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 192, elements: !379)
!417 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !301, file: !133, line: 320, baseType: !419, size: 192)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !420, line: 27, size: 192, elements: !421)
!420 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!421 = !{!422, !429}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !419, file: !420, line: 29, baseType: !423, size: 128)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !424, line: 58, baseType: !425)
!424 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !424, line: 54, size: 128, elements: !426)
!426 = !{!427, !428}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !425, file: !424, line: 56, baseType: !417, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !425, file: !424, line: 57, baseType: !368, size: 64, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !419, file: !420, line: 30, baseType: !3, size: 32, offset: 128)
!430 = !{i32 2, !"Dwarf Version", i32 4}
!431 = !{i32 2, !"Debug Info Version", i32 3}
!432 = !{i32 1, !"wchar_size", i32 4}
!433 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!434 = distinct !DISubprogram(name: "vprintf", scope: !435, file: !435, line: 39, type: !436, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !446)
!435 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!436 = !DISubroutineType(types: !437)
!437 = !{!278, !438, !439}
!438 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !283)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, elements: !441)
!441 = !{!442, !443, !444, !445}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !440, file: !1, baseType: !5, size: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !440, file: !1, baseType: !5, size: 32, offset: 32)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !440, file: !1, baseType: !282, size: 64, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !440, file: !1, baseType: !282, size: 64, offset: 128)
!446 = !{!447, !448}
!447 = !DILocalVariable(name: "__fmt", arg: 1, scope: !434, file: !435, line: 39, type: !438)
!448 = !DILocalVariable(name: "__arg", arg: 2, scope: !434, file: !435, line: 39, type: !439)
!449 = !DILocation(line: 0, scope: !434)
!450 = !DILocation(line: 41, column: 20, scope: !434)
!451 = !DILocation(line: 41, column: 10, scope: !434)
!452 = !DILocation(line: 41, column: 3, scope: !434)
!453 = distinct !DISubprogram(name: "getchar", scope: !435, file: !435, line: 47, type: !454, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !456)
!454 = !DISubroutineType(types: !455)
!455 = !{!278}
!456 = !{}
!457 = !DILocation(line: 49, column: 16, scope: !453)
!458 = !DILocation(line: 49, column: 10, scope: !453)
!459 = !DILocation(line: 49, column: 3, scope: !453)
!460 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !435, file: !435, line: 56, type: !461, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !518)
!461 = !DISubroutineType(types: !462)
!462 = !{!278, !463}
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !465, line: 7, baseType: !466)
!465 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !467, line: 49, size: 1728, elements: !468)
!467 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!468 = !{!469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !484, !486, !487, !488, !491, !493, !495, !497, !500, !502, !505, !508, !509, !510, !513, !514}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !466, file: !467, line: 51, baseType: !278, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !466, file: !467, line: 54, baseType: !280, size: 64, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !466, file: !467, line: 55, baseType: !280, size: 64, offset: 128)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !466, file: !467, line: 56, baseType: !280, size: 64, offset: 192)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !466, file: !467, line: 57, baseType: !280, size: 64, offset: 256)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !466, file: !467, line: 58, baseType: !280, size: 64, offset: 320)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !466, file: !467, line: 59, baseType: !280, size: 64, offset: 384)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !466, file: !467, line: 60, baseType: !280, size: 64, offset: 448)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !466, file: !467, line: 61, baseType: !280, size: 64, offset: 512)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !466, file: !467, line: 64, baseType: !280, size: 64, offset: 576)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !466, file: !467, line: 65, baseType: !280, size: 64, offset: 640)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !466, file: !467, line: 66, baseType: !280, size: 64, offset: 704)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !466, file: !467, line: 68, baseType: !482, size: 64, offset: 768)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !467, line: 36, flags: DIFlagFwdDecl)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !466, file: !467, line: 70, baseType: !485, size: 64, offset: 832)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !466, file: !467, line: 72, baseType: !278, size: 32, offset: 896)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !466, file: !467, line: 73, baseType: !278, size: 32, offset: 928)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !466, file: !467, line: 74, baseType: !489, size: 64, offset: 960)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !490, line: 152, baseType: !368)
!490 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!491 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !466, file: !467, line: 77, baseType: !492, size: 16, offset: 1024)
!492 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !466, file: !467, line: 78, baseType: !494, size: 8, offset: 1040)
!494 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !466, file: !467, line: 79, baseType: !496, size: 8, offset: 1048)
!496 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, size: 8, elements: !320)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !466, file: !467, line: 81, baseType: !498, size: 64, offset: 1088)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !467, line: 43, baseType: null)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !466, file: !467, line: 89, baseType: !501, size: 64, offset: 1152)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !490, line: 153, baseType: !368)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !466, file: !467, line: 91, baseType: !503, size: 64, offset: 1216)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !467, line: 37, flags: DIFlagFwdDecl)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !466, file: !467, line: 92, baseType: !506, size: 64, offset: 1280)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !467, line: 38, flags: DIFlagFwdDecl)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !466, file: !467, line: 93, baseType: !485, size: 64, offset: 1344)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !466, file: !467, line: 94, baseType: !282, size: 64, offset: 1408)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !466, file: !467, line: 95, baseType: !511, size: 64, offset: 1472)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !512, line: 46, baseType: !417)
!512 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!513 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !466, file: !467, line: 96, baseType: !278, size: 32, offset: 1536)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !466, file: !467, line: 98, baseType: !515, size: 160, offset: 1568)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, size: 160, elements: !516)
!516 = !{!517}
!517 = !DISubrange(count: 20)
!518 = !{!519}
!519 = !DILocalVariable(name: "__fp", arg: 1, scope: !460, file: !435, line: 56, type: !463)
!520 = !DILocation(line: 0, scope: !460)
!521 = !DILocation(line: 58, column: 10, scope: !460)
!522 = !DILocation(line: 58, column: 3, scope: !460)
!523 = distinct !DISubprogram(name: "getc_unlocked", scope: !435, file: !435, line: 66, type: !461, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !524)
!524 = !{!525}
!525 = !DILocalVariable(name: "__fp", arg: 1, scope: !523, file: !435, line: 66, type: !463)
!526 = !DILocation(line: 0, scope: !523)
!527 = !DILocation(line: 68, column: 10, scope: !523)
!528 = !DILocation(line: 68, column: 3, scope: !523)
!529 = distinct !DISubprogram(name: "getchar_unlocked", scope: !435, file: !435, line: 73, type: !454, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !456)
!530 = !DILocation(line: 75, column: 10, scope: !529)
!531 = !DILocation(line: 75, column: 3, scope: !529)
!532 = distinct !DISubprogram(name: "putchar", scope: !435, file: !435, line: 82, type: !533, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !535)
!533 = !DISubroutineType(types: !534)
!534 = !{!278, !278}
!535 = !{!536}
!536 = !DILocalVariable(name: "__c", arg: 1, scope: !532, file: !435, line: 82, type: !278)
!537 = !DILocation(line: 0, scope: !532)
!538 = !DILocation(line: 84, column: 21, scope: !532)
!539 = !DILocation(line: 84, column: 10, scope: !532)
!540 = !DILocation(line: 84, column: 3, scope: !532)
!541 = distinct !DISubprogram(name: "fputc_unlocked", scope: !435, file: !435, line: 91, type: !542, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !544)
!542 = !DISubroutineType(types: !543)
!543 = !{!278, !278, !463}
!544 = !{!545, !546}
!545 = !DILocalVariable(name: "__c", arg: 1, scope: !541, file: !435, line: 91, type: !278)
!546 = !DILocalVariable(name: "__stream", arg: 2, scope: !541, file: !435, line: 91, type: !463)
!547 = !DILocation(line: 0, scope: !541)
!548 = !DILocation(line: 93, column: 10, scope: !541)
!549 = !DILocation(line: 93, column: 3, scope: !541)
!550 = distinct !DISubprogram(name: "putc_unlocked", scope: !435, file: !435, line: 101, type: !542, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !551)
!551 = !{!552, !553}
!552 = !DILocalVariable(name: "__c", arg: 1, scope: !550, file: !435, line: 101, type: !278)
!553 = !DILocalVariable(name: "__stream", arg: 2, scope: !550, file: !435, line: 101, type: !463)
!554 = !DILocation(line: 0, scope: !550)
!555 = !DILocation(line: 103, column: 10, scope: !550)
!556 = !DILocation(line: 103, column: 3, scope: !550)
!557 = distinct !DISubprogram(name: "putchar_unlocked", scope: !435, file: !435, line: 108, type: !533, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !558)
!558 = !{!559}
!559 = !DILocalVariable(name: "__c", arg: 1, scope: !557, file: !435, line: 108, type: !278)
!560 = !DILocation(line: 0, scope: !557)
!561 = !DILocation(line: 110, column: 10, scope: !557)
!562 = !DILocation(line: 110, column: 3, scope: !557)
!563 = distinct !DISubprogram(name: "getline", scope: !435, file: !435, line: 118, type: !564, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !568)
!564 = !DISubroutineType(types: !565)
!565 = !{!566, !279, !567, !463}
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !490, line: 193, baseType: !368)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!568 = !{!569, !570, !571}
!569 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !563, file: !435, line: 118, type: !279)
!570 = !DILocalVariable(name: "__n", arg: 2, scope: !563, file: !435, line: 118, type: !567)
!571 = !DILocalVariable(name: "__stream", arg: 3, scope: !563, file: !435, line: 118, type: !463)
!572 = !DILocation(line: 0, scope: !563)
!573 = !DILocation(line: 120, column: 10, scope: !563)
!574 = !DILocation(line: 120, column: 3, scope: !563)
!575 = distinct !DISubprogram(name: "feof_unlocked", scope: !435, file: !435, line: 128, type: !461, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !576)
!576 = !{!577}
!577 = !DILocalVariable(name: "__stream", arg: 1, scope: !575, file: !435, line: 128, type: !463)
!578 = !DILocation(line: 0, scope: !575)
!579 = !DILocation(line: 130, column: 10, scope: !575)
!580 = !DILocation(line: 130, column: 3, scope: !575)
!581 = distinct !DISubprogram(name: "ferror_unlocked", scope: !435, file: !435, line: 135, type: !461, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !582)
!582 = !{!583}
!583 = !DILocalVariable(name: "__stream", arg: 1, scope: !581, file: !435, line: 135, type: !463)
!584 = !DILocation(line: 0, scope: !581)
!585 = !DILocation(line: 137, column: 10, scope: !581)
!586 = !DILocation(line: 137, column: 3, scope: !581)
!587 = distinct !DISubprogram(name: "tolower", scope: !588, file: !588, line: 207, type: !533, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !589)
!588 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!589 = !{!590}
!590 = !DILocalVariable(name: "__c", arg: 1, scope: !587, file: !588, line: 207, type: !278)
!591 = !DILocation(line: 0, scope: !587)
!592 = !DILocation(line: 209, column: 22, scope: !587)
!593 = !DILocation(line: 209, column: 39, scope: !587)
!594 = !DILocation(line: 209, column: 38, scope: !587)
!595 = !DILocation(line: 209, column: 37, scope: !587)
!596 = !DILocation(line: 209, column: 10, scope: !587)
!597 = !DILocation(line: 209, column: 3, scope: !587)
!598 = distinct !DISubprogram(name: "toupper", scope: !588, file: !588, line: 213, type: !533, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !599)
!599 = !{!600}
!600 = !DILocalVariable(name: "__c", arg: 1, scope: !598, file: !588, line: 213, type: !278)
!601 = !DILocation(line: 0, scope: !598)
!602 = !DILocation(line: 215, column: 22, scope: !598)
!603 = !DILocation(line: 215, column: 39, scope: !598)
!604 = !DILocation(line: 215, column: 38, scope: !598)
!605 = !DILocation(line: 215, column: 37, scope: !598)
!606 = !DILocation(line: 215, column: 10, scope: !598)
!607 = !DILocation(line: 215, column: 3, scope: !598)
!608 = distinct !DISubprogram(name: "atoi", scope: !609, file: !609, line: 361, type: !610, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !612)
!609 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!610 = !DISubroutineType(types: !611)
!611 = !{!278, !283}
!612 = !{!613}
!613 = !DILocalVariable(name: "__nptr", arg: 1, scope: !608, file: !609, line: 361, type: !283)
!614 = !DILocation(line: 0, scope: !608)
!615 = !DILocation(line: 363, column: 16, scope: !608)
!616 = !DILocation(line: 363, column: 10, scope: !608)
!617 = !DILocation(line: 363, column: 3, scope: !608)
!618 = distinct !DISubprogram(name: "atol", scope: !609, file: !609, line: 366, type: !619, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !621)
!619 = !DISubroutineType(types: !620)
!620 = !{!368, !283}
!621 = !{!622}
!622 = !DILocalVariable(name: "__nptr", arg: 1, scope: !618, file: !609, line: 366, type: !283)
!623 = !DILocation(line: 0, scope: !618)
!624 = !DILocation(line: 368, column: 10, scope: !618)
!625 = !DILocation(line: 368, column: 3, scope: !618)
!626 = distinct !DISubprogram(name: "atoll", scope: !609, file: !609, line: 373, type: !627, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !630)
!627 = !DISubroutineType(types: !628)
!628 = !{!629, !283}
!629 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!630 = !{!631}
!631 = !DILocalVariable(name: "__nptr", arg: 1, scope: !626, file: !609, line: 373, type: !283)
!632 = !DILocation(line: 0, scope: !626)
!633 = !DILocation(line: 375, column: 10, scope: !626)
!634 = !DILocation(line: 375, column: 3, scope: !626)
!635 = distinct !DISubprogram(name: "bsearch", scope: !636, file: !636, line: 20, type: !637, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !645)
!636 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!637 = !DISubroutineType(types: !638)
!638 = !{!282, !639, !639, !511, !511, !641}
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !609, line: 808, baseType: !642)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DISubroutineType(types: !644)
!644 = !{!278, !639, !639}
!645 = !{!646, !647, !648, !649, !650, !651, !652, !653, !654, !655}
!646 = !DILocalVariable(name: "__key", arg: 1, scope: !635, file: !636, line: 20, type: !639)
!647 = !DILocalVariable(name: "__base", arg: 2, scope: !635, file: !636, line: 20, type: !639)
!648 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !635, file: !636, line: 20, type: !511)
!649 = !DILocalVariable(name: "__size", arg: 4, scope: !635, file: !636, line: 20, type: !511)
!650 = !DILocalVariable(name: "__compar", arg: 5, scope: !635, file: !636, line: 21, type: !641)
!651 = !DILocalVariable(name: "__l", scope: !635, file: !636, line: 23, type: !511)
!652 = !DILocalVariable(name: "__u", scope: !635, file: !636, line: 23, type: !511)
!653 = !DILocalVariable(name: "__idx", scope: !635, file: !636, line: 23, type: !511)
!654 = !DILocalVariable(name: "__p", scope: !635, file: !636, line: 24, type: !639)
!655 = !DILocalVariable(name: "__comparison", scope: !635, file: !636, line: 25, type: !278)
!656 = !DILocation(line: 0, scope: !635)
!657 = !DILocation(line: 29, column: 3, scope: !635)
!658 = !DILocation(line: 27, column: 7, scope: !635)
!659 = !DILocation(line: 29, column: 14, scope: !635)
!660 = !DILocation(line: 31, column: 20, scope: !661)
!661 = distinct !DILexicalBlock(scope: !635, file: !636, line: 30, column: 5)
!662 = !DILocation(line: 31, column: 27, scope: !661)
!663 = !DILocation(line: 32, column: 56, scope: !661)
!664 = !DILocation(line: 32, column: 47, scope: !661)
!665 = !DILocation(line: 33, column: 22, scope: !661)
!666 = !DILocation(line: 34, column: 24, scope: !667)
!667 = distinct !DILexicalBlock(scope: !661, file: !636, line: 34, column: 11)
!668 = !DILocation(line: 34, column: 11, scope: !661)
!669 = !DILocation(line: 36, column: 29, scope: !670)
!670 = distinct !DILexicalBlock(scope: !667, file: !636, line: 36, column: 16)
!671 = !DILocation(line: 36, column: 16, scope: !667)
!672 = !DILocation(line: 37, column: 14, scope: !670)
!673 = distinct !{!673, !657, !674}
!674 = !DILocation(line: 40, column: 5, scope: !635)
!675 = !DILocation(line: 43, column: 1, scope: !635)
!676 = distinct !DISubprogram(name: "atof", scope: !677, file: !677, line: 25, type: !678, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !681)
!677 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!678 = !DISubroutineType(types: !679)
!679 = !{!680, !283}
!680 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!681 = !{!682}
!682 = !DILocalVariable(name: "__nptr", arg: 1, scope: !676, file: !677, line: 25, type: !283)
!683 = !DILocation(line: 0, scope: !676)
!684 = !DILocation(line: 27, column: 10, scope: !676)
!685 = !DILocation(line: 27, column: 3, scope: !676)
!686 = distinct !DISubprogram(name: "strtoimax", scope: !687, file: !687, line: 324, type: !688, scopeLine: 326, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !694)
!687 = !DIFile(filename: "/usr/include/inttypes.h", directory: "")
!688 = !DISubroutineType(types: !689)
!689 = !{!690, !438, !693, !278}
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !691, line: 101, baseType: !692)
!691 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !490, line: 72, baseType: !368)
!693 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !279)
!694 = !{!695, !696, !697}
!695 = !DILocalVariable(name: "nptr", arg: 1, scope: !686, file: !687, line: 324, type: !438)
!696 = !DILocalVariable(name: "endptr", arg: 2, scope: !686, file: !687, line: 324, type: !693)
!697 = !DILocalVariable(name: "base", arg: 3, scope: !686, file: !687, line: 324, type: !278)
!698 = !DILocation(line: 0, scope: !686)
!699 = !DILocation(line: 327, column: 10, scope: !686)
!700 = !DILocation(line: 327, column: 3, scope: !686)
!701 = distinct !DISubprogram(name: "strtoumax", scope: !687, file: !687, line: 336, type: !702, scopeLine: 338, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !706)
!702 = !DISubroutineType(types: !703)
!703 = !{!704, !438, !693, !278}
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !691, line: 102, baseType: !705)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !490, line: 73, baseType: !417)
!706 = !{!707, !708, !709}
!707 = !DILocalVariable(name: "nptr", arg: 1, scope: !701, file: !687, line: 336, type: !438)
!708 = !DILocalVariable(name: "endptr", arg: 2, scope: !701, file: !687, line: 336, type: !693)
!709 = !DILocalVariable(name: "base", arg: 3, scope: !701, file: !687, line: 336, type: !278)
!710 = !DILocation(line: 0, scope: !701)
!711 = !DILocation(line: 339, column: 10, scope: !701)
!712 = !DILocation(line: 339, column: 3, scope: !701)
!713 = distinct !DISubprogram(name: "wcstoimax", scope: !687, file: !687, line: 348, type: !714, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !723)
!714 = !DISubroutineType(types: !715)
!715 = !{!690, !716, !720, !278}
!716 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !717)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !719)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gwchar_t", file: !687, line: 34, baseType: !278)
!720 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !721)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!723 = !{!724, !725, !726}
!724 = !DILocalVariable(name: "nptr", arg: 1, scope: !713, file: !687, line: 348, type: !716)
!725 = !DILocalVariable(name: "endptr", arg: 2, scope: !713, file: !687, line: 348, type: !720)
!726 = !DILocalVariable(name: "base", arg: 3, scope: !713, file: !687, line: 348, type: !278)
!727 = !DILocation(line: 0, scope: !713)
!728 = !DILocation(line: 351, column: 10, scope: !713)
!729 = !DILocation(line: 351, column: 3, scope: !713)
!730 = distinct !DISubprogram(name: "wcstoumax", scope: !687, file: !687, line: 362, type: !731, scopeLine: 364, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !733)
!731 = !DISubroutineType(types: !732)
!732 = !{!704, !716, !720, !278}
!733 = !{!734, !735, !736}
!734 = !DILocalVariable(name: "nptr", arg: 1, scope: !730, file: !687, line: 362, type: !716)
!735 = !DILocalVariable(name: "endptr", arg: 2, scope: !730, file: !687, line: 362, type: !720)
!736 = !DILocalVariable(name: "base", arg: 3, scope: !730, file: !687, line: 362, type: !278)
!737 = !DILocation(line: 0, scope: !730)
!738 = !DILocation(line: 365, column: 10, scope: !730)
!739 = !DILocation(line: 365, column: 3, scope: !730)
!740 = distinct !DISubprogram(name: "stat", scope: !741, file: !741, line: 453, type: !742, scopeLine: 454, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !779)
!741 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "")
!742 = !DISubroutineType(types: !743)
!743 = !{!278, !283, !744}
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !746, line: 46, size: 1152, elements: !747)
!746 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!747 = !{!748, !750, !752, !754, !756, !758, !760, !761, !762, !763, !765, !767, !775, !776, !777}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !745, file: !746, line: 48, baseType: !749, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !490, line: 145, baseType: !417)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !745, file: !746, line: 53, baseType: !751, size: 64, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !490, line: 148, baseType: !417)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !745, file: !746, line: 61, baseType: !753, size: 64, offset: 128)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !490, line: 151, baseType: !417)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !745, file: !746, line: 62, baseType: !755, size: 32, offset: 192)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !490, line: 150, baseType: !5)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !745, file: !746, line: 64, baseType: !757, size: 32, offset: 224)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !490, line: 146, baseType: !5)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !745, file: !746, line: 65, baseType: !759, size: 32, offset: 256)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !490, line: 147, baseType: !5)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !745, file: !746, line: 67, baseType: !278, size: 32, offset: 288)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !745, file: !746, line: 69, baseType: !749, size: 64, offset: 320)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !745, file: !746, line: 74, baseType: !489, size: 64, offset: 384)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !745, file: !746, line: 78, baseType: !764, size: 64, offset: 448)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !490, line: 174, baseType: !368)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !745, file: !746, line: 80, baseType: !766, size: 64, offset: 512)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !490, line: 179, baseType: !368)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !745, file: !746, line: 91, baseType: !768, size: 128, offset: 576)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !769, line: 10, size: 128, elements: !770)
!769 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!770 = !{!771, !773}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !768, file: !769, line: 12, baseType: !772, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !490, line: 160, baseType: !368)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !768, file: !769, line: 16, baseType: !774, size: 64, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !490, line: 196, baseType: !368)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !745, file: !746, line: 92, baseType: !768, size: 128, offset: 704)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !745, file: !746, line: 93, baseType: !768, size: 128, offset: 832)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !745, file: !746, line: 106, baseType: !778, size: 192, offset: 960)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !774, size: 192, elements: !379)
!779 = !{!780, !781}
!780 = !DILocalVariable(name: "__path", arg: 1, scope: !740, file: !741, line: 453, type: !283)
!781 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !740, file: !741, line: 453, type: !744)
!782 = !DILocation(line: 0, scope: !740)
!783 = !DILocation(line: 455, column: 10, scope: !740)
!784 = !DILocation(line: 455, column: 3, scope: !740)
!785 = distinct !DISubprogram(name: "lstat", scope: !741, file: !741, line: 460, type: !742, scopeLine: 461, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !786)
!786 = !{!787, !788}
!787 = !DILocalVariable(name: "__path", arg: 1, scope: !785, file: !741, line: 460, type: !283)
!788 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !785, file: !741, line: 460, type: !744)
!789 = !DILocation(line: 0, scope: !785)
!790 = !DILocation(line: 462, column: 10, scope: !785)
!791 = !DILocation(line: 462, column: 3, scope: !785)
!792 = distinct !DISubprogram(name: "fstat", scope: !741, file: !741, line: 467, type: !793, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !795)
!793 = !DISubroutineType(types: !794)
!794 = !{!278, !278, !744}
!795 = !{!796, !797}
!796 = !DILocalVariable(name: "__fd", arg: 1, scope: !792, file: !741, line: 467, type: !278)
!797 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !792, file: !741, line: 467, type: !744)
!798 = !DILocation(line: 0, scope: !792)
!799 = !DILocation(line: 469, column: 10, scope: !792)
!800 = !DILocation(line: 469, column: 3, scope: !792)
!801 = distinct !DISubprogram(name: "fstatat", scope: !741, file: !741, line: 474, type: !802, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !804)
!802 = !DISubroutineType(types: !803)
!803 = !{!278, !278, !283, !744, !278}
!804 = !{!805, !806, !807, !808}
!805 = !DILocalVariable(name: "__fd", arg: 1, scope: !801, file: !741, line: 474, type: !278)
!806 = !DILocalVariable(name: "__filename", arg: 2, scope: !801, file: !741, line: 474, type: !283)
!807 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !801, file: !741, line: 474, type: !744)
!808 = !DILocalVariable(name: "__flag", arg: 4, scope: !801, file: !741, line: 474, type: !278)
!809 = !DILocation(line: 0, scope: !801)
!810 = !DILocation(line: 477, column: 10, scope: !801)
!811 = !DILocation(line: 477, column: 3, scope: !801)
!812 = distinct !DISubprogram(name: "mknod", scope: !741, file: !741, line: 483, type: !813, scopeLine: 484, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !815)
!813 = !DISubroutineType(types: !814)
!814 = !{!278, !283, !755, !749}
!815 = !{!816, !817, !818}
!816 = !DILocalVariable(name: "__path", arg: 1, scope: !812, file: !741, line: 483, type: !283)
!817 = !DILocalVariable(name: "__mode", arg: 2, scope: !812, file: !741, line: 483, type: !755)
!818 = !DILocalVariable(name: "__dev", arg: 3, scope: !812, file: !741, line: 483, type: !749)
!819 = !DILocation(line: 0, scope: !812)
!820 = !DILocation(line: 485, column: 10, scope: !812)
!821 = !DILocation(line: 485, column: 3, scope: !812)
!822 = distinct !DISubprogram(name: "mknodat", scope: !741, file: !741, line: 491, type: !823, scopeLine: 493, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !825)
!823 = !DISubroutineType(types: !824)
!824 = !{!278, !278, !283, !755, !749}
!825 = !{!826, !827, !828, !829}
!826 = !DILocalVariable(name: "__fd", arg: 1, scope: !822, file: !741, line: 491, type: !278)
!827 = !DILocalVariable(name: "__path", arg: 2, scope: !822, file: !741, line: 491, type: !283)
!828 = !DILocalVariable(name: "__mode", arg: 3, scope: !822, file: !741, line: 491, type: !755)
!829 = !DILocalVariable(name: "__dev", arg: 4, scope: !822, file: !741, line: 491, type: !749)
!830 = !DILocation(line: 0, scope: !822)
!831 = !DILocation(line: 494, column: 10, scope: !822)
!832 = !DILocation(line: 494, column: 3, scope: !822)
!833 = distinct !DISubprogram(name: "stat64", scope: !741, file: !741, line: 502, type: !834, scopeLine: 503, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !856)
!834 = !DISubroutineType(types: !835)
!835 = !{!278, !283, !836}
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !746, line: 119, size: 1152, elements: !838)
!838 = !{!839, !840, !842, !843, !844, !845, !846, !847, !848, !849, !850, !852, !853, !854, !855}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !837, file: !746, line: 121, baseType: !749, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !837, file: !746, line: 123, baseType: !841, size: 64, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !490, line: 149, baseType: !417)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !837, file: !746, line: 124, baseType: !753, size: 64, offset: 128)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !837, file: !746, line: 125, baseType: !755, size: 32, offset: 192)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !837, file: !746, line: 132, baseType: !757, size: 32, offset: 224)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !837, file: !746, line: 133, baseType: !759, size: 32, offset: 256)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !837, file: !746, line: 135, baseType: !278, size: 32, offset: 288)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !837, file: !746, line: 136, baseType: !749, size: 64, offset: 320)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !837, file: !746, line: 137, baseType: !489, size: 64, offset: 384)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !837, file: !746, line: 143, baseType: !764, size: 64, offset: 448)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !837, file: !746, line: 144, baseType: !851, size: 64, offset: 512)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !490, line: 180, baseType: !368)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !837, file: !746, line: 152, baseType: !768, size: 128, offset: 576)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !837, file: !746, line: 153, baseType: !768, size: 128, offset: 704)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !837, file: !746, line: 154, baseType: !768, size: 128, offset: 832)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !837, file: !746, line: 164, baseType: !778, size: 192, offset: 960)
!856 = !{!857, !858}
!857 = !DILocalVariable(name: "__path", arg: 1, scope: !833, file: !741, line: 502, type: !283)
!858 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !833, file: !741, line: 502, type: !836)
!859 = !DILocation(line: 0, scope: !833)
!860 = !DILocation(line: 504, column: 10, scope: !833)
!861 = !DILocation(line: 504, column: 3, scope: !833)
!862 = distinct !DISubprogram(name: "lstat64", scope: !741, file: !741, line: 509, type: !834, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !863)
!863 = !{!864, !865}
!864 = !DILocalVariable(name: "__path", arg: 1, scope: !862, file: !741, line: 509, type: !283)
!865 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !862, file: !741, line: 509, type: !836)
!866 = !DILocation(line: 0, scope: !862)
!867 = !DILocation(line: 511, column: 10, scope: !862)
!868 = !DILocation(line: 511, column: 3, scope: !862)
!869 = distinct !DISubprogram(name: "fstat64", scope: !741, file: !741, line: 516, type: !870, scopeLine: 517, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !872)
!870 = !DISubroutineType(types: !871)
!871 = !{!278, !278, !836}
!872 = !{!873, !874}
!873 = !DILocalVariable(name: "__fd", arg: 1, scope: !869, file: !741, line: 516, type: !278)
!874 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !869, file: !741, line: 516, type: !836)
!875 = !DILocation(line: 0, scope: !869)
!876 = !DILocation(line: 518, column: 10, scope: !869)
!877 = !DILocation(line: 518, column: 3, scope: !869)
!878 = distinct !DISubprogram(name: "fstatat64", scope: !741, file: !741, line: 523, type: !879, scopeLine: 525, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !881)
!879 = !DISubroutineType(types: !880)
!880 = !{!278, !278, !283, !836, !278}
!881 = !{!882, !883, !884, !885}
!882 = !DILocalVariable(name: "__fd", arg: 1, scope: !878, file: !741, line: 523, type: !278)
!883 = !DILocalVariable(name: "__filename", arg: 2, scope: !878, file: !741, line: 523, type: !283)
!884 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !878, file: !741, line: 523, type: !836)
!885 = !DILocalVariable(name: "__flag", arg: 4, scope: !878, file: !741, line: 523, type: !278)
!886 = !DILocation(line: 0, scope: !878)
!887 = !DILocation(line: 526, column: 10, scope: !878)
!888 = !DILocation(line: 526, column: 3, scope: !878)
!889 = distinct !DISubprogram(name: "gen_rtx_fmt_0_stat", scope: !1, file: !1, line: 12, type: !890, scopeLine: 13, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !892)
!890 = !DISubroutineType(types: !891)
!891 = !{!285, !132, !3}
!892 = !{!893, !894, !895}
!893 = !DILocalVariable(name: "code", arg: 1, scope: !889, file: !1, line: 12, type: !132)
!894 = !DILocalVariable(name: "mode", arg: 2, scope: !889, file: !1, line: 12, type: !3)
!895 = !DILocalVariable(name: "rt", scope: !889, file: !1, line: 14, type: !285)
!896 = !DILocation(line: 0, scope: !889)
!897 = !DILocation(line: 15, column: 8, scope: !889)
!898 = !DILocation(line: 17, column: 3, scope: !889)
!899 = !DILocation(line: 18, column: 3, scope: !889)
!900 = !DILocation(line: 18, column: 17, scope: !889)
!901 = !DILocation(line: 20, column: 3, scope: !889)
!902 = distinct !DISubprogram(name: "gen_rtx_fmt_ee_stat", scope: !1, file: !1, line: 24, type: !903, scopeLine: 27, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !905)
!903 = !DISubroutineType(types: !904)
!904 = !{!285, !132, !3, !285, !285}
!905 = !{!906, !907, !908, !909, !910}
!906 = !DILocalVariable(name: "code", arg: 1, scope: !902, file: !1, line: 24, type: !132)
!907 = !DILocalVariable(name: "mode", arg: 2, scope: !902, file: !1, line: 24, type: !3)
