; ModuleID = 'getpwd.bc'
source_filename = "getpwd.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.stat64 = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stdout = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@stdin = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@getpwd.pwd = internal unnamed_addr global i8* null, align 8, !dbg !0
@getpwd.failure_errno = internal unnamed_addr global i32 0, align 4, !dbg !19
@.str = private unnamed_addr constant [4 x i8] c"PWD\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c".\00", align 1

; Function Attrs: inlinehint nounwind uwtable
define dso_local i32 @atoi(i8* %__nptr) local_unnamed_addr #0 !dbg !80 {
entry:

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "pwd", scope: !2, file: !3, line: 73, type: !6, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "getpwd", scope: !3, file: !3, line: 71, type: !4, scopeLine: 72, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !8, retainedNodes: !21)
!3 = !DIFile(filename: "getpwd.c", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!4 = !DISubroutineType(types: !5)
!5 = !{!6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!8 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !9, retainedTypes: !10, globals: !18, nameTableKind: None)
!9 = !{}
!10 = !{!11, !12, !13, !14, !16, !17, !6}
!11 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!18 = !{!0, !19}
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "failure_errno", scope: !2, file: !3, line: 74, type: !11, isLocal: true, isDefinition: true)
!21 = !{!22, !23, !27, !68, !69}
!22 = !DILocalVariable(name: "p", scope: !2, file: !3, line: 76, type: !6)
!23 = !DILocalVariable(name: "s", scope: !2, file: !3, line: 77, type: !24)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !25, line: 46, baseType: !26)
!25 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!26 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!27 = !DILocalVariable(name: "dotstat", scope: !2, file: !3, line: 78, type: !28)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !29, line: 46, size: 1152, elements: !30)
!29 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!30 = !{!31, !34, !36, !38, !41, !43, !45, !46, !47, !50, !52, !54, !62, !63, !64}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !28, file: !29, line: 48, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !33, line: 145, baseType: !26)
!33 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!34 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !28, file: !29, line: 53, baseType: !35, size: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !33, line: 148, baseType: !26)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !28, file: !29, line: 61, baseType: !37, size: 64, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !33, line: 151, baseType: !26)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !28, file: !29, line: 62, baseType: !39, size: 32, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !33, line: 150, baseType: !40)
!40 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !28, file: !29, line: 64, baseType: !42, size: 32, offset: 224)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !33, line: 146, baseType: !40)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !28, file: !29, line: 65, baseType: !44, size: 32, offset: 256)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !33, line: 147, baseType: !40)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !28, file: !29, line: 67, baseType: !11, size: 32, offset: 288)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !28, file: !29, line: 69, baseType: !32, size: 64, offset: 320)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !28, file: !29, line: 74, baseType: !48, size: 64, offset: 384)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !33, line: 152, baseType: !49)
!49 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !28, file: !29, line: 78, baseType: !51, size: 64, offset: 448)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !33, line: 174, baseType: !49)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !28, file: !29, line: 80, baseType: !53, size: 64, offset: 512)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !33, line: 179, baseType: !49)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !28, file: !29, line: 91, baseType: !55, size: 128, offset: 576)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !56, line: 10, size: 128, elements: !57)
!56 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!57 = !{!58, !60}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !55, file: !56, line: 12, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !33, line: 160, baseType: !49)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !55, file: !56, line: 16, baseType: !61, size: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !33, line: 196, baseType: !49)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !28, file: !29, line: 92, baseType: !55, size: 128, offset: 704)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !28, file: !29, line: 93, baseType: !55, size: 128, offset: 832)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !28, file: !29, line: 106, baseType: !65, size: 192, offset: 960)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 192, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 3)
!68 = !DILocalVariable(name: "pwdstat", scope: !2, file: !3, line: 78, type: !28)
!69 = !DILocalVariable(name: "e", scope: !70, file: !3, line: 92, type: !11)
!70 = distinct !DILexicalBlock(scope: !71, file: !3, line: 91, column: 4)
!71 = distinct !DILexicalBlock(scope: !72, file: !3, line: 90, column: 2)
!72 = distinct !DILexicalBlock(scope: !73, file: !3, line: 90, column: 2)
!73 = distinct !DILexicalBlock(scope: !74, file: !3, line: 82, column: 11)
!74 = distinct !DILexicalBlock(scope: !75, file: !3, line: 81, column: 5)
!75 = distinct !DILexicalBlock(scope: !2, file: !3, line: 80, column: 7)
!76 = !{i32 2, !"Dwarf Version", i32 4}
!77 = !{i32 2, !"Debug Info Version", i32 3}
!78 = !{i32 1, !"wchar_size", i32 4}
!79 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!80 = distinct !DISubprogram(name: "atoi", scope: !81, file: !81, line: 361, type: !82, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !8, retainedNodes: !84)
!81 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!82 = !DISubroutineType(types: !83)
!83 = !{!11, !14}
!84 = !{!85}
!85 = !DILocalVariable(name: "__nptr", arg: 1, scope: !80, file: !81, line: 361, type: !14)
!86 = !DILocation(line: 0, scope: !80)
!87 = !DILocation(line: 363, column: 16, scope: !80)
!88 = !DILocation(line: 363, column: 10, scope: !80)
!89 = !DILocation(line: 363, column: 3, scope: !80)
!90 = distinct !DISubprogram(name: "atol", scope: !81, file: !81, line: 366, type: !91, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !8, retainedNodes: !93)
!91 = !DISubroutineType(types: !92)
!92 = !{!49, !14}
!93 = !{!94}
!94 = !DILocalVariable(name: "__nptr", arg: 1, scope: !90, file: !81, line: 366, type: !14)
!95 = !DILocation(line: 0, scope: !90)
!96 = !DILocation(line: 368, column: 10, scope: !90)
!97 = !DILocation(line: 368, column: 3, scope: !90)
!98 = distinct !DISubprogram(name: "atoll", scope: !81, file: !81, line: 373, type: !99, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !8, retainedNodes: !102)
!99 = !DISubroutineType(types: !100)
!100 = !{!101, !14}
!101 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!102 = !{!103}
!103 = !DILocalVariable(name: "__nptr", arg: 1, scope: !98, file: !81, line: 373, type: !14)
!104 = !DILocation(line: 0, scope: !98)
!105 = !DILocation(line: 375, column: 10, scope: !98)
!106 = !DILocation(line: 375, column: 3, scope: !98)
!107 = distinct !DISubprogram(name: "bsearch", scope: !108, file: !108, line: 20, type: !109, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !8, retainedNodes: !117)
!108 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!109 = !DISubroutineType(types: !110)
!110 = !{!13, !111, !111, !24, !24, !113}
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !81, line: 808, baseType: !114)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{!11, !111, !111}
!117 = !{!118, !119, !120, !121, !122, !123, !124, !125, !126, !127}
!118 = !DILocalVariable(name: "__key", arg: 1, scope: !107, file: !108, line: 20, type: !111)
!119 = !DILocalVariable(name: "__base", arg: 2, scope: !107, file: !108, line: 20, type: !111)
!120 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !107, file: !108, line: 20, type: !24)
!121 = !DILocalVariable(name: "__size", arg: 4, scope: !107, file: !108, line: 20, type: !24)
!122 = !DILocalVariable(name: "__compar", arg: 5, scope: !107, file: !108, line: 21, type: !113)
!123 = !DILocalVariable(name: "__l", scope: !107, file: !108, line: 23, type: !24)
!124 = !DILocalVariable(name: "__u", scope: !107, file: !108, line: 23, type: !24)
!125 = !DILocalVariable(name: "__idx", scope: !107, file: !108, line: 23, type: !24)
!126 = !DILocalVariable(name: "__p", scope: !107, file: !108, line: 24, type: !111)
!127 = !DILocalVariable(name: "__comparison", scope: !107, file: !108, line: 25, type: !11)
!128 = !DILocation(line: 0, scope: !107)
!129 = !DILocation(line: 29, column: 3, scope: !107)
!130 = !DILocation(line: 27, column: 7, scope: !107)
!131 = !DILocation(line: 29, column: 14, scope: !107)
!132 = !DILocation(line: 31, column: 20, scope: !133)
!133 = distinct !DILexicalBlock(scope: !107, file: !108, line: 30, column: 5)
!134 = !DILocation(line: 31, column: 27, scope: !133)
!135 = !DILocation(line: 32, column: 56, scope: !133)
!136 = !DILocation(line: 32, column: 47, scope: !133)
!137 = !DILocation(line: 33, column: 22, scope: !133)
!138 = !DILocation(line: 34, column: 24, scope: !139)
!139 = distinct !DILexicalBlock(scope: !133, file: !108, line: 34, column: 11)
!140 = !DILocation(line: 34, column: 11, scope: !133)
!141 = !DILocation(line: 36, column: 29, scope: !142)
!142 = distinct !DILexicalBlock(scope: !139, file: !108, line: 36, column: 16)
!143 = !DILocation(line: 36, column: 16, scope: !139)
!144 = !DILocation(line: 37, column: 14, scope: !142)
!145 = distinct !{!145, !129, !146}
!146 = !DILocation(line: 40, column: 5, scope: !107)
!147 = !DILocation(line: 43, column: 1, scope: !107)
!148 = distinct !DISubprogram(name: "atof", scope: !149, file: !149, line: 25, type: !150, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !8, retainedNodes: !153)
!149 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!150 = !DISubroutineType(types: !151)
!151 = !{!152, !14}
!152 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!153 = !{!154}
!154 = !DILocalVariable(name: "__nptr", arg: 1, scope: !148, file: !149, line: 25, type: !14)
!155 = !DILocation(line: 0, scope: !148)
!156 = !DILocation(line: 27, column: 10, scope: !148)
!157 = !DILocation(line: 27, column: 3, scope: !148)
!158 = distinct !DISubprogram(name: "stat", scope: !159, file: !159, line: 453, type: !160, scopeLine: 454, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !8, retainedNodes: !163)
!159 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "")
!160 = !DISubroutineType(types: !161)
!161 = !{!11, !14, !162}
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!163 = !{!164, !165}
!164 = !DILocalVariable(name: "__path", arg: 1, scope: !158, file: !159, line: 453, type: !14)
!165 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !158, file: !159, line: 453, type: !162)
!166 = !DILocation(line: 0, scope: !158)
!167 = !DILocation(line: 455, column: 10, scope: !158)
!168 = !DILocation(line: 455, column: 3, scope: !158)
!169 = distinct !DISubprogram(name: "lstat", scope: !159, file: !159, line: 460, type: !160, scopeLine: 461, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !8, retainedNodes: !170)
!170 = !{!171, !172}
!171 = !DILocalVariable(name: "__path", arg: 1, scope: !169, file: !159, line: 460, type: !14)
!172 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !169, file: !159, line: 460, type: !162)
!173 = !DILocation(line: 0, scope: !169)
!174 = !DILocation(line: 462, column: 10, scope: !169)
!175 = !DILocation(line: 462, column: 3, scope: !169)
!176 = distinct !DISubprogram(name: "fstat", scope: !159, file: !159, line: 467, type: !177, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !8, retainedNodes: !179)
!177 = !DISubroutineType(types: !178)
!178 = !{!11, !11, !162}
!179 = !{!180, !181}
!180 = !DILocalVariable(name: "__fd", arg: 1, scope: !176, file: !159, line: 467, type: !11)
!181 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !176, file: !159, line: 467, type: !162)
!182 = !DILocation(line: 0, scope: !176)
!183 = !DILocation(line: 469, column: 10, scope: !176)
!184 = !DILocation(line: 469, column: 3, scope: !176)
!185 = distinct !DISubprogram(name: "fstatat", scope: !159, file: !159, line: 474, type: !186, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !8, retainedNodes: !188)
!186 = !DISubroutineType(types: !187)
!187 = !{!11, !11, !14, !162, !11}
!188 = !{!189, !190, !191, !192}
!189 = !DILocalVariable(name: "__fd", arg: 1, scope: !185, file: !159, line: 474, type: !11)
!190 = !DILocalVariable(name: "__filename", arg: 2, scope: !185, file: !159, line: 474, type: !14)
!191 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !185, file: !159, line: 474, type: !162)
!192 = !DILocalVariable(name: "__flag", arg: 4, scope: !185, file: !159, line: 474, type: !11)
!193 = !DILocation(line: 0, scope: !185)
!194 = !DILocation(line: 477, column: 10, scope: !185)
!195 = !DILocation(line: 477, column: 3, scope: !185)
!196 = distinct !DISubprogram(name: "mknod", scope: !159, file: !159, line: 483, type: !197, scopeLine: 484, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !8, retainedNodes: !199)
!197 = !DISubroutineType(types: !198)
!198 = !{!11, !14, !39, !32}
!199 = !{!200, !201, !202}
!200 = !DILocalVariable(name: "__path", arg: 1, scope: !196, file: !159, line: 483, type: !14)
!201 = !DILocalVariable(name: "__mode", arg: 2, scope: !196, file: !159, line: 483, type: !39)
!202 = !DILocalVariable(name: "__dev", arg: 3, scope: !196, file: !159, line: 483, type: !32)
!203 = !DILocation(line: 0, scope: !196)
!204 = !DILocation(line: 485, column: 10, scope: !196)
!205 = !DILocation(line: 485, column: 3, scope: !196)
!206 = distinct !DISubprogram(name: "mknodat", scope: !159, file: !159, line: 491, type: !207, scopeLine: 493, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !8, retainedNodes: !209)
!207 = !DISubroutineType(types: !208)
!208 = !{!11, !11, !14, !39, !32}
!209 = !{!210, !211, !212, !213}
!210 = !DILocalVariable(name: "__fd", arg: 1, scope: !206, file: !159, line: 491, type: !11)
!211 = !DILocalVariable(name: "__path", arg: 2, scope: !206, file: !159, line: 491, type: !14)
!212 = !DILocalVariable(name: "__mode", arg: 3, scope: !206, file: !159, line: 491, type: !39)
!213 = !DILocalVariable(name: "__dev", arg: 4, scope: !206, file: !159, line: 491, type: !32)
!214 = !DILocation(line: 0, scope: !206)
!215 = !DILocation(line: 494, column: 10, scope: !206)
!216 = !DILocation(line: 494, column: 3, scope: !206)
!217 = distinct !DISubprogram(name: "stat64", scope: !159, file: !159, line: 502, type: !218, scopeLine: 503, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !8, retainedNodes: !240)
!218 = !DISubroutineType(types: !219)
!219 = !{!11, !14, !220}
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !29, line: 119, size: 1152, elements: !222)
!222 = !{!223, !224, !226, !227, !228, !229, !230, !231, !232, !233, !234, !236, !237, !238, !239}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !221, file: !29, line: 121, baseType: !32, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !221, file: !29, line: 123, baseType: !225, size: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !33, line: 149, baseType: !26)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !221, file: !29, line: 124, baseType: !37, size: 64, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !221, file: !29, line: 125, baseType: !39, size: 32, offset: 192)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !221, file: !29, line: 132, baseType: !42, size: 32, offset: 224)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !221, file: !29, line: 133, baseType: !44, size: 32, offset: 256)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !221, file: !29, line: 135, baseType: !11, size: 32, offset: 288)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !221, file: !29, line: 136, baseType: !32, size: 64, offset: 320)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !221, file: !29, line: 137, baseType: !48, size: 64, offset: 384)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !221, file: !29, line: 143, baseType: !51, size: 64, offset: 448)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !221, file: !29, line: 144, baseType: !235, size: 64, offset: 512)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !33, line: 180, baseType: !49)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !221, file: !29, line: 152, baseType: !55, size: 128, offset: 576)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !221, file: !29, line: 153, baseType: !55, size: 128, offset: 704)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !221, file: !29, line: 154, baseType: !55, size: 128, offset: 832)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !221, file: !29, line: 164, baseType: !65, size: 192, offset: 960)
!240 = !{!241, !242}
!241 = !DILocalVariable(name: "__path", arg: 1, scope: !217, file: !159, line: 502, type: !14)
!242 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !217, file: !159, line: 502, type: !220)
!243 = !DILocation(line: 0, scope: !217)
!244 = !DILocation(line: 504, column: 10, scope: !217)
!245 = !DILocation(line: 504, column: 3, scope: !217)
!246 = distinct !DISubprogram(name: "lstat64", scope: !159, file: !159, line: 509, type: !218, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !8, retainedNodes: !247)
!247 = !{!248, !249}
!248 = !DILocalVariable(name: "__path", arg: 1, scope: !246, file: !159, line: 509, type: !14)
!249 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !246, file: !159, line: 509, type: !220)
!250 = !DILocation(line: 0, scope: !246)
!251 = !DILocation(line: 511, column: 10, scope: !246)
!252 = !DILocation(line: 511, column: 3, scope: !246)
!253 = distinct !DISubprogram(name: "fstat64", scope: !159, file: !159, line: 516, type: !254, scopeLine: 517, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !8, retainedNodes: !256)
!254 = !DISubroutineType(types: !255)
!255 = !{!11, !11, !220}
!256 = !{!257, !258}
!257 = !DILocalVariable(name: "__fd", arg: 1, scope: !253, file: !159, line: 516, type: !11)
!258 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !253, file: !159, line: 516, type: !220)
!259 = !DILocation(line: 0, scope: !253)
!260 = !DILocation(line: 518, column: 10, scope: !253)
!261 = !DILocation(line: 518, column: 3, scope: !253)
!262 = distinct !DISubprogram(name: "fstatat64", scope: !159, file: !159, line: 523, type: !263, scopeLine: 525, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !8, retainedNodes: !265)
!263 = !DISubroutineType(types: !264)
!264 = !{!11, !11, !14, !220, !11}
!265 = !{!266, !267, !268, !269}
!266 = !DILocalVariable(name: "__fd", arg: 1, scope: !262, file: !159, line: 523, type: !11)
!267 = !DILocalVariable(name: "__filename", arg: 2, scope: !262, file: !159, line: 523, type: !14)
!268 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !262, file: !159, line: 523, type: !220)
!269 = !DILocalVariable(name: "__flag", arg: 4, scope: !262, file: !159, line: 523, type: !11)
!270 = !DILocation(line: 0, scope: !262)
!271 = !DILocation(line: 526, column: 10, scope: !262)
!272 = !DILocation(line: 526, column: 3, scope: !262)
!273 = distinct !DISubprogram(name: "vprintf", scope: !274, file: !274, line: 39, type: !275, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !8, retainedNodes: !285)
!274 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!275 = !DISubroutineType(types: !276)
!276 = !{!11, !277, !278}
!277 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !14)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 527, size: 192, elements: !280)
!280 = !{!281, !282, !283, !284}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !279, file: !3, line: 527, baseType: !40, size: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !279, file: !3, line: 527, baseType: !40, size: 32, offset: 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !279, file: !3, line: 527, baseType: !13, size: 64, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !279, file: !3, line: 527, baseType: !13, size: 64, offset: 128)
!285 = !{!286, !287}
!286 = !DILocalVariable(name: "__fmt", arg: 1, scope: !273, file: !274, line: 39, type: !277)
!287 = !DILocalVariable(name: "__arg", arg: 2, scope: !273, file: !274, line: 39, type: !278)
!288 = !DILocation(line: 0, scope: !273)
!289 = !DILocation(line: 41, column: 20, scope: !273)
!290 = !DILocation(line: 41, column: 10, scope: !273)
!291 = !DILocation(line: 41, column: 3, scope: !273)
!292 = distinct !DISubprogram(name: "getchar", scope: !274, file: !274, line: 47, type: !293, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !8, retainedNodes: !9)
!293 = !DISubroutineType(types: !294)
!294 = !{!11}
!295 = !DILocation(line: 49, column: 16, scope: !292)
!296 = !DILocation(line: 49, column: 10, scope: !292)
!297 = !DILocation(line: 49, column: 3, scope: !292)
!298 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !274, file: !274, line: 56, type: !299, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !8, retainedNodes: !354)
!299 = !DISubroutineType(types: !300)
!300 = !{!11, !301}
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !303, line: 7, baseType: !304)
!303 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !305, line: 49, size: 1728, elements: !306)
!305 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!306 = !{!307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !322, !324, !325, !326, !327, !329, !331, !335, !338, !340, !343, !346, !347, !348, !349, !350}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !304, file: !305, line: 51, baseType: !11, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !304, file: !305, line: 54, baseType: !6, size: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !304, file: !305, line: 55, baseType: !6, size: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !304, file: !305, line: 56, baseType: !6, size: 64, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !304, file: !305, line: 57, baseType: !6, size: 64, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !304, file: !305, line: 58, baseType: !6, size: 64, offset: 320)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !304, file: !305, line: 59, baseType: !6, size: 64, offset: 384)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !304, file: !305, line: 60, baseType: !6, size: 64, offset: 448)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !304, file: !305, line: 61, baseType: !6, size: 64, offset: 512)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !304, file: !305, line: 64, baseType: !6, size: 64, offset: 576)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !304, file: !305, line: 65, baseType: !6, size: 64, offset: 640)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !304, file: !305, line: 66, baseType: !6, size: 64, offset: 704)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !304, file: !305, line: 68, baseType: !320, size: 64, offset: 768)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !305, line: 36, flags: DIFlagFwdDecl)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !304, file: !305, line: 70, baseType: !323, size: 64, offset: 832)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !304, file: !305, line: 72, baseType: !11, size: 32, offset: 896)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !304, file: !305, line: 73, baseType: !11, size: 32, offset: 928)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !304, file: !305, line: 74, baseType: !48, size: 64, offset: 960)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !304, file: !305, line: 77, baseType: !328, size: 16, offset: 1024)
!328 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !304, file: !305, line: 78, baseType: !330, size: 8, offset: 1040)
!330 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !304, file: !305, line: 79, baseType: !332, size: 8, offset: 1048)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 1)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !304, file: !305, line: 81, baseType: !336, size: 64, offset: 1088)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !305, line: 43, baseType: null)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !304, file: !305, line: 89, baseType: !339, size: 64, offset: 1152)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !33, line: 153, baseType: !49)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !304, file: !305, line: 91, baseType: !341, size: 64, offset: 1216)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !305, line: 37, flags: DIFlagFwdDecl)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !304, file: !305, line: 92, baseType: !344, size: 64, offset: 1280)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !305, line: 38, flags: DIFlagFwdDecl)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !304, file: !305, line: 93, baseType: !323, size: 64, offset: 1344)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !304, file: !305, line: 94, baseType: !13, size: 64, offset: 1408)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !304, file: !305, line: 95, baseType: !24, size: 64, offset: 1472)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !304, file: !305, line: 96, baseType: !11, size: 32, offset: 1536)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !304, file: !305, line: 98, baseType: !351, size: 160, offset: 1568)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 160, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 20)
!354 = !{!355}
!355 = !DILocalVariable(name: "__fp", arg: 1, scope: !298, file: !274, line: 56, type: !301)
!356 = !DILocation(line: 0, scope: !298)
!357 = !DILocation(line: 58, column: 10, scope: !298)
!358 = !DILocation(line: 58, column: 3, scope: !298)
!359 = distinct !DISubprogram(name: "getc_unlocked", scope: !274, file: !274, line: 66, type: !299, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !8, retainedNodes: !360)
!360 = !{!361}
!361 = !DILocalVariable(name: "__fp", arg: 1, scope: !359, file: !274, line: 66, type: !301)
!362 = !DILocation(line: 0, scope: !359)
!363 = !DILocation(line: 68, column: 10, scope: !359)
!364 = !DILocation(line: 68, column: 3, scope: !359)
!365 = distinct !DISubprogram(name: "getchar_unlocked", scope: !274, file: !274, line: 73, type: !293, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !8, retainedNodes: !9)
!366 = !DILocation(line: 75, column: 10, scope: !365)
!367 = !DILocation(line: 75, column: 3, scope: !365)
!368 = distinct !DISubprogram(name: "putchar", scope: !274, file: !274, line: 82, type: !369, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !8, retainedNodes: !371)
!369 = !DISubroutineType(types: !370)
!370 = !{!11, !11}
!371 = !{!372}
!372 = !DILocalVariable(name: "__c", arg: 1, scope: !368, file: !274, line: 82, type: !11)
!373 = !DILocation(line: 0, scope: !368)
!374 = !DILocation(line: 84, column: 21, scope: !368)
!375 = !DILocation(line: 84, column: 10, scope: !368)
!376 = !DILocation(line: 84, column: 3, scope: !368)
!377 = distinct !DISubprogram(name: "fputc_unlocked", scope: !274, file: !274, line: 91, type: !378, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !8, retainedNodes: !380)
!378 = !DISubroutineType(types: !379)
!379 = !{!11, !11, !301}
!380 = !{!381, !382}
!381 = !DILocalVariable(name: "__c", arg: 1, scope: !377, file: !274, line: 91, type: !11)
!382 = !DILocalVariable(name: "__stream", arg: 2, scope: !377, file: !274, line: 91, type: !301)
!383 = !DILocation(line: 0, scope: !377)
!384 = !DILocation(line: 93, column: 10, scope: !377)
!385 = !DILocation(line: 93, column: 3, scope: !377)
!386 = distinct !DISubprogram(name: "putc_unlocked", scope: !274, file: !274, line: 101, type: !378, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !8, retainedNodes: !387)
!387 = !{!388, !389}
!388 = !DILocalVariable(name: "__c", arg: 1, scope: !386, file: !274, line: 101, type: !11)
!389 = !DILocalVariable(name: "__stream", arg: 2, scope: !386, file: !274, line: 101, type: !301)
!390 = !DILocation(line: 0, scope: !386)
!391 = !DILocation(line: 103, column: 10, scope: !386)
!392 = !DILocation(line: 103, column: 3, scope: !386)
!393 = distinct !DISubprogram(name: "putchar_unlocked", scope: !274, file: !274, line: 108, type: !369, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !8, retainedNodes: !394)
!394 = !{!395}
!395 = !DILocalVariable(name: "__c", arg: 1, scope: !393, file: !274, line: 108, type: !11)
!396 = !DILocation(line: 0, scope: !393)
!397 = !DILocation(line: 110, column: 10, scope: !393)
!398 = !DILocation(line: 110, column: 3, scope: !393)
!399 = distinct !DISubprogram(name: "getline", scope: !274, file: !274, line: 118, type: !400, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !8, retainedNodes: !404)
!400 = !DISubroutineType(types: !401)
!401 = !{!402, !12, !403, !301}
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !33, line: 193, baseType: !49)
