; ModuleID = 'ggc-page.bc'
source_filename = "ggc-page.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.globals = type { [84 x %struct.page_entry*], [84 x %struct.page_entry*], %struct.page_table_chain*, i64, i64, i64, i64, i64, i64, i64, i16, %struct.page_entry*, %struct.page_group*, %struct._IO_FILE*, i32, i32, i32*, i32, i32, %struct.page_entry**, i64** }
%struct.page_table_chain = type { %struct.page_table_chain*, i64, [256 x %struct.page_entry**] }
%struct.page_entry = type { %struct.page_entry*, %struct.page_entry*, i64, i8*, %struct.page_group*, i64, i16, i16, i16, i8, [1 x i64] }
%struct.page_group = type { %struct.page_group*, i8*, i64, i32 }
%struct.anon = type { i64, i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }

!181 = !DIEnumerator(name: "gt_e_SP9tree_node17splay_tree_node_s", value: 172, isUnsigned: true)
!182 = !DIEnumerator(name: "gt_e_P9tree_nodeP9tree_node17splay_tree_node_s", value: 173, isUnsigned: true)
!183 = !DIEnumerator(name: "gt_e_IP9tree_node17splay_tree_node_s", value: 174, isUnsigned: true)
!184 = !DIEnumerator(name: "gt_e_P15interface_tuple4htab", value: 175, isUnsigned: true)
!185 = !DIEnumerator(name: "gt_e_P16volatilized_type4htab", value: 176, isUnsigned: true)
!186 = !DIEnumerator(name: "gt_e_P17string_descriptor4htab", value: 177, isUnsigned: true)
!187 = !DIEnumerator(name: "gt_e_P14type_assertion4htab", value: 178, isUnsigned: true)
!188 = !DIEnumerator(name: "gt_e_P18treetreehash_entry4htab", value: 179, isUnsigned: true)
!189 = !DIEnumerator(name: "gt_e_P17module_htab_entry4htab", value: 180, isUnsigned: true)
!190 = !DIEnumerator(name: "gt_e_P21pending_abstract_type4htab", value: 181, isUnsigned: true)
!191 = !DIEnumerator(name: "gt_e_P10spec_entry4htab", value: 182, isUnsigned: true)
!192 = !DIEnumerator(name: "gt_e_P16cxx_int_tree_map4htab", value: 183, isUnsigned: true)
!193 = !DIEnumerator(name: "gt_e_P17named_label_entry4htab", value: 184, isUnsigned: true)
!194 = !DIEnumerator(name: "gt_e_P12tree_int_map4htab", value: 185, isUnsigned: true)
!195 = !DIEnumerator(name: "gt_e_P20lto_symtab_entry_def4htab", value: 186, isUnsigned: true)
!196 = !DIEnumerator(name: "gt_e_IP9tree_node12splay_tree_s", value: 187, isUnsigned: true)
!197 = !DIEnumerator(name: "gt_e_P9tree_nodeP9tree_node12splay_tree_s", value: 188, isUnsigned: true)
!198 = !DIEnumerator(name: "gt_e_P12varpool_node4htab", value: 189, isUnsigned: true)
!199 = !DIEnumerator(name: "gt_e_P13scev_info_str4htab", value: 190, isUnsigned: true)
!200 = !DIEnumerator(name: "gt_e_P23constant_descriptor_rtx4htab", value: 191, isUnsigned: true)
!201 = !DIEnumerator(name: "gt_e_P24constant_descriptor_tree4htab", value: 192, isUnsigned: true)
!202 = !DIEnumerator(name: "gt_e_P12object_block4htab", value: 193, isUnsigned: true)
!203 = !DIEnumerator(name: "gt_e_P7section4htab", value: 194, isUnsigned: true)
!204 = !DIEnumerator(name: "gt_e_P17tree_priority_map4htab", value: 195, isUnsigned: true)
!205 = !DIEnumerator(name: "gt_e_P8tree_map4htab", value: 196, isUnsigned: true)
!206 = !DIEnumerator(name: "gt_e_P9type_hash4htab", value: 197, isUnsigned: true)
!207 = !DIEnumerator(name: "gt_e_P13libfunc_entry4htab", value: 198, isUnsigned: true)
!208 = !DIEnumerator(name: "gt_e_P23temp_slot_address_entry4htab", value: 199, isUnsigned: true)
!209 = !DIEnumerator(name: "gt_e_P15throw_stmt_node4htab", value: 200, isUnsigned: true)
!210 = !DIEnumerator(name: "gt_e_P9reg_attrs4htab", value: 201, isUnsigned: true)
!211 = !DIEnumerator(name: "gt_e_P9mem_attrs4htab", value: 202, isUnsigned: true)
!212 = !DIEnumerator(name: "gt_e_P7rtx_def4htab", value: 203, isUnsigned: true)
!213 = !DIEnumerator(name: "gt_e_SP9tree_node12splay_tree_s", value: 204, isUnsigned: true)
!214 = !DIEnumerator(name: "gt_e_P10vcall_insn4htab", value: 205, isUnsigned: true)
!215 = !DIEnumerator(name: "gt_e_P16var_loc_list_def4htab", value: 206, isUnsigned: true)
!216 = !DIEnumerator(name: "gt_e_P10die_struct4htab", value: 207, isUnsigned: true)
!217 = !DIEnumerator(name: "gt_e_P15dwarf_file_data4htab", value: 208, isUnsigned: true)
!218 = !DIEnumerator(name: "gt_e_P20indirect_string_node4htab", value: 209, isUnsigned: true)
!219 = !DIEnumerator(name: "gt_e_P11cgraph_node4htab", value: 210, isUnsigned: true)
!220 = !DIEnumerator(name: "gt_e_II12splay_tree_s", value: 211, isUnsigned: true)
!221 = !DIEnumerator(name: "gt_e_P27cgraph_node_set_element_def4htab", value: 212, isUnsigned: true)
!222 = !DIEnumerator(name: "gt_e_P11cgraph_edge4htab", value: 213, isUnsigned: true)
!223 = !DIEnumerator(name: "gt_e_P9loop_exit4htab", value: 214, isUnsigned: true)
!224 = !DIEnumerator(name: "gt_e_P24types_used_by_vars_entry4htab", value: 215, isUnsigned: true)
!225 = !DIEnumerator(name: "gt_e_P9tree_node4htab", value: 216, isUnsigned: true)
!226 = !DIEnumerator(name: "gt_types_enum_last", value: 217, isUnsigned: true)
!227 = !{!228, !229, !230, !231, !234, !235, !237, !238, !240, !242, !243, !271, !273, !232, !249, !286, !272, !288}
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!230 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !233)
!237 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !241, line: 46, baseType: !237)
!241 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "page_entry", file: !3, line: 304, baseType: !246)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "page_entry", file: !3, line: 260, size: 512, elements: !247)
!247 = !{!248, !250, !251, !252, !253, !261, !262, !264, !265, !266, !267}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !246, file: !3, line: 264, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !246, file: !3, line: 269, baseType: !249, size: 64, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !246, file: !3, line: 273, baseType: !240, size: 64, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !246, file: !3, line: 276, baseType: !232, size: 64, offset: 192)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !246, file: !3, line: 280, baseType: !254, size: 64, offset: 256)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "page_group", file: !3, line: 309, size: 256, elements: !256)
!256 = !{!257, !258, !259, !260}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !255, file: !3, line: 312, baseType: !254, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "allocation", scope: !255, file: !3, line: 315, baseType: !232, size: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !255, file: !3, line: 318, baseType: !240, size: 64, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "in_use", scope: !255, file: !3, line: 321, baseType: !7, size: 32, offset: 192)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "index_by_depth", scope: !246, file: !3, line: 285, baseType: !237, size: 64, offset: 320)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "context_depth", scope: !246, file: !3, line: 288, baseType: !263, size: 16, offset: 384)
!263 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "num_free_objects", scope: !246, file: !3, line: 291, baseType: !263, size: 16, offset: 400)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "next_bit_hint", scope: !246, file: !3, line: 295, baseType: !263, size: 16, offset: 416)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !246, file: !3, line: 298, baseType: !229, size: 8, offset: 432)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "in_use_p", scope: !246, file: !3, line: 303, baseType: !268, size: 64, offset: 448)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 64, elements: !269)
!269 = !{!270}
!270 = !DISubrange(count: 1)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ggc_pch_data", file: !3, line: 2108, size: 13440, elements: !275)
!275 = !{!276, !283, !285}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !274, file: !3, line: 2110, baseType: !277, size: 2688)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ggc_pch_ondisk", file: !3, line: 2103, size: 2688, elements: !278)
!278 = !{!279}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "totals", scope: !277, file: !3, line: 2105, baseType: !280, size: 2688)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 2688, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 84)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !274, file: !3, line: 2111, baseType: !284, size: 5376, offset: 2688)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !240, size: 5376, elements: !281)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !274, file: !3, line: 2112, baseType: !284, size: 5376, offset: 8064)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "page_group", file: !3, line: 322, baseType: !255)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "page_table_chain", file: !3, line: 335, size: 16512, elements: !290)
!290 = !{!291, !292, !293}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !289, file: !3, line: 337, baseType: !288, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "high_bits", scope: !289, file: !3, line: 338, baseType: !240, size: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !289, file: !3, line: 339, baseType: !294, size: 16384, offset: 128)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 16384, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 256)
!297 = !{!298, !368, !370, !372, !0, !379, !384}
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "emptyBytes", scope: !300, file: !3, line: 2200, type: !367, isLocal: true, isDefinition: true)
!300 = distinct !DISubprogram(name: "ggc_pch_write_object", scope: !3, file: !3, line: 2195, type: !301, scopeLine: 2198, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !356)
!301 = !DISubroutineType(types: !302)
!302 = !{null, !273, !303, !234, !234, !240, !229}
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !305, line: 7, baseType: !306)
!305 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !307, line: 49, size: 1728, elements: !308)
!307 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!308 = !{!309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !324, !326, !327, !328, !332, !333, !335, !337, !340, !342, !345, !348, !349, !350, !351, !352}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !306, file: !307, line: 51, baseType: !230, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !306, file: !307, line: 54, baseType: !232, size: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !306, file: !307, line: 55, baseType: !232, size: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !306, file: !307, line: 56, baseType: !232, size: 64, offset: 192)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !306, file: !307, line: 57, baseType: !232, size: 64, offset: 256)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !306, file: !307, line: 58, baseType: !232, size: 64, offset: 320)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !306, file: !307, line: 59, baseType: !232, size: 64, offset: 384)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !306, file: !307, line: 60, baseType: !232, size: 64, offset: 448)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !306, file: !307, line: 61, baseType: !232, size: 64, offset: 512)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !306, file: !307, line: 64, baseType: !232, size: 64, offset: 576)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !306, file: !307, line: 65, baseType: !232, size: 64, offset: 640)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !306, file: !307, line: 66, baseType: !232, size: 64, offset: 704)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !306, file: !307, line: 68, baseType: !322, size: 64, offset: 768)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !307, line: 36, flags: DIFlagFwdDecl)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !306, file: !307, line: 70, baseType: !325, size: 64, offset: 832)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !306, file: !307, line: 72, baseType: !230, size: 32, offset: 896)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !306, file: !307, line: 73, baseType: !230, size: 32, offset: 928)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !306, file: !307, line: 74, baseType: !329, size: 64, offset: 960)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !330, line: 152, baseType: !331)
!330 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!331 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !306, file: !307, line: 77, baseType: !263, size: 16, offset: 1024)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !306, file: !307, line: 78, baseType: !334, size: 8, offset: 1040)
!334 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !306, file: !307, line: 79, baseType: !336, size: 8, offset: 1048)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 8, elements: !269)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !306, file: !307, line: 81, baseType: !338, size: 64, offset: 1088)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !307, line: 43, baseType: null)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !306, file: !307, line: 89, baseType: !341, size: 64, offset: 1152)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !330, line: 153, baseType: !331)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !306, file: !307, line: 91, baseType: !343, size: 64, offset: 1216)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !307, line: 37, flags: DIFlagFwdDecl)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !306, file: !307, line: 92, baseType: !346, size: 64, offset: 1280)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !307, line: 38, flags: DIFlagFwdDecl)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !306, file: !307, line: 93, baseType: !325, size: 64, offset: 1344)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !306, file: !307, line: 94, baseType: !234, size: 64, offset: 1408)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !306, file: !307, line: 95, baseType: !240, size: 64, offset: 1472)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !306, file: !307, line: 96, baseType: !230, size: 32, offset: 1536)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !306, file: !307, line: 98, baseType: !353, size: 160, offset: 1568)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 160, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 20)
!356 = !{!357, !358, !359, !360, !361, !362, !363, !364}
!357 = !DILocalVariable(name: "d", arg: 1, scope: !300, file: !3, line: 2195, type: !273)
!358 = !DILocalVariable(name: "f", arg: 2, scope: !300, file: !3, line: 2196, type: !303)
!359 = !DILocalVariable(name: "x", arg: 3, scope: !300, file: !3, line: 2196, type: !234)
!360 = !DILocalVariable(name: "newx", arg: 4, scope: !300, file: !3, line: 2196, type: !234)
!361 = !DILocalVariable(name: "size", arg: 5, scope: !300, file: !3, line: 2197, type: !240)
!362 = !DILocalVariable(name: "is_string", arg: 6, scope: !300, file: !3, line: 2197, type: !229)
!363 = !DILocalVariable(name: "order", scope: !300, file: !3, line: 2199, type: !7)
!364 = !DILocalVariable(name: "padding", scope: !365, file: !3, line: 2219, type: !7)
!365 = distinct !DILexicalBlock(scope: !366, file: !3, line: 2218, column: 5)
!366 = distinct !DILexicalBlock(scope: !300, file: !3, line: 2217, column: 7)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 2048, elements: !295)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "objects_per_page_table", scope: !2, file: !3, line: 241, type: !280, isLocal: true, isDefinition: true)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "object_size_table", scope: !2, file: !3, line: 245, type: !284, isLocal: true, isDefinition: true)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "inverse_table", scope: !2, file: !3, line: 256, type: !374, isLocal: true, isDefinition: true)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !375, size: 10752, elements: !281)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 251, size: 128, elements: !376)
!376 = !{!377, !378}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !375, file: !3, line: 253, baseType: !240, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !375, file: !3, line: 254, baseType: !7, size: 32, offset: 64)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "size_lookup", scope: !2, file: !3, line: 1041, type: !381, isLocal: true, isDefinition: true)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !229, size: 4096, elements: !382)
!382 = !{!383}
!383 = !DISubrange(count: 512)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "extra_order_size_table", scope: !2, file: !3, line: 200, type: !386, isLocal: true, isDefinition: true)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 1280, elements: !354)
!387 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !240)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "globals", file: !3, line: 355, size: 11840, elements: !389)
!389 = !{!390, !392, !393, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !388, file: !3, line: 361, baseType: !391, size: 5376)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 5376, elements: !281)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "page_tails", scope: !388, file: !3, line: 366, baseType: !391, size: 5376, offset: 5376)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !388, file: !3, line: 369, baseType: !394, size: 64, offset: 10752)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "page_table", file: !3, line: 340, baseType: !288)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "pagesize", scope: !388, file: !3, line: 372, baseType: !240, size: 64, offset: 10816)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "lg_pagesize", scope: !388, file: !3, line: 373, baseType: !240, size: 64, offset: 10880)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !388, file: !3, line: 376, baseType: !240, size: 64, offset: 10944)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_last_gc", scope: !388, file: !3, line: 379, baseType: !240, size: 64, offset: 11008)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_mapped", scope: !388, file: !3, line: 382, baseType: !240, size: 64, offset: 11072)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "context_depth_allocations", scope: !388, file: !3, line: 385, baseType: !237, size: 64, offset: 11136)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "context_depth_collections", scope: !388, file: !3, line: 388, baseType: !237, size: 64, offset: 11200)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "context_depth", scope: !388, file: !3, line: 391, baseType: !263, size: 16, offset: 11264)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "free_pages", scope: !388, file: !3, line: 399, baseType: !244, size: 64, offset: 11328)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "page_groups", scope: !388, file: !3, line: 402, baseType: !286, size: 64, offset: 11392)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "debug_file", scope: !388, file: !3, line: 406, baseType: !303, size: 64, offset: 11456)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "depth_in_use", scope: !388, file: !3, line: 409, baseType: !7, size: 32, offset: 11520)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "depth_max", scope: !388, file: !3, line: 412, baseType: !7, size: 32, offset: 11552)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !388, file: !3, line: 417, baseType: !242, size: 64, offset: 11584)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "by_depth_in_use", scope: !388, file: !3, line: 420, baseType: !7, size: 32, offset: 11648)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "by_depth_max", scope: !388, file: !3, line: 423, baseType: !7, size: 32, offset: 11680)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "by_depth", scope: !388, file: !3, line: 430, baseType: !243, size: 64, offset: 11712)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "save_in_use", scope: !388, file: !3, line: 435, baseType: !271, size: 64, offset: 11776)
!413 = !{i32 2, !"Dwarf Version", i32 4}
!414 = !{i32 2, !"Debug Info Version", i32 3}
!415 = !{i32 1, !"wchar_size", i32 4}
!416 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!417 = distinct !DISubprogram(name: "vprintf", scope: !418, file: !418, line: 39, type: !419, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !429)
!418 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!419 = !DISubroutineType(types: !420)
!420 = !{!230, !421, !422}
!421 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !235)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, size: 192, elements: !424)
!424 = !{!425, !426, !427, !428}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !423, file: !3, baseType: !7, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !423, file: !3, baseType: !7, size: 32, offset: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !423, file: !3, baseType: !234, size: 64, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !423, file: !3, baseType: !234, size: 64, offset: 128)
!429 = !{!430, !431}
!430 = !DILocalVariable(name: "__fmt", arg: 1, scope: !417, file: !418, line: 39, type: !421)
!431 = !DILocalVariable(name: "__arg", arg: 2, scope: !417, file: !418, line: 39, type: !422)
!432 = !DILocation(line: 0, scope: !417)
!433 = !DILocation(line: 41, column: 20, scope: !417)
!434 = !DILocation(line: 41, column: 10, scope: !417)
!435 = !DILocation(line: 41, column: 3, scope: !417)
!436 = distinct !DISubprogram(name: "getchar", scope: !418, file: !418, line: 47, type: !437, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !439)
!437 = !DISubroutineType(types: !438)
!438 = !{!230}
!439 = !{}
!440 = !DILocation(line: 49, column: 16, scope: !436)
!441 = !DILocation(line: 49, column: 10, scope: !436)
!442 = !DILocation(line: 49, column: 3, scope: !436)
!443 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !418, file: !418, line: 56, type: !444, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !446)
!444 = !DISubroutineType(types: !445)
!445 = !{!230, !303}
!446 = !{!447}
!447 = !DILocalVariable(name: "__fp", arg: 1, scope: !443, file: !418, line: 56, type: !303)
!448 = !DILocation(line: 0, scope: !443)
!449 = !DILocation(line: 58, column: 10, scope: !443)
!450 = !DILocation(line: 58, column: 3, scope: !443)
!451 = distinct !DISubprogram(name: "getc_unlocked", scope: !418, file: !418, line: 66, type: !444, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !452)
!452 = !{!453}
!453 = !DILocalVariable(name: "__fp", arg: 1, scope: !451, file: !418, line: 66, type: !303)
!454 = !DILocation(line: 0, scope: !451)
!455 = !DILocation(line: 68, column: 10, scope: !451)
!456 = !DILocation(line: 68, column: 3, scope: !451)
!457 = distinct !DISubprogram(name: "getchar_unlocked", scope: !418, file: !418, line: 73, type: !437, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !439)
!458 = !DILocation(line: 75, column: 10, scope: !457)
!459 = !DILocation(line: 75, column: 3, scope: !457)
!460 = distinct !DISubprogram(name: "putchar", scope: !418, file: !418, line: 82, type: !461, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !463)
!461 = !DISubroutineType(types: !462)
!462 = !{!230, !230}
!463 = !{!464}
!464 = !DILocalVariable(name: "__c", arg: 1, scope: !460, file: !418, line: 82, type: !230)
!465 = !DILocation(line: 0, scope: !460)
!466 = !DILocation(line: 84, column: 21, scope: !460)
!467 = !DILocation(line: 84, column: 10, scope: !460)
!468 = !DILocation(line: 84, column: 3, scope: !460)
!469 = distinct !DISubprogram(name: "fputc_unlocked", scope: !418, file: !418, line: 91, type: !470, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !472)
!470 = !DISubroutineType(types: !471)
!471 = !{!230, !230, !303}
!472 = !{!473, !474}
!473 = !DILocalVariable(name: "__c", arg: 1, scope: !469, file: !418, line: 91, type: !230)
!474 = !DILocalVariable(name: "__stream", arg: 2, scope: !469, file: !418, line: 91, type: !303)
!475 = !DILocation(line: 0, scope: !469)
!476 = !DILocation(line: 93, column: 10, scope: !469)
!477 = !DILocation(line: 93, column: 3, scope: !469)
!478 = distinct !DISubprogram(name: "putc_unlocked", scope: !418, file: !418, line: 101, type: !470, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !479)
!479 = !{!480, !481}
!480 = !DILocalVariable(name: "__c", arg: 1, scope: !478, file: !418, line: 101, type: !230)
!481 = !DILocalVariable(name: "__stream", arg: 2, scope: !478, file: !418, line: 101, type: !303)
!482 = !DILocation(line: 0, scope: !478)
!483 = !DILocation(line: 103, column: 10, scope: !478)
!484 = !DILocation(line: 103, column: 3, scope: !478)
!485 = distinct !DISubprogram(name: "putchar_unlocked", scope: !418, file: !418, line: 108, type: !461, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !486)
!486 = !{!487}
!487 = !DILocalVariable(name: "__c", arg: 1, scope: !485, file: !418, line: 108, type: !230)
!488 = !DILocation(line: 0, scope: !485)
!489 = !DILocation(line: 110, column: 10, scope: !485)
!490 = !DILocation(line: 110, column: 3, scope: !485)
!491 = distinct !DISubprogram(name: "getline", scope: !418, file: !418, line: 118, type: !492, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !496)
!492 = !DISubroutineType(types: !493)
!493 = !{!494, !231, !495, !303}
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !330, line: 193, baseType: !331)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!496 = !{!497, !498, !499}
!497 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !491, file: !418, line: 118, type: !231)
!498 = !DILocalVariable(name: "__n", arg: 2, scope: !491, file: !418, line: 118, type: !495)
!499 = !DILocalVariable(name: "__stream", arg: 3, scope: !491, file: !418, line: 118, type: !303)
!500 = !DILocation(line: 0, scope: !491)
!501 = !DILocation(line: 120, column: 10, scope: !491)
!502 = !DILocation(line: 120, column: 3, scope: !491)
!503 = distinct !DISubprogram(name: "feof_unlocked", scope: !418, file: !418, line: 128, type: !444, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !504)
!504 = !{!505}
!505 = !DILocalVariable(name: "__stream", arg: 1, scope: !503, file: !418, line: 128, type: !303)
!506 = !DILocation(line: 0, scope: !503)
!507 = !DILocation(line: 130, column: 10, scope: !503)
!508 = !DILocation(line: 130, column: 3, scope: !503)
!509 = distinct !DISubprogram(name: "ferror_unlocked", scope: !418, file: !418, line: 135, type: !444, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !510)
!510 = !{!511}
!511 = !DILocalVariable(name: "__stream", arg: 1, scope: !509, file: !418, line: 135, type: !303)
!512 = !DILocation(line: 0, scope: !509)
!513 = !DILocation(line: 137, column: 10, scope: !509)
!514 = !DILocation(line: 137, column: 3, scope: !509)
!515 = distinct !DISubprogram(name: "tolower", scope: !516, file: !516, line: 207, type: !461, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !517)
!516 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!517 = !{!518}
!518 = !DILocalVariable(name: "__c", arg: 1, scope: !515, file: !516, line: 207, type: !230)
!519 = !DILocation(line: 0, scope: !515)
!520 = !DILocation(line: 209, column: 22, scope: !515)
!521 = !DILocation(line: 209, column: 39, scope: !515)
!522 = !DILocation(line: 209, column: 38, scope: !515)
!523 = !DILocation(line: 209, column: 37, scope: !515)
!524 = !DILocation(line: 209, column: 10, scope: !515)
!525 = !DILocation(line: 209, column: 3, scope: !515)
!526 = distinct !DISubprogram(name: "toupper", scope: !516, file: !516, line: 213, type: !461, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !527)
!527 = !{!528}
!528 = !DILocalVariable(name: "__c", arg: 1, scope: !526, file: !516, line: 213, type: !230)
!529 = !DILocation(line: 0, scope: !526)
!530 = !DILocation(line: 215, column: 22, scope: !526)
!531 = !DILocation(line: 215, column: 39, scope: !526)
!532 = !DILocation(line: 215, column: 38, scope: !526)
!533 = !DILocation(line: 215, column: 37, scope: !526)
!534 = !DILocation(line: 215, column: 10, scope: !526)
!535 = !DILocation(line: 215, column: 3, scope: !526)
!536 = distinct !DISubprogram(name: "atoi", scope: !537, file: !537, line: 361, type: !538, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !540)
!537 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!538 = !DISubroutineType(types: !539)
!539 = !{!230, !235}
!540 = !{!541}
!541 = !DILocalVariable(name: "__nptr", arg: 1, scope: !536, file: !537, line: 361, type: !235)
!542 = !DILocation(line: 0, scope: !536)
!543 = !DILocation(line: 363, column: 16, scope: !536)
!544 = !DILocation(line: 363, column: 10, scope: !536)
!545 = !DILocation(line: 363, column: 3, scope: !536)
!546 = distinct !DISubprogram(name: "atol", scope: !537, file: !537, line: 366, type: !547, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !549)
!547 = !DISubroutineType(types: !548)
!548 = !{!331, !235}
!549 = !{!550}
!550 = !DILocalVariable(name: "__nptr", arg: 1, scope: !546, file: !537, line: 366, type: !235)
!551 = !DILocation(line: 0, scope: !546)
!552 = !DILocation(line: 368, column: 10, scope: !546)
!553 = !DILocation(line: 368, column: 3, scope: !546)
!554 = distinct !DISubprogram(name: "atoll", scope: !537, file: !537, line: 373, type: !555, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !558)
!555 = !DISubroutineType(types: !556)
!556 = !{!557, !235}
!557 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!558 = !{!559}
!559 = !DILocalVariable(name: "__nptr", arg: 1, scope: !554, file: !537, line: 373, type: !235)
!560 = !DILocation(line: 0, scope: !554)
!561 = !DILocation(line: 375, column: 10, scope: !554)
!562 = !DILocation(line: 375, column: 3, scope: !554)
!563 = distinct !DISubprogram(name: "bsearch", scope: !564, file: !564, line: 20, type: !565, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !571)
!564 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!565 = !DISubroutineType(types: !566)
!566 = !{!234, !238, !238, !240, !240, !567}
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !537, line: 808, baseType: !568)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DISubroutineType(types: !570)
!570 = !{!230, !238, !238}
!571 = !{!572, !573, !574, !575, !576, !577, !578, !579, !580, !581}
!572 = !DILocalVariable(name: "__key", arg: 1, scope: !563, file: !564, line: 20, type: !238)
!573 = !DILocalVariable(name: "__base", arg: 2, scope: !563, file: !564, line: 20, type: !238)
!574 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !563, file: !564, line: 20, type: !240)
!575 = !DILocalVariable(name: "__size", arg: 4, scope: !563, file: !564, line: 20, type: !240)
!576 = !DILocalVariable(name: "__compar", arg: 5, scope: !563, file: !564, line: 21, type: !567)
!577 = !DILocalVariable(name: "__l", scope: !563, file: !564, line: 23, type: !240)
!578 = !DILocalVariable(name: "__u", scope: !563, file: !564, line: 23, type: !240)
!579 = !DILocalVariable(name: "__idx", scope: !563, file: !564, line: 23, type: !240)
!580 = !DILocalVariable(name: "__p", scope: !563, file: !564, line: 24, type: !238)
!581 = !DILocalVariable(name: "__comparison", scope: !563, file: !564, line: 25, type: !230)
!582 = !DILocation(line: 0, scope: !563)
!583 = !DILocation(line: 29, column: 3, scope: !563)
!584 = !DILocation(line: 27, column: 7, scope: !563)
!585 = !DILocation(line: 29, column: 14, scope: !563)
!586 = !DILocation(line: 31, column: 20, scope: !587)
!587 = distinct !DILexicalBlock(scope: !563, file: !564, line: 30, column: 5)
!588 = !DILocation(line: 31, column: 27, scope: !587)
!589 = !DILocation(line: 32, column: 56, scope: !587)
!590 = !DILocation(line: 32, column: 47, scope: !587)
!591 = !DILocation(line: 33, column: 22, scope: !587)
!592 = !DILocation(line: 34, column: 24, scope: !593)
!593 = distinct !DILexicalBlock(scope: !587, file: !564, line: 34, column: 11)
!594 = !DILocation(line: 34, column: 11, scope: !587)
!595 = !DILocation(line: 36, column: 29, scope: !596)
!596 = distinct !DILexicalBlock(scope: !593, file: !564, line: 36, column: 16)
!597 = !DILocation(line: 36, column: 16, scope: !593)
!598 = !DILocation(line: 37, column: 14, scope: !596)
!599 = distinct !{!599, !583, !600}
!600 = !DILocation(line: 40, column: 5, scope: !563)
!601 = !DILocation(line: 43, column: 1, scope: !563)
!602 = distinct !DISubprogram(name: "atof", scope: !603, file: !603, line: 25, type: !604, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !607)
!603 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!604 = !DISubroutineType(types: !605)
!605 = !{!606, !235}
!606 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!607 = !{!608}
!608 = !DILocalVariable(name: "__nptr", arg: 1, scope: !602, file: !603, line: 25, type: !235)
!609 = !DILocation(line: 0, scope: !602)
!610 = !DILocation(line: 27, column: 10, scope: !602)
!611 = !DILocation(line: 27, column: 3, scope: !602)
!612 = distinct !DISubprogram(name: "strtoimax", scope: !613, file: !613, line: 324, type: !614, scopeLine: 326, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !620)
!613 = !DIFile(filename: "/usr/include/inttypes.h", directory: "")
!614 = !DISubroutineType(types: !615)
!615 = !{!616, !421, !619, !230}
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !617, line: 101, baseType: !618)
!617 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !330, line: 72, baseType: !331)
!619 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !231)
!620 = !{!621, !622, !623}
!621 = !DILocalVariable(name: "nptr", arg: 1, scope: !612, file: !613, line: 324, type: !421)
!622 = !DILocalVariable(name: "endptr", arg: 2, scope: !612, file: !613, line: 324, type: !619)
!623 = !DILocalVariable(name: "base", arg: 3, scope: !612, file: !613, line: 324, type: !230)
!624 = !DILocation(line: 0, scope: !612)
!625 = !DILocation(line: 327, column: 10, scope: !612)
!626 = !DILocation(line: 327, column: 3, scope: !612)
!627 = distinct !DISubprogram(name: "strtoumax", scope: !613, file: !613, line: 336, type: !628, scopeLine: 338, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !632)
!628 = !DISubroutineType(types: !629)
!629 = !{!630, !421, !619, !230}
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !617, line: 102, baseType: !631)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !330, line: 73, baseType: !237)
!632 = !{!633, !634, !635}
!633 = !DILocalVariable(name: "nptr", arg: 1, scope: !627, file: !613, line: 336, type: !421)
!634 = !DILocalVariable(name: "endptr", arg: 2, scope: !627, file: !613, line: 336, type: !619)
!635 = !DILocalVariable(name: "base", arg: 3, scope: !627, file: !613, line: 336, type: !230)
!636 = !DILocation(line: 0, scope: !627)
!637 = !DILocation(line: 339, column: 10, scope: !627)
!638 = !DILocation(line: 339, column: 3, scope: !627)
!639 = distinct !DISubprogram(name: "wcstoimax", scope: !613, file: !613, line: 348, type: !640, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !649)
!640 = !DISubroutineType(types: !641)
!641 = !{!616, !642, !646, !230}
!642 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !643)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gwchar_t", file: !613, line: 34, baseType: !230)
!646 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !647)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!649 = !{!650, !651, !652}
!650 = !DILocalVariable(name: "nptr", arg: 1, scope: !639, file: !613, line: 348, type: !642)
!651 = !DILocalVariable(name: "endptr", arg: 2, scope: !639, file: !613, line: 348, type: !646)
!652 = !DILocalVariable(name: "base", arg: 3, scope: !639, file: !613, line: 348, type: !230)
!653 = !DILocation(line: 0, scope: !639)
!654 = !DILocation(line: 351, column: 10, scope: !639)
!655 = !DILocation(line: 351, column: 3, scope: !639)
!656 = distinct !DISubprogram(name: "wcstoumax", scope: !613, file: !613, line: 362, type: !657, scopeLine: 364, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !659)
!657 = !DISubroutineType(types: !658)
!658 = !{!630, !642, !646, !230}
!659 = !{!660, !661, !662}
!660 = !DILocalVariable(name: "nptr", arg: 1, scope: !656, file: !613, line: 362, type: !642)
!661 = !DILocalVariable(name: "endptr", arg: 2, scope: !656, file: !613, line: 362, type: !646)
!662 = !DILocalVariable(name: "base", arg: 3, scope: !656, file: !613, line: 362, type: !230)
!663 = !DILocation(line: 0, scope: !656)
!664 = !DILocation(line: 365, column: 10, scope: !656)
!665 = !DILocation(line: 365, column: 3, scope: !656)
!666 = distinct !DISubprogram(name: "stat", scope: !667, file: !667, line: 453, type: !668, scopeLine: 454, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !707)
!667 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "")
!668 = !DISubroutineType(types: !669)
!669 = !{!230, !235, !670}
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !672, line: 46, size: 1152, elements: !673)
!672 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!673 = !{!674, !676, !678, !680, !682, !684, !686, !687, !688, !689, !691, !693, !701, !702, !703}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !671, file: !672, line: 48, baseType: !675, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !330, line: 145, baseType: !237)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !671, file: !672, line: 53, baseType: !677, size: 64, offset: 64)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !330, line: 148, baseType: !237)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !671, file: !672, line: 61, baseType: !679, size: 64, offset: 128)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !330, line: 151, baseType: !237)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !671, file: !672, line: 62, baseType: !681, size: 32, offset: 192)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !330, line: 150, baseType: !7)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !671, file: !672, line: 64, baseType: !683, size: 32, offset: 224)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !330, line: 146, baseType: !7)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !671, file: !672, line: 65, baseType: !685, size: 32, offset: 256)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !330, line: 147, baseType: !7)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !671, file: !672, line: 67, baseType: !230, size: 32, offset: 288)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !671, file: !672, line: 69, baseType: !675, size: 64, offset: 320)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !671, file: !672, line: 74, baseType: !329, size: 64, offset: 384)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !671, file: !672, line: 78, baseType: !690, size: 64, offset: 448)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !330, line: 174, baseType: !331)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !671, file: !672, line: 80, baseType: !692, size: 64, offset: 512)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !330, line: 179, baseType: !331)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !671, file: !672, line: 91, baseType: !694, size: 128, offset: 576)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !695, line: 10, size: 128, elements: !696)
!695 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!696 = !{!697, !699}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !694, file: !695, line: 12, baseType: !698, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !330, line: 160, baseType: !331)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !694, file: !695, line: 16, baseType: !700, size: 64, offset: 64)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !330, line: 196, baseType: !331)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !671, file: !672, line: 92, baseType: !694, size: 128, offset: 704)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !671, file: !672, line: 93, baseType: !694, size: 128, offset: 832)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !671, file: !672, line: 106, baseType: !704, size: 192, offset: 960)
!704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !700, size: 192, elements: !705)
!705 = !{!706}
!706 = !DISubrange(count: 3)
!707 = !{!708, !709}
!708 = !DILocalVariable(name: "__path", arg: 1, scope: !666, file: !667, line: 453, type: !235)
!709 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !666, file: !667, line: 453, type: !670)
!710 = !DILocation(line: 0, scope: !666)
!711 = !DILocation(line: 455, column: 10, scope: !666)
!712 = !DILocation(line: 455, column: 3, scope: !666)
!713 = distinct !DISubprogram(name: "lstat", scope: !667, file: !667, line: 460, type: !668, scopeLine: 461, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !714)
!714 = !{!715, !716}
!715 = !DILocalVariable(name: "__path", arg: 1, scope: !713, file: !667, line: 460, type: !235)
!716 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !713, file: !667, line: 460, type: !670)
!717 = !DILocation(line: 0, scope: !713)
!718 = !DILocation(line: 462, column: 10, scope: !713)
!719 = !DILocation(line: 462, column: 3, scope: !713)
!720 = distinct !DISubprogram(name: "fstat", scope: !667, file: !667, line: 467, type: !721, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !723)
!721 = !DISubroutineType(types: !722)
!722 = !{!230, !230, !670}
!723 = !{!724, !725}
!724 = !DILocalVariable(name: "__fd", arg: 1, scope: !720, file: !667, line: 467, type: !230)
!725 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !720, file: !667, line: 467, type: !670)
!726 = !DILocation(line: 0, scope: !720)
!727 = !DILocation(line: 469, column: 10, scope: !720)
!728 = !DILocation(line: 469, column: 3, scope: !720)
!729 = distinct !DISubprogram(name: "fstatat", scope: !667, file: !667, line: 474, type: !730, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !732)
!730 = !DISubroutineType(types: !731)
!731 = !{!230, !230, !235, !670, !230}
!732 = !{!733, !734, !735, !736}
!733 = !DILocalVariable(name: "__fd", arg: 1, scope: !729, file: !667, line: 474, type: !230)
!734 = !DILocalVariable(name: "__filename", arg: 2, scope: !729, file: !667, line: 474, type: !235)
!735 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !729, file: !667, line: 474, type: !670)
!736 = !DILocalVariable(name: "__flag", arg: 4, scope: !729, file: !667, line: 474, type: !230)
!737 = !DILocation(line: 0, scope: !729)
!738 = !DILocation(line: 477, column: 10, scope: !729)
!739 = !DILocation(line: 477, column: 3, scope: !729)
!740 = distinct !DISubprogram(name: "mknod", scope: !667, file: !667, line: 483, type: !741, scopeLine: 484, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !743)
!741 = !DISubroutineType(types: !742)
!742 = !{!230, !235, !681, !675}
!743 = !{!744, !745, !746}
!744 = !DILocalVariable(name: "__path", arg: 1, scope: !740, file: !667, line: 483, type: !235)
!745 = !DILocalVariable(name: "__mode", arg: 2, scope: !740, file: !667, line: 483, type: !681)
!746 = !DILocalVariable(name: "__dev", arg: 3, scope: !740, file: !667, line: 483, type: !675)
!747 = !DILocation(line: 0, scope: !740)
!748 = !DILocation(line: 485, column: 10, scope: !740)
!749 = !DILocation(line: 485, column: 3, scope: !740)
!750 = distinct !DISubprogram(name: "mknodat", scope: !667, file: !667, line: 491, type: !751, scopeLine: 493, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !753)
!751 = !DISubroutineType(types: !752)
!752 = !{!230, !230, !235, !681, !675}
!753 = !{!754, !755, !756, !757}
!754 = !DILocalVariable(name: "__fd", arg: 1, scope: !750, file: !667, line: 491, type: !230)
!755 = !DILocalVariable(name: "__path", arg: 2, scope: !750, file: !667, line: 491, type: !235)
!756 = !DILocalVariable(name: "__mode", arg: 3, scope: !750, file: !667, line: 491, type: !681)
!757 = !DILocalVariable(name: "__dev", arg: 4, scope: !750, file: !667, line: 491, type: !675)
!758 = !DILocation(line: 0, scope: !750)
!759 = !DILocation(line: 494, column: 10, scope: !750)
!760 = !DILocation(line: 494, column: 3, scope: !750)
!761 = distinct !DISubprogram(name: "stat64", scope: !667, file: !667, line: 502, type: !762, scopeLine: 503, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !784)
!762 = !DISubroutineType(types: !763)
!763 = !{!230, !235, !764}
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !672, line: 119, size: 1152, elements: !766)
!766 = !{!767, !768, !770, !771, !772, !773, !774, !775, !776, !777, !778, !780, !781, !782, !783}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !765, file: !672, line: 121, baseType: !675, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !765, file: !672, line: 123, baseType: !769, size: 64, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !330, line: 149, baseType: !237)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !765, file: !672, line: 124, baseType: !679, size: 64, offset: 128)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !765, file: !672, line: 125, baseType: !681, size: 32, offset: 192)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !765, file: !672, line: 132, baseType: !683, size: 32, offset: 224)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !765, file: !672, line: 133, baseType: !685, size: 32, offset: 256)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !765, file: !672, line: 135, baseType: !230, size: 32, offset: 288)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !765, file: !672, line: 136, baseType: !675, size: 64, offset: 320)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !765, file: !672, line: 137, baseType: !329, size: 64, offset: 384)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !765, file: !672, line: 143, baseType: !690, size: 64, offset: 448)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !765, file: !672, line: 144, baseType: !779, size: 64, offset: 512)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !330, line: 180, baseType: !331)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !765, file: !672, line: 152, baseType: !694, size: 128, offset: 576)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !765, file: !672, line: 153, baseType: !694, size: 128, offset: 704)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !765, file: !672, line: 154, baseType: !694, size: 128, offset: 832)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !765, file: !672, line: 164, baseType: !704, size: 192, offset: 960)
!784 = !{!785, !786}
!785 = !DILocalVariable(name: "__path", arg: 1, scope: !761, file: !667, line: 502, type: !235)
!786 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !761, file: !667, line: 502, type: !764)
!787 = !DILocation(line: 0, scope: !761)
!788 = !DILocation(line: 504, column: 10, scope: !761)
!789 = !DILocation(line: 504, column: 3, scope: !761)
!790 = distinct !DISubprogram(name: "lstat64", scope: !667, file: !667, line: 509, type: !762, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !791)
!791 = !{!792, !793}
!792 = !DILocalVariable(name: "__path", arg: 1, scope: !790, file: !667, line: 509, type: !235)
!793 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !790, file: !667, line: 509, type: !764)
!794 = !DILocation(line: 0, scope: !790)
!795 = !DILocation(line: 511, column: 10, scope: !790)
!796 = !DILocation(line: 511, column: 3, scope: !790)
!797 = distinct !DISubprogram(name: "fstat64", scope: !667, file: !667, line: 516, type: !798, scopeLine: 517, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !800)
!798 = !DISubroutineType(types: !799)
!799 = !{!230, !230, !764}
!800 = !{!801, !802}
!801 = !DILocalVariable(name: "__fd", arg: 1, scope: !797, file: !667, line: 516, type: !230)
!802 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !797, file: !667, line: 516, type: !764)
!803 = !DILocation(line: 0, scope: !797)
!804 = !DILocation(line: 518, column: 10, scope: !797)
!805 = !DILocation(line: 518, column: 3, scope: !797)
!806 = distinct !DISubprogram(name: "fstatat64", scope: !667, file: !667, line: 523, type: !807, scopeLine: 525, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !809)
!807 = !DISubroutineType(types: !808)
!808 = !{!230, !230, !235, !764, !230}
!809 = !{!810, !811, !812, !813}
!810 = !DILocalVariable(name: "__fd", arg: 1, scope: !806, file: !667, line: 523, type: !230)
!811 = !DILocalVariable(name: "__filename", arg: 2, scope: !806, file: !667, line: 523, type: !235)
!812 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !806, file: !667, line: 523, type: !764)
!813 = !DILocalVariable(name: "__flag", arg: 4, scope: !806, file: !667, line: 523, type: !230)
!814 = !DILocation(line: 0, scope: !806)
!815 = !DILocation(line: 526, column: 10, scope: !806)
!816 = !DILocation(line: 526, column: 3, scope: !806)
!817 = distinct !DISubprogram(name: "debug_print_page_list", scope: !3, file: !3, line: 655, type: !818, scopeLine: 656, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !820)
!818 = !DISubroutineType(types: !819)
!819 = !{null, !230}
!820 = !{!821, !822}
!821 = !DILocalVariable(name: "order", arg: 1, scope: !817, file: !3, line: 655, type: !230)
!822 = !DILocalVariable(name: "p", scope: !817, file: !3, line: 657, type: !244)
!823 = !DILocation(line: 0, scope: !817)
!824 = !DILocation(line: 658, column: 43, scope: !817)
!825 = !DILocation(line: 659, column: 13, scope: !817)
!826 = !DILocation(line: 658, column: 3, scope: !817)
!827 = !DILocation(line: 661, column: 3, scope: !817)
!828 = !DILocation(line: 661, column: 12, scope: !817)
!829 = !DILocation(line: 663, column: 49, scope: !830)
!830 = distinct !DILexicalBlock(scope: !817, file: !3, line: 662, column: 5)
!831 = !DILocation(line: 663, column: 46, scope: !830)
!832 = !DILocation(line: 664, column: 11, scope: !830)
!833 = !DILocation(line: 664, column: 8, scope: !830)
!834 = !DILocation(line: 663, column: 7, scope: !830)
!835 = !DILocation(line: 665, column: 14, scope: !830)
!836 = distinct !{!836, !827, !837}
!837 = !DILocation(line: 666, column: 5, scope: !817)
!838 = !DILocation(line: 667, column: 3, scope: !817)
!839 = !DILocation(line: 668, column: 11, scope: !817)
