; ModuleID = 'gimple-low.bc'
source_filename = "gimple-low.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.gimple_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }

!589 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!590 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!591 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!592 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!593 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!594 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_code", file: !568, line: 51, baseType: !7, size: 32, elements: !595)
!595 = !{!596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631}
!596 = !DIEnumerator(name: "GIMPLE_ERROR_MARK", value: 0, isUnsigned: true)
!597 = !DIEnumerator(name: "GIMPLE_COND", value: 1, isUnsigned: true)
!598 = !DIEnumerator(name: "GIMPLE_DEBUG", value: 2, isUnsigned: true)
!599 = !DIEnumerator(name: "GIMPLE_GOTO", value: 3, isUnsigned: true)
!600 = !DIEnumerator(name: "GIMPLE_LABEL", value: 4, isUnsigned: true)
!601 = !DIEnumerator(name: "GIMPLE_SWITCH", value: 5, isUnsigned: true)
!602 = !DIEnumerator(name: "GIMPLE_ASSIGN", value: 6, isUnsigned: true)
!603 = !DIEnumerator(name: "GIMPLE_ASM", value: 7, isUnsigned: true)
!604 = !DIEnumerator(name: "GIMPLE_CALL", value: 8, isUnsigned: true)
!605 = !DIEnumerator(name: "GIMPLE_RETURN", value: 9, isUnsigned: true)
!606 = !DIEnumerator(name: "GIMPLE_BIND", value: 10, isUnsigned: true)
!607 = !DIEnumerator(name: "GIMPLE_CATCH", value: 11, isUnsigned: true)
!608 = !DIEnumerator(name: "GIMPLE_EH_FILTER", value: 12, isUnsigned: true)
!609 = !DIEnumerator(name: "GIMPLE_EH_MUST_NOT_THROW", value: 13, isUnsigned: true)
!610 = !DIEnumerator(name: "GIMPLE_RESX", value: 14, isUnsigned: true)
!611 = !DIEnumerator(name: "GIMPLE_EH_DISPATCH", value: 15, isUnsigned: true)
!612 = !DIEnumerator(name: "GIMPLE_PHI", value: 16, isUnsigned: true)
!613 = !DIEnumerator(name: "GIMPLE_TRY", value: 17, isUnsigned: true)
!614 = !DIEnumerator(name: "GIMPLE_NOP", value: 18, isUnsigned: true)
!615 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!616 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!617 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!618 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!619 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!620 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!621 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!622 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!623 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!624 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!625 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!626 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!627 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!628 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!629 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!630 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!631 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!632 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_try_flags", file: !568, line: 514, baseType: !7, size: 32, elements: !633)
!633 = !{!634, !635, !636, !637}
!634 = !DIEnumerator(name: "GIMPLE_TRY_CATCH", value: 1, isUnsigned: true)
!635 = !DIEnumerator(name: "GIMPLE_TRY_FINALLY", value: 2, isUnsigned: true)
!636 = !DIEnumerator(name: "GIMPLE_TRY_KIND", value: 3, isUnsigned: true)
!637 = !DIEnumerator(name: "GIMPLE_TRY_CATCH_IS_CLEANUP", value: 4, isUnsigned: true)
!638 = !{!639, !640, !641, !642, !645, !646, !648, !373, !650, !2041, !775, !2043, !7, !973, !2060, !1007, !643, !632}
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!641 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !644)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !649, line: 56, baseType: !650)
!649 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !341, line: 3371, size: 1792, elements: !652)
!652 = !{!653, !686, !692, !705, !724, !735, !740, !749, !755, !768, !780, !818, !1276, !1304, !1321, !1322, !1327, !1336, !1342, !1347, !1351, !1355, !1692, !1739, !1745, !1751, !1758, !1771, !1785, !1802, !1814, !1836, !1851, !2023}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !651, file: !341, line: 3372, baseType: !654, size: 64)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !341, line: 360, size: 64, elements: !655)
!655 = !{!656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !654, file: !341, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !654, file: !341, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !654, file: !341, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !654, file: !341, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !654, file: !341, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !654, file: !341, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !654, file: !341, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !654, file: !341, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !654, file: !341, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !654, file: !341, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !654, file: !341, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !654, file: !341, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !654, file: !341, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !654, file: !341, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !654, file: !341, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !654, file: !341, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !654, file: !341, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !654, file: !341, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !654, file: !341, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !654, file: !341, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !654, file: !341, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !654, file: !341, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !654, file: !341, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !654, file: !341, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !654, file: !341, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !654, file: !341, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !654, file: !341, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !654, file: !341, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !654, file: !341, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !654, file: !341, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !651, file: !341, line: 3373, baseType: !687, size: 192)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !341, line: 402, size: 192, elements: !688)
!688 = !{!689, !690, !691}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !687, file: !341, line: 403, baseType: !654, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !687, file: !341, line: 404, baseType: !648, size: 64, offset: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !687, file: !341, line: 405, baseType: !648, size: 64, offset: 128)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !651, file: !341, line: 3374, baseType: !693, size: 320)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !341, line: 1384, size: 320, elements: !694)
!694 = !{!695, !696}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !693, file: !341, line: 1385, baseType: !687, size: 192)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !693, file: !341, line: 1386, baseType: !697, size: 128, offset: 192)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !698, line: 58, baseType: !699)
!698 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !698, line: 54, size: 128, elements: !700)
!700 = !{!701, !703}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !699, file: !698, line: 56, baseType: !702, size: 64)
!702 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !699, file: !698, line: 57, baseType: !704, size: 64, offset: 64)
!704 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !651, file: !341, line: 3375, baseType: !706, size: 256)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !341, line: 1397, size: 256, elements: !707)
!707 = !{!708, !709}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !706, file: !341, line: 1398, baseType: !687, size: 192)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !706, file: !341, line: 1399, baseType: !710, size: 64, offset: 192)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !712, line: 52, size: 256, elements: !713)
!712 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!713 = !{!714, !715, !716, !717, !718, !719, !720}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !711, file: !712, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !711, file: !712, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !711, file: !712, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !711, file: !712, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !711, file: !712, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !711, file: !712, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !711, file: !712, line: 62, baseType: !721, size: 192, offset: 64)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !702, size: 192, elements: !722)
!722 = !{!723}
!723 = !DISubrange(count: 3)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !651, file: !341, line: 3376, baseType: !725, size: 256)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !341, line: 1408, size: 256, elements: !726)
!726 = !{!727, !728}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !725, file: !341, line: 1409, baseType: !687, size: 192)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !725, file: !341, line: 1410, baseType: !729, size: 64, offset: 192)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !731, line: 27, size: 192, elements: !732)
!731 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!732 = !{!733, !734}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !730, file: !731, line: 29, baseType: !697, size: 128)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !730, file: !731, line: 30, baseType: !189, size: 32, offset: 128)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !651, file: !341, line: 3377, baseType: !736, size: 256)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !341, line: 1437, size: 256, elements: !737)
!737 = !{!738, !739}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !736, file: !341, line: 1438, baseType: !687, size: 192)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !736, file: !341, line: 1439, baseType: !648, size: 64, offset: 192)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !651, file: !341, line: 3378, baseType: !741, size: 256)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !341, line: 1418, size: 256, elements: !742)
!742 = !{!743, !744, !745}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !741, file: !341, line: 1419, baseType: !687, size: 192)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !741, file: !341, line: 1420, baseType: !641, size: 32, offset: 192)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !741, file: !341, line: 1421, baseType: !746, size: 8, offset: 224)
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !644, size: 8, elements: !747)
!747 = !{!748}
!748 = !DISubrange(count: 1)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !651, file: !341, line: 3379, baseType: !750, size: 320)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !341, line: 1428, size: 320, elements: !751)
!751 = !{!752, !753, !754}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !750, file: !341, line: 1429, baseType: !687, size: 192)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !750, file: !341, line: 1430, baseType: !648, size: 64, offset: 192)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !750, file: !341, line: 1431, baseType: !648, size: 64, offset: 256)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !651, file: !341, line: 3380, baseType: !756, size: 320)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !341, line: 1460, size: 320, elements: !757)
!757 = !{!758, !759}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !756, file: !341, line: 1461, baseType: !687, size: 192)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !756, file: !341, line: 1462, baseType: !760, size: 128, offset: 192)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !761, line: 31, size: 128, elements: !762)
!761 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!762 = !{!763, !766, !767}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !760, file: !761, line: 32, baseType: !764, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !640)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !760, file: !761, line: 33, baseType: !7, size: 32, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !760, file: !761, line: 34, baseType: !7, size: 32, offset: 96)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !651, file: !341, line: 3381, baseType: !769, size: 384)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !341, line: 2507, size: 384, elements: !770)
!770 = !{!771, !772, !777, !778, !779}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !769, file: !341, line: 2508, baseType: !687, size: 192)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !769, file: !341, line: 2509, baseType: !773, size: 32, offset: 192)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !774, line: 58, baseType: !775)
!774 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !776, line: 44, baseType: !7)
!776 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!777 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !769, file: !341, line: 2510, baseType: !7, size: 32, offset: 224)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !769, file: !341, line: 2511, baseType: !648, size: 64, offset: 256)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !769, file: !341, line: 2512, baseType: !648, size: 64, offset: 320)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !651, file: !341, line: 3382, baseType: !781, size: 896)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !341, line: 2652, size: 896, elements: !782)
!782 = !{!783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !781, file: !341, line: 2653, baseType: !769, size: 384)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !781, file: !341, line: 2654, baseType: !648, size: 64, offset: 384)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !781, file: !341, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !781, file: !341, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !781, file: !341, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !781, file: !341, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !781, file: !341, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !781, file: !341, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !781, file: !341, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !781, file: !341, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !781, file: !341, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !781, file: !341, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !781, file: !341, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !781, file: !341, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !781, file: !341, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !781, file: !341, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !781, file: !341, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !781, file: !341, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !781, file: !341, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !781, file: !341, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !781, file: !341, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !781, file: !341, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !781, file: !341, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !781, file: !341, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !781, file: !341, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !781, file: !341, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !781, file: !341, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !781, file: !341, line: 2703, baseType: !7, size: 32, offset: 512)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !781, file: !341, line: 2705, baseType: !648, size: 64, offset: 576)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !781, file: !341, line: 2706, baseType: !648, size: 64, offset: 640)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !781, file: !341, line: 2707, baseType: !648, size: 64, offset: 704)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !781, file: !341, line: 2708, baseType: !648, size: 64, offset: 768)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !781, file: !341, line: 2711, baseType: !816, size: 64, offset: 832)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !341, line: 2711, flags: DIFlagFwdDecl)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !651, file: !341, line: 3383, baseType: !819, size: 960)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !341, line: 2756, size: 960, elements: !820)
!820 = !{!821, !822}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !819, file: !341, line: 2757, baseType: !781, size: 896)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !819, file: !341, line: 2758, baseType: !823, size: 64, offset: 896)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !649, line: 50, baseType: !824)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !826, line: 240, size: 384, elements: !827)
!826 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!827 = !{!828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !825, file: !826, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !825, file: !826, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !825, file: !826, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !825, file: !826, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !825, file: !826, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !825, file: !826, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !825, file: !826, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !825, file: !826, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !825, file: !826, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !825, file: !826, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !825, file: !826, line: 321, baseType: !839, size: 320, offset: 64)
!839 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !826, line: 315, size: 320, elements: !840)
!840 = !{!841, !1243, !1245, !1274, !1275}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !839, file: !826, line: 316, baseType: !842, size: 64)
!842 = !DICompositeType(tag: DW_TAG_array_type, baseType: !843, size: 64, elements: !747)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !826, line: 183, baseType: !844)
!844 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !826, line: 166, size: 64, elements: !845)
!845 = !{!846, !847, !848, !849, !850, !858, !859, !871, !874, !934, !935, !1220, !1233, !1240}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !844, file: !826, line: 168, baseType: !641, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !844, file: !826, line: 169, baseType: !7, size: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !844, file: !826, line: 170, baseType: !646, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !844, file: !826, line: 171, baseType: !823, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !844, file: !826, line: 172, baseType: !851, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !649, line: 53, baseType: !852)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !826, line: 359, size: 128, elements: !854)
!854 = !{!855, !856}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !853, file: !826, line: 360, baseType: !641, size: 32)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !853, file: !826, line: 361, baseType: !857, size: 64, offset: 64)
!857 = !DICompositeType(tag: DW_TAG_array_type, baseType: !823, size: 64, elements: !747)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !844, file: !826, line: 173, baseType: !189, size: 32)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !844, file: !826, line: 174, baseType: !860, size: 32)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !826, line: 133, baseType: !861)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !826, line: 115, size: 32, elements: !862)
!862 = !{!863, !864, !865, !866, !867, !868, !869, !870}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !861, file: !826, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !861, file: !826, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !861, file: !826, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !861, file: !826, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !861, file: !826, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !861, file: !826, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !861, file: !826, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !861, file: !826, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !844, file: !826, line: 175, baseType: !872, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !826, line: 175, flags: DIFlagFwdDecl)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !844, file: !826, line: 176, baseType: !875, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !877, line: 75, size: 256, elements: !878)
!877 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!878 = !{!879, !893, !894, !895}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !876, file: !877, line: 76, baseType: !880, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !877, line: 68, baseType: !882)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !877, line: 63, size: 320, elements: !883)
!883 = !{!884, !886, !887, !888}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !882, file: !877, line: 64, baseType: !885, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !882, file: !877, line: 65, baseType: !885, size: 64, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !882, file: !877, line: 66, baseType: !7, size: 32, offset: 128)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !882, file: !877, line: 67, baseType: !889, size: 128, offset: 192)
!889 = !DICompositeType(tag: DW_TAG_array_type, baseType: !890, size: 128, elements: !891)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !877, line: 29, baseType: !702)
!891 = !{!892}
!892 = !DISubrange(count: 2)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !876, file: !877, line: 77, baseType: !880, size: 64, offset: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !876, file: !877, line: 78, baseType: !7, size: 32, offset: 128)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !876, file: !877, line: 79, baseType: !896, size: 64, offset: 192)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !877, line: 49, baseType: !898)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !877, line: 45, size: 832, elements: !899)
!899 = !{!900, !901, !902}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !898, file: !877, line: 46, baseType: !885, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !898, file: !877, line: 47, baseType: !875, size: 64, offset: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !898, file: !877, line: 48, baseType: !903, size: 704, offset: 128)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !904, line: 164, size: 704, elements: !905)
!904 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!905 = !{!906, !907, !917, !918, !919, !920, !921, !922, !926, !930, !931, !932, !933}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !903, file: !904, line: 166, baseType: !704, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !903, file: !904, line: 167, baseType: !908, size: 64, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !904, line: 157, size: 192, elements: !910)
!910 = !{!911, !912, !913}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !909, file: !904, line: 159, baseType: !643, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !909, file: !904, line: 160, baseType: !908, size: 64, offset: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !909, file: !904, line: 161, baseType: !914, size: 32, offset: 128)
!914 = !DICompositeType(tag: DW_TAG_array_type, baseType: !644, size: 32, elements: !915)
!915 = !{!916}
!916 = !DISubrange(count: 4)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !903, file: !904, line: 168, baseType: !643, size: 64, offset: 128)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !903, file: !904, line: 169, baseType: !643, size: 64, offset: 192)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !903, file: !904, line: 170, baseType: !643, size: 64, offset: 256)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !903, file: !904, line: 171, baseType: !704, size: 64, offset: 320)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !903, file: !904, line: 172, baseType: !641, size: 32, offset: 384)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !903, file: !904, line: 176, baseType: !923, size: 64, offset: 448)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DISubroutineType(types: !925)
!925 = !{!908, !645, !704}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !903, file: !904, line: 177, baseType: !927, size: 64, offset: 512)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DISubroutineType(types: !929)
!929 = !{null, !645, !908}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !903, file: !904, line: 178, baseType: !645, size: 64, offset: 576)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !903, file: !904, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !903, file: !904, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !903, file: !904, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !844, file: !826, line: 177, baseType: !648, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !844, file: !826, line: 178, baseType: !936, size: 64)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !325, line: 217, size: 832, elements: !938)
!938 = !{!939, !1185, !1186, !1187, !1190, !1194, !1195, !1196, !1214, !1215, !1216, !1217, !1218, !1219}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !937, file: !325, line: 219, baseType: !940, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !325, line: 151, baseType: !942)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !325, line: 151, size: 128, elements: !943)
!943 = !{!944}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !942, file: !325, line: 151, baseType: !945, size: 128)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !325, line: 150, baseType: !946)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !325, line: 150, size: 128, elements: !947)
!947 = !{!948, !949, !950}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !946, file: !325, line: 150, baseType: !7, size: 32)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !946, file: !325, line: 150, baseType: !7, size: 32, offset: 32)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !946, file: !325, line: 150, baseType: !951, size: 64, offset: 64)
!951 = !DICompositeType(tag: DW_TAG_array_type, baseType: !952, size: 64, elements: !747)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !649, line: 108, baseType: !953)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !325, line: 122, size: 512, elements: !955)
!955 = !{!956, !957, !958, !1177, !1178, !1179, !1180, !1181, !1182, !1183}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !954, file: !325, line: 124, baseType: !936, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !954, file: !325, line: 125, baseType: !936, size: 64, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !954, file: !325, line: 131, baseType: !959, size: 64, offset: 128)
!959 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !325, line: 128, size: 64, elements: !960)
!960 = !{!961, !1176}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !959, file: !325, line: 129, baseType: !962, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !649, line: 66, baseType: !963)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !568, line: 143, size: 192, elements: !965)
!965 = !{!966, !1174, !1175}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !964, file: !568, line: 145, baseType: !967, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !649, line: 69, baseType: !968)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !568, line: 136, size: 192, elements: !970)
!970 = !{!971, !1172, !1173}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !969, file: !568, line: 137, baseType: !972, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !649, line: 58, baseType: !973)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !568, line: 737, size: 768, elements: !975)
!975 = !{!976, !993, !1027, !1033, !1038, !1043, !1050, !1056, !1062, !1067, !1081, !1086, !1092, !1097, !1107, !1112, !1130, !1137, !1144, !1150, !1155, !1161, !1167}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !974, file: !568, line: 738, baseType: !977, size: 256)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !568, line: 271, size: 256, elements: !978)
!978 = !{!979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !977, file: !568, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !977, file: !568, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !977, file: !568, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !977, file: !568, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !977, file: !568, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !977, file: !568, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !977, file: !568, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !977, file: !568, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !977, file: !568, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !977, file: !568, line: 312, baseType: !7, size: 32, offset: 32)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !977, file: !568, line: 316, baseType: !773, size: 32, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !977, file: !568, line: 319, baseType: !7, size: 32, offset: 96)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !977, file: !568, line: 323, baseType: !936, size: 64, offset: 128)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !977, file: !568, line: 327, baseType: !648, size: 64, offset: 192)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !974, file: !568, line: 739, baseType: !994, size: 448)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !568, line: 350, size: 448, elements: !995)
!995 = !{!996, !1025}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !994, file: !568, line: 353, baseType: !997, size: 384)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !568, line: 333, size: 384, elements: !998)
!998 = !{!999, !1000, !1008}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !997, file: !568, line: 336, baseType: !977, size: 256)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !997, file: !568, line: 343, baseType: !1001, size: 64, offset: 256)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1003, line: 37, size: 128, elements: !1004)
!1003 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1004 = !{!1005, !1006}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1002, file: !1003, line: 39, baseType: !1001, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1002, file: !1003, line: 40, baseType: !1007, size: 64, offset: 64)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !997, file: !568, line: 344, baseType: !1009, size: 64, offset: 320)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1003, line: 45, size: 320, elements: !1011)
!1011 = !{!1012, !1013}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1010, file: !1003, line: 47, baseType: !1009, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1010, file: !1003, line: 48, baseType: !1014, size: 256, offset: 64)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !341, line: 1883, size: 256, elements: !1015)
!1015 = !{!1016, !1018, !1019, !1024}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1014, file: !341, line: 1884, baseType: !1017, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1014, file: !341, line: 1885, baseType: !1017, size: 64, offset: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1014, file: !341, line: 1891, baseType: !1020, size: 64, offset: 128)
!1020 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1014, file: !341, line: 1891, size: 64, elements: !1021)
!1021 = !{!1022, !1023}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1020, file: !341, line: 1891, baseType: !972, size: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1020, file: !341, line: 1891, baseType: !648, size: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1014, file: !341, line: 1892, baseType: !1007, size: 64, offset: 192)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !994, file: !568, line: 359, baseType: !1026, size: 64, offset: 384)
!1026 = !DICompositeType(tag: DW_TAG_array_type, baseType: !648, size: 64, elements: !747)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !974, file: !568, line: 740, baseType: !1028, size: 512)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !568, line: 365, size: 512, elements: !1029)
!1029 = !{!1030, !1031, !1032}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1028, file: !568, line: 368, baseType: !997, size: 384)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1028, file: !568, line: 373, baseType: !648, size: 64, offset: 384)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1028, file: !568, line: 374, baseType: !648, size: 64, offset: 448)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !974, file: !568, line: 741, baseType: !1034, size: 576)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !568, line: 380, size: 576, elements: !1035)
!1035 = !{!1036, !1037}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1034, file: !568, line: 383, baseType: !1028, size: 512)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1034, file: !568, line: 389, baseType: !1026, size: 64, offset: 512)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !974, file: !568, line: 742, baseType: !1039, size: 320)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !568, line: 395, size: 320, elements: !1040)
!1040 = !{!1041, !1042}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1039, file: !568, line: 397, baseType: !977, size: 256)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1039, file: !568, line: 400, baseType: !962, size: 64, offset: 256)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !974, file: !568, line: 743, baseType: !1044, size: 448)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !568, line: 406, size: 448, elements: !1045)
!1045 = !{!1046, !1047, !1048, !1049}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1044, file: !568, line: 408, baseType: !977, size: 256)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1044, file: !568, line: 412, baseType: !648, size: 64, offset: 256)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1044, file: !568, line: 420, baseType: !648, size: 64, offset: 320)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1044, file: !568, line: 423, baseType: !962, size: 64, offset: 384)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !974, file: !568, line: 744, baseType: !1051, size: 384)
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !568, line: 429, size: 384, elements: !1052)
!1052 = !{!1053, !1054, !1055}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1051, file: !568, line: 431, baseType: !977, size: 256)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1051, file: !568, line: 434, baseType: !648, size: 64, offset: 256)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1051, file: !568, line: 437, baseType: !962, size: 64, offset: 320)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !974, file: !568, line: 745, baseType: !1057, size: 384)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !568, line: 443, size: 384, elements: !1058)
!1058 = !{!1059, !1060, !1061}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1057, file: !568, line: 445, baseType: !977, size: 256)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1057, file: !568, line: 449, baseType: !648, size: 64, offset: 256)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1057, file: !568, line: 453, baseType: !962, size: 64, offset: 320)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !974, file: !568, line: 746, baseType: !1063, size: 320)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !568, line: 459, size: 320, elements: !1064)
!1064 = !{!1065, !1066}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1063, file: !568, line: 461, baseType: !977, size: 256)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1063, file: !568, line: 464, baseType: !648, size: 64, offset: 256)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !974, file: !568, line: 747, baseType: !1068, size: 768)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !568, line: 469, size: 768, elements: !1069)
!1069 = !{!1070, !1071, !1072, !1073, !1074}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1068, file: !568, line: 471, baseType: !977, size: 256)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1068, file: !568, line: 474, baseType: !7, size: 32, offset: 256)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1068, file: !568, line: 475, baseType: !7, size: 32, offset: 288)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1068, file: !568, line: 478, baseType: !648, size: 64, offset: 320)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1068, file: !568, line: 481, baseType: !1075, size: 384, offset: 384)
!1075 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1076, size: 384, elements: !747)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !341, line: 1917, size: 384, elements: !1077)
!1077 = !{!1078, !1079, !1080}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1076, file: !341, line: 1920, baseType: !1014, size: 256)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1076, file: !341, line: 1921, baseType: !648, size: 64, offset: 256)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1076, file: !341, line: 1922, baseType: !773, size: 32, offset: 320)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !974, file: !568, line: 748, baseType: !1082, size: 320)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !568, line: 487, size: 320, elements: !1083)
!1083 = !{!1084, !1085}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1082, file: !568, line: 490, baseType: !977, size: 256)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1082, file: !568, line: 494, baseType: !641, size: 32, offset: 256)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !974, file: !568, line: 749, baseType: !1087, size: 384)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !568, line: 500, size: 384, elements: !1088)
!1088 = !{!1089, !1090, !1091}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1087, file: !568, line: 502, baseType: !977, size: 256)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1087, file: !568, line: 506, baseType: !962, size: 64, offset: 256)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1087, file: !568, line: 510, baseType: !962, size: 64, offset: 320)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !974, file: !568, line: 750, baseType: !1093, size: 320)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !568, line: 529, size: 320, elements: !1094)
!1094 = !{!1095, !1096}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1093, file: !568, line: 531, baseType: !977, size: 256)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1093, file: !568, line: 540, baseType: !962, size: 64, offset: 256)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !974, file: !568, line: 751, baseType: !1098, size: 704)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !568, line: 546, size: 704, elements: !1099)
!1099 = !{!1100, !1101, !1102, !1103, !1104, !1105, !1106}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1098, file: !568, line: 549, baseType: !1028, size: 512)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1098, file: !568, line: 553, baseType: !646, size: 64, offset: 512)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1098, file: !568, line: 557, baseType: !640, size: 8, offset: 576)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1098, file: !568, line: 558, baseType: !640, size: 8, offset: 584)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1098, file: !568, line: 559, baseType: !640, size: 8, offset: 592)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1098, file: !568, line: 560, baseType: !640, size: 8, offset: 600)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1098, file: !568, line: 566, baseType: !1026, size: 64, offset: 640)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !974, file: !568, line: 752, baseType: !1108, size: 384)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !568, line: 571, size: 384, elements: !1109)
!1109 = !{!1110, !1111}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1108, file: !568, line: 573, baseType: !1039, size: 320)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1108, file: !568, line: 577, baseType: !648, size: 64, offset: 320)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !974, file: !568, line: 753, baseType: !1113, size: 576)
!1113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !568, line: 600, size: 576, elements: !1114)
!1114 = !{!1115, !1116, !1117, !1120, !1129}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1113, file: !568, line: 602, baseType: !1039, size: 320)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1113, file: !568, line: 605, baseType: !648, size: 64, offset: 320)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1113, file: !568, line: 609, baseType: !1118, size: 64, offset: 384)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1119, line: 46, baseType: !702)
!1119 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1113, file: !568, line: 612, baseType: !1121, size: 64, offset: 448)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !568, line: 581, size: 320, elements: !1123)
!1123 = !{!1124, !1125, !1126, !1127, !1128}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1122, file: !568, line: 583, baseType: !373, size: 32)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1122, file: !568, line: 586, baseType: !648, size: 64, offset: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1122, file: !568, line: 589, baseType: !648, size: 64, offset: 128)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1122, file: !568, line: 592, baseType: !648, size: 64, offset: 192)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1122, file: !568, line: 595, baseType: !648, size: 64, offset: 256)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1113, file: !568, line: 616, baseType: !962, size: 64, offset: 512)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !974, file: !568, line: 754, baseType: !1131, size: 512)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !568, line: 622, size: 512, elements: !1132)
!1132 = !{!1133, !1134, !1135, !1136}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1131, file: !568, line: 624, baseType: !1039, size: 320)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1131, file: !568, line: 628, baseType: !648, size: 64, offset: 320)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1131, file: !568, line: 632, baseType: !648, size: 64, offset: 384)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1131, file: !568, line: 636, baseType: !648, size: 64, offset: 448)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !974, file: !568, line: 755, baseType: !1138, size: 704)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !568, line: 642, size: 704, elements: !1139)
!1139 = !{!1140, !1141, !1142, !1143}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1138, file: !568, line: 644, baseType: !1131, size: 512)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1138, file: !568, line: 648, baseType: !648, size: 64, offset: 512)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1138, file: !568, line: 652, baseType: !648, size: 64, offset: 576)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1138, file: !568, line: 653, baseType: !648, size: 64, offset: 640)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !974, file: !568, line: 756, baseType: !1145, size: 448)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !568, line: 663, size: 448, elements: !1146)
!1146 = !{!1147, !1148, !1149}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1145, file: !568, line: 665, baseType: !1039, size: 320)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1145, file: !568, line: 668, baseType: !648, size: 64, offset: 320)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1145, file: !568, line: 673, baseType: !648, size: 64, offset: 384)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !974, file: !568, line: 757, baseType: !1151, size: 384)
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !568, line: 694, size: 384, elements: !1152)
!1152 = !{!1153, !1154}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1151, file: !568, line: 696, baseType: !1039, size: 320)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1151, file: !568, line: 699, baseType: !648, size: 64, offset: 320)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !974, file: !568, line: 758, baseType: !1156, size: 384)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !568, line: 681, size: 384, elements: !1157)
!1157 = !{!1158, !1159, !1160}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1156, file: !568, line: 683, baseType: !977, size: 256)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1156, file: !568, line: 686, baseType: !648, size: 64, offset: 256)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1156, file: !568, line: 689, baseType: !648, size: 64, offset: 320)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !974, file: !568, line: 759, baseType: !1162, size: 384)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !568, line: 707, size: 384, elements: !1163)
!1163 = !{!1164, !1165, !1166}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1162, file: !568, line: 709, baseType: !977, size: 256)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1162, file: !568, line: 712, baseType: !648, size: 64, offset: 256)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1162, file: !568, line: 712, baseType: !648, size: 64, offset: 320)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !974, file: !568, line: 760, baseType: !1168, size: 320)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !568, line: 718, size: 320, elements: !1169)
!1169 = !{!1170, !1171}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1168, file: !568, line: 720, baseType: !977, size: 256)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1168, file: !568, line: 723, baseType: !648, size: 64, offset: 256)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !969, file: !568, line: 138, baseType: !968, size: 64, offset: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !969, file: !568, line: 139, baseType: !968, size: 64, offset: 128)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !964, file: !568, line: 146, baseType: !967, size: 64, offset: 64)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !964, file: !568, line: 152, baseType: !962, size: 64, offset: 128)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !959, file: !325, line: 130, baseType: !823, size: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !954, file: !325, line: 134, baseType: !645, size: 64, offset: 192)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !954, file: !325, line: 137, baseType: !648, size: 64, offset: 256)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !954, file: !325, line: 138, baseType: !773, size: 32, offset: 320)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !954, file: !325, line: 142, baseType: !7, size: 32, offset: 352)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !954, file: !325, line: 144, baseType: !641, size: 32, offset: 384)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !954, file: !325, line: 145, baseType: !641, size: 32, offset: 416)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !954, file: !325, line: 146, baseType: !1184, size: 64, offset: 448)
!1184 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !325, line: 119, baseType: !704)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !937, file: !325, line: 220, baseType: !940, size: 64, offset: 64)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !937, file: !325, line: 223, baseType: !645, size: 64, offset: 128)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !937, file: !325, line: 226, baseType: !1188, size: 64, offset: 192)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64)
!1189 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !325, line: 185, flags: DIFlagFwdDecl)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !937, file: !325, line: 229, baseType: !1191, size: 128, offset: 256)
!1191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1192, size: 128, elements: !891)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1193, size: 64)
!1193 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !325, line: 229, flags: DIFlagFwdDecl)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !937, file: !325, line: 232, baseType: !936, size: 64, offset: 384)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !937, file: !325, line: 233, baseType: !936, size: 64, offset: 448)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !937, file: !325, line: 238, baseType: !1197, size: 64, offset: 512)
!1197 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !325, line: 235, size: 64, elements: !1198)
!1198 = !{!1199, !1205}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1197, file: !325, line: 236, baseType: !1200, size: 64)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64)
!1201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !325, line: 273, size: 128, elements: !1202)
!1202 = !{!1203, !1204}
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1201, file: !325, line: 275, baseType: !962, size: 64)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1201, file: !325, line: 278, baseType: !962, size: 64, offset: 64)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1197, file: !325, line: 237, baseType: !1206, size: 64)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64)
!1207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !325, line: 259, size: 320, elements: !1208)
!1208 = !{!1209, !1210, !1211, !1212, !1213}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1207, file: !325, line: 261, baseType: !823, size: 64)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1207, file: !325, line: 262, baseType: !823, size: 64, offset: 64)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1207, file: !325, line: 266, baseType: !823, size: 64, offset: 128)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1207, file: !325, line: 267, baseType: !823, size: 64, offset: 192)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1207, file: !325, line: 270, baseType: !641, size: 32, offset: 256)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !937, file: !325, line: 241, baseType: !1184, size: 64, offset: 576)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !937, file: !325, line: 244, baseType: !641, size: 32, offset: 640)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !937, file: !325, line: 247, baseType: !641, size: 32, offset: 672)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !937, file: !325, line: 250, baseType: !641, size: 32, offset: 704)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !937, file: !325, line: 253, baseType: !641, size: 32, offset: 736)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !937, file: !325, line: 256, baseType: !641, size: 32, offset: 768)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !844, file: !826, line: 179, baseType: !1221, size: 64)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64)
!1222 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !826, line: 150, baseType: !1223)
!1223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !826, line: 142, size: 320, elements: !1224)
!1224 = !{!1225, !1226, !1227, !1228, !1231, !1232}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1223, file: !826, line: 144, baseType: !648, size: 64)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1223, file: !826, line: 145, baseType: !823, size: 64, offset: 64)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1223, file: !826, line: 146, baseType: !823, size: 64, offset: 128)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1223, file: !826, line: 147, baseType: !1229, size: 32, offset: 192)
!1229 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1230, line: 31, baseType: !641)
!1230 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1223, file: !826, line: 148, baseType: !7, size: 32, offset: 224)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1223, file: !826, line: 149, baseType: !640, size: 8, offset: 256)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !844, file: !826, line: 180, baseType: !1234, size: 64)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64)
!1235 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !826, line: 162, baseType: !1236)
!1236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !826, line: 159, size: 128, elements: !1237)
!1237 = !{!1238, !1239}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1236, file: !826, line: 160, baseType: !648, size: 64)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1236, file: !826, line: 161, baseType: !704, size: 64, offset: 64)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !844, file: !826, line: 181, baseType: !1241, size: 64)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64)
!1242 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !826, line: 181, flags: DIFlagFwdDecl)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !839, file: !826, line: 317, baseType: !1244, size: 64)
!1244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !704, size: 64, elements: !747)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !839, file: !826, line: 318, baseType: !1246, size: 320)
!1246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !826, line: 188, size: 320, elements: !1247)
!1247 = !{!1248, !1250, !1273}
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1246, file: !826, line: 190, baseType: !1249, size: 192)
!1249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !843, size: 192, elements: !722)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1246, file: !826, line: 193, baseType: !1251, size: 64, offset: 192)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !826, line: 206, size: 320, elements: !1253)
!1253 = !{!1254, !1258, !1259, !1260, !1272}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1252, file: !826, line: 208, baseType: !1255, size: 64)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64)
!1256 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !649, line: 62, baseType: !1257)
!1257 = !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !649, line: 61, flags: DIFlagFwdDecl)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1252, file: !826, line: 211, baseType: !7, size: 32, offset: 64)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1252, file: !826, line: 214, baseType: !704, size: 64, offset: 128)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1252, file: !826, line: 224, baseType: !1261, size: 64, offset: 192)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64)
!1262 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !826, line: 202, baseType: !1263)
!1263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !826, line: 202, size: 128, elements: !1264)
!1264 = !{!1265}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1263, file: !826, line: 202, baseType: !1266, size: 128)
!1266 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !826, line: 200, baseType: !1267)
!1267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !826, line: 200, size: 128, elements: !1268)
!1268 = !{!1269, !1270, !1271}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1267, file: !826, line: 200, baseType: !7, size: 32)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1267, file: !826, line: 200, baseType: !7, size: 32, offset: 32)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1267, file: !826, line: 200, baseType: !857, size: 64, offset: 64)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1252, file: !826, line: 234, baseType: !1261, size: 64, offset: 256)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1246, file: !826, line: 197, baseType: !704, size: 64, offset: 256)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !839, file: !826, line: 319, baseType: !711, size: 256)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !839, file: !826, line: 320, baseType: !730, size: 192)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !651, file: !341, line: 3384, baseType: !1277, size: 1472)
!1277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !341, line: 3114, size: 1472, elements: !1278)
!1278 = !{!1279, !1300, !1301, !1302, !1303}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1277, file: !341, line: 3115, baseType: !1280, size: 1216)
!1280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !341, line: 2984, size: 1216, elements: !1281)
!1281 = !{!1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1280, file: !341, line: 2985, baseType: !819, size: 960)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1280, file: !341, line: 2986, baseType: !648, size: 64, offset: 960)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1280, file: !341, line: 2987, baseType: !648, size: 64, offset: 1024)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1280, file: !341, line: 2988, baseType: !648, size: 64, offset: 1088)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1280, file: !341, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1280, file: !341, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1280, file: !341, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1280, file: !341, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1280, file: !341, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1280, file: !341, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1280, file: !341, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1280, file: !341, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1280, file: !341, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1280, file: !341, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1280, file: !341, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1280, file: !341, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1280, file: !341, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1280, file: !341, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1277, file: !341, line: 3117, baseType: !648, size: 64, offset: 1216)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1277, file: !341, line: 3119, baseType: !648, size: 64, offset: 1280)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1277, file: !341, line: 3121, baseType: !648, size: 64, offset: 1344)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1277, file: !341, line: 3123, baseType: !648, size: 64, offset: 1408)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !651, file: !341, line: 3385, baseType: !1305, size: 1088)
!1305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !341, line: 2874, size: 1088, elements: !1306)
!1306 = !{!1307, !1308, !1309}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1305, file: !341, line: 2875, baseType: !819, size: 960)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1305, file: !341, line: 2876, baseType: !823, size: 64, offset: 960)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1305, file: !341, line: 2877, baseType: !1310, size: 64, offset: 1024)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64)
!1311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1312, line: 172, size: 128, elements: !1313)
!1312 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1313 = !{!1314, !1315, !1316, !1317, !1318, !1319, !1320}
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1311, file: !1312, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1311, file: !1312, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1311, file: !1312, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1311, file: !1312, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1311, file: !1312, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1311, file: !1312, line: 195, baseType: !7, size: 32, offset: 32)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1311, file: !1312, line: 199, baseType: !648, size: 64, offset: 64)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !651, file: !341, line: 3386, baseType: !1280, size: 1216)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !651, file: !341, line: 3387, baseType: !1323, size: 1280)
!1323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !341, line: 3093, size: 1280, elements: !1324)
!1324 = !{!1325, !1326}
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1323, file: !341, line: 3094, baseType: !1280, size: 1216)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1323, file: !341, line: 3095, baseType: !1310, size: 64, offset: 1216)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !651, file: !341, line: 3388, baseType: !1328, size: 1216)
!1328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !341, line: 2824, size: 1216, elements: !1329)
!1329 = !{!1330, !1331, !1332, !1333, !1334, !1335}
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1328, file: !341, line: 2825, baseType: !781, size: 896)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1328, file: !341, line: 2827, baseType: !648, size: 64, offset: 896)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1328, file: !341, line: 2828, baseType: !648, size: 64, offset: 960)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1328, file: !341, line: 2829, baseType: !648, size: 64, offset: 1024)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1328, file: !341, line: 2830, baseType: !648, size: 64, offset: 1088)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1328, file: !341, line: 2831, baseType: !648, size: 64, offset: 1152)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !651, file: !341, line: 3389, baseType: !1337, size: 1024)
!1337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !341, line: 2850, size: 1024, elements: !1338)
!1338 = !{!1339, !1340, !1341}
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1337, file: !341, line: 2851, baseType: !819, size: 960)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1337, file: !341, line: 2852, baseType: !641, size: 32, offset: 960)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1337, file: !341, line: 2853, baseType: !641, size: 32, offset: 992)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !651, file: !341, line: 3390, baseType: !1343, size: 1024)
!1343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !341, line: 2857, size: 1024, elements: !1344)
!1344 = !{!1345, !1346}
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1343, file: !341, line: 2858, baseType: !819, size: 960)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1343, file: !341, line: 2859, baseType: !1310, size: 64, offset: 960)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !651, file: !341, line: 3391, baseType: !1348, size: 960)
!1348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !341, line: 2862, size: 960, elements: !1349)
!1349 = !{!1350}
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1348, file: !341, line: 2863, baseType: !819, size: 960)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !651, file: !341, line: 3392, baseType: !1352, size: 1472)
!1352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !341, line: 3304, size: 1472, elements: !1353)
!1353 = !{!1354}
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1352, file: !341, line: 3305, baseType: !1277, size: 1472)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !651, file: !341, line: 3393, baseType: !1356, size: 1792)
!1356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !341, line: 3248, size: 1792, elements: !1357)
!1357 = !{!1358, !1359, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691}
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1356, file: !341, line: 3249, baseType: !1277, size: 1472)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1356, file: !341, line: 3251, baseType: !1360, size: 64, offset: 1472)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64)
!1361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1362, line: 463, size: 1152, elements: !1363)
!1362 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1363 = !{!1364, !1525, !1556, !1557, !1612, !1615, !1616, !1617, !1618, !1619, !1620, !1644, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1361, file: !1362, line: 464, baseType: !1365, size: 64)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64)
!1366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !318, line: 194, size: 384, elements: !1367)
!1367 = !{!1368, !1417, !1430, !1444, !1494, !1506}
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !1366, file: !318, line: 197, baseType: !1369, size: 64)
!1369 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !318, line: 182, baseType: !1370)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64)
!1371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !318, line: 116, size: 704, elements: !1372)
!1372 = !{!1373, !1374, !1375, !1376, !1377, !1378, !1405, !1414, !1415, !1416}
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !1371, file: !318, line: 119, baseType: !1370, size: 64)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1371, file: !318, line: 122, baseType: !1370, size: 64, offset: 64)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !1371, file: !318, line: 123, baseType: !1370, size: 64, offset: 128)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1371, file: !318, line: 126, baseType: !641, size: 32, offset: 192)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1371, file: !318, line: 129, baseType: !317, size: 32, offset: 224)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1371, file: !318, line: 165, baseType: !1379, size: 192, offset: 256)
!1379 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !318, line: 132, size: 192, elements: !1380)
!1380 = !{!1381, !1394, !1400}
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !1379, file: !318, line: 137, baseType: !1382, size: 128)
!1382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !318, line: 133, size: 128, elements: !1383)
!1383 = !{!1384, !1393}
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !1382, file: !318, line: 135, baseType: !1385, size: 64)
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64)
!1386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !318, line: 93, size: 320, elements: !1387)
!1387 = !{!1388, !1389, !1390, !1391, !1392}
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !1386, file: !318, line: 96, baseType: !1385, size: 64)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !1386, file: !318, line: 97, baseType: !1385, size: 64, offset: 64)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1386, file: !318, line: 101, baseType: !648, size: 64, offset: 128)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !1386, file: !318, line: 106, baseType: !648, size: 64, offset: 192)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1386, file: !318, line: 111, baseType: !648, size: 64, offset: 256)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !1382, file: !318, line: 136, baseType: !1385, size: 64, offset: 64)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !1379, file: !318, line: 151, baseType: !1395, size: 192)
!1395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !318, line: 139, size: 192, elements: !1396)
!1396 = !{!1397, !1398, !1399}
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1395, file: !318, line: 141, baseType: !648, size: 64)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1395, file: !318, line: 145, baseType: !648, size: 64, offset: 64)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1395, file: !318, line: 150, baseType: !641, size: 32, offset: 128)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !1379, file: !318, line: 164, baseType: !1401, size: 128)
!1401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !318, line: 153, size: 128, elements: !1402)
!1402 = !{!1403, !1404}
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !1401, file: !318, line: 161, baseType: !648, size: 64)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !1401, file: !318, line: 163, baseType: !773, size: 32, offset: 64)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !1371, file: !318, line: 168, baseType: !1406, size: 64, offset: 448)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64)
!1407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !318, line: 67, size: 320, elements: !1408)
!1408 = !{!1409, !1410, !1411, !1412, !1413}
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !1407, file: !318, line: 70, baseType: !1406, size: 64)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1407, file: !318, line: 73, baseType: !1370, size: 64, offset: 64)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !1407, file: !318, line: 78, baseType: !648, size: 64, offset: 128)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !1407, file: !318, line: 85, baseType: !823, size: 64, offset: 192)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1407, file: !318, line: 88, baseType: !641, size: 32, offset: 256)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !1371, file: !318, line: 173, baseType: !823, size: 64, offset: 512)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !1371, file: !318, line: 173, baseType: !823, size: 64, offset: 576)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !1371, file: !318, line: 177, baseType: !640, size: 8, offset: 640)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !1366, file: !318, line: 200, baseType: !1418, size: 64, offset: 64)
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64)
!1419 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !318, line: 185, baseType: !1420)
!1420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !318, line: 185, size: 128, elements: !1421)
!1421 = !{!1422}
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1420, file: !318, line: 185, baseType: !1423, size: 128)
