; ModuleID = 'gimplify.bc'
source_filename = "gimplify.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.gimplify_ctx = type { %struct.gimplify_ctx*, %struct.VEC_gimple_heap*, %union.tree_node*, %struct.gimple_seq_d*, %union.tree_node*, %union.tree_node*, %struct.VEC_tree_heap*, %struct.htab*, i32, i8, i8, i8 }
%struct.VEC_gimple_heap = type { %struct.VEC_gimple_base }
%struct.VEC_gimple_base = type { i32, i32, [1 x %union.gimple_statement_d*] }
%union.gimple_statement_d = type { %struct.gimple_statement_phi }
%struct.gimple_statement_phi = type { %struct.gimple_statement_base, i32, i32, %union.tree_node*, [1 x %struct.phi_arg_d] }
%struct.gimple_statement_base = type { i32, i32, i32, i32, %struct.basic_block_def*, %union.tree_node* }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }

!674 = !DIEnumerator(name: "TV_IFCVT2", value: 154, isUnsigned: true)
!675 = !DIEnumerator(name: "TV_COMBINE_STACK_ADJUST", value: 155, isUnsigned: true)
!676 = !DIEnumerator(name: "TV_PEEPHOLE2", value: 156, isUnsigned: true)
!677 = !DIEnumerator(name: "TV_RENAME_REGISTERS", value: 157, isUnsigned: true)
!678 = !DIEnumerator(name: "TV_CPROP_REGISTERS", value: 158, isUnsigned: true)
!679 = !DIEnumerator(name: "TV_SCHED2", value: 159, isUnsigned: true)
!680 = !DIEnumerator(name: "TV_MACH_DEP", value: 160, isUnsigned: true)
!681 = !DIEnumerator(name: "TV_DBR_SCHED", value: 161, isUnsigned: true)
!682 = !DIEnumerator(name: "TV_REORDER_BLOCKS", value: 162, isUnsigned: true)
!683 = !DIEnumerator(name: "TV_SHORTEN_BRANCH", value: 163, isUnsigned: true)
!684 = !DIEnumerator(name: "TV_REG_STACK", value: 164, isUnsigned: true)
!685 = !DIEnumerator(name: "TV_FINAL", value: 165, isUnsigned: true)
!686 = !DIEnumerator(name: "TV_SYMOUT", value: 166, isUnsigned: true)
!687 = !DIEnumerator(name: "TV_VAR_TRACKING", value: 167, isUnsigned: true)
!688 = !DIEnumerator(name: "TV_TREE_IFCOMBINE", value: 168, isUnsigned: true)
!689 = !DIEnumerator(name: "TV_PLUGIN_INIT", value: 169, isUnsigned: true)
!690 = !DIEnumerator(name: "TV_PLUGIN_RUN", value: 170, isUnsigned: true)
!691 = !DIEnumerator(name: "TV_REST_OF_COMPILATION", value: 171, isUnsigned: true)
!692 = !DIEnumerator(name: "TIMEVAR_LAST", value: 172, isUnsigned: true)
!693 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !391, line: 727, baseType: !7, size: 32, elements: !694)
!694 = !{!695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718}
!695 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!696 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!697 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!698 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!699 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!700 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!701 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!702 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!703 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!704 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!705 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!706 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!707 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!708 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!709 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!710 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!711 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!712 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!713 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!714 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!715 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!716 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!717 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!718 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!719 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_rhs_class", file: !391, line: 80, baseType: !7, size: 32, elements: !720)
!720 = !{!721, !722, !723, !724}
!721 = !DIEnumerator(name: "GIMPLE_INVALID_RHS", value: 0, isUnsigned: true)
!722 = !DIEnumerator(name: "GIMPLE_BINARY_RHS", value: 1, isUnsigned: true)
!723 = !DIEnumerator(name: "GIMPLE_UNARY_RHS", value: 2, isUnsigned: true)
!724 = !DIEnumerator(name: "GIMPLE_SINGLE_RHS", value: 3, isUnsigned: true)
!725 = !{!726, !727, !392, !728, !731, !732, !134, !734, !729, !788, !861, !736, !2159, !2161, !390, !398, !430, !2164, !2165, !2171, !7, !2173, !2176, !1937, !2181, !2186, !1204, !1613, !481, !909, !2191, !1093, !1059, !2239, !719}
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !730)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !735, line: 56, baseType: !736)
!735 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !135, line: 3371, size: 1792, elements: !738)
!738 = !{!739, !772, !778, !791, !810, !821, !826, !835, !841, !854, !866, !904, !1396, !1424, !1441, !1442, !1447, !1456, !1462, !1467, !1471, !1475, !1810, !1857, !1863, !1869, !1876, !1889, !1903, !1920, !1932, !1954, !1969, !2141}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !737, file: !135, line: 3372, baseType: !740, size: 64)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !135, line: 360, size: 64, elements: !741)
!741 = !{!742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !740, file: !135, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !740, file: !135, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !740, file: !135, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !740, file: !135, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !740, file: !135, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !740, file: !135, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !740, file: !135, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !740, file: !135, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !740, file: !135, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !740, file: !135, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !740, file: !135, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !740, file: !135, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !740, file: !135, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !740, file: !135, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !740, file: !135, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !740, file: !135, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !740, file: !135, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !740, file: !135, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !740, file: !135, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !740, file: !135, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !740, file: !135, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !740, file: !135, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !740, file: !135, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !740, file: !135, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !740, file: !135, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !740, file: !135, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !740, file: !135, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !740, file: !135, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !740, file: !135, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !740, file: !135, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !737, file: !135, line: 3373, baseType: !773, size: 192)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !135, line: 402, size: 192, elements: !774)
!774 = !{!775, !776, !777}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !773, file: !135, line: 403, baseType: !740, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !773, file: !135, line: 404, baseType: !734, size: 64, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !773, file: !135, line: 405, baseType: !734, size: 64, offset: 128)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !737, file: !135, line: 3374, baseType: !779, size: 320)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !135, line: 1384, size: 320, elements: !780)
!780 = !{!781, !782}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !779, file: !135, line: 1385, baseType: !773, size: 192)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !779, file: !135, line: 1386, baseType: !783, size: 128, offset: 192)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !784, line: 58, baseType: !785)
!784 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !784, line: 54, size: 128, elements: !786)
!786 = !{!787, !789}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !785, file: !784, line: 56, baseType: !788, size: 64)
!788 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !785, file: !784, line: 57, baseType: !790, size: 64, offset: 64)
!790 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !737, file: !135, line: 3375, baseType: !792, size: 256)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !135, line: 1397, size: 256, elements: !793)
!793 = !{!794, !795}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !792, file: !135, line: 1398, baseType: !773, size: 192)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !792, file: !135, line: 1399, baseType: !796, size: 64, offset: 192)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !798, line: 52, size: 256, elements: !799)
!798 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!799 = !{!800, !801, !802, !803, !804, !805, !806}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !797, file: !798, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !797, file: !798, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !797, file: !798, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !797, file: !798, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !797, file: !798, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !797, file: !798, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !797, file: !798, line: 62, baseType: !807, size: 192, offset: 64)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !788, size: 192, elements: !808)
!808 = !{!809}
!809 = !DISubrange(count: 3)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !737, file: !135, line: 3376, baseType: !811, size: 256)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !135, line: 1408, size: 256, elements: !812)
!812 = !{!813, !814}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !811, file: !135, line: 1409, baseType: !773, size: 192)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !811, file: !135, line: 1410, baseType: !815, size: 64, offset: 192)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !817, line: 27, size: 192, elements: !818)
!817 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!818 = !{!819, !820}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !816, file: !817, line: 29, baseType: !783, size: 128)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !816, file: !817, line: 30, baseType: !5, size: 32, offset: 128)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !737, file: !135, line: 3377, baseType: !822, size: 256)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !135, line: 1437, size: 256, elements: !823)
!823 = !{!824, !825}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !822, file: !135, line: 1438, baseType: !773, size: 192)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !822, file: !135, line: 1439, baseType: !734, size: 64, offset: 192)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !737, file: !135, line: 3378, baseType: !827, size: 256)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !135, line: 1418, size: 256, elements: !828)
!828 = !{!829, !830, !831}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !827, file: !135, line: 1419, baseType: !773, size: 192)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !827, file: !135, line: 1420, baseType: !392, size: 32, offset: 192)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !827, file: !135, line: 1421, baseType: !832, size: 8, offset: 224)
!832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !730, size: 8, elements: !833)
!833 = !{!834}
!834 = !DISubrange(count: 1)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !737, file: !135, line: 3379, baseType: !836, size: 320)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !135, line: 1428, size: 320, elements: !837)
!837 = !{!838, !839, !840}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !836, file: !135, line: 1429, baseType: !773, size: 192)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !836, file: !135, line: 1430, baseType: !734, size: 64, offset: 192)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !836, file: !135, line: 1431, baseType: !734, size: 64, offset: 256)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !737, file: !135, line: 3380, baseType: !842, size: 320)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !135, line: 1460, size: 320, elements: !843)
!843 = !{!844, !845}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !842, file: !135, line: 1461, baseType: !773, size: 192)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !842, file: !135, line: 1462, baseType: !846, size: 128, offset: 192)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !847, line: 31, size: 128, elements: !848)
!847 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!848 = !{!849, !852, !853}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !846, file: !847, line: 32, baseType: !850, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !727)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !846, file: !847, line: 33, baseType: !7, size: 32, offset: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !846, file: !847, line: 34, baseType: !7, size: 32, offset: 96)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !737, file: !135, line: 3381, baseType: !855, size: 384)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !135, line: 2507, size: 384, elements: !856)
!856 = !{!857, !858, !863, !864, !865}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !855, file: !135, line: 2508, baseType: !773, size: 192)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !855, file: !135, line: 2509, baseType: !859, size: 32, offset: 192)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !860, line: 58, baseType: !861)
!860 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !862, line: 44, baseType: !7)
!862 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!863 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !855, file: !135, line: 2510, baseType: !7, size: 32, offset: 224)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !855, file: !135, line: 2511, baseType: !734, size: 64, offset: 256)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !855, file: !135, line: 2512, baseType: !734, size: 64, offset: 320)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !737, file: !135, line: 3382, baseType: !867, size: 896)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !135, line: 2652, size: 896, elements: !868)
!868 = !{!869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !867, file: !135, line: 2653, baseType: !855, size: 384)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !867, file: !135, line: 2654, baseType: !734, size: 64, offset: 384)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !867, file: !135, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !867, file: !135, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !867, file: !135, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !867, file: !135, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !867, file: !135, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !867, file: !135, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !867, file: !135, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !867, file: !135, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !867, file: !135, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !867, file: !135, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !867, file: !135, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !867, file: !135, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !867, file: !135, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !867, file: !135, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !867, file: !135, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !867, file: !135, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !867, file: !135, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !867, file: !135, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !867, file: !135, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !867, file: !135, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !867, file: !135, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !867, file: !135, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !867, file: !135, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !867, file: !135, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !867, file: !135, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !867, file: !135, line: 2703, baseType: !7, size: 32, offset: 512)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !867, file: !135, line: 2705, baseType: !734, size: 64, offset: 576)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !867, file: !135, line: 2706, baseType: !734, size: 64, offset: 640)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !867, file: !135, line: 2707, baseType: !734, size: 64, offset: 704)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !867, file: !135, line: 2708, baseType: !734, size: 64, offset: 768)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !867, file: !135, line: 2711, baseType: !902, size: 64, offset: 832)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !135, line: 2711, flags: DIFlagFwdDecl)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !737, file: !135, line: 3383, baseType: !905, size: 960)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !135, line: 2756, size: 960, elements: !906)
!906 = !{!907, !908}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !905, file: !135, line: 2757, baseType: !867, size: 896)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !905, file: !135, line: 2758, baseType: !909, size: 64, offset: 896)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !735, line: 50, baseType: !910)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !912, line: 240, size: 384, elements: !913)
!912 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!913 = !{!914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !911, file: !912, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !911, file: !912, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !911, file: !912, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !911, file: !912, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !911, file: !912, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !911, file: !912, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !911, file: !912, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !911, file: !912, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !911, file: !912, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !911, file: !912, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !911, file: !912, line: 321, baseType: !925, size: 320, offset: 64)
!925 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !912, line: 315, size: 320, elements: !926)
!926 = !{!927, !1329, !1331, !1394, !1395}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !925, file: !912, line: 316, baseType: !928, size: 64)
!928 = !DICompositeType(tag: DW_TAG_array_type, baseType: !929, size: 64, elements: !833)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !912, line: 183, baseType: !930)
!930 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !912, line: 166, size: 64, elements: !931)
!931 = !{!932, !933, !934, !935, !936, !944, !945, !957, !960, !1020, !1021, !1306, !1319, !1326}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !930, file: !912, line: 168, baseType: !392, size: 32)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !930, file: !912, line: 169, baseType: !7, size: 32)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !930, file: !912, line: 170, baseType: !732, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !930, file: !912, line: 171, baseType: !909, size: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !930, file: !912, line: 172, baseType: !937, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !735, line: 53, baseType: !938)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !912, line: 359, size: 128, elements: !940)
!940 = !{!941, !942}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !939, file: !912, line: 360, baseType: !392, size: 32)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !939, file: !912, line: 361, baseType: !943, size: 64, offset: 64)
!943 = !DICompositeType(tag: DW_TAG_array_type, baseType: !909, size: 64, elements: !833)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !930, file: !912, line: 173, baseType: !5, size: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !930, file: !912, line: 174, baseType: !946, size: 32)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !912, line: 133, baseType: !947)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !912, line: 115, size: 32, elements: !948)
!948 = !{!949, !950, !951, !952, !953, !954, !955, !956}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !947, file: !912, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !947, file: !912, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !947, file: !912, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !947, file: !912, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !947, file: !912, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !947, file: !912, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !947, file: !912, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !947, file: !912, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !930, file: !912, line: 175, baseType: !958, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !912, line: 175, flags: DIFlagFwdDecl)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !930, file: !912, line: 176, baseType: !961, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !963, line: 75, size: 256, elements: !964)
!963 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!964 = !{!965, !979, !980, !981}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !962, file: !963, line: 76, baseType: !966, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !963, line: 68, baseType: !968)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !963, line: 63, size: 320, elements: !969)
!969 = !{!970, !972, !973, !974}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !968, file: !963, line: 64, baseType: !971, size: 64)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !968, file: !963, line: 65, baseType: !971, size: 64, offset: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !968, file: !963, line: 66, baseType: !7, size: 32, offset: 128)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !968, file: !963, line: 67, baseType: !975, size: 128, offset: 192)
!975 = !DICompositeType(tag: DW_TAG_array_type, baseType: !976, size: 128, elements: !977)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !963, line: 29, baseType: !788)
!977 = !{!978}
!978 = !DISubrange(count: 2)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !962, file: !963, line: 77, baseType: !966, size: 64, offset: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !962, file: !963, line: 78, baseType: !7, size: 32, offset: 128)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !962, file: !963, line: 79, baseType: !982, size: 64, offset: 192)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !963, line: 49, baseType: !984)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !963, line: 45, size: 832, elements: !985)
!985 = !{!986, !987, !988}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !984, file: !963, line: 46, baseType: !971, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !984, file: !963, line: 47, baseType: !961, size: 64, offset: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !984, file: !963, line: 48, baseType: !989, size: 704, offset: 128)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !990, line: 164, size: 704, elements: !991)
!990 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!991 = !{!992, !993, !1003, !1004, !1005, !1006, !1007, !1008, !1012, !1016, !1017, !1018, !1019}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !989, file: !990, line: 166, baseType: !790, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !989, file: !990, line: 167, baseType: !994, size: 64, offset: 64)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !990, line: 157, size: 192, elements: !996)
!996 = !{!997, !998, !999}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !995, file: !990, line: 159, baseType: !729, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !995, file: !990, line: 160, baseType: !994, size: 64, offset: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !995, file: !990, line: 161, baseType: !1000, size: 32, offset: 128)
!1000 = !DICompositeType(tag: DW_TAG_array_type, baseType: !730, size: 32, elements: !1001)
!1001 = !{!1002}
!1002 = !DISubrange(count: 4)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !989, file: !990, line: 168, baseType: !729, size: 64, offset: 128)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !989, file: !990, line: 169, baseType: !729, size: 64, offset: 192)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !989, file: !990, line: 170, baseType: !729, size: 64, offset: 256)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !989, file: !990, line: 171, baseType: !790, size: 64, offset: 320)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !989, file: !990, line: 172, baseType: !392, size: 32, offset: 384)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !989, file: !990, line: 176, baseType: !1009, size: 64, offset: 448)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!994, !731, !790}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !989, file: !990, line: 177, baseType: !1013, size: 64, offset: 512)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{null, !731, !994}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !989, file: !990, line: 178, baseType: !731, size: 64, offset: 576)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !989, file: !990, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !989, file: !990, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !989, file: !990, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !930, file: !912, line: 177, baseType: !734, size: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !930, file: !912, line: 178, baseType: !1022, size: 64)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !337, line: 217, size: 832, elements: !1024)
!1024 = !{!1025, !1271, !1272, !1273, !1276, !1280, !1281, !1282, !1300, !1301, !1302, !1303, !1304, !1305}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1023, file: !337, line: 219, baseType: !1026, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !337, line: 151, baseType: !1028)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !337, line: 151, size: 128, elements: !1029)
!1029 = !{!1030}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1028, file: !337, line: 151, baseType: !1031, size: 128)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !337, line: 150, baseType: !1032)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !337, line: 150, size: 128, elements: !1033)
!1033 = !{!1034, !1035, !1036}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1032, file: !337, line: 150, baseType: !7, size: 32)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1032, file: !337, line: 150, baseType: !7, size: 32, offset: 32)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1032, file: !337, line: 150, baseType: !1037, size: 64, offset: 64)
!1037 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1038, size: 64, elements: !833)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !735, line: 108, baseType: !1039)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !337, line: 122, size: 512, elements: !1041)
!1041 = !{!1042, !1043, !1044, !1263, !1264, !1265, !1266, !1267, !1268, !1269}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1040, file: !337, line: 124, baseType: !1022, size: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1040, file: !337, line: 125, baseType: !1022, size: 64, offset: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1040, file: !337, line: 131, baseType: !1045, size: 64, offset: 128)
!1045 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !337, line: 128, size: 64, elements: !1046)
!1046 = !{!1047, !1262}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1045, file: !337, line: 129, baseType: !1048, size: 64)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !735, line: 66, baseType: !1049)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !391, line: 143, size: 192, elements: !1051)
!1051 = !{!1052, !1260, !1261}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1050, file: !391, line: 145, baseType: !1053, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !735, line: 69, baseType: !1054)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !391, line: 136, size: 192, elements: !1056)
!1056 = !{!1057, !1258, !1259}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1055, file: !391, line: 137, baseType: !1058, size: 64)
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !735, line: 58, baseType: !1059)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1060 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !391, line: 737, size: 768, elements: !1061)
!1061 = !{!1062, !1079, !1113, !1119, !1124, !1129, !1136, !1142, !1148, !1153, !1167, !1172, !1178, !1183, !1193, !1198, !1216, !1223, !1230, !1236, !1241, !1247, !1253}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1060, file: !391, line: 738, baseType: !1063, size: 256)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !391, line: 271, size: 256, elements: !1064)
!1064 = !{!1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1063, file: !391, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !1063, file: !391, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1063, file: !391, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !1063, file: !391, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !1063, file: !391, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !1063, file: !391, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !1063, file: !391, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1063, file: !391, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !1063, file: !391, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1063, file: !391, line: 312, baseType: !7, size: 32, offset: 32)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !1063, file: !391, line: 316, baseType: !859, size: 32, offset: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !1063, file: !391, line: 319, baseType: !7, size: 32, offset: 96)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1063, file: !391, line: 323, baseType: !1022, size: 64, offset: 128)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1063, file: !391, line: 327, baseType: !734, size: 64, offset: 192)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !1060, file: !391, line: 739, baseType: !1080, size: 448)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !391, line: 350, size: 448, elements: !1081)
!1081 = !{!1082, !1111}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1080, file: !391, line: 353, baseType: !1083, size: 384)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !391, line: 333, size: 384, elements: !1084)
!1084 = !{!1085, !1086, !1094}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1083, file: !391, line: 336, baseType: !1063, size: 256)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !1083, file: !391, line: 343, baseType: !1087, size: 64, offset: 256)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1089, line: 37, size: 128, elements: !1090)
!1089 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1090 = !{!1091, !1092}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1088, file: !1089, line: 39, baseType: !1087, size: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1088, file: !1089, line: 40, baseType: !1093, size: 64, offset: 64)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !1083, file: !391, line: 344, baseType: !1095, size: 64, offset: 320)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1089, line: 45, size: 320, elements: !1097)
!1097 = !{!1098, !1099}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1096, file: !1089, line: 47, baseType: !1095, size: 64)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1096, file: !1089, line: 48, baseType: !1100, size: 256, offset: 64)
!1100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !135, line: 1883, size: 256, elements: !1101)
!1101 = !{!1102, !1104, !1105, !1110}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1100, file: !135, line: 1884, baseType: !1103, size: 64)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1100, file: !135, line: 1885, baseType: !1103, size: 64, offset: 64)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1100, file: !135, line: 1891, baseType: !1106, size: 64, offset: 128)
!1106 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1100, file: !135, line: 1891, size: 64, elements: !1107)
!1107 = !{!1108, !1109}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1106, file: !135, line: 1891, baseType: !1058, size: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1106, file: !135, line: 1891, baseType: !734, size: 64)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1100, file: !135, line: 1892, baseType: !1093, size: 64, offset: 192)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1080, file: !391, line: 359, baseType: !1112, size: 64, offset: 384)
!1112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !734, size: 64, elements: !833)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !1060, file: !391, line: 740, baseType: !1114, size: 512)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !391, line: 365, size: 512, elements: !1115)
!1115 = !{!1116, !1117, !1118}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1114, file: !391, line: 368, baseType: !1083, size: 384)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1114, file: !391, line: 373, baseType: !734, size: 64, offset: 384)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1114, file: !391, line: 374, baseType: !734, size: 64, offset: 448)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !1060, file: !391, line: 741, baseType: !1120, size: 576)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !391, line: 380, size: 576, elements: !1121)
!1121 = !{!1122, !1123}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1120, file: !391, line: 383, baseType: !1114, size: 512)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1120, file: !391, line: 389, baseType: !1112, size: 64, offset: 512)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1060, file: !391, line: 742, baseType: !1125, size: 320)
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !391, line: 395, size: 320, elements: !1126)
!1126 = !{!1127, !1128}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1125, file: !391, line: 397, baseType: !1063, size: 256)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1125, file: !391, line: 400, baseType: !1048, size: 64, offset: 256)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !1060, file: !391, line: 743, baseType: !1130, size: 448)
!1130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !391, line: 406, size: 448, elements: !1131)
!1131 = !{!1132, !1133, !1134, !1135}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1130, file: !391, line: 408, baseType: !1063, size: 256)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1130, file: !391, line: 412, baseType: !734, size: 64, offset: 256)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1130, file: !391, line: 420, baseType: !734, size: 64, offset: 320)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1130, file: !391, line: 423, baseType: !1048, size: 64, offset: 384)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !1060, file: !391, line: 744, baseType: !1137, size: 384)
!1137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !391, line: 429, size: 384, elements: !1138)
!1138 = !{!1139, !1140, !1141}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1137, file: !391, line: 431, baseType: !1063, size: 256)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1137, file: !391, line: 434, baseType: !734, size: 64, offset: 256)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1137, file: !391, line: 437, baseType: !1048, size: 64, offset: 320)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !1060, file: !391, line: 745, baseType: !1143, size: 384)
!1143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !391, line: 443, size: 384, elements: !1144)
!1144 = !{!1145, !1146, !1147}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1143, file: !391, line: 445, baseType: !1063, size: 256)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1143, file: !391, line: 449, baseType: !734, size: 64, offset: 256)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1143, file: !391, line: 453, baseType: !1048, size: 64, offset: 320)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !1060, file: !391, line: 746, baseType: !1149, size: 320)
!1149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !391, line: 459, size: 320, elements: !1150)
!1150 = !{!1151, !1152}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1149, file: !391, line: 461, baseType: !1063, size: 256)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1149, file: !391, line: 464, baseType: !734, size: 64, offset: 256)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !1060, file: !391, line: 747, baseType: !1154, size: 768)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !391, line: 469, size: 768, elements: !1155)
!1155 = !{!1156, !1157, !1158, !1159, !1160}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1154, file: !391, line: 471, baseType: !1063, size: 256)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1154, file: !391, line: 474, baseType: !7, size: 32, offset: 256)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1154, file: !391, line: 475, baseType: !7, size: 32, offset: 288)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1154, file: !391, line: 478, baseType: !734, size: 64, offset: 320)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1154, file: !391, line: 481, baseType: !1161, size: 384, offset: 384)
!1161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1162, size: 384, elements: !833)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !135, line: 1917, size: 384, elements: !1163)
!1163 = !{!1164, !1165, !1166}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1162, file: !135, line: 1920, baseType: !1100, size: 256)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1162, file: !135, line: 1921, baseType: !734, size: 64, offset: 256)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1162, file: !135, line: 1922, baseType: !859, size: 32, offset: 320)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !1060, file: !391, line: 748, baseType: !1168, size: 320)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !391, line: 487, size: 320, elements: !1169)
!1169 = !{!1170, !1171}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1168, file: !391, line: 490, baseType: !1063, size: 256)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1168, file: !391, line: 494, baseType: !392, size: 32, offset: 256)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !1060, file: !391, line: 749, baseType: !1173, size: 384)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !391, line: 500, size: 384, elements: !1174)
!1174 = !{!1175, !1176, !1177}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1173, file: !391, line: 502, baseType: !1063, size: 256)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1173, file: !391, line: 506, baseType: !1048, size: 64, offset: 256)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1173, file: !391, line: 510, baseType: !1048, size: 64, offset: 320)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !1060, file: !391, line: 750, baseType: !1179, size: 320)
!1179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !391, line: 529, size: 320, elements: !1180)
!1180 = !{!1181, !1182}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1179, file: !391, line: 531, baseType: !1063, size: 256)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1179, file: !391, line: 540, baseType: !1048, size: 64, offset: 256)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !1060, file: !391, line: 751, baseType: !1184, size: 704)
!1184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !391, line: 546, size: 704, elements: !1185)
!1185 = !{!1186, !1187, !1188, !1189, !1190, !1191, !1192}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1184, file: !391, line: 549, baseType: !1114, size: 512)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1184, file: !391, line: 553, baseType: !732, size: 64, offset: 512)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1184, file: !391, line: 557, baseType: !727, size: 8, offset: 576)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1184, file: !391, line: 558, baseType: !727, size: 8, offset: 584)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1184, file: !391, line: 559, baseType: !727, size: 8, offset: 592)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1184, file: !391, line: 560, baseType: !727, size: 8, offset: 600)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1184, file: !391, line: 566, baseType: !1112, size: 64, offset: 640)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !1060, file: !391, line: 752, baseType: !1194, size: 384)
!1194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !391, line: 571, size: 384, elements: !1195)
!1195 = !{!1196, !1197}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1194, file: !391, line: 573, baseType: !1125, size: 320)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1194, file: !391, line: 577, baseType: !734, size: 64, offset: 320)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !1060, file: !391, line: 753, baseType: !1199, size: 576)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !391, line: 600, size: 576, elements: !1200)
!1200 = !{!1201, !1202, !1203, !1206, !1215}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1199, file: !391, line: 602, baseType: !1125, size: 320)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1199, file: !391, line: 605, baseType: !734, size: 64, offset: 320)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1199, file: !391, line: 609, baseType: !1204, size: 64, offset: 384)
!1204 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1205, line: 46, baseType: !788)
!1205 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1199, file: !391, line: 612, baseType: !1207, size: 64, offset: 448)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !391, line: 581, size: 320, elements: !1209)
!1209 = !{!1210, !1211, !1212, !1213, !1214}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1208, file: !391, line: 583, baseType: !134, size: 32)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1208, file: !391, line: 586, baseType: !734, size: 64, offset: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1208, file: !391, line: 589, baseType: !734, size: 64, offset: 128)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1208, file: !391, line: 592, baseType: !734, size: 64, offset: 192)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1208, file: !391, line: 595, baseType: !734, size: 64, offset: 256)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1199, file: !391, line: 616, baseType: !1048, size: 64, offset: 512)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !1060, file: !391, line: 754, baseType: !1217, size: 512)
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !391, line: 622, size: 512, elements: !1218)
!1218 = !{!1219, !1220, !1221, !1222}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1217, file: !391, line: 624, baseType: !1125, size: 320)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1217, file: !391, line: 628, baseType: !734, size: 64, offset: 320)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1217, file: !391, line: 632, baseType: !734, size: 64, offset: 384)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1217, file: !391, line: 636, baseType: !734, size: 64, offset: 448)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !1060, file: !391, line: 755, baseType: !1224, size: 704)
!1224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !391, line: 642, size: 704, elements: !1225)
!1225 = !{!1226, !1227, !1228, !1229}
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1224, file: !391, line: 644, baseType: !1217, size: 512)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1224, file: !391, line: 648, baseType: !734, size: 64, offset: 512)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1224, file: !391, line: 652, baseType: !734, size: 64, offset: 576)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1224, file: !391, line: 653, baseType: !734, size: 64, offset: 640)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !1060, file: !391, line: 756, baseType: !1231, size: 448)
!1231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !391, line: 663, size: 448, elements: !1232)
!1232 = !{!1233, !1234, !1235}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1231, file: !391, line: 665, baseType: !1125, size: 320)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1231, file: !391, line: 668, baseType: !734, size: 64, offset: 320)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1231, file: !391, line: 673, baseType: !734, size: 64, offset: 384)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !1060, file: !391, line: 757, baseType: !1237, size: 384)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !391, line: 694, size: 384, elements: !1238)
!1238 = !{!1239, !1240}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1237, file: !391, line: 696, baseType: !1125, size: 320)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1237, file: !391, line: 699, baseType: !734, size: 64, offset: 320)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !1060, file: !391, line: 758, baseType: !1242, size: 384)
!1242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !391, line: 681, size: 384, elements: !1243)
!1243 = !{!1244, !1245, !1246}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1242, file: !391, line: 683, baseType: !1063, size: 256)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1242, file: !391, line: 686, baseType: !734, size: 64, offset: 256)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1242, file: !391, line: 689, baseType: !734, size: 64, offset: 320)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !1060, file: !391, line: 759, baseType: !1248, size: 384)
!1248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !391, line: 707, size: 384, elements: !1249)
!1249 = !{!1250, !1251, !1252}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1248, file: !391, line: 709, baseType: !1063, size: 256)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1248, file: !391, line: 712, baseType: !734, size: 64, offset: 256)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1248, file: !391, line: 712, baseType: !734, size: 64, offset: 320)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !1060, file: !391, line: 760, baseType: !1254, size: 320)
!1254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !391, line: 718, size: 320, elements: !1255)
!1255 = !{!1256, !1257}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1254, file: !391, line: 720, baseType: !1063, size: 256)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1254, file: !391, line: 723, baseType: !734, size: 64, offset: 256)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1055, file: !391, line: 138, baseType: !1054, size: 64, offset: 64)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1055, file: !391, line: 139, baseType: !1054, size: 64, offset: 128)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1050, file: !391, line: 146, baseType: !1053, size: 64, offset: 64)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1050, file: !391, line: 152, baseType: !1048, size: 64, offset: 128)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1045, file: !337, line: 130, baseType: !909, size: 64)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1040, file: !337, line: 134, baseType: !731, size: 64, offset: 192)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1040, file: !337, line: 137, baseType: !734, size: 64, offset: 256)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1040, file: !337, line: 138, baseType: !859, size: 32, offset: 320)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1040, file: !337, line: 142, baseType: !7, size: 32, offset: 352)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1040, file: !337, line: 144, baseType: !392, size: 32, offset: 384)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1040, file: !337, line: 145, baseType: !392, size: 32, offset: 416)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1040, file: !337, line: 146, baseType: !1270, size: 64, offset: 448)
!1270 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !337, line: 119, baseType: !790)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1023, file: !337, line: 220, baseType: !1026, size: 64, offset: 64)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1023, file: !337, line: 223, baseType: !731, size: 64, offset: 128)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1023, file: !337, line: 226, baseType: !1274, size: 64, offset: 192)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64)
!1275 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !337, line: 185, flags: DIFlagFwdDecl)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1023, file: !337, line: 229, baseType: !1277, size: 128, offset: 256)
!1277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1278, size: 128, elements: !977)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64)
!1279 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !337, line: 229, flags: DIFlagFwdDecl)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1023, file: !337, line: 232, baseType: !1022, size: 64, offset: 384)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1023, file: !337, line: 233, baseType: !1022, size: 64, offset: 448)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1023, file: !337, line: 238, baseType: !1283, size: 64, offset: 512)
!1283 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !337, line: 235, size: 64, elements: !1284)
!1284 = !{!1285, !1291}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1283, file: !337, line: 236, baseType: !1286, size: 64)
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64)
!1287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !337, line: 273, size: 128, elements: !1288)
!1288 = !{!1289, !1290}
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1287, file: !337, line: 275, baseType: !1048, size: 64)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1287, file: !337, line: 278, baseType: !1048, size: 64, offset: 64)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1283, file: !337, line: 237, baseType: !1292, size: 64)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64)
!1293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !337, line: 259, size: 320, elements: !1294)
!1294 = !{!1295, !1296, !1297, !1298, !1299}
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1293, file: !337, line: 261, baseType: !909, size: 64)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1293, file: !337, line: 262, baseType: !909, size: 64, offset: 64)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1293, file: !337, line: 266, baseType: !909, size: 64, offset: 128)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1293, file: !337, line: 267, baseType: !909, size: 64, offset: 192)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1293, file: !337, line: 270, baseType: !392, size: 32, offset: 256)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1023, file: !337, line: 241, baseType: !1270, size: 64, offset: 576)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1023, file: !337, line: 244, baseType: !392, size: 32, offset: 640)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1023, file: !337, line: 247, baseType: !392, size: 32, offset: 672)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1023, file: !337, line: 250, baseType: !392, size: 32, offset: 704)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1023, file: !337, line: 253, baseType: !392, size: 32, offset: 736)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1023, file: !337, line: 256, baseType: !392, size: 32, offset: 768)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !930, file: !912, line: 179, baseType: !1307, size: 64)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64)
!1308 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !912, line: 150, baseType: !1309)
!1309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !912, line: 142, size: 320, elements: !1310)
!1310 = !{!1311, !1312, !1313, !1314, !1317, !1318}
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1309, file: !912, line: 144, baseType: !734, size: 64)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1309, file: !912, line: 145, baseType: !909, size: 64, offset: 64)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1309, file: !912, line: 146, baseType: !909, size: 64, offset: 128)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1309, file: !912, line: 147, baseType: !1315, size: 32, offset: 192)
!1315 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1316, line: 31, baseType: !392)
!1316 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1309, file: !912, line: 148, baseType: !7, size: 32, offset: 224)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1309, file: !912, line: 149, baseType: !727, size: 8, offset: 256)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !930, file: !912, line: 180, baseType: !1320, size: 64)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64)
!1321 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !912, line: 162, baseType: !1322)
!1322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !912, line: 159, size: 128, elements: !1323)
!1323 = !{!1324, !1325}
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1322, file: !912, line: 160, baseType: !734, size: 64)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1322, file: !912, line: 161, baseType: !790, size: 64, offset: 64)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !930, file: !912, line: 181, baseType: !1327, size: 64)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64)
!1328 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !912, line: 181, flags: DIFlagFwdDecl)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !925, file: !912, line: 317, baseType: !1330, size: 64)
!1330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !790, size: 64, elements: !833)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !925, file: !912, line: 318, baseType: !1332, size: 320)
!1332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !912, line: 188, size: 320, elements: !1333)
!1333 = !{!1334, !1336, !1393}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1332, file: !912, line: 190, baseType: !1335, size: 192)
!1335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !929, size: 192, elements: !808)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1332, file: !912, line: 193, baseType: !1337, size: 64, offset: 192)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64)
!1338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !912, line: 206, size: 320, elements: !1339)
!1339 = !{!1340, !1378, !1379, !1380, !1392}
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1338, file: !912, line: 208, baseType: !1341, size: 64)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64)
!1342 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !735, line: 62, baseType: !1343)
!1343 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1344, line: 538, size: 256, elements: !1345)
!1344 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1345 = !{!1346, !1350, !1356, !1369}
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1343, file: !1344, line: 539, baseType: !1347, size: 32)
!1347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1344, line: 482, size: 32, elements: !1348)
!1348 = !{!1349}
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1347, file: !1344, line: 484, baseType: !7, size: 32)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1343, file: !1344, line: 540, baseType: !1351, size: 192)
!1351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1344, line: 488, size: 192, elements: !1352)
!1352 = !{!1353, !1354, !1355}
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1351, file: !1344, line: 489, baseType: !1347, size: 32)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1351, file: !1344, line: 492, baseType: !732, size: 64, offset: 64)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1351, file: !1344, line: 496, baseType: !734, size: 64, offset: 128)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1343, file: !1344, line: 541, baseType: !1357, size: 256)
!1357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1344, line: 504, size: 256, elements: !1358)
!1358 = !{!1359, !1360, !1367, !1368}
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1357, file: !1344, line: 505, baseType: !1347, size: 32)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1357, file: !1344, line: 509, baseType: !1361, size: 64, offset: 64)
!1361 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1344, line: 501, baseType: !1362)
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64)
!1363 = !DISubroutineType(types: !1364)
!1364 = !{null, !1365}
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64)
!1366 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1357, file: !1344, line: 510, baseType: !1365, size: 64, offset: 128)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1357, file: !1344, line: 513, baseType: !1341, size: 64, offset: 192)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1343, file: !1344, line: 542, baseType: !1370, size: 128)
!1370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1344, line: 530, size: 128, elements: !1371)
!1371 = !{!1372, !1373}
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1370, file: !1344, line: 531, baseType: !1347, size: 32)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1370, file: !1344, line: 534, baseType: !1374, size: 64, offset: 64)
!1374 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1344, line: 525, baseType: !1375)
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64)
!1376 = !DISubroutineType(types: !1377)
!1377 = !{!727, !734, !732, !788, !788}
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1338, file: !912, line: 211, baseType: !7, size: 32, offset: 64)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1338, file: !912, line: 214, baseType: !790, size: 64, offset: 128)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1338, file: !912, line: 224, baseType: !1381, size: 64, offset: 192)
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1382, size: 64)
!1382 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !912, line: 202, baseType: !1383)
!1383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !912, line: 202, size: 128, elements: !1384)
!1384 = !{!1385}
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1383, file: !912, line: 202, baseType: !1386, size: 128)
!1386 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !912, line: 200, baseType: !1387)
!1387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !912, line: 200, size: 128, elements: !1388)
!1388 = !{!1389, !1390, !1391}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1387, file: !912, line: 200, baseType: !7, size: 32)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1387, file: !912, line: 200, baseType: !7, size: 32, offset: 32)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1387, file: !912, line: 200, baseType: !943, size: 64, offset: 64)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1338, file: !912, line: 234, baseType: !1381, size: 64, offset: 256)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1332, file: !912, line: 197, baseType: !790, size: 64, offset: 256)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !925, file: !912, line: 319, baseType: !797, size: 256)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !925, file: !912, line: 320, baseType: !816, size: 192)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !737, file: !135, line: 3384, baseType: !1397, size: 1472)
!1397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !135, line: 3114, size: 1472, elements: !1398)
!1398 = !{!1399, !1420, !1421, !1422, !1423}
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1397, file: !135, line: 3115, baseType: !1400, size: 1216)
!1400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !135, line: 2984, size: 1216, elements: !1401)
!1401 = !{!1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419}
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1400, file: !135, line: 2985, baseType: !905, size: 960)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1400, file: !135, line: 2986, baseType: !734, size: 64, offset: 960)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1400, file: !135, line: 2987, baseType: !734, size: 64, offset: 1024)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1400, file: !135, line: 2988, baseType: !734, size: 64, offset: 1088)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1400, file: !135, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1400, file: !135, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1400, file: !135, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1400, file: !135, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1400, file: !135, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1400, file: !135, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1400, file: !135, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1400, file: !135, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1400, file: !135, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1400, file: !135, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1400, file: !135, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1400, file: !135, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1400, file: !135, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1400, file: !135, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1397, file: !135, line: 3117, baseType: !734, size: 64, offset: 1216)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1397, file: !135, line: 3119, baseType: !734, size: 64, offset: 1280)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1397, file: !135, line: 3121, baseType: !734, size: 64, offset: 1344)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1397, file: !135, line: 3123, baseType: !734, size: 64, offset: 1408)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !737, file: !135, line: 3385, baseType: !1425, size: 1088)
!1425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !135, line: 2874, size: 1088, elements: !1426)
!1426 = !{!1427, !1428, !1429}
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1425, file: !135, line: 2875, baseType: !905, size: 960)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1425, file: !135, line: 2876, baseType: !909, size: 64, offset: 960)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1425, file: !135, line: 2877, baseType: !1430, size: 64, offset: 1024)
!1430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1431, size: 64)
!1431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1432, line: 172, size: 128, elements: !1433)
!1432 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1433 = !{!1434, !1435, !1436, !1437, !1438, !1439, !1440}
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1431, file: !1432, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1431, file: !1432, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1431, file: !1432, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1431, file: !1432, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1431, file: !1432, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1431, file: !1432, line: 195, baseType: !7, size: 32, offset: 32)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1431, file: !1432, line: 199, baseType: !734, size: 64, offset: 64)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !737, file: !135, line: 3386, baseType: !1400, size: 1216)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !737, file: !135, line: 3387, baseType: !1443, size: 1280)
!1443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !135, line: 3093, size: 1280, elements: !1444)
!1444 = !{!1445, !1446}
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1443, file: !135, line: 3094, baseType: !1400, size: 1216)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1443, file: !135, line: 3095, baseType: !1430, size: 64, offset: 1216)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !737, file: !135, line: 3388, baseType: !1448, size: 1216)
!1448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !135, line: 2824, size: 1216, elements: !1449)
!1449 = !{!1450, !1451, !1452, !1453, !1454, !1455}
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1448, file: !135, line: 2825, baseType: !867, size: 896)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1448, file: !135, line: 2827, baseType: !734, size: 64, offset: 896)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1448, file: !135, line: 2828, baseType: !734, size: 64, offset: 960)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1448, file: !135, line: 2829, baseType: !734, size: 64, offset: 1024)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1448, file: !135, line: 2830, baseType: !734, size: 64, offset: 1088)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1448, file: !135, line: 2831, baseType: !734, size: 64, offset: 1152)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !737, file: !135, line: 3389, baseType: !1457, size: 1024)
!1457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !135, line: 2850, size: 1024, elements: !1458)
!1458 = !{!1459, !1460, !1461}
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1457, file: !135, line: 2851, baseType: !905, size: 960)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1457, file: !135, line: 2852, baseType: !392, size: 32, offset: 960)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1457, file: !135, line: 2853, baseType: !392, size: 32, offset: 992)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !737, file: !135, line: 3390, baseType: !1463, size: 1024)
!1463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !135, line: 2857, size: 1024, elements: !1464)
!1464 = !{!1465, !1466}
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1463, file: !135, line: 2858, baseType: !905, size: 960)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1463, file: !135, line: 2859, baseType: !1430, size: 64, offset: 960)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !737, file: !135, line: 3391, baseType: !1468, size: 960)
!1468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !135, line: 2862, size: 960, elements: !1469)
!1469 = !{!1470}
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1468, file: !135, line: 2863, baseType: !905, size: 960)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !737, file: !135, line: 3392, baseType: !1472, size: 1472)
!1472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !135, line: 3304, size: 1472, elements: !1473)
!1473 = !{!1474}
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1472, file: !135, line: 3305, baseType: !1397, size: 1472)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !737, file: !135, line: 3393, baseType: !1476, size: 1792)
!1476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !135, line: 3248, size: 1792, elements: !1477)
!1477 = !{!1478, !1479, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809}
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1476, file: !135, line: 3249, baseType: !1397, size: 1472)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1476, file: !135, line: 3251, baseType: !1480, size: 64, offset: 1472)
!1480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1481, size: 64)
!1481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1482, line: 463, size: 1152, elements: !1483)
!1482 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1483 = !{!1484, !1643, !1674, !1675, !1730, !1733, !1734, !1735, !1736, !1737, !1738, !1762, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788}
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1481, file: !1482, line: 464, baseType: !1485, size: 64)
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1486, size: 64)
!1486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !330, line: 194, size: 384, elements: !1487)
!1487 = !{!1488, !1537, !1550, !1564, !1612, !1624}
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !1486, file: !330, line: 197, baseType: !1489, size: 64)
!1489 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !330, line: 182, baseType: !1490)
!1490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1491, size: 64)
!1491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !330, line: 116, size: 704, elements: !1492)
!1492 = !{!1493, !1494, !1495, !1496, !1497, !1498, !1525, !1534, !1535, !1536}
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !1491, file: !330, line: 119, baseType: !1490, size: 64)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1491, file: !330, line: 122, baseType: !1490, size: 64, offset: 64)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !1491, file: !330, line: 123, baseType: !1490, size: 64, offset: 128)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1491, file: !330, line: 126, baseType: !392, size: 32, offset: 192)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1491, file: !330, line: 129, baseType: !329, size: 32, offset: 224)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1491, file: !330, line: 165, baseType: !1499, size: 192, offset: 256)
!1499 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !330, line: 132, size: 192, elements: !1500)
!1500 = !{!1501, !1514, !1520}
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !1499, file: !330, line: 137, baseType: !1502, size: 128)
!1502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !330, line: 133, size: 128, elements: !1503)
!1503 = !{!1504, !1513}
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !1502, file: !330, line: 135, baseType: !1505, size: 64)
!1505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1506, size: 64)
!1506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !330, line: 93, size: 320, elements: !1507)
!1507 = !{!1508, !1509, !1510, !1511, !1512}
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !1506, file: !330, line: 96, baseType: !1505, size: 64)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !1506, file: !330, line: 97, baseType: !1505, size: 64, offset: 64)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1506, file: !330, line: 101, baseType: !734, size: 64, offset: 128)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !1506, file: !330, line: 106, baseType: !734, size: 64, offset: 192)
