; ModuleID = 'gimple-pretty-print.bc'
source_filename = "gimple-pretty-print.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.pretty_print_info = type { %struct.output_buffer*, i8*, i32, i32, i32, %struct.pp_wrapping_mode_t, i8 (%struct.pretty_print_info*, %struct.text_info*, i8*, i32, i8, i8, i8)*, i8, i8, i8 }
%struct.output_buffer = type { %struct.obstack, %struct.obstack, %struct.obstack*, %struct.chunk_info*, %struct._IO_FILE*, i32, [128 x i8] }
%struct.obstack = type { i64, %struct._obstack_chunk*, i8*, i8*, i8*, i64, i32, %struct._obstack_chunk* (i8*, i64)*, void (i8*, %struct._obstack_chunk*)*, i8*, i8 }
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [4 x i8] }
%struct.chunk_info = type { %struct.chunk_info*, [60 x i8*] }
%struct.pp_wrapping_mode_t = type { i32, i32 }
%struct.text_info = type { i8*, [1 x %struct.__va_list_tag]*, i32, i32*, %union.tree_node** }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%union.tree_node = type { %struct.tree_function_decl }

!327 = !DIEnumerator(name: "GIMPLE_INVALID_RHS", value: 0, isUnsigned: true)
!328 = !DIEnumerator(name: "GIMPLE_BINARY_RHS", value: 1, isUnsigned: true)
!329 = !DIEnumerator(name: "GIMPLE_UNARY_RHS", value: 2, isUnsigned: true)
!330 = !DIEnumerator(name: "GIMPLE_SINGLE_RHS", value: 3, isUnsigned: true)
!331 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_try_flags", file: !261, line: 514, baseType: !7, size: 32, elements: !332)
!332 = !{!333, !334, !335, !336}
!333 = !DIEnumerator(name: "GIMPLE_TRY_CATCH", value: 1, isUnsigned: true)
!334 = !DIEnumerator(name: "GIMPLE_TRY_FINALLY", value: 2, isUnsigned: true)
!335 = !DIEnumerator(name: "GIMPLE_TRY_KIND", value: 3, isUnsigned: true)
!336 = !DIEnumerator(name: "GIMPLE_TRY_CATCH_IS_CLEANUP", value: 4, isUnsigned: true)
!337 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "prediction", file: !338, line: 32, baseType: !7, size: 32, elements: !339)
!338 = !DIFile(filename: "./predict.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!339 = !{!340, !341}
!340 = !DIEnumerator(name: "NOT_TAKEN", value: 0, isUnsigned: true)
!341 = !DIEnumerator(name: "TAKEN", value: 1, isUnsigned: true)
!342 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "br_predictor", file: !338, line: 24, baseType: !7, size: 32, elements: !343)
!343 = !{!344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372}
!344 = !DIEnumerator(name: "PRED_COMBINED", value: 0, isUnsigned: true)
!345 = !DIEnumerator(name: "PRED_DS_THEORY", value: 1, isUnsigned: true)
!346 = !DIEnumerator(name: "PRED_FIRST_MATCH", value: 2, isUnsigned: true)
!347 = !DIEnumerator(name: "PRED_NO_PREDICTION", value: 3, isUnsigned: true)
!348 = !DIEnumerator(name: "PRED_UNCONDITIONAL", value: 4, isUnsigned: true)
!349 = !DIEnumerator(name: "PRED_LOOP_ITERATIONS", value: 5, isUnsigned: true)
!350 = !DIEnumerator(name: "PRED_BUILTIN_EXPECT", value: 6, isUnsigned: true)
!351 = !DIEnumerator(name: "PRED_LOOP_ITERATIONS_GUESSED", value: 7, isUnsigned: true)
!352 = !DIEnumerator(name: "PRED_CONTINUE", value: 8, isUnsigned: true)
!353 = !DIEnumerator(name: "PRED_NORETURN", value: 9, isUnsigned: true)
!354 = !DIEnumerator(name: "PRED_COLD_FUNCTION", value: 10, isUnsigned: true)
!355 = !DIEnumerator(name: "PRED_LOOP_BRANCH", value: 11, isUnsigned: true)
!356 = !DIEnumerator(name: "PRED_LOOP_EXIT", value: 12, isUnsigned: true)
!357 = !DIEnumerator(name: "PRED_POINTER", value: 13, isUnsigned: true)
!358 = !DIEnumerator(name: "PRED_TREE_POINTER", value: 14, isUnsigned: true)
!359 = !DIEnumerator(name: "PRED_OPCODE_POSITIVE", value: 15, isUnsigned: true)
!360 = !DIEnumerator(name: "PRED_OPCODE_NONEQUAL", value: 16, isUnsigned: true)
!361 = !DIEnumerator(name: "PRED_FPOPCODE", value: 17, isUnsigned: true)
!362 = !DIEnumerator(name: "PRED_TREE_OPCODE_POSITIVE", value: 18, isUnsigned: true)
!363 = !DIEnumerator(name: "PRED_TREE_OPCODE_NONEQUAL", value: 19, isUnsigned: true)
!364 = !DIEnumerator(name: "PRED_TREE_FPOPCODE", value: 20, isUnsigned: true)
!365 = !DIEnumerator(name: "PRED_CALL", value: 21, isUnsigned: true)
!366 = !DIEnumerator(name: "PRED_TREE_EARLY_RETURN", value: 22, isUnsigned: true)
!367 = !DIEnumerator(name: "PRED_GOTO", value: 23, isUnsigned: true)
!368 = !DIEnumerator(name: "PRED_CONST_RETURN", value: 24, isUnsigned: true)
!369 = !DIEnumerator(name: "PRED_NEGATIVE_RETURN", value: 25, isUnsigned: true)
!370 = !DIEnumerator(name: "PRED_NULL_RETURN", value: 26, isUnsigned: true)
!371 = !DIEnumerator(name: "PRED_MUDFLAP", value: 27, isUnsigned: true)
!372 = !DIEnumerator(name: "END_PREDICTORS", value: 28, isUnsigned: true)
!373 = !{!374, !375, !376, !377, !380, !381, !383, !385, !691, !1569, !725, !378, !55, !325, !331, !342, !441}
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!376 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !379)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !384, line: 44, baseType: !7)
!384 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !386, line: 56, baseType: !387)
!386 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !23, line: 3371, size: 1792, elements: !389)
!389 = !{!390, !423, !429, !442, !461, !468, !473, !482, !488, !501, !511, !549, !557, !585, !602, !603, !608, !617, !623, !628, !632, !636, !1218, !1267, !1273, !1279, !1286, !1299, !1313, !1330, !1342, !1364, !1379, !1551}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !388, file: !23, line: 3372, baseType: !391, size: 64)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !23, line: 360, size: 64, elements: !392)
!392 = !{!393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !391, file: !23, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !391, file: !23, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !391, file: !23, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !391, file: !23, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !391, file: !23, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !391, file: !23, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !391, file: !23, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !391, file: !23, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !391, file: !23, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !391, file: !23, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !391, file: !23, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !391, file: !23, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !391, file: !23, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !391, file: !23, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !391, file: !23, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !391, file: !23, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !391, file: !23, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !391, file: !23, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !391, file: !23, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !391, file: !23, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !391, file: !23, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !391, file: !23, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !391, file: !23, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !391, file: !23, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !391, file: !23, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !391, file: !23, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !391, file: !23, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !391, file: !23, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !391, file: !23, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !391, file: !23, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !388, file: !23, line: 3373, baseType: !424, size: 192)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !23, line: 402, size: 192, elements: !425)
!425 = !{!426, !427, !428}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !424, file: !23, line: 403, baseType: !391, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !424, file: !23, line: 404, baseType: !385, size: 64, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !424, file: !23, line: 405, baseType: !385, size: 64, offset: 128)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !388, file: !23, line: 3374, baseType: !430, size: 320)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !23, line: 1384, size: 320, elements: !431)
!431 = !{!432, !433}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !430, file: !23, line: 1385, baseType: !424, size: 192)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !430, file: !23, line: 1386, baseType: !434, size: 128, offset: 192)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !435, line: 58, baseType: !436)
!435 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !435, line: 54, size: 128, elements: !437)
!437 = !{!438, !440}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !436, file: !435, line: 56, baseType: !439, size: 64)
!439 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !436, file: !435, line: 57, baseType: !441, size: 64, offset: 64)
!441 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !388, file: !23, line: 3375, baseType: !443, size: 256)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !23, line: 1397, size: 256, elements: !444)
!444 = !{!445, !446}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !443, file: !23, line: 1398, baseType: !424, size: 192)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !443, file: !23, line: 1399, baseType: !447, size: 64, offset: 192)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !449, line: 52, size: 256, elements: !450)
!449 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!450 = !{!451, !452, !453, !454, !455, !456, !457}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !448, file: !449, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !448, file: !449, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !448, file: !449, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !448, file: !449, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !448, file: !449, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !448, file: !449, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !448, file: !449, line: 62, baseType: !458, size: 192, offset: 64)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 192, elements: !459)
!459 = !{!460}
!460 = !DISubrange(count: 3)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !388, file: !23, line: 3376, baseType: !462, size: 256)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !23, line: 1408, size: 256, elements: !463)
!463 = !{!464, !465}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !462, file: !23, line: 1409, baseType: !424, size: 192)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !462, file: !23, line: 1410, baseType: !466, size: 64, offset: 192)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !23, line: 1403, flags: DIFlagFwdDecl)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !388, file: !23, line: 3377, baseType: !469, size: 256)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !23, line: 1437, size: 256, elements: !470)
!470 = !{!471, !472}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !469, file: !23, line: 1438, baseType: !424, size: 192)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !469, file: !23, line: 1439, baseType: !385, size: 64, offset: 192)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !388, file: !23, line: 3378, baseType: !474, size: 256)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !23, line: 1418, size: 256, elements: !475)
!475 = !{!476, !477, !478}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !474, file: !23, line: 1419, baseType: !424, size: 192)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !474, file: !23, line: 1420, baseType: !376, size: 32, offset: 192)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !474, file: !23, line: 1421, baseType: !479, size: 8, offset: 224)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !379, size: 8, elements: !480)
!480 = !{!481}
!481 = !DISubrange(count: 1)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !388, file: !23, line: 3379, baseType: !483, size: 320)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !23, line: 1428, size: 320, elements: !484)
!484 = !{!485, !486, !487}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !483, file: !23, line: 1429, baseType: !424, size: 192)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !483, file: !23, line: 1430, baseType: !385, size: 64, offset: 192)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !483, file: !23, line: 1431, baseType: !385, size: 64, offset: 256)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !388, file: !23, line: 3380, baseType: !489, size: 320)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !23, line: 1460, size: 320, elements: !490)
!490 = !{!491, !492}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !489, file: !23, line: 1461, baseType: !424, size: 192)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !489, file: !23, line: 1462, baseType: !493, size: 128, offset: 192)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !494, line: 31, size: 128, elements: !495)
!494 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!495 = !{!496, !499, !500}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !493, file: !494, line: 32, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !375)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !493, file: !494, line: 33, baseType: !7, size: 32, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !493, file: !494, line: 34, baseType: !7, size: 32, offset: 96)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !388, file: !23, line: 3381, baseType: !502, size: 384)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !23, line: 2507, size: 384, elements: !503)
!503 = !{!504, !505, !508, !509, !510}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !502, file: !23, line: 2508, baseType: !424, size: 192)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !502, file: !23, line: 2509, baseType: !506, size: 32, offset: 192)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !507, line: 58, baseType: !383)
!507 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!508 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !502, file: !23, line: 2510, baseType: !7, size: 32, offset: 224)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !502, file: !23, line: 2511, baseType: !385, size: 64, offset: 256)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !502, file: !23, line: 2512, baseType: !385, size: 64, offset: 320)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !388, file: !23, line: 3382, baseType: !512, size: 896)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !23, line: 2652, size: 896, elements: !513)
!513 = !{!514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !512, file: !23, line: 2653, baseType: !502, size: 384)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !512, file: !23, line: 2654, baseType: !385, size: 64, offset: 384)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !512, file: !23, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !512, file: !23, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !512, file: !23, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !512, file: !23, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !512, file: !23, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !512, file: !23, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !512, file: !23, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !512, file: !23, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !512, file: !23, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !512, file: !23, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !512, file: !23, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !512, file: !23, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !512, file: !23, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !512, file: !23, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !512, file: !23, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !512, file: !23, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !512, file: !23, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !512, file: !23, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !512, file: !23, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !512, file: !23, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !512, file: !23, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !512, file: !23, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !512, file: !23, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !512, file: !23, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !512, file: !23, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !512, file: !23, line: 2703, baseType: !7, size: 32, offset: 512)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !512, file: !23, line: 2705, baseType: !385, size: 64, offset: 576)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !512, file: !23, line: 2706, baseType: !385, size: 64, offset: 640)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !512, file: !23, line: 2707, baseType: !385, size: 64, offset: 704)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !512, file: !23, line: 2708, baseType: !385, size: 64, offset: 768)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !512, file: !23, line: 2711, baseType: !547, size: 64, offset: 832)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !23, line: 2711, flags: DIFlagFwdDecl)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !388, file: !23, line: 3383, baseType: !550, size: 960)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !23, line: 2756, size: 960, elements: !551)
!551 = !{!552, !553}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !550, file: !23, line: 2757, baseType: !512, size: 896)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !550, file: !23, line: 2758, baseType: !554, size: 64, offset: 896)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !386, line: 50, baseType: !555)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !386, line: 49, flags: DIFlagFwdDecl)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !388, file: !23, line: 3384, baseType: !558, size: 1472)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !23, line: 3114, size: 1472, elements: !559)
!559 = !{!560, !581, !582, !583, !584}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !558, file: !23, line: 3115, baseType: !561, size: 1216)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !23, line: 2984, size: 1216, elements: !562)
!562 = !{!563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !561, file: !23, line: 2985, baseType: !550, size: 960)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !561, file: !23, line: 2986, baseType: !385, size: 64, offset: 960)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !561, file: !23, line: 2987, baseType: !385, size: 64, offset: 1024)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !561, file: !23, line: 2988, baseType: !385, size: 64, offset: 1088)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !561, file: !23, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !561, file: !23, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !561, file: !23, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !561, file: !23, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !561, file: !23, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !561, file: !23, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !561, file: !23, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !561, file: !23, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !561, file: !23, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !561, file: !23, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !561, file: !23, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !561, file: !23, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !561, file: !23, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !561, file: !23, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !558, file: !23, line: 3117, baseType: !385, size: 64, offset: 1216)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !558, file: !23, line: 3119, baseType: !385, size: 64, offset: 1280)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !558, file: !23, line: 3121, baseType: !385, size: 64, offset: 1344)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !558, file: !23, line: 3123, baseType: !385, size: 64, offset: 1408)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !388, file: !23, line: 3385, baseType: !586, size: 1088)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !23, line: 2874, size: 1088, elements: !587)
!587 = !{!588, !589, !590}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !586, file: !23, line: 2875, baseType: !550, size: 960)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !586, file: !23, line: 2876, baseType: !554, size: 64, offset: 960)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !586, file: !23, line: 2877, baseType: !591, size: 64, offset: 1024)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !593, line: 172, size: 128, elements: !594)
!593 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!594 = !{!595, !596, !597, !598, !599, !600, !601}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !592, file: !593, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !592, file: !593, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !592, file: !593, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !592, file: !593, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !592, file: !593, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !592, file: !593, line: 195, baseType: !7, size: 32, offset: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !592, file: !593, line: 199, baseType: !385, size: 64, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !388, file: !23, line: 3386, baseType: !561, size: 1216)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !388, file: !23, line: 3387, baseType: !604, size: 1280)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !23, line: 3093, size: 1280, elements: !605)
!605 = !{!606, !607}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !604, file: !23, line: 3094, baseType: !561, size: 1216)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !604, file: !23, line: 3095, baseType: !591, size: 64, offset: 1216)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !388, file: !23, line: 3388, baseType: !609, size: 1216)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !23, line: 2824, size: 1216, elements: !610)
!610 = !{!611, !612, !613, !614, !615, !616}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !609, file: !23, line: 2825, baseType: !512, size: 896)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !609, file: !23, line: 2827, baseType: !385, size: 64, offset: 896)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !609, file: !23, line: 2828, baseType: !385, size: 64, offset: 960)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !609, file: !23, line: 2829, baseType: !385, size: 64, offset: 1024)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !609, file: !23, line: 2830, baseType: !385, size: 64, offset: 1088)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !609, file: !23, line: 2831, baseType: !385, size: 64, offset: 1152)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !388, file: !23, line: 3389, baseType: !618, size: 1024)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !23, line: 2850, size: 1024, elements: !619)
!619 = !{!620, !621, !622}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !618, file: !23, line: 2851, baseType: !550, size: 960)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !618, file: !23, line: 2852, baseType: !376, size: 32, offset: 960)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !618, file: !23, line: 2853, baseType: !376, size: 32, offset: 992)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !388, file: !23, line: 3390, baseType: !624, size: 1024)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !23, line: 2857, size: 1024, elements: !625)
!625 = !{!626, !627}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !624, file: !23, line: 2858, baseType: !550, size: 960)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !624, file: !23, line: 2859, baseType: !591, size: 64, offset: 960)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !388, file: !23, line: 3391, baseType: !629, size: 960)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !23, line: 2862, size: 960, elements: !630)
!630 = !{!631}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !629, file: !23, line: 2863, baseType: !550, size: 960)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !388, file: !23, line: 3392, baseType: !633, size: 1472)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !23, line: 3304, size: 1472, elements: !634)
!634 = !{!635}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !633, file: !23, line: 3305, baseType: !558, size: 1472)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !388, file: !23, line: 3393, baseType: !637, size: 1792)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !23, line: 3248, size: 1792, elements: !638)
!638 = !{!639, !640, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !637, file: !23, line: 3249, baseType: !558, size: 1472)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !637, file: !23, line: 3251, baseType: !641, size: 64, offset: 1472)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !643, line: 463, size: 1152, elements: !644)
!643 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!644 = !{!645, !648, !965, !966, !1138, !1141, !1142, !1143, !1144, !1145, !1146, !1170, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !642, file: !643, line: 464, baseType: !646, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !643, line: 464, flags: DIFlagFwdDecl)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !642, file: !643, line: 467, baseType: !649, size: 64, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !6, line: 374, size: 640, elements: !651)
!651 = !{!652, !940, !941, !954, !955, !956, !957, !958, !959, !961, !963, !964}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !650, file: !6, line: 377, baseType: !653, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !386, line: 111, baseType: !654)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !6, line: 217, size: 832, elements: !656)
!656 = !{!657, !903, !904, !905, !908, !914, !915, !916, !934, !935, !936, !937, !938, !939}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !655, file: !6, line: 219, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !6, line: 151, baseType: !660)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !6, line: 151, size: 128, elements: !661)
!661 = !{!662}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !660, file: !6, line: 151, baseType: !663, size: 128)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !6, line: 150, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !6, line: 150, size: 128, elements: !665)
!665 = !{!666, !667, !668}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !664, file: !6, line: 150, baseType: !7, size: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !664, file: !6, line: 150, baseType: !7, size: 32, offset: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !664, file: !6, line: 150, baseType: !669, size: 64, offset: 64)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !670, size: 64, elements: !480)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !386, line: 108, baseType: !671)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !6, line: 122, size: 512, elements: !673)
!673 = !{!674, !675, !676, !895, !896, !897, !898, !899, !900, !901}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !672, file: !6, line: 124, baseType: !654, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !672, file: !6, line: 125, baseType: !654, size: 64, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !672, file: !6, line: 131, baseType: !677, size: 64, offset: 128)
!677 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !6, line: 128, size: 64, elements: !678)
!678 = !{!679, !894}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !677, file: !6, line: 129, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !386, line: 66, baseType: !681)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !261, line: 143, size: 192, elements: !683)
!683 = !{!684, !892, !893}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !682, file: !261, line: 145, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !386, line: 69, baseType: !686)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !261, line: 136, size: 192, elements: !688)
!688 = !{!689, !890, !891}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !687, file: !261, line: 137, baseType: !690, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !386, line: 58, baseType: !691)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !261, line: 737, size: 768, elements: !693)
!693 = !{!694, !711, !745, !751, !756, !761, !768, !774, !780, !785, !799, !804, !810, !815, !825, !830, !848, !855, !862, !868, !873, !879, !885}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !692, file: !261, line: 738, baseType: !695, size: 256)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !261, line: 271, size: 256, elements: !696)
!696 = !{!697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !695, file: !261, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !695, file: !261, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !695, file: !261, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !695, file: !261, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !695, file: !261, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !695, file: !261, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !695, file: !261, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !695, file: !261, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !695, file: !261, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !695, file: !261, line: 312, baseType: !7, size: 32, offset: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !695, file: !261, line: 316, baseType: !506, size: 32, offset: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !695, file: !261, line: 319, baseType: !7, size: 32, offset: 96)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !695, file: !261, line: 323, baseType: !654, size: 64, offset: 128)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !695, file: !261, line: 327, baseType: !385, size: 64, offset: 192)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !692, file: !261, line: 739, baseType: !712, size: 448)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !261, line: 350, size: 448, elements: !713)
!713 = !{!714, !743}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !712, file: !261, line: 353, baseType: !715, size: 384)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !261, line: 333, size: 384, elements: !716)
!716 = !{!717, !718, !726}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !715, file: !261, line: 336, baseType: !695, size: 256)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !715, file: !261, line: 343, baseType: !719, size: 64, offset: 256)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !721, line: 37, size: 128, elements: !722)
!721 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!722 = !{!723, !724}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !720, file: !721, line: 39, baseType: !719, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !720, file: !721, line: 40, baseType: !725, size: 64, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !715, file: !261, line: 344, baseType: !727, size: 64, offset: 320)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !721, line: 45, size: 320, elements: !729)
!729 = !{!730, !731}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !728, file: !721, line: 47, baseType: !727, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !728, file: !721, line: 48, baseType: !732, size: 256, offset: 64)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !23, line: 1883, size: 256, elements: !733)
!733 = !{!734, !736, !737, !742}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !732, file: !23, line: 1884, baseType: !735, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !732, file: !23, line: 1885, baseType: !735, size: 64, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !732, file: !23, line: 1891, baseType: !738, size: 64, offset: 128)
!738 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !732, file: !23, line: 1891, size: 64, elements: !739)
!739 = !{!740, !741}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !738, file: !23, line: 1891, baseType: !690, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !738, file: !23, line: 1891, baseType: !385, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !732, file: !23, line: 1892, baseType: !725, size: 64, offset: 192)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !712, file: !261, line: 359, baseType: !744, size: 64, offset: 384)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !385, size: 64, elements: !480)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !692, file: !261, line: 740, baseType: !746, size: 512)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !261, line: 365, size: 512, elements: !747)
!747 = !{!748, !749, !750}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !746, file: !261, line: 368, baseType: !715, size: 384)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !746, file: !261, line: 373, baseType: !385, size: 64, offset: 384)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !746, file: !261, line: 374, baseType: !385, size: 64, offset: 448)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !692, file: !261, line: 741, baseType: !752, size: 576)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !261, line: 380, size: 576, elements: !753)
!753 = !{!754, !755}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !752, file: !261, line: 383, baseType: !746, size: 512)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !752, file: !261, line: 389, baseType: !744, size: 64, offset: 512)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !692, file: !261, line: 742, baseType: !757, size: 320)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !261, line: 395, size: 320, elements: !758)
!758 = !{!759, !760}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !757, file: !261, line: 397, baseType: !695, size: 256)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !757, file: !261, line: 400, baseType: !680, size: 64, offset: 256)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !692, file: !261, line: 743, baseType: !762, size: 448)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !261, line: 406, size: 448, elements: !763)
!763 = !{!764, !765, !766, !767}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !762, file: !261, line: 408, baseType: !695, size: 256)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !762, file: !261, line: 412, baseType: !385, size: 64, offset: 256)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !762, file: !261, line: 420, baseType: !385, size: 64, offset: 320)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !762, file: !261, line: 423, baseType: !680, size: 64, offset: 384)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !692, file: !261, line: 744, baseType: !769, size: 384)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !261, line: 429, size: 384, elements: !770)
!770 = !{!771, !772, !773}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !769, file: !261, line: 431, baseType: !695, size: 256)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !769, file: !261, line: 434, baseType: !385, size: 64, offset: 256)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !769, file: !261, line: 437, baseType: !680, size: 64, offset: 320)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !692, file: !261, line: 745, baseType: !775, size: 384)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !261, line: 443, size: 384, elements: !776)
!776 = !{!777, !778, !779}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !775, file: !261, line: 445, baseType: !695, size: 256)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !775, file: !261, line: 449, baseType: !385, size: 64, offset: 256)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !775, file: !261, line: 453, baseType: !680, size: 64, offset: 320)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !692, file: !261, line: 746, baseType: !781, size: 320)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !261, line: 459, size: 320, elements: !782)
!782 = !{!783, !784}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !781, file: !261, line: 461, baseType: !695, size: 256)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !781, file: !261, line: 464, baseType: !385, size: 64, offset: 256)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !692, file: !261, line: 747, baseType: !786, size: 768)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !261, line: 469, size: 768, elements: !787)
!787 = !{!788, !789, !790, !791, !792}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !786, file: !261, line: 471, baseType: !695, size: 256)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !786, file: !261, line: 474, baseType: !7, size: 32, offset: 256)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !786, file: !261, line: 475, baseType: !7, size: 32, offset: 288)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !786, file: !261, line: 478, baseType: !385, size: 64, offset: 320)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !786, file: !261, line: 481, baseType: !793, size: 384, offset: 384)
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !794, size: 384, elements: !480)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !23, line: 1917, size: 384, elements: !795)
!795 = !{!796, !797, !798}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !794, file: !23, line: 1920, baseType: !732, size: 256)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !794, file: !23, line: 1921, baseType: !385, size: 64, offset: 256)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !794, file: !23, line: 1922, baseType: !506, size: 32, offset: 320)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !692, file: !261, line: 748, baseType: !800, size: 320)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !261, line: 487, size: 320, elements: !801)
!801 = !{!802, !803}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !800, file: !261, line: 490, baseType: !695, size: 256)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !800, file: !261, line: 494, baseType: !376, size: 32, offset: 256)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !692, file: !261, line: 749, baseType: !805, size: 384)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !261, line: 500, size: 384, elements: !806)
!806 = !{!807, !808, !809}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !805, file: !261, line: 502, baseType: !695, size: 256)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !805, file: !261, line: 506, baseType: !680, size: 64, offset: 256)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !805, file: !261, line: 510, baseType: !680, size: 64, offset: 320)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !692, file: !261, line: 750, baseType: !811, size: 320)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !261, line: 529, size: 320, elements: !812)
!812 = !{!813, !814}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !811, file: !261, line: 531, baseType: !695, size: 256)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !811, file: !261, line: 540, baseType: !680, size: 64, offset: 256)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !692, file: !261, line: 751, baseType: !816, size: 704)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !261, line: 546, size: 704, elements: !817)
!817 = !{!818, !819, !820, !821, !822, !823, !824}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !816, file: !261, line: 549, baseType: !746, size: 512)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !816, file: !261, line: 553, baseType: !381, size: 64, offset: 512)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !816, file: !261, line: 557, baseType: !375, size: 8, offset: 576)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !816, file: !261, line: 558, baseType: !375, size: 8, offset: 584)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !816, file: !261, line: 559, baseType: !375, size: 8, offset: 592)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !816, file: !261, line: 560, baseType: !375, size: 8, offset: 600)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !816, file: !261, line: 566, baseType: !744, size: 64, offset: 640)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !692, file: !261, line: 752, baseType: !826, size: 384)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !261, line: 571, size: 384, elements: !827)
!827 = !{!828, !829}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !826, file: !261, line: 573, baseType: !757, size: 320)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !826, file: !261, line: 577, baseType: !385, size: 64, offset: 320)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !692, file: !261, line: 753, baseType: !831, size: 576)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !261, line: 600, size: 576, elements: !832)
!832 = !{!833, !834, !835, !838, !847}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !831, file: !261, line: 602, baseType: !757, size: 320)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !831, file: !261, line: 605, baseType: !385, size: 64, offset: 320)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !831, file: !261, line: 609, baseType: !836, size: 64, offset: 384)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !837, line: 46, baseType: !439)
!837 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!838 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !831, file: !261, line: 612, baseType: !839, size: 64, offset: 448)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !261, line: 581, size: 320, elements: !841)
!841 = !{!842, !843, !844, !845, !846}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !840, file: !261, line: 583, baseType: !55, size: 32)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !840, file: !261, line: 586, baseType: !385, size: 64, offset: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !840, file: !261, line: 589, baseType: !385, size: 64, offset: 128)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !840, file: !261, line: 592, baseType: !385, size: 64, offset: 192)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !840, file: !261, line: 595, baseType: !385, size: 64, offset: 256)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !831, file: !261, line: 616, baseType: !680, size: 64, offset: 512)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !692, file: !261, line: 754, baseType: !849, size: 512)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !261, line: 622, size: 512, elements: !850)
!850 = !{!851, !852, !853, !854}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !849, file: !261, line: 624, baseType: !757, size: 320)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !849, file: !261, line: 628, baseType: !385, size: 64, offset: 320)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !849, file: !261, line: 632, baseType: !385, size: 64, offset: 384)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !849, file: !261, line: 636, baseType: !385, size: 64, offset: 448)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !692, file: !261, line: 755, baseType: !856, size: 704)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !261, line: 642, size: 704, elements: !857)
!857 = !{!858, !859, !860, !861}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !856, file: !261, line: 644, baseType: !849, size: 512)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !856, file: !261, line: 648, baseType: !385, size: 64, offset: 512)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !856, file: !261, line: 652, baseType: !385, size: 64, offset: 576)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !856, file: !261, line: 653, baseType: !385, size: 64, offset: 640)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !692, file: !261, line: 756, baseType: !863, size: 448)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !261, line: 663, size: 448, elements: !864)
!864 = !{!865, !866, !867}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !863, file: !261, line: 665, baseType: !757, size: 320)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !863, file: !261, line: 668, baseType: !385, size: 64, offset: 320)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !863, file: !261, line: 673, baseType: !385, size: 64, offset: 384)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !692, file: !261, line: 757, baseType: !869, size: 384)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !261, line: 694, size: 384, elements: !870)
!870 = !{!871, !872}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !869, file: !261, line: 696, baseType: !757, size: 320)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !869, file: !261, line: 699, baseType: !385, size: 64, offset: 320)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !692, file: !261, line: 758, baseType: !874, size: 384)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !261, line: 681, size: 384, elements: !875)
!875 = !{!876, !877, !878}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !874, file: !261, line: 683, baseType: !695, size: 256)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !874, file: !261, line: 686, baseType: !385, size: 64, offset: 256)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !874, file: !261, line: 689, baseType: !385, size: 64, offset: 320)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !692, file: !261, line: 759, baseType: !880, size: 384)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !261, line: 707, size: 384, elements: !881)
!881 = !{!882, !883, !884}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !880, file: !261, line: 709, baseType: !695, size: 256)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !880, file: !261, line: 712, baseType: !385, size: 64, offset: 256)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !880, file: !261, line: 712, baseType: !385, size: 64, offset: 320)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !692, file: !261, line: 760, baseType: !886, size: 320)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !261, line: 718, size: 320, elements: !887)
!887 = !{!888, !889}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !886, file: !261, line: 720, baseType: !695, size: 256)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !886, file: !261, line: 723, baseType: !385, size: 64, offset: 256)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !687, file: !261, line: 138, baseType: !686, size: 64, offset: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !687, file: !261, line: 139, baseType: !686, size: 64, offset: 128)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !682, file: !261, line: 146, baseType: !685, size: 64, offset: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !682, file: !261, line: 152, baseType: !680, size: 64, offset: 128)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !677, file: !6, line: 130, baseType: !554, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !672, file: !6, line: 134, baseType: !380, size: 64, offset: 192)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !672, file: !6, line: 137, baseType: !385, size: 64, offset: 256)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !672, file: !6, line: 138, baseType: !506, size: 32, offset: 320)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !672, file: !6, line: 142, baseType: !7, size: 32, offset: 352)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !672, file: !6, line: 144, baseType: !376, size: 32, offset: 384)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !672, file: !6, line: 145, baseType: !376, size: 32, offset: 416)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !672, file: !6, line: 146, baseType: !902, size: 64, offset: 448)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !6, line: 119, baseType: !441)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !655, file: !6, line: 220, baseType: !658, size: 64, offset: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !655, file: !6, line: 223, baseType: !380, size: 64, offset: 128)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !655, file: !6, line: 226, baseType: !906, size: 64, offset: 192)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !6, line: 185, flags: DIFlagFwdDecl)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !655, file: !6, line: 229, baseType: !909, size: 128, offset: 256)
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !910, size: 128, elements: !912)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !6, line: 229, flags: DIFlagFwdDecl)
!912 = !{!913}
!913 = !DISubrange(count: 2)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !655, file: !6, line: 232, baseType: !654, size: 64, offset: 384)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !655, file: !6, line: 233, baseType: !654, size: 64, offset: 448)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !655, file: !6, line: 238, baseType: !917, size: 64, offset: 512)
!917 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !6, line: 235, size: 64, elements: !918)
!918 = !{!919, !925}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !917, file: !6, line: 236, baseType: !920, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !6, line: 273, size: 128, elements: !922)
!922 = !{!923, !924}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !921, file: !6, line: 275, baseType: !680, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !921, file: !6, line: 278, baseType: !680, size: 64, offset: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !917, file: !6, line: 237, baseType: !926, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !6, line: 259, size: 320, elements: !928)
!928 = !{!929, !930, !931, !932, !933}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !927, file: !6, line: 261, baseType: !554, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !927, file: !6, line: 262, baseType: !554, size: 64, offset: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !927, file: !6, line: 266, baseType: !554, size: 64, offset: 128)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !927, file: !6, line: 267, baseType: !554, size: 64, offset: 192)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !927, file: !6, line: 270, baseType: !376, size: 32, offset: 256)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !655, file: !6, line: 241, baseType: !902, size: 64, offset: 576)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !655, file: !6, line: 244, baseType: !376, size: 32, offset: 640)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !655, file: !6, line: 247, baseType: !376, size: 32, offset: 672)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !655, file: !6, line: 250, baseType: !376, size: 32, offset: 704)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !655, file: !6, line: 253, baseType: !376, size: 32, offset: 736)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !655, file: !6, line: 256, baseType: !376, size: 32, offset: 768)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !650, file: !6, line: 378, baseType: !653, size: 64, offset: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !650, file: !6, line: 381, baseType: !942, size: 64, offset: 128)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !6, line: 282, baseType: !944)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !6, line: 282, size: 128, elements: !945)
!945 = !{!946}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !944, file: !6, line: 282, baseType: !947, size: 128)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !6, line: 281, baseType: !948)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !6, line: 281, size: 128, elements: !949)
!949 = !{!950, !951, !952}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !948, file: !6, line: 281, baseType: !7, size: 32)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !948, file: !6, line: 281, baseType: !7, size: 32, offset: 32)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !948, file: !6, line: 281, baseType: !953, size: 64, offset: 64)
!953 = !DICompositeType(tag: DW_TAG_array_type, baseType: !653, size: 64, elements: !480)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !650, file: !6, line: 384, baseType: !376, size: 32, offset: 192)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !650, file: !6, line: 387, baseType: !376, size: 32, offset: 224)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !650, file: !6, line: 390, baseType: !376, size: 32, offset: 256)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !650, file: !6, line: 394, baseType: !942, size: 64, offset: 320)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !650, file: !6, line: 396, baseType: !5, size: 32, offset: 384)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !650, file: !6, line: 399, baseType: !960, size: 64, offset: 416)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 64, elements: !912)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !650, file: !6, line: 402, baseType: !962, size: 64, offset: 480)
!962 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !912)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !650, file: !6, line: 406, baseType: !376, size: 32, offset: 544)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !650, file: !6, line: 409, baseType: !376, size: 32, offset: 576)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !642, file: !643, line: 470, baseType: !681, size: 64, offset: 128)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !642, file: !643, line: 473, baseType: !967, size: 64, offset: 192)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !593, line: 39, size: 1152, elements: !969)
!969 = !{!970, !1020, !1033, !1045, !1046, !1115, !1116, !1120, !1121, !1122, !1123, !1124}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !968, file: !593, line: 41, baseType: !971, size: 64)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !972, line: 144, baseType: !973)
!972 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !972, line: 100, size: 896, elements: !975)
!975 = !{!976, !984, !989, !994, !996, !997, !998, !999, !1000, !1001, !1006, !1008, !1009, !1014, !1019}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !974, file: !972, line: 102, baseType: !977, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !972, line: 52, baseType: !978)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!981, !982}
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !972, line: 47, baseType: !7)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !974, file: !972, line: 105, baseType: !985, size: 64, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !972, line: 59, baseType: !986)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!376, !982, !982}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !974, file: !972, line: 108, baseType: !990, size: 64, offset: 128)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !972, line: 63, baseType: !991)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = !DISubroutineType(types: !993)
!993 = !{null, !380}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !974, file: !972, line: 111, baseType: !995, size: 64, offset: 192)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !974, file: !972, line: 114, baseType: !836, size: 64, offset: 256)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !974, file: !972, line: 117, baseType: !836, size: 64, offset: 320)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !974, file: !972, line: 120, baseType: !836, size: 64, offset: 384)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !974, file: !972, line: 124, baseType: !7, size: 32, offset: 448)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !974, file: !972, line: 128, baseType: !7, size: 32, offset: 480)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !974, file: !972, line: 131, baseType: !1002, size: 64, offset: 512)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !972, line: 75, baseType: !1003)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!380, !836, !836}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !974, file: !972, line: 132, baseType: !1007, size: 64, offset: 576)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !972, line: 78, baseType: !991)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !974, file: !972, line: 135, baseType: !380, size: 64, offset: 640)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !974, file: !972, line: 136, baseType: !1010, size: 64, offset: 704)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !972, line: 82, baseType: !1011)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!380, !380, !836, !836}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !974, file: !972, line: 137, baseType: !1015, size: 64, offset: 768)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !972, line: 83, baseType: !1016)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{null, !380, !380}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !974, file: !972, line: 141, baseType: !7, size: 32, offset: 832)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !968, file: !593, line: 48, baseType: !1021, size: 64, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !261, line: 35, baseType: !1023)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !261, line: 35, size: 128, elements: !1024)
!1024 = !{!1025}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1023, file: !261, line: 35, baseType: !1026, size: 128)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !261, line: 33, baseType: !1027)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !261, line: 33, size: 128, elements: !1028)
!1028 = !{!1029, !1030, !1031}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1027, file: !261, line: 33, baseType: !7, size: 32)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1027, file: !261, line: 33, baseType: !7, size: 32, offset: 32)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1027, file: !261, line: 33, baseType: !1032, size: 64, offset: 64)
!1032 = !DICompositeType(tag: DW_TAG_array_type, baseType: !690, size: 64, elements: !480)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !968, file: !593, line: 51, baseType: !1034, size: 64, offset: 128)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !23, line: 183, baseType: !1036)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !23, line: 183, size: 128, elements: !1037)
!1037 = !{!1038}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1036, file: !23, line: 183, baseType: !1039, size: 128)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !23, line: 182, baseType: !1040)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !23, line: 182, size: 128, elements: !1041)
!1041 = !{!1042, !1043, !1044}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1040, file: !23, line: 182, baseType: !7, size: 32)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1040, file: !23, line: 182, baseType: !7, size: 32, offset: 32)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1040, file: !23, line: 182, baseType: !744, size: 64, offset: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !968, file: !593, line: 54, baseType: !385, size: 64, offset: 192)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !968, file: !593, line: 57, baseType: !1047, size: 128, offset: 256)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1048, line: 31, size: 128, elements: !1049)
!1048 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1049 = !{!1050, !1051, !1052, !1053, !1054, !1055, !1056}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1047, file: !1048, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1047, file: !1048, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1047, file: !1048, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1047, file: !1048, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1047, file: !1048, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1047, file: !1048, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1047, file: !1048, line: 56, baseType: !1057, size: 64, offset: 64)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !386, line: 47, baseType: !1058)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1060, line: 75, size: 256, elements: !1061)
!1060 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1061 = !{!1062, !1074, !1075, !1076}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1059, file: !1060, line: 76, baseType: !1063, size: 64)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1060, line: 68, baseType: !1065)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1060, line: 63, size: 320, elements: !1066)
!1066 = !{!1067, !1069, !1070, !1071}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1065, file: !1060, line: 64, baseType: !1068, size: 64)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1065, file: !1060, line: 65, baseType: !1068, size: 64, offset: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1065, file: !1060, line: 66, baseType: !7, size: 32, offset: 128)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1065, file: !1060, line: 67, baseType: !1072, size: 128, offset: 192)
!1072 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1073, size: 128, elements: !912)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1060, line: 29, baseType: !439)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1059, file: !1060, line: 77, baseType: !1063, size: 64, offset: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1059, file: !1060, line: 78, baseType: !7, size: 32, offset: 128)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1059, file: !1060, line: 79, baseType: !1077, size: 64, offset: 192)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1060, line: 49, baseType: !1079)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1060, line: 45, size: 832, elements: !1080)
!1080 = !{!1081, !1082, !1083}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1079, file: !1060, line: 46, baseType: !1068, size: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1079, file: !1060, line: 47, baseType: !1058, size: 64, offset: 64)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1079, file: !1060, line: 48, baseType: !1084, size: 704, offset: 128)
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1085, line: 164, size: 704, elements: !1086)
!1085 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1086 = !{!1087, !1088, !1098, !1099, !1100, !1101, !1102, !1103, !1107, !1111, !1112, !1113, !1114}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1084, file: !1085, line: 166, baseType: !441, size: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1084, file: !1085, line: 167, baseType: !1089, size: 64, offset: 64)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1085, line: 157, size: 192, elements: !1091)
!1091 = !{!1092, !1093, !1094}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1090, file: !1085, line: 159, baseType: !378, size: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1090, file: !1085, line: 160, baseType: !1089, size: 64, offset: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1090, file: !1085, line: 161, baseType: !1095, size: 32, offset: 128)
!1095 = !DICompositeType(tag: DW_TAG_array_type, baseType: !379, size: 32, elements: !1096)
!1096 = !{!1097}
!1097 = !DISubrange(count: 4)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1084, file: !1085, line: 168, baseType: !378, size: 64, offset: 128)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1084, file: !1085, line: 169, baseType: !378, size: 64, offset: 192)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1084, file: !1085, line: 170, baseType: !378, size: 64, offset: 256)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1084, file: !1085, line: 171, baseType: !441, size: 64, offset: 320)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1084, file: !1085, line: 172, baseType: !376, size: 32, offset: 384)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1084, file: !1085, line: 176, baseType: !1104, size: 64, offset: 448)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1105 = !DISubroutineType(types: !1106)
!1106 = !{!1089, !380, !441}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1084, file: !1085, line: 177, baseType: !1108, size: 64, offset: 512)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64)
!1109 = !DISubroutineType(types: !1110)
!1110 = !{null, !380, !1089}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1084, file: !1085, line: 178, baseType: !380, size: 64, offset: 576)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1084, file: !1085, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1084, file: !1085, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1084, file: !1085, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !968, file: !593, line: 60, baseType: !1047, size: 128, offset: 384)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !968, file: !593, line: 64, baseType: !1117, size: 64, offset: 512)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1119, line: 33, flags: DIFlagFwdDecl)
!1119 = !DIFile(filename: "./pointer-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !968, file: !593, line: 67, baseType: !385, size: 64, offset: 576)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !968, file: !593, line: 73, baseType: !971, size: 64, offset: 640)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !968, file: !593, line: 77, baseType: !1057, size: 64, offset: 704)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !968, file: !593, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !968, file: !593, line: 82, baseType: !1125, size: 320, offset: 832)
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !721, line: 62, size: 320, elements: !1126)
!1126 = !{!1127, !1133, !1134, !1135, !1136, !1137}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1125, file: !721, line: 63, baseType: !1128, size: 64)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !721, line: 56, size: 128, elements: !1130)
!1130 = !{!1131, !1132}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1129, file: !721, line: 57, baseType: !1128, size: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1129, file: !721, line: 58, baseType: !479, size: 8, offset: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1125, file: !721, line: 64, baseType: !7, size: 32, offset: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1125, file: !721, line: 66, baseType: !7, size: 32, offset: 96)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1125, file: !721, line: 68, baseType: !375, size: 8, offset: 128)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1125, file: !721, line: 70, baseType: !719, size: 64, offset: 192)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1125, file: !721, line: 71, baseType: !727, size: 64, offset: 256)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !642, file: !643, line: 476, baseType: !1139, size: 64, offset: 256)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64)
!1140 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !643, line: 476, flags: DIFlagFwdDecl)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !642, file: !643, line: 479, baseType: !971, size: 64, offset: 320)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !642, file: !643, line: 484, baseType: !385, size: 64, offset: 384)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !642, file: !643, line: 488, baseType: !385, size: 64, offset: 448)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !642, file: !643, line: 493, baseType: !385, size: 64, offset: 512)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !642, file: !643, line: 496, baseType: !385, size: 64, offset: 576)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !642, file: !643, line: 501, baseType: !1147, size: 64, offset: 640)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64)
!1148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !18, line: 2355, size: 576, elements: !1149)
!1149 = !{!1150, !1153, !1154, !1155, !1156, !1158, !1159, !1164, !1165, !1166, !1167, !1168, !1169}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1148, file: !18, line: 2356, baseType: !1151, size: 64)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64)
!1152 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !18, line: 2356, flags: DIFlagFwdDecl)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1148, file: !18, line: 2357, baseType: !381, size: 64, offset: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1148, file: !18, line: 2358, baseType: !376, size: 32, offset: 128)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1148, file: !18, line: 2359, baseType: !376, size: 32, offset: 160)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1148, file: !18, line: 2360, baseType: !1157, size: 128, offset: 192)
!1157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !376, size: 128, elements: !1096)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1148, file: !18, line: 2364, baseType: !376, size: 32, offset: 320)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1148, file: !18, line: 2367, baseType: !1160, size: 128, offset: 384)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !18, line: 2349, size: 128, elements: !1161)
!1161 = !{!1162, !1163}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1160, file: !18, line: 2351, baseType: !554, size: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1160, file: !18, line: 2352, baseType: !441, size: 64, offset: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1148, file: !18, line: 2371, baseType: !17, size: 32, offset: 512)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1148, file: !18, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1148, file: !18, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1148, file: !18, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1148, file: !18, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1148, file: !18, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !642, file: !643, line: 504, baseType: !1171, size: 64, offset: 704)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !643, line: 504, flags: DIFlagFwdDecl)
