; ModuleID = 'gimple-iterator.bc'
source_filename = "gimple-iterator.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }

!278 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!279 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_code", file: !248, line: 51, baseType: !5, size: 32, elements: !280)
!280 = !{!281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316}
!281 = !DIEnumerator(name: "GIMPLE_ERROR_MARK", value: 0, isUnsigned: true)
!282 = !DIEnumerator(name: "GIMPLE_COND", value: 1, isUnsigned: true)
!283 = !DIEnumerator(name: "GIMPLE_DEBUG", value: 2, isUnsigned: true)
!284 = !DIEnumerator(name: "GIMPLE_GOTO", value: 3, isUnsigned: true)
!285 = !DIEnumerator(name: "GIMPLE_LABEL", value: 4, isUnsigned: true)
!286 = !DIEnumerator(name: "GIMPLE_SWITCH", value: 5, isUnsigned: true)
!287 = !DIEnumerator(name: "GIMPLE_ASSIGN", value: 6, isUnsigned: true)
!288 = !DIEnumerator(name: "GIMPLE_ASM", value: 7, isUnsigned: true)
!289 = !DIEnumerator(name: "GIMPLE_CALL", value: 8, isUnsigned: true)
!290 = !DIEnumerator(name: "GIMPLE_RETURN", value: 9, isUnsigned: true)
!291 = !DIEnumerator(name: "GIMPLE_BIND", value: 10, isUnsigned: true)
!292 = !DIEnumerator(name: "GIMPLE_CATCH", value: 11, isUnsigned: true)
!293 = !DIEnumerator(name: "GIMPLE_EH_FILTER", value: 12, isUnsigned: true)
!294 = !DIEnumerator(name: "GIMPLE_EH_MUST_NOT_THROW", value: 13, isUnsigned: true)
!295 = !DIEnumerator(name: "GIMPLE_RESX", value: 14, isUnsigned: true)
!296 = !DIEnumerator(name: "GIMPLE_EH_DISPATCH", value: 15, isUnsigned: true)
!297 = !DIEnumerator(name: "GIMPLE_PHI", value: 16, isUnsigned: true)
!298 = !DIEnumerator(name: "GIMPLE_TRY", value: 17, isUnsigned: true)
!299 = !DIEnumerator(name: "GIMPLE_NOP", value: 18, isUnsigned: true)
!300 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!301 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!302 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!303 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!304 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!305 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!306 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!307 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!308 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!309 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!310 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!311 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!312 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!313 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!314 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!315 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!316 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!317 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ssa_op_iter_type", file: !318, line: 119, baseType: !5, size: 32, elements: !319)
!318 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!319 = !{!320, !321, !322, !323}
!320 = !DIEnumerator(name: "ssa_op_iter_none", value: 0, isUnsigned: true)
!321 = !DIEnumerator(name: "ssa_op_iter_tree", value: 1, isUnsigned: true)
!322 = !DIEnumerator(name: "ssa_op_iter_use", value: 2, isUnsigned: true)
!323 = !DIEnumerator(name: "ssa_op_iter_def", value: 3, isUnsigned: true)
!324 = !{!325, !326, !327, !328, !331, !332, !334, !403, !340, !1507, !861, !329, !1509}
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!327 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !330)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !248, line: 136, size: 192, elements: !336)
!336 = !{!337, !1505, !1506}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !335, file: !248, line: 137, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !339, line: 58, baseType: !340)
!339 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !248, line: 737, size: 768, elements: !342)
!342 = !{!343, !1352, !1362, !1368, !1373, !1378, !1385, !1391, !1397, !1402, !1416, !1421, !1427, !1432, !1442, !1447, !1463, !1470, !1477, !1483, !1488, !1494, !1500}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !341, file: !248, line: 738, baseType: !344, size: 256)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !248, line: 271, size: 256, elements: !345)
!345 = !{!346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !361, !362, !1351}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !344, file: !248, line: 274, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !344, file: !248, line: 277, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !344, file: !248, line: 281, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !344, file: !248, line: 284, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !344, file: !248, line: 291, baseType: !5, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !344, file: !248, line: 295, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !344, file: !248, line: 298, baseType: !5, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !344, file: !248, line: 301, baseType: !5, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !344, file: !248, line: 307, baseType: !5, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !344, file: !248, line: 312, baseType: !5, size: 32, offset: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !344, file: !248, line: 316, baseType: !357, size: 32, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !358, line: 58, baseType: !359)
!358 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !360, line: 44, baseType: !5)
!360 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!361 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !344, file: !248, line: 319, baseType: !5, size: 32, offset: 96)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !344, file: !248, line: 323, baseType: !363, size: 64, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !4, line: 217, size: 832, elements: !365)
!365 = !{!366, !1316, !1317, !1318, !1321, !1325, !1326, !1327, !1345, !1346, !1347, !1348, !1349, !1350}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !364, file: !4, line: 219, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !4, line: 151, baseType: !369)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !4, line: 151, size: 128, elements: !370)
!370 = !{!371}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !369, file: !4, line: 151, baseType: !372, size: 128)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !4, line: 150, baseType: !373)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !4, line: 150, size: 128, elements: !374)
!374 = !{!375, !376, !377}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !373, file: !4, line: 150, baseType: !5, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !373, file: !4, line: 150, baseType: !5, size: 32, offset: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !373, file: !4, line: 150, baseType: !378, size: 64, offset: 64)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !379, size: 64, elements: !485)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !339, line: 108, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !4, line: 122, size: 512, elements: !382)
!382 = !{!383, !384, !385, !401, !402, !1310, !1311, !1312, !1313, !1314}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !381, file: !4, line: 124, baseType: !363, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !381, file: !4, line: 125, baseType: !363, size: 64, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !381, file: !4, line: 131, baseType: !386, size: 64, offset: 128)
!386 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !4, line: 128, size: 64, elements: !387)
!387 = !{!388, !397}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !386, file: !4, line: 129, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !339, line: 66, baseType: !390)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !248, line: 143, size: 192, elements: !392)
!392 = !{!393, !395, !396}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !391, file: !248, line: 145, baseType: !394, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !339, line: 69, baseType: !334)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !391, file: !248, line: 146, baseType: !394, size: 64, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !391, file: !248, line: 152, baseType: !389, size: 64, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !386, file: !4, line: 130, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !339, line: 50, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !339, line: 49, flags: DIFlagFwdDecl)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !381, file: !4, line: 134, baseType: !331, size: 64, offset: 192)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !381, file: !4, line: 137, baseType: !403, size: 64, offset: 256)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !339, line: 56, baseType: !404)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !21, line: 3371, size: 1792, elements: !406)
!406 = !{!407, !440, !446, !459, !466, !473, !478, !487, !493, !506, !514, !552, !557, !585, !602, !603, !608, !617, !623, !628, !632, !636, !959, !1008, !1014, !1020, !1027, !1040, !1054, !1071, !1083, !1105, !1120, !1292}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !405, file: !21, line: 3372, baseType: !408, size: 64)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !21, line: 360, size: 64, elements: !409)
!409 = !{!410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !408, file: !21, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !408, file: !21, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !408, file: !21, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !408, file: !21, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !408, file: !21, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !408, file: !21, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !408, file: !21, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !408, file: !21, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !408, file: !21, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !408, file: !21, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !408, file: !21, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !408, file: !21, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !408, file: !21, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !408, file: !21, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !408, file: !21, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !408, file: !21, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !408, file: !21, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !408, file: !21, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !408, file: !21, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !408, file: !21, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !408, file: !21, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !408, file: !21, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !408, file: !21, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !408, file: !21, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !408, file: !21, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !408, file: !21, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !408, file: !21, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !408, file: !21, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !408, file: !21, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !408, file: !21, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !405, file: !21, line: 3373, baseType: !441, size: 192)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !21, line: 402, size: 192, elements: !442)
!442 = !{!443, !444, !445}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !441, file: !21, line: 403, baseType: !408, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !441, file: !21, line: 404, baseType: !403, size: 64, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !441, file: !21, line: 405, baseType: !403, size: 64, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !405, file: !21, line: 3374, baseType: !447, size: 320)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !21, line: 1384, size: 320, elements: !448)
!448 = !{!449, !450}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !447, file: !21, line: 1385, baseType: !441, size: 192)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !447, file: !21, line: 1386, baseType: !451, size: 128, offset: 192)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !452, line: 58, baseType: !453)
!452 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !452, line: 54, size: 128, elements: !454)
!454 = !{!455, !457}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !453, file: !452, line: 56, baseType: !456, size: 64)
!456 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !453, file: !452, line: 57, baseType: !458, size: 64, offset: 64)
!458 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !405, file: !21, line: 3375, baseType: !460, size: 256)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !21, line: 1397, size: 256, elements: !461)
!461 = !{!462, !463}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !460, file: !21, line: 1398, baseType: !441, size: 192)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !460, file: !21, line: 1399, baseType: !464, size: 64, offset: 192)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !21, line: 1392, flags: DIFlagFwdDecl)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !405, file: !21, line: 3376, baseType: !467, size: 256)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !21, line: 1408, size: 256, elements: !468)
!468 = !{!469, !470}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !467, file: !21, line: 1409, baseType: !441, size: 192)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !467, file: !21, line: 1410, baseType: !471, size: 64, offset: 192)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !21, line: 1403, flags: DIFlagFwdDecl)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !405, file: !21, line: 3377, baseType: !474, size: 256)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !21, line: 1437, size: 256, elements: !475)
!475 = !{!476, !477}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !474, file: !21, line: 1438, baseType: !441, size: 192)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !474, file: !21, line: 1439, baseType: !403, size: 64, offset: 192)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !405, file: !21, line: 3378, baseType: !479, size: 256)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !21, line: 1418, size: 256, elements: !480)
!480 = !{!481, !482, !483}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !479, file: !21, line: 1419, baseType: !441, size: 192)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !479, file: !21, line: 1420, baseType: !327, size: 32, offset: 192)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !479, file: !21, line: 1421, baseType: !484, size: 8, offset: 224)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 8, elements: !485)
!485 = !{!486}
!486 = !DISubrange(count: 1)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !405, file: !21, line: 3379, baseType: !488, size: 320)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !21, line: 1428, size: 320, elements: !489)
!489 = !{!490, !491, !492}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !488, file: !21, line: 1429, baseType: !441, size: 192)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !488, file: !21, line: 1430, baseType: !403, size: 64, offset: 192)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !488, file: !21, line: 1431, baseType: !403, size: 64, offset: 256)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !405, file: !21, line: 3380, baseType: !494, size: 320)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !21, line: 1460, size: 320, elements: !495)
!495 = !{!496, !497}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !494, file: !21, line: 1461, baseType: !441, size: 192)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !494, file: !21, line: 1462, baseType: !498, size: 128, offset: 192)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !499, line: 31, size: 128, elements: !500)
!499 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!500 = !{!501, !504, !505}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !498, file: !499, line: 32, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !326)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !498, file: !499, line: 33, baseType: !5, size: 32, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !498, file: !499, line: 34, baseType: !5, size: 32, offset: 96)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !405, file: !21, line: 3381, baseType: !507, size: 384)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !21, line: 2507, size: 384, elements: !508)
!508 = !{!509, !510, !511, !512, !513}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !507, file: !21, line: 2508, baseType: !441, size: 192)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !507, file: !21, line: 2509, baseType: !357, size: 32, offset: 192)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !507, file: !21, line: 2510, baseType: !5, size: 32, offset: 224)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !507, file: !21, line: 2511, baseType: !403, size: 64, offset: 256)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !507, file: !21, line: 2512, baseType: !403, size: 64, offset: 320)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !405, file: !21, line: 3382, baseType: !515, size: 896)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !21, line: 2652, size: 896, elements: !516)
!516 = !{!517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !515, file: !21, line: 2653, baseType: !507, size: 384)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !515, file: !21, line: 2654, baseType: !403, size: 64, offset: 384)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !515, file: !21, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !515, file: !21, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !515, file: !21, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !515, file: !21, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !515, file: !21, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !515, file: !21, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !515, file: !21, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !515, file: !21, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !515, file: !21, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !515, file: !21, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !515, file: !21, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !515, file: !21, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !515, file: !21, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !515, file: !21, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !515, file: !21, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !515, file: !21, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !515, file: !21, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !515, file: !21, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !515, file: !21, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !515, file: !21, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !515, file: !21, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !515, file: !21, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !515, file: !21, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !515, file: !21, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !515, file: !21, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !515, file: !21, line: 2703, baseType: !5, size: 32, offset: 512)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !515, file: !21, line: 2705, baseType: !403, size: 64, offset: 576)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !515, file: !21, line: 2706, baseType: !403, size: 64, offset: 640)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !515, file: !21, line: 2707, baseType: !403, size: 64, offset: 704)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !515, file: !21, line: 2708, baseType: !403, size: 64, offset: 768)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !515, file: !21, line: 2711, baseType: !550, size: 64, offset: 832)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !21, line: 2711, flags: DIFlagFwdDecl)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !405, file: !21, line: 3383, baseType: !553, size: 960)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !21, line: 2756, size: 960, elements: !554)
!554 = !{!555, !556}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !553, file: !21, line: 2757, baseType: !515, size: 896)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !553, file: !21, line: 2758, baseType: !398, size: 64, offset: 896)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !405, file: !21, line: 3384, baseType: !558, size: 1472)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !21, line: 3114, size: 1472, elements: !559)
!559 = !{!560, !581, !582, !583, !584}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !558, file: !21, line: 3115, baseType: !561, size: 1216)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !21, line: 2984, size: 1216, elements: !562)
!562 = !{!563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !561, file: !21, line: 2985, baseType: !553, size: 960)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !561, file: !21, line: 2986, baseType: !403, size: 64, offset: 960)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !561, file: !21, line: 2987, baseType: !403, size: 64, offset: 1024)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !561, file: !21, line: 2988, baseType: !403, size: 64, offset: 1088)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !561, file: !21, line: 2991, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !561, file: !21, line: 2992, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !561, file: !21, line: 2993, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !561, file: !21, line: 2994, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !561, file: !21, line: 2995, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !561, file: !21, line: 2996, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !561, file: !21, line: 2998, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !561, file: !21, line: 3000, baseType: !5, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !561, file: !21, line: 3002, baseType: !5, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !561, file: !21, line: 3003, baseType: !5, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !561, file: !21, line: 3004, baseType: !5, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !561, file: !21, line: 3005, baseType: !5, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !561, file: !21, line: 3007, baseType: !5, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !561, file: !21, line: 3010, baseType: !5, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !558, file: !21, line: 3117, baseType: !403, size: 64, offset: 1216)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !558, file: !21, line: 3119, baseType: !403, size: 64, offset: 1280)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !558, file: !21, line: 3121, baseType: !403, size: 64, offset: 1344)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !558, file: !21, line: 3123, baseType: !403, size: 64, offset: 1408)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !405, file: !21, line: 3385, baseType: !586, size: 1088)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !21, line: 2874, size: 1088, elements: !587)
!587 = !{!588, !589, !590}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !586, file: !21, line: 2875, baseType: !553, size: 960)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !586, file: !21, line: 2876, baseType: !398, size: 64, offset: 960)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !586, file: !21, line: 2877, baseType: !591, size: 64, offset: 1024)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !593, line: 172, size: 128, elements: !594)
!593 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!594 = !{!595, !596, !597, !598, !599, !600, !601}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !592, file: !593, line: 174, baseType: !5, size: 1, flags: DIFlagBitField, extraData: i64 0)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !592, file: !593, line: 178, baseType: !5, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !592, file: !593, line: 183, baseType: !5, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !592, file: !593, line: 187, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !592, file: !593, line: 192, baseType: !5, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !592, file: !593, line: 195, baseType: !5, size: 32, offset: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !592, file: !593, line: 199, baseType: !403, size: 64, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !405, file: !21, line: 3386, baseType: !561, size: 1216)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !405, file: !21, line: 3387, baseType: !604, size: 1280)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !21, line: 3093, size: 1280, elements: !605)
!605 = !{!606, !607}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !604, file: !21, line: 3094, baseType: !561, size: 1216)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !604, file: !21, line: 3095, baseType: !591, size: 64, offset: 1216)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !405, file: !21, line: 3388, baseType: !609, size: 1216)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !21, line: 2824, size: 1216, elements: !610)
!610 = !{!611, !612, !613, !614, !615, !616}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !609, file: !21, line: 2825, baseType: !515, size: 896)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !609, file: !21, line: 2827, baseType: !403, size: 64, offset: 896)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !609, file: !21, line: 2828, baseType: !403, size: 64, offset: 960)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !609, file: !21, line: 2829, baseType: !403, size: 64, offset: 1024)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !609, file: !21, line: 2830, baseType: !403, size: 64, offset: 1088)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !609, file: !21, line: 2831, baseType: !403, size: 64, offset: 1152)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !405, file: !21, line: 3389, baseType: !618, size: 1024)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !21, line: 2850, size: 1024, elements: !619)
!619 = !{!620, !621, !622}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !618, file: !21, line: 2851, baseType: !553, size: 960)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !618, file: !21, line: 2852, baseType: !327, size: 32, offset: 960)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !618, file: !21, line: 2853, baseType: !327, size: 32, offset: 992)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !405, file: !21, line: 3390, baseType: !624, size: 1024)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !21, line: 2857, size: 1024, elements: !625)
!625 = !{!626, !627}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !624, file: !21, line: 2858, baseType: !553, size: 960)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !624, file: !21, line: 2859, baseType: !591, size: 64, offset: 960)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !405, file: !21, line: 3391, baseType: !629, size: 960)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !21, line: 2862, size: 960, elements: !630)
!630 = !{!631}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !629, file: !21, line: 2863, baseType: !553, size: 960)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !405, file: !21, line: 3392, baseType: !633, size: 1472)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !21, line: 3304, size: 1472, elements: !634)
!634 = !{!635}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !633, file: !21, line: 3305, baseType: !558, size: 1472)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !405, file: !21, line: 3393, baseType: !637, size: 1792)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !21, line: 3248, size: 1792, elements: !638)
!638 = !{!639, !640, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !637, file: !21, line: 3249, baseType: !558, size: 1472)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !637, file: !21, line: 3251, baseType: !641, size: 64, offset: 1472)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !643, line: 463, size: 1152, elements: !644)
!643 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!644 = !{!645, !648, !681, !682, !879, !882, !883, !884, !885, !886, !887, !911, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !642, file: !643, line: 464, baseType: !646, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !643, line: 464, flags: DIFlagFwdDecl)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !642, file: !643, line: 467, baseType: !649, size: 64, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !4, line: 374, size: 640, elements: !651)
!651 = !{!652, !654, !655, !668, !669, !670, !671, !672, !673, !677, !679, !680}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !650, file: !4, line: 377, baseType: !653, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !339, line: 111, baseType: !363)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !650, file: !4, line: 378, baseType: !653, size: 64, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !650, file: !4, line: 381, baseType: !656, size: 64, offset: 128)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !4, line: 282, baseType: !658)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !4, line: 282, size: 128, elements: !659)
!659 = !{!660}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !658, file: !4, line: 282, baseType: !661, size: 128)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !4, line: 281, baseType: !662)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !4, line: 281, size: 128, elements: !663)
!663 = !{!664, !665, !666}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !662, file: !4, line: 281, baseType: !5, size: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !662, file: !4, line: 281, baseType: !5, size: 32, offset: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !662, file: !4, line: 281, baseType: !667, size: 64, offset: 64)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !653, size: 64, elements: !485)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !650, file: !4, line: 384, baseType: !327, size: 32, offset: 192)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !650, file: !4, line: 387, baseType: !327, size: 32, offset: 224)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !650, file: !4, line: 390, baseType: !327, size: 32, offset: 256)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !650, file: !4, line: 394, baseType: !656, size: 64, offset: 320)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !650, file: !4, line: 396, baseType: !3, size: 32, offset: 384)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !650, file: !4, line: 399, baseType: !674, size: 64, offset: 416)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 64, elements: !675)
!675 = !{!676}
!676 = !DISubrange(count: 2)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !650, file: !4, line: 402, baseType: !678, size: 64, offset: 480)
!678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !675)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !650, file: !4, line: 406, baseType: !327, size: 32, offset: 544)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !650, file: !4, line: 409, baseType: !327, size: 32, offset: 576)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !642, file: !643, line: 470, baseType: !390, size: 64, offset: 128)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !642, file: !643, line: 473, baseType: !683, size: 64, offset: 192)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !593, line: 39, size: 1152, elements: !685)
!685 = !{!686, !738, !751, !764, !765, !834, !835, !839, !840, !841, !842, !843}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !684, file: !593, line: 41, baseType: !687, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !688, line: 144, baseType: !689)
!688 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !688, line: 100, size: 896, elements: !691)
!691 = !{!692, !700, !705, !710, !712, !715, !716, !717, !718, !719, !724, !726, !727, !732, !737}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !690, file: !688, line: 102, baseType: !693, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !688, line: 52, baseType: !694)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DISubroutineType(types: !696)
!696 = !{!697, !698}
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !688, line: 47, baseType: !5)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !690, file: !688, line: 105, baseType: !701, size: 64, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !688, line: 59, baseType: !702)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DISubroutineType(types: !704)
!704 = !{!327, !698, !698}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !690, file: !688, line: 108, baseType: !706, size: 64, offset: 128)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !688, line: 63, baseType: !707)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DISubroutineType(types: !709)
!709 = !{null, !331}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !690, file: !688, line: 111, baseType: !711, size: 64, offset: 192)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !690, file: !688, line: 114, baseType: !713, size: 64, offset: 256)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !714, line: 46, baseType: !456)
!714 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!715 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !690, file: !688, line: 117, baseType: !713, size: 64, offset: 320)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !690, file: !688, line: 120, baseType: !713, size: 64, offset: 384)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !690, file: !688, line: 124, baseType: !5, size: 32, offset: 448)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !690, file: !688, line: 128, baseType: !5, size: 32, offset: 480)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !690, file: !688, line: 131, baseType: !720, size: 64, offset: 512)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !688, line: 75, baseType: !721)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DISubroutineType(types: !723)
!723 = !{!331, !713, !713}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !690, file: !688, line: 132, baseType: !725, size: 64, offset: 576)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !688, line: 78, baseType: !707)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !690, file: !688, line: 135, baseType: !331, size: 64, offset: 640)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !690, file: !688, line: 136, baseType: !728, size: 64, offset: 704)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !688, line: 82, baseType: !729)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{!331, !331, !713, !713}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !690, file: !688, line: 137, baseType: !733, size: 64, offset: 768)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !688, line: 83, baseType: !734)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{null, !331, !331}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !690, file: !688, line: 141, baseType: !5, size: 32, offset: 832)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !684, file: !593, line: 48, baseType: !739, size: 64, offset: 64)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !248, line: 35, baseType: !741)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !248, line: 35, size: 128, elements: !742)
!742 = !{!743}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !741, file: !248, line: 35, baseType: !744, size: 128)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !248, line: 33, baseType: !745)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !248, line: 33, size: 128, elements: !746)
!746 = !{!747, !748, !749}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !745, file: !248, line: 33, baseType: !5, size: 32)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !745, file: !248, line: 33, baseType: !5, size: 32, offset: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !745, file: !248, line: 33, baseType: !750, size: 64, offset: 64)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !338, size: 64, elements: !485)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !684, file: !593, line: 51, baseType: !752, size: 64, offset: 128)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !21, line: 183, baseType: !754)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !21, line: 183, size: 128, elements: !755)
!755 = !{!756}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !754, file: !21, line: 183, baseType: !757, size: 128)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !21, line: 182, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !21, line: 182, size: 128, elements: !759)
!759 = !{!760, !761, !762}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !758, file: !21, line: 182, baseType: !5, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !758, file: !21, line: 182, baseType: !5, size: 32, offset: 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !758, file: !21, line: 182, baseType: !763, size: 64, offset: 64)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !403, size: 64, elements: !485)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !684, file: !593, line: 54, baseType: !403, size: 64, offset: 192)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !684, file: !593, line: 57, baseType: !766, size: 128, offset: 256)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !767, line: 31, size: 128, elements: !768)
!767 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!768 = !{!769, !770, !771, !772, !773, !774, !775}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !766, file: !767, line: 35, baseType: !5, size: 1, flags: DIFlagBitField, extraData: i64 0)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !766, file: !767, line: 39, baseType: !5, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !766, file: !767, line: 42, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !766, file: !767, line: 46, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !766, file: !767, line: 50, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !766, file: !767, line: 53, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !766, file: !767, line: 56, baseType: !776, size: 64, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !339, line: 47, baseType: !777)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !779, line: 75, size: 256, elements: !780)
!779 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!780 = !{!781, !793, !794, !795}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !778, file: !779, line: 76, baseType: !782, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !779, line: 68, baseType: !784)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !779, line: 63, size: 320, elements: !785)
!785 = !{!786, !788, !789, !790}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !784, file: !779, line: 64, baseType: !787, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !784, file: !779, line: 65, baseType: !787, size: 64, offset: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !784, file: !779, line: 66, baseType: !5, size: 32, offset: 128)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !784, file: !779, line: 67, baseType: !791, size: 128, offset: 192)
!791 = !DICompositeType(tag: DW_TAG_array_type, baseType: !792, size: 128, elements: !675)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !779, line: 29, baseType: !456)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !778, file: !779, line: 77, baseType: !782, size: 64, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !778, file: !779, line: 78, baseType: !5, size: 32, offset: 128)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !778, file: !779, line: 79, baseType: !796, size: 64, offset: 192)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !779, line: 49, baseType: !798)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !779, line: 45, size: 832, elements: !799)
!799 = !{!800, !801, !802}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !798, file: !779, line: 46, baseType: !787, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !798, file: !779, line: 47, baseType: !777, size: 64, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !798, file: !779, line: 48, baseType: !803, size: 704, offset: 128)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !804, line: 164, size: 704, elements: !805)
!804 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!805 = !{!806, !807, !817, !818, !819, !820, !821, !822, !826, !830, !831, !832, !833}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !803, file: !804, line: 166, baseType: !458, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !803, file: !804, line: 167, baseType: !808, size: 64, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !804, line: 157, size: 192, elements: !810)
!810 = !{!811, !812, !813}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !809, file: !804, line: 159, baseType: !329, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !809, file: !804, line: 160, baseType: !808, size: 64, offset: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !809, file: !804, line: 161, baseType: !814, size: 32, offset: 128)
!814 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 32, elements: !815)
!815 = !{!816}
!816 = !DISubrange(count: 4)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !803, file: !804, line: 168, baseType: !329, size: 64, offset: 128)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !803, file: !804, line: 169, baseType: !329, size: 64, offset: 192)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !803, file: !804, line: 170, baseType: !329, size: 64, offset: 256)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !803, file: !804, line: 171, baseType: !458, size: 64, offset: 320)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !803, file: !804, line: 172, baseType: !327, size: 32, offset: 384)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !803, file: !804, line: 176, baseType: !823, size: 64, offset: 448)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DISubroutineType(types: !825)
!825 = !{!808, !331, !458}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !803, file: !804, line: 177, baseType: !827, size: 64, offset: 512)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DISubroutineType(types: !829)
!829 = !{null, !331, !808}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !803, file: !804, line: 178, baseType: !331, size: 64, offset: 576)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !803, file: !804, line: 179, baseType: !5, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !803, file: !804, line: 180, baseType: !5, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !803, file: !804, line: 184, baseType: !5, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !684, file: !593, line: 60, baseType: !766, size: 128, offset: 384)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !684, file: !593, line: 64, baseType: !836, size: 64, offset: 512)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !838, line: 33, flags: DIFlagFwdDecl)
!838 = !DIFile(filename: "./pointer-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!839 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !684, file: !593, line: 67, baseType: !403, size: 64, offset: 576)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !684, file: !593, line: 73, baseType: !687, size: 64, offset: 640)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !684, file: !593, line: 77, baseType: !776, size: 64, offset: 704)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !684, file: !593, line: 80, baseType: !5, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !684, file: !593, line: 82, baseType: !844, size: 320, offset: 832)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !318, line: 62, size: 320, elements: !845)
!845 = !{!846, !852, !853, !854, !855, !862}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !844, file: !318, line: 63, baseType: !847, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !318, line: 56, size: 128, elements: !849)
!849 = !{!850, !851}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !848, file: !318, line: 57, baseType: !847, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !848, file: !318, line: 58, baseType: !484, size: 8, offset: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !844, file: !318, line: 64, baseType: !5, size: 32, offset: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !844, file: !318, line: 66, baseType: !5, size: 32, offset: 96)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !844, file: !318, line: 68, baseType: !326, size: 8, offset: 128)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !844, file: !318, line: 70, baseType: !856, size: 64, offset: 192)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !318, line: 37, size: 128, elements: !858)
!858 = !{!859, !860}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !857, file: !318, line: 39, baseType: !856, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !857, file: !318, line: 40, baseType: !861, size: 64, offset: 64)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !844, file: !318, line: 71, baseType: !863, size: 64, offset: 256)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !318, line: 45, size: 320, elements: !865)
!865 = !{!866, !867}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !864, file: !318, line: 47, baseType: !863, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !864, file: !318, line: 48, baseType: !868, size: 256, offset: 64)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !21, line: 1883, size: 256, elements: !869)
!869 = !{!870, !872, !873, !878}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !868, file: !21, line: 1884, baseType: !871, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !868, file: !21, line: 1885, baseType: !871, size: 64, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !868, file: !21, line: 1891, baseType: !874, size: 64, offset: 128)
!874 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !868, file: !21, line: 1891, size: 64, elements: !875)
!875 = !{!876, !877}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !874, file: !21, line: 1891, baseType: !338, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !874, file: !21, line: 1891, baseType: !403, size: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !868, file: !21, line: 1892, baseType: !861, size: 64, offset: 192)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !642, file: !643, line: 476, baseType: !880, size: 64, offset: 256)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !643, line: 476, flags: DIFlagFwdDecl)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !642, file: !643, line: 479, baseType: !687, size: 64, offset: 320)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !642, file: !643, line: 484, baseType: !403, size: 64, offset: 384)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !642, file: !643, line: 488, baseType: !403, size: 64, offset: 448)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !642, file: !643, line: 493, baseType: !403, size: 64, offset: 512)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !642, file: !643, line: 496, baseType: !403, size: 64, offset: 576)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !642, file: !643, line: 501, baseType: !888, size: 64, offset: 640)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !16, line: 2355, size: 576, elements: !890)
!890 = !{!891, !894, !895, !896, !897, !899, !900, !905, !906, !907, !908, !909, !910}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !889, file: !16, line: 2356, baseType: !892, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !16, line: 2356, flags: DIFlagFwdDecl)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !889, file: !16, line: 2357, baseType: !332, size: 64, offset: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !889, file: !16, line: 2358, baseType: !327, size: 32, offset: 128)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !889, file: !16, line: 2359, baseType: !327, size: 32, offset: 160)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !889, file: !16, line: 2360, baseType: !898, size: 128, offset: 192)
!898 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 128, elements: !815)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !889, file: !16, line: 2364, baseType: !327, size: 32, offset: 320)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !889, file: !16, line: 2367, baseType: !901, size: 128, offset: 384)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !16, line: 2349, size: 128, elements: !902)
!902 = !{!903, !904}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !901, file: !16, line: 2351, baseType: !398, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !901, file: !16, line: 2352, baseType: !458, size: 64, offset: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !889, file: !16, line: 2371, baseType: !15, size: 32, offset: 512)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !889, file: !16, line: 2374, baseType: !5, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !889, file: !16, line: 2377, baseType: !5, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !889, file: !16, line: 2381, baseType: !5, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !889, file: !16, line: 2392, baseType: !5, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !889, file: !16, line: 2396, baseType: !5, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !642, file: !643, line: 504, baseType: !912, size: 64, offset: 704)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !643, line: 504, flags: DIFlagFwdDecl)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !642, file: !643, line: 507, baseType: !687, size: 64, offset: 768)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !642, file: !643, line: 510, baseType: !327, size: 32, offset: 832)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !642, file: !643, line: 513, baseType: !327, size: 32, offset: 864)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !642, file: !643, line: 516, baseType: !357, size: 32, offset: 896)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !642, file: !643, line: 519, baseType: !357, size: 32, offset: 928)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !642, file: !643, line: 522, baseType: !5, size: 32, offset: 960)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !642, file: !643, line: 523, baseType: !5, size: 32, offset: 992)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !642, file: !643, line: 528, baseType: !332, size: 64, offset: 1024)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !642, file: !643, line: 535, baseType: !5, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !642, file: !643, line: 539, baseType: !5, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !642, file: !643, line: 543, baseType: !5, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !642, file: !643, line: 546, baseType: !5, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !642, file: !643, line: 550, baseType: !5, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !642, file: !643, line: 554, baseType: !5, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !642, file: !643, line: 559, baseType: !5, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !642, file: !643, line: 562, baseType: !5, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !642, file: !643, line: 571, baseType: !5, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !642, file: !643, line: 573, baseType: !5, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !642, file: !643, line: 574, baseType: !5, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !642, file: !643, line: 581, baseType: !5, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !642, file: !643, line: 585, baseType: !5, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !642, file: !643, line: 588, baseType: !5, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !642, file: !643, line: 592, baseType: !5, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !642, file: !643, line: 598, baseType: !5, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !637, file: !21, line: 3254, baseType: !403, size: 64, offset: 1536)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !637, file: !21, line: 3257, baseType: !403, size: 64, offset: 1600)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !637, file: !21, line: 3258, baseType: !403, size: 64, offset: 1664)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !637, file: !21, line: 3264, baseType: !5, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !637, file: !21, line: 3265, baseType: !5, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !637, file: !21, line: 3267, baseType: !5, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !637, file: !21, line: 3268, baseType: !5, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !637, file: !21, line: 3269, baseType: !5, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !637, file: !21, line: 3271, baseType: !5, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !637, file: !21, line: 3272, baseType: !5, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !637, file: !21, line: 3273, baseType: !5, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !637, file: !21, line: 3274, baseType: !5, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !637, file: !21, line: 3275, baseType: !5, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !637, file: !21, line: 3276, baseType: !5, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !637, file: !21, line: 3277, baseType: !5, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !637, file: !21, line: 3279, baseType: !5, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !637, file: !21, line: 3280, baseType: !5, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !637, file: !21, line: 3281, baseType: !5, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !637, file: !21, line: 3282, baseType: !5, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !637, file: !21, line: 3283, baseType: !5, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !637, file: !21, line: 3284, baseType: !5, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !405, file: !21, line: 3394, baseType: !960, size: 1344)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !21, line: 2279, size: 1344, elements: !961)
!961 = !{!962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !987, !988, !989, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !960, file: !21, line: 2280, baseType: !441, size: 192)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !960, file: !21, line: 2281, baseType: !403, size: 64, offset: 192)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !960, file: !21, line: 2282, baseType: !403, size: 64, offset: 256)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !960, file: !21, line: 2283, baseType: !403, size: 64, offset: 320)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !960, file: !21, line: 2284, baseType: !403, size: 64, offset: 384)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !960, file: !21, line: 2285, baseType: !5, size: 32, offset: 448)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !960, file: !21, line: 2287, baseType: !5, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !960, file: !21, line: 2288, baseType: !5, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !960, file: !21, line: 2289, baseType: !5, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !960, file: !21, line: 2290, baseType: !5, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !960, file: !21, line: 2291, baseType: !5, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !960, file: !21, line: 2292, baseType: !5, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !960, file: !21, line: 2294, baseType: !5, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !960, file: !21, line: 2296, baseType: !5, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !960, file: !21, line: 2297, baseType: !5, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !960, file: !21, line: 2298, baseType: !5, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !960, file: !21, line: 2299, baseType: !5, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !960, file: !21, line: 2300, baseType: !5, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !960, file: !21, line: 2301, baseType: !5, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !960, file: !21, line: 2302, baseType: !5, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !960, file: !21, line: 2303, baseType: !5, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !960, file: !21, line: 2305, baseType: !5, size: 32, offset: 512)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !960, file: !21, line: 2306, baseType: !985, size: 32, offset: 544)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !986, line: 31, baseType: !327)
!986 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!987 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !960, file: !21, line: 2307, baseType: !403, size: 64, offset: 576)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !960, file: !21, line: 2308, baseType: !403, size: 64, offset: 640)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !960, file: !21, line: 2314, baseType: !990, size: 64, offset: 704)
!990 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !21, line: 2309, size: 64, elements: !991)
!991 = !{!992, !993, !994}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !990, file: !21, line: 2310, baseType: !327, size: 32)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !990, file: !21, line: 2311, baseType: !332, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !990, file: !21, line: 2312, baseType: !995, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !21, line: 2277, flags: DIFlagFwdDecl)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !960, file: !21, line: 2315, baseType: !403, size: 64, offset: 768)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !960, file: !21, line: 2316, baseType: !403, size: 64, offset: 832)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !960, file: !21, line: 2317, baseType: !403, size: 64, offset: 896)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !960, file: !21, line: 2318, baseType: !403, size: 64, offset: 960)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !960, file: !21, line: 2319, baseType: !403, size: 64, offset: 1024)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !960, file: !21, line: 2320, baseType: !403, size: 64, offset: 1088)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !960, file: !21, line: 2321, baseType: !403, size: 64, offset: 1152)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !960, file: !21, line: 2322, baseType: !403, size: 64, offset: 1216)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !960, file: !21, line: 2324, baseType: !1006, size: 64, offset: 1280)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !21, line: 2324, flags: DIFlagFwdDecl)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !405, file: !21, line: 3395, baseType: !1009, size: 320)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !21, line: 1469, size: 320, elements: !1010)
!1010 = !{!1011, !1012, !1013}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1009, file: !21, line: 1470, baseType: !441, size: 192)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1009, file: !21, line: 1471, baseType: !403, size: 64, offset: 192)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1009, file: !21, line: 1472, baseType: !403, size: 64, offset: 256)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !405, file: !21, line: 3396, baseType: !1015, size: 320)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !21, line: 1482, size: 320, elements: !1016)
!1016 = !{!1017, !1018, !1019}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1015, file: !21, line: 1483, baseType: !441, size: 192)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1015, file: !21, line: 1484, baseType: !327, size: 32, offset: 192)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1015, file: !21, line: 1485, baseType: !763, size: 64, offset: 256)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !405, file: !21, line: 3397, baseType: !1021, size: 384)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !21, line: 1829, size: 384, elements: !1022)
!1022 = !{!1023, !1024, !1025, !1026}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1021, file: !21, line: 1830, baseType: !441, size: 192)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1021, file: !21, line: 1831, baseType: !357, size: 32, offset: 192)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1021, file: !21, line: 1832, baseType: !403, size: 64, offset: 256)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1021, file: !21, line: 1835, baseType: !763, size: 64, offset: 320)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !405, file: !21, line: 3398, baseType: !1028, size: 704)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !21, line: 1898, size: 704, elements: !1029)
!1029 = !{!1030, !1031, !1032, !1033, !1034, !1039}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1028, file: !21, line: 1899, baseType: !441, size: 192)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1028, file: !21, line: 1902, baseType: !403, size: 64, offset: 192)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1028, file: !21, line: 1905, baseType: !338, size: 64, offset: 256)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1028, file: !21, line: 1908, baseType: !5, size: 32, offset: 320)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1028, file: !21, line: 1911, baseType: !1035, size: 64, offset: 384)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !593, line: 117, size: 128, elements: !1037)
!1037 = !{!1038}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "pt", scope: !1036, file: !593, line: 120, baseType: !766, size: 128)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1028, file: !21, line: 1914, baseType: !868, size: 256, offset: 448)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !405, file: !21, line: 3399, baseType: !1041, size: 704)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !21, line: 2008, size: 704, elements: !1042)
!1042 = !{!1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1041, file: !21, line: 2009, baseType: !441, size: 192)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1041, file: !21, line: 2011, baseType: !5, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !1041, file: !21, line: 2012, baseType: !5, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1041, file: !21, line: 2014, baseType: !357, size: 32, offset: 224)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1041, file: !21, line: 2016, baseType: !403, size: 64, offset: 256)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !1041, file: !21, line: 2017, baseType: !752, size: 64, offset: 320)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !1041, file: !21, line: 2019, baseType: !403, size: 64, offset: 384)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !1041, file: !21, line: 2020, baseType: !403, size: 64, offset: 448)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1041, file: !21, line: 2021, baseType: !403, size: 64, offset: 512)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !1041, file: !21, line: 2022, baseType: !403, size: 64, offset: 576)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !1041, file: !21, line: 2023, baseType: !403, size: 64, offset: 640)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !405, file: !21, line: 3400, baseType: !1055, size: 832)
!1055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !21, line: 2430, size: 832, elements: !1056)
!1056 = !{!1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1055, file: !21, line: 2431, baseType: !441, size: 192)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1055, file: !21, line: 2433, baseType: !403, size: 64, offset: 192)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !1055, file: !21, line: 2434, baseType: !403, size: 64, offset: 256)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !1055, file: !21, line: 2435, baseType: !403, size: 64, offset: 320)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !1055, file: !21, line: 2436, baseType: !403, size: 64, offset: 384)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "base_accesses", scope: !1055, file: !21, line: 2437, baseType: !752, size: 64, offset: 448)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "inheritance", scope: !1055, file: !21, line: 2438, baseType: !403, size: 64, offset: 512)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_subvtt", scope: !1055, file: !21, line: 2440, baseType: !403, size: 64, offset: 576)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_vptr", scope: !1055, file: !21, line: 2441, baseType: !403, size: 64, offset: 640)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "base_binfos", scope: !1055, file: !21, line: 2443, baseType: !1067, size: 128, offset: 704)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_none", file: !21, line: 182, baseType: !1068)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_none", file: !21, line: 182, size: 128, elements: !1069)
!1069 = !{!1070}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1068, file: !21, line: 182, baseType: !757, size: 128)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "stmt_list", scope: !405, file: !21, line: 3401, baseType: !1072, size: 320)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list", file: !21, line: 3327, size: 320, elements: !1073)
!1073 = !{!1074, !1075, !1082}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1072, file: !21, line: 3329, baseType: !441, size: 192)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1072, file: !21, line: 3330, baseType: !1076, size: 64, offset: 192)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list_node", file: !21, line: 3320, size: 192, elements: !1078)
!1078 = !{!1079, !1080, !1081}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1077, file: !21, line: 3322, baseType: !1076, size: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1077, file: !21, line: 3323, baseType: !1076, size: 64, offset: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1077, file: !21, line: 3324, baseType: !403, size: 64, offset: 128)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1072, file: !21, line: 3331, baseType: !1076, size: 64, offset: 256)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "constructor", scope: !405, file: !21, line: 3402, baseType: !1084, size: 256)
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_constructor", file: !21, line: 1540, size: 256, elements: !1085)
!1085 = !{!1086, !1087}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1084, file: !21, line: 1541, baseType: !441, size: 192)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !1084, file: !21, line: 1542, baseType: !1088, size: 64, offset: 192)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
