; ModuleID = 'gimple.bc'
source_filename = "gimple.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }
%struct.tree_decl_minimal = type { %struct.tree_common, i32, i32, %union.tree_node*, %union.tree_node* }
%struct.tree_common = type { %struct.tree_base, %union.tree_node*, %union.tree_node* }
%struct.tree_base = type { i64 }

!320 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_try_flags", file: !6, line: 514, baseType: !7, size: 32, elements: !321)
!321 = !{!322, !323, !324, !325}
!322 = !DIEnumerator(name: "GIMPLE_TRY_CATCH", value: 1, isUnsigned: true)
!323 = !DIEnumerator(name: "GIMPLE_TRY_FINALLY", value: 2, isUnsigned: true)
!324 = !DIEnumerator(name: "GIMPLE_TRY_KIND", value: 3, isUnsigned: true)
!325 = !DIEnumerator(name: "GIMPLE_TRY_CATCH_IS_CLEANUP", value: 4, isUnsigned: true)
!326 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "br_predictor", file: !327, line: 24, baseType: !7, size: 32, elements: !328)
!327 = !DIFile(filename: "./predict.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!328 = !{!329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357}
!329 = !DIEnumerator(name: "PRED_COMBINED", value: 0, isUnsigned: true)
!330 = !DIEnumerator(name: "PRED_DS_THEORY", value: 1, isUnsigned: true)
!331 = !DIEnumerator(name: "PRED_FIRST_MATCH", value: 2, isUnsigned: true)
!332 = !DIEnumerator(name: "PRED_NO_PREDICTION", value: 3, isUnsigned: true)
!333 = !DIEnumerator(name: "PRED_UNCONDITIONAL", value: 4, isUnsigned: true)
!334 = !DIEnumerator(name: "PRED_LOOP_ITERATIONS", value: 5, isUnsigned: true)
!335 = !DIEnumerator(name: "PRED_BUILTIN_EXPECT", value: 6, isUnsigned: true)
!336 = !DIEnumerator(name: "PRED_LOOP_ITERATIONS_GUESSED", value: 7, isUnsigned: true)
!337 = !DIEnumerator(name: "PRED_CONTINUE", value: 8, isUnsigned: true)
!338 = !DIEnumerator(name: "PRED_NORETURN", value: 9, isUnsigned: true)
!339 = !DIEnumerator(name: "PRED_COLD_FUNCTION", value: 10, isUnsigned: true)
!340 = !DIEnumerator(name: "PRED_LOOP_BRANCH", value: 11, isUnsigned: true)
!341 = !DIEnumerator(name: "PRED_LOOP_EXIT", value: 12, isUnsigned: true)
!342 = !DIEnumerator(name: "PRED_POINTER", value: 13, isUnsigned: true)
!343 = !DIEnumerator(name: "PRED_TREE_POINTER", value: 14, isUnsigned: true)
!344 = !DIEnumerator(name: "PRED_OPCODE_POSITIVE", value: 15, isUnsigned: true)
!345 = !DIEnumerator(name: "PRED_OPCODE_NONEQUAL", value: 16, isUnsigned: true)
!346 = !DIEnumerator(name: "PRED_FPOPCODE", value: 17, isUnsigned: true)
!347 = !DIEnumerator(name: "PRED_TREE_OPCODE_POSITIVE", value: 18, isUnsigned: true)
!348 = !DIEnumerator(name: "PRED_TREE_OPCODE_NONEQUAL", value: 19, isUnsigned: true)
!349 = !DIEnumerator(name: "PRED_TREE_FPOPCODE", value: 20, isUnsigned: true)
!350 = !DIEnumerator(name: "PRED_CALL", value: 21, isUnsigned: true)
!351 = !DIEnumerator(name: "PRED_TREE_EARLY_RETURN", value: 22, isUnsigned: true)
!352 = !DIEnumerator(name: "PRED_GOTO", value: 23, isUnsigned: true)
!353 = !DIEnumerator(name: "PRED_CONST_RETURN", value: 24, isUnsigned: true)
!354 = !DIEnumerator(name: "PRED_NEGATIVE_RETURN", value: 25, isUnsigned: true)
!355 = !DIEnumerator(name: "PRED_NULL_RETURN", value: 26, isUnsigned: true)
!356 = !DIEnumerator(name: "PRED_MUDFLAP", value: 27, isUnsigned: true)
!357 = !DIEnumerator(name: "END_PREDICTORS", value: 28, isUnsigned: true)
!358 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "prediction", file: !327, line: 32, baseType: !7, size: 32, elements: !359)
!359 = !{!360, !361}
!360 = !DIEnumerator(name: "NOT_TAKEN", value: 0, isUnsigned: true)
!361 = !DIEnumerator(name: "TAKEN", value: 1, isUnsigned: true)
!362 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ssa_op_iter_type", file: !363, line: 119, baseType: !7, size: 32, elements: !364)
!363 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!364 = !{!365, !366, !367, !368}
!365 = !DIEnumerator(name: "ssa_op_iter_none", value: 0, isUnsigned: true)
!366 = !DIEnumerator(name: "ssa_op_iter_tree", value: 1, isUnsigned: true)
!367 = !DIEnumerator(name: "ssa_op_iter_use", value: 2, isUnsigned: true)
!368 = !DIEnumerator(name: "ssa_op_iter_def", value: 3, isUnsigned: true)
!369 = !{!370, !371, !372, !373, !376, !377, !379, !82, !450, !7, !400, !1501, !430, !451, !1552, !503, !908, !505, !374, !1554, !1555, !314, !381, !1556, !703, !786, !1558, !1563, !744, !760, !1564, !754, !1567, !1574, !1576, !1582, !1584, !1603, !823}
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!372 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !375)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !380, line: 58, baseType: !381)
!380 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !6, line: 737, size: 768, elements: !383)
!383 = !{!384, !1399, !1409, !1415, !1420, !1425, !1432, !1438, !1444, !1449, !1463, !1468, !1474, !1479, !1489, !1494, !1510, !1517, !1524, !1530, !1535, !1541, !1547}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !382, file: !6, line: 738, baseType: !385, size: 256)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !6, line: 271, size: 256, elements: !386)
!386 = !{!387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !402, !403, !1398}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !385, file: !6, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !385, file: !6, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !385, file: !6, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !385, file: !6, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !385, file: !6, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !385, file: !6, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !385, file: !6, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !385, file: !6, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !385, file: !6, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !385, file: !6, line: 312, baseType: !7, size: 32, offset: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !385, file: !6, line: 316, baseType: !398, size: 32, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !399, line: 58, baseType: !400)
!399 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !401, line: 44, baseType: !7)
!401 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!402 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !385, file: !6, line: 319, baseType: !7, size: 32, offset: 96)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !385, file: !6, line: 323, baseType: !404, size: 64, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !34, line: 217, size: 832, elements: !406)
!406 = !{!407, !1363, !1364, !1365, !1368, !1372, !1373, !1374, !1392, !1393, !1394, !1395, !1396, !1397}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !405, file: !34, line: 219, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !34, line: 151, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !34, line: 151, size: 128, elements: !411)
!411 = !{!412}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !410, file: !34, line: 151, baseType: !413, size: 128)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !34, line: 150, baseType: !414)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !34, line: 150, size: 128, elements: !415)
!415 = !{!416, !417, !418}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !414, file: !34, line: 150, baseType: !7, size: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !414, file: !34, line: 150, baseType: !7, size: 32, offset: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !414, file: !34, line: 150, baseType: !419, size: 64, offset: 64)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !420, size: 64, elements: !532)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !380, line: 108, baseType: !421)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !34, line: 122, size: 512, elements: !423)
!423 = !{!424, !425, !426, !448, !449, !1357, !1358, !1359, !1360, !1361}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !422, file: !34, line: 124, baseType: !404, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !422, file: !34, line: 125, baseType: !404, size: 64, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !422, file: !34, line: 131, baseType: !427, size: 64, offset: 128)
!427 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !34, line: 128, size: 64, elements: !428)
!428 = !{!429, !444}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !427, file: !34, line: 129, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !380, line: 66, baseType: !431)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !6, line: 143, size: 192, elements: !433)
!433 = !{!434, !442, !443}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !432, file: !6, line: 145, baseType: !435, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !380, line: 69, baseType: !436)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !6, line: 136, size: 192, elements: !438)
!438 = !{!439, !440, !441}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !437, file: !6, line: 137, baseType: !379, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !437, file: !6, line: 138, baseType: !436, size: 64, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !437, file: !6, line: 139, baseType: !436, size: 64, offset: 128)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !432, file: !6, line: 146, baseType: !435, size: 64, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !432, file: !6, line: 152, baseType: !430, size: 64, offset: 128)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !427, file: !34, line: 130, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !380, line: 50, baseType: !446)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !380, line: 49, flags: DIFlagFwdDecl)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !422, file: !34, line: 134, baseType: !376, size: 64, offset: 192)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !422, file: !34, line: 137, baseType: !450, size: 64, offset: 256)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !380, line: 56, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !50, line: 3371, size: 1792, elements: !453)
!453 = !{!454, !487, !493, !506, !513, !520, !525, !534, !540, !553, !561, !599, !604, !632, !649, !650, !655, !664, !670, !675, !679, !683, !1006, !1055, !1061, !1067, !1074, !1087, !1101, !1118, !1130, !1152, !1167, !1339}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !452, file: !50, line: 3372, baseType: !455, size: 64)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !50, line: 360, size: 64, elements: !456)
!456 = !{!457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !455, file: !50, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !455, file: !50, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !455, file: !50, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !455, file: !50, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !455, file: !50, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !455, file: !50, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !455, file: !50, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !455, file: !50, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !455, file: !50, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !455, file: !50, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !455, file: !50, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !455, file: !50, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !455, file: !50, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !455, file: !50, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !455, file: !50, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !455, file: !50, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !455, file: !50, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !455, file: !50, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !455, file: !50, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !455, file: !50, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !455, file: !50, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !455, file: !50, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !455, file: !50, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !455, file: !50, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !455, file: !50, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !455, file: !50, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !455, file: !50, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !455, file: !50, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !455, file: !50, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !455, file: !50, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !452, file: !50, line: 3373, baseType: !488, size: 192)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !50, line: 402, size: 192, elements: !489)
!489 = !{!490, !491, !492}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !488, file: !50, line: 403, baseType: !455, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !488, file: !50, line: 404, baseType: !450, size: 64, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !488, file: !50, line: 405, baseType: !450, size: 64, offset: 128)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !452, file: !50, line: 3374, baseType: !494, size: 320)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !50, line: 1384, size: 320, elements: !495)
!495 = !{!496, !497}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !494, file: !50, line: 1385, baseType: !488, size: 192)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !494, file: !50, line: 1386, baseType: !498, size: 128, offset: 192)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !499, line: 58, baseType: !500)
!499 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !499, line: 54, size: 128, elements: !501)
!501 = !{!502, !504}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !500, file: !499, line: 56, baseType: !503, size: 64)
!503 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !500, file: !499, line: 57, baseType: !505, size: 64, offset: 64)
!505 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !452, file: !50, line: 3375, baseType: !507, size: 256)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !50, line: 1397, size: 256, elements: !508)
!508 = !{!509, !510}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !507, file: !50, line: 1398, baseType: !488, size: 192)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !507, file: !50, line: 1399, baseType: !511, size: 64, offset: 192)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !50, line: 1392, flags: DIFlagFwdDecl)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !452, file: !50, line: 3376, baseType: !514, size: 256)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !50, line: 1408, size: 256, elements: !515)
!515 = !{!516, !517}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !514, file: !50, line: 1409, baseType: !488, size: 192)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !514, file: !50, line: 1410, baseType: !518, size: 64, offset: 192)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !50, line: 1403, flags: DIFlagFwdDecl)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !452, file: !50, line: 3377, baseType: !521, size: 256)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !50, line: 1437, size: 256, elements: !522)
!522 = !{!523, !524}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !521, file: !50, line: 1438, baseType: !488, size: 192)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !521, file: !50, line: 1439, baseType: !450, size: 64, offset: 192)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !452, file: !50, line: 3378, baseType: !526, size: 256)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !50, line: 1418, size: 256, elements: !527)
!527 = !{!528, !529, !530}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !526, file: !50, line: 1419, baseType: !488, size: 192)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !526, file: !50, line: 1420, baseType: !372, size: 32, offset: 192)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !526, file: !50, line: 1421, baseType: !531, size: 8, offset: 224)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !375, size: 8, elements: !532)
!532 = !{!533}
!533 = !DISubrange(count: 1)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !452, file: !50, line: 3379, baseType: !535, size: 320)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !50, line: 1428, size: 320, elements: !536)
!536 = !{!537, !538, !539}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !535, file: !50, line: 1429, baseType: !488, size: 192)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !535, file: !50, line: 1430, baseType: !450, size: 64, offset: 192)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !535, file: !50, line: 1431, baseType: !450, size: 64, offset: 256)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !452, file: !50, line: 3380, baseType: !541, size: 320)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !50, line: 1460, size: 320, elements: !542)
!542 = !{!543, !544}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !541, file: !50, line: 1461, baseType: !488, size: 192)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !541, file: !50, line: 1462, baseType: !545, size: 128, offset: 192)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !546, line: 31, size: 128, elements: !547)
!546 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!547 = !{!548, !551, !552}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !545, file: !546, line: 32, baseType: !549, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !371)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !545, file: !546, line: 33, baseType: !7, size: 32, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !545, file: !546, line: 34, baseType: !7, size: 32, offset: 96)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !452, file: !50, line: 3381, baseType: !554, size: 384)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !50, line: 2507, size: 384, elements: !555)
!555 = !{!556, !557, !558, !559, !560}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !554, file: !50, line: 2508, baseType: !488, size: 192)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !554, file: !50, line: 2509, baseType: !398, size: 32, offset: 192)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !554, file: !50, line: 2510, baseType: !7, size: 32, offset: 224)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !554, file: !50, line: 2511, baseType: !450, size: 64, offset: 256)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !554, file: !50, line: 2512, baseType: !450, size: 64, offset: 320)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !452, file: !50, line: 3382, baseType: !562, size: 896)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !50, line: 2652, size: 896, elements: !563)
!563 = !{!564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !562, file: !50, line: 2653, baseType: !554, size: 384)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !562, file: !50, line: 2654, baseType: !450, size: 64, offset: 384)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !562, file: !50, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !562, file: !50, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !562, file: !50, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !562, file: !50, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !562, file: !50, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !562, file: !50, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !562, file: !50, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !562, file: !50, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !562, file: !50, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !562, file: !50, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !562, file: !50, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !562, file: !50, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !562, file: !50, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !562, file: !50, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !562, file: !50, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !562, file: !50, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !562, file: !50, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !562, file: !50, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !562, file: !50, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !562, file: !50, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !562, file: !50, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !562, file: !50, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !562, file: !50, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !562, file: !50, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !562, file: !50, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !562, file: !50, line: 2703, baseType: !7, size: 32, offset: 512)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !562, file: !50, line: 2705, baseType: !450, size: 64, offset: 576)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !562, file: !50, line: 2706, baseType: !450, size: 64, offset: 640)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !562, file: !50, line: 2707, baseType: !450, size: 64, offset: 704)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !562, file: !50, line: 2708, baseType: !450, size: 64, offset: 768)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !562, file: !50, line: 2711, baseType: !597, size: 64, offset: 832)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !50, line: 2711, flags: DIFlagFwdDecl)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !452, file: !50, line: 3383, baseType: !600, size: 960)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !50, line: 2756, size: 960, elements: !601)
!601 = !{!602, !603}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !600, file: !50, line: 2757, baseType: !562, size: 896)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !600, file: !50, line: 2758, baseType: !445, size: 64, offset: 896)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !452, file: !50, line: 3384, baseType: !605, size: 1472)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !50, line: 3114, size: 1472, elements: !606)
!606 = !{!607, !628, !629, !630, !631}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !605, file: !50, line: 3115, baseType: !608, size: 1216)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !50, line: 2984, size: 1216, elements: !609)
!609 = !{!610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !608, file: !50, line: 2985, baseType: !600, size: 960)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !608, file: !50, line: 2986, baseType: !450, size: 64, offset: 960)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !608, file: !50, line: 2987, baseType: !450, size: 64, offset: 1024)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !608, file: !50, line: 2988, baseType: !450, size: 64, offset: 1088)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !608, file: !50, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !608, file: !50, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !608, file: !50, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !608, file: !50, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !608, file: !50, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !608, file: !50, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !608, file: !50, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !608, file: !50, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !608, file: !50, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !608, file: !50, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !608, file: !50, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !608, file: !50, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !608, file: !50, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !608, file: !50, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !605, file: !50, line: 3117, baseType: !450, size: 64, offset: 1216)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !605, file: !50, line: 3119, baseType: !450, size: 64, offset: 1280)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !605, file: !50, line: 3121, baseType: !450, size: 64, offset: 1344)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !605, file: !50, line: 3123, baseType: !450, size: 64, offset: 1408)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !452, file: !50, line: 3385, baseType: !633, size: 1088)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !50, line: 2874, size: 1088, elements: !634)
!634 = !{!635, !636, !637}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !633, file: !50, line: 2875, baseType: !600, size: 960)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !633, file: !50, line: 2876, baseType: !445, size: 64, offset: 960)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !633, file: !50, line: 2877, baseType: !638, size: 64, offset: 1024)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !640, line: 172, size: 128, elements: !641)
!640 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!641 = !{!642, !643, !644, !645, !646, !647, !648}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !639, file: !640, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !639, file: !640, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !639, file: !640, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !639, file: !640, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !639, file: !640, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !639, file: !640, line: 195, baseType: !7, size: 32, offset: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !639, file: !640, line: 199, baseType: !450, size: 64, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !452, file: !50, line: 3386, baseType: !608, size: 1216)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !452, file: !50, line: 3387, baseType: !651, size: 1280)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !50, line: 3093, size: 1280, elements: !652)
!652 = !{!653, !654}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !651, file: !50, line: 3094, baseType: !608, size: 1216)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !651, file: !50, line: 3095, baseType: !638, size: 64, offset: 1216)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !452, file: !50, line: 3388, baseType: !656, size: 1216)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !50, line: 2824, size: 1216, elements: !657)
!657 = !{!658, !659, !660, !661, !662, !663}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !656, file: !50, line: 2825, baseType: !562, size: 896)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !656, file: !50, line: 2827, baseType: !450, size: 64, offset: 896)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !656, file: !50, line: 2828, baseType: !450, size: 64, offset: 960)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !656, file: !50, line: 2829, baseType: !450, size: 64, offset: 1024)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !656, file: !50, line: 2830, baseType: !450, size: 64, offset: 1088)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !656, file: !50, line: 2831, baseType: !450, size: 64, offset: 1152)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !452, file: !50, line: 3389, baseType: !665, size: 1024)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !50, line: 2850, size: 1024, elements: !666)
!666 = !{!667, !668, !669}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !665, file: !50, line: 2851, baseType: !600, size: 960)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !665, file: !50, line: 2852, baseType: !372, size: 32, offset: 960)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !665, file: !50, line: 2853, baseType: !372, size: 32, offset: 992)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !452, file: !50, line: 3390, baseType: !671, size: 1024)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !50, line: 2857, size: 1024, elements: !672)
!672 = !{!673, !674}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !671, file: !50, line: 2858, baseType: !600, size: 960)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !671, file: !50, line: 2859, baseType: !638, size: 64, offset: 960)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !452, file: !50, line: 3391, baseType: !676, size: 960)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !50, line: 2862, size: 960, elements: !677)
!677 = !{!678}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !676, file: !50, line: 2863, baseType: !600, size: 960)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !452, file: !50, line: 3392, baseType: !680, size: 1472)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !50, line: 3304, size: 1472, elements: !681)
!681 = !{!682}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !680, file: !50, line: 3305, baseType: !605, size: 1472)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !452, file: !50, line: 3393, baseType: !684, size: 1792)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !50, line: 3248, size: 1792, elements: !685)
!685 = !{!686, !687, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !684, file: !50, line: 3249, baseType: !605, size: 1472)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !684, file: !50, line: 3251, baseType: !688, size: 64, offset: 1472)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !690, line: 463, size: 1152, elements: !691)
!690 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!691 = !{!692, !695, !728, !729, !926, !929, !930, !931, !932, !933, !934, !958, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !689, file: !690, line: 464, baseType: !693, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !690, line: 464, flags: DIFlagFwdDecl)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !689, file: !690, line: 467, baseType: !696, size: 64, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !34, line: 374, size: 640, elements: !698)
!698 = !{!699, !701, !702, !715, !716, !717, !718, !719, !720, !724, !726, !727}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !697, file: !34, line: 377, baseType: !700, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !380, line: 111, baseType: !404)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !697, file: !34, line: 378, baseType: !700, size: 64, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !697, file: !34, line: 381, baseType: !703, size: 64, offset: 128)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !34, line: 282, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !34, line: 282, size: 128, elements: !706)
!706 = !{!707}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !705, file: !34, line: 282, baseType: !708, size: 128)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !34, line: 281, baseType: !709)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !34, line: 281, size: 128, elements: !710)
!710 = !{!711, !712, !713}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !709, file: !34, line: 281, baseType: !7, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !709, file: !34, line: 281, baseType: !7, size: 32, offset: 32)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !709, file: !34, line: 281, baseType: !714, size: 64, offset: 64)
!714 = !DICompositeType(tag: DW_TAG_array_type, baseType: !700, size: 64, elements: !532)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !697, file: !34, line: 384, baseType: !372, size: 32, offset: 192)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !697, file: !34, line: 387, baseType: !372, size: 32, offset: 224)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !697, file: !34, line: 390, baseType: !372, size: 32, offset: 256)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !697, file: !34, line: 394, baseType: !703, size: 64, offset: 320)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !697, file: !34, line: 396, baseType: !33, size: 32, offset: 384)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !697, file: !34, line: 399, baseType: !721, size: 64, offset: 416)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 64, elements: !722)
!722 = !{!723}
!723 = !DISubrange(count: 2)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !697, file: !34, line: 402, baseType: !725, size: 64, offset: 480)
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !722)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !697, file: !34, line: 406, baseType: !372, size: 32, offset: 544)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !697, file: !34, line: 409, baseType: !372, size: 32, offset: 576)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !689, file: !690, line: 470, baseType: !431, size: 64, offset: 128)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !689, file: !690, line: 473, baseType: !730, size: 64, offset: 192)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !640, line: 39, size: 1152, elements: !732)
!732 = !{!733, !785, !798, !811, !812, !881, !882, !886, !887, !888, !889, !890}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !731, file: !640, line: 41, baseType: !734, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !735, line: 144, baseType: !736)
!735 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !735, line: 100, size: 896, elements: !738)
!738 = !{!739, !747, !752, !757, !759, !762, !763, !764, !765, !766, !771, !773, !774, !779, !784}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !737, file: !735, line: 102, baseType: !740, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !735, line: 52, baseType: !741)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DISubroutineType(types: !743)
!743 = !{!744, !745}
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !735, line: 47, baseType: !7)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !737, file: !735, line: 105, baseType: !748, size: 64, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !735, line: 59, baseType: !749)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{!372, !745, !745}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !737, file: !735, line: 108, baseType: !753, size: 64, offset: 128)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !735, line: 63, baseType: !754)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DISubroutineType(types: !756)
!756 = !{null, !376}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !737, file: !735, line: 111, baseType: !758, size: 64, offset: 192)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !737, file: !735, line: 114, baseType: !760, size: 64, offset: 256)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !761, line: 46, baseType: !503)
!761 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!762 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !737, file: !735, line: 117, baseType: !760, size: 64, offset: 320)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !737, file: !735, line: 120, baseType: !760, size: 64, offset: 384)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !737, file: !735, line: 124, baseType: !7, size: 32, offset: 448)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !737, file: !735, line: 128, baseType: !7, size: 32, offset: 480)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !737, file: !735, line: 131, baseType: !767, size: 64, offset: 512)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !735, line: 75, baseType: !768)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{!376, !760, !760}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !737, file: !735, line: 132, baseType: !772, size: 64, offset: 576)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !735, line: 78, baseType: !754)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !737, file: !735, line: 135, baseType: !376, size: 64, offset: 640)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !737, file: !735, line: 136, baseType: !775, size: 64, offset: 704)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !735, line: 82, baseType: !776)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DISubroutineType(types: !778)
!778 = !{!376, !376, !760, !760}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !737, file: !735, line: 137, baseType: !780, size: 64, offset: 768)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !735, line: 83, baseType: !781)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DISubroutineType(types: !783)
!783 = !{null, !376, !376}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !737, file: !735, line: 141, baseType: !7, size: 32, offset: 832)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !731, file: !640, line: 48, baseType: !786, size: 64, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !6, line: 35, baseType: !788)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !6, line: 35, size: 128, elements: !789)
!789 = !{!790}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !788, file: !6, line: 35, baseType: !791, size: 128)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !6, line: 33, baseType: !792)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !6, line: 33, size: 128, elements: !793)
!793 = !{!794, !795, !796}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !792, file: !6, line: 33, baseType: !7, size: 32)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !792, file: !6, line: 33, baseType: !7, size: 32, offset: 32)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !792, file: !6, line: 33, baseType: !797, size: 64, offset: 64)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !379, size: 64, elements: !532)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !731, file: !640, line: 51, baseType: !799, size: 64, offset: 128)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !50, line: 183, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !50, line: 183, size: 128, elements: !802)
!802 = !{!803}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !801, file: !50, line: 183, baseType: !804, size: 128)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !50, line: 182, baseType: !805)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !50, line: 182, size: 128, elements: !806)
!806 = !{!807, !808, !809}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !805, file: !50, line: 182, baseType: !7, size: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !805, file: !50, line: 182, baseType: !7, size: 32, offset: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !805, file: !50, line: 182, baseType: !810, size: 64, offset: 64)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !450, size: 64, elements: !532)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !731, file: !640, line: 54, baseType: !450, size: 64, offset: 192)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !731, file: !640, line: 57, baseType: !813, size: 128, offset: 256)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !814, line: 31, size: 128, elements: !815)
!814 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!815 = !{!816, !817, !818, !819, !820, !821, !822}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !813, file: !814, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !813, file: !814, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !813, file: !814, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !813, file: !814, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !813, file: !814, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !813, file: !814, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !813, file: !814, line: 56, baseType: !823, size: 64, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !380, line: 47, baseType: !824)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !826, line: 75, size: 256, elements: !827)
!826 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!827 = !{!828, !840, !841, !842}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !825, file: !826, line: 76, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !826, line: 68, baseType: !831)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !826, line: 63, size: 320, elements: !832)
!832 = !{!833, !835, !836, !837}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !831, file: !826, line: 64, baseType: !834, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !831, file: !826, line: 65, baseType: !834, size: 64, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !831, file: !826, line: 66, baseType: !7, size: 32, offset: 128)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !831, file: !826, line: 67, baseType: !838, size: 128, offset: 192)
!838 = !DICompositeType(tag: DW_TAG_array_type, baseType: !839, size: 128, elements: !722)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !826, line: 29, baseType: !503)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !825, file: !826, line: 77, baseType: !829, size: 64, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !825, file: !826, line: 78, baseType: !7, size: 32, offset: 128)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !825, file: !826, line: 79, baseType: !843, size: 64, offset: 192)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !826, line: 49, baseType: !845)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !826, line: 45, size: 832, elements: !846)
!846 = !{!847, !848, !849}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !845, file: !826, line: 46, baseType: !834, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !845, file: !826, line: 47, baseType: !824, size: 64, offset: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !845, file: !826, line: 48, baseType: !850, size: 704, offset: 128)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !851, line: 164, size: 704, elements: !852)
!851 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!852 = !{!853, !854, !864, !865, !866, !867, !868, !869, !873, !877, !878, !879, !880}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !850, file: !851, line: 166, baseType: !505, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !850, file: !851, line: 167, baseType: !855, size: 64, offset: 64)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !851, line: 157, size: 192, elements: !857)
!857 = !{!858, !859, !860}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !856, file: !851, line: 159, baseType: !374, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !856, file: !851, line: 160, baseType: !855, size: 64, offset: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !856, file: !851, line: 161, baseType: !861, size: 32, offset: 128)
!861 = !DICompositeType(tag: DW_TAG_array_type, baseType: !375, size: 32, elements: !862)
!862 = !{!863}
!863 = !DISubrange(count: 4)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !850, file: !851, line: 168, baseType: !374, size: 64, offset: 128)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !850, file: !851, line: 169, baseType: !374, size: 64, offset: 192)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !850, file: !851, line: 170, baseType: !374, size: 64, offset: 256)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !850, file: !851, line: 171, baseType: !505, size: 64, offset: 320)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !850, file: !851, line: 172, baseType: !372, size: 32, offset: 384)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !850, file: !851, line: 176, baseType: !870, size: 64, offset: 448)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DISubroutineType(types: !872)
!872 = !{!855, !376, !505}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !850, file: !851, line: 177, baseType: !874, size: 64, offset: 512)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DISubroutineType(types: !876)
!876 = !{null, !376, !855}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !850, file: !851, line: 178, baseType: !376, size: 64, offset: 576)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !850, file: !851, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !850, file: !851, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !850, file: !851, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !731, file: !640, line: 60, baseType: !813, size: 128, offset: 384)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !731, file: !640, line: 64, baseType: !883, size: 64, offset: 512)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !885, line: 33, flags: DIFlagFwdDecl)
!885 = !DIFile(filename: "./pointer-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!886 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !731, file: !640, line: 67, baseType: !450, size: 64, offset: 576)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !731, file: !640, line: 73, baseType: !734, size: 64, offset: 640)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !731, file: !640, line: 77, baseType: !823, size: 64, offset: 704)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !731, file: !640, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !731, file: !640, line: 82, baseType: !891, size: 320, offset: 832)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !363, line: 62, size: 320, elements: !892)
!892 = !{!893, !899, !900, !901, !902, !909}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !891, file: !363, line: 63, baseType: !894, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !363, line: 56, size: 128, elements: !896)
!896 = !{!897, !898}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !895, file: !363, line: 57, baseType: !894, size: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !895, file: !363, line: 58, baseType: !531, size: 8, offset: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !891, file: !363, line: 64, baseType: !7, size: 32, offset: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !891, file: !363, line: 66, baseType: !7, size: 32, offset: 96)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !891, file: !363, line: 68, baseType: !371, size: 8, offset: 128)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !891, file: !363, line: 70, baseType: !903, size: 64, offset: 192)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !363, line: 37, size: 128, elements: !905)
!905 = !{!906, !907}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !904, file: !363, line: 39, baseType: !903, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !904, file: !363, line: 40, baseType: !908, size: 64, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !891, file: !363, line: 71, baseType: !910, size: 64, offset: 256)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !363, line: 45, size: 320, elements: !912)
!912 = !{!913, !914}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !911, file: !363, line: 47, baseType: !910, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !911, file: !363, line: 48, baseType: !915, size: 256, offset: 64)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !50, line: 1883, size: 256, elements: !916)
!916 = !{!917, !919, !920, !925}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !915, file: !50, line: 1884, baseType: !918, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !915, file: !50, line: 1885, baseType: !918, size: 64, offset: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !915, file: !50, line: 1891, baseType: !921, size: 64, offset: 128)
!921 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !915, file: !50, line: 1891, size: 64, elements: !922)
!922 = !{!923, !924}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !921, file: !50, line: 1891, baseType: !379, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !921, file: !50, line: 1891, baseType: !450, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !915, file: !50, line: 1892, baseType: !908, size: 64, offset: 192)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !689, file: !690, line: 476, baseType: !927, size: 64, offset: 256)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !690, line: 476, flags: DIFlagFwdDecl)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !689, file: !690, line: 479, baseType: !734, size: 64, offset: 320)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !689, file: !690, line: 484, baseType: !450, size: 64, offset: 384)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !689, file: !690, line: 488, baseType: !450, size: 64, offset: 448)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !689, file: !690, line: 493, baseType: !450, size: 64, offset: 512)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !689, file: !690, line: 496, baseType: !450, size: 64, offset: 576)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !689, file: !690, line: 501, baseType: !935, size: 64, offset: 640)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !45, line: 2355, size: 576, elements: !937)
!937 = !{!938, !941, !942, !943, !944, !946, !947, !952, !953, !954, !955, !956, !957}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !936, file: !45, line: 2356, baseType: !939, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !45, line: 2356, flags: DIFlagFwdDecl)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !936, file: !45, line: 2357, baseType: !377, size: 64, offset: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !936, file: !45, line: 2358, baseType: !372, size: 32, offset: 128)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !936, file: !45, line: 2359, baseType: !372, size: 32, offset: 160)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !936, file: !45, line: 2360, baseType: !945, size: 128, offset: 192)
!945 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 128, elements: !862)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !936, file: !45, line: 2364, baseType: !372, size: 32, offset: 320)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !936, file: !45, line: 2367, baseType: !948, size: 128, offset: 384)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !45, line: 2349, size: 128, elements: !949)
!949 = !{!950, !951}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !948, file: !45, line: 2351, baseType: !445, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !948, file: !45, line: 2352, baseType: !505, size: 64, offset: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !936, file: !45, line: 2371, baseType: !44, size: 32, offset: 512)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !936, file: !45, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !936, file: !45, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !936, file: !45, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !936, file: !45, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !936, file: !45, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !689, file: !690, line: 504, baseType: !959, size: 64, offset: 704)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !690, line: 504, flags: DIFlagFwdDecl)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !689, file: !690, line: 507, baseType: !734, size: 64, offset: 768)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !689, file: !690, line: 510, baseType: !372, size: 32, offset: 832)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !689, file: !690, line: 513, baseType: !372, size: 32, offset: 864)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !689, file: !690, line: 516, baseType: !398, size: 32, offset: 896)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !689, file: !690, line: 519, baseType: !398, size: 32, offset: 928)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !689, file: !690, line: 522, baseType: !7, size: 32, offset: 960)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !689, file: !690, line: 523, baseType: !7, size: 32, offset: 992)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !689, file: !690, line: 528, baseType: !377, size: 64, offset: 1024)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !689, file: !690, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !689, file: !690, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !689, file: !690, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !689, file: !690, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !689, file: !690, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !689, file: !690, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !689, file: !690, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !689, file: !690, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !689, file: !690, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !689, file: !690, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !689, file: !690, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !689, file: !690, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !689, file: !690, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !689, file: !690, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !689, file: !690, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !689, file: !690, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !684, file: !50, line: 3254, baseType: !450, size: 64, offset: 1536)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !684, file: !50, line: 3257, baseType: !450, size: 64, offset: 1600)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !684, file: !50, line: 3258, baseType: !450, size: 64, offset: 1664)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !684, file: !50, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !684, file: !50, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !684, file: !50, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !684, file: !50, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !684, file: !50, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !684, file: !50, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !684, file: !50, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !684, file: !50, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !684, file: !50, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !684, file: !50, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !684, file: !50, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !684, file: !50, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !684, file: !50, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !684, file: !50, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !684, file: !50, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !684, file: !50, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !684, file: !50, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !684, file: !50, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !452, file: !50, line: 3394, baseType: !1007, size: 1344)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !50, line: 2279, size: 1344, elements: !1008)
!1008 = !{!1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1034, !1035, !1036, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1007, file: !50, line: 2280, baseType: !488, size: 192)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1007, file: !50, line: 2281, baseType: !450, size: 64, offset: 192)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1007, file: !50, line: 2282, baseType: !450, size: 64, offset: 256)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1007, file: !50, line: 2283, baseType: !450, size: 64, offset: 320)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1007, file: !50, line: 2284, baseType: !450, size: 64, offset: 384)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1007, file: !50, line: 2285, baseType: !7, size: 32, offset: 448)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1007, file: !50, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1007, file: !50, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1007, file: !50, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1007, file: !50, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1007, file: !50, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1007, file: !50, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1007, file: !50, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1007, file: !50, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1007, file: !50, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1007, file: !50, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1007, file: !50, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1007, file: !50, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1007, file: !50, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1007, file: !50, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1007, file: !50, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1007, file: !50, line: 2305, baseType: !7, size: 32, offset: 512)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1007, file: !50, line: 2306, baseType: !1032, size: 32, offset: 544)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1033, line: 31, baseType: !372)
!1033 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1007, file: !50, line: 2307, baseType: !450, size: 64, offset: 576)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1007, file: !50, line: 2308, baseType: !450, size: 64, offset: 640)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1007, file: !50, line: 2314, baseType: !1037, size: 64, offset: 704)
!1037 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !50, line: 2309, size: 64, elements: !1038)
!1038 = !{!1039, !1040, !1041}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1037, file: !50, line: 2310, baseType: !372, size: 32)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1037, file: !50, line: 2311, baseType: !377, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1037, file: !50, line: 2312, baseType: !1042, size: 64)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !50, line: 2277, flags: DIFlagFwdDecl)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1007, file: !50, line: 2315, baseType: !450, size: 64, offset: 768)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1007, file: !50, line: 2316, baseType: !450, size: 64, offset: 832)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1007, file: !50, line: 2317, baseType: !450, size: 64, offset: 896)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1007, file: !50, line: 2318, baseType: !450, size: 64, offset: 960)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1007, file: !50, line: 2319, baseType: !450, size: 64, offset: 1024)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1007, file: !50, line: 2320, baseType: !450, size: 64, offset: 1088)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1007, file: !50, line: 2321, baseType: !450, size: 64, offset: 1152)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1007, file: !50, line: 2322, baseType: !450, size: 64, offset: 1216)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1007, file: !50, line: 2324, baseType: !1053, size: 64, offset: 1280)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !50, line: 2324, flags: DIFlagFwdDecl)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !452, file: !50, line: 3395, baseType: !1056, size: 320)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !50, line: 1469, size: 320, elements: !1057)
!1057 = !{!1058, !1059, !1060}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1056, file: !50, line: 1470, baseType: !488, size: 192)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1056, file: !50, line: 1471, baseType: !450, size: 64, offset: 192)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1056, file: !50, line: 1472, baseType: !450, size: 64, offset: 256)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !452, file: !50, line: 3396, baseType: !1062, size: 320)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !50, line: 1482, size: 320, elements: !1063)
!1063 = !{!1064, !1065, !1066}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1062, file: !50, line: 1483, baseType: !488, size: 192)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1062, file: !50, line: 1484, baseType: !372, size: 32, offset: 192)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1062, file: !50, line: 1485, baseType: !810, size: 64, offset: 256)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !452, file: !50, line: 3397, baseType: !1068, size: 384)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !50, line: 1829, size: 384, elements: !1069)
!1069 = !{!1070, !1071, !1072, !1073}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1068, file: !50, line: 1830, baseType: !488, size: 192)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1068, file: !50, line: 1831, baseType: !398, size: 32, offset: 192)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1068, file: !50, line: 1832, baseType: !450, size: 64, offset: 256)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1068, file: !50, line: 1835, baseType: !810, size: 64, offset: 320)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !452, file: !50, line: 3398, baseType: !1075, size: 704)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !50, line: 1898, size: 704, elements: !1076)
!1076 = !{!1077, !1078, !1079, !1080, !1081, !1086}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1075, file: !50, line: 1899, baseType: !488, size: 192)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1075, file: !50, line: 1902, baseType: !450, size: 64, offset: 192)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1075, file: !50, line: 1905, baseType: !379, size: 64, offset: 256)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1075, file: !50, line: 1908, baseType: !7, size: 32, offset: 320)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1075, file: !50, line: 1911, baseType: !1082, size: 64, offset: 384)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !640, line: 117, size: 128, elements: !1084)
!1084 = !{!1085}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "pt", scope: !1083, file: !640, line: 120, baseType: !813, size: 128)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1075, file: !50, line: 1914, baseType: !915, size: 256, offset: 448)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !452, file: !50, line: 3399, baseType: !1088, size: 704)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !50, line: 2008, size: 704, elements: !1089)
!1089 = !{!1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1088, file: !50, line: 2009, baseType: !488, size: 192)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1088, file: !50, line: 2011, baseType: !7, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !1088, file: !50, line: 2012, baseType: !7, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1088, file: !50, line: 2014, baseType: !398, size: 32, offset: 224)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1088, file: !50, line: 2016, baseType: !450, size: 64, offset: 256)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !1088, file: !50, line: 2017, baseType: !799, size: 64, offset: 320)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !1088, file: !50, line: 2019, baseType: !450, size: 64, offset: 384)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !1088, file: !50, line: 2020, baseType: !450, size: 64, offset: 448)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1088, file: !50, line: 2021, baseType: !450, size: 64, offset: 512)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !1088, file: !50, line: 2022, baseType: !450, size: 64, offset: 576)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !1088, file: !50, line: 2023, baseType: !450, size: 64, offset: 640)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !452, file: !50, line: 3400, baseType: !1102, size: 832)
!1102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !50, line: 2430, size: 832, elements: !1103)
!1103 = !{!1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1102, file: !50, line: 2431, baseType: !488, size: 192)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1102, file: !50, line: 2433, baseType: !450, size: 64, offset: 192)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !1102, file: !50, line: 2434, baseType: !450, size: 64, offset: 256)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !1102, file: !50, line: 2435, baseType: !450, size: 64, offset: 320)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !1102, file: !50, line: 2436, baseType: !450, size: 64, offset: 384)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "base_accesses", scope: !1102, file: !50, line: 2437, baseType: !799, size: 64, offset: 448)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "inheritance", scope: !1102, file: !50, line: 2438, baseType: !450, size: 64, offset: 512)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_subvtt", scope: !1102, file: !50, line: 2440, baseType: !450, size: 64, offset: 576)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_vptr", scope: !1102, file: !50, line: 2441, baseType: !450, size: 64, offset: 640)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "base_binfos", scope: !1102, file: !50, line: 2443, baseType: !1114, size: 128, offset: 704)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_none", file: !50, line: 182, baseType: !1115)
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_none", file: !50, line: 182, size: 128, elements: !1116)
!1116 = !{!1117}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1115, file: !50, line: 182, baseType: !804, size: 128)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "stmt_list", scope: !452, file: !50, line: 3401, baseType: !1119, size: 320)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list", file: !50, line: 3327, size: 320, elements: !1120)
!1120 = !{!1121, !1122, !1129}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1119, file: !50, line: 3329, baseType: !488, size: 192)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1119, file: !50, line: 3330, baseType: !1123, size: 64, offset: 192)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list_node", file: !50, line: 3320, size: 192, elements: !1125)
!1125 = !{!1126, !1127, !1128}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1124, file: !50, line: 3322, baseType: !1123, size: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1124, file: !50, line: 3323, baseType: !1123, size: 64, offset: 64)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1124, file: !50, line: 3324, baseType: !450, size: 64, offset: 128)
