; ModuleID = 'graphds.bc'
source_filename = "graphds.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.bitmap_element_def = type { %struct.bitmap_element_def*, %struct.bitmap_element_def*, i32, [2 x i64] }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.stat64 = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.graph = type { i32, %struct.vertex*, %struct.htab* }
%struct.vertex = type { %struct.graph_edge*, %struct.graph_edge*, i32, i32, i8* }
%struct.graph_edge = type { i32, i32, %struct.graph_edge*, %struct.graph_edge*, i8* }
%struct.htab = type { i32 (i8*)*, i32 (i8*, i8*)*, void (i8*)*, i8**, i64, i64, i64, i32, i32, i8* (i64, i64)*, void (i8*)*, i8*, i8* (i8*, i64, i64)*, void (i8*, i8*)*, i32 }
%struct.VEC_int_heap = type { %struct.VEC_int_base }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, nameTableKind: None)
!1 = !DIFile(filename: "graphds.c", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2 = !{}
!3 = !{!4, !5, !6, !7, !10, !11, !13, !19, !23, !89, !90, !47, !91}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "graph", file: !15, line: 45, size: 192, elements: !16)
!15 = !DIFile(filename: "./graphds.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!16 = !{!17, !18, !35}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "n_vertices", scope: !14, file: !15, line: 47, baseType: !6, size: 32)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "vertices", scope: !14, file: !15, line: 48, baseType: !19, size: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vertex", file: !15, line: 33, size: 256, elements: !21)
!21 = !{!22, !31, !32, !33, !34}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "pred", scope: !20, file: !15, line: 35, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "graph_edge", file: !15, line: 23, size: 256, elements: !25)
!25 = !{!26, !27, !28, !29, !30}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !24, file: !15, line: 25, baseType: !6, size: 32)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !24, file: !15, line: 25, baseType: !6, size: 32, offset: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "pred_next", scope: !24, file: !15, line: 26, baseType: !23, size: 64, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "succ_next", scope: !24, file: !15, line: 26, baseType: !23, size: 64, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !24, file: !15, line: 28, baseType: !10, size: 64, offset: 192)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "succ", scope: !20, file: !15, line: 35, baseType: !23, size: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "component", scope: !20, file: !15, line: 37, baseType: !6, size: 32, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !20, file: !15, line: 39, baseType: !6, size: 32, offset: 160)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !20, file: !15, line: 40, baseType: !10, size: 64, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "indices", scope: !14, file: !15, line: 50, baseType: !36, size: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !37, line: 144, baseType: !38)
!37 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !37, line: 100, size: 896, elements: !40)
!40 = !{!41, !50, !55, !60, !62, !66, !67, !68, !69, !70, !75, !77, !78, !83, !88}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !39, file: !37, line: 102, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !37, line: 52, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{!46, !48}
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !37, line: 47, baseType: !47)
!47 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !39, file: !37, line: 105, baseType: !51, size: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !37, line: 59, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!6, !48, !48}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !39, file: !37, line: 108, baseType: !56, size: 64, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !37, line: 63, baseType: !57)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DISubroutineType(types: !59)
!59 = !{null, !10}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !39, file: !37, line: 111, baseType: !61, size: 64, offset: 192)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !39, file: !37, line: 114, baseType: !63, size: 64, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !64, line: 46, baseType: !65)
!64 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!65 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !39, file: !37, line: 117, baseType: !63, size: 64, offset: 320)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !39, file: !37, line: 120, baseType: !63, size: 64, offset: 384)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !39, file: !37, line: 124, baseType: !47, size: 32, offset: 448)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !39, file: !37, line: 128, baseType: !47, size: 32, offset: 480)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !39, file: !37, line: 131, baseType: !71, size: 64, offset: 512)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !37, line: 75, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{!10, !63, !63}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !39, file: !37, line: 132, baseType: !76, size: 64, offset: 576)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !37, line: 78, baseType: !57)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !39, file: !37, line: 135, baseType: !10, size: 64, offset: 640)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !39, file: !37, line: 136, baseType: !79, size: 64, offset: 704)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !37, line: 82, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!10, !10, !63, !63}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !39, file: !37, line: 137, baseType: !84, size: 64, offset: 768)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !37, line: 83, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{null, !10, !10}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !39, file: !37, line: 141, baseType: !47, size: 32, offset: 832)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_int_heap", file: !93, line: 32, baseType: !94)
!93 = !DIFile(filename: "./vecprim.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_int_heap", file: !93, line: 32, size: 96, elements: !95)
!95 = !{!96}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !94, file: !93, line: 32, baseType: !97, size: 96)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_int_base", file: !93, line: 31, baseType: !98)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_int_base", file: !93, line: 31, size: 96, elements: !99)
!99 = !{!100, !101, !102}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !98, file: !93, line: 31, baseType: !47, size: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !98, file: !93, line: 31, baseType: !47, size: 32, offset: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !98, file: !93, line: 31, baseType: !103, size: 32, offset: 64)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 32, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 1)
!106 = !{i32 2, !"Dwarf Version", i32 4}
!107 = !{i32 2, !"Debug Info Version", i32 3}
!108 = !{i32 1, !"wchar_size", i32 4}
!109 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!110 = distinct !DISubprogram(name: "vprintf", scope: !111, file: !111, line: 39, type: !112, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !122)
!111 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!112 = !DISubroutineType(types: !113)
!113 = !{!6, !114, !115}
!114 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !11)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, elements: !117)
!117 = !{!118, !119, !120, !121}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !116, file: !1, baseType: !47, size: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !116, file: !1, baseType: !47, size: 32, offset: 32)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !116, file: !1, baseType: !10, size: 64, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !116, file: !1, baseType: !10, size: 64, offset: 128)
!122 = !{!123, !124}
!123 = !DILocalVariable(name: "__fmt", arg: 1, scope: !110, file: !111, line: 39, type: !114)
!124 = !DILocalVariable(name: "__arg", arg: 2, scope: !110, file: !111, line: 39, type: !115)
!125 = !DILocation(line: 0, scope: !110)
!126 = !DILocation(line: 41, column: 20, scope: !110)
!127 = !DILocation(line: 41, column: 10, scope: !110)
!128 = !DILocation(line: 41, column: 3, scope: !110)
!129 = distinct !DISubprogram(name: "getchar", scope: !111, file: !111, line: 47, type: !130, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !2)
!130 = !DISubroutineType(types: !131)
!131 = !{!6}
!132 = !DILocation(line: 49, column: 16, scope: !129)
!133 = !DILocation(line: 49, column: 10, scope: !129)
!134 = !DILocation(line: 49, column: 3, scope: !129)
!135 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !111, file: !111, line: 56, type: !136, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !192)
!136 = !DISubroutineType(types: !137)
!137 = !{!6, !138}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !140, line: 7, baseType: !141)
!140 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !142, line: 49, size: 1728, elements: !143)
!142 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!143 = !{!144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !159, !161, !162, !163, !167, !169, !171, !173, !176, !178, !181, !184, !185, !186, !187, !188}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !141, file: !142, line: 51, baseType: !6, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !141, file: !142, line: 54, baseType: !8, size: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !141, file: !142, line: 55, baseType: !8, size: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !141, file: !142, line: 56, baseType: !8, size: 64, offset: 192)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !141, file: !142, line: 57, baseType: !8, size: 64, offset: 256)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !141, file: !142, line: 58, baseType: !8, size: 64, offset: 320)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !141, file: !142, line: 59, baseType: !8, size: 64, offset: 384)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !141, file: !142, line: 60, baseType: !8, size: 64, offset: 448)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !141, file: !142, line: 61, baseType: !8, size: 64, offset: 512)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !141, file: !142, line: 64, baseType: !8, size: 64, offset: 576)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !141, file: !142, line: 65, baseType: !8, size: 64, offset: 640)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !141, file: !142, line: 66, baseType: !8, size: 64, offset: 704)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !141, file: !142, line: 68, baseType: !157, size: 64, offset: 768)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !142, line: 36, flags: DIFlagFwdDecl)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !141, file: !142, line: 70, baseType: !160, size: 64, offset: 832)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !141, file: !142, line: 72, baseType: !6, size: 32, offset: 896)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !141, file: !142, line: 73, baseType: !6, size: 32, offset: 928)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !141, file: !142, line: 74, baseType: !164, size: 64, offset: 960)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !165, line: 152, baseType: !166)
!165 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!166 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !141, file: !142, line: 77, baseType: !168, size: 16, offset: 1024)
!168 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !141, file: !142, line: 78, baseType: !170, size: 8, offset: 1040)
!170 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !141, file: !142, line: 79, baseType: !172, size: 8, offset: 1048)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8, elements: !104)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !141, file: !142, line: 81, baseType: !174, size: 64, offset: 1088)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !142, line: 43, baseType: null)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !141, file: !142, line: 89, baseType: !177, size: 64, offset: 1152)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !165, line: 153, baseType: !166)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !141, file: !142, line: 91, baseType: !179, size: 64, offset: 1216)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !142, line: 37, flags: DIFlagFwdDecl)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !141, file: !142, line: 92, baseType: !182, size: 64, offset: 1280)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !142, line: 38, flags: DIFlagFwdDecl)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !141, file: !142, line: 93, baseType: !160, size: 64, offset: 1344)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !141, file: !142, line: 94, baseType: !10, size: 64, offset: 1408)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !141, file: !142, line: 95, baseType: !63, size: 64, offset: 1472)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !141, file: !142, line: 96, baseType: !6, size: 32, offset: 1536)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !141, file: !142, line: 98, baseType: !189, size: 160, offset: 1568)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 160, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 20)
!192 = !{!193}
!193 = !DILocalVariable(name: "__fp", arg: 1, scope: !135, file: !111, line: 56, type: !138)
!194 = !DILocation(line: 0, scope: !135)
!195 = !DILocation(line: 58, column: 10, scope: !135)
!196 = !DILocation(line: 58, column: 3, scope: !135)
!197 = distinct !DISubprogram(name: "getc_unlocked", scope: !111, file: !111, line: 66, type: !136, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !198)
!198 = !{!199}
!199 = !DILocalVariable(name: "__fp", arg: 1, scope: !197, file: !111, line: 66, type: !138)
!200 = !DILocation(line: 0, scope: !197)
!201 = !DILocation(line: 68, column: 10, scope: !197)
!202 = !DILocation(line: 68, column: 3, scope: !197)
!203 = distinct !DISubprogram(name: "getchar_unlocked", scope: !111, file: !111, line: 73, type: !130, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !2)
!204 = !DILocation(line: 75, column: 10, scope: !203)
!205 = !DILocation(line: 75, column: 3, scope: !203)
!206 = distinct !DISubprogram(name: "putchar", scope: !111, file: !111, line: 82, type: !207, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !209)
!207 = !DISubroutineType(types: !208)
!208 = !{!6, !6}
!209 = !{!210}
!210 = !DILocalVariable(name: "__c", arg: 1, scope: !206, file: !111, line: 82, type: !6)
!211 = !DILocation(line: 0, scope: !206)
!212 = !DILocation(line: 84, column: 21, scope: !206)
!213 = !DILocation(line: 84, column: 10, scope: !206)
!214 = !DILocation(line: 84, column: 3, scope: !206)
!215 = distinct !DISubprogram(name: "fputc_unlocked", scope: !111, file: !111, line: 91, type: !216, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !218)
!216 = !DISubroutineType(types: !217)
!217 = !{!6, !6, !138}
!218 = !{!219, !220}
!219 = !DILocalVariable(name: "__c", arg: 1, scope: !215, file: !111, line: 91, type: !6)
!220 = !DILocalVariable(name: "__stream", arg: 2, scope: !215, file: !111, line: 91, type: !138)
!221 = !DILocation(line: 0, scope: !215)
!222 = !DILocation(line: 93, column: 10, scope: !215)
!223 = !DILocation(line: 93, column: 3, scope: !215)
!224 = distinct !DISubprogram(name: "putc_unlocked", scope: !111, file: !111, line: 101, type: !216, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !225)
!225 = !{!226, !227}
!226 = !DILocalVariable(name: "__c", arg: 1, scope: !224, file: !111, line: 101, type: !6)
!227 = !DILocalVariable(name: "__stream", arg: 2, scope: !224, file: !111, line: 101, type: !138)
!228 = !DILocation(line: 0, scope: !224)
!229 = !DILocation(line: 103, column: 10, scope: !224)
!230 = !DILocation(line: 103, column: 3, scope: !224)
!231 = distinct !DISubprogram(name: "putchar_unlocked", scope: !111, file: !111, line: 108, type: !207, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !232)
!232 = !{!233}
!233 = !DILocalVariable(name: "__c", arg: 1, scope: !231, file: !111, line: 108, type: !6)
!234 = !DILocation(line: 0, scope: !231)
!235 = !DILocation(line: 110, column: 10, scope: !231)
!236 = !DILocation(line: 110, column: 3, scope: !231)
!237 = distinct !DISubprogram(name: "getline", scope: !111, file: !111, line: 118, type: !238, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !242)
!238 = !DISubroutineType(types: !239)
!239 = !{!240, !7, !241, !138}
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !165, line: 193, baseType: !166)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!242 = !{!243, !244, !245}
!243 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !237, file: !111, line: 118, type: !7)
!244 = !DILocalVariable(name: "__n", arg: 2, scope: !237, file: !111, line: 118, type: !241)
!245 = !DILocalVariable(name: "__stream", arg: 3, scope: !237, file: !111, line: 118, type: !138)
!246 = !DILocation(line: 0, scope: !237)
!247 = !DILocation(line: 120, column: 10, scope: !237)
!248 = !DILocation(line: 120, column: 3, scope: !237)
!249 = distinct !DISubprogram(name: "feof_unlocked", scope: !111, file: !111, line: 128, type: !136, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !250)
!250 = !{!251}
!251 = !DILocalVariable(name: "__stream", arg: 1, scope: !249, file: !111, line: 128, type: !138)
!252 = !DILocation(line: 0, scope: !249)
!253 = !DILocation(line: 130, column: 10, scope: !249)
!254 = !DILocation(line: 130, column: 3, scope: !249)
!255 = distinct !DISubprogram(name: "ferror_unlocked", scope: !111, file: !111, line: 135, type: !136, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !256)
!256 = !{!257}
!257 = !DILocalVariable(name: "__stream", arg: 1, scope: !255, file: !111, line: 135, type: !138)
!258 = !DILocation(line: 0, scope: !255)
!259 = !DILocation(line: 137, column: 10, scope: !255)
!260 = !DILocation(line: 137, column: 3, scope: !255)
!261 = distinct !DISubprogram(name: "tolower", scope: !262, file: !262, line: 207, type: !207, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !263)
!262 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!263 = !{!264}
!264 = !DILocalVariable(name: "__c", arg: 1, scope: !261, file: !262, line: 207, type: !6)
!265 = !DILocation(line: 0, scope: !261)
!266 = !DILocation(line: 209, column: 22, scope: !261)
!267 = !DILocation(line: 209, column: 39, scope: !261)
!268 = !DILocation(line: 209, column: 38, scope: !261)
!269 = !DILocation(line: 209, column: 37, scope: !261)
!270 = !DILocation(line: 209, column: 10, scope: !261)
!271 = !DILocation(line: 209, column: 3, scope: !261)
!272 = distinct !DISubprogram(name: "toupper", scope: !262, file: !262, line: 213, type: !207, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !273)
!273 = !{!274}
!274 = !DILocalVariable(name: "__c", arg: 1, scope: !272, file: !262, line: 213, type: !6)
!275 = !DILocation(line: 0, scope: !272)
!276 = !DILocation(line: 215, column: 22, scope: !272)
!277 = !DILocation(line: 215, column: 39, scope: !272)
!278 = !DILocation(line: 215, column: 38, scope: !272)
!279 = !DILocation(line: 215, column: 37, scope: !272)
!280 = !DILocation(line: 215, column: 10, scope: !272)
!281 = !DILocation(line: 215, column: 3, scope: !272)
!282 = distinct !DISubprogram(name: "atoi", scope: !283, file: !283, line: 361, type: !284, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !286)
!283 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!284 = !DISubroutineType(types: !285)
!285 = !{!6, !11}
!286 = !{!287}
!287 = !DILocalVariable(name: "__nptr", arg: 1, scope: !282, file: !283, line: 361, type: !11)
!288 = !DILocation(line: 0, scope: !282)
!289 = !DILocation(line: 363, column: 16, scope: !282)
!290 = !DILocation(line: 363, column: 10, scope: !282)
!291 = !DILocation(line: 363, column: 3, scope: !282)
!292 = distinct !DISubprogram(name: "atol", scope: !283, file: !283, line: 366, type: !293, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !295)
!293 = !DISubroutineType(types: !294)
!294 = !{!166, !11}
!295 = !{!296}
!296 = !DILocalVariable(name: "__nptr", arg: 1, scope: !292, file: !283, line: 366, type: !11)
!297 = !DILocation(line: 0, scope: !292)
!298 = !DILocation(line: 368, column: 10, scope: !292)
!299 = !DILocation(line: 368, column: 3, scope: !292)
!300 = distinct !DISubprogram(name: "atoll", scope: !283, file: !283, line: 373, type: !301, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !304)
!301 = !DISubroutineType(types: !302)
!302 = !{!303, !11}
!303 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!304 = !{!305}
!305 = !DILocalVariable(name: "__nptr", arg: 1, scope: !300, file: !283, line: 373, type: !11)
!306 = !DILocation(line: 0, scope: !300)
!307 = !DILocation(line: 375, column: 10, scope: !300)
!308 = !DILocation(line: 375, column: 3, scope: !300)
!309 = distinct !DISubprogram(name: "bsearch", scope: !310, file: !310, line: 20, type: !311, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !314)
!310 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!311 = !DISubroutineType(types: !312)
!312 = !{!10, !48, !48, !63, !63, !313}
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !283, line: 808, baseType: !52)
!314 = !{!315, !316, !317, !318, !319, !320, !321, !322, !323, !324}
!315 = !DILocalVariable(name: "__key", arg: 1, scope: !309, file: !310, line: 20, type: !48)
!316 = !DILocalVariable(name: "__base", arg: 2, scope: !309, file: !310, line: 20, type: !48)
!317 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !309, file: !310, line: 20, type: !63)
!318 = !DILocalVariable(name: "__size", arg: 4, scope: !309, file: !310, line: 20, type: !63)
!319 = !DILocalVariable(name: "__compar", arg: 5, scope: !309, file: !310, line: 21, type: !313)
!320 = !DILocalVariable(name: "__l", scope: !309, file: !310, line: 23, type: !63)
!321 = !DILocalVariable(name: "__u", scope: !309, file: !310, line: 23, type: !63)
!322 = !DILocalVariable(name: "__idx", scope: !309, file: !310, line: 23, type: !63)
!323 = !DILocalVariable(name: "__p", scope: !309, file: !310, line: 24, type: !48)
!324 = !DILocalVariable(name: "__comparison", scope: !309, file: !310, line: 25, type: !6)
!325 = !DILocation(line: 0, scope: !309)
!326 = !DILocation(line: 29, column: 3, scope: !309)
!327 = !DILocation(line: 27, column: 7, scope: !309)
!328 = !DILocation(line: 29, column: 14, scope: !309)
!329 = !DILocation(line: 31, column: 20, scope: !330)
!330 = distinct !DILexicalBlock(scope: !309, file: !310, line: 30, column: 5)
!331 = !DILocation(line: 31, column: 27, scope: !330)
!332 = !DILocation(line: 32, column: 56, scope: !330)
!333 = !DILocation(line: 32, column: 47, scope: !330)
!334 = !DILocation(line: 33, column: 22, scope: !330)
!335 = !DILocation(line: 34, column: 24, scope: !336)
!336 = distinct !DILexicalBlock(scope: !330, file: !310, line: 34, column: 11)
!337 = !DILocation(line: 34, column: 11, scope: !330)
!338 = !DILocation(line: 36, column: 29, scope: !339)
!339 = distinct !DILexicalBlock(scope: !336, file: !310, line: 36, column: 16)
!340 = !DILocation(line: 36, column: 16, scope: !336)
!341 = !DILocation(line: 37, column: 14, scope: !339)
!342 = distinct !{!342, !326, !343}
!343 = !DILocation(line: 40, column: 5, scope: !309)
!344 = !DILocation(line: 43, column: 1, scope: !309)
!345 = distinct !DISubprogram(name: "atof", scope: !346, file: !346, line: 25, type: !347, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !350)
!346 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!347 = !DISubroutineType(types: !348)
!348 = !{!349, !11}
!349 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!350 = !{!351}
!351 = !DILocalVariable(name: "__nptr", arg: 1, scope: !345, file: !346, line: 25, type: !11)
!352 = !DILocation(line: 0, scope: !345)
!353 = !DILocation(line: 27, column: 10, scope: !345)
!354 = !DILocation(line: 27, column: 3, scope: !345)
!355 = distinct !DISubprogram(name: "strtoimax", scope: !356, file: !356, line: 324, type: !357, scopeLine: 326, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !363)
!356 = !DIFile(filename: "/usr/include/inttypes.h", directory: "")
!357 = !DISubroutineType(types: !358)
!358 = !{!359, !114, !362, !6}
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !360, line: 101, baseType: !361)
!360 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !165, line: 72, baseType: !166)
!362 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !7)
!363 = !{!364, !365, !366}
!364 = !DILocalVariable(name: "nptr", arg: 1, scope: !355, file: !356, line: 324, type: !114)
!365 = !DILocalVariable(name: "endptr", arg: 2, scope: !355, file: !356, line: 324, type: !362)
!366 = !DILocalVariable(name: "base", arg: 3, scope: !355, file: !356, line: 324, type: !6)
!367 = !DILocation(line: 0, scope: !355)
!368 = !DILocation(line: 327, column: 10, scope: !355)
!369 = !DILocation(line: 327, column: 3, scope: !355)
!370 = distinct !DISubprogram(name: "strtoumax", scope: !356, file: !356, line: 336, type: !371, scopeLine: 338, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !375)
!371 = !DISubroutineType(types: !372)
!372 = !{!373, !114, !362, !6}
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !360, line: 102, baseType: !374)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !165, line: 73, baseType: !65)
!375 = !{!376, !377, !378}
!376 = !DILocalVariable(name: "nptr", arg: 1, scope: !370, file: !356, line: 336, type: !114)
!377 = !DILocalVariable(name: "endptr", arg: 2, scope: !370, file: !356, line: 336, type: !362)
!378 = !DILocalVariable(name: "base", arg: 3, scope: !370, file: !356, line: 336, type: !6)
!379 = !DILocation(line: 0, scope: !370)
!380 = !DILocation(line: 339, column: 10, scope: !370)
!381 = !DILocation(line: 339, column: 3, scope: !370)
!382 = distinct !DISubprogram(name: "wcstoimax", scope: !356, file: !356, line: 348, type: !383, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !392)
!383 = !DISubroutineType(types: !384)
!384 = !{!359, !385, !389, !6}
!385 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !386)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gwchar_t", file: !356, line: 34, baseType: !6)
!389 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !390)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!392 = !{!393, !394, !395}
!393 = !DILocalVariable(name: "nptr", arg: 1, scope: !382, file: !356, line: 348, type: !385)
!394 = !DILocalVariable(name: "endptr", arg: 2, scope: !382, file: !356, line: 348, type: !389)
!395 = !DILocalVariable(name: "base", arg: 3, scope: !382, file: !356, line: 348, type: !6)
!396 = !DILocation(line: 0, scope: !382)
!397 = !DILocation(line: 351, column: 10, scope: !382)
!398 = !DILocation(line: 351, column: 3, scope: !382)
!399 = distinct !DISubprogram(name: "wcstoumax", scope: !356, file: !356, line: 362, type: !400, scopeLine: 364, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !402)
!400 = !DISubroutineType(types: !401)
!401 = !{!373, !385, !389, !6}
!402 = !{!403, !404, !405}
!403 = !DILocalVariable(name: "nptr", arg: 1, scope: !399, file: !356, line: 362, type: !385)
!404 = !DILocalVariable(name: "endptr", arg: 2, scope: !399, file: !356, line: 362, type: !389)
!405 = !DILocalVariable(name: "base", arg: 3, scope: !399, file: !356, line: 362, type: !6)
!406 = !DILocation(line: 0, scope: !399)
!407 = !DILocation(line: 365, column: 10, scope: !399)
!408 = !DILocation(line: 365, column: 3, scope: !399)
!409 = distinct !DISubprogram(name: "stat", scope: !410, file: !410, line: 453, type: !411, scopeLine: 454, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !450)
!410 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "")
!411 = !DISubroutineType(types: !412)
!412 = !{!6, !11, !413}
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !415, line: 46, size: 1152, elements: !416)
!415 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!416 = !{!417, !419, !421, !423, !425, !427, !429, !430, !431, !432, !434, !436, !444, !445, !446}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !414, file: !415, line: 48, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !165, line: 145, baseType: !65)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !414, file: !415, line: 53, baseType: !420, size: 64, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !165, line: 148, baseType: !65)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !414, file: !415, line: 61, baseType: !422, size: 64, offset: 128)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !165, line: 151, baseType: !65)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !414, file: !415, line: 62, baseType: !424, size: 32, offset: 192)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !165, line: 150, baseType: !47)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !414, file: !415, line: 64, baseType: !426, size: 32, offset: 224)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !165, line: 146, baseType: !47)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !414, file: !415, line: 65, baseType: !428, size: 32, offset: 256)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !165, line: 147, baseType: !47)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !414, file: !415, line: 67, baseType: !6, size: 32, offset: 288)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !414, file: !415, line: 69, baseType: !418, size: 64, offset: 320)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !414, file: !415, line: 74, baseType: !164, size: 64, offset: 384)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !414, file: !415, line: 78, baseType: !433, size: 64, offset: 448)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !165, line: 174, baseType: !166)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !414, file: !415, line: 80, baseType: !435, size: 64, offset: 512)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !165, line: 179, baseType: !166)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !414, file: !415, line: 91, baseType: !437, size: 128, offset: 576)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !438, line: 10, size: 128, elements: !439)
!438 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!439 = !{!440, !442}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !437, file: !438, line: 12, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !165, line: 160, baseType: !166)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !437, file: !438, line: 16, baseType: !443, size: 64, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !165, line: 196, baseType: !166)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !414, file: !415, line: 92, baseType: !437, size: 128, offset: 704)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !414, file: !415, line: 93, baseType: !437, size: 128, offset: 832)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !414, file: !415, line: 106, baseType: !447, size: 192, offset: 960)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !443, size: 192, elements: !448)
!448 = !{!449}
!449 = !DISubrange(count: 3)
!450 = !{!451, !452}
!451 = !DILocalVariable(name: "__path", arg: 1, scope: !409, file: !410, line: 453, type: !11)
!452 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !409, file: !410, line: 453, type: !413)
!453 = !DILocation(line: 0, scope: !409)
!454 = !DILocation(line: 455, column: 10, scope: !409)
!455 = !DILocation(line: 455, column: 3, scope: !409)
!456 = distinct !DISubprogram(name: "lstat", scope: !410, file: !410, line: 460, type: !411, scopeLine: 461, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !457)
!457 = !{!458, !459}
!458 = !DILocalVariable(name: "__path", arg: 1, scope: !456, file: !410, line: 460, type: !11)
!459 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !456, file: !410, line: 460, type: !413)
!460 = !DILocation(line: 0, scope: !456)
!461 = !DILocation(line: 462, column: 10, scope: !456)
!462 = !DILocation(line: 462, column: 3, scope: !456)
!463 = distinct !DISubprogram(name: "fstat", scope: !410, file: !410, line: 467, type: !464, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !466)
!464 = !DISubroutineType(types: !465)
!465 = !{!6, !6, !413}
!466 = !{!467, !468}
!467 = !DILocalVariable(name: "__fd", arg: 1, scope: !463, file: !410, line: 467, type: !6)
!468 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !463, file: !410, line: 467, type: !413)
!469 = !DILocation(line: 0, scope: !463)
!470 = !DILocation(line: 469, column: 10, scope: !463)
!471 = !DILocation(line: 469, column: 3, scope: !463)
!472 = distinct !DISubprogram(name: "fstatat", scope: !410, file: !410, line: 474, type: !473, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !475)
!473 = !DISubroutineType(types: !474)
!474 = !{!6, !6, !11, !413, !6}
!475 = !{!476, !477, !478, !479}
!476 = !DILocalVariable(name: "__fd", arg: 1, scope: !472, file: !410, line: 474, type: !6)
!477 = !DILocalVariable(name: "__filename", arg: 2, scope: !472, file: !410, line: 474, type: !11)
!478 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !472, file: !410, line: 474, type: !413)
!479 = !DILocalVariable(name: "__flag", arg: 4, scope: !472, file: !410, line: 474, type: !6)
!480 = !DILocation(line: 0, scope: !472)
!481 = !DILocation(line: 477, column: 10, scope: !472)
!482 = !DILocation(line: 477, column: 3, scope: !472)
!483 = distinct !DISubprogram(name: "mknod", scope: !410, file: !410, line: 483, type: !484, scopeLine: 484, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !486)
!484 = !DISubroutineType(types: !485)
!485 = !{!6, !11, !424, !418}
!486 = !{!487, !488, !489}
!487 = !DILocalVariable(name: "__path", arg: 1, scope: !483, file: !410, line: 483, type: !11)
!488 = !DILocalVariable(name: "__mode", arg: 2, scope: !483, file: !410, line: 483, type: !424)
!489 = !DILocalVariable(name: "__dev", arg: 3, scope: !483, file: !410, line: 483, type: !418)
!490 = !DILocation(line: 0, scope: !483)
!491 = !DILocation(line: 485, column: 10, scope: !483)
!492 = !DILocation(line: 485, column: 3, scope: !483)
!493 = distinct !DISubprogram(name: "mknodat", scope: !410, file: !410, line: 491, type: !494, scopeLine: 493, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !496)
!494 = !DISubroutineType(types: !495)
!495 = !{!6, !6, !11, !424, !418}
!496 = !{!497, !498, !499, !500}
!497 = !DILocalVariable(name: "__fd", arg: 1, scope: !493, file: !410, line: 491, type: !6)
!498 = !DILocalVariable(name: "__path", arg: 2, scope: !493, file: !410, line: 491, type: !11)
!499 = !DILocalVariable(name: "__mode", arg: 3, scope: !493, file: !410, line: 491, type: !424)
!500 = !DILocalVariable(name: "__dev", arg: 4, scope: !493, file: !410, line: 491, type: !418)
!501 = !DILocation(line: 0, scope: !493)
!502 = !DILocation(line: 494, column: 10, scope: !493)
!503 = !DILocation(line: 494, column: 3, scope: !493)
!504 = distinct !DISubprogram(name: "stat64", scope: !410, file: !410, line: 502, type: !505, scopeLine: 503, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !527)
!505 = !DISubroutineType(types: !506)
!506 = !{!6, !11, !507}
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !415, line: 119, size: 1152, elements: !509)
!509 = !{!510, !511, !513, !514, !515, !516, !517, !518, !519, !520, !521, !523, !524, !525, !526}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !508, file: !415, line: 121, baseType: !418, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !508, file: !415, line: 123, baseType: !512, size: 64, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !165, line: 149, baseType: !65)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !508, file: !415, line: 124, baseType: !422, size: 64, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !508, file: !415, line: 125, baseType: !424, size: 32, offset: 192)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !508, file: !415, line: 132, baseType: !426, size: 32, offset: 224)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !508, file: !415, line: 133, baseType: !428, size: 32, offset: 256)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !508, file: !415, line: 135, baseType: !6, size: 32, offset: 288)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !508, file: !415, line: 136, baseType: !418, size: 64, offset: 320)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !508, file: !415, line: 137, baseType: !164, size: 64, offset: 384)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !508, file: !415, line: 143, baseType: !433, size: 64, offset: 448)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !508, file: !415, line: 144, baseType: !522, size: 64, offset: 512)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !165, line: 180, baseType: !166)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !508, file: !415, line: 152, baseType: !437, size: 128, offset: 576)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !508, file: !415, line: 153, baseType: !437, size: 128, offset: 704)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !508, file: !415, line: 154, baseType: !437, size: 128, offset: 832)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !508, file: !415, line: 164, baseType: !447, size: 192, offset: 960)
!527 = !{!528, !529}
!528 = !DILocalVariable(name: "__path", arg: 1, scope: !504, file: !410, line: 502, type: !11)
!529 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !504, file: !410, line: 502, type: !507)
!530 = !DILocation(line: 0, scope: !504)
!531 = !DILocation(line: 504, column: 10, scope: !504)
!532 = !DILocation(line: 504, column: 3, scope: !504)
!533 = distinct !DISubprogram(name: "lstat64", scope: !410, file: !410, line: 509, type: !505, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !534)
!534 = !{!535, !536}
!535 = !DILocalVariable(name: "__path", arg: 1, scope: !533, file: !410, line: 509, type: !11)
!536 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !533, file: !410, line: 509, type: !507)
!537 = !DILocation(line: 0, scope: !533)
!538 = !DILocation(line: 511, column: 10, scope: !533)
!539 = !DILocation(line: 511, column: 3, scope: !533)
!540 = distinct !DISubprogram(name: "fstat64", scope: !410, file: !410, line: 516, type: !541, scopeLine: 517, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !543)
!541 = !DISubroutineType(types: !542)
!542 = !{!6, !6, !507}
!543 = !{!544, !545}
!544 = !DILocalVariable(name: "__fd", arg: 1, scope: !540, file: !410, line: 516, type: !6)
!545 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !540, file: !410, line: 516, type: !507)
!546 = !DILocation(line: 0, scope: !540)
!547 = !DILocation(line: 518, column: 10, scope: !540)
!548 = !DILocation(line: 518, column: 3, scope: !540)
!549 = distinct !DISubprogram(name: "fstatat64", scope: !410, file: !410, line: 523, type: !550, scopeLine: 525, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !552)
!550 = !DISubroutineType(types: !551)
!551 = !{!6, !6, !11, !507, !6}
!552 = !{!553, !554, !555, !556}
!553 = !DILocalVariable(name: "__fd", arg: 1, scope: !549, file: !410, line: 523, type: !6)
!554 = !DILocalVariable(name: "__filename", arg: 2, scope: !549, file: !410, line: 523, type: !11)
!555 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !549, file: !410, line: 523, type: !507)
!556 = !DILocalVariable(name: "__flag", arg: 4, scope: !549, file: !410, line: 523, type: !6)
!557 = !DILocation(line: 0, scope: !549)
!558 = !DILocation(line: 526, column: 10, scope: !549)
!559 = !DILocation(line: 526, column: 3, scope: !549)
!560 = distinct !DISubprogram(name: "dump_graph", scope: !1, file: !1, line: 33, type: !561, scopeLine: 34, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !563)
!561 = !DISubroutineType(types: !562)
!562 = !{null, !138, !13}
!563 = !{!564, !565, !566, !567}
!564 = !DILocalVariable(name: "f", arg: 1, scope: !560, file: !1, line: 33, type: !138)
!565 = !DILocalVariable(name: "g", arg: 2, scope: !560, file: !1, line: 33, type: !13)
!566 = !DILocalVariable(name: "i", scope: !560, file: !1, line: 35, type: !6)
!567 = !DILocalVariable(name: "e", scope: !560, file: !1, line: 36, type: !23)
!568 = !DILocation(line: 0, scope: !560)
!569 = !DILocation(line: 0, scope: !570)
!570 = distinct !DILexicalBlock(scope: !571, file: !1, line: 38, column: 3)
!571 = distinct !DILexicalBlock(scope: !560, file: !1, line: 38, column: 3)
!572 = !DILocation(line: 0, scope: !573)
!573 = distinct !DILexicalBlock(scope: !574, file: !1, line: 40, column: 11)
!574 = distinct !DILexicalBlock(scope: !570, file: !1, line: 39, column: 5)
!575 = !DILocation(line: 38, column: 8, scope: !571)
!576 = !DILocation(line: 0, scope: !571)
!577 = !DILocation(line: 38, column: 22, scope: !570)
!578 = !DILocation(line: 38, column: 17, scope: !570)
!579 = !DILocation(line: 38, column: 3, scope: !571)
!580 = !DILocation(line: 40, column: 15, scope: !573)
!581 = !DILocation(line: 40, column: 27, scope: !573)
!582 = !DILocation(line: 40, column: 12, scope: !573)
!583 = !DILocation(line: 41, column: 4, scope: !573)
!584 = !DILocation(line: 41, column: 23, scope: !573)
!585 = !DILocation(line: 41, column: 8, scope: !573)
!586 = !DILocation(line: 40, column: 11, scope: !574)
!587 = !DILocation(line: 44, column: 52, scope: !574)
!588 = !DILocation(line: 44, column: 7, scope: !574)
!589 = !DILocation(line: 45, column: 19, scope: !590)
!590 = distinct !DILexicalBlock(scope: !574, file: !1, line: 45, column: 7)
!591 = !DILocation(line: 45, column: 31, scope: !590)
!592 = !DILocation(line: 45, column: 12, scope: !590)
!593 = !DILocation(line: 0, scope: !590)
!594 = !DILocation(line: 45, column: 7, scope: !590)
!595 = !DILocation(line: 46, column: 24, scope: !596)
!596 = distinct !DILexicalBlock(scope: !590, file: !1, line: 45, column: 7)
!597 = !DILocation(line: 46, column: 2, scope: !596)
!598 = !DILocation(line: 45, column: 47, scope: !596)
!599 = !DILocation(line: 45, column: 7, scope: !596)
!600 = distinct !{!600, !594, !601}
!601 = !DILocation(line: 46, column: 27, scope: !590)
!602 = !DILocation(line: 47, column: 7, scope: !574)
!603 = !DILocation(line: 49, column: 7, scope: !574)
!604 = !DILocation(line: 50, column: 19, scope: !605)
!605 = distinct !DILexicalBlock(scope: !574, file: !1, line: 50, column: 7)
!606 = !DILocation(line: 50, column: 31, scope: !605)
!607 = !DILocation(line: 50, column: 12, scope: !605)
!608 = !DILocation(line: 0, scope: !605)
!609 = !DILocation(line: 50, column: 7, scope: !605)
!610 = !DILocation(line: 51, column: 24, scope: !611)
!611 = distinct !DILexicalBlock(scope: !605, file: !1, line: 50, column: 7)
!612 = !DILocation(line: 51, column: 2, scope: !611)
!613 = !DILocation(line: 50, column: 47, scope: !611)
!614 = !DILocation(line: 50, column: 7, scope: !611)
!615 = distinct !{!615, !609, !616}
!616 = !DILocation(line: 51, column: 28, scope: !605)
!617 = !DILocation(line: 52, column: 7, scope: !574)
!618 = !DILocation(line: 53, column: 5, scope: !574)
!619 = !DILocation(line: 38, column: 35, scope: !570)
!620 = !DILocation(line: 38, column: 3, scope: !570)
!621 = distinct !{!621, !579, !622}
!622 = !DILocation(line: 53, column: 5, scope: !571)
!623 = !DILocation(line: 54, column: 1, scope: !560)
!624 = distinct !DISubprogram(name: "new_graph", scope: !1, file: !1, line: 59, type: !625, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !627)
!625 = !DISubroutineType(types: !626)
!626 = !{!13, !6}
!627 = !{!628, !629}
!628 = !DILocalVariable(name: "n_vertices", arg: 1, scope: !624, file: !1, line: 59, type: !6)
!629 = !DILocalVariable(name: "g", scope: !624, file: !1, line: 61, type: !13)
!630 = !DILocation(line: 0, scope: !624)
!631 = !DILocation(line: 61, column: 21, scope: !624)
!632 = !DILocation(line: 63, column: 6, scope: !624)
!633 = !DILocation(line: 63, column: 17, scope: !624)
!634 = !DILocation(line: 64, column: 17, scope: !624)
!635 = !DILocation(line: 64, column: 6, scope: !624)
!636 = !DILocation(line: 64, column: 15, scope: !624)
!637 = !DILocation(line: 66, column: 3, scope: !624)
!638 = distinct !DISubprogram(name: "add_edge", scope: !1, file: !1, line: 72, type: !639, scopeLine: 73, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !641)
!639 = !DISubroutineType(types: !640)
!640 = !{!23, !13, !6, !6}
!641 = !{!642, !643, !644, !645, !646, !647}
!642 = !DILocalVariable(name: "g", arg: 1, scope: !638, file: !1, line: 72, type: !13)
!643 = !DILocalVariable(name: "f", arg: 2, scope: !638, file: !1, line: 72, type: !6)
!644 = !DILocalVariable(name: "t", arg: 3, scope: !638, file: !1, line: 72, type: !6)
!645 = !DILocalVariable(name: "e", scope: !638, file: !1, line: 74, type: !23)
!646 = !DILocalVariable(name: "vf", scope: !638, file: !1, line: 75, type: !19)
!647 = !DILocalVariable(name: "vt", scope: !638, file: !1, line: 75, type: !19)
!648 = !DILocation(line: 0, scope: !638)
!649 = !DILocation(line: 74, column: 26, scope: !638)
!650 = !DILocation(line: 75, column: 27, scope: !638)
!651 = !DILocation(line: 75, column: 24, scope: !638)
!652 = !DILocation(line: 75, column: 47, scope: !638)
!653 = !DILocation(line: 78, column: 6, scope: !638)
!654 = !DILocation(line: 78, column: 10, scope: !638)
!655 = !DILocation(line: 79, column: 6, scope: !638)
!656 = !DILocation(line: 79, column: 11, scope: !638)
!657 = !DILocation(line: 81, column: 22, scope: !638)
!658 = !DILocation(line: 81, column: 6, scope: !638)
!659 = !DILocation(line: 81, column: 16, scope: !638)
!660 = !DILocation(line: 82, column: 12, scope: !638)
!661 = !DILocation(line: 84, column: 22, scope: !638)
!662 = !DILocation(line: 84, column: 6, scope: !638)
!663 = !DILocation(line: 84, column: 16, scope: !638)
!664 = !DILocation(line: 85, column: 12, scope: !638)
!665 = !DILocation(line: 87, column: 3, scope: !638)
!666 = distinct !DISubprogram(name: "identify_vertices", scope: !1, file: !1, line: 93, type: !667, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !669)
!667 = !DISubroutineType(types: !668)
!668 = !{null, !13, !6, !6}
!669 = !{!670, !671, !672, !673, !674, !675, !676}
!670 = !DILocalVariable(name: "g", arg: 1, scope: !666, file: !1, line: 93, type: !13)
!671 = !DILocalVariable(name: "v", arg: 2, scope: !666, file: !1, line: 93, type: !6)
!672 = !DILocalVariable(name: "u", arg: 3, scope: !666, file: !1, line: 93, type: !6)
!673 = !DILocalVariable(name: "vv", scope: !666, file: !1, line: 95, type: !19)
!674 = !DILocalVariable(name: "uu", scope: !666, file: !1, line: 96, type: !19)
!675 = !DILocalVariable(name: "e", scope: !666, file: !1, line: 97, type: !23)
!676 = !DILocalVariable(name: "next", scope: !666, file: !1, line: 97, type: !23)
!677 = !DILocation(line: 0, scope: !666)
!678 = !DILocation(line: 95, column: 27, scope: !666)
!679 = !DILocation(line: 95, column: 24, scope: !666)
!680 = !DILocation(line: 96, column: 24, scope: !666)
!681 = !DILocation(line: 99, column: 16, scope: !682)
!682 = distinct !DILexicalBlock(scope: !666, file: !1, line: 99, column: 3)
!683 = !DILocation(line: 0, scope: !684)
!684 = distinct !DILexicalBlock(scope: !685, file: !1, line: 100, column: 5)
!685 = distinct !DILexicalBlock(scope: !682, file: !1, line: 99, column: 3)
!686 = !DILocation(line: 99, column: 8, scope: !682)
!687 = !DILocation(line: 0, scope: !682)
!688 = !DILocation(line: 99, column: 3, scope: !682)
!689 = !DILocation(line: 101, column: 17, scope: !684)
!690 = !DILocation(line: 103, column: 10, scope: !684)
!691 = !DILocation(line: 103, column: 14, scope: !684)
!692 = !DILocation(line: 104, column: 26, scope: !684)
!693 = !DILocation(line: 104, column: 20, scope: !684)
!694 = !DILocation(line: 105, column: 16, scope: !684)
!695 = !DILocation(line: 99, column: 3, scope: !685)
!696 = distinct !{!696, !688, !697}
!697 = !DILocation(line: 106, column: 5, scope: !682)
!698 = !DILocation(line: 107, column: 12, scope: !666)
!699 = !DILocation(line: 109, column: 16, scope: !700)
!700 = distinct !DILexicalBlock(scope: !666, file: !1, line: 109, column: 3)
!701 = !DILocation(line: 0, scope: !702)
!702 = distinct !DILexicalBlock(scope: !703, file: !1, line: 110, column: 5)
!703 = distinct !DILexicalBlock(scope: !700, file: !1, line: 109, column: 3)
!704 = !DILocation(line: 109, column: 8, scope: !700)
!705 = !DILocation(line: 0, scope: !700)
!706 = !DILocation(line: 109, column: 3, scope: !700)
!707 = !DILocation(line: 111, column: 17, scope: !702)
!708 = !DILocation(line: 113, column: 10, scope: !702)
!709 = !DILocation(line: 113, column: 15, scope: !702)
!710 = !DILocation(line: 114, column: 26, scope: !702)
!711 = !DILocation(line: 114, column: 20, scope: !702)
!712 = !DILocation(line: 115, column: 16, scope: !702)
!713 = !DILocation(line: 109, column: 3, scope: !703)
!714 = distinct !{!714, !706, !715}
!715 = !DILocation(line: 116, column: 5, scope: !700)
!716 = !DILocation(line: 117, column: 12, scope: !666)
!717 = !DILocation(line: 118, column: 1, scope: !666)
!718 = distinct !DISubprogram(name: "graphds_dfs", scope: !1, file: !1, line: 190, type: !719, scopeLine: 192, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !783)
!719 = !DISubroutineType(types: !720)
!720 = !{!6, !13, !90, !6, !721, !5, !722}
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !723, line: 47, baseType: !724)
!723 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !726, line: 75, size: 256, elements: !727)
!726 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!727 = !{!728, !742, !743, !744}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !725, file: !726, line: 76, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !726, line: 68, baseType: !731)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !726, line: 63, size: 320, elements: !732)
!732 = !{!733, !735, !736, !737}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !731, file: !726, line: 64, baseType: !734, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !731, file: !726, line: 65, baseType: !734, size: 64, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !731, file: !726, line: 66, baseType: !47, size: 32, offset: 128)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !731, file: !726, line: 67, baseType: !738, size: 128, offset: 192)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !739, size: 128, elements: !740)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !726, line: 29, baseType: !65)
!740 = !{!741}
!741 = !DISubrange(count: 2)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !725, file: !726, line: 77, baseType: !729, size: 64, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !725, file: !726, line: 78, baseType: !47, size: 32, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !725, file: !726, line: 79, baseType: !745, size: 64, offset: 192)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !726, line: 49, baseType: !747)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !726, line: 45, size: 832, elements: !748)
!748 = !{!749, !750, !751}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !747, file: !726, line: 46, baseType: !734, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !747, file: !726, line: 47, baseType: !724, size: 64, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !747, file: !726, line: 48, baseType: !752, size: 704, offset: 128)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !753, line: 164, size: 704, elements: !754)
!753 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!754 = !{!755, !756, !766, !767, !768, !769, !770, !771, !775, !779, !780, !781, !782}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !752, file: !753, line: 166, baseType: !166, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !752, file: !753, line: 167, baseType: !757, size: 64, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !753, line: 157, size: 192, elements: !759)
!759 = !{!760, !761, !762}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !758, file: !753, line: 159, baseType: !8, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !758, file: !753, line: 160, baseType: !757, size: 64, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !758, file: !753, line: 161, baseType: !763, size: 32, offset: 128)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 32, elements: !764)
!764 = !{!765}
!765 = !DISubrange(count: 4)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !752, file: !753, line: 168, baseType: !8, size: 64, offset: 128)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !752, file: !753, line: 169, baseType: !8, size: 64, offset: 192)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !752, file: !753, line: 170, baseType: !8, size: 64, offset: 256)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !752, file: !753, line: 171, baseType: !166, size: 64, offset: 320)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !752, file: !753, line: 172, baseType: !6, size: 32, offset: 384)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !752, file: !753, line: 176, baseType: !772, size: 64, offset: 448)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{!757, !10, !166}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !752, file: !753, line: 177, baseType: !776, size: 64, offset: 512)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DISubroutineType(types: !778)
!778 = !{null, !10, !757}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !752, file: !753, line: 178, baseType: !10, size: 64, offset: 576)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !752, file: !753, line: 179, baseType: !47, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !752, file: !753, line: 180, baseType: !47, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !752, file: !753, line: 184, baseType: !47, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!783 = !{!784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !805}
!784 = !DILocalVariable(name: "g", arg: 1, scope: !718, file: !1, line: 190, type: !13)
!785 = !DILocalVariable(name: "qs", arg: 2, scope: !718, file: !1, line: 190, type: !90)
!786 = !DILocalVariable(name: "nq", arg: 3, scope: !718, file: !1, line: 190, type: !6)
!787 = !DILocalVariable(name: "qt", arg: 4, scope: !718, file: !1, line: 190, type: !721)
!788 = !DILocalVariable(name: "forward", arg: 5, scope: !718, file: !1, line: 191, type: !5)
!789 = !DILocalVariable(name: "subgraph", arg: 6, scope: !718, file: !1, line: 191, type: !722)
!790 = !DILocalVariable(name: "i", scope: !718, file: !1, line: 193, type: !6)
!791 = !DILocalVariable(name: "tick", scope: !718, file: !1, line: 193, type: !6)
!792 = !DILocalVariable(name: "v", scope: !718, file: !1, line: 193, type: !6)
!793 = !DILocalVariable(name: "comp", scope: !718, file: !1, line: 193, type: !6)
!794 = !DILocalVariable(name: "top", scope: !718, file: !1, line: 193, type: !6)
!795 = !DILocalVariable(name: "e", scope: !718, file: !1, line: 194, type: !23)
!796 = !DILocalVariable(name: "stack", scope: !718, file: !1, line: 195, type: !89)
!797 = !DILocalVariable(name: "bi", scope: !718, file: !1, line: 196, type: !798)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_iterator", file: !726, line: 218, baseType: !799)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !726, line: 203, size: 256, elements: !800)
!800 = !{!801, !802, !803, !804}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "elt1", scope: !799, file: !726, line: 206, baseType: !729, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "elt2", scope: !799, file: !726, line: 209, baseType: !729, size: 64, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "word_no", scope: !799, file: !726, line: 212, baseType: !47, size: 32, offset: 128)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !799, file: !726, line: 217, baseType: !739, size: 64, offset: 192)
!805 = !DILocalVariable(name: "av", scope: !718, file: !1, line: 197, type: !47)
!806 = !DILocation(line: 0, scope: !718)
!807 = !DILocation(line: 195, column: 31, scope: !718)
!808 = !DILocation(line: 196, column: 3, scope: !718)
!809 = !DILocation(line: 197, column: 3, scope: !718)
!810 = !DILocation(line: 199, column: 7, scope: !811)
!811 = distinct !DILexicalBlock(scope: !718, file: !1, line: 199, column: 7)
!812 = !DILocation(line: 199, column: 7, scope: !718)
!813 = !DILocation(line: 0, scope: !814)
!814 = distinct !DILexicalBlock(scope: !815, file: !1, line: 210, column: 2)
!815 = distinct !DILexicalBlock(scope: !816, file: !1, line: 209, column: 7)
!816 = distinct !DILexicalBlock(scope: !817, file: !1, line: 209, column: 7)
!817 = distinct !DILexicalBlock(scope: !811, file: !1, line: 208, column: 5)
!818 = !DILocation(line: 209, column: 7, scope: !816)
!819 = !DILocation(line: 201, column: 7, scope: !820)
!820 = distinct !DILexicalBlock(scope: !821, file: !1, line: 201, column: 7)
!821 = distinct !DILexicalBlock(scope: !811, file: !1, line: 200, column: 5)
!822 = !DILocation(line: 0, scope: !823)
!823 = distinct !DILexicalBlock(scope: !824, file: !1, line: 202, column: 2)
!824 = distinct !DILexicalBlock(scope: !820, file: !1, line: 201, column: 7)
!825 = !DILocation(line: 201, column: 7, scope: !824)
!826 = !DILocation(line: 203, column: 7, scope: !823)
!827 = !DILocation(line: 203, column: 16, scope: !823)
!828 = !DILocation(line: 203, column: 4, scope: !823)
!829 = !DILocation(line: 203, column: 20, scope: !823)
!830 = !DILocation(line: 203, column: 30, scope: !823)
!831 = !DILocation(line: 204, column: 7, scope: !823)
!832 = !DILocation(line: 204, column: 16, scope: !823)
!833 = !DILocation(line: 204, column: 4, scope: !823)
!834 = !DILocation(line: 204, column: 20, scope: !823)
!835 = !DILocation(line: 204, column: 25, scope: !823)
!836 = distinct !{!836, !819, !837}
!837 = !DILocation(line: 205, column: 2, scope: !820)
!838 = !DILocation(line: 0, scope: !816)
!839 = !DILocation(line: 209, column: 26, scope: !815)
!840 = !DILocation(line: 209, column: 21, scope: !815)
!841 = !DILocation(line: 211, column: 7, scope: !814)
!842 = !DILocation(line: 211, column: 19, scope: !814)
!843 = !DILocation(line: 211, column: 29, scope: !814)
!844 = !DILocation(line: 212, column: 7, scope: !814)
!845 = !DILocation(line: 212, column: 19, scope: !814)
!846 = !DILocation(line: 212, column: 24, scope: !814)
!847 = !DILocation(line: 209, column: 39, scope: !815)
!848 = !DILocation(line: 209, column: 7, scope: !815)
!849 = distinct !{!849, !818, !850}
!850 = !DILocation(line: 213, column: 2, scope: !816)
!851 = !DILocation(line: 216, column: 8, scope: !852)
!852 = distinct !DILexicalBlock(scope: !718, file: !1, line: 216, column: 3)
!853 = !DILocation(line: 0, scope: !854)
!854 = distinct !DILexicalBlock(scope: !855, file: !1, line: 219, column: 11)
!855 = distinct !DILexicalBlock(scope: !856, file: !1, line: 217, column: 5)
!856 = distinct !DILexicalBlock(scope: !852, file: !1, line: 216, column: 3)
!857 = !DILocation(line: 0, scope: !858)
!858 = distinct !DILexicalBlock(scope: !859, file: !1, line: 238, column: 12)
!859 = distinct !DILexicalBlock(scope: !860, file: !1, line: 237, column: 6)
!860 = distinct !DILexicalBlock(scope: !861, file: !1, line: 236, column: 8)
!861 = distinct !DILexicalBlock(scope: !855, file: !1, line: 227, column: 2)
!862 = !DILocation(line: 0, scope: !852)
!863 = !DILocation(line: 193, column: 10, scope: !718)
!864 = !DILocation(line: 193, column: 23, scope: !718)
!865 = !DILocation(line: 216, column: 17, scope: !856)
!866 = !DILocation(line: 216, column: 3, scope: !852)
!867 = !DILocation(line: 218, column: 11, scope: !855)
!868 = !DILocation(line: 219, column: 14, scope: !854)
!869 = !DILocation(line: 219, column: 11, scope: !854)
!870 = !DILocation(line: 219, column: 26, scope: !854)
