; ModuleID = 'graph.bc'
source_filename = "graph.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }

!317 = !DIEnumerator(name: "DECL_EXPR", value: 132, isUnsigned: true)
!318 = !DIEnumerator(name: "LABEL_EXPR", value: 133, isUnsigned: true)
!319 = !DIEnumerator(name: "GOTO_EXPR", value: 134, isUnsigned: true)
!320 = !DIEnumerator(name: "RETURN_EXPR", value: 135, isUnsigned: true)
!321 = !DIEnumerator(name: "EXIT_EXPR", value: 136, isUnsigned: true)
!322 = !DIEnumerator(name: "LOOP_EXPR", value: 137, isUnsigned: true)
!323 = !DIEnumerator(name: "SWITCH_EXPR", value: 138, isUnsigned: true)
!324 = !DIEnumerator(name: "CASE_LABEL_EXPR", value: 139, isUnsigned: true)
!325 = !DIEnumerator(name: "ASM_EXPR", value: 140, isUnsigned: true)
!326 = !DIEnumerator(name: "SSA_NAME", value: 141, isUnsigned: true)
!327 = !DIEnumerator(name: "CATCH_EXPR", value: 142, isUnsigned: true)
!328 = !DIEnumerator(name: "EH_FILTER_EXPR", value: 143, isUnsigned: true)
!329 = !DIEnumerator(name: "SCEV_KNOWN", value: 144, isUnsigned: true)
!330 = !DIEnumerator(name: "SCEV_NOT_KNOWN", value: 145, isUnsigned: true)
!331 = !DIEnumerator(name: "POLYNOMIAL_CHREC", value: 146, isUnsigned: true)
!332 = !DIEnumerator(name: "STATEMENT_LIST", value: 147, isUnsigned: true)
!333 = !DIEnumerator(name: "ASSERT_EXPR", value: 148, isUnsigned: true)
!334 = !DIEnumerator(name: "TREE_BINFO", value: 149, isUnsigned: true)
!335 = !DIEnumerator(name: "WITH_SIZE_EXPR", value: 150, isUnsigned: true)
!336 = !DIEnumerator(name: "REALIGN_LOAD_EXPR", value: 151, isUnsigned: true)
!337 = !DIEnumerator(name: "TARGET_MEM_REF", value: 152, isUnsigned: true)
!338 = !DIEnumerator(name: "OMP_PARALLEL", value: 153, isUnsigned: true)
!339 = !DIEnumerator(name: "OMP_TASK", value: 154, isUnsigned: true)
!340 = !DIEnumerator(name: "OMP_FOR", value: 155, isUnsigned: true)
!341 = !DIEnumerator(name: "OMP_SECTIONS", value: 156, isUnsigned: true)
!342 = !DIEnumerator(name: "OMP_SINGLE", value: 157, isUnsigned: true)
!343 = !DIEnumerator(name: "OMP_SECTION", value: 158, isUnsigned: true)
!344 = !DIEnumerator(name: "OMP_MASTER", value: 159, isUnsigned: true)
!345 = !DIEnumerator(name: "OMP_ORDERED", value: 160, isUnsigned: true)
!346 = !DIEnumerator(name: "OMP_CRITICAL", value: 161, isUnsigned: true)
!347 = !DIEnumerator(name: "OMP_ATOMIC", value: 162, isUnsigned: true)
!348 = !DIEnumerator(name: "OMP_CLAUSE", value: 163, isUnsigned: true)
!349 = !DIEnumerator(name: "REDUC_MAX_EXPR", value: 164, isUnsigned: true)
!350 = !DIEnumerator(name: "REDUC_MIN_EXPR", value: 165, isUnsigned: true)
!351 = !DIEnumerator(name: "REDUC_PLUS_EXPR", value: 166, isUnsigned: true)
!352 = !DIEnumerator(name: "DOT_PROD_EXPR", value: 167, isUnsigned: true)
!353 = !DIEnumerator(name: "WIDEN_SUM_EXPR", value: 168, isUnsigned: true)
!354 = !DIEnumerator(name: "WIDEN_MULT_EXPR", value: 169, isUnsigned: true)
!355 = !DIEnumerator(name: "VEC_LSHIFT_EXPR", value: 170, isUnsigned: true)
!356 = !DIEnumerator(name: "VEC_RSHIFT_EXPR", value: 171, isUnsigned: true)
!357 = !DIEnumerator(name: "VEC_WIDEN_MULT_HI_EXPR", value: 172, isUnsigned: true)
!358 = !DIEnumerator(name: "VEC_WIDEN_MULT_LO_EXPR", value: 173, isUnsigned: true)
!359 = !DIEnumerator(name: "VEC_UNPACK_HI_EXPR", value: 174, isUnsigned: true)
!360 = !DIEnumerator(name: "VEC_UNPACK_LO_EXPR", value: 175, isUnsigned: true)
!361 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_HI_EXPR", value: 176, isUnsigned: true)
!362 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_LO_EXPR", value: 177, isUnsigned: true)
!363 = !DIEnumerator(name: "VEC_PACK_TRUNC_EXPR", value: 178, isUnsigned: true)
!364 = !DIEnumerator(name: "VEC_PACK_SAT_EXPR", value: 179, isUnsigned: true)
!365 = !DIEnumerator(name: "VEC_PACK_FIX_TRUNC_EXPR", value: 180, isUnsigned: true)
!366 = !DIEnumerator(name: "VEC_EXTRACT_EVEN_EXPR", value: 181, isUnsigned: true)
!367 = !DIEnumerator(name: "VEC_EXTRACT_ODD_EXPR", value: 182, isUnsigned: true)
!368 = !DIEnumerator(name: "VEC_INTERLEAVE_HIGH_EXPR", value: 183, isUnsigned: true)
!369 = !DIEnumerator(name: "VEC_INTERLEAVE_LOW_EXPR", value: 184, isUnsigned: true)
!370 = !DIEnumerator(name: "PREDICT_EXPR", value: 185, isUnsigned: true)
!371 = !DIEnumerator(name: "OPTIMIZATION_NODE", value: 186, isUnsigned: true)
!372 = !DIEnumerator(name: "TARGET_OPTION_NODE", value: 187, isUnsigned: true)
!373 = !DIEnumerator(name: "LAST_AND_UNUSED_TREE_CODE", value: 188, isUnsigned: true)
!374 = !DIEnumerator(name: "C_MAYBE_CONST_EXPR", value: 189, isUnsigned: true)
!375 = !DIEnumerator(name: "EXCESS_PRECISION_EXPR", value: 190, isUnsigned: true)
!376 = !DIEnumerator(name: "MAX_TREE_CODES", value: 191, isUnsigned: true)
!377 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "bb_state", scope: !378, file: !3, line: 246, baseType: !7, size: 32, elements: !1553)
!378 = distinct !DISubprogram(name: "print_rtl_graph_with_bb", scope: !3, file: !3, line: 224, type: !379, scopeLine: 225, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1459)
!379 = !DISubroutineType(types: !380)
!380 = !{null, !381, !384}
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !383)
!383 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !385, line: 50, baseType: !386)
!385 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !388, line: 240, size: 384, elements: !389)
!388 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!389 = !{!390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !387, file: !388, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !387, file: !388, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !387, file: !388, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !387, file: !388, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !387, file: !388, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !387, file: !388, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !387, file: !388, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !387, file: !388, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !387, file: !388, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !387, file: !388, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !387, file: !388, line: 321, baseType: !401, size: 320, offset: 64)
!401 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !388, line: 315, size: 320, elements: !402)
!402 = !{!403, !1394, !1396, !1457, !1458}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !401, file: !388, line: 316, baseType: !404, size: 64)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !405, size: 64, elements: !421)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !388, line: 183, baseType: !406)
!406 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !388, line: 166, size: 64, elements: !407)
!407 = !{!408, !410, !411, !412, !413, !423, !424, !436, !439, !503, !1372, !1373, !1384, !1391}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !406, file: !388, line: 168, baseType: !409, size: 32)
!409 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !406, file: !388, line: 169, baseType: !7, size: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !406, file: !388, line: 170, baseType: !381, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !406, file: !388, line: 171, baseType: !384, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !406, file: !388, line: 172, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !385, line: 53, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !388, line: 359, size: 128, elements: !417)
!417 = !{!418, !419}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !416, file: !388, line: 360, baseType: !409, size: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !416, file: !388, line: 361, baseType: !420, size: 64, offset: 64)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 64, elements: !421)
!421 = !{!422}
!422 = !DISubrange(count: 1)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !406, file: !388, line: 173, baseType: !5, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !406, file: !388, line: 174, baseType: !425, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !388, line: 133, baseType: !426)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !388, line: 115, size: 32, elements: !427)
!427 = !{!428, !429, !430, !431, !432, !433, !434, !435}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !426, file: !388, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !426, file: !388, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !426, file: !388, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !426, file: !388, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !426, file: !388, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !426, file: !388, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !426, file: !388, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !426, file: !388, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !406, file: !388, line: 175, baseType: !437, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !388, line: 175, flags: DIFlagFwdDecl)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !406, file: !388, line: 176, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !442, line: 75, size: 256, elements: !443)
!442 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!443 = !{!444, !459, !460, !461}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !441, file: !442, line: 76, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !442, line: 68, baseType: !447)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !442, line: 63, size: 320, elements: !448)
!448 = !{!449, !451, !452, !453}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !447, file: !442, line: 64, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !447, file: !442, line: 65, baseType: !450, size: 64, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !447, file: !442, line: 66, baseType: !7, size: 32, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !447, file: !442, line: 67, baseType: !454, size: 128, offset: 192)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !455, size: 128, elements: !457)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !442, line: 29, baseType: !456)
!456 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!457 = !{!458}
!458 = !DISubrange(count: 2)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !441, file: !442, line: 77, baseType: !445, size: 64, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !441, file: !442, line: 78, baseType: !7, size: 32, offset: 128)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !441, file: !442, line: 79, baseType: !462, size: 64, offset: 192)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !442, line: 49, baseType: !464)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !442, line: 45, size: 832, elements: !465)
!465 = !{!466, !467, !468}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !464, file: !442, line: 46, baseType: !450, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !464, file: !442, line: 47, baseType: !440, size: 64, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !464, file: !442, line: 48, baseType: !469, size: 704, offset: 128)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !470, line: 164, size: 704, elements: !471)
!470 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!471 = !{!472, !474, !485, !486, !487, !488, !489, !490, !495, !499, !500, !501, !502}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !469, file: !470, line: 166, baseType: !473, size: 64)
!473 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !469, file: !470, line: 167, baseType: !475, size: 64, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !470, line: 157, size: 192, elements: !477)
!477 = !{!478, !480, !481}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !476, file: !470, line: 159, baseType: !479, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !476, file: !470, line: 160, baseType: !475, size: 64, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !476, file: !470, line: 161, baseType: !482, size: 32, offset: 128)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !383, size: 32, elements: !483)
!483 = !{!484}
!484 = !DISubrange(count: 4)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !469, file: !470, line: 168, baseType: !479, size: 64, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !469, file: !470, line: 169, baseType: !479, size: 64, offset: 192)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !469, file: !470, line: 170, baseType: !479, size: 64, offset: 256)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !469, file: !470, line: 171, baseType: !473, size: 64, offset: 320)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !469, file: !470, line: 172, baseType: !409, size: 32, offset: 384)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !469, file: !470, line: 176, baseType: !491, size: 64, offset: 448)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{!475, !494, !473}
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !469, file: !470, line: 177, baseType: !496, size: 64, offset: 512)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DISubroutineType(types: !498)
!498 = !{null, !494, !475}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !469, file: !470, line: 178, baseType: !494, size: 64, offset: 576)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !469, file: !470, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !469, file: !470, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !469, file: !470, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !406, file: !388, line: 177, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !385, line: 56, baseType: !505)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !151, line: 3371, size: 1792, elements: !507)
!507 = !{!508, !541, !547, !558, !577, !588, !593, !600, !606, !620, !632, !670, !675, !703, !711, !712, !717, !726, !732, !737, !741, !745, !996, !1045, !1051, !1058, !1065, !1091, !1116, !1133, !1145, !1167, !1182, !1354}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !506, file: !151, line: 3372, baseType: !509, size: 64)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !151, line: 360, size: 64, elements: !510)
!510 = !{!511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !509, file: !151, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !509, file: !151, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !509, file: !151, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !509, file: !151, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !509, file: !151, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !509, file: !151, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !509, file: !151, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !509, file: !151, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !509, file: !151, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !509, file: !151, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !509, file: !151, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !509, file: !151, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !509, file: !151, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !509, file: !151, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !509, file: !151, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !509, file: !151, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !509, file: !151, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !509, file: !151, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !509, file: !151, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !509, file: !151, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !509, file: !151, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !509, file: !151, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !509, file: !151, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !509, file: !151, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !509, file: !151, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !509, file: !151, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !509, file: !151, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !509, file: !151, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !509, file: !151, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !509, file: !151, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !506, file: !151, line: 3373, baseType: !542, size: 192)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !151, line: 402, size: 192, elements: !543)
!543 = !{!544, !545, !546}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !542, file: !151, line: 403, baseType: !509, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !542, file: !151, line: 404, baseType: !504, size: 64, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !542, file: !151, line: 405, baseType: !504, size: 64, offset: 128)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !506, file: !151, line: 3374, baseType: !548, size: 320)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !151, line: 1384, size: 320, elements: !549)
!549 = !{!550, !551}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !548, file: !151, line: 1385, baseType: !542, size: 192)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !548, file: !151, line: 1386, baseType: !552, size: 128, offset: 192)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !553, line: 58, baseType: !554)
!553 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !553, line: 54, size: 128, elements: !555)
!555 = !{!556, !557}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !554, file: !553, line: 56, baseType: !456, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !554, file: !553, line: 57, baseType: !473, size: 64, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !506, file: !151, line: 3375, baseType: !559, size: 256)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !151, line: 1397, size: 256, elements: !560)
!560 = !{!561, !562}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !559, file: !151, line: 1398, baseType: !542, size: 192)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !559, file: !151, line: 1399, baseType: !563, size: 64, offset: 192)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !565, line: 52, size: 256, elements: !566)
!565 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!566 = !{!567, !568, !569, !570, !571, !572, !573}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !564, file: !565, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !564, file: !565, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !564, file: !565, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !564, file: !565, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !564, file: !565, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !564, file: !565, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !564, file: !565, line: 62, baseType: !574, size: 192, offset: 64)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !456, size: 192, elements: !575)
!575 = !{!576}
!576 = !DISubrange(count: 3)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !506, file: !151, line: 3376, baseType: !578, size: 256)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !151, line: 1408, size: 256, elements: !579)
!579 = !{!580, !581}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !578, file: !151, line: 1409, baseType: !542, size: 192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !578, file: !151, line: 1410, baseType: !582, size: 64, offset: 192)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !584, line: 27, size: 192, elements: !585)
!584 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!585 = !{!586, !587}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !583, file: !584, line: 29, baseType: !552, size: 128)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !583, file: !584, line: 30, baseType: !5, size: 32, offset: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !506, file: !151, line: 3377, baseType: !589, size: 256)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !151, line: 1437, size: 256, elements: !590)
!590 = !{!591, !592}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !589, file: !151, line: 1438, baseType: !542, size: 192)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !589, file: !151, line: 1439, baseType: !504, size: 64, offset: 192)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !506, file: !151, line: 3378, baseType: !594, size: 256)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !151, line: 1418, size: 256, elements: !595)
!595 = !{!596, !597, !598}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !594, file: !151, line: 1419, baseType: !542, size: 192)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !594, file: !151, line: 1420, baseType: !409, size: 32, offset: 192)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !594, file: !151, line: 1421, baseType: !599, size: 8, offset: 224)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !383, size: 8, elements: !421)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !506, file: !151, line: 3379, baseType: !601, size: 320)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !151, line: 1428, size: 320, elements: !602)
!602 = !{!603, !604, !605}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !601, file: !151, line: 1429, baseType: !542, size: 192)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !601, file: !151, line: 1430, baseType: !504, size: 64, offset: 192)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !601, file: !151, line: 1431, baseType: !504, size: 64, offset: 256)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !506, file: !151, line: 3380, baseType: !607, size: 320)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !151, line: 1460, size: 320, elements: !608)
!608 = !{!609, !610}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !607, file: !151, line: 1461, baseType: !542, size: 192)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !607, file: !151, line: 1462, baseType: !611, size: 128, offset: 192)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !612, line: 31, size: 128, elements: !613)
!612 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!613 = !{!614, !618, !619}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !611, file: !612, line: 32, baseType: !615, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !617)
!617 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !611, file: !612, line: 33, baseType: !7, size: 32, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !611, file: !612, line: 34, baseType: !7, size: 32, offset: 96)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !506, file: !151, line: 3381, baseType: !621, size: 384)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !151, line: 2507, size: 384, elements: !622)
!622 = !{!623, !624, !629, !630, !631}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !621, file: !151, line: 2508, baseType: !542, size: 192)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !621, file: !151, line: 2509, baseType: !625, size: 32, offset: 192)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !626, line: 58, baseType: !627)
!626 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !628, line: 44, baseType: !7)
!628 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!629 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !621, file: !151, line: 2510, baseType: !7, size: 32, offset: 224)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !621, file: !151, line: 2511, baseType: !504, size: 64, offset: 256)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !621, file: !151, line: 2512, baseType: !504, size: 64, offset: 320)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !506, file: !151, line: 3382, baseType: !633, size: 896)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !151, line: 2652, size: 896, elements: !634)
!634 = !{!635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !633, file: !151, line: 2653, baseType: !621, size: 384)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !633, file: !151, line: 2654, baseType: !504, size: 64, offset: 384)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !633, file: !151, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !633, file: !151, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !633, file: !151, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !633, file: !151, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !633, file: !151, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !633, file: !151, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !633, file: !151, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !633, file: !151, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !633, file: !151, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !633, file: !151, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !633, file: !151, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !633, file: !151, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !633, file: !151, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !633, file: !151, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !633, file: !151, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !633, file: !151, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !633, file: !151, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !633, file: !151, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !633, file: !151, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !633, file: !151, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !633, file: !151, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !633, file: !151, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !633, file: !151, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !633, file: !151, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !633, file: !151, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !633, file: !151, line: 2703, baseType: !7, size: 32, offset: 512)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !633, file: !151, line: 2705, baseType: !504, size: 64, offset: 576)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !633, file: !151, line: 2706, baseType: !504, size: 64, offset: 640)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !633, file: !151, line: 2707, baseType: !504, size: 64, offset: 704)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !633, file: !151, line: 2708, baseType: !504, size: 64, offset: 768)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !633, file: !151, line: 2711, baseType: !668, size: 64, offset: 832)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !151, line: 2711, flags: DIFlagFwdDecl)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !506, file: !151, line: 3383, baseType: !671, size: 960)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !151, line: 2756, size: 960, elements: !672)
!672 = !{!673, !674}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !671, file: !151, line: 2757, baseType: !633, size: 896)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !671, file: !151, line: 2758, baseType: !384, size: 64, offset: 896)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !506, file: !151, line: 3384, baseType: !676, size: 1472)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !151, line: 3114, size: 1472, elements: !677)
!677 = !{!678, !699, !700, !701, !702}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !676, file: !151, line: 3115, baseType: !679, size: 1216)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !151, line: 2984, size: 1216, elements: !680)
!680 = !{!681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !679, file: !151, line: 2985, baseType: !671, size: 960)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !679, file: !151, line: 2986, baseType: !504, size: 64, offset: 960)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !679, file: !151, line: 2987, baseType: !504, size: 64, offset: 1024)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !679, file: !151, line: 2988, baseType: !504, size: 64, offset: 1088)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !679, file: !151, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !679, file: !151, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !679, file: !151, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !679, file: !151, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !679, file: !151, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !679, file: !151, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !679, file: !151, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !679, file: !151, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !679, file: !151, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !679, file: !151, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !679, file: !151, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !679, file: !151, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !679, file: !151, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !679, file: !151, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !676, file: !151, line: 3117, baseType: !504, size: 64, offset: 1216)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !676, file: !151, line: 3119, baseType: !504, size: 64, offset: 1280)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !676, file: !151, line: 3121, baseType: !504, size: 64, offset: 1344)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !676, file: !151, line: 3123, baseType: !504, size: 64, offset: 1408)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !506, file: !151, line: 3385, baseType: !704, size: 1088)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !151, line: 2874, size: 1088, elements: !705)
!705 = !{!706, !707, !708}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !704, file: !151, line: 2875, baseType: !671, size: 960)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !704, file: !151, line: 2876, baseType: !384, size: 64, offset: 960)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !704, file: !151, line: 2877, baseType: !709, size: 64, offset: 1024)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !151, line: 2856, flags: DIFlagFwdDecl)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !506, file: !151, line: 3386, baseType: !679, size: 1216)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !506, file: !151, line: 3387, baseType: !713, size: 1280)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !151, line: 3093, size: 1280, elements: !714)
!714 = !{!715, !716}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !713, file: !151, line: 3094, baseType: !679, size: 1216)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !713, file: !151, line: 3095, baseType: !709, size: 64, offset: 1216)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !506, file: !151, line: 3388, baseType: !718, size: 1216)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !151, line: 2824, size: 1216, elements: !719)
!719 = !{!720, !721, !722, !723, !724, !725}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !718, file: !151, line: 2825, baseType: !633, size: 896)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !718, file: !151, line: 2827, baseType: !504, size: 64, offset: 896)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !718, file: !151, line: 2828, baseType: !504, size: 64, offset: 960)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !718, file: !151, line: 2829, baseType: !504, size: 64, offset: 1024)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !718, file: !151, line: 2830, baseType: !504, size: 64, offset: 1088)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !718, file: !151, line: 2831, baseType: !504, size: 64, offset: 1152)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !506, file: !151, line: 3389, baseType: !727, size: 1024)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !151, line: 2850, size: 1024, elements: !728)
!728 = !{!729, !730, !731}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !727, file: !151, line: 2851, baseType: !671, size: 960)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !727, file: !151, line: 2852, baseType: !409, size: 32, offset: 960)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !727, file: !151, line: 2853, baseType: !409, size: 32, offset: 992)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !506, file: !151, line: 3390, baseType: !733, size: 1024)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !151, line: 2857, size: 1024, elements: !734)
!734 = !{!735, !736}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !733, file: !151, line: 2858, baseType: !671, size: 960)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !733, file: !151, line: 2859, baseType: !709, size: 64, offset: 960)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !506, file: !151, line: 3391, baseType: !738, size: 960)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !151, line: 2862, size: 960, elements: !739)
!739 = !{!740}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !738, file: !151, line: 2863, baseType: !671, size: 960)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !506, file: !151, line: 3392, baseType: !742, size: 1472)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !151, line: 3304, size: 1472, elements: !743)
!743 = !{!744}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !742, file: !151, line: 3305, baseType: !676, size: 1472)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !506, file: !151, line: 3393, baseType: !746, size: 1792)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !151, line: 3248, size: 1792, elements: !747)
!747 = !{!748, !749, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !746, file: !151, line: 3249, baseType: !676, size: 1472)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !746, file: !151, line: 3251, baseType: !750, size: 64, offset: 1472)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !752, line: 463, size: 1152, elements: !753)
!752 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!753 = !{!754, !757, !861, !862, !865, !868, !920, !921, !922, !923, !924, !948, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !751, file: !752, line: 464, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !752, line: 464, flags: DIFlagFwdDecl)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !751, file: !752, line: 467, baseType: !758, size: 64, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !135, line: 374, size: 640, elements: !760)
!760 = !{!761, !836, !837, !850, !851, !852, !853, !854, !855, !857, !859, !860}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !759, file: !135, line: 377, baseType: !762, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !385, line: 111, baseType: !763)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !135, line: 217, size: 832, elements: !765)
!765 = !{!766, !801, !802, !803, !806, !810, !811, !812, !830, !831, !832, !833, !834, !835}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !764, file: !135, line: 219, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !135, line: 151, baseType: !769)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !135, line: 151, size: 128, elements: !770)
!770 = !{!771}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !769, file: !135, line: 151, baseType: !772, size: 128)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !135, line: 150, baseType: !773)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !135, line: 150, size: 128, elements: !774)
!774 = !{!775, !776, !777}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !773, file: !135, line: 150, baseType: !7, size: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !773, file: !135, line: 150, baseType: !7, size: 32, offset: 32)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !773, file: !135, line: 150, baseType: !778, size: 64, offset: 64)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !779, size: 64, elements: !421)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !385, line: 108, baseType: !780)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !135, line: 122, size: 512, elements: !782)
!782 = !{!783, !784, !785, !793, !794, !795, !796, !797, !798, !799}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !781, file: !135, line: 124, baseType: !763, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !781, file: !135, line: 125, baseType: !763, size: 64, offset: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !781, file: !135, line: 131, baseType: !786, size: 64, offset: 128)
!786 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !135, line: 128, size: 64, elements: !787)
!787 = !{!788, !792}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !786, file: !135, line: 129, baseType: !789, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !385, line: 66, baseType: !790)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !385, line: 65, flags: DIFlagFwdDecl)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !786, file: !135, line: 130, baseType: !384, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !781, file: !135, line: 134, baseType: !494, size: 64, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !781, file: !135, line: 137, baseType: !504, size: 64, offset: 256)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !781, file: !135, line: 138, baseType: !625, size: 32, offset: 320)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !781, file: !135, line: 142, baseType: !7, size: 32, offset: 352)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !781, file: !135, line: 144, baseType: !409, size: 32, offset: 384)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !781, file: !135, line: 145, baseType: !409, size: 32, offset: 416)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !781, file: !135, line: 146, baseType: !800, size: 64, offset: 448)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !135, line: 119, baseType: !473)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !764, file: !135, line: 220, baseType: !767, size: 64, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !764, file: !135, line: 223, baseType: !494, size: 64, offset: 128)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !764, file: !135, line: 226, baseType: !804, size: 64, offset: 192)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !135, line: 185, flags: DIFlagFwdDecl)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !764, file: !135, line: 229, baseType: !807, size: 128, offset: 256)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !808, size: 128, elements: !457)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !135, line: 229, flags: DIFlagFwdDecl)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !764, file: !135, line: 232, baseType: !763, size: 64, offset: 384)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !764, file: !135, line: 233, baseType: !763, size: 64, offset: 448)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !764, file: !135, line: 238, baseType: !813, size: 64, offset: 512)
!813 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !135, line: 235, size: 64, elements: !814)
!814 = !{!815, !821}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !813, file: !135, line: 236, baseType: !816, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !135, line: 273, size: 128, elements: !818)
!818 = !{!819, !820}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !817, file: !135, line: 275, baseType: !789, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !817, file: !135, line: 278, baseType: !789, size: 64, offset: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !813, file: !135, line: 237, baseType: !822, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !135, line: 259, size: 320, elements: !824)
!824 = !{!825, !826, !827, !828, !829}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !823, file: !135, line: 261, baseType: !384, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !823, file: !135, line: 262, baseType: !384, size: 64, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !823, file: !135, line: 266, baseType: !384, size: 64, offset: 128)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !823, file: !135, line: 267, baseType: !384, size: 64, offset: 192)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !823, file: !135, line: 270, baseType: !409, size: 32, offset: 256)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !764, file: !135, line: 241, baseType: !800, size: 64, offset: 576)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !764, file: !135, line: 244, baseType: !409, size: 32, offset: 640)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !764, file: !135, line: 247, baseType: !409, size: 32, offset: 672)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !764, file: !135, line: 250, baseType: !409, size: 32, offset: 704)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !764, file: !135, line: 253, baseType: !409, size: 32, offset: 736)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !764, file: !135, line: 256, baseType: !409, size: 32, offset: 768)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !759, file: !135, line: 378, baseType: !762, size: 64, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !759, file: !135, line: 381, baseType: !838, size: 64, offset: 128)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !135, line: 282, baseType: !840)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !135, line: 282, size: 128, elements: !841)
!841 = !{!842}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !840, file: !135, line: 282, baseType: !843, size: 128)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !135, line: 281, baseType: !844)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !135, line: 281, size: 128, elements: !845)
!845 = !{!846, !847, !848}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !844, file: !135, line: 281, baseType: !7, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !844, file: !135, line: 281, baseType: !7, size: 32, offset: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !844, file: !135, line: 281, baseType: !849, size: 64, offset: 64)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !762, size: 64, elements: !421)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !759, file: !135, line: 384, baseType: !409, size: 32, offset: 192)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !759, file: !135, line: 387, baseType: !409, size: 32, offset: 224)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !759, file: !135, line: 390, baseType: !409, size: 32, offset: 256)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !759, file: !135, line: 394, baseType: !838, size: 64, offset: 320)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !759, file: !135, line: 396, baseType: !134, size: 32, offset: 384)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !759, file: !135, line: 399, baseType: !856, size: 64, offset: 416)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 64, elements: !457)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !759, file: !135, line: 402, baseType: !858, size: 64, offset: 480)
!858 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !457)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !759, file: !135, line: 406, baseType: !409, size: 32, offset: 544)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !759, file: !135, line: 409, baseType: !409, size: 32, offset: 576)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !751, file: !752, line: 470, baseType: !790, size: 64, offset: 128)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !751, file: !752, line: 473, baseType: !863, size: 64, offset: 192)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !752, line: 166, flags: DIFlagFwdDecl)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !751, file: !752, line: 476, baseType: !866, size: 64, offset: 256)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !752, line: 476, flags: DIFlagFwdDecl)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !751, file: !752, line: 479, baseType: !869, size: 64, offset: 320)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !870, line: 144, baseType: !871)
!870 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !870, line: 100, size: 896, elements: !873)
!873 = !{!874, !882, !887, !892, !894, !897, !898, !899, !900, !901, !906, !908, !909, !914, !919}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !872, file: !870, line: 102, baseType: !875, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !870, line: 52, baseType: !876)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DISubroutineType(types: !878)
!878 = !{!879, !880}
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !870, line: 47, baseType: !7)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !872, file: !870, line: 105, baseType: !883, size: 64, offset: 64)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !870, line: 59, baseType: !884)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DISubroutineType(types: !886)
!886 = !{!409, !880, !880}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !872, file: !870, line: 108, baseType: !888, size: 64, offset: 128)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !870, line: 63, baseType: !889)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DISubroutineType(types: !891)
!891 = !{null, !494}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !872, file: !870, line: 111, baseType: !893, size: 64, offset: 192)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !872, file: !870, line: 114, baseType: !895, size: 64, offset: 256)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !896, line: 46, baseType: !456)
!896 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!897 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !872, file: !870, line: 117, baseType: !895, size: 64, offset: 320)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !872, file: !870, line: 120, baseType: !895, size: 64, offset: 384)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !872, file: !870, line: 124, baseType: !7, size: 32, offset: 448)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !872, file: !870, line: 128, baseType: !7, size: 32, offset: 480)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !872, file: !870, line: 131, baseType: !902, size: 64, offset: 512)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !870, line: 75, baseType: !903)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DISubroutineType(types: !905)
!905 = !{!494, !895, !895}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !872, file: !870, line: 132, baseType: !907, size: 64, offset: 576)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !870, line: 78, baseType: !889)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !872, file: !870, line: 135, baseType: !494, size: 64, offset: 640)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !872, file: !870, line: 136, baseType: !910, size: 64, offset: 704)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !870, line: 82, baseType: !911)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DISubroutineType(types: !913)
!913 = !{!494, !494, !895, !895}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !872, file: !870, line: 137, baseType: !915, size: 64, offset: 768)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !870, line: 83, baseType: !916)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{null, !494, !494}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !872, file: !870, line: 141, baseType: !7, size: 32, offset: 832)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !751, file: !752, line: 484, baseType: !504, size: 64, offset: 384)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !751, file: !752, line: 488, baseType: !504, size: 64, offset: 448)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !751, file: !752, line: 493, baseType: !504, size: 64, offset: 512)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !751, file: !752, line: 496, baseType: !504, size: 64, offset: 576)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !751, file: !752, line: 501, baseType: !925, size: 64, offset: 640)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !146, line: 2355, size: 576, elements: !927)
!927 = !{!928, !931, !932, !933, !934, !936, !937, !942, !943, !944, !945, !946, !947}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !926, file: !146, line: 2356, baseType: !929, size: 64)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !146, line: 2356, flags: DIFlagFwdDecl)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !926, file: !146, line: 2357, baseType: !381, size: 64, offset: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !926, file: !146, line: 2358, baseType: !409, size: 32, offset: 128)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !926, file: !146, line: 2359, baseType: !409, size: 32, offset: 160)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !926, file: !146, line: 2360, baseType: !935, size: 128, offset: 192)
!935 = !DICompositeType(tag: DW_TAG_array_type, baseType: !409, size: 128, elements: !483)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !926, file: !146, line: 2364, baseType: !409, size: 32, offset: 320)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !926, file: !146, line: 2367, baseType: !938, size: 128, offset: 384)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !146, line: 2349, size: 128, elements: !939)
!939 = !{!940, !941}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !938, file: !146, line: 2351, baseType: !384, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !938, file: !146, line: 2352, baseType: !473, size: 64, offset: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !926, file: !146, line: 2371, baseType: !145, size: 32, offset: 512)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !926, file: !146, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !926, file: !146, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !926, file: !146, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !926, file: !146, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !926, file: !146, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !751, file: !752, line: 504, baseType: !949, size: 64, offset: 704)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !752, line: 504, flags: DIFlagFwdDecl)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !751, file: !752, line: 507, baseType: !869, size: 64, offset: 768)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !751, file: !752, line: 510, baseType: !409, size: 32, offset: 832)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !751, file: !752, line: 513, baseType: !409, size: 32, offset: 864)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !751, file: !752, line: 516, baseType: !625, size: 32, offset: 896)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !751, file: !752, line: 519, baseType: !625, size: 32, offset: 928)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !751, file: !752, line: 522, baseType: !7, size: 32, offset: 960)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !751, file: !752, line: 523, baseType: !7, size: 32, offset: 992)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !751, file: !752, line: 528, baseType: !381, size: 64, offset: 1024)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !751, file: !752, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !751, file: !752, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !751, file: !752, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !751, file: !752, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !751, file: !752, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !751, file: !752, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !751, file: !752, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !751, file: !752, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !751, file: !752, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !751, file: !752, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !751, file: !752, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !751, file: !752, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !751, file: !752, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !751, file: !752, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !751, file: !752, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !751, file: !752, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !746, file: !151, line: 3254, baseType: !504, size: 64, offset: 1536)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !746, file: !151, line: 3257, baseType: !504, size: 64, offset: 1600)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !746, file: !151, line: 3258, baseType: !504, size: 64, offset: 1664)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !746, file: !151, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !746, file: !151, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !746, file: !151, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !746, file: !151, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !746, file: !151, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !746, file: !151, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !746, file: !151, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !746, file: !151, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !746, file: !151, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !746, file: !151, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !746, file: !151, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !746, file: !151, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !746, file: !151, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !746, file: !151, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !746, file: !151, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !746, file: !151, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !746, file: !151, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !746, file: !151, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !506, file: !151, line: 3394, baseType: !997, size: 1344)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !151, line: 2279, size: 1344, elements: !998)
!998 = !{!999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1024, !1025, !1026, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !997, file: !151, line: 2280, baseType: !542, size: 192)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !997, file: !151, line: 2281, baseType: !504, size: 64, offset: 192)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !997, file: !151, line: 2282, baseType: !504, size: 64, offset: 256)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !997, file: !151, line: 2283, baseType: !504, size: 64, offset: 320)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !997, file: !151, line: 2284, baseType: !504, size: 64, offset: 384)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !997, file: !151, line: 2285, baseType: !7, size: 32, offset: 448)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !997, file: !151, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !997, file: !151, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !997, file: !151, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !997, file: !151, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !997, file: !151, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !997, file: !151, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !997, file: !151, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !997, file: !151, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !997, file: !151, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !997, file: !151, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !997, file: !151, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !997, file: !151, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !997, file: !151, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !997, file: !151, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !997, file: !151, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !997, file: !151, line: 2305, baseType: !7, size: 32, offset: 512)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !997, file: !151, line: 2306, baseType: !1022, size: 32, offset: 544)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1023, line: 31, baseType: !409)
!1023 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !997, file: !151, line: 2307, baseType: !504, size: 64, offset: 576)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !997, file: !151, line: 2308, baseType: !504, size: 64, offset: 640)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !997, file: !151, line: 2314, baseType: !1027, size: 64, offset: 704)
!1027 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !151, line: 2309, size: 64, elements: !1028)
!1028 = !{!1029, !1030, !1031}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1027, file: !151, line: 2310, baseType: !409, size: 32)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1027, file: !151, line: 2311, baseType: !381, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1027, file: !151, line: 2312, baseType: !1032, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !151, line: 2277, flags: DIFlagFwdDecl)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !997, file: !151, line: 2315, baseType: !504, size: 64, offset: 768)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !997, file: !151, line: 2316, baseType: !504, size: 64, offset: 832)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !997, file: !151, line: 2317, baseType: !504, size: 64, offset: 896)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !997, file: !151, line: 2318, baseType: !504, size: 64, offset: 960)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !997, file: !151, line: 2319, baseType: !504, size: 64, offset: 1024)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !997, file: !151, line: 2320, baseType: !504, size: 64, offset: 1088)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !997, file: !151, line: 2321, baseType: !504, size: 64, offset: 1152)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !997, file: !151, line: 2322, baseType: !504, size: 64, offset: 1216)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !997, file: !151, line: 2324, baseType: !1043, size: 64, offset: 1280)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !151, line: 2324, flags: DIFlagFwdDecl)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !506, file: !151, line: 3395, baseType: !1046, size: 320)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !151, line: 1469, size: 320, elements: !1047)
!1047 = !{!1048, !1049, !1050}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1046, file: !151, line: 1470, baseType: !542, size: 192)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1046, file: !151, line: 1471, baseType: !504, size: 64, offset: 192)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1046, file: !151, line: 1472, baseType: !504, size: 64, offset: 256)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !506, file: !151, line: 3396, baseType: !1052, size: 320)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !151, line: 1482, size: 320, elements: !1053)
!1053 = !{!1054, !1055, !1056}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1052, file: !151, line: 1483, baseType: !542, size: 192)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1052, file: !151, line: 1484, baseType: !409, size: 32, offset: 192)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1052, file: !151, line: 1485, baseType: !1057, size: 64, offset: 256)
!1057 = !DICompositeType(tag: DW_TAG_array_type, baseType: !504, size: 64, elements: !421)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !506, file: !151, line: 3397, baseType: !1059, size: 384)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !151, line: 1829, size: 384, elements: !1060)
!1060 = !{!1061, !1062, !1063, !1064}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1059, file: !151, line: 1830, baseType: !542, size: 192)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1059, file: !151, line: 1831, baseType: !625, size: 32, offset: 192)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1059, file: !151, line: 1832, baseType: !504, size: 64, offset: 256)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1059, file: !151, line: 1835, baseType: !1057, size: 64, offset: 320)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !506, file: !151, line: 3398, baseType: !1066, size: 704)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !151, line: 1898, size: 704, elements: !1067)
!1067 = !{!1068, !1069, !1070, !1074, !1075, !1078}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1066, file: !151, line: 1899, baseType: !542, size: 192)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1066, file: !151, line: 1902, baseType: !504, size: 64, offset: 192)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1066, file: !151, line: 1905, baseType: !1071, size: 64, offset: 256)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !385, line: 58, baseType: !1072)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !385, line: 57, flags: DIFlagFwdDecl)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1066, file: !151, line: 1908, baseType: !7, size: 32, offset: 320)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1066, file: !151, line: 1911, baseType: !1076, size: 64, offset: 384)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !151, line: 1876, flags: DIFlagFwdDecl)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1066, file: !151, line: 1914, baseType: !1079, size: 256, offset: 448)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !151, line: 1883, size: 256, elements: !1080)
!1080 = !{!1081, !1083, !1084, !1089}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1079, file: !151, line: 1884, baseType: !1082, size: 64)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1079, file: !151, line: 1885, baseType: !1082, size: 64, offset: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1079, file: !151, line: 1891, baseType: !1085, size: 64, offset: 128)
!1085 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1079, file: !151, line: 1891, size: 64, elements: !1086)
!1086 = !{!1087, !1088}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1085, file: !151, line: 1891, baseType: !1071, size: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1085, file: !151, line: 1891, baseType: !504, size: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1079, file: !151, line: 1892, baseType: !1090, size: 64, offset: 192)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !506, file: !151, line: 3399, baseType: !1092, size: 704)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !151, line: 2008, size: 704, elements: !1093)
!1093 = !{!1094, !1095, !1096, !1097, !1098, !1099, !1111, !1112, !1113, !1114, !1115}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1092, file: !151, line: 2009, baseType: !542, size: 192)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1092, file: !151, line: 2011, baseType: !7, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !1092, file: !151, line: 2012, baseType: !7, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1092, file: !151, line: 2014, baseType: !625, size: 32, offset: 224)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1092, file: !151, line: 2016, baseType: !504, size: 64, offset: 256)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !1092, file: !151, line: 2017, baseType: !1100, size: 64, offset: 320)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64)
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !151, line: 183, baseType: !1102)
!1102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !151, line: 183, size: 128, elements: !1103)
!1103 = !{!1104}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1102, file: !151, line: 183, baseType: !1105, size: 128)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !151, line: 182, baseType: !1106)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !151, line: 182, size: 128, elements: !1107)
!1107 = !{!1108, !1109, !1110}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1106, file: !151, line: 182, baseType: !7, size: 32)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1106, file: !151, line: 182, baseType: !7, size: 32, offset: 32)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1106, file: !151, line: 182, baseType: !1057, size: 64, offset: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !1092, file: !151, line: 2019, baseType: !504, size: 64, offset: 384)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !1092, file: !151, line: 2020, baseType: !504, size: 64, offset: 448)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1092, file: !151, line: 2021, baseType: !504, size: 64, offset: 512)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !1092, file: !151, line: 2022, baseType: !504, size: 64, offset: 576)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !1092, file: !151, line: 2023, baseType: !504, size: 64, offset: 640)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !506, file: !151, line: 3400, baseType: !1117, size: 832)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !151, line: 2430, size: 832, elements: !1118)
!1118 = !{!1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1117, file: !151, line: 2431, baseType: !542, size: 192)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1117, file: !151, line: 2433, baseType: !504, size: 64, offset: 192)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !1117, file: !151, line: 2434, baseType: !504, size: 64, offset: 256)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !1117, file: !151, line: 2435, baseType: !504, size: 64, offset: 320)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !1117, file: !151, line: 2436, baseType: !504, size: 64, offset: 384)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "base_accesses", scope: !1117, file: !151, line: 2437, baseType: !1100, size: 64, offset: 448)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "inheritance", scope: !1117, file: !151, line: 2438, baseType: !504, size: 64, offset: 512)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_subvtt", scope: !1117, file: !151, line: 2440, baseType: !504, size: 64, offset: 576)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_vptr", scope: !1117, file: !151, line: 2441, baseType: !504, size: 64, offset: 640)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "base_binfos", scope: !1117, file: !151, line: 2443, baseType: !1129, size: 128, offset: 704)
