; ModuleID = 'gtype-desc.bc'
source_filename = "gtype-desc.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

!625 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!626 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!627 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!628 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!629 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!630 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!631 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!632 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!633 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!634 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!635 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!636 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!637 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_code", file: !611, line: 51, baseType: !7, size: 32, elements: !638)
!638 = !{!639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674}
!639 = !DIEnumerator(name: "GIMPLE_ERROR_MARK", value: 0, isUnsigned: true)
!640 = !DIEnumerator(name: "GIMPLE_COND", value: 1, isUnsigned: true)
!641 = !DIEnumerator(name: "GIMPLE_DEBUG", value: 2, isUnsigned: true)
!642 = !DIEnumerator(name: "GIMPLE_GOTO", value: 3, isUnsigned: true)
!643 = !DIEnumerator(name: "GIMPLE_LABEL", value: 4, isUnsigned: true)
!644 = !DIEnumerator(name: "GIMPLE_SWITCH", value: 5, isUnsigned: true)
!645 = !DIEnumerator(name: "GIMPLE_ASSIGN", value: 6, isUnsigned: true)
!646 = !DIEnumerator(name: "GIMPLE_ASM", value: 7, isUnsigned: true)
!647 = !DIEnumerator(name: "GIMPLE_CALL", value: 8, isUnsigned: true)
!648 = !DIEnumerator(name: "GIMPLE_RETURN", value: 9, isUnsigned: true)
!649 = !DIEnumerator(name: "GIMPLE_BIND", value: 10, isUnsigned: true)
!650 = !DIEnumerator(name: "GIMPLE_CATCH", value: 11, isUnsigned: true)
!651 = !DIEnumerator(name: "GIMPLE_EH_FILTER", value: 12, isUnsigned: true)
!652 = !DIEnumerator(name: "GIMPLE_EH_MUST_NOT_THROW", value: 13, isUnsigned: true)
!653 = !DIEnumerator(name: "GIMPLE_RESX", value: 14, isUnsigned: true)
!654 = !DIEnumerator(name: "GIMPLE_EH_DISPATCH", value: 15, isUnsigned: true)
!655 = !DIEnumerator(name: "GIMPLE_PHI", value: 16, isUnsigned: true)
!656 = !DIEnumerator(name: "GIMPLE_TRY", value: 17, isUnsigned: true)
!657 = !DIEnumerator(name: "GIMPLE_NOP", value: 18, isUnsigned: true)
!658 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!659 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!660 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!661 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!662 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!663 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!664 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!665 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!666 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!667 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!668 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!669 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!670 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!671 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!672 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!673 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!674 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!675 = !{!676, !677, !678, !679, !682, !683, !685, !1199, !1768, !2229, !2230, !2235, !2236, !1553, !1574, !1538, !2237, !2243, !2249, !2264, !2276, !2438, !2443, !2299, !2444, !2405, !2294, !2445, !1334, !1340, !2446, !932, !940, !2447, !1269, !1315, !1307, !2448, !1779, !1692, !1533, !2453, !1724, !2467, !2481, !947, !2487, !2497, !2502, !1978, !1478, !2508, !1937, !2559, !2560, !2576, !2577, !1528, !790, !771, !2578, !1385, !2579, !2580, !2581, !966, !1792, !1017, !1034, !1049, !1044, !2582, !1054, !912, !885, !454, !2583, !680, !956, !2584, !709, !2655, !2657, !2658, !2659, !2688, !1615, !2700, !2605, !2727}
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!678 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !681)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_ipa_edge_args_t_gc", file: !6, line: 317, size: 192, elements: !687)
!687 = !{!688}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !686, file: !6, line: 317, baseType: !689, size: 192)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_ipa_edge_args_t_base", file: !6, line: 316, baseType: !690)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_ipa_edge_args_t_base", file: !6, line: 316, size: 192, elements: !691)
!691 = !{!692, !693, !694}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !690, file: !6, line: 316, baseType: !7, size: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !690, file: !6, line: 316, baseType: !7, size: 32, offset: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !690, file: !6, line: 316, baseType: !695, size: 128, offset: 64)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !696, size: 128, elements: !808)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipa_edge_args_t", file: !6, line: 279, baseType: !697)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipa_edge_args", file: !6, line: 271, size: 128, elements: !698)
!698 = !{!699, !700}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "argument_count", scope: !697, file: !6, line: 276, baseType: !678, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "jump_functions", scope: !697, file: !6, line: 278, baseType: !701, size: 64, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipa_jump_func", file: !6, line: 114, size: 256, elements: !703)
!703 = !{!704, !705}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !702, file: !6, line: 116, baseType: !5, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !702, file: !6, line: 126, baseType: !706, size: 192, offset: 64)
!706 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "jump_func_value", file: !6, line: 120, size: 192, elements: !707)
!707 = !{!708, !2212, !2218, !2224}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "constant", scope: !706, file: !6, line: 122, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !710, line: 56, baseType: !711)
!710 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !143, line: 3371, size: 1792, elements: !713)
!713 = !{!714, !747, !753, !766, !785, !796, !801, !810, !816, !829, !841, !879, !1444, !1472, !1489, !1490, !1495, !1504, !1510, !1515, !1519, !1523, !1863, !1910, !1916, !1922, !1929, !1942, !1956, !1973, !1985, !2007, !2022, !2194}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !712, file: !143, line: 3372, baseType: !715, size: 64)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !143, line: 360, size: 64, elements: !716)
!716 = !{!717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !715, file: !143, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !715, file: !143, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !715, file: !143, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !715, file: !143, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !715, file: !143, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !715, file: !143, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !715, file: !143, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !715, file: !143, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !715, file: !143, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !715, file: !143, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !715, file: !143, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !715, file: !143, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !715, file: !143, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !715, file: !143, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !715, file: !143, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !715, file: !143, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !715, file: !143, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !715, file: !143, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !715, file: !143, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !715, file: !143, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !715, file: !143, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !715, file: !143, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !715, file: !143, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !715, file: !143, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !715, file: !143, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !715, file: !143, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !715, file: !143, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !715, file: !143, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !715, file: !143, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !715, file: !143, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !712, file: !143, line: 3373, baseType: !748, size: 192)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !143, line: 402, size: 192, elements: !749)
!749 = !{!750, !751, !752}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !748, file: !143, line: 403, baseType: !715, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !748, file: !143, line: 404, baseType: !709, size: 64, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !748, file: !143, line: 405, baseType: !709, size: 64, offset: 128)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !712, file: !143, line: 3374, baseType: !754, size: 320)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !143, line: 1384, size: 320, elements: !755)
!755 = !{!756, !757}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !754, file: !143, line: 1385, baseType: !748, size: 192)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !754, file: !143, line: 1386, baseType: !758, size: 128, offset: 192)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !759, line: 58, baseType: !760)
!759 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !759, line: 54, size: 128, elements: !761)
!761 = !{!762, !764}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !760, file: !759, line: 56, baseType: !763, size: 64)
!763 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !760, file: !759, line: 57, baseType: !765, size: 64, offset: 64)
!765 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !712, file: !143, line: 3375, baseType: !767, size: 256)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !143, line: 1397, size: 256, elements: !768)
!768 = !{!769, !770}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !767, file: !143, line: 1398, baseType: !748, size: 192)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !767, file: !143, line: 1399, baseType: !771, size: 64, offset: 192)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !773, line: 52, size: 256, elements: !774)
!773 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!774 = !{!775, !776, !777, !778, !779, !780, !781}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !772, file: !773, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !772, file: !773, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !772, file: !773, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !772, file: !773, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !772, file: !773, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !772, file: !773, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !772, file: !773, line: 62, baseType: !782, size: 192, offset: 64)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !763, size: 192, elements: !783)
!783 = !{!784}
!784 = !DISubrange(count: 3)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !712, file: !143, line: 3376, baseType: !786, size: 256)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !143, line: 1408, size: 256, elements: !787)
!787 = !{!788, !789}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !786, file: !143, line: 1409, baseType: !748, size: 192)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !786, file: !143, line: 1410, baseType: !790, size: 64, offset: 192)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !792, line: 27, size: 192, elements: !793)
!792 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!793 = !{!794, !795}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !791, file: !792, line: 29, baseType: !758, size: 128)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !791, file: !792, line: 30, baseType: !14, size: 32, offset: 128)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !712, file: !143, line: 3377, baseType: !797, size: 256)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !143, line: 1437, size: 256, elements: !798)
!798 = !{!799, !800}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !797, file: !143, line: 1438, baseType: !748, size: 192)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !797, file: !143, line: 1439, baseType: !709, size: 64, offset: 192)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !712, file: !143, line: 3378, baseType: !802, size: 256)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !143, line: 1418, size: 256, elements: !803)
!803 = !{!804, !805, !806}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !802, file: !143, line: 1419, baseType: !748, size: 192)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !802, file: !143, line: 1420, baseType: !678, size: 32, offset: 192)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !802, file: !143, line: 1421, baseType: !807, size: 8, offset: 224)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !681, size: 8, elements: !808)
!808 = !{!809}
!809 = !DISubrange(count: 1)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !712, file: !143, line: 3379, baseType: !811, size: 320)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !143, line: 1428, size: 320, elements: !812)
!812 = !{!813, !814, !815}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !811, file: !143, line: 1429, baseType: !748, size: 192)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !811, file: !143, line: 1430, baseType: !709, size: 64, offset: 192)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !811, file: !143, line: 1431, baseType: !709, size: 64, offset: 256)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !712, file: !143, line: 3380, baseType: !817, size: 320)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !143, line: 1460, size: 320, elements: !818)
!818 = !{!819, !820}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !817, file: !143, line: 1461, baseType: !748, size: 192)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !817, file: !143, line: 1462, baseType: !821, size: 128, offset: 192)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !822, line: 31, size: 128, elements: !823)
!822 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!823 = !{!824, !827, !828}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !821, file: !822, line: 32, baseType: !825, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !677)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !821, file: !822, line: 33, baseType: !7, size: 32, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !821, file: !822, line: 34, baseType: !7, size: 32, offset: 96)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !712, file: !143, line: 3381, baseType: !830, size: 384)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !143, line: 2507, size: 384, elements: !831)
!831 = !{!832, !833, !838, !839, !840}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !830, file: !143, line: 2508, baseType: !748, size: 192)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !830, file: !143, line: 2509, baseType: !834, size: 32, offset: 192)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !835, line: 58, baseType: !836)
!835 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !837, line: 44, baseType: !7)
!837 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!838 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !830, file: !143, line: 2510, baseType: !7, size: 32, offset: 224)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !830, file: !143, line: 2511, baseType: !709, size: 64, offset: 256)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !830, file: !143, line: 2512, baseType: !709, size: 64, offset: 320)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !712, file: !143, line: 3382, baseType: !842, size: 896)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !143, line: 2652, size: 896, elements: !843)
!843 = !{!844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !842, file: !143, line: 2653, baseType: !830, size: 384)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !842, file: !143, line: 2654, baseType: !709, size: 64, offset: 384)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !842, file: !143, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !842, file: !143, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !842, file: !143, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !842, file: !143, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !842, file: !143, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !842, file: !143, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !842, file: !143, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !842, file: !143, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !842, file: !143, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !842, file: !143, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !842, file: !143, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !842, file: !143, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !842, file: !143, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !842, file: !143, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !842, file: !143, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !842, file: !143, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !842, file: !143, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !842, file: !143, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !842, file: !143, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !842, file: !143, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !842, file: !143, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !842, file: !143, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !842, file: !143, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !842, file: !143, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !842, file: !143, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !842, file: !143, line: 2703, baseType: !7, size: 32, offset: 512)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !842, file: !143, line: 2705, baseType: !709, size: 64, offset: 576)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !842, file: !143, line: 2706, baseType: !709, size: 64, offset: 640)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !842, file: !143, line: 2707, baseType: !709, size: 64, offset: 704)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !842, file: !143, line: 2708, baseType: !709, size: 64, offset: 768)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !842, file: !143, line: 2711, baseType: !877, size: 64, offset: 832)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !143, line: 2711, flags: DIFlagFwdDecl)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !712, file: !143, line: 3383, baseType: !880, size: 960)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !143, line: 2756, size: 960, elements: !881)
!881 = !{!882, !883}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !880, file: !143, line: 2757, baseType: !842, size: 896)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !880, file: !143, line: 2758, baseType: !884, size: 64, offset: 896)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !710, line: 50, baseType: !885)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !455, line: 240, size: 384, elements: !887)
!887 = !{!888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !886, file: !455, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !886, file: !455, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !886, file: !455, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !886, file: !455, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !886, file: !455, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !886, file: !455, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !886, file: !455, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !886, file: !455, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !886, file: !455, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !886, file: !455, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !886, file: !455, line: 321, baseType: !899, size: 320, offset: 64)
!899 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !455, line: 315, size: 320, elements: !900)
!900 = !{!901, !1377, !1379, !1442, !1443}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !899, file: !455, line: 316, baseType: !902, size: 64)
!902 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 64, elements: !808)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !455, line: 183, baseType: !904)
!904 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !455, line: 166, size: 64, elements: !905)
!905 = !{!906, !907, !908, !909, !910, !918, !919, !931, !955, !1015, !1016, !1354, !1367, !1374}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !904, file: !455, line: 168, baseType: !678, size: 32)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !904, file: !455, line: 169, baseType: !7, size: 32)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !904, file: !455, line: 170, baseType: !683, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !904, file: !455, line: 171, baseType: !884, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !904, file: !455, line: 172, baseType: !911, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !710, line: 53, baseType: !912)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !455, line: 359, size: 128, elements: !914)
!914 = !{!915, !916}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !913, file: !455, line: 360, baseType: !678, size: 32)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !913, file: !455, line: 361, baseType: !917, size: 64, offset: 64)
!917 = !DICompositeType(tag: DW_TAG_array_type, baseType: !884, size: 64, elements: !808)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !904, file: !455, line: 173, baseType: !14, size: 32)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !904, file: !455, line: 174, baseType: !920, size: 32)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !455, line: 133, baseType: !921)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !455, line: 115, size: 32, elements: !922)
!922 = !{!923, !924, !925, !926, !927, !928, !929, !930}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !921, file: !455, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !921, file: !455, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !921, file: !455, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !921, file: !455, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !921, file: !455, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !921, file: !455, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !921, file: !455, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !921, file: !455, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !904, file: !455, line: 175, baseType: !932, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !934, line: 23, size: 320, elements: !935)
!934 = !DIFile(filename: "./cselib.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!935 = !{!936, !937, !938, !939, !946, !954}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !933, file: !934, line: 25, baseType: !7, size: 32)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !933, file: !934, line: 28, baseType: !678, size: 32, offset: 32)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "val_rtx", scope: !933, file: !934, line: 31, baseType: !884, size: 64, offset: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "locs", scope: !933, file: !934, line: 35, baseType: !940, size: 64, offset: 128)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "elt_loc_list", file: !934, line: 45, size: 192, elements: !942)
!942 = !{!943, !944, !945}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !941, file: !934, line: 47, baseType: !940, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !941, file: !934, line: 49, baseType: !884, size: 64, offset: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "setting_insn", scope: !941, file: !934, line: 51, baseType: !884, size: 64, offset: 128)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "addr_list", scope: !933, file: !934, line: 39, baseType: !947, size: 64, offset: 192)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "elt_list", file: !934, line: 55, size: 128, elements: !949)
!949 = !{!950, !951}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !948, file: !934, line: 56, baseType: !947, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "elt", scope: !948, file: !934, line: 57, baseType: !952, size: 64, offset: 64)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "cselib_val", file: !934, line: 42, baseType: !933)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "next_containing_mem", scope: !933, file: !934, line: 41, baseType: !932, size: 64, offset: 256)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !904, file: !455, line: 176, baseType: !956, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !958, line: 75, size: 256, elements: !959)
!958 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!959 = !{!960, !974, !975, !976}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !957, file: !958, line: 76, baseType: !961, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !958, line: 68, baseType: !963)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !958, line: 63, size: 320, elements: !964)
!964 = !{!965, !967, !968, !969}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !963, file: !958, line: 64, baseType: !966, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !963, file: !958, line: 65, baseType: !966, size: 64, offset: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !963, file: !958, line: 66, baseType: !7, size: 32, offset: 128)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !963, file: !958, line: 67, baseType: !970, size: 128, offset: 192)
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 128, elements: !972)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !958, line: 29, baseType: !763)
!972 = !{!973}
!973 = !DISubrange(count: 2)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !957, file: !958, line: 77, baseType: !961, size: 64, offset: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !957, file: !958, line: 78, baseType: !7, size: 32, offset: 128)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !957, file: !958, line: 79, baseType: !977, size: 64, offset: 192)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !958, line: 49, baseType: !979)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !958, line: 45, size: 832, elements: !980)
!980 = !{!981, !982, !983}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !979, file: !958, line: 46, baseType: !966, size: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !979, file: !958, line: 47, baseType: !956, size: 64, offset: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !979, file: !958, line: 48, baseType: !984, size: 704, offset: 128)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !985, line: 164, size: 704, elements: !986)
!985 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!986 = !{!987, !988, !998, !999, !1000, !1001, !1002, !1003, !1007, !1011, !1012, !1013, !1014}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !984, file: !985, line: 166, baseType: !765, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !984, file: !985, line: 167, baseType: !989, size: 64, offset: 64)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !985, line: 157, size: 192, elements: !991)
!991 = !{!992, !993, !994}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !990, file: !985, line: 159, baseType: !680, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !990, file: !985, line: 160, baseType: !989, size: 64, offset: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !990, file: !985, line: 161, baseType: !995, size: 32, offset: 128)
!995 = !DICompositeType(tag: DW_TAG_array_type, baseType: !681, size: 32, elements: !996)
!996 = !{!997}
!997 = !DISubrange(count: 4)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !984, file: !985, line: 168, baseType: !680, size: 64, offset: 128)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !984, file: !985, line: 169, baseType: !680, size: 64, offset: 192)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !984, file: !985, line: 170, baseType: !680, size: 64, offset: 256)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !984, file: !985, line: 171, baseType: !765, size: 64, offset: 320)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !984, file: !985, line: 172, baseType: !678, size: 32, offset: 384)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !984, file: !985, line: 176, baseType: !1004, size: 64, offset: 448)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!989, !682, !765}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !984, file: !985, line: 177, baseType: !1008, size: 64, offset: 512)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{null, !682, !989}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !984, file: !985, line: 178, baseType: !682, size: 64, offset: 576)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !984, file: !985, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !984, file: !985, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !984, file: !985, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !904, file: !455, line: 177, baseType: !709, size: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !904, file: !455, line: 178, baseType: !1017, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !358, line: 217, size: 832, elements: !1019)
!1019 = !{!1020, !1266, !1267, !1268, !1324, !1328, !1329, !1330, !1348, !1349, !1350, !1351, !1352, !1353}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1018, file: !358, line: 219, baseType: !1021, size: 64)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !358, line: 151, baseType: !1023)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !358, line: 151, size: 128, elements: !1024)
!1024 = !{!1025}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1023, file: !358, line: 151, baseType: !1026, size: 128)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !358, line: 150, baseType: !1027)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !358, line: 150, size: 128, elements: !1028)
!1028 = !{!1029, !1030, !1031}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1027, file: !358, line: 150, baseType: !7, size: 32)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1027, file: !358, line: 150, baseType: !7, size: 32, offset: 32)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1027, file: !358, line: 150, baseType: !1032, size: 64, offset: 64)
!1032 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1033, size: 64, elements: !808)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !710, line: 108, baseType: !1034)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !358, line: 122, size: 512, elements: !1036)
!1036 = !{!1037, !1038, !1039, !1258, !1259, !1260, !1261, !1262, !1263, !1264}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1035, file: !358, line: 124, baseType: !1017, size: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1035, file: !358, line: 125, baseType: !1017, size: 64, offset: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1035, file: !358, line: 131, baseType: !1040, size: 64, offset: 128)
!1040 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !358, line: 128, size: 64, elements: !1041)
!1041 = !{!1042, !1257}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1040, file: !358, line: 129, baseType: !1043, size: 64)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !710, line: 66, baseType: !1044)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !611, line: 143, size: 192, elements: !1046)
!1046 = !{!1047, !1255, !1256}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1045, file: !611, line: 145, baseType: !1048, size: 64)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !710, line: 69, baseType: !1049)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !611, line: 136, size: 192, elements: !1051)
!1051 = !{!1052, !1253, !1254}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1050, file: !611, line: 137, baseType: !1053, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !710, line: 58, baseType: !1054)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !611, line: 737, size: 768, elements: !1056)
!1056 = !{!1057, !1074, !1108, !1114, !1119, !1124, !1131, !1137, !1143, !1148, !1162, !1167, !1173, !1178, !1188, !1193, !1211, !1218, !1225, !1231, !1236, !1242, !1248}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1055, file: !611, line: 738, baseType: !1058, size: 256)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !611, line: 271, size: 256, elements: !1059)
!1059 = !{!1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1058, file: !611, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !1058, file: !611, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1058, file: !611, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !1058, file: !611, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !1058, file: !611, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !1058, file: !611, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !1058, file: !611, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1058, file: !611, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !1058, file: !611, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1058, file: !611, line: 312, baseType: !7, size: 32, offset: 32)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !1058, file: !611, line: 316, baseType: !834, size: 32, offset: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !1058, file: !611, line: 319, baseType: !7, size: 32, offset: 96)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1058, file: !611, line: 323, baseType: !1017, size: 64, offset: 128)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1058, file: !611, line: 327, baseType: !709, size: 64, offset: 192)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !1055, file: !611, line: 739, baseType: !1075, size: 448)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !611, line: 350, size: 448, elements: !1076)
!1076 = !{!1077, !1106}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1075, file: !611, line: 353, baseType: !1078, size: 384)
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !611, line: 333, size: 384, elements: !1079)
!1079 = !{!1080, !1081, !1089}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1078, file: !611, line: 336, baseType: !1058, size: 256)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !1078, file: !611, line: 343, baseType: !1082, size: 64, offset: 256)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1084, line: 37, size: 128, elements: !1085)
!1084 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1085 = !{!1086, !1087}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1083, file: !1084, line: 39, baseType: !1082, size: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1083, file: !1084, line: 40, baseType: !1088, size: 64, offset: 64)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !1078, file: !611, line: 344, baseType: !1090, size: 64, offset: 320)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64)
!1091 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1084, line: 45, size: 320, elements: !1092)
!1092 = !{!1093, !1094}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1091, file: !1084, line: 47, baseType: !1090, size: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1091, file: !1084, line: 48, baseType: !1095, size: 256, offset: 64)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !143, line: 1883, size: 256, elements: !1096)
!1096 = !{!1097, !1099, !1100, !1105}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1095, file: !143, line: 1884, baseType: !1098, size: 64)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1095, file: !143, line: 1885, baseType: !1098, size: 64, offset: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1095, file: !143, line: 1891, baseType: !1101, size: 64, offset: 128)
!1101 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1095, file: !143, line: 1891, size: 64, elements: !1102)
!1102 = !{!1103, !1104}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1101, file: !143, line: 1891, baseType: !1053, size: 64)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1101, file: !143, line: 1891, baseType: !709, size: 64)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1095, file: !143, line: 1892, baseType: !1088, size: 64, offset: 192)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1075, file: !611, line: 359, baseType: !1107, size: 64, offset: 384)
!1107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !709, size: 64, elements: !808)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !1055, file: !611, line: 740, baseType: !1109, size: 512)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !611, line: 365, size: 512, elements: !1110)
!1110 = !{!1111, !1112, !1113}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1109, file: !611, line: 368, baseType: !1078, size: 384)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1109, file: !611, line: 373, baseType: !709, size: 64, offset: 384)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1109, file: !611, line: 374, baseType: !709, size: 64, offset: 448)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !1055, file: !611, line: 741, baseType: !1115, size: 576)
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !611, line: 380, size: 576, elements: !1116)
!1116 = !{!1117, !1118}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1115, file: !611, line: 383, baseType: !1109, size: 512)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1115, file: !611, line: 389, baseType: !1107, size: 64, offset: 512)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1055, file: !611, line: 742, baseType: !1120, size: 320)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !611, line: 395, size: 320, elements: !1121)
!1121 = !{!1122, !1123}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1120, file: !611, line: 397, baseType: !1058, size: 256)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1120, file: !611, line: 400, baseType: !1043, size: 64, offset: 256)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !1055, file: !611, line: 743, baseType: !1125, size: 448)
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !611, line: 406, size: 448, elements: !1126)
!1126 = !{!1127, !1128, !1129, !1130}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1125, file: !611, line: 408, baseType: !1058, size: 256)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1125, file: !611, line: 412, baseType: !709, size: 64, offset: 256)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1125, file: !611, line: 420, baseType: !709, size: 64, offset: 320)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1125, file: !611, line: 423, baseType: !1043, size: 64, offset: 384)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !1055, file: !611, line: 744, baseType: !1132, size: 384)
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !611, line: 429, size: 384, elements: !1133)
!1133 = !{!1134, !1135, !1136}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1132, file: !611, line: 431, baseType: !1058, size: 256)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1132, file: !611, line: 434, baseType: !709, size: 64, offset: 256)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1132, file: !611, line: 437, baseType: !1043, size: 64, offset: 320)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !1055, file: !611, line: 745, baseType: !1138, size: 384)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !611, line: 443, size: 384, elements: !1139)
!1139 = !{!1140, !1141, !1142}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1138, file: !611, line: 445, baseType: !1058, size: 256)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1138, file: !611, line: 449, baseType: !709, size: 64, offset: 256)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1138, file: !611, line: 453, baseType: !1043, size: 64, offset: 320)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !1055, file: !611, line: 746, baseType: !1144, size: 320)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !611, line: 459, size: 320, elements: !1145)
!1145 = !{!1146, !1147}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1144, file: !611, line: 461, baseType: !1058, size: 256)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1144, file: !611, line: 464, baseType: !709, size: 64, offset: 256)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !1055, file: !611, line: 747, baseType: !1149, size: 768)
!1149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !611, line: 469, size: 768, elements: !1150)
!1150 = !{!1151, !1152, !1153, !1154, !1155}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1149, file: !611, line: 471, baseType: !1058, size: 256)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1149, file: !611, line: 474, baseType: !7, size: 32, offset: 256)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1149, file: !611, line: 475, baseType: !7, size: 32, offset: 288)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1149, file: !611, line: 478, baseType: !709, size: 64, offset: 320)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1149, file: !611, line: 481, baseType: !1156, size: 384, offset: 384)
!1156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1157, size: 384, elements: !808)
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !143, line: 1917, size: 384, elements: !1158)
!1158 = !{!1159, !1160, !1161}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1157, file: !143, line: 1920, baseType: !1095, size: 256)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1157, file: !143, line: 1921, baseType: !709, size: 64, offset: 256)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1157, file: !143, line: 1922, baseType: !834, size: 32, offset: 320)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !1055, file: !611, line: 748, baseType: !1163, size: 320)
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !611, line: 487, size: 320, elements: !1164)
!1164 = !{!1165, !1166}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1163, file: !611, line: 490, baseType: !1058, size: 256)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1163, file: !611, line: 494, baseType: !678, size: 32, offset: 256)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !1055, file: !611, line: 749, baseType: !1168, size: 384)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !611, line: 500, size: 384, elements: !1169)
!1169 = !{!1170, !1171, !1172}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1168, file: !611, line: 502, baseType: !1058, size: 256)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1168, file: !611, line: 506, baseType: !1043, size: 64, offset: 256)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1168, file: !611, line: 510, baseType: !1043, size: 64, offset: 320)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !1055, file: !611, line: 750, baseType: !1174, size: 320)
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !611, line: 529, size: 320, elements: !1175)
!1175 = !{!1176, !1177}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1174, file: !611, line: 531, baseType: !1058, size: 256)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1174, file: !611, line: 540, baseType: !1043, size: 64, offset: 256)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !1055, file: !611, line: 751, baseType: !1179, size: 704)
!1179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !611, line: 546, size: 704, elements: !1180)
!1180 = !{!1181, !1182, !1183, !1184, !1185, !1186, !1187}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1179, file: !611, line: 549, baseType: !1109, size: 512)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1179, file: !611, line: 553, baseType: !683, size: 64, offset: 512)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1179, file: !611, line: 557, baseType: !677, size: 8, offset: 576)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1179, file: !611, line: 558, baseType: !677, size: 8, offset: 584)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1179, file: !611, line: 559, baseType: !677, size: 8, offset: 592)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1179, file: !611, line: 560, baseType: !677, size: 8, offset: 600)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1179, file: !611, line: 566, baseType: !1107, size: 64, offset: 640)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !1055, file: !611, line: 752, baseType: !1189, size: 384)
!1189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !611, line: 571, size: 384, elements: !1190)
!1190 = !{!1191, !1192}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1189, file: !611, line: 573, baseType: !1120, size: 320)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1189, file: !611, line: 577, baseType: !709, size: 64, offset: 320)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !1055, file: !611, line: 753, baseType: !1194, size: 576)
!1194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !611, line: 600, size: 576, elements: !1195)
!1195 = !{!1196, !1197, !1198, !1201, !1210}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1194, file: !611, line: 602, baseType: !1120, size: 320)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1194, file: !611, line: 605, baseType: !709, size: 64, offset: 320)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1194, file: !611, line: 609, baseType: !1199, size: 64, offset: 384)
!1199 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1200, line: 46, baseType: !763)
!1200 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1194, file: !611, line: 612, baseType: !1202, size: 64, offset: 448)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64)
!1203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !611, line: 581, size: 320, elements: !1204)
!1204 = !{!1205, !1206, !1207, !1208, !1209}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1203, file: !611, line: 583, baseType: !142, size: 32)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1203, file: !611, line: 586, baseType: !709, size: 64, offset: 64)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1203, file: !611, line: 589, baseType: !709, size: 64, offset: 128)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1203, file: !611, line: 592, baseType: !709, size: 64, offset: 192)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1203, file: !611, line: 595, baseType: !709, size: 64, offset: 256)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1194, file: !611, line: 616, baseType: !1043, size: 64, offset: 512)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !1055, file: !611, line: 754, baseType: !1212, size: 512)
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !611, line: 622, size: 512, elements: !1213)
!1213 = !{!1214, !1215, !1216, !1217}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1212, file: !611, line: 624, baseType: !1120, size: 320)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1212, file: !611, line: 628, baseType: !709, size: 64, offset: 320)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1212, file: !611, line: 632, baseType: !709, size: 64, offset: 384)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1212, file: !611, line: 636, baseType: !709, size: 64, offset: 448)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !1055, file: !611, line: 755, baseType: !1219, size: 704)
!1219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !611, line: 642, size: 704, elements: !1220)
!1220 = !{!1221, !1222, !1223, !1224}
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1219, file: !611, line: 644, baseType: !1212, size: 512)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1219, file: !611, line: 648, baseType: !709, size: 64, offset: 512)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1219, file: !611, line: 652, baseType: !709, size: 64, offset: 576)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1219, file: !611, line: 653, baseType: !709, size: 64, offset: 640)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !1055, file: !611, line: 756, baseType: !1226, size: 448)
!1226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !611, line: 663, size: 448, elements: !1227)
!1227 = !{!1228, !1229, !1230}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1226, file: !611, line: 665, baseType: !1120, size: 320)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1226, file: !611, line: 668, baseType: !709, size: 64, offset: 320)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1226, file: !611, line: 673, baseType: !709, size: 64, offset: 384)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !1055, file: !611, line: 757, baseType: !1232, size: 384)
!1232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !611, line: 694, size: 384, elements: !1233)
!1233 = !{!1234, !1235}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1232, file: !611, line: 696, baseType: !1120, size: 320)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1232, file: !611, line: 699, baseType: !709, size: 64, offset: 320)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !1055, file: !611, line: 758, baseType: !1237, size: 384)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !611, line: 681, size: 384, elements: !1238)
!1238 = !{!1239, !1240, !1241}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1237, file: !611, line: 683, baseType: !1058, size: 256)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1237, file: !611, line: 686, baseType: !709, size: 64, offset: 256)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1237, file: !611, line: 689, baseType: !709, size: 64, offset: 320)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !1055, file: !611, line: 759, baseType: !1243, size: 384)
!1243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !611, line: 707, size: 384, elements: !1244)
!1244 = !{!1245, !1246, !1247}
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1243, file: !611, line: 709, baseType: !1058, size: 256)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1243, file: !611, line: 712, baseType: !709, size: 64, offset: 256)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1243, file: !611, line: 712, baseType: !709, size: 64, offset: 320)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !1055, file: !611, line: 760, baseType: !1249, size: 320)
!1249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !611, line: 718, size: 320, elements: !1250)
!1250 = !{!1251, !1252}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1249, file: !611, line: 720, baseType: !1058, size: 256)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1249, file: !611, line: 723, baseType: !709, size: 64, offset: 256)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1050, file: !611, line: 138, baseType: !1049, size: 64, offset: 64)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1050, file: !611, line: 139, baseType: !1049, size: 64, offset: 128)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1045, file: !611, line: 146, baseType: !1048, size: 64, offset: 64)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1045, file: !611, line: 152, baseType: !1043, size: 64, offset: 128)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1040, file: !358, line: 130, baseType: !884, size: 64)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1035, file: !358, line: 134, baseType: !682, size: 64, offset: 192)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1035, file: !358, line: 137, baseType: !709, size: 64, offset: 256)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1035, file: !358, line: 138, baseType: !834, size: 32, offset: 320)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1035, file: !358, line: 142, baseType: !7, size: 32, offset: 352)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1035, file: !358, line: 144, baseType: !678, size: 32, offset: 384)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1035, file: !358, line: 145, baseType: !678, size: 32, offset: 416)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1035, file: !358, line: 146, baseType: !1265, size: 64, offset: 448)
!1265 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !358, line: 119, baseType: !765)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1018, file: !358, line: 220, baseType: !1021, size: 64, offset: 64)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1018, file: !358, line: 223, baseType: !682, size: 64, offset: 128)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1018, file: !358, line: 226, baseType: !1269, size: 64, offset: 192)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64)
!1270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !338, line: 100, size: 1216, elements: !1271)
!1271 = !{!1272, !1273, !1274, !1275, !1276, !1281, !1282, !1283, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1314, !1322, !1323}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1270, file: !338, line: 102, baseType: !678, size: 32)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1270, file: !338, line: 105, baseType: !7, size: 32, offset: 32)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1270, file: !338, line: 108, baseType: !1017, size: 64, offset: 64)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1270, file: !338, line: 111, baseType: !1017, size: 64, offset: 128)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1270, file: !338, line: 114, baseType: !1277, size: 64, offset: 192)
!1277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !338, line: 41, size: 64, elements: !1278)
!1278 = !{!1279, !1280}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1277, file: !338, line: 42, baseType: !337, size: 32)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1277, file: !338, line: 43, baseType: !7, size: 32, offset: 32)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1270, file: !338, line: 117, baseType: !7, size: 32, offset: 256)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1270, file: !338, line: 120, baseType: !7, size: 32, offset: 288)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1270, file: !338, line: 123, baseType: !1284, size: 64, offset: 320)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64)
!1285 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !338, line: 87, baseType: !1286)
!1286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !338, line: 87, size: 128, elements: !1287)
!1287 = !{!1288}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1286, file: !338, line: 87, baseType: !1289, size: 128)
!1289 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !338, line: 85, baseType: !1290)
!1290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !338, line: 85, size: 128, elements: !1291)
!1291 = !{!1292, !1293, !1294}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1290, file: !338, line: 85, baseType: !7, size: 32)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1290, file: !338, line: 85, baseType: !7, size: 32, offset: 32)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1290, file: !338, line: 85, baseType: !1295, size: 64, offset: 64)
!1295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1296, size: 64, elements: !808)
!1296 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !338, line: 84, baseType: !1269)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1270, file: !338, line: 126, baseType: !1269, size: 64, offset: 384)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1270, file: !338, line: 129, baseType: !1269, size: 64, offset: 448)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1270, file: !338, line: 132, baseType: !682, size: 64, offset: 512)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1270, file: !338, line: 139, baseType: !709, size: 64, offset: 576)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1270, file: !338, line: 143, baseType: !758, size: 128, offset: 640)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1270, file: !338, line: 146, baseType: !758, size: 128, offset: 768)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1270, file: !338, line: 148, baseType: !677, size: 8, offset: 896)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1270, file: !338, line: 149, baseType: !677, size: 8, offset: 904)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1270, file: !338, line: 153, baseType: !346, size: 32, offset: 928)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1270, file: !338, line: 156, baseType: !1307, size: 64, offset: 960)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64)
!1308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !338, line: 48, size: 320, elements: !1309)
!1309 = !{!1310, !1311, !1312, !1313}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1308, file: !338, line: 50, baseType: !1053, size: 64)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1308, file: !338, line: 59, baseType: !758, size: 128, offset: 64)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1308, file: !338, line: 64, baseType: !677, size: 8, offset: 192)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1308, file: !338, line: 67, baseType: !1307, size: 64, offset: 256)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1270, file: !338, line: 159, baseType: !1315, size: 64, offset: 1024)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64)
!1316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !338, line: 72, size: 256, elements: !1317)
!1317 = !{!1318, !1319, !1320, !1321}
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1316, file: !338, line: 74, baseType: !1034, size: 64)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1316, file: !338, line: 77, baseType: !1315, size: 64, offset: 64)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1316, file: !338, line: 78, baseType: !1315, size: 64, offset: 128)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1316, file: !338, line: 81, baseType: !1315, size: 64, offset: 192)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1270, file: !338, line: 162, baseType: !677, size: 8, offset: 1088)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1270, file: !338, line: 166, baseType: !709, size: 64, offset: 1152)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1018, file: !358, line: 229, baseType: !1325, size: 128, offset: 256)
!1325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1326, size: 128, elements: !972)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64)
!1327 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !358, line: 229, flags: DIFlagFwdDecl)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1018, file: !358, line: 232, baseType: !1017, size: 64, offset: 384)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1018, file: !358, line: 233, baseType: !1017, size: 64, offset: 448)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1018, file: !358, line: 238, baseType: !1331, size: 64, offset: 512)
!1331 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !358, line: 235, size: 64, elements: !1332)
!1332 = !{!1333, !1339}
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1331, file: !358, line: 236, baseType: !1334, size: 64)
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1335, size: 64)
!1335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !358, line: 273, size: 128, elements: !1336)
!1336 = !{!1337, !1338}
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1335, file: !358, line: 275, baseType: !1043, size: 64)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1335, file: !358, line: 278, baseType: !1043, size: 64, offset: 64)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1331, file: !358, line: 237, baseType: !1340, size: 64)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64)
!1341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !358, line: 259, size: 320, elements: !1342)
!1342 = !{!1343, !1344, !1345, !1346, !1347}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1341, file: !358, line: 261, baseType: !884, size: 64)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1341, file: !358, line: 262, baseType: !884, size: 64, offset: 64)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1341, file: !358, line: 266, baseType: !884, size: 64, offset: 128)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1341, file: !358, line: 267, baseType: !884, size: 64, offset: 192)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1341, file: !358, line: 270, baseType: !678, size: 32, offset: 256)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1018, file: !358, line: 241, baseType: !1265, size: 64, offset: 576)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1018, file: !358, line: 244, baseType: !678, size: 32, offset: 640)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1018, file: !358, line: 247, baseType: !678, size: 32, offset: 672)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1018, file: !358, line: 250, baseType: !678, size: 32, offset: 704)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1018, file: !358, line: 253, baseType: !678, size: 32, offset: 736)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1018, file: !358, line: 256, baseType: !678, size: 32, offset: 768)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !904, file: !455, line: 179, baseType: !1355, size: 64)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64)
!1356 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !455, line: 150, baseType: !1357)
!1357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !455, line: 142, size: 320, elements: !1358)
!1358 = !{!1359, !1360, !1361, !1362, !1365, !1366}
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1357, file: !455, line: 144, baseType: !709, size: 64)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1357, file: !455, line: 145, baseType: !884, size: 64, offset: 64)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1357, file: !455, line: 146, baseType: !884, size: 64, offset: 128)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1357, file: !455, line: 147, baseType: !1363, size: 32, offset: 192)
!1363 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1364, line: 31, baseType: !678)
!1364 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1357, file: !455, line: 148, baseType: !7, size: 32, offset: 224)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1357, file: !455, line: 149, baseType: !677, size: 8, offset: 256)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !904, file: !455, line: 180, baseType: !1368, size: 64)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64)
!1369 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !455, line: 162, baseType: !1370)
!1370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !455, line: 159, size: 128, elements: !1371)
!1371 = !{!1372, !1373}
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1370, file: !455, line: 160, baseType: !709, size: 64)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1370, file: !455, line: 161, baseType: !765, size: 64, offset: 64)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !904, file: !455, line: 181, baseType: !1375, size: 64)
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64)
!1376 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !455, line: 181, flags: DIFlagFwdDecl)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !899, file: !455, line: 317, baseType: !1378, size: 64)
!1378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !765, size: 64, elements: !808)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !899, file: !455, line: 318, baseType: !1380, size: 320)
!1380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !455, line: 188, size: 320, elements: !1381)
!1381 = !{!1382, !1384, !1441}
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1380, file: !455, line: 190, baseType: !1383, size: 192)
!1383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 192, elements: !783)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1380, file: !455, line: 193, baseType: !1385, size: 64, offset: 192)
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64)
!1386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !455, line: 206, size: 320, elements: !1387)
!1387 = !{!1388, !1426, !1427, !1428, !1440}
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1386, file: !455, line: 208, baseType: !1389, size: 64)
!1389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1390, size: 64)
!1390 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !710, line: 62, baseType: !1391)
!1391 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1392, line: 538, size: 256, elements: !1393)
!1392 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1393 = !{!1394, !1398, !1404, !1417}
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1391, file: !1392, line: 539, baseType: !1395, size: 32)
!1395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1392, line: 482, size: 32, elements: !1396)
!1396 = !{!1397}
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1395, file: !1392, line: 484, baseType: !7, size: 32)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1391, file: !1392, line: 540, baseType: !1399, size: 192)
!1399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1392, line: 488, size: 192, elements: !1400)
!1400 = !{!1401, !1402, !1403}
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1399, file: !1392, line: 489, baseType: !1395, size: 32)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1399, file: !1392, line: 492, baseType: !683, size: 64, offset: 64)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1399, file: !1392, line: 496, baseType: !709, size: 64, offset: 128)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1391, file: !1392, line: 541, baseType: !1405, size: 256)
!1405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1392, line: 504, size: 256, elements: !1406)
!1406 = !{!1407, !1408, !1415, !1416}
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1405, file: !1392, line: 505, baseType: !1395, size: 32)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1405, file: !1392, line: 509, baseType: !1409, size: 64, offset: 64)
!1409 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1392, line: 501, baseType: !1410)
!1410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1411, size: 64)
!1411 = !DISubroutineType(types: !1412)
!1412 = !{null, !1413}
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64)
!1414 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1405, file: !1392, line: 510, baseType: !1413, size: 64, offset: 128)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1405, file: !1392, line: 513, baseType: !1389, size: 64, offset: 192)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1391, file: !1392, line: 542, baseType: !1418, size: 128)
!1418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1392, line: 530, size: 128, elements: !1419)
!1419 = !{!1420, !1421}
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1418, file: !1392, line: 531, baseType: !1395, size: 32)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1418, file: !1392, line: 534, baseType: !1422, size: 64, offset: 64)
!1422 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1392, line: 525, baseType: !1423)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64)
!1424 = !DISubroutineType(types: !1425)
!1425 = !{!677, !709, !683, !763, !763}
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1386, file: !455, line: 211, baseType: !7, size: 32, offset: 64)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1386, file: !455, line: 214, baseType: !765, size: 64, offset: 128)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1386, file: !455, line: 224, baseType: !1429, size: 64, offset: 192)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64)
!1430 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !455, line: 202, baseType: !1431)
!1431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !455, line: 202, size: 128, elements: !1432)
!1432 = !{!1433}
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1431, file: !455, line: 202, baseType: !1434, size: 128)
!1434 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !455, line: 200, baseType: !1435)
!1435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !455, line: 200, size: 128, elements: !1436)
!1436 = !{!1437, !1438, !1439}
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1435, file: !455, line: 200, baseType: !7, size: 32)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1435, file: !455, line: 200, baseType: !7, size: 32, offset: 32)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1435, file: !455, line: 200, baseType: !917, size: 64, offset: 64)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1386, file: !455, line: 234, baseType: !1429, size: 64, offset: 256)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1380, file: !455, line: 197, baseType: !765, size: 64, offset: 256)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !899, file: !455, line: 319, baseType: !772, size: 256)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !899, file: !455, line: 320, baseType: !791, size: 192)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !712, file: !143, line: 3384, baseType: !1445, size: 1472)
!1445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !143, line: 3114, size: 1472, elements: !1446)
!1446 = !{!1447, !1468, !1469, !1470, !1471}
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1445, file: !143, line: 3115, baseType: !1448, size: 1216)
!1448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !143, line: 2984, size: 1216, elements: !1449)
!1449 = !{!1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467}
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1448, file: !143, line: 2985, baseType: !880, size: 960)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1448, file: !143, line: 2986, baseType: !709, size: 64, offset: 960)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1448, file: !143, line: 2987, baseType: !709, size: 64, offset: 1024)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1448, file: !143, line: 2988, baseType: !709, size: 64, offset: 1088)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1448, file: !143, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1448, file: !143, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1448, file: !143, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1448, file: !143, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1448, file: !143, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1448, file: !143, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1448, file: !143, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1448, file: !143, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1448, file: !143, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1448, file: !143, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1448, file: !143, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1448, file: !143, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1448, file: !143, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1448, file: !143, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1445, file: !143, line: 3117, baseType: !709, size: 64, offset: 1216)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1445, file: !143, line: 3119, baseType: !709, size: 64, offset: 1280)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1445, file: !143, line: 3121, baseType: !709, size: 64, offset: 1344)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1445, file: !143, line: 3123, baseType: !709, size: 64, offset: 1408)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !712, file: !143, line: 3385, baseType: !1473, size: 1088)
