; ModuleID = 'haifa-sched.bc'
source_filename = "haifa-sched.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.spec_info_def = type { i32, %struct._IO_FILE*, i32, i32, i32 }
%struct.ready_list = type { %struct.rtx_def**, i32, i32, i32, i32 }
%struct.rtx_def = type { i32, %union.u }
%union.u = type { %struct.block_symbol }
%struct.block_symbol = type { [3 x %union.rtunion_def], %struct.object_block*, i64 }
%union.rtunion_def = type { i8* }
%struct.object_block = type { %union.section*, i32, i64, %struct.VEC_rtx_gc*, %struct.VEC_rtx_gc* }
%union.section = type { %struct.unnamed_section }
%struct.unnamed_section = type { %struct.section_common, void (i8*)*, i8*, %union.section* }
%struct.section_common = type { i32 }
%struct.VEC_rtx_gc = type { %struct.VEC_rtx_base }
%struct.VEC_rtx_base = type { i32, i32, [1 x %struct.rtx_def*] }
%struct.common_sched_info_def = type { void (i32, i32, i32)*, void (%struct.basic_block_def*, %struct.basic_block_def*)*, i32 (%struct.basic_block_def*)*, i32 (%struct.rtx_def*)*, i32 }

!569 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!570 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!571 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!572 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!573 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!574 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!575 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!576 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!577 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!578 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!579 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!580 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!581 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!582 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "insn_note", file: !406, line: 956, baseType: !7, size: 32, elements: !583)
!583 = !{!584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597}
!584 = !DIEnumerator(name: "NOTE_INSN_DELETED", value: 0, isUnsigned: true)
!585 = !DIEnumerator(name: "NOTE_INSN_DELETED_LABEL", value: 1, isUnsigned: true)
!586 = !DIEnumerator(name: "NOTE_INSN_BLOCK_BEG", value: 2, isUnsigned: true)
!587 = !DIEnumerator(name: "NOTE_INSN_BLOCK_END", value: 3, isUnsigned: true)
!588 = !DIEnumerator(name: "NOTE_INSN_FUNCTION_BEG", value: 4, isUnsigned: true)
!589 = !DIEnumerator(name: "NOTE_INSN_PROLOGUE_END", value: 5, isUnsigned: true)
!590 = !DIEnumerator(name: "NOTE_INSN_EPILOGUE_BEG", value: 6, isUnsigned: true)
!591 = !DIEnumerator(name: "NOTE_INSN_EH_REGION_BEG", value: 7, isUnsigned: true)
!592 = !DIEnumerator(name: "NOTE_INSN_EH_REGION_END", value: 8, isUnsigned: true)
!593 = !DIEnumerator(name: "NOTE_INSN_VAR_LOCATION", value: 9, isUnsigned: true)
!594 = !DIEnumerator(name: "NOTE_INSN_BASIC_BLOCK", value: 10, isUnsigned: true)
!595 = !DIEnumerator(name: "NOTE_INSN_SWITCH_TEXT_SECTIONS", value: 11, isUnsigned: true)
!596 = !DIEnumerator(name: "NOTE_INSN_CFA_RESTORE_STATE", value: 12, isUnsigned: true)
!597 = !DIEnumerator(name: "NOTE_INSN_MAX", value: 13, isUnsigned: true)
!598 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "reg_class", file: !166, line: 1188, baseType: !7, size: 32, elements: !599)
!599 = !{!600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627}
!600 = !DIEnumerator(name: "NO_REGS", value: 0, isUnsigned: true)
!601 = !DIEnumerator(name: "AREG", value: 1, isUnsigned: true)
!602 = !DIEnumerator(name: "DREG", value: 2, isUnsigned: true)
!603 = !DIEnumerator(name: "CREG", value: 3, isUnsigned: true)
!604 = !DIEnumerator(name: "BREG", value: 4, isUnsigned: true)
!605 = !DIEnumerator(name: "SIREG", value: 5, isUnsigned: true)
!606 = !DIEnumerator(name: "DIREG", value: 6, isUnsigned: true)
!607 = !DIEnumerator(name: "AD_REGS", value: 7, isUnsigned: true)
!608 = !DIEnumerator(name: "CLOBBERED_REGS", value: 8, isUnsigned: true)
!609 = !DIEnumerator(name: "Q_REGS", value: 9, isUnsigned: true)
!610 = !DIEnumerator(name: "NON_Q_REGS", value: 10, isUnsigned: true)
!611 = !DIEnumerator(name: "INDEX_REGS", value: 11, isUnsigned: true)
!612 = !DIEnumerator(name: "LEGACY_REGS", value: 12, isUnsigned: true)
!613 = !DIEnumerator(name: "GENERAL_REGS", value: 13, isUnsigned: true)
!614 = !DIEnumerator(name: "FP_TOP_REG", value: 14, isUnsigned: true)
!615 = !DIEnumerator(name: "FP_SECOND_REG", value: 15, isUnsigned: true)
!616 = !DIEnumerator(name: "FLOAT_REGS", value: 16, isUnsigned: true)
!617 = !DIEnumerator(name: "SSE_FIRST_REG", value: 17, isUnsigned: true)
!618 = !DIEnumerator(name: "SSE_REGS", value: 18, isUnsigned: true)
!619 = !DIEnumerator(name: "MMX_REGS", value: 19, isUnsigned: true)
!620 = !DIEnumerator(name: "FP_TOP_SSE_REGS", value: 20, isUnsigned: true)
!621 = !DIEnumerator(name: "FP_SECOND_SSE_REGS", value: 21, isUnsigned: true)
!622 = !DIEnumerator(name: "FLOAT_SSE_REGS", value: 22, isUnsigned: true)
!623 = !DIEnumerator(name: "FLOAT_INT_REGS", value: 23, isUnsigned: true)
!624 = !DIEnumerator(name: "INT_SSE_REGS", value: 24, isUnsigned: true)
!625 = !DIEnumerator(name: "FLOAT_INT_SSE_REGS", value: 25, isUnsigned: true)
!626 = !DIEnumerator(name: "ALL_REGS", value: 26, isUnsigned: true)
!627 = !DIEnumerator(name: "LIM_REG_CLASSES", value: 27, isUnsigned: true)
!628 = !{!629, !630, !631, !632, !635, !636, !638, !5, !440, !405, !582, !1864, !1865, !1866, !1867, !633, !1868, !1877, !7, !1879, !1881, !1886, !1172, !1891, !1903}
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!631 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !634)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !639, line: 50, baseType: !640)
!639 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !406, line: 240, size: 384, elements: !642)
!642 = !{!643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !641, file: !406, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !641, file: !406, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !641, file: !406, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !641, file: !406, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !641, file: !406, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !641, file: !406, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !641, file: !406, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !641, file: !406, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !641, file: !406, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !641, file: !406, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !641, file: !406, line: 321, baseType: !654, size: 320, offset: 64)
!654 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !406, line: 315, size: 320, elements: !655)
!655 = !{!656, !1799, !1801, !1862, !1863}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !654, file: !406, line: 316, baseType: !657, size: 64)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !658, size: 64, elements: !673)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !406, line: 183, baseType: !659)
!659 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !406, line: 166, size: 64, elements: !660)
!660 = !{!661, !662, !663, !664, !665, !675, !676, !688, !691, !753, !1777, !1778, !1789, !1796}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !659, file: !406, line: 168, baseType: !631, size: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !659, file: !406, line: 169, baseType: !7, size: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !659, file: !406, line: 170, baseType: !636, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !659, file: !406, line: 171, baseType: !638, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !659, file: !406, line: 172, baseType: !666, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !639, line: 53, baseType: !667)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !406, line: 359, size: 128, elements: !669)
!669 = !{!670, !671}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !668, file: !406, line: 360, baseType: !631, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !668, file: !406, line: 361, baseType: !672, size: 64, offset: 64)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !638, size: 64, elements: !673)
!673 = !{!674}
!674 = !DISubrange(count: 1)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !659, file: !406, line: 173, baseType: !5, size: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !659, file: !406, line: 174, baseType: !677, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !406, line: 133, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !406, line: 115, size: 32, elements: !679)
!679 = !{!680, !681, !682, !683, !684, !685, !686, !687}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !678, file: !406, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !678, file: !406, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !678, file: !406, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !678, file: !406, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !678, file: !406, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !678, file: !406, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !678, file: !406, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !678, file: !406, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !659, file: !406, line: 175, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !406, line: 175, flags: DIFlagFwdDecl)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !659, file: !406, line: 176, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !694, line: 75, size: 256, elements: !695)
!694 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!695 = !{!696, !711, !712, !713}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !693, file: !694, line: 76, baseType: !697, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !694, line: 68, baseType: !699)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !694, line: 63, size: 320, elements: !700)
!700 = !{!701, !703, !704, !705}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !699, file: !694, line: 64, baseType: !702, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !699, file: !694, line: 65, baseType: !702, size: 64, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !699, file: !694, line: 66, baseType: !7, size: 32, offset: 128)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !699, file: !694, line: 67, baseType: !706, size: 128, offset: 192)
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !707, size: 128, elements: !709)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !694, line: 29, baseType: !708)
!708 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!709 = !{!710}
!710 = !DISubrange(count: 2)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !693, file: !694, line: 77, baseType: !697, size: 64, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !693, file: !694, line: 78, baseType: !7, size: 32, offset: 128)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !693, file: !694, line: 79, baseType: !714, size: 64, offset: 192)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !694, line: 49, baseType: !716)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !694, line: 45, size: 832, elements: !717)
!717 = !{!718, !719, !720}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !716, file: !694, line: 46, baseType: !702, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !716, file: !694, line: 47, baseType: !692, size: 64, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !716, file: !694, line: 48, baseType: !721, size: 704, offset: 128)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !722, line: 164, size: 704, elements: !723)
!722 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!723 = !{!724, !726, !736, !737, !738, !739, !740, !741, !745, !749, !750, !751, !752}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !721, file: !722, line: 166, baseType: !725, size: 64)
!725 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !721, file: !722, line: 167, baseType: !727, size: 64, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !722, line: 157, size: 192, elements: !729)
!729 = !{!730, !731, !732}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !728, file: !722, line: 159, baseType: !633, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !728, file: !722, line: 160, baseType: !727, size: 64, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !728, file: !722, line: 161, baseType: !733, size: 32, offset: 128)
!733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !634, size: 32, elements: !734)
!734 = !{!735}
!735 = !DISubrange(count: 4)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !721, file: !722, line: 168, baseType: !633, size: 64, offset: 128)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !721, file: !722, line: 169, baseType: !633, size: 64, offset: 192)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !721, file: !722, line: 170, baseType: !633, size: 64, offset: 256)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !721, file: !722, line: 171, baseType: !725, size: 64, offset: 320)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !721, file: !722, line: 172, baseType: !631, size: 32, offset: 384)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !721, file: !722, line: 176, baseType: !742, size: 64, offset: 448)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DISubroutineType(types: !744)
!744 = !{!727, !635, !725}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !721, file: !722, line: 177, baseType: !746, size: 64, offset: 512)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{null, !635, !727}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !721, file: !722, line: 178, baseType: !635, size: 64, offset: 576)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !721, file: !722, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !721, file: !722, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !721, file: !722, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !659, file: !406, line: 177, baseType: !754, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !639, line: 56, baseType: !755)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !171, line: 3371, size: 1792, elements: !757)
!757 = !{!758, !791, !797, !808, !827, !838, !843, !850, !856, !869, !881, !919, !924, !952, !960, !961, !966, !975, !981, !986, !990, !994, !1416, !1465, !1471, !1477, !1484, !1507, !1521, !1538, !1550, !1572, !1587, !1759}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !756, file: !171, line: 3372, baseType: !759, size: 64)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !171, line: 360, size: 64, elements: !760)
!760 = !{!761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !759, file: !171, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !759, file: !171, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !759, file: !171, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !759, file: !171, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !759, file: !171, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !759, file: !171, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !759, file: !171, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !759, file: !171, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !759, file: !171, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !759, file: !171, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !759, file: !171, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !759, file: !171, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !759, file: !171, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !759, file: !171, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !759, file: !171, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !759, file: !171, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !759, file: !171, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !759, file: !171, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !759, file: !171, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !759, file: !171, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !759, file: !171, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !759, file: !171, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !759, file: !171, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !759, file: !171, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !759, file: !171, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !759, file: !171, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !759, file: !171, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !759, file: !171, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !759, file: !171, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !759, file: !171, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !756, file: !171, line: 3373, baseType: !792, size: 192)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !171, line: 402, size: 192, elements: !793)
!793 = !{!794, !795, !796}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !792, file: !171, line: 403, baseType: !759, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !792, file: !171, line: 404, baseType: !754, size: 64, offset: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !792, file: !171, line: 405, baseType: !754, size: 64, offset: 128)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !756, file: !171, line: 3374, baseType: !798, size: 320)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !171, line: 1384, size: 320, elements: !799)
!799 = !{!800, !801}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !798, file: !171, line: 1385, baseType: !792, size: 192)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !798, file: !171, line: 1386, baseType: !802, size: 128, offset: 192)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !803, line: 58, baseType: !804)
!803 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !803, line: 54, size: 128, elements: !805)
!805 = !{!806, !807}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !804, file: !803, line: 56, baseType: !708, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !804, file: !803, line: 57, baseType: !725, size: 64, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !756, file: !171, line: 3375, baseType: !809, size: 256)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !171, line: 1397, size: 256, elements: !810)
!810 = !{!811, !812}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !809, file: !171, line: 1398, baseType: !792, size: 192)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !809, file: !171, line: 1399, baseType: !813, size: 64, offset: 192)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !815, line: 52, size: 256, elements: !816)
!815 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!816 = !{!817, !818, !819, !820, !821, !822, !823}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !814, file: !815, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !814, file: !815, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !814, file: !815, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !814, file: !815, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !814, file: !815, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !814, file: !815, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !814, file: !815, line: 62, baseType: !824, size: 192, offset: 64)
!824 = !DICompositeType(tag: DW_TAG_array_type, baseType: !708, size: 192, elements: !825)
!825 = !{!826}
!826 = !DISubrange(count: 3)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !756, file: !171, line: 3376, baseType: !828, size: 256)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !171, line: 1408, size: 256, elements: !829)
!829 = !{!830, !831}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !828, file: !171, line: 1409, baseType: !792, size: 192)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !828, file: !171, line: 1410, baseType: !832, size: 64, offset: 192)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !834, line: 27, size: 192, elements: !835)
!834 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!835 = !{!836, !837}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !833, file: !834, line: 29, baseType: !802, size: 128)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !833, file: !834, line: 30, baseType: !5, size: 32, offset: 128)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !756, file: !171, line: 3377, baseType: !839, size: 256)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !171, line: 1437, size: 256, elements: !840)
!840 = !{!841, !842}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !839, file: !171, line: 1438, baseType: !792, size: 192)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !839, file: !171, line: 1439, baseType: !754, size: 64, offset: 192)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !756, file: !171, line: 3378, baseType: !844, size: 256)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !171, line: 1418, size: 256, elements: !845)
!845 = !{!846, !847, !848}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !844, file: !171, line: 1419, baseType: !792, size: 192)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !844, file: !171, line: 1420, baseType: !631, size: 32, offset: 192)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !844, file: !171, line: 1421, baseType: !849, size: 8, offset: 224)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !634, size: 8, elements: !673)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !756, file: !171, line: 3379, baseType: !851, size: 320)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !171, line: 1428, size: 320, elements: !852)
!852 = !{!853, !854, !855}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !851, file: !171, line: 1429, baseType: !792, size: 192)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !851, file: !171, line: 1430, baseType: !754, size: 64, offset: 192)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !851, file: !171, line: 1431, baseType: !754, size: 64, offset: 256)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !756, file: !171, line: 3380, baseType: !857, size: 320)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !171, line: 1460, size: 320, elements: !858)
!858 = !{!859, !860}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !857, file: !171, line: 1461, baseType: !792, size: 192)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !857, file: !171, line: 1462, baseType: !861, size: 128, offset: 192)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !862, line: 31, size: 128, elements: !863)
!862 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!863 = !{!864, !867, !868}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !861, file: !862, line: 32, baseType: !865, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !630)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !861, file: !862, line: 33, baseType: !7, size: 32, offset: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !861, file: !862, line: 34, baseType: !7, size: 32, offset: 96)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !756, file: !171, line: 3381, baseType: !870, size: 384)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !171, line: 2507, size: 384, elements: !871)
!871 = !{!872, !873, !878, !879, !880}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !870, file: !171, line: 2508, baseType: !792, size: 192)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !870, file: !171, line: 2509, baseType: !874, size: 32, offset: 192)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !875, line: 58, baseType: !876)
!875 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !877, line: 44, baseType: !7)
!877 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!878 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !870, file: !171, line: 2510, baseType: !7, size: 32, offset: 224)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !870, file: !171, line: 2511, baseType: !754, size: 64, offset: 256)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !870, file: !171, line: 2512, baseType: !754, size: 64, offset: 320)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !756, file: !171, line: 3382, baseType: !882, size: 896)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !171, line: 2652, size: 896, elements: !883)
!883 = !{!884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !882, file: !171, line: 2653, baseType: !870, size: 384)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !882, file: !171, line: 2654, baseType: !754, size: 64, offset: 384)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !882, file: !171, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !882, file: !171, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !882, file: !171, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !882, file: !171, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !882, file: !171, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !882, file: !171, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !882, file: !171, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !882, file: !171, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !882, file: !171, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !882, file: !171, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !882, file: !171, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !882, file: !171, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !882, file: !171, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !882, file: !171, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !882, file: !171, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !882, file: !171, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !882, file: !171, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !882, file: !171, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !882, file: !171, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !882, file: !171, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !882, file: !171, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !882, file: !171, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !882, file: !171, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !882, file: !171, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !882, file: !171, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !882, file: !171, line: 2703, baseType: !7, size: 32, offset: 512)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !882, file: !171, line: 2705, baseType: !754, size: 64, offset: 576)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !882, file: !171, line: 2706, baseType: !754, size: 64, offset: 640)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !882, file: !171, line: 2707, baseType: !754, size: 64, offset: 704)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !882, file: !171, line: 2708, baseType: !754, size: 64, offset: 768)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !882, file: !171, line: 2711, baseType: !917, size: 64, offset: 832)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !171, line: 2711, flags: DIFlagFwdDecl)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !756, file: !171, line: 3383, baseType: !920, size: 960)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !171, line: 2756, size: 960, elements: !921)
!921 = !{!922, !923}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !920, file: !171, line: 2757, baseType: !882, size: 896)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !920, file: !171, line: 2758, baseType: !638, size: 64, offset: 896)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !756, file: !171, line: 3384, baseType: !925, size: 1472)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !171, line: 3114, size: 1472, elements: !926)
!926 = !{!927, !948, !949, !950, !951}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !925, file: !171, line: 3115, baseType: !928, size: 1216)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !171, line: 2984, size: 1216, elements: !929)
!929 = !{!930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !928, file: !171, line: 2985, baseType: !920, size: 960)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !928, file: !171, line: 2986, baseType: !754, size: 64, offset: 960)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !928, file: !171, line: 2987, baseType: !754, size: 64, offset: 1024)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !928, file: !171, line: 2988, baseType: !754, size: 64, offset: 1088)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !928, file: !171, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !928, file: !171, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !928, file: !171, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !928, file: !171, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !928, file: !171, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !928, file: !171, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !928, file: !171, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !928, file: !171, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !928, file: !171, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !928, file: !171, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !928, file: !171, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !928, file: !171, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !928, file: !171, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !928, file: !171, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !925, file: !171, line: 3117, baseType: !754, size: 64, offset: 1216)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !925, file: !171, line: 3119, baseType: !754, size: 64, offset: 1280)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !925, file: !171, line: 3121, baseType: !754, size: 64, offset: 1344)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !925, file: !171, line: 3123, baseType: !754, size: 64, offset: 1408)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !756, file: !171, line: 3385, baseType: !953, size: 1088)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !171, line: 2874, size: 1088, elements: !954)
!954 = !{!955, !956, !957}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !953, file: !171, line: 2875, baseType: !920, size: 960)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !953, file: !171, line: 2876, baseType: !638, size: 64, offset: 960)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !953, file: !171, line: 2877, baseType: !958, size: 64, offset: 1024)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !171, line: 2856, flags: DIFlagFwdDecl)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !756, file: !171, line: 3386, baseType: !928, size: 1216)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !756, file: !171, line: 3387, baseType: !962, size: 1280)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !171, line: 3093, size: 1280, elements: !963)
!963 = !{!964, !965}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !962, file: !171, line: 3094, baseType: !928, size: 1216)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !962, file: !171, line: 3095, baseType: !958, size: 64, offset: 1216)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !756, file: !171, line: 3388, baseType: !967, size: 1216)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !171, line: 2824, size: 1216, elements: !968)
!968 = !{!969, !970, !971, !972, !973, !974}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !967, file: !171, line: 2825, baseType: !882, size: 896)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !967, file: !171, line: 2827, baseType: !754, size: 64, offset: 896)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !967, file: !171, line: 2828, baseType: !754, size: 64, offset: 960)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !967, file: !171, line: 2829, baseType: !754, size: 64, offset: 1024)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !967, file: !171, line: 2830, baseType: !754, size: 64, offset: 1088)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !967, file: !171, line: 2831, baseType: !754, size: 64, offset: 1152)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !756, file: !171, line: 3389, baseType: !976, size: 1024)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !171, line: 2850, size: 1024, elements: !977)
!977 = !{!978, !979, !980}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !976, file: !171, line: 2851, baseType: !920, size: 960)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !976, file: !171, line: 2852, baseType: !631, size: 32, offset: 960)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !976, file: !171, line: 2853, baseType: !631, size: 32, offset: 992)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !756, file: !171, line: 3390, baseType: !982, size: 1024)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !171, line: 2857, size: 1024, elements: !983)
!983 = !{!984, !985}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !982, file: !171, line: 2858, baseType: !920, size: 960)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !982, file: !171, line: 2859, baseType: !958, size: 64, offset: 960)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !756, file: !171, line: 3391, baseType: !987, size: 960)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !171, line: 2862, size: 960, elements: !988)
!988 = !{!989}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !987, file: !171, line: 2863, baseType: !920, size: 960)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !756, file: !171, line: 3392, baseType: !991, size: 1472)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !171, line: 3304, size: 1472, elements: !992)
!992 = !{!993}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !991, file: !171, line: 3305, baseType: !925, size: 1472)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !756, file: !171, line: 3393, baseType: !995, size: 1792)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !171, line: 3248, size: 1792, elements: !996)
!996 = !{!997, !998, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !995, file: !171, line: 3249, baseType: !925, size: 1472)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !995, file: !171, line: 3251, baseType: !999, size: 64, offset: 1472)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1001, line: 463, size: 1152, elements: !1002)
!1001 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1002 = !{!1003, !1167, !1327, !1328, !1331, !1339, !1340, !1341, !1342, !1343, !1344, !1368, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1000, file: !1001, line: 464, baseType: !1004, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !135, line: 194, size: 384, elements: !1006)
!1006 = !{!1007, !1056, !1069, !1083, !1135, !1148}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !1005, file: !135, line: 197, baseType: !1008, size: 64)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !135, line: 182, baseType: !1009)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !135, line: 116, size: 704, elements: !1011)
!1011 = !{!1012, !1013, !1014, !1015, !1016, !1017, !1044, !1053, !1054, !1055}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !1010, file: !135, line: 119, baseType: !1009, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1010, file: !135, line: 122, baseType: !1009, size: 64, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !1010, file: !135, line: 123, baseType: !1009, size: 64, offset: 128)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1010, file: !135, line: 126, baseType: !631, size: 32, offset: 192)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1010, file: !135, line: 129, baseType: !134, size: 32, offset: 224)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1010, file: !135, line: 165, baseType: !1018, size: 192, offset: 256)
!1018 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !135, line: 132, size: 192, elements: !1019)
!1019 = !{!1020, !1033, !1039}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !1018, file: !135, line: 137, baseType: !1021, size: 128)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !135, line: 133, size: 128, elements: !1022)
!1022 = !{!1023, !1032}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !1021, file: !135, line: 135, baseType: !1024, size: 64)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !135, line: 93, size: 320, elements: !1026)
!1026 = !{!1027, !1028, !1029, !1030, !1031}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !1025, file: !135, line: 96, baseType: !1024, size: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !1025, file: !135, line: 97, baseType: !1024, size: 64, offset: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1025, file: !135, line: 101, baseType: !754, size: 64, offset: 128)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !1025, file: !135, line: 106, baseType: !754, size: 64, offset: 192)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1025, file: !135, line: 111, baseType: !754, size: 64, offset: 256)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !1021, file: !135, line: 136, baseType: !1024, size: 64, offset: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !1018, file: !135, line: 151, baseType: !1034, size: 192)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !135, line: 139, size: 192, elements: !1035)
!1035 = !{!1036, !1037, !1038}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1034, file: !135, line: 141, baseType: !754, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1034, file: !135, line: 145, baseType: !754, size: 64, offset: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1034, file: !135, line: 150, baseType: !631, size: 32, offset: 128)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !1018, file: !135, line: 164, baseType: !1040, size: 128)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !135, line: 153, size: 128, elements: !1041)
!1041 = !{!1042, !1043}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !1040, file: !135, line: 161, baseType: !754, size: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !1040, file: !135, line: 163, baseType: !874, size: 32, offset: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !1010, file: !135, line: 168, baseType: !1045, size: 64, offset: 448)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !135, line: 67, size: 320, elements: !1047)
!1047 = !{!1048, !1049, !1050, !1051, !1052}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !1046, file: !135, line: 70, baseType: !1045, size: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1046, file: !135, line: 73, baseType: !1009, size: 64, offset: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !1046, file: !135, line: 78, baseType: !754, size: 64, offset: 128)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !1046, file: !135, line: 85, baseType: !638, size: 64, offset: 192)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1046, file: !135, line: 88, baseType: !631, size: 32, offset: 256)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !1010, file: !135, line: 173, baseType: !638, size: 64, offset: 512)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !1010, file: !135, line: 173, baseType: !638, size: 64, offset: 576)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !1010, file: !135, line: 177, baseType: !630, size: 8, offset: 640)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !1005, file: !135, line: 200, baseType: !1057, size: 64, offset: 64)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !135, line: 185, baseType: !1059)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !135, line: 185, size: 128, elements: !1060)
!1060 = !{!1061}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1059, file: !135, line: 185, baseType: !1062, size: 128)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !135, line: 184, baseType: !1063)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !135, line: 184, size: 128, elements: !1064)
!1064 = !{!1065, !1066, !1067}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1063, file: !135, line: 184, baseType: !7, size: 32)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1063, file: !135, line: 184, baseType: !7, size: 32, offset: 32)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1063, file: !135, line: 184, baseType: !1068, size: 64, offset: 64)
!1068 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1008, size: 64, elements: !673)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !1005, file: !135, line: 203, baseType: !1070, size: 64, offset: 128)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, baseType: !1072)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, size: 128, elements: !1073)
!1073 = !{!1074}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1072, file: !135, line: 189, baseType: !1075, size: 128)
!1075 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !135, line: 188, baseType: !1076)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !135, line: 188, size: 128, elements: !1077)
!1077 = !{!1078, !1079, !1080}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1076, file: !135, line: 188, baseType: !7, size: 32)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1076, file: !135, line: 188, baseType: !7, size: 32, offset: 32)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1076, file: !135, line: 188, baseType: !1081, size: 64, offset: 64)
!1081 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1082, size: 64, elements: !673)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !135, line: 180, baseType: !1045)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !1005, file: !135, line: 207, baseType: !1084, size: 64, offset: 192)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1085, line: 144, baseType: !1086)
!1085 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1085, line: 100, size: 896, elements: !1088)
!1088 = !{!1089, !1097, !1102, !1107, !1109, !1112, !1113, !1114, !1115, !1116, !1121, !1123, !1124, !1129, !1134}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1087, file: !1085, line: 102, baseType: !1090, size: 64)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1085, line: 52, baseType: !1091)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!1094, !1095}
!1094 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1085, line: 47, baseType: !7)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1096 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1087, file: !1085, line: 105, baseType: !1098, size: 64, offset: 64)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1085, line: 59, baseType: !1099)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64)
!1100 = !DISubroutineType(types: !1101)
!1101 = !{!631, !1095, !1095}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1087, file: !1085, line: 108, baseType: !1103, size: 64, offset: 128)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1085, line: 63, baseType: !1104)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1105 = !DISubroutineType(types: !1106)
!1106 = !{null, !635}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1087, file: !1085, line: 111, baseType: !1108, size: 64, offset: 192)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1087, file: !1085, line: 114, baseType: !1110, size: 64, offset: 256)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1111, line: 46, baseType: !708)
!1111 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1087, file: !1085, line: 117, baseType: !1110, size: 64, offset: 320)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1087, file: !1085, line: 120, baseType: !1110, size: 64, offset: 384)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1087, file: !1085, line: 124, baseType: !7, size: 32, offset: 448)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1087, file: !1085, line: 128, baseType: !7, size: 32, offset: 480)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1087, file: !1085, line: 131, baseType: !1117, size: 64, offset: 512)
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1085, line: 75, baseType: !1118)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64)
!1119 = !DISubroutineType(types: !1120)
!1120 = !{!635, !1110, !1110}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1087, file: !1085, line: 132, baseType: !1122, size: 64, offset: 576)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1085, line: 78, baseType: !1104)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1087, file: !1085, line: 135, baseType: !635, size: 64, offset: 640)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1087, file: !1085, line: 136, baseType: !1125, size: 64, offset: 704)
!1125 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1085, line: 82, baseType: !1126)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = !DISubroutineType(types: !1128)
!1128 = !{!635, !635, !1110, !1110}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1087, file: !1085, line: 137, baseType: !1130, size: 64, offset: 768)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1085, line: 83, baseType: !1131)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64)
!1132 = !DISubroutineType(types: !1133)
!1133 = !{null, !635, !635}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1087, file: !1085, line: 141, baseType: !7, size: 32, offset: 832)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !1005, file: !135, line: 211, baseType: !1136, size: 64, offset: 256)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !171, line: 183, baseType: !1138)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !171, line: 183, size: 128, elements: !1139)
!1139 = !{!1140}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1138, file: !171, line: 183, baseType: !1141, size: 128)
!1141 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !171, line: 182, baseType: !1142)
!1142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !171, line: 182, size: 128, elements: !1143)
!1143 = !{!1144, !1145, !1146}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1142, file: !171, line: 182, baseType: !7, size: 32)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1142, file: !171, line: 182, baseType: !7, size: 32, offset: 32)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1142, file: !171, line: 182, baseType: !1147, size: 64, offset: 64)
!1147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !754, size: 64, elements: !673)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !1005, file: !135, line: 220, baseType: !1149, size: 64, offset: 320)
!1149 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !135, line: 217, size: 64, elements: !1150)
!1150 = !{!1151, !1152}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !1149, file: !135, line: 218, baseType: !1136, size: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !1149, file: !135, line: 219, baseType: !1153, size: 64)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64)
!1154 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !1155, line: 29, baseType: !1156)
!1155 = !DIFile(filename: "./vecprim.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !1155, line: 29, size: 96, elements: !1157)
!1157 = !{!1158}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1156, file: !1155, line: 29, baseType: !1159, size: 96)
!1159 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !1155, line: 27, baseType: !1160)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !1155, line: 27, size: 96, elements: !1161)
!1161 = !{!1162, !1163, !1164}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1160, file: !1155, line: 27, baseType: !7, size: 32)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1160, file: !1155, line: 27, baseType: !7, size: 32, offset: 32)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1160, file: !1155, line: 27, baseType: !1165, size: 8, offset: 64)
!1165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1166, size: 8, elements: !673)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !1155, line: 26, baseType: !630)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1000, file: !1001, line: 467, baseType: !1168, size: 64, offset: 64)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64)
!1169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !155, line: 374, size: 640, elements: !1170)
!1170 = !{!1171, !1302, !1303, !1316, !1317, !1318, !1319, !1320, !1321, !1323, !1325, !1326}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1169, file: !155, line: 377, baseType: !1172, size: 64)
!1172 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !639, line: 111, baseType: !1173)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64)
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !155, line: 217, size: 832, elements: !1175)
!1175 = !{!1176, !1211, !1212, !1213, !1272, !1276, !1277, !1278, !1296, !1297, !1298, !1299, !1300, !1301}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1174, file: !155, line: 219, baseType: !1177, size: 64)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64)
!1178 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !155, line: 151, baseType: !1179)
!1179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !155, line: 151, size: 128, elements: !1180)
!1180 = !{!1181}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1179, file: !155, line: 151, baseType: !1182, size: 128)
!1182 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !155, line: 150, baseType: !1183)
!1183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !155, line: 150, size: 128, elements: !1184)
!1184 = !{!1185, !1186, !1187}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1183, file: !155, line: 150, baseType: !7, size: 32)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1183, file: !155, line: 150, baseType: !7, size: 32, offset: 32)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1183, file: !155, line: 150, baseType: !1188, size: 64, offset: 64)
!1188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1189, size: 64, elements: !673)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !639, line: 108, baseType: !1190)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64)
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !155, line: 122, size: 512, elements: !1192)
!1192 = !{!1193, !1194, !1195, !1203, !1204, !1205, !1206, !1207, !1208, !1209}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1191, file: !155, line: 124, baseType: !1173, size: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1191, file: !155, line: 125, baseType: !1173, size: 64, offset: 64)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1191, file: !155, line: 131, baseType: !1196, size: 64, offset: 128)
!1196 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !155, line: 128, size: 64, elements: !1197)
!1197 = !{!1198, !1202}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1196, file: !155, line: 129, baseType: !1199, size: 64)
!1199 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !639, line: 66, baseType: !1200)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64)
!1201 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !639, line: 65, flags: DIFlagFwdDecl)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1196, file: !155, line: 130, baseType: !638, size: 64)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1191, file: !155, line: 134, baseType: !635, size: 64, offset: 192)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1191, file: !155, line: 137, baseType: !754, size: 64, offset: 256)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1191, file: !155, line: 138, baseType: !874, size: 32, offset: 320)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1191, file: !155, line: 142, baseType: !7, size: 32, offset: 352)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1191, file: !155, line: 144, baseType: !631, size: 32, offset: 384)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1191, file: !155, line: 145, baseType: !631, size: 32, offset: 416)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1191, file: !155, line: 146, baseType: !1210, size: 64, offset: 448)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !155, line: 119, baseType: !725)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1174, file: !155, line: 220, baseType: !1177, size: 64, offset: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1174, file: !155, line: 223, baseType: !635, size: 64, offset: 128)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1174, file: !155, line: 226, baseType: !1214, size: 64, offset: 192)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64)
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !142, line: 100, size: 1216, elements: !1216)
!1216 = !{!1217, !1218, !1219, !1220, !1221, !1226, !1227, !1228, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1262, !1270, !1271}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1215, file: !142, line: 102, baseType: !631, size: 32)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1215, file: !142, line: 105, baseType: !7, size: 32, offset: 32)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1215, file: !142, line: 108, baseType: !1173, size: 64, offset: 64)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1215, file: !142, line: 111, baseType: !1173, size: 64, offset: 128)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1215, file: !142, line: 114, baseType: !1222, size: 64, offset: 192)
!1222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !142, line: 41, size: 64, elements: !1223)
!1223 = !{!1224, !1225}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1222, file: !142, line: 42, baseType: !141, size: 32)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1222, file: !142, line: 43, baseType: !7, size: 32, offset: 32)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1215, file: !142, line: 117, baseType: !7, size: 32, offset: 256)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1215, file: !142, line: 120, baseType: !7, size: 32, offset: 288)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1215, file: !142, line: 123, baseType: !1229, size: 64, offset: 320)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64)
!1230 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !142, line: 87, baseType: !1231)
!1231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !142, line: 87, size: 128, elements: !1232)
!1232 = !{!1233}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1231, file: !142, line: 87, baseType: !1234, size: 128)
!1234 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !142, line: 85, baseType: !1235)
!1235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !142, line: 85, size: 128, elements: !1236)
!1236 = !{!1237, !1238, !1239}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1235, file: !142, line: 85, baseType: !7, size: 32)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1235, file: !142, line: 85, baseType: !7, size: 32, offset: 32)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1235, file: !142, line: 85, baseType: !1240, size: 64, offset: 64)
!1240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1241, size: 64, elements: !673)
!1241 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !142, line: 84, baseType: !1214)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1215, file: !142, line: 126, baseType: !1214, size: 64, offset: 384)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1215, file: !142, line: 129, baseType: !1214, size: 64, offset: 448)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1215, file: !142, line: 132, baseType: !635, size: 64, offset: 512)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1215, file: !142, line: 139, baseType: !754, size: 64, offset: 576)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1215, file: !142, line: 143, baseType: !802, size: 128, offset: 640)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1215, file: !142, line: 146, baseType: !802, size: 128, offset: 768)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1215, file: !142, line: 148, baseType: !630, size: 8, offset: 896)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1215, file: !142, line: 149, baseType: !630, size: 8, offset: 904)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1215, file: !142, line: 153, baseType: !150, size: 32, offset: 928)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1215, file: !142, line: 156, baseType: !1252, size: 64, offset: 960)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64)
!1253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !142, line: 48, size: 320, elements: !1254)
!1254 = !{!1255, !1259, !1260, !1261}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1253, file: !142, line: 50, baseType: !1256, size: 64)
!1256 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !639, line: 58, baseType: !1257)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64)
!1258 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !639, line: 57, flags: DIFlagFwdDecl)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1253, file: !142, line: 59, baseType: !802, size: 128, offset: 64)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1253, file: !142, line: 64, baseType: !630, size: 8, offset: 192)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1253, file: !142, line: 67, baseType: !1252, size: 64, offset: 256)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1215, file: !142, line: 159, baseType: !1263, size: 64, offset: 1024)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64)
!1264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !142, line: 72, size: 256, elements: !1265)
!1265 = !{!1266, !1267, !1268, !1269}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1264, file: !142, line: 74, baseType: !1190, size: 64)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1264, file: !142, line: 77, baseType: !1263, size: 64, offset: 64)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1264, file: !142, line: 78, baseType: !1263, size: 64, offset: 128)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1264, file: !142, line: 81, baseType: !1263, size: 64, offset: 192)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1215, file: !142, line: 162, baseType: !630, size: 8, offset: 1088)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1215, file: !142, line: 166, baseType: !754, size: 64, offset: 1152)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1174, file: !155, line: 229, baseType: !1273, size: 128, offset: 256)
!1273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1274, size: 128, elements: !709)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64)
!1275 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !155, line: 229, flags: DIFlagFwdDecl)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1174, file: !155, line: 232, baseType: !1173, size: 64, offset: 384)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1174, file: !155, line: 233, baseType: !1173, size: 64, offset: 448)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1174, file: !155, line: 238, baseType: !1279, size: 64, offset: 512)
!1279 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !155, line: 235, size: 64, elements: !1280)
!1280 = !{!1281, !1287}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1279, file: !155, line: 236, baseType: !1282, size: 64)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64)
!1283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !155, line: 273, size: 128, elements: !1284)
!1284 = !{!1285, !1286}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1283, file: !155, line: 275, baseType: !1199, size: 64)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1283, file: !155, line: 278, baseType: !1199, size: 64, offset: 64)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1279, file: !155, line: 237, baseType: !1288, size: 64)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64)
!1289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !155, line: 259, size: 320, elements: !1290)
!1290 = !{!1291, !1292, !1293, !1294, !1295}
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1289, file: !155, line: 261, baseType: !638, size: 64)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1289, file: !155, line: 262, baseType: !638, size: 64, offset: 64)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1289, file: !155, line: 266, baseType: !638, size: 64, offset: 128)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1289, file: !155, line: 267, baseType: !638, size: 64, offset: 192)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1289, file: !155, line: 270, baseType: !631, size: 32, offset: 256)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1174, file: !155, line: 241, baseType: !1210, size: 64, offset: 576)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1174, file: !155, line: 244, baseType: !631, size: 32, offset: 640)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1174, file: !155, line: 247, baseType: !631, size: 32, offset: 672)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1174, file: !155, line: 250, baseType: !631, size: 32, offset: 704)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1174, file: !155, line: 253, baseType: !631, size: 32, offset: 736)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1174, file: !155, line: 256, baseType: !631, size: 32, offset: 768)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1169, file: !155, line: 378, baseType: !1172, size: 64, offset: 64)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1169, file: !155, line: 381, baseType: !1304, size: 64, offset: 128)
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64)
!1305 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !155, line: 282, baseType: !1306)
!1306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !155, line: 282, size: 128, elements: !1307)
!1307 = !{!1308}
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1306, file: !155, line: 282, baseType: !1309, size: 128)
!1309 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !155, line: 281, baseType: !1310)
!1310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !155, line: 281, size: 128, elements: !1311)
!1311 = !{!1312, !1313, !1314}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1310, file: !155, line: 281, baseType: !7, size: 32)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1310, file: !155, line: 281, baseType: !7, size: 32, offset: 32)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1310, file: !155, line: 281, baseType: !1315, size: 64, offset: 64)
!1315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1172, size: 64, elements: !673)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1169, file: !155, line: 384, baseType: !631, size: 32, offset: 192)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1169, file: !155, line: 387, baseType: !631, size: 32, offset: 224)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1169, file: !155, line: 390, baseType: !631, size: 32, offset: 256)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1169, file: !155, line: 394, baseType: !1304, size: 64, offset: 320)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1169, file: !155, line: 396, baseType: !154, size: 32, offset: 384)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1169, file: !155, line: 399, baseType: !1322, size: 64, offset: 416)
!1322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 64, elements: !709)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1169, file: !155, line: 402, baseType: !1324, size: 64, offset: 480)
!1324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !709)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1169, file: !155, line: 406, baseType: !631, size: 32, offset: 544)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1169, file: !155, line: 409, baseType: !631, size: 32, offset: 576)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1000, file: !1001, line: 470, baseType: !1200, size: 64, offset: 128)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1000, file: !1001, line: 473, baseType: !1329, size: 64, offset: 192)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64)
!1330 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1001, line: 166, flags: DIFlagFwdDecl)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1000, file: !1001, line: 476, baseType: !1332, size: 64, offset: 256)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64)
!1333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !142, line: 187, size: 256, elements: !1334)
!1334 = !{!1335, !1336, !1337, !1338}
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1333, file: !142, line: 189, baseType: !631, size: 32)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !1333, file: !142, line: 192, baseType: !1229, size: 64, offset: 64)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1333, file: !142, line: 197, baseType: !1084, size: 64, offset: 128)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !1333, file: !142, line: 200, baseType: !1214, size: 64, offset: 192)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1000, file: !1001, line: 479, baseType: !1084, size: 64, offset: 320)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1000, file: !1001, line: 484, baseType: !754, size: 64, offset: 384)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1000, file: !1001, line: 488, baseType: !754, size: 64, offset: 448)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1000, file: !1001, line: 493, baseType: !754, size: 64, offset: 512)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1000, file: !1001, line: 496, baseType: !754, size: 64, offset: 576)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1000, file: !1001, line: 501, baseType: !1345, size: 64, offset: 640)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64)
!1346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !166, line: 2355, size: 576, elements: !1347)
!1347 = !{!1348, !1351, !1352, !1353, !1354, !1356, !1357, !1362, !1363, !1364, !1365, !1366, !1367}
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1346, file: !166, line: 2356, baseType: !1349, size: 64)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64)
!1350 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !166, line: 2356, flags: DIFlagFwdDecl)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1346, file: !166, line: 2357, baseType: !636, size: 64, offset: 64)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1346, file: !166, line: 2358, baseType: !631, size: 32, offset: 128)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1346, file: !166, line: 2359, baseType: !631, size: 32, offset: 160)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1346, file: !166, line: 2360, baseType: !1355, size: 128, offset: 192)
!1355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !631, size: 128, elements: !734)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1346, file: !166, line: 2364, baseType: !631, size: 32, offset: 320)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1346, file: !166, line: 2367, baseType: !1358, size: 128, offset: 384)
!1358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !166, line: 2349, size: 128, elements: !1359)
!1359 = !{!1360, !1361}
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1358, file: !166, line: 2351, baseType: !638, size: 64)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1358, file: !166, line: 2352, baseType: !725, size: 64, offset: 64)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1346, file: !166, line: 2371, baseType: !165, size: 32, offset: 512)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1346, file: !166, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1346, file: !166, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1346, file: !166, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1346, file: !166, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1346, file: !166, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1000, file: !1001, line: 504, baseType: !1369, size: 64, offset: 704)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64)
!1370 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1001, line: 504, flags: DIFlagFwdDecl)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1000, file: !1001, line: 507, baseType: !1084, size: 64, offset: 768)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1000, file: !1001, line: 510, baseType: !631, size: 32, offset: 832)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1000, file: !1001, line: 513, baseType: !631, size: 32, offset: 864)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1000, file: !1001, line: 516, baseType: !874, size: 32, offset: 896)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1000, file: !1001, line: 519, baseType: !874, size: 32, offset: 928)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1000, file: !1001, line: 522, baseType: !7, size: 32, offset: 960)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1000, file: !1001, line: 523, baseType: !7, size: 32, offset: 992)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1000, file: !1001, line: 528, baseType: !636, size: 64, offset: 1024)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1000, file: !1001, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1000, file: !1001, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1000, file: !1001, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1000, file: !1001, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1000, file: !1001, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1000, file: !1001, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1000, file: !1001, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1000, file: !1001, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1000, file: !1001, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1000, file: !1001, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1000, file: !1001, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1000, file: !1001, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1000, file: !1001, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1000, file: !1001, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1000, file: !1001, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1000, file: !1001, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !995, file: !171, line: 3254, baseType: !754, size: 64, offset: 1536)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !995, file: !171, line: 3257, baseType: !754, size: 64, offset: 1600)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !995, file: !171, line: 3258, baseType: !754, size: 64, offset: 1664)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !995, file: !171, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !995, file: !171, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !995, file: !171, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !995, file: !171, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
