; ModuleID = 'hashtab.bc'
source_filename = "hashtab.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.prime_ent = type { i32, i32, i32, i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.htab = type { i32 (i8*)*, i32 (i8*, i8*)*, void (i8*)*, i8**, i64, i64, i64, i32, i32, i8* (i64, i64)*, void (i8*)*, i8*, i8* (i8*, i64, i64)*, void (i8*, i8*)*, i32 }

@stdout = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@stdin = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@htab_hash_pointer = dso_local local_unnamed_addr global i32 (i8*)* @hash_pointer, align 8, !dbg !0
@htab_eq_pointer = dso_local local_unnamed_addr global i32 (i8*, i8*)* @eq_pointer, align 8, !dbg !80

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "htab_hash_pointer", scope: !2, file: !3, line: 86, type: !26, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !11, globals: !79, nameTableKind: None)
!3 = !DIFile(filename: "hashtab.c", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "insert_option", file: !6, line: 147, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "NO_INSERT", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "INSERT", value: 1, isUnsigned: true)
!11 = !{!12, !13, !16, !17, !19, !20, !21, !44, !72, !73, !46, !75, !30, !76}
!12 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !6, line: 144, baseType: !22)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !6, line: 100, size: 896, elements: !24)
!24 = !{!25, !33, !38, !43, !45, !49, !50, !51, !52, !53, !58, !60, !61, !66, !71}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !23, file: !6, line: 102, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !6, line: 52, baseType: !27)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DISubroutineType(types: !29)
!29 = !{!30, !31}
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !6, line: 47, baseType: !7)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !23, file: !6, line: 105, baseType: !34, size: 64, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !6, line: 59, baseType: !35)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DISubroutineType(types: !37)
!37 = !{!12, !31, !31}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !23, file: !6, line: 108, baseType: !39, size: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !6, line: 63, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{null, !16}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !23, file: !6, line: 111, baseType: !44, size: 64, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !23, file: !6, line: 114, baseType: !46, size: 64, offset: 256)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !47, line: 46, baseType: !48)
!47 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!48 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !23, file: !6, line: 117, baseType: !46, size: 64, offset: 320)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !23, file: !6, line: 120, baseType: !46, size: 64, offset: 384)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !23, file: !6, line: 124, baseType: !7, size: 32, offset: 448)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !23, file: !6, line: 128, baseType: !7, size: 32, offset: 480)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !23, file: !6, line: 131, baseType: !54, size: 64, offset: 512)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !6, line: 75, baseType: !55)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{!16, !46, !46}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !23, file: !6, line: 132, baseType: !59, size: 64, offset: 576)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !6, line: 78, baseType: !40)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !23, file: !6, line: 135, baseType: !16, size: 64, offset: 640)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !23, file: !6, line: 136, baseType: !62, size: 64, offset: 704)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !6, line: 82, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{!16, !16, !46, !46}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !23, file: !6, line: 137, baseType: !67, size: 64, offset: 768)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !6, line: 83, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{null, !16, !16}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !23, file: !6, line: 141, baseType: !7, size: 32, offset: 832)
!72 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !77, line: 87, baseType: !78)
!77 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!78 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!79 = !{!0, !80, !82}
!80 = !DIGlobalVariableExpression(var: !81, expr: !DIExpression())
!81 = distinct !DIGlobalVariable(name: "htab_eq_pointer", scope: !2, file: !3, line: 87, type: !34, isLocal: false, isDefinition: true)
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(name: "prime_tab", scope: !2, file: !3, line: 139, type: !84, isLocal: true, isDefinition: true)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 3840, elements: !92)
!85 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prime_ent", file: !3, line: 131, size: 128, elements: !87)
!87 = !{!88, !89, !90, !91}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "prime", scope: !86, file: !3, line: 133, baseType: !30, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "inv", scope: !86, file: !3, line: 134, baseType: !30, size: 32, offset: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "inv_m2", scope: !86, file: !3, line: 135, baseType: !30, size: 32, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !86, file: !3, line: 136, baseType: !30, size: 32, offset: 96)
!92 = !{!93}
!93 = !DISubrange(count: 30)
!94 = !{i32 2, !"Dwarf Version", i32 4}
!95 = !{i32 2, !"Debug Info Version", i32 3}
!96 = !{i32 1, !"wchar_size", i32 4}
!97 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!98 = distinct !DISubprogram(name: "atoi", scope: !99, file: !99, line: 361, type: !100, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !102)
!99 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!100 = !DISubroutineType(types: !101)
!101 = !{!12, !17}
!102 = !{!103}
!103 = !DILocalVariable(name: "__nptr", arg: 1, scope: !98, file: !99, line: 361, type: !17)
!104 = !DILocation(line: 0, scope: !98)
!105 = !DILocation(line: 363, column: 16, scope: !98)
!106 = !DILocation(line: 363, column: 10, scope: !98)
!107 = !DILocation(line: 363, column: 3, scope: !98)
!108 = distinct !DISubprogram(name: "atol", scope: !99, file: !99, line: 366, type: !109, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !111)
!109 = !DISubroutineType(types: !110)
!110 = !{!78, !17}
!111 = !{!112}
!112 = !DILocalVariable(name: "__nptr", arg: 1, scope: !108, file: !99, line: 366, type: !17)
!113 = !DILocation(line: 0, scope: !108)
!114 = !DILocation(line: 368, column: 10, scope: !108)
!115 = !DILocation(line: 368, column: 3, scope: !108)
!116 = distinct !DISubprogram(name: "atoll", scope: !99, file: !99, line: 373, type: !117, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !120)
!117 = !DISubroutineType(types: !118)
!118 = !{!119, !17}
!119 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!120 = !{!121}
!121 = !DILocalVariable(name: "__nptr", arg: 1, scope: !116, file: !99, line: 373, type: !17)
!122 = !DILocation(line: 0, scope: !116)
!123 = !DILocation(line: 375, column: 10, scope: !116)
!124 = !DILocation(line: 375, column: 3, scope: !116)
!125 = distinct !DISubprogram(name: "bsearch", scope: !126, file: !126, line: 20, type: !127, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !130)
!126 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!127 = !DISubroutineType(types: !128)
!128 = !{!16, !31, !31, !46, !46, !129}
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !99, line: 808, baseType: !35)
!130 = !{!131, !132, !133, !134, !135, !136, !137, !138, !139, !140}
!131 = !DILocalVariable(name: "__key", arg: 1, scope: !125, file: !126, line: 20, type: !31)
!132 = !DILocalVariable(name: "__base", arg: 2, scope: !125, file: !126, line: 20, type: !31)
!133 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !125, file: !126, line: 20, type: !46)
!134 = !DILocalVariable(name: "__size", arg: 4, scope: !125, file: !126, line: 20, type: !46)
!135 = !DILocalVariable(name: "__compar", arg: 5, scope: !125, file: !126, line: 21, type: !129)
!136 = !DILocalVariable(name: "__l", scope: !125, file: !126, line: 23, type: !46)
!137 = !DILocalVariable(name: "__u", scope: !125, file: !126, line: 23, type: !46)
!138 = !DILocalVariable(name: "__idx", scope: !125, file: !126, line: 23, type: !46)
!139 = !DILocalVariable(name: "__p", scope: !125, file: !126, line: 24, type: !31)
!140 = !DILocalVariable(name: "__comparison", scope: !125, file: !126, line: 25, type: !12)
!141 = !DILocation(line: 0, scope: !125)
!142 = !DILocation(line: 29, column: 3, scope: !125)
!143 = !DILocation(line: 27, column: 7, scope: !125)
!144 = !DILocation(line: 29, column: 14, scope: !125)
!145 = !DILocation(line: 31, column: 20, scope: !146)
!146 = distinct !DILexicalBlock(scope: !125, file: !126, line: 30, column: 5)
!147 = !DILocation(line: 31, column: 27, scope: !146)
!148 = !DILocation(line: 32, column: 56, scope: !146)
!149 = !DILocation(line: 32, column: 47, scope: !146)
!150 = !DILocation(line: 33, column: 22, scope: !146)
!151 = !DILocation(line: 34, column: 24, scope: !152)
!152 = distinct !DILexicalBlock(scope: !146, file: !126, line: 34, column: 11)
!153 = !DILocation(line: 34, column: 11, scope: !146)
!154 = !DILocation(line: 36, column: 29, scope: !155)
!155 = distinct !DILexicalBlock(scope: !152, file: !126, line: 36, column: 16)
!156 = !DILocation(line: 36, column: 16, scope: !152)
!157 = !DILocation(line: 37, column: 14, scope: !155)
!158 = distinct !{!158, !142, !159}
!159 = !DILocation(line: 40, column: 5, scope: !125)
!160 = !DILocation(line: 43, column: 1, scope: !125)
!161 = distinct !DISubprogram(name: "atof", scope: !162, file: !162, line: 25, type: !163, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !165)
!162 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!163 = !DISubroutineType(types: !164)
!164 = !{!72, !17}
!165 = !{!166}
!166 = !DILocalVariable(name: "__nptr", arg: 1, scope: !161, file: !162, line: 25, type: !17)
!167 = !DILocation(line: 0, scope: !161)
!168 = !DILocation(line: 27, column: 10, scope: !161)
!169 = !DILocation(line: 27, column: 3, scope: !161)
!170 = distinct !DISubprogram(name: "vprintf", scope: !171, file: !171, line: 39, type: !172, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !182)
!171 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!172 = !DISubroutineType(types: !173)
!173 = !{!12, !174, !175}
!174 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !17)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 28, size: 192, elements: !177)
!177 = !{!178, !179, !180, !181}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !176, file: !3, line: 28, baseType: !7, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !176, file: !3, line: 28, baseType: !7, size: 32, offset: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !176, file: !3, line: 28, baseType: !16, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !176, file: !3, line: 28, baseType: !16, size: 64, offset: 128)
!182 = !{!183, !184}
!183 = !DILocalVariable(name: "__fmt", arg: 1, scope: !170, file: !171, line: 39, type: !174)
!184 = !DILocalVariable(name: "__arg", arg: 2, scope: !170, file: !171, line: 39, type: !175)
!185 = !DILocation(line: 0, scope: !170)
!186 = !DILocation(line: 41, column: 20, scope: !170)
!187 = !DILocation(line: 41, column: 10, scope: !170)
!188 = !DILocation(line: 41, column: 3, scope: !170)
!189 = distinct !DISubprogram(name: "getchar", scope: !171, file: !171, line: 47, type: !190, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !192)
!190 = !DISubroutineType(types: !191)
!191 = !{!12}
!192 = !{}
!193 = !DILocation(line: 49, column: 16, scope: !189)
!194 = !DILocation(line: 49, column: 10, scope: !189)
!195 = !DILocation(line: 49, column: 3, scope: !189)
!196 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !171, file: !171, line: 56, type: !197, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !254)
!197 = !DISubroutineType(types: !198)
!198 = !{!12, !199}
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !201, line: 7, baseType: !202)
!201 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !203, line: 49, size: 1728, elements: !204)
!203 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!204 = !{!205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !220, !222, !223, !224, !227, !229, !231, !235, !238, !240, !243, !246, !247, !248, !249, !250}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !202, file: !203, line: 51, baseType: !12, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !202, file: !203, line: 54, baseType: !14, size: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !202, file: !203, line: 55, baseType: !14, size: 64, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !202, file: !203, line: 56, baseType: !14, size: 64, offset: 192)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !202, file: !203, line: 57, baseType: !14, size: 64, offset: 256)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !202, file: !203, line: 58, baseType: !14, size: 64, offset: 320)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !202, file: !203, line: 59, baseType: !14, size: 64, offset: 384)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !202, file: !203, line: 60, baseType: !14, size: 64, offset: 448)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !202, file: !203, line: 61, baseType: !14, size: 64, offset: 512)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !202, file: !203, line: 64, baseType: !14, size: 64, offset: 576)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !202, file: !203, line: 65, baseType: !14, size: 64, offset: 640)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !202, file: !203, line: 66, baseType: !14, size: 64, offset: 704)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !202, file: !203, line: 68, baseType: !218, size: 64, offset: 768)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !203, line: 36, flags: DIFlagFwdDecl)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !202, file: !203, line: 70, baseType: !221, size: 64, offset: 832)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !202, file: !203, line: 72, baseType: !12, size: 32, offset: 896)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !202, file: !203, line: 73, baseType: !12, size: 32, offset: 928)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !202, file: !203, line: 74, baseType: !225, size: 64, offset: 960)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !226, line: 152, baseType: !78)
!226 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !202, file: !203, line: 77, baseType: !228, size: 16, offset: 1024)
!228 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !202, file: !203, line: 78, baseType: !230, size: 8, offset: 1040)
!230 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !202, file: !203, line: 79, baseType: !232, size: 8, offset: 1048)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 8, elements: !233)
!233 = !{!234}
!234 = !DISubrange(count: 1)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !202, file: !203, line: 81, baseType: !236, size: 64, offset: 1088)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !203, line: 43, baseType: null)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !202, file: !203, line: 89, baseType: !239, size: 64, offset: 1152)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !226, line: 153, baseType: !78)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !202, file: !203, line: 91, baseType: !241, size: 64, offset: 1216)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !203, line: 37, flags: DIFlagFwdDecl)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !202, file: !203, line: 92, baseType: !244, size: 64, offset: 1280)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !203, line: 38, flags: DIFlagFwdDecl)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !202, file: !203, line: 93, baseType: !221, size: 64, offset: 1344)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !202, file: !203, line: 94, baseType: !16, size: 64, offset: 1408)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !202, file: !203, line: 95, baseType: !46, size: 64, offset: 1472)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !202, file: !203, line: 96, baseType: !12, size: 32, offset: 1536)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !202, file: !203, line: 98, baseType: !251, size: 160, offset: 1568)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 160, elements: !252)
!252 = !{!253}
!253 = !DISubrange(count: 20)
!254 = !{!255}
!255 = !DILocalVariable(name: "__fp", arg: 1, scope: !196, file: !171, line: 56, type: !199)
!256 = !DILocation(line: 0, scope: !196)
!257 = !DILocation(line: 58, column: 10, scope: !196)
!258 = !DILocation(line: 58, column: 3, scope: !196)
!259 = distinct !DISubprogram(name: "getc_unlocked", scope: !171, file: !171, line: 66, type: !197, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !260)
!260 = !{!261}
!261 = !DILocalVariable(name: "__fp", arg: 1, scope: !259, file: !171, line: 66, type: !199)
!262 = !DILocation(line: 0, scope: !259)
!263 = !DILocation(line: 68, column: 10, scope: !259)
!264 = !DILocation(line: 68, column: 3, scope: !259)
!265 = distinct !DISubprogram(name: "getchar_unlocked", scope: !171, file: !171, line: 73, type: !190, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !192)
!266 = !DILocation(line: 75, column: 10, scope: !265)
!267 = !DILocation(line: 75, column: 3, scope: !265)
!268 = distinct !DISubprogram(name: "putchar", scope: !171, file: !171, line: 82, type: !269, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !271)
!269 = !DISubroutineType(types: !270)
!270 = !{!12, !12}
!271 = !{!272}
!272 = !DILocalVariable(name: "__c", arg: 1, scope: !268, file: !171, line: 82, type: !12)
!273 = !DILocation(line: 0, scope: !268)
!274 = !DILocation(line: 84, column: 21, scope: !268)
!275 = !DILocation(line: 84, column: 10, scope: !268)
!276 = !DILocation(line: 84, column: 3, scope: !268)
!277 = distinct !DISubprogram(name: "fputc_unlocked", scope: !171, file: !171, line: 91, type: !278, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !280)
!278 = !DISubroutineType(types: !279)
!279 = !{!12, !12, !199}
!280 = !{!281, !282}
!281 = !DILocalVariable(name: "__c", arg: 1, scope: !277, file: !171, line: 91, type: !12)
!282 = !DILocalVariable(name: "__stream", arg: 2, scope: !277, file: !171, line: 91, type: !199)
!283 = !DILocation(line: 0, scope: !277)
!284 = !DILocation(line: 93, column: 10, scope: !277)
!285 = !DILocation(line: 93, column: 3, scope: !277)
!286 = distinct !DISubprogram(name: "putc_unlocked", scope: !171, file: !171, line: 101, type: !278, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !287)
!287 = !{!288, !289}
!288 = !DILocalVariable(name: "__c", arg: 1, scope: !286, file: !171, line: 101, type: !12)
!289 = !DILocalVariable(name: "__stream", arg: 2, scope: !286, file: !171, line: 101, type: !199)
!290 = !DILocation(line: 0, scope: !286)
!291 = !DILocation(line: 103, column: 10, scope: !286)
!292 = !DILocation(line: 103, column: 3, scope: !286)
!293 = distinct !DISubprogram(name: "putchar_unlocked", scope: !171, file: !171, line: 108, type: !269, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !294)
!294 = !{!295}
!295 = !DILocalVariable(name: "__c", arg: 1, scope: !293, file: !171, line: 108, type: !12)
!296 = !DILocation(line: 0, scope: !293)
!297 = !DILocation(line: 110, column: 10, scope: !293)
!298 = !DILocation(line: 110, column: 3, scope: !293)
!299 = distinct !DISubprogram(name: "getline", scope: !171, file: !171, line: 118, type: !300, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !304)
!300 = !DISubroutineType(types: !301)
!301 = !{!302, !13, !303, !199}
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !226, line: 193, baseType: !78)
