; ModuleID = 'hooks.bc'
source_filename = "hooks.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.stat64 = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.rtx_def = type opaque
%union.tree_node = type opaque

@stdout = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@stdin = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8

; Function Attrs: inlinehint nounwind uwtable
define dso_local i32 @vprintf(i8* noalias %__fmt, %struct.__va_list_tag* %__arg) local_unnamed_addr #0 !dbg !146 {
entry:
  call void @llvm.dbg.value(metadata i8* %__fmt, metadata !159, metadata !DIExpression()), !dbg !161

!74 = !DIEnumerator(name: "V1TImode", value: 67, isUnsigned: true)
!75 = !DIEnumerator(name: "V32QImode", value: 68, isUnsigned: true)
!76 = !DIEnumerator(name: "V16HImode", value: 69, isUnsigned: true)
!77 = !DIEnumerator(name: "V8SImode", value: 70, isUnsigned: true)
!78 = !DIEnumerator(name: "V4DImode", value: 71, isUnsigned: true)
!79 = !DIEnumerator(name: "V2TImode", value: 72, isUnsigned: true)
!80 = !DIEnumerator(name: "V64QImode", value: 73, isUnsigned: true)
!81 = !DIEnumerator(name: "V32HImode", value: 74, isUnsigned: true)
!82 = !DIEnumerator(name: "V16SImode", value: 75, isUnsigned: true)
!83 = !DIEnumerator(name: "V8DImode", value: 76, isUnsigned: true)
!84 = !DIEnumerator(name: "V4TImode", value: 77, isUnsigned: true)
!85 = !DIEnumerator(name: "V2SFmode", value: 78, isUnsigned: true)
!86 = !DIEnumerator(name: "V4SFmode", value: 79, isUnsigned: true)
!87 = !DIEnumerator(name: "V2DFmode", value: 80, isUnsigned: true)
!88 = !DIEnumerator(name: "V8SFmode", value: 81, isUnsigned: true)
!89 = !DIEnumerator(name: "V4DFmode", value: 82, isUnsigned: true)
!90 = !DIEnumerator(name: "V2TFmode", value: 83, isUnsigned: true)
!91 = !DIEnumerator(name: "V16SFmode", value: 84, isUnsigned: true)
!92 = !DIEnumerator(name: "V8DFmode", value: 85, isUnsigned: true)
!93 = !DIEnumerator(name: "V4TFmode", value: 86, isUnsigned: true)
!94 = !DIEnumerator(name: "MAX_MACHINE_MODE", value: 87, isUnsigned: true)
!95 = !DIEnumerator(name: "MIN_MODE_RANDOM", value: 0, isUnsigned: true)
!96 = !DIEnumerator(name: "MAX_MODE_RANDOM", value: 1, isUnsigned: true)
!97 = !DIEnumerator(name: "MIN_MODE_CC", value: 2, isUnsigned: true)
!98 = !DIEnumerator(name: "MAX_MODE_CC", value: 12, isUnsigned: true)
!99 = !DIEnumerator(name: "MIN_MODE_INT", value: 14, isUnsigned: true)
!100 = !DIEnumerator(name: "MAX_MODE_INT", value: 19, isUnsigned: true)
!101 = !DIEnumerator(name: "MIN_MODE_PARTIAL_INT", value: 0, isUnsigned: true)
!102 = !DIEnumerator(name: "MAX_MODE_PARTIAL_INT", value: 0, isUnsigned: true)
!103 = !DIEnumerator(name: "MIN_MODE_FRACT", value: 20, isUnsigned: true)
!104 = !DIEnumerator(name: "MAX_MODE_FRACT", value: 24, isUnsigned: true)
!105 = !DIEnumerator(name: "MIN_MODE_UFRACT", value: 25, isUnsigned: true)
!106 = !DIEnumerator(name: "MAX_MODE_UFRACT", value: 29, isUnsigned: true)
!107 = !DIEnumerator(name: "MIN_MODE_ACCUM", value: 30, isUnsigned: true)
!108 = !DIEnumerator(name: "MAX_MODE_ACCUM", value: 33, isUnsigned: true)
!109 = !DIEnumerator(name: "MIN_MODE_UACCUM", value: 34, isUnsigned: true)
!110 = !DIEnumerator(name: "MAX_MODE_UACCUM", value: 37, isUnsigned: true)
!111 = !DIEnumerator(name: "MIN_MODE_FLOAT", value: 38, isUnsigned: true)
!112 = !DIEnumerator(name: "MAX_MODE_FLOAT", value: 41, isUnsigned: true)
!113 = !DIEnumerator(name: "MIN_MODE_DECIMAL_FLOAT", value: 42, isUnsigned: true)
!114 = !DIEnumerator(name: "MAX_MODE_DECIMAL_FLOAT", value: 44, isUnsigned: true)
!115 = !DIEnumerator(name: "MIN_MODE_COMPLEX_INT", value: 45, isUnsigned: true)
!116 = !DIEnumerator(name: "MAX_MODE_COMPLEX_INT", value: 50, isUnsigned: true)
!117 = !DIEnumerator(name: "MIN_MODE_COMPLEX_FLOAT", value: 51, isUnsigned: true)
!118 = !DIEnumerator(name: "MAX_MODE_COMPLEX_FLOAT", value: 54, isUnsigned: true)
!119 = !DIEnumerator(name: "MIN_MODE_VECTOR_INT", value: 55, isUnsigned: true)
!120 = !DIEnumerator(name: "MAX_MODE_VECTOR_INT", value: 77, isUnsigned: true)
!121 = !DIEnumerator(name: "MIN_MODE_VECTOR_FRACT", value: 0, isUnsigned: true)
!122 = !DIEnumerator(name: "MAX_MODE_VECTOR_FRACT", value: 0, isUnsigned: true)
!123 = !DIEnumerator(name: "MIN_MODE_VECTOR_UFRACT", value: 0, isUnsigned: true)
!124 = !DIEnumerator(name: "MAX_MODE_VECTOR_UFRACT", value: 0, isUnsigned: true)
!125 = !DIEnumerator(name: "MIN_MODE_VECTOR_ACCUM", value: 0, isUnsigned: true)
!126 = !DIEnumerator(name: "MAX_MODE_VECTOR_ACCUM", value: 0, isUnsigned: true)
!127 = !DIEnumerator(name: "MIN_MODE_VECTOR_UACCUM", value: 0, isUnsigned: true)
!128 = !DIEnumerator(name: "MAX_MODE_VECTOR_UACCUM", value: 0, isUnsigned: true)
!129 = !DIEnumerator(name: "MIN_MODE_VECTOR_FLOAT", value: 78, isUnsigned: true)
!130 = !DIEnumerator(name: "MAX_MODE_VECTOR_FLOAT", value: 86, isUnsigned: true)
!131 = !DIEnumerator(name: "NUM_MACHINE_MODES", value: 87, isUnsigned: true)
!132 = !{!133, !134, !135, !136, !139, !140}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!135 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!142 = !{i32 2, !"Dwarf Version", i32 4}
!143 = !{i32 2, !"Debug Info Version", i32 3}
!144 = !{i32 1, !"wchar_size", i32 4}
!145 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!146 = distinct !DISubprogram(name: "vprintf", scope: !147, file: !147, line: 39, type: !148, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !158)
!147 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!148 = !DISubroutineType(types: !149)
!149 = !{!135, !150, !151}
!150 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !140)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, elements: !153)
!153 = !{!154, !155, !156, !157}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !152, file: !1, baseType: !5, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !152, file: !1, baseType: !5, size: 32, offset: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !152, file: !1, baseType: !139, size: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !152, file: !1, baseType: !139, size: 64, offset: 128)
!158 = !{!159, !160}
!159 = !DILocalVariable(name: "__fmt", arg: 1, scope: !146, file: !147, line: 39, type: !150)
!160 = !DILocalVariable(name: "__arg", arg: 2, scope: !146, file: !147, line: 39, type: !151)
!161 = !DILocation(line: 0, scope: !146)
!162 = !DILocation(line: 41, column: 20, scope: !146)
!163 = !DILocation(line: 41, column: 10, scope: !146)
!164 = !DILocation(line: 41, column: 3, scope: !146)
!165 = distinct !DISubprogram(name: "getchar", scope: !147, file: !147, line: 47, type: !166, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !168)
!166 = !DISubroutineType(types: !167)
!167 = !{!135}
!168 = !{}
!169 = !DILocation(line: 49, column: 16, scope: !165)
!170 = !DILocation(line: 49, column: 10, scope: !165)
!171 = !DILocation(line: 49, column: 3, scope: !165)
!172 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !147, file: !147, line: 56, type: !173, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !234)
!173 = !DISubroutineType(types: !174)
!174 = !{!135, !175}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !177, line: 7, baseType: !178)
!177 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !179, line: 49, size: 1728, elements: !180)
!179 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!180 = !{!181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !196, !198, !199, !200, !204, !206, !208, !212, !215, !217, !220, !223, !224, !225, !229, !230}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !178, file: !179, line: 51, baseType: !135, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !178, file: !179, line: 54, baseType: !137, size: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !178, file: !179, line: 55, baseType: !137, size: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !178, file: !179, line: 56, baseType: !137, size: 64, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !178, file: !179, line: 57, baseType: !137, size: 64, offset: 256)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !178, file: !179, line: 58, baseType: !137, size: 64, offset: 320)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !178, file: !179, line: 59, baseType: !137, size: 64, offset: 384)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !178, file: !179, line: 60, baseType: !137, size: 64, offset: 448)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !178, file: !179, line: 61, baseType: !137, size: 64, offset: 512)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !178, file: !179, line: 64, baseType: !137, size: 64, offset: 576)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !178, file: !179, line: 65, baseType: !137, size: 64, offset: 640)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !178, file: !179, line: 66, baseType: !137, size: 64, offset: 704)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !178, file: !179, line: 68, baseType: !194, size: 64, offset: 768)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !179, line: 36, flags: DIFlagFwdDecl)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !178, file: !179, line: 70, baseType: !197, size: 64, offset: 832)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !178, file: !179, line: 72, baseType: !135, size: 32, offset: 896)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !178, file: !179, line: 73, baseType: !135, size: 32, offset: 928)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !178, file: !179, line: 74, baseType: !201, size: 64, offset: 960)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !202, line: 152, baseType: !203)
!202 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!203 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !178, file: !179, line: 77, baseType: !205, size: 16, offset: 1024)
!205 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !178, file: !179, line: 78, baseType: !207, size: 8, offset: 1040)
!207 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !178, file: !179, line: 79, baseType: !209, size: 8, offset: 1048)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 8, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 1)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !178, file: !179, line: 81, baseType: !213, size: 64, offset: 1088)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !179, line: 43, baseType: null)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !178, file: !179, line: 89, baseType: !216, size: 64, offset: 1152)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !202, line: 153, baseType: !203)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !178, file: !179, line: 91, baseType: !218, size: 64, offset: 1216)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !179, line: 37, flags: DIFlagFwdDecl)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !178, file: !179, line: 92, baseType: !221, size: 64, offset: 1280)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !179, line: 38, flags: DIFlagFwdDecl)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !178, file: !179, line: 93, baseType: !197, size: 64, offset: 1344)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !178, file: !179, line: 94, baseType: !139, size: 64, offset: 1408)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !178, file: !179, line: 95, baseType: !226, size: 64, offset: 1472)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !227, line: 46, baseType: !228)
!227 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!228 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !178, file: !179, line: 96, baseType: !135, size: 32, offset: 1536)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !178, file: !179, line: 98, baseType: !231, size: 160, offset: 1568)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 160, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 20)
!234 = !{!235}
!235 = !DILocalVariable(name: "__fp", arg: 1, scope: !172, file: !147, line: 56, type: !175)
!236 = !DILocation(line: 0, scope: !172)
!237 = !DILocation(line: 58, column: 10, scope: !172)
!238 = !DILocation(line: 58, column: 3, scope: !172)
!239 = distinct !DISubprogram(name: "getc_unlocked", scope: !147, file: !147, line: 66, type: !173, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !240)
!240 = !{!241}
!241 = !DILocalVariable(name: "__fp", arg: 1, scope: !239, file: !147, line: 66, type: !175)
!242 = !DILocation(line: 0, scope: !239)
!243 = !DILocation(line: 68, column: 10, scope: !239)
!244 = !DILocation(line: 68, column: 3, scope: !239)
!245 = distinct !DISubprogram(name: "getchar_unlocked", scope: !147, file: !147, line: 73, type: !166, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !168)
!246 = !DILocation(line: 75, column: 10, scope: !245)
!247 = !DILocation(line: 75, column: 3, scope: !245)
!248 = distinct !DISubprogram(name: "putchar", scope: !147, file: !147, line: 82, type: !249, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !251)
!249 = !DISubroutineType(types: !250)
!250 = !{!135, !135}
!251 = !{!252}
!252 = !DILocalVariable(name: "__c", arg: 1, scope: !248, file: !147, line: 82, type: !135)
!253 = !DILocation(line: 0, scope: !248)
!254 = !DILocation(line: 84, column: 21, scope: !248)
!255 = !DILocation(line: 84, column: 10, scope: !248)
!256 = !DILocation(line: 84, column: 3, scope: !248)
!257 = distinct !DISubprogram(name: "fputc_unlocked", scope: !147, file: !147, line: 91, type: !258, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !260)
!258 = !DISubroutineType(types: !259)
!259 = !{!135, !135, !175}
!260 = !{!261, !262}
!261 = !DILocalVariable(name: "__c", arg: 1, scope: !257, file: !147, line: 91, type: !135)
!262 = !DILocalVariable(name: "__stream", arg: 2, scope: !257, file: !147, line: 91, type: !175)
!263 = !DILocation(line: 0, scope: !257)
!264 = !DILocation(line: 93, column: 10, scope: !257)
!265 = !DILocation(line: 93, column: 3, scope: !257)
!266 = distinct !DISubprogram(name: "putc_unlocked", scope: !147, file: !147, line: 101, type: !258, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !267)
!267 = !{!268, !269}
!268 = !DILocalVariable(name: "__c", arg: 1, scope: !266, file: !147, line: 101, type: !135)
!269 = !DILocalVariable(name: "__stream", arg: 2, scope: !266, file: !147, line: 101, type: !175)
!270 = !DILocation(line: 0, scope: !266)
!271 = !DILocation(line: 103, column: 10, scope: !266)
!272 = !DILocation(line: 103, column: 3, scope: !266)
!273 = distinct !DISubprogram(name: "putchar_unlocked", scope: !147, file: !147, line: 108, type: !249, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !274)
!274 = !{!275}
!275 = !DILocalVariable(name: "__c", arg: 1, scope: !273, file: !147, line: 108, type: !135)
!276 = !DILocation(line: 0, scope: !273)
!277 = !DILocation(line: 110, column: 10, scope: !273)
!278 = !DILocation(line: 110, column: 3, scope: !273)
!279 = distinct !DISubprogram(name: "getline", scope: !147, file: !147, line: 118, type: !280, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !284)
!280 = !DISubroutineType(types: !281)
!281 = !{!282, !136, !283, !175}
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !202, line: 193, baseType: !203)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!284 = !{!285, !286, !287}
!285 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !279, file: !147, line: 118, type: !136)
!286 = !DILocalVariable(name: "__n", arg: 2, scope: !279, file: !147, line: 118, type: !283)
!287 = !DILocalVariable(name: "__stream", arg: 3, scope: !279, file: !147, line: 118, type: !175)
!288 = !DILocation(line: 0, scope: !279)
!289 = !DILocation(line: 120, column: 10, scope: !279)
!290 = !DILocation(line: 120, column: 3, scope: !279)
!291 = distinct !DISubprogram(name: "feof_unlocked", scope: !147, file: !147, line: 128, type: !173, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !292)
!292 = !{!293}
!293 = !DILocalVariable(name: "__stream", arg: 1, scope: !291, file: !147, line: 128, type: !175)
!294 = !DILocation(line: 0, scope: !291)
!295 = !DILocation(line: 130, column: 10, scope: !291)
!296 = !DILocation(line: 130, column: 3, scope: !291)
!297 = distinct !DISubprogram(name: "ferror_unlocked", scope: !147, file: !147, line: 135, type: !173, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !298)
!298 = !{!299}
!299 = !DILocalVariable(name: "__stream", arg: 1, scope: !297, file: !147, line: 135, type: !175)
!300 = !DILocation(line: 0, scope: !297)
!301 = !DILocation(line: 137, column: 10, scope: !297)
!302 = !DILocation(line: 137, column: 3, scope: !297)
!303 = distinct !DISubprogram(name: "tolower", scope: !304, file: !304, line: 207, type: !249, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !305)
!304 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!305 = !{!306}
!306 = !DILocalVariable(name: "__c", arg: 1, scope: !303, file: !304, line: 207, type: !135)
!307 = !DILocation(line: 0, scope: !303)
!308 = !DILocation(line: 209, column: 22, scope: !303)
!309 = !DILocation(line: 209, column: 39, scope: !303)
!310 = !DILocation(line: 209, column: 38, scope: !303)
!311 = !DILocation(line: 209, column: 37, scope: !303)
!312 = !DILocation(line: 209, column: 10, scope: !303)
!313 = !DILocation(line: 209, column: 3, scope: !303)
!314 = distinct !DISubprogram(name: "toupper", scope: !304, file: !304, line: 213, type: !249, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !315)
!315 = !{!316}
!316 = !DILocalVariable(name: "__c", arg: 1, scope: !314, file: !304, line: 213, type: !135)
!317 = !DILocation(line: 0, scope: !314)
!318 = !DILocation(line: 215, column: 22, scope: !314)
!319 = !DILocation(line: 215, column: 39, scope: !314)
!320 = !DILocation(line: 215, column: 38, scope: !314)
!321 = !DILocation(line: 215, column: 37, scope: !314)
!322 = !DILocation(line: 215, column: 10, scope: !314)
!323 = !DILocation(line: 215, column: 3, scope: !314)
!324 = distinct !DISubprogram(name: "atoi", scope: !325, file: !325, line: 361, type: !326, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !328)
!325 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!326 = !DISubroutineType(types: !327)
!327 = !{!135, !140}
!328 = !{!329}
!329 = !DILocalVariable(name: "__nptr", arg: 1, scope: !324, file: !325, line: 361, type: !140)
!330 = !DILocation(line: 0, scope: !324)
!331 = !DILocation(line: 363, column: 16, scope: !324)
!332 = !DILocation(line: 363, column: 10, scope: !324)
!333 = !DILocation(line: 363, column: 3, scope: !324)
!334 = distinct !DISubprogram(name: "atol", scope: !325, file: !325, line: 366, type: !335, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !337)
!335 = !DISubroutineType(types: !336)
!336 = !{!203, !140}
!337 = !{!338}
!338 = !DILocalVariable(name: "__nptr", arg: 1, scope: !334, file: !325, line: 366, type: !140)
!339 = !DILocation(line: 0, scope: !334)
!340 = !DILocation(line: 368, column: 10, scope: !334)
!341 = !DILocation(line: 368, column: 3, scope: !334)
!342 = distinct !DISubprogram(name: "atoll", scope: !325, file: !325, line: 373, type: !343, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !346)
!343 = !DISubroutineType(types: !344)
!344 = !{!345, !140}
!345 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!346 = !{!347}
!347 = !DILocalVariable(name: "__nptr", arg: 1, scope: !342, file: !325, line: 373, type: !140)
!348 = !DILocation(line: 0, scope: !342)
!349 = !DILocation(line: 375, column: 10, scope: !342)
!350 = !DILocation(line: 375, column: 3, scope: !342)
!351 = distinct !DISubprogram(name: "bsearch", scope: !352, file: !352, line: 20, type: !353, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !361)
!352 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!353 = !DISubroutineType(types: !354)
!354 = !{!139, !355, !355, !226, !226, !357}
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !325, line: 808, baseType: !358)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!135, !355, !355}
!361 = !{!362, !363, !364, !365, !366, !367, !368, !369, !370, !371}
!362 = !DILocalVariable(name: "__key", arg: 1, scope: !351, file: !352, line: 20, type: !355)
!363 = !DILocalVariable(name: "__base", arg: 2, scope: !351, file: !352, line: 20, type: !355)
!364 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !351, file: !352, line: 20, type: !226)
!365 = !DILocalVariable(name: "__size", arg: 4, scope: !351, file: !352, line: 20, type: !226)
!366 = !DILocalVariable(name: "__compar", arg: 5, scope: !351, file: !352, line: 21, type: !357)
!367 = !DILocalVariable(name: "__l", scope: !351, file: !352, line: 23, type: !226)
!368 = !DILocalVariable(name: "__u", scope: !351, file: !352, line: 23, type: !226)
!369 = !DILocalVariable(name: "__idx", scope: !351, file: !352, line: 23, type: !226)
!370 = !DILocalVariable(name: "__p", scope: !351, file: !352, line: 24, type: !355)
!371 = !DILocalVariable(name: "__comparison", scope: !351, file: !352, line: 25, type: !135)
!372 = !DILocation(line: 0, scope: !351)
!373 = !DILocation(line: 29, column: 3, scope: !351)
!374 = !DILocation(line: 27, column: 7, scope: !351)
!375 = !DILocation(line: 29, column: 14, scope: !351)
!376 = !DILocation(line: 31, column: 20, scope: !377)
!377 = distinct !DILexicalBlock(scope: !351, file: !352, line: 30, column: 5)
!378 = !DILocation(line: 31, column: 27, scope: !377)
!379 = !DILocation(line: 32, column: 56, scope: !377)
!380 = !DILocation(line: 32, column: 47, scope: !377)
!381 = !DILocation(line: 33, column: 22, scope: !377)
!382 = !DILocation(line: 34, column: 24, scope: !383)
!383 = distinct !DILexicalBlock(scope: !377, file: !352, line: 34, column: 11)
!384 = !DILocation(line: 34, column: 11, scope: !377)
!385 = !DILocation(line: 36, column: 29, scope: !386)
!386 = distinct !DILexicalBlock(scope: !383, file: !352, line: 36, column: 16)
!387 = !DILocation(line: 36, column: 16, scope: !383)
!388 = !DILocation(line: 37, column: 14, scope: !386)
!389 = distinct !{!389, !373, !390}
!390 = !DILocation(line: 40, column: 5, scope: !351)
!391 = !DILocation(line: 43, column: 1, scope: !351)
!392 = distinct !DISubprogram(name: "atof", scope: !393, file: !393, line: 25, type: !394, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !397)
!393 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!394 = !DISubroutineType(types: !395)
!395 = !{!396, !140}
!396 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!397 = !{!398}
!398 = !DILocalVariable(name: "__nptr", arg: 1, scope: !392, file: !393, line: 25, type: !140)
!399 = !DILocation(line: 0, scope: !392)
!400 = !DILocation(line: 27, column: 10, scope: !392)
!401 = !DILocation(line: 27, column: 3, scope: !392)
!402 = distinct !DISubprogram(name: "strtoimax", scope: !403, file: !403, line: 324, type: !404, scopeLine: 326, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !410)
!403 = !DIFile(filename: "/usr/include/inttypes.h", directory: "")
!404 = !DISubroutineType(types: !405)
!405 = !{!406, !150, !409, !135}
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !407, line: 101, baseType: !408)
!407 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !202, line: 72, baseType: !203)
!409 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !136)
!410 = !{!411, !412, !413}
!411 = !DILocalVariable(name: "nptr", arg: 1, scope: !402, file: !403, line: 324, type: !150)
!412 = !DILocalVariable(name: "endptr", arg: 2, scope: !402, file: !403, line: 324, type: !409)
!413 = !DILocalVariable(name: "base", arg: 3, scope: !402, file: !403, line: 324, type: !135)
!414 = !DILocation(line: 0, scope: !402)
!415 = !DILocation(line: 327, column: 10, scope: !402)
!416 = !DILocation(line: 327, column: 3, scope: !402)
!417 = distinct !DISubprogram(name: "strtoumax", scope: !403, file: !403, line: 336, type: !418, scopeLine: 338, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !422)
!418 = !DISubroutineType(types: !419)
!419 = !{!420, !150, !409, !135}
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !407, line: 102, baseType: !421)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !202, line: 73, baseType: !228)
!422 = !{!423, !424, !425}
!423 = !DILocalVariable(name: "nptr", arg: 1, scope: !417, file: !403, line: 336, type: !150)
!424 = !DILocalVariable(name: "endptr", arg: 2, scope: !417, file: !403, line: 336, type: !409)
!425 = !DILocalVariable(name: "base", arg: 3, scope: !417, file: !403, line: 336, type: !135)
!426 = !DILocation(line: 0, scope: !417)
!427 = !DILocation(line: 339, column: 10, scope: !417)
!428 = !DILocation(line: 339, column: 3, scope: !417)
!429 = distinct !DISubprogram(name: "wcstoimax", scope: !403, file: !403, line: 348, type: !430, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !439)
!430 = !DISubroutineType(types: !431)
!431 = !{!406, !432, !436, !135}
!432 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !433)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !435)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gwchar_t", file: !403, line: 34, baseType: !135)
!436 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !437)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!439 = !{!440, !441, !442}
!440 = !DILocalVariable(name: "nptr", arg: 1, scope: !429, file: !403, line: 348, type: !432)
!441 = !DILocalVariable(name: "endptr", arg: 2, scope: !429, file: !403, line: 348, type: !436)
!442 = !DILocalVariable(name: "base", arg: 3, scope: !429, file: !403, line: 348, type: !135)
!443 = !DILocation(line: 0, scope: !429)
!444 = !DILocation(line: 351, column: 10, scope: !429)
!445 = !DILocation(line: 351, column: 3, scope: !429)
!446 = distinct !DISubprogram(name: "wcstoumax", scope: !403, file: !403, line: 362, type: !447, scopeLine: 364, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !449)
!447 = !DISubroutineType(types: !448)
!448 = !{!420, !432, !436, !135}
!449 = !{!450, !451, !452}
!450 = !DILocalVariable(name: "nptr", arg: 1, scope: !446, file: !403, line: 362, type: !432)
!451 = !DILocalVariable(name: "endptr", arg: 2, scope: !446, file: !403, line: 362, type: !436)
!452 = !DILocalVariable(name: "base", arg: 3, scope: !446, file: !403, line: 362, type: !135)
!453 = !DILocation(line: 0, scope: !446)
!454 = !DILocation(line: 365, column: 10, scope: !446)
!455 = !DILocation(line: 365, column: 3, scope: !446)
!456 = distinct !DISubprogram(name: "stat", scope: !457, file: !457, line: 453, type: !458, scopeLine: 454, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !497)
!457 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "")
!458 = !DISubroutineType(types: !459)
!459 = !{!135, !140, !460}
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !462, line: 46, size: 1152, elements: !463)
!462 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!463 = !{!464, !466, !468, !470, !472, !474, !476, !477, !478, !479, !481, !483, !491, !492, !493}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !461, file: !462, line: 48, baseType: !465, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !202, line: 145, baseType: !228)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !461, file: !462, line: 53, baseType: !467, size: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !202, line: 148, baseType: !228)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !461, file: !462, line: 61, baseType: !469, size: 64, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !202, line: 151, baseType: !228)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !461, file: !462, line: 62, baseType: !471, size: 32, offset: 192)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !202, line: 150, baseType: !5)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !461, file: !462, line: 64, baseType: !473, size: 32, offset: 224)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !202, line: 146, baseType: !5)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !461, file: !462, line: 65, baseType: !475, size: 32, offset: 256)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !202, line: 147, baseType: !5)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !461, file: !462, line: 67, baseType: !135, size: 32, offset: 288)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !461, file: !462, line: 69, baseType: !465, size: 64, offset: 320)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !461, file: !462, line: 74, baseType: !201, size: 64, offset: 384)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !461, file: !462, line: 78, baseType: !480, size: 64, offset: 448)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !202, line: 174, baseType: !203)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !461, file: !462, line: 80, baseType: !482, size: 64, offset: 512)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !202, line: 179, baseType: !203)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !461, file: !462, line: 91, baseType: !484, size: 128, offset: 576)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !485, line: 10, size: 128, elements: !486)
!485 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!486 = !{!487, !489}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !484, file: !485, line: 12, baseType: !488, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !202, line: 160, baseType: !203)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !484, file: !485, line: 16, baseType: !490, size: 64, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !202, line: 196, baseType: !203)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !461, file: !462, line: 92, baseType: !484, size: 128, offset: 704)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !461, file: !462, line: 93, baseType: !484, size: 128, offset: 832)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !461, file: !462, line: 106, baseType: !494, size: 192, offset: 960)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !490, size: 192, elements: !495)
!495 = !{!496}
!496 = !DISubrange(count: 3)
!497 = !{!498, !499}
!498 = !DILocalVariable(name: "__path", arg: 1, scope: !456, file: !457, line: 453, type: !140)
!499 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !456, file: !457, line: 453, type: !460)
!500 = !DILocation(line: 0, scope: !456)
!501 = !DILocation(line: 455, column: 10, scope: !456)
!502 = !DILocation(line: 455, column: 3, scope: !456)
!503 = distinct !DISubprogram(name: "lstat", scope: !457, file: !457, line: 460, type: !458, scopeLine: 461, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !504)
!504 = !{!505, !506}
!505 = !DILocalVariable(name: "__path", arg: 1, scope: !503, file: !457, line: 460, type: !140)
!506 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !503, file: !457, line: 460, type: !460)
!507 = !DILocation(line: 0, scope: !503)
!508 = !DILocation(line: 462, column: 10, scope: !503)
!509 = !DILocation(line: 462, column: 3, scope: !503)
!510 = distinct !DISubprogram(name: "fstat", scope: !457, file: !457, line: 467, type: !511, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !513)
!511 = !DISubroutineType(types: !512)
!512 = !{!135, !135, !460}
!513 = !{!514, !515}
!514 = !DILocalVariable(name: "__fd", arg: 1, scope: !510, file: !457, line: 467, type: !135)
!515 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !510, file: !457, line: 467, type: !460)
!516 = !DILocation(line: 0, scope: !510)
!517 = !DILocation(line: 469, column: 10, scope: !510)
!518 = !DILocation(line: 469, column: 3, scope: !510)
!519 = distinct !DISubprogram(name: "fstatat", scope: !457, file: !457, line: 474, type: !520, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !522)
!520 = !DISubroutineType(types: !521)
!521 = !{!135, !135, !140, !460, !135}
!522 = !{!523, !524, !525, !526}
!523 = !DILocalVariable(name: "__fd", arg: 1, scope: !519, file: !457, line: 474, type: !135)
!524 = !DILocalVariable(name: "__filename", arg: 2, scope: !519, file: !457, line: 474, type: !140)
!525 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !519, file: !457, line: 474, type: !460)
!526 = !DILocalVariable(name: "__flag", arg: 4, scope: !519, file: !457, line: 474, type: !135)
!527 = !DILocation(line: 0, scope: !519)
!528 = !DILocation(line: 477, column: 10, scope: !519)
!529 = !DILocation(line: 477, column: 3, scope: !519)
!530 = distinct !DISubprogram(name: "mknod", scope: !457, file: !457, line: 483, type: !531, scopeLine: 484, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !533)
!531 = !DISubroutineType(types: !532)
!532 = !{!135, !140, !471, !465}
!533 = !{!534, !535, !536}
!534 = !DILocalVariable(name: "__path", arg: 1, scope: !530, file: !457, line: 483, type: !140)
!535 = !DILocalVariable(name: "__mode", arg: 2, scope: !530, file: !457, line: 483, type: !471)
!536 = !DILocalVariable(name: "__dev", arg: 3, scope: !530, file: !457, line: 483, type: !465)
!537 = !DILocation(line: 0, scope: !530)
!538 = !DILocation(line: 485, column: 10, scope: !530)
!539 = !DILocation(line: 485, column: 3, scope: !530)
!540 = distinct !DISubprogram(name: "mknodat", scope: !457, file: !457, line: 491, type: !541, scopeLine: 493, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !543)
!541 = !DISubroutineType(types: !542)
!542 = !{!135, !135, !140, !471, !465}
!543 = !{!544, !545, !546, !547}
!544 = !DILocalVariable(name: "__fd", arg: 1, scope: !540, file: !457, line: 491, type: !135)
!545 = !DILocalVariable(name: "__path", arg: 2, scope: !540, file: !457, line: 491, type: !140)
!546 = !DILocalVariable(name: "__mode", arg: 3, scope: !540, file: !457, line: 491, type: !471)
!547 = !DILocalVariable(name: "__dev", arg: 4, scope: !540, file: !457, line: 491, type: !465)
!548 = !DILocation(line: 0, scope: !540)
!549 = !DILocation(line: 494, column: 10, scope: !540)
!550 = !DILocation(line: 494, column: 3, scope: !540)
!551 = distinct !DISubprogram(name: "stat64", scope: !457, file: !457, line: 502, type: !552, scopeLine: 503, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !574)
!552 = !DISubroutineType(types: !553)
!553 = !{!135, !140, !554}
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !462, line: 119, size: 1152, elements: !556)
!556 = !{!557, !558, !560, !561, !562, !563, !564, !565, !566, !567, !568, !570, !571, !572, !573}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !555, file: !462, line: 121, baseType: !465, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !555, file: !462, line: 123, baseType: !559, size: 64, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !202, line: 149, baseType: !228)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !555, file: !462, line: 124, baseType: !469, size: 64, offset: 128)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !555, file: !462, line: 125, baseType: !471, size: 32, offset: 192)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !555, file: !462, line: 132, baseType: !473, size: 32, offset: 224)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !555, file: !462, line: 133, baseType: !475, size: 32, offset: 256)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !555, file: !462, line: 135, baseType: !135, size: 32, offset: 288)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !555, file: !462, line: 136, baseType: !465, size: 64, offset: 320)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !555, file: !462, line: 137, baseType: !201, size: 64, offset: 384)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !555, file: !462, line: 143, baseType: !480, size: 64, offset: 448)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !555, file: !462, line: 144, baseType: !569, size: 64, offset: 512)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !202, line: 180, baseType: !203)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !555, file: !462, line: 152, baseType: !484, size: 128, offset: 576)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !555, file: !462, line: 153, baseType: !484, size: 128, offset: 704)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !555, file: !462, line: 154, baseType: !484, size: 128, offset: 832)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !555, file: !462, line: 164, baseType: !494, size: 192, offset: 960)
!574 = !{!575, !576}
!575 = !DILocalVariable(name: "__path", arg: 1, scope: !551, file: !457, line: 502, type: !140)
!576 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !551, file: !457, line: 502, type: !554)
!577 = !DILocation(line: 0, scope: !551)
!578 = !DILocation(line: 504, column: 10, scope: !551)
!579 = !DILocation(line: 504, column: 3, scope: !551)
!580 = distinct !DISubprogram(name: "lstat64", scope: !457, file: !457, line: 509, type: !552, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !581)
!581 = !{!582, !583}
!582 = !DILocalVariable(name: "__path", arg: 1, scope: !580, file: !457, line: 509, type: !140)
!583 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !580, file: !457, line: 509, type: !554)
!584 = !DILocation(line: 0, scope: !580)
!585 = !DILocation(line: 511, column: 10, scope: !580)
!586 = !DILocation(line: 511, column: 3, scope: !580)
!587 = distinct !DISubprogram(name: "fstat64", scope: !457, file: !457, line: 516, type: !588, scopeLine: 517, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !590)
!588 = !DISubroutineType(types: !589)
!589 = !{!135, !135, !554}
!590 = !{!591, !592}
!591 = !DILocalVariable(name: "__fd", arg: 1, scope: !587, file: !457, line: 516, type: !135)
!592 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !587, file: !457, line: 516, type: !554)
!593 = !DILocation(line: 0, scope: !587)
!594 = !DILocation(line: 518, column: 10, scope: !587)
!595 = !DILocation(line: 518, column: 3, scope: !587)
!596 = distinct !DISubprogram(name: "fstatat64", scope: !457, file: !457, line: 523, type: !597, scopeLine: 525, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !599)
!597 = !DISubroutineType(types: !598)
!598 = !{!135, !135, !140, !554, !135}
!599 = !{!600, !601, !602, !603}
!600 = !DILocalVariable(name: "__fd", arg: 1, scope: !596, file: !457, line: 523, type: !135)
!601 = !DILocalVariable(name: "__filename", arg: 2, scope: !596, file: !457, line: 523, type: !140)
!602 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !596, file: !457, line: 523, type: !554)
!603 = !DILocalVariable(name: "__flag", arg: 4, scope: !596, file: !457, line: 523, type: !135)
!604 = !DILocation(line: 0, scope: !596)
!605 = !DILocation(line: 526, column: 10, scope: !596)
!606 = !DILocation(line: 526, column: 3, scope: !596)
!607 = distinct !DISubprogram(name: "hook_void_void", scope: !1, file: !1, line: 34, type: !608, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !168)
!608 = !DISubroutineType(types: !609)
!609 = !{null}
!610 = !DILocation(line: 36, column: 1, scope: !607)
!611 = distinct !DISubprogram(name: "hook_bool_void_false", scope: !1, file: !1, line: 40, type: !612, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !168)
!612 = !DISubroutineType(types: !613)
!613 = !{!134}
!614 = !DILocation(line: 42, column: 3, scope: !611)
!615 = distinct !DISubprogram(name: "hook_bool_void_true", scope: !1, file: !1, line: 47, type: !612, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !168)
!616 = !DILocation(line: 49, column: 3, scope: !615)
!617 = distinct !DISubprogram(name: "hook_bool_bool_false", scope: !1, file: !1, line: 54, type: !618, scopeLine: 55, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !620)
!618 = !DISubroutineType(types: !619)
!619 = !{!134, !134}
!620 = !{!621}
!621 = !DILocalVariable(name: "a", arg: 1, scope: !617, file: !1, line: 54, type: !134)
!622 = !DILocation(line: 0, scope: !617)
!623 = !DILocation(line: 56, column: 3, scope: !617)
