; ModuleID = 'i386-c.bc'
source_filename = "i386-c.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.cpp_reader = type opaque

!325 = !DIEnumerator(name: "RETURN_EXPR", value: 135, isUnsigned: true)
!326 = !DIEnumerator(name: "EXIT_EXPR", value: 136, isUnsigned: true)
!327 = !DIEnumerator(name: "LOOP_EXPR", value: 137, isUnsigned: true)
!328 = !DIEnumerator(name: "SWITCH_EXPR", value: 138, isUnsigned: true)
!329 = !DIEnumerator(name: "CASE_LABEL_EXPR", value: 139, isUnsigned: true)
!330 = !DIEnumerator(name: "ASM_EXPR", value: 140, isUnsigned: true)
!331 = !DIEnumerator(name: "SSA_NAME", value: 141, isUnsigned: true)
!332 = !DIEnumerator(name: "CATCH_EXPR", value: 142, isUnsigned: true)
!333 = !DIEnumerator(name: "EH_FILTER_EXPR", value: 143, isUnsigned: true)
!334 = !DIEnumerator(name: "SCEV_KNOWN", value: 144, isUnsigned: true)
!335 = !DIEnumerator(name: "SCEV_NOT_KNOWN", value: 145, isUnsigned: true)
!336 = !DIEnumerator(name: "POLYNOMIAL_CHREC", value: 146, isUnsigned: true)
!337 = !DIEnumerator(name: "STATEMENT_LIST", value: 147, isUnsigned: true)
!338 = !DIEnumerator(name: "ASSERT_EXPR", value: 148, isUnsigned: true)
!339 = !DIEnumerator(name: "TREE_BINFO", value: 149, isUnsigned: true)
!340 = !DIEnumerator(name: "WITH_SIZE_EXPR", value: 150, isUnsigned: true)
!341 = !DIEnumerator(name: "REALIGN_LOAD_EXPR", value: 151, isUnsigned: true)
!342 = !DIEnumerator(name: "TARGET_MEM_REF", value: 152, isUnsigned: true)
!343 = !DIEnumerator(name: "OMP_PARALLEL", value: 153, isUnsigned: true)
!344 = !DIEnumerator(name: "OMP_TASK", value: 154, isUnsigned: true)
!345 = !DIEnumerator(name: "OMP_FOR", value: 155, isUnsigned: true)
!346 = !DIEnumerator(name: "OMP_SECTIONS", value: 156, isUnsigned: true)
!347 = !DIEnumerator(name: "OMP_SINGLE", value: 157, isUnsigned: true)
!348 = !DIEnumerator(name: "OMP_SECTION", value: 158, isUnsigned: true)
!349 = !DIEnumerator(name: "OMP_MASTER", value: 159, isUnsigned: true)
!350 = !DIEnumerator(name: "OMP_ORDERED", value: 160, isUnsigned: true)
!351 = !DIEnumerator(name: "OMP_CRITICAL", value: 161, isUnsigned: true)
!352 = !DIEnumerator(name: "OMP_ATOMIC", value: 162, isUnsigned: true)
!353 = !DIEnumerator(name: "OMP_CLAUSE", value: 163, isUnsigned: true)
!354 = !DIEnumerator(name: "REDUC_MAX_EXPR", value: 164, isUnsigned: true)
!355 = !DIEnumerator(name: "REDUC_MIN_EXPR", value: 165, isUnsigned: true)
!356 = !DIEnumerator(name: "REDUC_PLUS_EXPR", value: 166, isUnsigned: true)
!357 = !DIEnumerator(name: "DOT_PROD_EXPR", value: 167, isUnsigned: true)
!358 = !DIEnumerator(name: "WIDEN_SUM_EXPR", value: 168, isUnsigned: true)
!359 = !DIEnumerator(name: "WIDEN_MULT_EXPR", value: 169, isUnsigned: true)
!360 = !DIEnumerator(name: "VEC_LSHIFT_EXPR", value: 170, isUnsigned: true)
!361 = !DIEnumerator(name: "VEC_RSHIFT_EXPR", value: 171, isUnsigned: true)
!362 = !DIEnumerator(name: "VEC_WIDEN_MULT_HI_EXPR", value: 172, isUnsigned: true)
!363 = !DIEnumerator(name: "VEC_WIDEN_MULT_LO_EXPR", value: 173, isUnsigned: true)
!364 = !DIEnumerator(name: "VEC_UNPACK_HI_EXPR", value: 174, isUnsigned: true)
!365 = !DIEnumerator(name: "VEC_UNPACK_LO_EXPR", value: 175, isUnsigned: true)
!366 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_HI_EXPR", value: 176, isUnsigned: true)
!367 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_LO_EXPR", value: 177, isUnsigned: true)
!368 = !DIEnumerator(name: "VEC_PACK_TRUNC_EXPR", value: 178, isUnsigned: true)
!369 = !DIEnumerator(name: "VEC_PACK_SAT_EXPR", value: 179, isUnsigned: true)
!370 = !DIEnumerator(name: "VEC_PACK_FIX_TRUNC_EXPR", value: 180, isUnsigned: true)
!371 = !DIEnumerator(name: "VEC_EXTRACT_EVEN_EXPR", value: 181, isUnsigned: true)
!372 = !DIEnumerator(name: "VEC_EXTRACT_ODD_EXPR", value: 182, isUnsigned: true)
!373 = !DIEnumerator(name: "VEC_INTERLEAVE_HIGH_EXPR", value: 183, isUnsigned: true)
!374 = !DIEnumerator(name: "VEC_INTERLEAVE_LOW_EXPR", value: 184, isUnsigned: true)
!375 = !DIEnumerator(name: "PREDICT_EXPR", value: 185, isUnsigned: true)
!376 = !DIEnumerator(name: "OPTIMIZATION_NODE", value: 186, isUnsigned: true)
!377 = !DIEnumerator(name: "TARGET_OPTION_NODE", value: 187, isUnsigned: true)
!378 = !DIEnumerator(name: "LAST_AND_UNUSED_TREE_CODE", value: 188, isUnsigned: true)
!379 = !DIEnumerator(name: "C_MAYBE_CONST_EXPR", value: 189, isUnsigned: true)
!380 = !DIEnumerator(name: "EXCESS_PRECISION_EXPR", value: 190, isUnsigned: true)
!381 = !DIEnumerator(name: "MAX_TREE_CODES", value: 191, isUnsigned: true)
!382 = !{!383, !384, !385, !386, !389, !390, !3, !23}
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!385 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !388)
!392 = !{i32 2, !"Dwarf Version", i32 4}
!393 = !{i32 2, !"Debug Info Version", i32 3}
!394 = !{i32 1, !"wchar_size", i32 4}
!395 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!396 = distinct !DISubprogram(name: "vprintf", scope: !397, file: !397, line: 39, type: !398, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !408)
!397 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!398 = !DISubroutineType(types: !399)
!399 = !{!385, !400, !401}
!400 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !390)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, elements: !403)
!403 = !{!404, !405, !406, !407}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !402, file: !1, baseType: !5, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !402, file: !1, baseType: !5, size: 32, offset: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !402, file: !1, baseType: !389, size: 64, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !402, file: !1, baseType: !389, size: 64, offset: 128)
!408 = !{!409, !410}
!409 = !DILocalVariable(name: "__fmt", arg: 1, scope: !396, file: !397, line: 39, type: !400)
!410 = !DILocalVariable(name: "__arg", arg: 2, scope: !396, file: !397, line: 39, type: !401)
!411 = !DILocation(line: 0, scope: !396)
!412 = !DILocation(line: 41, column: 20, scope: !396)
!413 = !DILocation(line: 41, column: 10, scope: !396)
!414 = !DILocation(line: 41, column: 3, scope: !396)
!415 = distinct !DISubprogram(name: "getchar", scope: !397, file: !397, line: 47, type: !416, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !418)
!416 = !DISubroutineType(types: !417)
!417 = !{!385}
!418 = !{}
!419 = !DILocation(line: 49, column: 16, scope: !415)
!420 = !DILocation(line: 49, column: 10, scope: !415)
!421 = !DILocation(line: 49, column: 3, scope: !415)
!422 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !397, file: !397, line: 56, type: !423, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !484)
!423 = !DISubroutineType(types: !424)
!424 = !{!385, !425}
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !427, line: 7, baseType: !428)
!427 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !429, line: 49, size: 1728, elements: !430)
!429 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!430 = !{!431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !446, !448, !449, !450, !454, !456, !458, !462, !465, !467, !470, !473, !474, !475, !479, !480}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !428, file: !429, line: 51, baseType: !385, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !428, file: !429, line: 54, baseType: !387, size: 64, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !428, file: !429, line: 55, baseType: !387, size: 64, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !428, file: !429, line: 56, baseType: !387, size: 64, offset: 192)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !428, file: !429, line: 57, baseType: !387, size: 64, offset: 256)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !428, file: !429, line: 58, baseType: !387, size: 64, offset: 320)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !428, file: !429, line: 59, baseType: !387, size: 64, offset: 384)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !428, file: !429, line: 60, baseType: !387, size: 64, offset: 448)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !428, file: !429, line: 61, baseType: !387, size: 64, offset: 512)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !428, file: !429, line: 64, baseType: !387, size: 64, offset: 576)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !428, file: !429, line: 65, baseType: !387, size: 64, offset: 640)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !428, file: !429, line: 66, baseType: !387, size: 64, offset: 704)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !428, file: !429, line: 68, baseType: !444, size: 64, offset: 768)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !429, line: 36, flags: DIFlagFwdDecl)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !428, file: !429, line: 70, baseType: !447, size: 64, offset: 832)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !428, file: !429, line: 72, baseType: !385, size: 32, offset: 896)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !428, file: !429, line: 73, baseType: !385, size: 32, offset: 928)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !428, file: !429, line: 74, baseType: !451, size: 64, offset: 960)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !452, line: 152, baseType: !453)
!452 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!453 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !428, file: !429, line: 77, baseType: !455, size: 16, offset: 1024)
!455 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !428, file: !429, line: 78, baseType: !457, size: 8, offset: 1040)
!457 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !428, file: !429, line: 79, baseType: !459, size: 8, offset: 1048)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 8, elements: !460)
!460 = !{!461}
!461 = !DISubrange(count: 1)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !428, file: !429, line: 81, baseType: !463, size: 64, offset: 1088)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !429, line: 43, baseType: null)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !428, file: !429, line: 89, baseType: !466, size: 64, offset: 1152)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !452, line: 153, baseType: !453)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !428, file: !429, line: 91, baseType: !468, size: 64, offset: 1216)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !429, line: 37, flags: DIFlagFwdDecl)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !428, file: !429, line: 92, baseType: !471, size: 64, offset: 1280)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !429, line: 38, flags: DIFlagFwdDecl)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !428, file: !429, line: 93, baseType: !447, size: 64, offset: 1344)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !428, file: !429, line: 94, baseType: !389, size: 64, offset: 1408)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !428, file: !429, line: 95, baseType: !476, size: 64, offset: 1472)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !477, line: 46, baseType: !478)
!477 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!478 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !428, file: !429, line: 96, baseType: !385, size: 32, offset: 1536)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !428, file: !429, line: 98, baseType: !481, size: 160, offset: 1568)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 160, elements: !482)
!482 = !{!483}
!483 = !DISubrange(count: 20)
!484 = !{!485}
!485 = !DILocalVariable(name: "__fp", arg: 1, scope: !422, file: !397, line: 56, type: !425)
!486 = !DILocation(line: 0, scope: !422)
!487 = !DILocation(line: 58, column: 10, scope: !422)
!488 = !DILocation(line: 58, column: 3, scope: !422)
!489 = distinct !DISubprogram(name: "getc_unlocked", scope: !397, file: !397, line: 66, type: !423, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !490)
!490 = !{!491}
!491 = !DILocalVariable(name: "__fp", arg: 1, scope: !489, file: !397, line: 66, type: !425)
!492 = !DILocation(line: 0, scope: !489)
!493 = !DILocation(line: 68, column: 10, scope: !489)
!494 = !DILocation(line: 68, column: 3, scope: !489)
!495 = distinct !DISubprogram(name: "getchar_unlocked", scope: !397, file: !397, line: 73, type: !416, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !418)
!496 = !DILocation(line: 75, column: 10, scope: !495)
!497 = !DILocation(line: 75, column: 3, scope: !495)
!498 = distinct !DISubprogram(name: "putchar", scope: !397, file: !397, line: 82, type: !499, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !501)
!499 = !DISubroutineType(types: !500)
!500 = !{!385, !385}
!501 = !{!502}
!502 = !DILocalVariable(name: "__c", arg: 1, scope: !498, file: !397, line: 82, type: !385)
!503 = !DILocation(line: 0, scope: !498)
!504 = !DILocation(line: 84, column: 21, scope: !498)
!505 = !DILocation(line: 84, column: 10, scope: !498)
!506 = !DILocation(line: 84, column: 3, scope: !498)
!507 = distinct !DISubprogram(name: "fputc_unlocked", scope: !397, file: !397, line: 91, type: !508, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !510)
!508 = !DISubroutineType(types: !509)
!509 = !{!385, !385, !425}
!510 = !{!511, !512}
!511 = !DILocalVariable(name: "__c", arg: 1, scope: !507, file: !397, line: 91, type: !385)
!512 = !DILocalVariable(name: "__stream", arg: 2, scope: !507, file: !397, line: 91, type: !425)
!513 = !DILocation(line: 0, scope: !507)
!514 = !DILocation(line: 93, column: 10, scope: !507)
!515 = !DILocation(line: 93, column: 3, scope: !507)
!516 = distinct !DISubprogram(name: "putc_unlocked", scope: !397, file: !397, line: 101, type: !508, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !517)
!517 = !{!518, !519}
!518 = !DILocalVariable(name: "__c", arg: 1, scope: !516, file: !397, line: 101, type: !385)
!519 = !DILocalVariable(name: "__stream", arg: 2, scope: !516, file: !397, line: 101, type: !425)
!520 = !DILocation(line: 0, scope: !516)
!521 = !DILocation(line: 103, column: 10, scope: !516)
!522 = !DILocation(line: 103, column: 3, scope: !516)
!523 = distinct !DISubprogram(name: "putchar_unlocked", scope: !397, file: !397, line: 108, type: !499, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !524)
!524 = !{!525}
!525 = !DILocalVariable(name: "__c", arg: 1, scope: !523, file: !397, line: 108, type: !385)
!526 = !DILocation(line: 0, scope: !523)
!527 = !DILocation(line: 110, column: 10, scope: !523)
!528 = !DILocation(line: 110, column: 3, scope: !523)
!529 = distinct !DISubprogram(name: "getline", scope: !397, file: !397, line: 118, type: !530, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !534)
!530 = !DISubroutineType(types: !531)
!531 = !{!532, !386, !533, !425}
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !452, line: 193, baseType: !453)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!534 = !{!535, !536, !537}
!535 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !529, file: !397, line: 118, type: !386)
!536 = !DILocalVariable(name: "__n", arg: 2, scope: !529, file: !397, line: 118, type: !533)
!537 = !DILocalVariable(name: "__stream", arg: 3, scope: !529, file: !397, line: 118, type: !425)
!538 = !DILocation(line: 0, scope: !529)
!539 = !DILocation(line: 120, column: 10, scope: !529)
!540 = !DILocation(line: 120, column: 3, scope: !529)
!541 = distinct !DISubprogram(name: "feof_unlocked", scope: !397, file: !397, line: 128, type: !423, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !542)
!542 = !{!543}
!543 = !DILocalVariable(name: "__stream", arg: 1, scope: !541, file: !397, line: 128, type: !425)
!544 = !DILocation(line: 0, scope: !541)
!545 = !DILocation(line: 130, column: 10, scope: !541)
!546 = !DILocation(line: 130, column: 3, scope: !541)
!547 = distinct !DISubprogram(name: "ferror_unlocked", scope: !397, file: !397, line: 135, type: !423, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !548)
!548 = !{!549}
!549 = !DILocalVariable(name: "__stream", arg: 1, scope: !547, file: !397, line: 135, type: !425)
!550 = !DILocation(line: 0, scope: !547)
!551 = !DILocation(line: 137, column: 10, scope: !547)
!552 = !DILocation(line: 137, column: 3, scope: !547)
!553 = distinct !DISubprogram(name: "tolower", scope: !554, file: !554, line: 207, type: !499, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !555)
!554 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!555 = !{!556}
!556 = !DILocalVariable(name: "__c", arg: 1, scope: !553, file: !554, line: 207, type: !385)
!557 = !DILocation(line: 0, scope: !553)
!558 = !DILocation(line: 209, column: 22, scope: !553)
!559 = !DILocation(line: 209, column: 39, scope: !553)
!560 = !DILocation(line: 209, column: 38, scope: !553)
!561 = !DILocation(line: 209, column: 37, scope: !553)
!562 = !DILocation(line: 209, column: 10, scope: !553)
!563 = !DILocation(line: 209, column: 3, scope: !553)
!564 = distinct !DISubprogram(name: "toupper", scope: !554, file: !554, line: 213, type: !499, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !565)
!565 = !{!566}
!566 = !DILocalVariable(name: "__c", arg: 1, scope: !564, file: !554, line: 213, type: !385)
!567 = !DILocation(line: 0, scope: !564)
!568 = !DILocation(line: 215, column: 22, scope: !564)
!569 = !DILocation(line: 215, column: 39, scope: !564)
!570 = !DILocation(line: 215, column: 38, scope: !564)
!571 = !DILocation(line: 215, column: 37, scope: !564)
!572 = !DILocation(line: 215, column: 10, scope: !564)
!573 = !DILocation(line: 215, column: 3, scope: !564)
!574 = distinct !DISubprogram(name: "atoi", scope: !575, file: !575, line: 361, type: !576, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !578)
!575 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!576 = !DISubroutineType(types: !577)
!577 = !{!385, !390}
!578 = !{!579}
!579 = !DILocalVariable(name: "__nptr", arg: 1, scope: !574, file: !575, line: 361, type: !390)
!580 = !DILocation(line: 0, scope: !574)
!581 = !DILocation(line: 363, column: 16, scope: !574)
!582 = !DILocation(line: 363, column: 10, scope: !574)
!583 = !DILocation(line: 363, column: 3, scope: !574)
!584 = distinct !DISubprogram(name: "atol", scope: !575, file: !575, line: 366, type: !585, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !587)
!585 = !DISubroutineType(types: !586)
!586 = !{!453, !390}
!587 = !{!588}
!588 = !DILocalVariable(name: "__nptr", arg: 1, scope: !584, file: !575, line: 366, type: !390)
!589 = !DILocation(line: 0, scope: !584)
!590 = !DILocation(line: 368, column: 10, scope: !584)
!591 = !DILocation(line: 368, column: 3, scope: !584)
!592 = distinct !DISubprogram(name: "atoll", scope: !575, file: !575, line: 373, type: !593, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !596)
!593 = !DISubroutineType(types: !594)
!594 = !{!595, !390}
!595 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!596 = !{!597}
!597 = !DILocalVariable(name: "__nptr", arg: 1, scope: !592, file: !575, line: 373, type: !390)
!598 = !DILocation(line: 0, scope: !592)
!599 = !DILocation(line: 375, column: 10, scope: !592)
!600 = !DILocation(line: 375, column: 3, scope: !592)
!601 = distinct !DISubprogram(name: "bsearch", scope: !602, file: !602, line: 20, type: !603, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !611)
!602 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!603 = !DISubroutineType(types: !604)
!604 = !{!389, !605, !605, !476, !476, !607}
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !575, line: 808, baseType: !608)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!385, !605, !605}
!611 = !{!612, !613, !614, !615, !616, !617, !618, !619, !620, !621}
!612 = !DILocalVariable(name: "__key", arg: 1, scope: !601, file: !602, line: 20, type: !605)
!613 = !DILocalVariable(name: "__base", arg: 2, scope: !601, file: !602, line: 20, type: !605)
!614 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !601, file: !602, line: 20, type: !476)
!615 = !DILocalVariable(name: "__size", arg: 4, scope: !601, file: !602, line: 20, type: !476)
!616 = !DILocalVariable(name: "__compar", arg: 5, scope: !601, file: !602, line: 21, type: !607)
!617 = !DILocalVariable(name: "__l", scope: !601, file: !602, line: 23, type: !476)
!618 = !DILocalVariable(name: "__u", scope: !601, file: !602, line: 23, type: !476)
!619 = !DILocalVariable(name: "__idx", scope: !601, file: !602, line: 23, type: !476)
!620 = !DILocalVariable(name: "__p", scope: !601, file: !602, line: 24, type: !605)
!621 = !DILocalVariable(name: "__comparison", scope: !601, file: !602, line: 25, type: !385)
!622 = !DILocation(line: 0, scope: !601)
!623 = !DILocation(line: 29, column: 3, scope: !601)
!624 = !DILocation(line: 27, column: 7, scope: !601)
!625 = !DILocation(line: 29, column: 14, scope: !601)
!626 = !DILocation(line: 31, column: 20, scope: !627)
!627 = distinct !DILexicalBlock(scope: !601, file: !602, line: 30, column: 5)
!628 = !DILocation(line: 31, column: 27, scope: !627)
!629 = !DILocation(line: 32, column: 56, scope: !627)
!630 = !DILocation(line: 32, column: 47, scope: !627)
!631 = !DILocation(line: 33, column: 22, scope: !627)
!632 = !DILocation(line: 34, column: 24, scope: !633)
!633 = distinct !DILexicalBlock(scope: !627, file: !602, line: 34, column: 11)
!634 = !DILocation(line: 34, column: 11, scope: !627)
!635 = !DILocation(line: 36, column: 29, scope: !636)
!636 = distinct !DILexicalBlock(scope: !633, file: !602, line: 36, column: 16)
!637 = !DILocation(line: 36, column: 16, scope: !633)
!638 = !DILocation(line: 37, column: 14, scope: !636)
!639 = distinct !{!639, !623, !640}
!640 = !DILocation(line: 40, column: 5, scope: !601)
!641 = !DILocation(line: 43, column: 1, scope: !601)
!642 = distinct !DISubprogram(name: "atof", scope: !643, file: !643, line: 25, type: !644, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !647)
!643 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!644 = !DISubroutineType(types: !645)
!645 = !{!646, !390}
!646 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!647 = !{!648}
!648 = !DILocalVariable(name: "__nptr", arg: 1, scope: !642, file: !643, line: 25, type: !390)
!649 = !DILocation(line: 0, scope: !642)
!650 = !DILocation(line: 27, column: 10, scope: !642)
!651 = !DILocation(line: 27, column: 3, scope: !642)
!652 = distinct !DISubprogram(name: "strtoimax", scope: !653, file: !653, line: 324, type: !654, scopeLine: 326, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !660)
!653 = !DIFile(filename: "/usr/include/inttypes.h", directory: "")
!654 = !DISubroutineType(types: !655)
!655 = !{!656, !400, !659, !385}
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !657, line: 101, baseType: !658)
!657 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !452, line: 72, baseType: !453)
!659 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !386)
!660 = !{!661, !662, !663}
!661 = !DILocalVariable(name: "nptr", arg: 1, scope: !652, file: !653, line: 324, type: !400)
!662 = !DILocalVariable(name: "endptr", arg: 2, scope: !652, file: !653, line: 324, type: !659)
!663 = !DILocalVariable(name: "base", arg: 3, scope: !652, file: !653, line: 324, type: !385)
!664 = !DILocation(line: 0, scope: !652)
!665 = !DILocation(line: 327, column: 10, scope: !652)
!666 = !DILocation(line: 327, column: 3, scope: !652)
!667 = distinct !DISubprogram(name: "strtoumax", scope: !653, file: !653, line: 336, type: !668, scopeLine: 338, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !672)
!668 = !DISubroutineType(types: !669)
!669 = !{!670, !400, !659, !385}
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !657, line: 102, baseType: !671)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !452, line: 73, baseType: !478)
!672 = !{!673, !674, !675}
!673 = !DILocalVariable(name: "nptr", arg: 1, scope: !667, file: !653, line: 336, type: !400)
!674 = !DILocalVariable(name: "endptr", arg: 2, scope: !667, file: !653, line: 336, type: !659)
!675 = !DILocalVariable(name: "base", arg: 3, scope: !667, file: !653, line: 336, type: !385)
!676 = !DILocation(line: 0, scope: !667)
!677 = !DILocation(line: 339, column: 10, scope: !667)
!678 = !DILocation(line: 339, column: 3, scope: !667)
!679 = distinct !DISubprogram(name: "wcstoimax", scope: !653, file: !653, line: 348, type: !680, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !689)
!680 = !DISubroutineType(types: !681)
!681 = !{!656, !682, !686, !385}
!682 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !683)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !685)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gwchar_t", file: !653, line: 34, baseType: !385)
!686 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !687)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!689 = !{!690, !691, !692}
!690 = !DILocalVariable(name: "nptr", arg: 1, scope: !679, file: !653, line: 348, type: !682)
!691 = !DILocalVariable(name: "endptr", arg: 2, scope: !679, file: !653, line: 348, type: !686)
!692 = !DILocalVariable(name: "base", arg: 3, scope: !679, file: !653, line: 348, type: !385)
!693 = !DILocation(line: 0, scope: !679)
!694 = !DILocation(line: 351, column: 10, scope: !679)
!695 = !DILocation(line: 351, column: 3, scope: !679)
!696 = distinct !DISubprogram(name: "wcstoumax", scope: !653, file: !653, line: 362, type: !697, scopeLine: 364, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !699)
!697 = !DISubroutineType(types: !698)
!698 = !{!670, !682, !686, !385}
!699 = !{!700, !701, !702}
!700 = !DILocalVariable(name: "nptr", arg: 1, scope: !696, file: !653, line: 362, type: !682)
!701 = !DILocalVariable(name: "endptr", arg: 2, scope: !696, file: !653, line: 362, type: !686)
!702 = !DILocalVariable(name: "base", arg: 3, scope: !696, file: !653, line: 362, type: !385)
!703 = !DILocation(line: 0, scope: !696)
!704 = !DILocation(line: 365, column: 10, scope: !696)
!705 = !DILocation(line: 365, column: 3, scope: !696)
!706 = distinct !DISubprogram(name: "stat", scope: !707, file: !707, line: 453, type: !708, scopeLine: 454, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !747)
!707 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "")
!708 = !DISubroutineType(types: !709)
!709 = !{!385, !390, !710}
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !712, line: 46, size: 1152, elements: !713)
!712 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!713 = !{!714, !716, !718, !720, !722, !724, !726, !727, !728, !729, !731, !733, !741, !742, !743}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !711, file: !712, line: 48, baseType: !715, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !452, line: 145, baseType: !478)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !711, file: !712, line: 53, baseType: !717, size: 64, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !452, line: 148, baseType: !478)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !711, file: !712, line: 61, baseType: !719, size: 64, offset: 128)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !452, line: 151, baseType: !478)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !711, file: !712, line: 62, baseType: !721, size: 32, offset: 192)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !452, line: 150, baseType: !5)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !711, file: !712, line: 64, baseType: !723, size: 32, offset: 224)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !452, line: 146, baseType: !5)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !711, file: !712, line: 65, baseType: !725, size: 32, offset: 256)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !452, line: 147, baseType: !5)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !711, file: !712, line: 67, baseType: !385, size: 32, offset: 288)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !711, file: !712, line: 69, baseType: !715, size: 64, offset: 320)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !711, file: !712, line: 74, baseType: !451, size: 64, offset: 384)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !711, file: !712, line: 78, baseType: !730, size: 64, offset: 448)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !452, line: 174, baseType: !453)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !711, file: !712, line: 80, baseType: !732, size: 64, offset: 512)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !452, line: 179, baseType: !453)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !711, file: !712, line: 91, baseType: !734, size: 128, offset: 576)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !735, line: 10, size: 128, elements: !736)
!735 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!736 = !{!737, !739}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !734, file: !735, line: 12, baseType: !738, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !452, line: 160, baseType: !453)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !734, file: !735, line: 16, baseType: !740, size: 64, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !452, line: 196, baseType: !453)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !711, file: !712, line: 92, baseType: !734, size: 128, offset: 704)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !711, file: !712, line: 93, baseType: !734, size: 128, offset: 832)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !711, file: !712, line: 106, baseType: !744, size: 192, offset: 960)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !740, size: 192, elements: !745)
!745 = !{!746}
!746 = !DISubrange(count: 3)
!747 = !{!748, !749}
!748 = !DILocalVariable(name: "__path", arg: 1, scope: !706, file: !707, line: 453, type: !390)
!749 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !706, file: !707, line: 453, type: !710)
!750 = !DILocation(line: 0, scope: !706)
!751 = !DILocation(line: 455, column: 10, scope: !706)
!752 = !DILocation(line: 455, column: 3, scope: !706)
!753 = distinct !DISubprogram(name: "lstat", scope: !707, file: !707, line: 460, type: !708, scopeLine: 461, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !754)
!754 = !{!755, !756}
!755 = !DILocalVariable(name: "__path", arg: 1, scope: !753, file: !707, line: 460, type: !390)
!756 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !753, file: !707, line: 460, type: !710)
!757 = !DILocation(line: 0, scope: !753)
!758 = !DILocation(line: 462, column: 10, scope: !753)
!759 = !DILocation(line: 462, column: 3, scope: !753)
!760 = distinct !DISubprogram(name: "fstat", scope: !707, file: !707, line: 467, type: !761, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !763)
!761 = !DISubroutineType(types: !762)
!762 = !{!385, !385, !710}
!763 = !{!764, !765}
!764 = !DILocalVariable(name: "__fd", arg: 1, scope: !760, file: !707, line: 467, type: !385)
!765 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !760, file: !707, line: 467, type: !710)
!766 = !DILocation(line: 0, scope: !760)
!767 = !DILocation(line: 469, column: 10, scope: !760)
!768 = !DILocation(line: 469, column: 3, scope: !760)
!769 = distinct !DISubprogram(name: "fstatat", scope: !707, file: !707, line: 474, type: !770, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !772)
!770 = !DISubroutineType(types: !771)
!771 = !{!385, !385, !390, !710, !385}
!772 = !{!773, !774, !775, !776}
!773 = !DILocalVariable(name: "__fd", arg: 1, scope: !769, file: !707, line: 474, type: !385)
!774 = !DILocalVariable(name: "__filename", arg: 2, scope: !769, file: !707, line: 474, type: !390)
!775 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !769, file: !707, line: 474, type: !710)
!776 = !DILocalVariable(name: "__flag", arg: 4, scope: !769, file: !707, line: 474, type: !385)
!777 = !DILocation(line: 0, scope: !769)
!778 = !DILocation(line: 477, column: 10, scope: !769)
!779 = !DILocation(line: 477, column: 3, scope: !769)
!780 = distinct !DISubprogram(name: "mknod", scope: !707, file: !707, line: 483, type: !781, scopeLine: 484, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !783)
!781 = !DISubroutineType(types: !782)
!782 = !{!385, !390, !721, !715}
!783 = !{!784, !785, !786}
!784 = !DILocalVariable(name: "__path", arg: 1, scope: !780, file: !707, line: 483, type: !390)
!785 = !DILocalVariable(name: "__mode", arg: 2, scope: !780, file: !707, line: 483, type: !721)
!786 = !DILocalVariable(name: "__dev", arg: 3, scope: !780, file: !707, line: 483, type: !715)
!787 = !DILocation(line: 0, scope: !780)
!788 = !DILocation(line: 485, column: 10, scope: !780)
!789 = !DILocation(line: 485, column: 3, scope: !780)
!790 = distinct !DISubprogram(name: "mknodat", scope: !707, file: !707, line: 491, type: !791, scopeLine: 493, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !793)
!791 = !DISubroutineType(types: !792)
!792 = !{!385, !385, !390, !721, !715}
!793 = !{!794, !795, !796, !797}
!794 = !DILocalVariable(name: "__fd", arg: 1, scope: !790, file: !707, line: 491, type: !385)
!795 = !DILocalVariable(name: "__path", arg: 2, scope: !790, file: !707, line: 491, type: !390)
!796 = !DILocalVariable(name: "__mode", arg: 3, scope: !790, file: !707, line: 491, type: !721)
!797 = !DILocalVariable(name: "__dev", arg: 4, scope: !790, file: !707, line: 491, type: !715)
!798 = !DILocation(line: 0, scope: !790)
!799 = !DILocation(line: 494, column: 10, scope: !790)
!800 = !DILocation(line: 494, column: 3, scope: !790)
!801 = distinct !DISubprogram(name: "stat64", scope: !707, file: !707, line: 502, type: !802, scopeLine: 503, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !824)
!802 = !DISubroutineType(types: !803)
!803 = !{!385, !390, !804}
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !712, line: 119, size: 1152, elements: !806)
!806 = !{!807, !808, !810, !811, !812, !813, !814, !815, !816, !817, !818, !820, !821, !822, !823}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !805, file: !712, line: 121, baseType: !715, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !805, file: !712, line: 123, baseType: !809, size: 64, offset: 64)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !452, line: 149, baseType: !478)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !805, file: !712, line: 124, baseType: !719, size: 64, offset: 128)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !805, file: !712, line: 125, baseType: !721, size: 32, offset: 192)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !805, file: !712, line: 132, baseType: !723, size: 32, offset: 224)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !805, file: !712, line: 133, baseType: !725, size: 32, offset: 256)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !805, file: !712, line: 135, baseType: !385, size: 32, offset: 288)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !805, file: !712, line: 136, baseType: !715, size: 64, offset: 320)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !805, file: !712, line: 137, baseType: !451, size: 64, offset: 384)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !805, file: !712, line: 143, baseType: !730, size: 64, offset: 448)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !805, file: !712, line: 144, baseType: !819, size: 64, offset: 512)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !452, line: 180, baseType: !453)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !805, file: !712, line: 152, baseType: !734, size: 128, offset: 576)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !805, file: !712, line: 153, baseType: !734, size: 128, offset: 704)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !805, file: !712, line: 154, baseType: !734, size: 128, offset: 832)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !805, file: !712, line: 164, baseType: !744, size: 192, offset: 960)
!824 = !{!825, !826}
!825 = !DILocalVariable(name: "__path", arg: 1, scope: !801, file: !707, line: 502, type: !390)
!826 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !801, file: !707, line: 502, type: !804)
!827 = !DILocation(line: 0, scope: !801)
!828 = !DILocation(line: 504, column: 10, scope: !801)
!829 = !DILocation(line: 504, column: 3, scope: !801)
!830 = distinct !DISubprogram(name: "lstat64", scope: !707, file: !707, line: 509, type: !802, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !831)
!831 = !{!832, !833}
!832 = !DILocalVariable(name: "__path", arg: 1, scope: !830, file: !707, line: 509, type: !390)
!833 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !830, file: !707, line: 509, type: !804)
!834 = !DILocation(line: 0, scope: !830)
!835 = !DILocation(line: 511, column: 10, scope: !830)
!836 = !DILocation(line: 511, column: 3, scope: !830)
!837 = distinct !DISubprogram(name: "fstat64", scope: !707, file: !707, line: 516, type: !838, scopeLine: 517, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !840)
!838 = !DISubroutineType(types: !839)
!839 = !{!385, !385, !804}
!840 = !{!841, !842}
!841 = !DILocalVariable(name: "__fd", arg: 1, scope: !837, file: !707, line: 516, type: !385)
!842 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !837, file: !707, line: 516, type: !804)
!843 = !DILocation(line: 0, scope: !837)
!844 = !DILocation(line: 518, column: 10, scope: !837)
!845 = !DILocation(line: 518, column: 3, scope: !837)
!846 = distinct !DISubprogram(name: "fstatat64", scope: !707, file: !707, line: 523, type: !847, scopeLine: 525, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !849)
!847 = !DISubroutineType(types: !848)
!848 = !{!385, !385, !390, !804, !385}
!849 = !{!850, !851, !852, !853}
!850 = !DILocalVariable(name: "__fd", arg: 1, scope: !846, file: !707, line: 523, type: !385)
!851 = !DILocalVariable(name: "__filename", arg: 2, scope: !846, file: !707, line: 523, type: !390)
!852 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !846, file: !707, line: 523, type: !804)
!853 = !DILocalVariable(name: "__flag", arg: 4, scope: !846, file: !707, line: 523, type: !385)
!854 = !DILocation(line: 0, scope: !846)
!855 = !DILocation(line: 526, column: 10, scope: !846)
!856 = !DILocation(line: 526, column: 3, scope: !846)
!857 = distinct !DISubprogram(name: "ix86_target_macros", scope: !1, file: !1, line: 324, type: !858, scopeLine: 325, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !418)
!858 = !DISubroutineType(types: !859)
!859 = !{null}
!860 = !DILocation(line: 339, column: 19, scope: !861)
!861 = distinct !DILexicalBlock(scope: !862, file: !1, line: 338, column: 5)
!862 = distinct !DILexicalBlock(scope: !857, file: !1, line: 328, column: 7)
!863 = !DILocation(line: 339, column: 7, scope: !861)
!864 = !DILocation(line: 340, column: 19, scope: !861)
!865 = !DILocation(line: 340, column: 7, scope: !861)
!866 = !DILocation(line: 341, column: 7, scope: !861)
!867 = !DILocation(line: 344, column: 32, scope: !857)
!868 = !DILocation(line: 345, column: 11, scope: !857)
!869 = !DILocation(line: 346, column: 11, scope: !857)
!870 = !DILocation(line: 347, column: 11, scope: !857)
!871 = !DILocation(line: 344, column: 3, scope: !857)
!872 = !DILocation(line: 349, column: 1, scope: !857)
!873 = distinct !DISubprogram(name: "ix86_target_macros_internal", scope: !1, file: !1, line: 45, type: !874, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !884)
!874 = !DISubroutineType(types: !875)
!875 = !{null, !385, !3, !3, !23, !876}
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DISubroutineType(types: !878)
!878 = !{null, !879, !390}
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_reader", file: !881, line: 31, baseType: !882)
!881 = !DIFile(filename: "./cpplib.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!882 = !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_reader", file: !883, line: 91, flags: DIFlagFwdDecl)
!883 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!884 = !{!885, !886, !887, !888, !889, !890, !891, !892, !893}
!885 = !DILocalVariable(name: "isa_flag", arg: 1, scope: !873, file: !1, line: 45, type: !385)
!886 = !DILocalVariable(name: "arch", arg: 2, scope: !873, file: !1, line: 46, type: !3)
!887 = !DILocalVariable(name: "tune", arg: 3, scope: !873, file: !1, line: 47, type: !3)
!888 = !DILocalVariable(name: "fpmath", arg: 4, scope: !873, file: !1, line: 48, type: !23)
!889 = !DILocalVariable(name: "def_or_undef", arg: 5, scope: !873, file: !1, line: 49, type: !876)
!890 = !DILocalVariable(name: "arch_len", scope: !873, file: !1, line: 54, type: !476)
!891 = !DILocalVariable(name: "tune_len", scope: !873, file: !1, line: 55, type: !476)
!892 = !DILocalVariable(name: "last_arch_char", scope: !873, file: !1, line: 56, type: !385)
!893 = !DILocalVariable(name: "last_tune_char", scope: !873, file: !1, line: 57, type: !385)
!894 = !DILocation(line: 0, scope: !873)
!895 = !DILocation(line: 54, column: 29, scope: !873)
!896 = !DILocation(line: 54, column: 21, scope: !873)
!897 = !DILocation(line: 55, column: 29, scope: !873)
!898 = !DILocation(line: 55, column: 21, scope: !873)
!899 = !DILocation(line: 57, column: 24, scope: !873)
!900 = !DILocation(line: 57, column: 50, scope: !873)
!901 = !DILocation(line: 60, column: 3, scope: !873)
!902 = !DILocation(line: 65, column: 21, scope: !903)
!903 = distinct !DILexicalBlock(scope: !873, file: !1, line: 61, column: 5)
!904 = !DILocation(line: 65, column: 7, scope: !903)
!905 = !DILocation(line: 66, column: 21, scope: !903)
!906 = !DILocation(line: 66, column: 7, scope: !903)
!907 = !DILocation(line: 67, column: 7, scope: !903)
!908 = !DILocation(line: 69, column: 21, scope: !903)
!909 = !DILocation(line: 69, column: 7, scope: !903)
!910 = !DILocation(line: 70, column: 21, scope: !903)
!911 = !DILocation(line: 70, column: 7, scope: !903)
!912 = !DILocation(line: 71, column: 21, scope: !903)
!913 = !DILocation(line: 71, column: 7, scope: !903)
!914 = !DILocation(line: 72, column: 21, scope: !903)
!915 = !DILocation(line: 72, column: 7, scope: !903)
!916 = !DILocation(line: 73, column: 20, scope: !917)
!917 = distinct !DILexicalBlock(scope: !903, file: !1, line: 73, column: 11)
!918 = !DILocation(line: 73, column: 11, scope: !903)
!919 = !DILocation(line: 74, column: 16, scope: !917)
!920 = !DILocation(line: 74, column: 2, scope: !917)
!921 = !DILocation(line: 77, column: 21, scope: !903)
!922 = !DILocation(line: 77, column: 7, scope: !903)
!923 = !DILocation(line: 78, column: 21, scope: !903)
!924 = !DILocation(line: 78, column: 7, scope: !903)
!925 = !DILocation(line: 79, column: 21, scope: !903)
!926 = !DILocation(line: 79, column: 7, scope: !903)
!927 = !DILocation(line: 80, column: 21, scope: !903)
!928 = !DILocation(line: 80, column: 7, scope: !903)
!929 = !DILocation(line: 81, column: 7, scope: !903)
!930 = !DILocation(line: 83, column: 21, scope: !903)
!931 = !DILocation(line: 83, column: 7, scope: !903)
!932 = !DILocation(line: 84, column: 21, scope: !903)
!933 = !DILocation(line: 84, column: 7, scope: !903)
!934 = !DILocation(line: 85, column: 7, scope: !903)
!935 = !DILocation(line: 56, column: 24, scope: !873)
!936 = !DILocation(line: 56, column: 50, scope: !873)
!937 = !DILocation(line: 87, column: 21, scope: !903)
!938 = !DILocation(line: 87, column: 7, scope: !903)
!939 = !DILocation(line: 88, column: 21, scope: !903)
!940 = !DILocation(line: 88, column: 7, scope: !903)
!941 = !DILocation(line: 89, column: 11, scope: !903)
!942 = !DILocation(line: 90, column: 16, scope: !943)
!943 = distinct !DILexicalBlock(scope: !903, file: !1, line: 89, column: 11)
!944 = !DILocation(line: 90, column: 2, scope: !943)
!945 = !DILocation(line: 92, column: 16, scope: !946)
!946 = distinct !DILexicalBlock(scope: !943, file: !1, line: 91, column: 16)
!947 = !DILocation(line: 92, column: 2, scope: !946)
!948 = !DILocation(line: 93, column: 25, scope: !949)
!949 = distinct !DILexicalBlock(scope: !946, file: !1, line: 93, column: 16)
!950 = !DILocation(line: 93, column: 16, scope: !946)
!951 = !DILocation(line: 94, column: 16, scope: !949)
!952 = !DILocation(line: 94, column: 2, scope: !949)
!953 = !DILocation(line: 97, column: 21, scope: !903)
!954 = !DILocation(line: 97, column: 7, scope: !903)
!955 = !DILocation(line: 98, column: 21, scope: !903)
!956 = !DILocation(line: 98, column: 7, scope: !903)
!957 = !DILocation(line: 99, column: 20, scope: !958)
!958 = distinct !DILexicalBlock(scope: !903, file: !1, line: 99, column: 11)
!959 = !DILocation(line: 99, column: 11, scope: !903)
!960 = !DILocation(line: 100, column: 16, scope: !958)
!961 = !DILocation(line: 100, column: 2, scope: !958)
!962 = !DILocation(line: 103, column: 21, scope: !903)
!963 = !DILocation(line: 103, column: 7, scope: !903)
!964 = !DILocation(line: 104, column: 21, scope: !903)
!965 = !DILocation(line: 104, column: 7, scope: !903)
!966 = !DILocation(line: 105, column: 7, scope: !903)
!967 = !DILocation(line: 107, column: 21, scope: !903)
!968 = !DILocation(line: 107, column: 7, scope: !903)
!969 = !DILocation(line: 108, column: 21, scope: !903)
!970 = !DILocation(line: 108, column: 7, scope: !903)
!971 = !DILocation(line: 109, column: 7, scope: !903)
!972 = !DILocation(line: 111, column: 21, scope: !903)
!973 = !DILocation(line: 111, column: 7, scope: !903)
!974 = !DILocation(line: 112, column: 21, scope: !903)
!975 = !DILocation(line: 112, column: 7, scope: !903)
!976 = !DILocation(line: 113, column: 7, scope: !903)
!977 = !DILocation(line: 115, column: 21, scope: !903)
!978 = !DILocation(line: 115, column: 7, scope: !903)
!979 = !DILocation(line: 116, column: 21, scope: !903)
!980 = !DILocation(line: 116, column: 7, scope: !903)
!981 = !DILocation(line: 117, column: 7, scope: !903)
!982 = !DILocation(line: 119, column: 21, scope: !903)
!983 = !DILocation(line: 119, column: 7, scope: !903)
!984 = !DILocation(line: 120, column: 21, scope: !903)
!985 = !DILocation(line: 120, column: 7, scope: !903)
!986 = !DILocation(line: 121, column: 7, scope: !903)
!987 = !DILocation(line: 123, column: 21, scope: !903)
!988 = !DILocation(line: 123, column: 7, scope: !903)
!989 = !DILocation(line: 124, column: 21, scope: !903)
!990 = !DILocation(line: 124, column: 7, scope: !903)
!991 = !DILocation(line: 125, column: 7, scope: !903)
!992 = !DILocation(line: 131, column: 7, scope: !903)
!993 = !DILocation(line: 132, column: 5, scope: !903)
!994 = !DILocation(line: 135, column: 3, scope: !873)
!995 = !DILocation(line: 138, column: 21, scope: !996)
!996 = distinct !DILexicalBlock(scope: !873, file: !1, line: 136, column: 5)
!997 = !DILocation(line: 138, column: 7, scope: !996)
!998 = !DILocation(line: 139, column: 7, scope: !996)
!999 = !DILocation(line: 141, column: 21, scope: !996)
!1000 = !DILocation(line: 141, column: 7, scope: !996)
!1001 = !DILocation(line: 142, column: 7, scope: !996)
!1002 = !DILocation(line: 144, column: 21, scope: !996)
!1003 = !DILocation(line: 144, column: 7, scope: !996)
!1004 = !DILocation(line: 145, column: 21, scope: !996)
!1005 = !DILocation(line: 145, column: 7, scope: !996)
!1006 = !DILocation(line: 146, column: 26, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !996, file: !1, line: 146, column: 11)
!1008 = !DILocation(line: 146, column: 11, scope: !996)
!1009 = !DILocation(line: 147, column: 16, scope: !1007)
!1010 = !DILocation(line: 147, column: 2, scope: !1007)
!1011 = !DILocation(line: 150, column: 21, scope: !996)
!1012 = !DILocation(line: 150, column: 7, scope: !996)
!1013 = !DILocation(line: 151, column: 21, scope: !996)
!1014 = !DILocation(line: 151, column: 7, scope: !996)
!1015 = !DILocation(line: 152, column: 7, scope: !996)
!1016 = !DILocation(line: 155, column: 18, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !996, file: !1, line: 153, column: 2)
!1018 = !DILocation(line: 155, column: 4, scope: !1017)
!1019 = !DILocation(line: 158, column: 18, scope: !1017)
!1020 = !DILocation(line: 158, column: 4, scope: !1017)
!1021 = !DILocation(line: 159, column: 4, scope: !1017)
!1022 = !DILocation(line: 163, column: 21, scope: !996)
!1023 = !DILocation(line: 163, column: 7, scope: !996)
!1024 = !DILocation(line: 164, column: 7, scope: !996)
!1025 = !DILocation(line: 166, column: 21, scope: !996)
!1026 = !DILocation(line: 166, column: 7, scope: !996)
!1027 = !DILocation(line: 167, column: 11, scope: !996)
!1028 = !DILocation(line: 168, column: 16, scope: !1029)
!1029 = distinct !DILexicalBlock(scope: !996, file: !1, line: 167, column: 11)
!1030 = !DILocation(line: 168, column: 2, scope: !1029)
!1031 = !DILocation(line: 170, column: 16, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !1029, file: !1, line: 169, column: 16)
!1033 = !DILocation(line: 170, column: 2, scope: !1032)
!1034 = !DILocation(line: 171, column: 25, scope: !1035)
!1035 = distinct !DILexicalBlock(scope: !1032, file: !1, line: 171, column: 16)
!1036 = !DILocation(line: 171, column: 16, scope: !1032)
!1037 = !DILocation(line: 172, column: 16, scope: !1035)
!1038 = !DILocation(line: 172, column: 2, scope: !1035)
!1039 = !DILocation(line: 175, column: 21, scope: !996)
!1040 = !DILocation(line: 175, column: 7, scope: !996)
!1041 = !DILocation(line: 176, column: 20, scope: !1042)
!1042 = distinct !DILexicalBlock(scope: !996, file: !1, line: 176, column: 11)
!1043 = !DILocation(line: 176, column: 11, scope: !996)
!1044 = !DILocation(line: 177, column: 16, scope: !1042)
!1045 = !DILocation(line: 177, column: 2, scope: !1042)
!1046 = !DILocation(line: 180, column: 21, scope: !996)
!1047 = !DILocation(line: 180, column: 7, scope: !996)
!1048 = !DILocation(line: 181, column: 7, scope: !996)
!1049 = !DILocation(line: 183, column: 21, scope: !996)
!1050 = !DILocation(line: 183, column: 7, scope: !996)
!1051 = !DILocation(line: 184, column: 7, scope: !996)
!1052 = !DILocation(line: 186, column: 21, scope: !996)
!1053 = !DILocation(line: 186, column: 7, scope: !996)
!1054 = !DILocation(line: 187, column: 7, scope: !996)
!1055 = !DILocation(line: 189, column: 21, scope: !996)
!1056 = !DILocation(line: 189, column: 7, scope: !996)
!1057 = !DILocation(line: 190, column: 7, scope: !996)
!1058 = !DILocation(line: 192, column: 21, scope: !996)
!1059 = !DILocation(line: 192, column: 7, scope: !996)
!1060 = !DILocation(line: 193, column: 7, scope: !996)
!1061 = !DILocation(line: 195, column: 21, scope: !996)
!1062 = !DILocation(line: 195, column: 7, scope: !996)
!1063 = !DILocation(line: 196, column: 7, scope: !996)
!1064 = !DILocation(line: 205, column: 16, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !873, file: !1, line: 205, column: 7)
!1066 = !DILocation(line: 205, column: 7, scope: !873)
!1067 = !DILocation(line: 206, column: 19, scope: !1065)
!1068 = !DILocation(line: 206, column: 5, scope: !1065)
!1069 = !DILocation(line: 207, column: 16, scope: !1070)
!1070 = distinct !DILexicalBlock(scope: !873, file: !1, line: 207, column: 7)
!1071 = !DILocation(line: 207, column: 7, scope: !873)
!1072 = !DILocation(line: 208, column: 19, scope: !1070)
!1073 = !DILocation(line: 208, column: 5, scope: !1070)
!1074 = !DILocation(line: 209, column: 16, scope: !1075)
!1075 = distinct !DILexicalBlock(scope: !873, file: !1, line: 209, column: 7)
!1076 = !DILocation(line: 209, column: 7, scope: !873)
!1077 = !DILocation(line: 210, column: 19, scope: !1075)
!1078 = !DILocation(line: 210, column: 5, scope: !1075)
!1079 = !DILocation(line: 211, column: 16, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !873, file: !1, line: 211, column: 7)
!1081 = !DILocation(line: 211, column: 7, scope: !873)
!1082 = !DILocation(line: 212, column: 19, scope: !1080)
!1083 = !DILocation(line: 212, column: 5, scope: !1080)
!1084 = !DILocation(line: 213, column: 16, scope: !1085)
!1085 = distinct !DILexicalBlock(scope: !873, file: !1, line: 213, column: 7)
!1086 = !DILocation(line: 213, column: 7, scope: !873)
!1087 = !DILocation(line: 214, column: 19, scope: !1085)
!1088 = !DILocation(line: 214, column: 5, scope: !1085)
!1089 = !DILocation(line: 215, column: 16, scope: !1090)
!1090 = distinct !DILexicalBlock(scope: !873, file: !1, line: 215, column: 7)
!1091 = !DILocation(line: 215, column: 7, scope: !873)
!1092 = !DILocation(line: 216, column: 19, scope: !1090)
!1093 = !DILocation(line: 216, column: 5, scope: !1090)
!1094 = !DILocation(line: 217, column: 16, scope: !1095)
!1095 = distinct !DILexicalBlock(scope: !873, file: !1, line: 217, column: 7)
!1096 = !DILocation(line: 217, column: 7, scope: !873)
!1097 = !DILocation(line: 218, column: 19, scope: !1095)
!1098 = !DILocation(line: 218, column: 5, scope: !1095)
!1099 = !DILocation(line: 219, column: 16, scope: !1100)
!1100 = distinct !DILexicalBlock(scope: !873, file: !1, line: 219, column: 7)
!1101 = !DILocation(line: 219, column: 7, scope: !873)
!1102 = !DILocation(line: 220, column: 19, scope: !1100)
!1103 = !DILocation(line: 220, column: 5, scope: !1100)
!1104 = !DILocation(line: 221, column: 16, scope: !1105)
!1105 = distinct !DILexicalBlock(scope: !873, file: !1, line: 221, column: 7)
!1106 = !DILocation(line: 221, column: 7, scope: !873)
!1107 = !DILocation(line: 222, column: 19, scope: !1105)
!1108 = !DILocation(line: 222, column: 5, scope: !1105)
!1109 = !DILocation(line: 223, column: 16, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !873, file: !1, line: 223, column: 7)
!1111 = !DILocation(line: 223, column: 7, scope: !873)
!1112 = !DILocation(line: 224, column: 19, scope: !1110)
!1113 = !DILocation(line: 224, column: 5, scope: !1110)
!1114 = !DILocation(line: 225, column: 16, scope: !1115)
!1115 = distinct !DILexicalBlock(scope: !873, file: !1, line: 225, column: 7)
!1116 = !DILocation(line: 225, column: 7, scope: !873)
!1117 = !DILocation(line: 226, column: 19, scope: !1115)
!1118 = !DILocation(line: 226, column: 5, scope: !1115)
!1119 = !DILocation(line: 227, column: 16, scope: !1120)
!1120 = distinct !DILexicalBlock(scope: !873, file: !1, line: 227, column: 7)
!1121 = !DILocation(line: 227, column: 7, scope: !873)
!1122 = !DILocation(line: 228, column: 19, scope: !1120)
!1123 = !DILocation(line: 228, column: 5, scope: !1120)
!1124 = !DILocation(line: 229, column: 16, scope: !1125)
!1125 = distinct !DILexicalBlock(scope: !873, file: !1, line: 229, column: 7)
!1126 = !DILocation(line: 229, column: 7, scope: !873)
!1127 = !DILocation(line: 230, column: 19, scope: !1125)
!1128 = !DILocation(line: 230, column: 5, scope: !1125)
!1129 = !DILocation(line: 231, column: 16, scope: !1130)
!1130 = distinct !DILexicalBlock(scope: !873, file: !1, line: 231, column: 7)
!1131 = !DILocation(line: 231, column: 7, scope: !873)
!1132 = !DILocation(line: 232, column: 19, scope: !1130)
!1133 = !DILocation(line: 232, column: 5, scope: !1130)
!1134 = !DILocation(line: 233, column: 16, scope: !1135)
!1135 = distinct !DILexicalBlock(scope: !873, file: !1, line: 233, column: 7)
!1136 = !DILocation(line: 233, column: 7, scope: !873)
!1137 = !DILocation(line: 234, column: 19, scope: !1135)
!1138 = !DILocation(line: 234, column: 5, scope: !1135)
!1139 = !DILocation(line: 235, column: 16, scope: !1140)
!1140 = distinct !DILexicalBlock(scope: !873, file: !1, line: 235, column: 7)
!1141 = !DILocation(line: 235, column: 7, scope: !873)
!1142 = !DILocation(line: 236, column: 19, scope: !1140)
!1143 = !DILocation(line: 236, column: 5, scope: !1140)
!1144 = !DILocation(line: 237, column: 16, scope: !1145)
!1145 = distinct !DILexicalBlock(scope: !873, file: !1, line: 237, column: 7)
!1146 = !DILocation(line: 237, column: 7, scope: !873)
!1147 = !DILocation(line: 238, column: 19, scope: !1145)
!1148 = !DILocation(line: 238, column: 5, scope: !1145)
!1149 = !DILocation(line: 239, column: 16, scope: !1150)
!1150 = distinct !DILexicalBlock(scope: !873, file: !1, line: 239, column: 7)
!1151 = !DILocation(line: 239, column: 7, scope: !873)
!1152 = !DILocation(line: 240, column: 19, scope: !1150)
!1153 = !DILocation(line: 240, column: 5, scope: !1150)
!1154 = !DILocation(line: 241, column: 16, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !873, file: !1, line: 241, column: 7)
!1156 = !DILocation(line: 241, column: 7, scope: !873)
!1157 = !DILocation(line: 242, column: 19, scope: !1155)
!1158 = !DILocation(line: 242, column: 5, scope: !1155)
!1159 = !DILocation(line: 243, column: 15, scope: !1160)
!1160 = distinct !DILexicalBlock(scope: !873, file: !1, line: 243, column: 7)
!1161 = !DILocation(line: 243, column: 42, scope: !1160)
!1162 = !DILocation(line: 243, column: 29, scope: !1160)
!1163 = !DILocation(line: 244, column: 19, scope: !1160)
!1164 = !DILocation(line: 244, column: 5, scope: !1160)
!1165 = !DILocation(line: 245, column: 42, scope: !1166)
!1166 = distinct !DILexicalBlock(scope: !873, file: !1, line: 245, column: 7)
!1167 = !DILocation(line: 245, column: 29, scope: !1166)
!1168 = !DILocation(line: 246, column: 19, scope: !1166)
!1169 = !DILocation(line: 246, column: 5, scope: !1166)
!1170 = !DILocation(line: 247, column: 1, scope: !873)
!1171 = distinct !DISubprogram(name: "ix86_register_pragmas", scope: !1, file: !1, line: 358, type: !858, scopeLine: 359, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !418)
!1172 = !DILocation(line: 361, column: 38, scope: !1171)
!1173 = !DILocation(line: 366, column: 1, scope: !1171)
!1174 = distinct !DISubprogram(name: "ix86_pragma_target_parse", scope: !1, file: !1, line: 255, type: !1175, scopeLine: 256, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1933)
!1175 = !DISubroutineType(types: !1176)
!1176 = !{!384, !1177, !1177}
!1177 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !883, line: 56, baseType: !1178)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64)
!1179 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !156, line: 3371, size: 1792, elements: !1180)
!1180 = !{!1181, !1214, !1220, !1231, !1248, !1259, !1264, !1270, !1276, !1289, !1301, !1339, !1458, !1486, !1494, !1495, !1500, !1509, !1515, !1520, !1524, !1528, !1557, !1604, !1610, !1617, !1624, !1650, !1675, !1692, !1704, !1726, !1744, !1915}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1179, file: !156, line: 3372, baseType: !1182, size: 64)
!1182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !156, line: 360, size: 64, elements: !1183)
!1183 = !{!1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1182, file: !156, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !1182, file: !156, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !1182, file: !156, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !1182, file: !156, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !1182, file: !156, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !1182, file: !156, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !1182, file: !156, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !1182, file: !156, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !1182, file: !156, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !1182, file: !156, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !1182, file: !156, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !1182, file: !156, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !1182, file: !156, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !1182, file: !156, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !1182, file: !156, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !1182, file: !156, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !1182, file: !156, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !1182, file: !156, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1182, file: !156, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1182, file: !156, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1182, file: !156, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1182, file: !156, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1182, file: !156, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1182, file: !156, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1182, file: !156, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1182, file: !156, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !1182, file: !156, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !1182, file: !156, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !1182, file: !156, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !1182, file: !156, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1179, file: !156, line: 3373, baseType: !1215, size: 192)
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !156, line: 402, size: 192, elements: !1216)
!1216 = !{!1217, !1218, !1219}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1215, file: !156, line: 403, baseType: !1182, size: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !1215, file: !156, line: 404, baseType: !1177, size: 64, offset: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1215, file: !156, line: 405, baseType: !1177, size: 64, offset: 128)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1179, file: !156, line: 3374, baseType: !1221, size: 320)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !156, line: 1384, size: 320, elements: !1222)
!1222 = !{!1223, !1224}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1221, file: !156, line: 1385, baseType: !1215, size: 192)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1221, file: !156, line: 1386, baseType: !1225, size: 128, offset: 192)
!1225 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !1226, line: 58, baseType: !1227)
!1226 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1227 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1226, line: 54, size: 128, elements: !1228)
!1228 = !{!1229, !1230}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !1227, file: !1226, line: 56, baseType: !478, size: 64)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !1227, file: !1226, line: 57, baseType: !453, size: 64, offset: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !1179, file: !156, line: 3375, baseType: !1232, size: 256)
!1232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !156, line: 1397, size: 256, elements: !1233)
!1233 = !{!1234, !1235}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1232, file: !156, line: 1398, baseType: !1215, size: 192)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !1232, file: !156, line: 1399, baseType: !1236, size: 64, offset: 192)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !1238, line: 52, size: 256, elements: !1239)
!1238 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1239 = !{!1240, !1241, !1242, !1243, !1244, !1245, !1246}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !1237, file: !1238, line: 56, baseType: !5, size: 2, flags: DIFlagBitField, extraData: i64 0)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !1237, file: !1238, line: 57, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !1237, file: !1238, line: 58, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !1237, file: !1238, line: 59, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1237, file: !1238, line: 60, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !1237, file: !1238, line: 61, baseType: !5, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !1237, file: !1238, line: 62, baseType: !1247, size: 192, offset: 64)
!1247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !478, size: 192, elements: !745)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !1179, file: !156, line: 3376, baseType: !1249, size: 256)
!1249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !156, line: 1408, size: 256, elements: !1250)
!1250 = !{!1251, !1252}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1249, file: !156, line: 1409, baseType: !1215, size: 192)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !1249, file: !156, line: 1410, baseType: !1253, size: 64, offset: 192)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64)
!1254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !1255, line: 27, size: 192, elements: !1256)
!1255 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1256 = !{!1257, !1258}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1254, file: !1255, line: 29, baseType: !1225, size: 128)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1254, file: !1255, line: 30, baseType: !27, size: 32, offset: 128)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !1179, file: !156, line: 3377, baseType: !1260, size: 256)
!1260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !156, line: 1437, size: 256, elements: !1261)
!1261 = !{!1262, !1263}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1260, file: !156, line: 1438, baseType: !1215, size: 192)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1260, file: !156, line: 1439, baseType: !1177, size: 64, offset: 192)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1179, file: !156, line: 3378, baseType: !1265, size: 256)
!1265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !156, line: 1418, size: 256, elements: !1266)
!1266 = !{!1267, !1268, !1269}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1265, file: !156, line: 1419, baseType: !1215, size: 192)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1265, file: !156, line: 1420, baseType: !385, size: 32, offset: 192)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1265, file: !156, line: 1421, baseType: !459, size: 8, offset: 224)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !1179, file: !156, line: 3379, baseType: !1271, size: 320)
!1271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !156, line: 1428, size: 320, elements: !1272)
!1272 = !{!1273, !1274, !1275}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1271, file: !156, line: 1429, baseType: !1215, size: 192)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !1271, file: !156, line: 1430, baseType: !1177, size: 64, offset: 192)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !1271, file: !156, line: 1431, baseType: !1177, size: 64, offset: 256)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !1179, file: !156, line: 3380, baseType: !1277, size: 320)
!1277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !156, line: 1460, size: 320, elements: !1278)
!1278 = !{!1279, !1280}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1277, file: !156, line: 1461, baseType: !1215, size: 192)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1277, file: !156, line: 1462, baseType: !1281, size: 128, offset: 192)
!1281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1282, line: 31, size: 128, elements: !1283)
!1282 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1283 = !{!1284, !1287, !1288}
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1281, file: !1282, line: 32, baseType: !1285, size: 64)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64)
!1286 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !384)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1281, file: !1282, line: 33, baseType: !5, size: 32, offset: 64)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1281, file: !1282, line: 34, baseType: !5, size: 32, offset: 96)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !1179, file: !156, line: 3381, baseType: !1290, size: 384)
!1290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !156, line: 2507, size: 384, elements: !1291)
!1291 = !{!1292, !1293, !1298, !1299, !1300}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1290, file: !156, line: 2508, baseType: !1215, size: 192)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1290, file: !156, line: 2509, baseType: !1294, size: 32, offset: 192)
!1294 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1295, line: 58, baseType: !1296)
!1295 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1296 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1297, line: 44, baseType: !5)
!1297 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1290, file: !156, line: 2510, baseType: !5, size: 32, offset: 224)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1290, file: !156, line: 2511, baseType: !1177, size: 64, offset: 256)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1290, file: !156, line: 2512, baseType: !1177, size: 64, offset: 320)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !1179, file: !156, line: 3382, baseType: !1302, size: 896)
!1302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !156, line: 2652, size: 896, elements: !1303)
!1303 = !{!1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1302, file: !156, line: 2653, baseType: !1290, size: 384)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1302, file: !156, line: 2654, baseType: !1177, size: 64, offset: 384)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1302, file: !156, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1302, file: !156, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1302, file: !156, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1302, file: !156, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1302, file: !156, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1302, file: !156, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1302, file: !156, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1302, file: !156, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1302, file: !156, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1302, file: !156, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1302, file: !156, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1302, file: !156, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1302, file: !156, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1302, file: !156, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1302, file: !156, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1302, file: !156, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1302, file: !156, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1302, file: !156, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1302, file: !156, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1302, file: !156, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1302, file: !156, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1302, file: !156, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1302, file: !156, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1302, file: !156, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1302, file: !156, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1302, file: !156, line: 2703, baseType: !5, size: 32, offset: 512)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1302, file: !156, line: 2705, baseType: !1177, size: 64, offset: 576)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1302, file: !156, line: 2706, baseType: !1177, size: 64, offset: 640)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1302, file: !156, line: 2707, baseType: !1177, size: 64, offset: 704)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1302, file: !156, line: 2708, baseType: !1177, size: 64, offset: 768)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1302, file: !156, line: 2711, baseType: !1337, size: 64, offset: 832)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64)
!1338 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !156, line: 2711, flags: DIFlagFwdDecl)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !1179, file: !156, line: 3383, baseType: !1340, size: 960)
!1340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !156, line: 2756, size: 960, elements: !1341)
!1341 = !{!1342, !1343}
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1340, file: !156, line: 2757, baseType: !1302, size: 896)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1340, file: !156, line: 2758, baseType: !1344, size: 64, offset: 896)
!1344 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !883, line: 50, baseType: !1345)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64)
!1346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !1347, line: 240, size: 384, elements: !1348)
!1347 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1348 = !{!1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359}
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1346, file: !1347, line: 242, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1346, file: !1347, line: 245, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !1346, file: !1347, line: 252, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !1346, file: !1347, line: 257, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !1346, file: !1347, line: 265, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !1346, file: !1347, line: 277, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !1346, file: !1347, line: 291, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1346, file: !1347, line: 298, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !1346, file: !1347, line: 305, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !1346, file: !1347, line: 310, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1346, file: !1347, line: 321, baseType: !1360, size: 320, offset: 64)
!1360 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !1347, line: 315, size: 320, elements: !1361)
!1361 = !{!1362, !1425, !1427, !1456, !1457}
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1360, file: !1347, line: 316, baseType: !1363, size: 64)
!1363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1364, size: 64, elements: !460)
!1364 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !1347, line: 183, baseType: !1365)
!1365 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !1347, line: 166, size: 64, elements: !1366)
!1366 = !{!1367, !1368, !1369, !1370, !1371, !1379, !1380, !1392, !1395, !1398, !1399, !1402, !1415, !1422}
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !1365, file: !1347, line: 168, baseType: !385, size: 32)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !1365, file: !1347, line: 169, baseType: !5, size: 32)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !1365, file: !1347, line: 170, baseType: !390, size: 64)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !1365, file: !1347, line: 171, baseType: !1344, size: 64)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !1365, file: !1347, line: 172, baseType: !1372, size: 64)
!1372 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !883, line: 53, baseType: !1373)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64)
!1374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !1347, line: 359, size: 128, elements: !1375)
!1375 = !{!1376, !1377}
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !1374, file: !1347, line: 360, baseType: !385, size: 32)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !1374, file: !1347, line: 361, baseType: !1378, size: 64, offset: 64)
!1378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1344, size: 64, elements: !460)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !1365, file: !1347, line: 173, baseType: !27, size: 32)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !1365, file: !1347, line: 174, baseType: !1381, size: 32)
!1381 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !1347, line: 133, baseType: !1382)
!1382 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1347, line: 115, size: 32, elements: !1383)
!1383 = !{!1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391}
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !1382, file: !1347, line: 118, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !1382, file: !1347, line: 120, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !1382, file: !1347, line: 121, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !1382, file: !1347, line: 123, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !1382, file: !1347, line: 125, baseType: !5, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !1382, file: !1347, line: 127, baseType: !5, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !1382, file: !1347, line: 130, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1382, file: !1347, line: 132, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !1365, file: !1347, line: 175, baseType: !1393, size: 64)
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1394, size: 64)
!1394 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !1347, line: 175, flags: DIFlagFwdDecl)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !1365, file: !1347, line: 176, baseType: !1396, size: 64)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64)
!1397 = !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !883, line: 46, flags: DIFlagFwdDecl)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !1365, file: !1347, line: 177, baseType: !1177, size: 64)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !1365, file: !1347, line: 178, baseType: !1400, size: 64)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1401, size: 64)
!1401 = !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !883, line: 110, flags: DIFlagFwdDecl)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !1365, file: !1347, line: 179, baseType: !1403, size: 64)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64)
!1404 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !1347, line: 150, baseType: !1405)
!1405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !1347, line: 142, size: 320, elements: !1406)
!1406 = !{!1407, !1408, !1409, !1410, !1413, !1414}
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1405, file: !1347, line: 144, baseType: !1177, size: 64)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1405, file: !1347, line: 145, baseType: !1344, size: 64, offset: 64)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1405, file: !1347, line: 146, baseType: !1344, size: 64, offset: 128)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1405, file: !1347, line: 147, baseType: !1411, size: 32, offset: 192)
!1411 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1412, line: 31, baseType: !385)
!1412 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1405, file: !1347, line: 148, baseType: !5, size: 32, offset: 224)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1405, file: !1347, line: 149, baseType: !384, size: 8, offset: 256)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !1365, file: !1347, line: 180, baseType: !1416, size: 64)
!1416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1417, size: 64)
!1417 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !1347, line: 162, baseType: !1418)
!1418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !1347, line: 159, size: 128, elements: !1419)
!1419 = !{!1420, !1421}
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1418, file: !1347, line: 160, baseType: !1177, size: 64)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1418, file: !1347, line: 161, baseType: !453, size: 64, offset: 64)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !1365, file: !1347, line: 181, baseType: !1423, size: 64)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64)
!1424 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !1347, line: 181, flags: DIFlagFwdDecl)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !1360, file: !1347, line: 317, baseType: !1426, size: 64)
!1426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !453, size: 64, elements: !460)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !1360, file: !1347, line: 318, baseType: !1428, size: 320)
!1428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !1347, line: 188, size: 320, elements: !1429)
!1429 = !{!1430, !1432, !1455}
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1428, file: !1347, line: 190, baseType: !1431, size: 192)
!1431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1364, size: 192, elements: !745)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1428, file: !1347, line: 193, baseType: !1433, size: 64, offset: 192)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64)
!1434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !1347, line: 206, size: 320, elements: !1435)
!1435 = !{!1436, !1440, !1441, !1442, !1454}
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1434, file: !1347, line: 208, baseType: !1437, size: 64)
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1438, size: 64)
!1438 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !883, line: 62, baseType: !1439)
!1439 = !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !883, line: 61, flags: DIFlagFwdDecl)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1434, file: !1347, line: 211, baseType: !5, size: 32, offset: 64)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1434, file: !1347, line: 214, baseType: !453, size: 64, offset: 128)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1434, file: !1347, line: 224, baseType: !1443, size: 64, offset: 192)
!1443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1444, size: 64)
!1444 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !1347, line: 202, baseType: !1445)
!1445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !1347, line: 202, size: 128, elements: !1446)
!1446 = !{!1447}
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1445, file: !1347, line: 202, baseType: !1448, size: 128)
!1448 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !1347, line: 200, baseType: !1449)
