; ModuleID = 'ifcvt.bc'
source_filename = "ifcvt.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.rtl_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type { %struct.eh_region_d*, %struct.VEC_eh_region_gc*, %struct.VEC_eh_landing_pad_gc*, %struct.htab*, %struct.VEC_tree_gc*, %union.eh_status_u }
%struct.eh_region_d = type { %struct.eh_region_d*, %struct.eh_region_d*, %struct.eh_region_d*, i32, i32, %union.eh_region_u, %struct.eh_landing_pad_d*, %struct.rtx_def*, %struct.rtx_def*, i8 }
%union.eh_region_u = type { %struct.eh_region_u_allowed }

!2194 = !DIEnumerator(name: "CODE_FOR_vrotlv8hi3", value: 2908, isUnsigned: true)
!2195 = !DIEnumerator(name: "CODE_FOR_vrotlv4si3", value: 2909, isUnsigned: true)
!2196 = !DIEnumerator(name: "CODE_FOR_vrotlv2di3", value: 2910, isUnsigned: true)
!2197 = !DIEnumerator(name: "CODE_FOR_vlshrv16qi3", value: 2911, isUnsigned: true)
!2198 = !DIEnumerator(name: "CODE_FOR_vlshrv8hi3", value: 2912, isUnsigned: true)
!2199 = !DIEnumerator(name: "CODE_FOR_vlshrv4si3", value: 2913, isUnsigned: true)
!2200 = !DIEnumerator(name: "CODE_FOR_vashrv16qi3", value: 2914, isUnsigned: true)
!2201 = !DIEnumerator(name: "CODE_FOR_vashrv8hi3", value: 2915, isUnsigned: true)
!2202 = !DIEnumerator(name: "CODE_FOR_vashrv4si3", value: 2916, isUnsigned: true)
!2203 = !DIEnumerator(name: "CODE_FOR_vashlv16qi3", value: 2917, isUnsigned: true)
!2204 = !DIEnumerator(name: "CODE_FOR_vashlv8hi3", value: 2918, isUnsigned: true)
!2205 = !DIEnumerator(name: "CODE_FOR_vashlv4si3", value: 2919, isUnsigned: true)
!2206 = !DIEnumerator(name: "CODE_FOR_ashlv16qi3", value: 2920, isUnsigned: true)
!2207 = !DIEnumerator(name: "CODE_FOR_lshlv16qi3", value: 2921, isUnsigned: true)
!2208 = !DIEnumerator(name: "CODE_FOR_ashrv16qi3", value: 2922, isUnsigned: true)
!2209 = !DIEnumerator(name: "CODE_FOR_ashrv2di3", value: 2923, isUnsigned: true)
!2210 = !DIEnumerator(name: "CODE_FOR_avx_vzeroall", value: 2924, isUnsigned: true)
!2211 = !DIEnumerator(name: "CODE_FOR_avx_vzeroupper", value: 2925, isUnsigned: true)
!2212 = !DIEnumerator(name: "CODE_FOR_avx_vpermilv2df", value: 2932, isUnsigned: true)
!2213 = !DIEnumerator(name: "CODE_FOR_avx_vpermilv4df", value: 2933, isUnsigned: true)
!2214 = !DIEnumerator(name: "CODE_FOR_avx_vpermilv4sf", value: 2934, isUnsigned: true)
!2215 = !DIEnumerator(name: "CODE_FOR_avx_vpermilv8sf", value: 2935, isUnsigned: true)
!2216 = !DIEnumerator(name: "CODE_FOR_avx_vperm2f128v8si3", value: 2936, isUnsigned: true)
!2217 = !DIEnumerator(name: "CODE_FOR_avx_vperm2f128v8sf3", value: 2937, isUnsigned: true)
!2218 = !DIEnumerator(name: "CODE_FOR_avx_vperm2f128v4df3", value: 2938, isUnsigned: true)
!2219 = !DIEnumerator(name: "CODE_FOR_avx_vinsertf128v32qi", value: 2939, isUnsigned: true)
!2220 = !DIEnumerator(name: "CODE_FOR_avx_vinsertf128v16hi", value: 2940, isUnsigned: true)
!2221 = !DIEnumerator(name: "CODE_FOR_avx_vinsertf128v8si", value: 2941, isUnsigned: true)
!2222 = !DIEnumerator(name: "CODE_FOR_avx_vinsertf128v4di", value: 2942, isUnsigned: true)
!2223 = !DIEnumerator(name: "CODE_FOR_avx_vinsertf128v8sf", value: 2943, isUnsigned: true)
!2224 = !DIEnumerator(name: "CODE_FOR_avx_vinsertf128v4df", value: 2944, isUnsigned: true)
!2225 = !DIEnumerator(name: "CODE_FOR_vec_initv32qi", value: 2945, isUnsigned: true)
!2226 = !DIEnumerator(name: "CODE_FOR_vec_initv16hi", value: 2946, isUnsigned: true)
!2227 = !DIEnumerator(name: "CODE_FOR_vec_initv8si", value: 2947, isUnsigned: true)
!2228 = !DIEnumerator(name: "CODE_FOR_vec_initv4di", value: 2948, isUnsigned: true)
!2229 = !DIEnumerator(name: "CODE_FOR_vec_initv8sf", value: 2949, isUnsigned: true)
!2230 = !DIEnumerator(name: "CODE_FOR_vec_initv4df", value: 2950, isUnsigned: true)
!2231 = !DIEnumerator(name: "CODE_FOR_memory_barrier", value: 2951, isUnsigned: true)
!2232 = !DIEnumerator(name: "CODE_FOR_sync_compare_and_swapqi", value: 2952, isUnsigned: true)
!2233 = !DIEnumerator(name: "CODE_FOR_sync_compare_and_swaphi", value: 2953, isUnsigned: true)
!2234 = !DIEnumerator(name: "CODE_FOR_sync_compare_and_swapsi", value: 2954, isUnsigned: true)
!2235 = !DIEnumerator(name: "CODE_FOR_sync_compare_and_swapdi", value: 2955, isUnsigned: true)
!2236 = !DIEnumerator(name: "CODE_FOR_nothing", value: 2956, isUnsigned: true)
!2237 = !{!2238, !2239, !2240, !2241, !2244, !2245, !2247, !189, !2279, !580, !723, !2348, !2365, !3473, !3474, !3475, !7, !3487}
!2238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2239, size: 64)
!2239 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!2240 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!2241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2242, size: 64)
!2242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2243, size: 64)
!2243 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!2244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!2245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2246, size: 64)
!2246 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !2243)
!2247 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !2248, line: 111, baseType: !2249)
!2248 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2250, size: 64)
!2250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !325, line: 217, size: 832, elements: !2251)
!2251 = !{!2252, !3440, !3441, !3442, !3443, !3447, !3448, !3449, !3467, !3468, !3469, !3470, !3471, !3472}
!2252 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !2250, file: !325, line: 219, baseType: !2253, size: 64)
!2253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2254, size: 64)
!2254 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !325, line: 151, baseType: !2255)
!2255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !325, line: 151, size: 128, elements: !2256)
!2256 = !{!2257}
!2257 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2255, file: !325, line: 151, baseType: !2258, size: 128)
!2258 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !325, line: 150, baseType: !2259)
!2259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !325, line: 150, size: 128, elements: !2260)
!2260 = !{!2261, !2262, !2263}
!2261 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2259, file: !325, line: 150, baseType: !7, size: 32)
!2262 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2259, file: !325, line: 150, baseType: !7, size: 32, offset: 32)
!2263 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2259, file: !325, line: 150, baseType: !2264, size: 64, offset: 64)
!2264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2265, size: 64, elements: !2313)
!2265 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !2248, line: 108, baseType: !2266)
!2266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2267, size: 64)
!2267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !325, line: 122, size: 512, elements: !2268)
!2268 = !{!2269, !2270, !2271, !3432, !3433, !3434, !3435, !3436, !3437, !3438}
!2269 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !2267, file: !325, line: 124, baseType: !2249, size: 64)
!2270 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !2267, file: !325, line: 125, baseType: !2249, size: 64, offset: 64)
!2271 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !2267, file: !325, line: 131, baseType: !2272, size: 64, offset: 128)
!2272 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !325, line: 128, size: 64, elements: !2273)
!2273 = !{!2274, !2278}
!2274 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !2272, file: !325, line: 129, baseType: !2275, size: 64)
!2275 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !2248, line: 66, baseType: !2276)
!2276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2277, size: 64)
!2277 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !2248, line: 65, flags: DIFlagFwdDecl)
!2278 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !2272, file: !325, line: 130, baseType: !2279, size: 64)
!2279 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !2248, line: 50, baseType: !2280)
!2280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2281, size: 64)
!2281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !581, line: 240, size: 384, elements: !2282)
!2282 = !{!2283, !2284, !2285, !2286, !2287, !2288, !2289, !2290, !2291, !2292, !2293}
!2283 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !2281, file: !581, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!2284 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !2281, file: !581, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!2285 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !2281, file: !581, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!2286 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !2281, file: !581, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!2287 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !2281, file: !581, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!2288 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !2281, file: !581, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!2289 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !2281, file: !581, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!2290 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !2281, file: !581, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!2291 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !2281, file: !581, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!2292 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !2281, file: !581, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!2293 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !2281, file: !581, line: 321, baseType: !2294, size: 320, offset: 64)
!2294 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !581, line: 315, size: 320, elements: !2295)
!2295 = !{!2296, !3367, !3369, !3430, !3431}
!2296 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !2294, file: !581, line: 316, baseType: !2297, size: 64)
!2297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2298, size: 64, elements: !2313)
!2298 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !581, line: 183, baseType: !2299)
!2299 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !581, line: 166, size: 64, elements: !2300)
!2300 = !{!2301, !2302, !2303, !2304, !2305, !2315, !2316, !2328, !2331, !2393, !3345, !3346, !3357, !3364}
!2301 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !2299, file: !581, line: 168, baseType: !2240, size: 32)
!2302 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !2299, file: !581, line: 169, baseType: !7, size: 32)
!2303 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !2299, file: !581, line: 170, baseType: !2245, size: 64)
!2304 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !2299, file: !581, line: 171, baseType: !2279, size: 64)
!2305 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !2299, file: !581, line: 172, baseType: !2306, size: 64)
!2306 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !2248, line: 53, baseType: !2307)
!2307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2308, size: 64)
!2308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !581, line: 359, size: 128, elements: !2309)
!2309 = !{!2310, !2311}
!2310 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !2308, file: !581, line: 360, baseType: !2240, size: 32)
!2311 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !2308, file: !581, line: 361, baseType: !2312, size: 64, offset: 64)
!2312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2279, size: 64, elements: !2313)
!2313 = !{!2314}
!2314 = !DISubrange(count: 1)
!2315 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !2299, file: !581, line: 173, baseType: !189, size: 32)
!2316 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !2299, file: !581, line: 174, baseType: !2317, size: 32)
!2317 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !581, line: 133, baseType: !2318)
!2318 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !581, line: 115, size: 32, elements: !2319)
!2319 = !{!2320, !2321, !2322, !2323, !2324, !2325, !2326, !2327}
!2320 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !2318, file: !581, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!2321 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !2318, file: !581, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!2322 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !2318, file: !581, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!2323 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !2318, file: !581, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!2324 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !2318, file: !581, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!2325 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !2318, file: !581, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!2326 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !2318, file: !581, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!2327 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !2318, file: !581, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!2328 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !2299, file: !581, line: 175, baseType: !2329, size: 64)
!2329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2330, size: 64)
!2330 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !581, line: 175, flags: DIFlagFwdDecl)
!2331 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !2299, file: !581, line: 176, baseType: !2332, size: 64)
!2332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2333, size: 64)
!2333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !2334, line: 75, size: 256, elements: !2335)
!2334 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2335 = !{!2336, !2351, !2352, !2353}
!2336 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !2333, file: !2334, line: 76, baseType: !2337, size: 64)
!2337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2338, size: 64)
!2338 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !2334, line: 68, baseType: !2339)
!2339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !2334, line: 63, size: 320, elements: !2340)
!2340 = !{!2341, !2343, !2344, !2345}
!2341 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2339, file: !2334, line: 64, baseType: !2342, size: 64)
!2342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2339, size: 64)
!2343 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2339, file: !2334, line: 65, baseType: !2342, size: 64, offset: 64)
!2344 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !2339, file: !2334, line: 66, baseType: !7, size: 32, offset: 128)
!2345 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !2339, file: !2334, line: 67, baseType: !2346, size: 128, offset: 192)
!2346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2347, size: 128, elements: !2349)
!2347 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !2334, line: 29, baseType: !2348)
!2348 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!2349 = !{!2350}
!2350 = !DISubrange(count: 2)
!2351 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !2333, file: !2334, line: 77, baseType: !2337, size: 64, offset: 64)
!2352 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !2333, file: !2334, line: 78, baseType: !7, size: 32, offset: 128)
!2353 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !2333, file: !2334, line: 79, baseType: !2354, size: 64, offset: 192)
!2354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2355, size: 64)
!2355 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !2334, line: 49, baseType: !2356)
!2356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !2334, line: 45, size: 832, elements: !2357)
!2357 = !{!2358, !2359, !2360}
!2358 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !2356, file: !2334, line: 46, baseType: !2342, size: 64)
!2359 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !2356, file: !2334, line: 47, baseType: !2332, size: 64, offset: 64)
!2360 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !2356, file: !2334, line: 48, baseType: !2361, size: 704, offset: 128)
!2361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !2362, line: 164, size: 704, elements: !2363)
!2362 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2363 = !{!2364, !2366, !2376, !2377, !2378, !2379, !2380, !2381, !2385, !2389, !2390, !2391, !2392}
!2364 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !2361, file: !2362, line: 166, baseType: !2365, size: 64)
!2365 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!2366 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !2361, file: !2362, line: 167, baseType: !2367, size: 64, offset: 64)
!2367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2368, size: 64)
!2368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !2362, line: 157, size: 192, elements: !2369)
!2369 = !{!2370, !2371, !2372}
!2370 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !2368, file: !2362, line: 159, baseType: !2242, size: 64)
!2371 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2368, file: !2362, line: 160, baseType: !2367, size: 64, offset: 64)
!2372 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !2368, file: !2362, line: 161, baseType: !2373, size: 32, offset: 128)
!2373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2243, size: 32, elements: !2374)
!2374 = !{!2375}
!2375 = !DISubrange(count: 4)
!2376 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !2361, file: !2362, line: 168, baseType: !2242, size: 64, offset: 128)
!2377 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !2361, file: !2362, line: 169, baseType: !2242, size: 64, offset: 192)
!2378 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !2361, file: !2362, line: 170, baseType: !2242, size: 64, offset: 256)
!2379 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !2361, file: !2362, line: 171, baseType: !2365, size: 64, offset: 320)
!2380 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !2361, file: !2362, line: 172, baseType: !2240, size: 32, offset: 384)
!2381 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !2361, file: !2362, line: 176, baseType: !2382, size: 64, offset: 448)
!2382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2383, size: 64)
!2383 = !DISubroutineType(types: !2384)
!2384 = !{!2367, !2244, !2365}
!2385 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !2361, file: !2362, line: 177, baseType: !2386, size: 64, offset: 512)
!2386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2387, size: 64)
!2387 = !DISubroutineType(types: !2388)
!2388 = !{null, !2244, !2367}
!2389 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !2361, file: !2362, line: 178, baseType: !2244, size: 64, offset: 576)
!2390 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !2361, file: !2362, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!2391 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !2361, file: !2362, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!2392 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !2361, file: !2362, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!2393 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !2299, file: !581, line: 177, baseType: !2394, size: 64)
!2394 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !2248, line: 56, baseType: !2395)
!2395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2396, size: 64)
!2396 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !354, line: 3371, size: 1792, elements: !2397)
!2397 = !{!2398, !2431, !2437, !2448, !2467, !2478, !2483, !2490, !2496, !2509, !2521, !2559, !2564, !2592, !2600, !2601, !2606, !2615, !2621, !2626, !2630, !2634, !2984, !3033, !3039, !3045, !3052, !3075, !3089, !3106, !3118, !3140, !3155, !3327}
!2398 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2396, file: !354, line: 3372, baseType: !2399, size: 64)
!2399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !354, line: 360, size: 64, elements: !2400)
!2400 = !{!2401, !2402, !2403, !2404, !2405, !2406, !2407, !2408, !2409, !2410, !2411, !2412, !2413, !2414, !2415, !2416, !2417, !2418, !2419, !2420, !2421, !2422, !2423, !2424, !2425, !2426, !2427, !2428, !2429, !2430}
!2401 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !2399, file: !354, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!2402 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !2399, file: !354, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!2403 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !2399, file: !354, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!2404 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !2399, file: !354, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!2405 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !2399, file: !354, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!2406 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !2399, file: !354, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!2407 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !2399, file: !354, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!2408 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !2399, file: !354, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!2409 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !2399, file: !354, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!2410 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !2399, file: !354, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!2411 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !2399, file: !354, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!2412 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !2399, file: !354, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!2413 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !2399, file: !354, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!2414 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !2399, file: !354, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!2415 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !2399, file: !354, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!2416 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !2399, file: !354, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!2417 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !2399, file: !354, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!2418 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !2399, file: !354, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!2419 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !2399, file: !354, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!2420 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !2399, file: !354, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!2421 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !2399, file: !354, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!2422 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !2399, file: !354, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!2423 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !2399, file: !354, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!2424 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !2399, file: !354, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!2425 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !2399, file: !354, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!2426 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !2399, file: !354, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!2427 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !2399, file: !354, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!2428 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !2399, file: !354, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!2429 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !2399, file: !354, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!2430 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !2399, file: !354, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!2431 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2396, file: !354, line: 3373, baseType: !2432, size: 192)
!2432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !354, line: 402, size: 192, elements: !2433)
!2433 = !{!2434, !2435, !2436}
!2434 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2432, file: !354, line: 403, baseType: !2399, size: 64)
!2435 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !2432, file: !354, line: 404, baseType: !2394, size: 64, offset: 64)
!2436 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !2432, file: !354, line: 405, baseType: !2394, size: 64, offset: 128)
!2437 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !2396, file: !354, line: 3374, baseType: !2438, size: 320)
!2438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !354, line: 1384, size: 320, elements: !2439)
!2439 = !{!2440, !2441}
!2440 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2438, file: !354, line: 1385, baseType: !2432, size: 192)
!2441 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !2438, file: !354, line: 1386, baseType: !2442, size: 128, offset: 192)
!2442 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !2443, line: 58, baseType: !2444)
!2443 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2444 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2443, line: 54, size: 128, elements: !2445)
!2445 = !{!2446, !2447}
!2446 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !2444, file: !2443, line: 56, baseType: !2348, size: 64)
!2447 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !2444, file: !2443, line: 57, baseType: !2365, size: 64, offset: 64)
!2448 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !2396, file: !354, line: 3375, baseType: !2449, size: 256)
!2449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !354, line: 1397, size: 256, elements: !2450)
!2450 = !{!2451, !2452}
!2451 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2449, file: !354, line: 1398, baseType: !2432, size: 192)
!2452 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !2449, file: !354, line: 1399, baseType: !2453, size: 64, offset: 192)
!2453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2454, size: 64)
!2454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !2455, line: 52, size: 256, elements: !2456)
!2455 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2456 = !{!2457, !2458, !2459, !2460, !2461, !2462, !2463}
!2457 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !2454, file: !2455, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!2458 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !2454, file: !2455, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!2459 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !2454, file: !2455, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!2460 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !2454, file: !2455, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!2461 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !2454, file: !2455, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!2462 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !2454, file: !2455, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!2463 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !2454, file: !2455, line: 62, baseType: !2464, size: 192, offset: 64)
!2464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2348, size: 192, elements: !2465)
!2465 = !{!2466}
!2466 = !DISubrange(count: 3)
!2467 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !2396, file: !354, line: 3376, baseType: !2468, size: 256)
!2468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !354, line: 1408, size: 256, elements: !2469)
!2469 = !{!2470, !2471}
!2470 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2468, file: !354, line: 1409, baseType: !2432, size: 192)
!2471 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !2468, file: !354, line: 1410, baseType: !2472, size: 64, offset: 192)
!2472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2473, size: 64)
!2473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !2474, line: 27, size: 192, elements: !2475)
!2474 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2475 = !{!2476, !2477}
!2476 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !2473, file: !2474, line: 29, baseType: !2442, size: 128)
!2477 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !2473, file: !2474, line: 30, baseType: !189, size: 32, offset: 128)
!2478 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !2396, file: !354, line: 3377, baseType: !2479, size: 256)
!2479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !354, line: 1437, size: 256, elements: !2480)
!2480 = !{!2481, !2482}
!2481 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2479, file: !354, line: 1438, baseType: !2432, size: 192)
!2482 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !2479, file: !354, line: 1439, baseType: !2394, size: 64, offset: 192)
!2483 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !2396, file: !354, line: 3378, baseType: !2484, size: 256)
!2484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !354, line: 1418, size: 256, elements: !2485)
!2485 = !{!2486, !2487, !2488}
!2486 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2484, file: !354, line: 1419, baseType: !2432, size: 192)
!2487 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !2484, file: !354, line: 1420, baseType: !2240, size: 32, offset: 192)
!2488 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !2484, file: !354, line: 1421, baseType: !2489, size: 8, offset: 224)
!2489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2243, size: 8, elements: !2313)
!2490 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !2396, file: !354, line: 3379, baseType: !2491, size: 320)
!2491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !354, line: 1428, size: 320, elements: !2492)
!2492 = !{!2493, !2494, !2495}
!2493 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2491, file: !354, line: 1429, baseType: !2432, size: 192)
!2494 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !2491, file: !354, line: 1430, baseType: !2394, size: 64, offset: 192)
!2495 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !2491, file: !354, line: 1431, baseType: !2394, size: 64, offset: 256)
!2496 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !2396, file: !354, line: 3380, baseType: !2497, size: 320)
!2497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !354, line: 1460, size: 320, elements: !2498)
!2498 = !{!2499, !2500}
!2499 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2497, file: !354, line: 1461, baseType: !2432, size: 192)
!2500 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !2497, file: !354, line: 1462, baseType: !2501, size: 128, offset: 192)
!2501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !2502, line: 31, size: 128, elements: !2503)
!2502 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2503 = !{!2504, !2507, !2508}
!2504 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !2501, file: !2502, line: 32, baseType: !2505, size: 64)
!2505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2506, size: 64)
!2506 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !2239)
!2507 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !2501, file: !2502, line: 33, baseType: !7, size: 32, offset: 64)
!2508 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !2501, file: !2502, line: 34, baseType: !7, size: 32, offset: 96)
!2509 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !2396, file: !354, line: 3381, baseType: !2510, size: 384)
!2510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !354, line: 2507, size: 384, elements: !2511)
!2511 = !{!2512, !2513, !2518, !2519, !2520}
!2512 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2510, file: !354, line: 2508, baseType: !2432, size: 192)
!2513 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !2510, file: !354, line: 2509, baseType: !2514, size: 32, offset: 192)
!2514 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !2515, line: 58, baseType: !2516)
!2515 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2516 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !2517, line: 44, baseType: !7)
!2517 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2518 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !2510, file: !354, line: 2510, baseType: !7, size: 32, offset: 224)
!2519 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2510, file: !354, line: 2511, baseType: !2394, size: 64, offset: 256)
!2520 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !2510, file: !354, line: 2512, baseType: !2394, size: 64, offset: 320)
!2521 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !2396, file: !354, line: 3382, baseType: !2522, size: 896)
!2522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !354, line: 2652, size: 896, elements: !2523)
!2523 = !{!2524, !2525, !2526, !2527, !2528, !2529, !2530, !2531, !2532, !2533, !2534, !2535, !2536, !2537, !2538, !2539, !2540, !2541, !2542, !2543, !2544, !2545, !2546, !2547, !2548, !2549, !2550, !2551, !2552, !2553, !2554, !2555, !2556}
!2524 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2522, file: !354, line: 2653, baseType: !2510, size: 384)
!2525 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2522, file: !354, line: 2654, baseType: !2394, size: 64, offset: 384)
!2526 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !2522, file: !354, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!2527 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !2522, file: !354, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!2528 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !2522, file: !354, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!2529 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !2522, file: !354, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!2530 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !2522, file: !354, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!2531 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !2522, file: !354, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!2532 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !2522, file: !354, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!2533 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !2522, file: !354, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!2534 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !2522, file: !354, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!2535 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !2522, file: !354, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!2536 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !2522, file: !354, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!2537 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !2522, file: !354, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!2538 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !2522, file: !354, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!2539 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !2522, file: !354, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!2540 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !2522, file: !354, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!2541 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !2522, file: !354, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!2542 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !2522, file: !354, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!2543 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !2522, file: !354, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!2544 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !2522, file: !354, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!2545 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !2522, file: !354, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!2546 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !2522, file: !354, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!2547 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !2522, file: !354, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!2548 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !2522, file: !354, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!2549 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !2522, file: !354, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!2550 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !2522, file: !354, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!2551 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !2522, file: !354, line: 2703, baseType: !7, size: 32, offset: 512)
!2552 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !2522, file: !354, line: 2705, baseType: !2394, size: 64, offset: 576)
!2553 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !2522, file: !354, line: 2706, baseType: !2394, size: 64, offset: 640)
!2554 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !2522, file: !354, line: 2707, baseType: !2394, size: 64, offset: 704)
!2555 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !2522, file: !354, line: 2708, baseType: !2394, size: 64, offset: 768)
!2556 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !2522, file: !354, line: 2711, baseType: !2557, size: 64, offset: 832)
!2557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2558, size: 64)
!2558 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !354, line: 2711, flags: DIFlagFwdDecl)
!2559 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !2396, file: !354, line: 3383, baseType: !2560, size: 960)
!2560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !354, line: 2756, size: 960, elements: !2561)
!2561 = !{!2562, !2563}
!2562 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2560, file: !354, line: 2757, baseType: !2522, size: 896)
!2563 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !2560, file: !354, line: 2758, baseType: !2279, size: 64, offset: 896)
!2564 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !2396, file: !354, line: 3384, baseType: !2565, size: 1472)
!2565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !354, line: 3114, size: 1472, elements: !2566)
!2566 = !{!2567, !2588, !2589, !2590, !2591}
!2567 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2565, file: !354, line: 3115, baseType: !2568, size: 1216)
!2568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !354, line: 2984, size: 1216, elements: !2569)
!2569 = !{!2570, !2571, !2572, !2573, !2574, !2575, !2576, !2577, !2578, !2579, !2580, !2581, !2582, !2583, !2584, !2585, !2586, !2587}
!2570 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2568, file: !354, line: 2985, baseType: !2560, size: 960)
!2571 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !2568, file: !354, line: 2986, baseType: !2394, size: 64, offset: 960)
!2572 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !2568, file: !354, line: 2987, baseType: !2394, size: 64, offset: 1024)
!2573 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !2568, file: !354, line: 2988, baseType: !2394, size: 64, offset: 1088)
!2574 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !2568, file: !354, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!2575 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !2568, file: !354, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!2576 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !2568, file: !354, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!2577 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !2568, file: !354, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!2578 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !2568, file: !354, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!2579 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !2568, file: !354, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!2580 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !2568, file: !354, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!2581 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !2568, file: !354, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!2582 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !2568, file: !354, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!2583 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !2568, file: !354, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!2584 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !2568, file: !354, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!2585 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !2568, file: !354, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!2586 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !2568, file: !354, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!2587 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !2568, file: !354, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!2588 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !2565, file: !354, line: 3117, baseType: !2394, size: 64, offset: 1216)
!2589 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !2565, file: !354, line: 3119, baseType: !2394, size: 64, offset: 1280)
!2590 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !2565, file: !354, line: 3121, baseType: !2394, size: 64, offset: 1344)
!2591 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !2565, file: !354, line: 3123, baseType: !2394, size: 64, offset: 1408)
!2592 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !2396, file: !354, line: 3385, baseType: !2593, size: 1088)
!2593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !354, line: 2874, size: 1088, elements: !2594)
!2594 = !{!2595, !2596, !2597}
!2595 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2593, file: !354, line: 2875, baseType: !2560, size: 960)
!2596 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !2593, file: !354, line: 2876, baseType: !2279, size: 64, offset: 960)
!2597 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2593, file: !354, line: 2877, baseType: !2598, size: 64, offset: 1024)
!2598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2599, size: 64)
!2599 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !354, line: 2856, flags: DIFlagFwdDecl)
!2600 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !2396, file: !354, line: 3386, baseType: !2568, size: 1216)
!2601 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !2396, file: !354, line: 3387, baseType: !2602, size: 1280)
!2602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !354, line: 3093, size: 1280, elements: !2603)
!2603 = !{!2604, !2605}
!2604 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2602, file: !354, line: 3094, baseType: !2568, size: 1216)
!2605 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2602, file: !354, line: 3095, baseType: !2598, size: 64, offset: 1216)
!2606 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !2396, file: !354, line: 3388, baseType: !2607, size: 1216)
!2607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !354, line: 2824, size: 1216, elements: !2608)
!2608 = !{!2609, !2610, !2611, !2612, !2613, !2614}
!2609 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2607, file: !354, line: 2825, baseType: !2522, size: 896)
!2610 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2607, file: !354, line: 2827, baseType: !2394, size: 64, offset: 896)
!2611 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !2607, file: !354, line: 2828, baseType: !2394, size: 64, offset: 960)
!2612 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !2607, file: !354, line: 2829, baseType: !2394, size: 64, offset: 1024)
!2613 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !2607, file: !354, line: 2830, baseType: !2394, size: 64, offset: 1088)
!2614 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !2607, file: !354, line: 2831, baseType: !2394, size: 64, offset: 1152)
!2615 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !2396, file: !354, line: 3389, baseType: !2616, size: 1024)
!2616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !354, line: 2850, size: 1024, elements: !2617)
!2617 = !{!2618, !2619, !2620}
!2618 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2616, file: !354, line: 2851, baseType: !2560, size: 960)
!2619 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !2616, file: !354, line: 2852, baseType: !2240, size: 32, offset: 960)
!2620 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !2616, file: !354, line: 2853, baseType: !2240, size: 32, offset: 992)
!2621 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !2396, file: !354, line: 3390, baseType: !2622, size: 1024)
!2622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !354, line: 2857, size: 1024, elements: !2623)
!2623 = !{!2624, !2625}
!2624 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2622, file: !354, line: 2858, baseType: !2560, size: 960)
!2625 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2622, file: !354, line: 2859, baseType: !2598, size: 64, offset: 960)
!2626 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !2396, file: !354, line: 3391, baseType: !2627, size: 960)
!2627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !354, line: 2862, size: 960, elements: !2628)
!2628 = !{!2629}
!2629 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2627, file: !354, line: 2863, baseType: !2560, size: 960)
!2630 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !2396, file: !354, line: 3392, baseType: !2631, size: 1472)
!2631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !354, line: 3304, size: 1472, elements: !2632)
!2632 = !{!2633}
!2633 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2631, file: !354, line: 3305, baseType: !2565, size: 1472)
!2634 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !2396, file: !354, line: 3393, baseType: !2635, size: 1792)
!2635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !354, line: 3248, size: 1792, elements: !2636)
!2636 = !{!2637, !2638, !2963, !2964, !2965, !2966, !2967, !2968, !2969, !2970, !2971, !2972, !2973, !2974, !2975, !2976, !2977, !2978, !2979, !2980, !2981, !2982, !2983}
!2637 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2635, file: !354, line: 3249, baseType: !2565, size: 1472)
!2638 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !2635, file: !354, line: 3251, baseType: !2639, size: 64, offset: 1472)
!2639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2640, size: 64)
!2640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !2641, line: 463, size: 1152, elements: !2642)
!2641 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2642 = !{!2643, !2807, !2837, !2838, !2841, !2907, !2908, !2909, !2910, !2911, !2912, !2936, !2939, !2940, !2941, !2942, !2943, !2944, !2945, !2946, !2947, !2948, !2949, !2950, !2951, !2952, !2953, !2954, !2955, !2956, !2957, !2958, !2959, !2960, !2961, !2962}
!2643 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !2640, file: !2641, line: 464, baseType: !2644, size: 64)
!2644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2645, size: 64)
!2645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !318, line: 194, size: 384, elements: !2646)
!2646 = !{!2647, !2696, !2709, !2723, !2775, !2788}
!2647 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !2645, file: !318, line: 197, baseType: !2648, size: 64)
!2648 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !318, line: 182, baseType: !2649)
!2649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2650, size: 64)
!2650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !318, line: 116, size: 704, elements: !2651)
!2651 = !{!2652, !2653, !2654, !2655, !2656, !2657, !2684, !2693, !2694, !2695}
!2652 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !2650, file: !318, line: 119, baseType: !2649, size: 64)
!2653 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !2650, file: !318, line: 122, baseType: !2649, size: 64, offset: 64)
!2654 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !2650, file: !318, line: 123, baseType: !2649, size: 64, offset: 128)
!2655 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !2650, file: !318, line: 126, baseType: !2240, size: 32, offset: 192)
!2656 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !2650, file: !318, line: 129, baseType: !317, size: 32, offset: 224)
!2657 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !2650, file: !318, line: 165, baseType: !2658, size: 192, offset: 256)
!2658 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !318, line: 132, size: 192, elements: !2659)
!2659 = !{!2660, !2673, !2679}
!2660 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !2658, file: !318, line: 137, baseType: !2661, size: 128)
!2661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !318, line: 133, size: 128, elements: !2662)
!2662 = !{!2663, !2672}
!2663 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !2661, file: !318, line: 135, baseType: !2664, size: 64)
!2664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2665, size: 64)
!2665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !318, line: 93, size: 320, elements: !2666)
!2666 = !{!2667, !2668, !2669, !2670, !2671}
!2667 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !2665, file: !318, line: 96, baseType: !2664, size: 64)
!2668 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !2665, file: !318, line: 97, baseType: !2664, size: 64, offset: 64)
!2669 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !2665, file: !318, line: 101, baseType: !2394, size: 64, offset: 128)
!2670 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !2665, file: !318, line: 106, baseType: !2394, size: 64, offset: 192)
!2671 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !2665, file: !318, line: 111, baseType: !2394, size: 64, offset: 256)
!2672 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !2661, file: !318, line: 136, baseType: !2664, size: 64, offset: 64)
!2673 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !2658, file: !318, line: 151, baseType: !2674, size: 192)
!2674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !318, line: 139, size: 192, elements: !2675)
!2675 = !{!2676, !2677, !2678}
!2676 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !2674, file: !318, line: 141, baseType: !2394, size: 64)
!2677 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !2674, file: !318, line: 145, baseType: !2394, size: 64, offset: 64)
!2678 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !2674, file: !318, line: 150, baseType: !2240, size: 32, offset: 128)
!2679 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !2658, file: !318, line: 164, baseType: !2680, size: 128)
!2680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !318, line: 153, size: 128, elements: !2681)
!2681 = !{!2682, !2683}
!2682 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !2680, file: !318, line: 161, baseType: !2394, size: 64)
!2683 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !2680, file: !318, line: 163, baseType: !2514, size: 32, offset: 64)
!2684 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !2650, file: !318, line: 168, baseType: !2685, size: 64, offset: 448)
!2685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2686, size: 64)
!2686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !318, line: 67, size: 320, elements: !2687)
!2687 = !{!2688, !2689, !2690, !2691, !2692}
!2688 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !2686, file: !318, line: 70, baseType: !2685, size: 64)
!2689 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !2686, file: !318, line: 73, baseType: !2649, size: 64, offset: 64)
!2690 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !2686, file: !318, line: 78, baseType: !2394, size: 64, offset: 128)
!2691 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !2686, file: !318, line: 85, baseType: !2279, size: 64, offset: 192)
!2692 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !2686, file: !318, line: 88, baseType: !2240, size: 32, offset: 256)
!2693 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !2650, file: !318, line: 173, baseType: !2279, size: 64, offset: 512)
!2694 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !2650, file: !318, line: 173, baseType: !2279, size: 64, offset: 576)
!2695 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !2650, file: !318, line: 177, baseType: !2239, size: 8, offset: 640)
!2696 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !2645, file: !318, line: 200, baseType: !2697, size: 64, offset: 64)
!2697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2698, size: 64)
!2698 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !318, line: 185, baseType: !2699)
!2699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !318, line: 185, size: 128, elements: !2700)
!2700 = !{!2701}
!2701 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2699, file: !318, line: 185, baseType: !2702, size: 128)
!2702 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !318, line: 184, baseType: !2703)
!2703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !318, line: 184, size: 128, elements: !2704)
!2704 = !{!2705, !2706, !2707}
!2705 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2703, file: !318, line: 184, baseType: !7, size: 32)
!2706 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2703, file: !318, line: 184, baseType: !7, size: 32, offset: 32)
!2707 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2703, file: !318, line: 184, baseType: !2708, size: 64, offset: 64)
!2708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2648, size: 64, elements: !2313)
!2709 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !2645, file: !318, line: 203, baseType: !2710, size: 64, offset: 128)
!2710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2711, size: 64)
!2711 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !318, line: 189, baseType: !2712)
!2712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !318, line: 189, size: 128, elements: !2713)
!2713 = !{!2714}
!2714 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2712, file: !318, line: 189, baseType: !2715, size: 128)
!2715 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !318, line: 188, baseType: !2716)
!2716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !318, line: 188, size: 128, elements: !2717)
!2717 = !{!2718, !2719, !2720}
!2718 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2716, file: !318, line: 188, baseType: !7, size: 32)
!2719 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2716, file: !318, line: 188, baseType: !7, size: 32, offset: 32)
!2720 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2716, file: !318, line: 188, baseType: !2721, size: 64, offset: 64)
!2721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2722, size: 64, elements: !2313)
!2722 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !318, line: 180, baseType: !2685)
!2723 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !2645, file: !318, line: 207, baseType: !2724, size: 64, offset: 192)
!2724 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !2725, line: 144, baseType: !2726)
!2725 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2727, size: 64)
!2727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !2725, line: 100, size: 896, elements: !2728)
!2728 = !{!2729, !2737, !2742, !2747, !2749, !2752, !2753, !2754, !2755, !2756, !2761, !2763, !2764, !2769, !2774}
!2729 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !2727, file: !2725, line: 102, baseType: !2730, size: 64)
!2730 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !2725, line: 52, baseType: !2731)
!2731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2732, size: 64)
!2732 = !DISubroutineType(types: !2733)
!2733 = !{!2734, !2735}
!2734 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !2725, line: 47, baseType: !7)
!2735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2736, size: 64)
!2736 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!2737 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !2727, file: !2725, line: 105, baseType: !2738, size: 64, offset: 64)
!2738 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !2725, line: 59, baseType: !2739)
!2739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2740, size: 64)
!2740 = !DISubroutineType(types: !2741)
!2741 = !{!2240, !2735, !2735}
!2742 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !2727, file: !2725, line: 108, baseType: !2743, size: 64, offset: 128)
!2743 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !2725, line: 63, baseType: !2744)
!2744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2745, size: 64)
!2745 = !DISubroutineType(types: !2746)
!2746 = !{null, !2244}
!2747 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !2727, file: !2725, line: 111, baseType: !2748, size: 64, offset: 192)
!2748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2244, size: 64)
!2749 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2727, file: !2725, line: 114, baseType: !2750, size: 64, offset: 256)
!2750 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !2751, line: 46, baseType: !2348)
!2751 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!2752 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !2727, file: !2725, line: 117, baseType: !2750, size: 64, offset: 320)
!2753 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !2727, file: !2725, line: 120, baseType: !2750, size: 64, offset: 384)
!2754 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !2727, file: !2725, line: 124, baseType: !7, size: 32, offset: 448)
!2755 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !2727, file: !2725, line: 128, baseType: !7, size: 32, offset: 480)
!2756 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !2727, file: !2725, line: 131, baseType: !2757, size: 64, offset: 512)
!2757 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !2725, line: 75, baseType: !2758)
!2758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2759, size: 64)
!2759 = !DISubroutineType(types: !2760)
!2760 = !{!2244, !2750, !2750}
!2761 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !2727, file: !2725, line: 132, baseType: !2762, size: 64, offset: 576)
!2762 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !2725, line: 78, baseType: !2744)
!2763 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !2727, file: !2725, line: 135, baseType: !2244, size: 64, offset: 640)
!2764 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !2727, file: !2725, line: 136, baseType: !2765, size: 64, offset: 704)
!2765 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !2725, line: 82, baseType: !2766)
!2766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2767, size: 64)
!2767 = !DISubroutineType(types: !2768)
!2768 = !{!2244, !2244, !2750, !2750}
!2769 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !2727, file: !2725, line: 137, baseType: !2770, size: 64, offset: 768)
!2770 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !2725, line: 83, baseType: !2771)
!2771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2772, size: 64)
!2772 = !DISubroutineType(types: !2773)
!2773 = !{null, !2244, !2244}
!2774 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !2727, file: !2725, line: 141, baseType: !7, size: 32, offset: 832)
!2775 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !2645, file: !318, line: 211, baseType: !2776, size: 64, offset: 256)
!2776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2777, size: 64)
!2777 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !354, line: 183, baseType: !2778)
!2778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !354, line: 183, size: 128, elements: !2779)
!2779 = !{!2780}
!2780 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2778, file: !354, line: 183, baseType: !2781, size: 128)
!2781 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !354, line: 182, baseType: !2782)
!2782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !354, line: 182, size: 128, elements: !2783)
!2783 = !{!2784, !2785, !2786}
!2784 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2782, file: !354, line: 182, baseType: !7, size: 32)
!2785 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2782, file: !354, line: 182, baseType: !7, size: 32, offset: 32)
!2786 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2782, file: !354, line: 182, baseType: !2787, size: 64, offset: 64)
!2787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2394, size: 64, elements: !2313)
!2788 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !2645, file: !318, line: 220, baseType: !2789, size: 64, offset: 320)
!2789 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !318, line: 217, size: 64, elements: !2790)
!2790 = !{!2791, !2792}
!2791 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !2789, file: !318, line: 218, baseType: !2776, size: 64)
!2792 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !2789, file: !318, line: 219, baseType: !2793, size: 64)
!2793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2794, size: 64)
!2794 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !2795, line: 29, baseType: !2796)
!2795 = !DIFile(filename: "./vecprim.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !2795, line: 29, size: 96, elements: !2797)
!2797 = !{!2798}
!2798 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2796, file: !2795, line: 29, baseType: !2799, size: 96)
!2799 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !2795, line: 27, baseType: !2800)
!2800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !2795, line: 27, size: 96, elements: !2801)
!2801 = !{!2802, !2803, !2804}
!2802 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2800, file: !2795, line: 27, baseType: !7, size: 32)
!2803 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2800, file: !2795, line: 27, baseType: !7, size: 32, offset: 32)
!2804 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2800, file: !2795, line: 27, baseType: !2805, size: 8, offset: 64)
!2805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2806, size: 8, elements: !2313)
!2806 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !2795, line: 26, baseType: !2239)
!2807 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !2640, file: !2641, line: 467, baseType: !2808, size: 64, offset: 64)
!2808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2809, size: 64)
!2809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !325, line: 374, size: 640, elements: !2810)
!2810 = !{!2811, !2812, !2813, !2826, !2827, !2828, !2829, !2830, !2831, !2833, !2835, !2836}
!2811 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !2809, file: !325, line: 377, baseType: !2247, size: 64)
!2812 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !2809, file: !325, line: 378, baseType: !2247, size: 64, offset: 64)
!2813 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !2809, file: !325, line: 381, baseType: !2814, size: 64, offset: 128)
!2814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2815, size: 64)
!2815 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !325, line: 282, baseType: !2816)
!2816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !325, line: 282, size: 128, elements: !2817)
!2817 = !{!2818}
!2818 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2816, file: !325, line: 282, baseType: !2819, size: 128)
!2819 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !325, line: 281, baseType: !2820)
!2820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !325, line: 281, size: 128, elements: !2821)
!2821 = !{!2822, !2823, !2824}
!2822 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2820, file: !325, line: 281, baseType: !7, size: 32)
!2823 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2820, file: !325, line: 281, baseType: !7, size: 32, offset: 32)
!2824 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2820, file: !325, line: 281, baseType: !2825, size: 64, offset: 64)
!2825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2247, size: 64, elements: !2313)
!2826 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !2809, file: !325, line: 384, baseType: !2240, size: 32, offset: 192)
!2827 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !2809, file: !325, line: 387, baseType: !2240, size: 32, offset: 224)
!2828 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !2809, file: !325, line: 390, baseType: !2240, size: 32, offset: 256)
!2829 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !2809, file: !325, line: 394, baseType: !2814, size: 64, offset: 320)
!2830 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !2809, file: !325, line: 396, baseType: !324, size: 32, offset: 384)
!2831 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !2809, file: !325, line: 399, baseType: !2832, size: 64, offset: 416)
!2832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 64, elements: !2349)
!2833 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !2809, file: !325, line: 402, baseType: !2834, size: 64, offset: 480)
!2834 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !2349)
!2835 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !2809, file: !325, line: 406, baseType: !2240, size: 32, offset: 544)
!2836 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !2809, file: !325, line: 409, baseType: !2240, size: 32, offset: 576)
!2837 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !2640, file: !2641, line: 470, baseType: !2276, size: 64, offset: 128)
!2838 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !2640, file: !2641, line: 473, baseType: !2839, size: 64, offset: 192)
!2839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2840, size: 64)
!2840 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !2641, line: 166, flags: DIFlagFwdDecl)
!2841 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !2640, file: !2641, line: 476, baseType: !2842, size: 64, offset: 256)
!2842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2843, size: 64)
!2843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !336, line: 187, size: 256, elements: !2844)
!2844 = !{!2845, !2846, !2905, !2906}
!2845 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !2843, file: !336, line: 189, baseType: !2240, size: 32)
!2846 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !2843, file: !336, line: 192, baseType: !2847, size: 64, offset: 64)
!2847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2848, size: 64)
!2848 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !336, line: 87, baseType: !2849)
!2849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !336, line: 87, size: 128, elements: !2850)
!2850 = !{!2851}
!2851 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2849, file: !336, line: 87, baseType: !2852, size: 128)
!2852 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !336, line: 85, baseType: !2853)
!2853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !336, line: 85, size: 128, elements: !2854)
!2854 = !{!2855, !2856, !2857}
!2855 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2853, file: !336, line: 85, baseType: !7, size: 32)
!2856 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2853, file: !336, line: 85, baseType: !7, size: 32, offset: 32)
!2857 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2853, file: !336, line: 85, baseType: !2858, size: 64, offset: 64)
!2858 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2859, size: 64, elements: !2313)
!2859 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !336, line: 84, baseType: !2860)
!2860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2861, size: 64)
!2861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !336, line: 100, size: 1216, elements: !2862)
!2862 = !{!2863, !2864, !2865, !2866, !2867, !2872, !2873, !2874, !2875, !2876, !2877, !2878, !2879, !2880, !2881, !2882, !2883, !2884, !2895, !2903, !2904}
!2863 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2861, file: !336, line: 102, baseType: !2240, size: 32)
!2864 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !2861, file: !336, line: 105, baseType: !7, size: 32, offset: 32)
!2865 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !2861, file: !336, line: 108, baseType: !2249, size: 64, offset: 64)
!2866 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !2861, file: !336, line: 111, baseType: !2249, size: 64, offset: 128)
!2867 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !2861, file: !336, line: 114, baseType: !2868, size: 64, offset: 192)
!2868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !336, line: 41, size: 64, elements: !2869)
!2869 = !{!2870, !2871}
!2870 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !2868, file: !336, line: 42, baseType: !335, size: 32)
!2871 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !2868, file: !336, line: 43, baseType: !7, size: 32, offset: 32)
!2872 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !2861, file: !336, line: 117, baseType: !7, size: 32, offset: 256)
!2873 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !2861, file: !336, line: 120, baseType: !7, size: 32, offset: 288)
!2874 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !2861, file: !336, line: 123, baseType: !2847, size: 64, offset: 320)
!2875 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !2861, file: !336, line: 126, baseType: !2860, size: 64, offset: 384)
!2876 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2861, file: !336, line: 129, baseType: !2860, size: 64, offset: 448)
!2877 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !2861, file: !336, line: 132, baseType: !2244, size: 64, offset: 512)
!2878 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !2861, file: !336, line: 139, baseType: !2394, size: 64, offset: 576)
!2879 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !2861, file: !336, line: 143, baseType: !2442, size: 128, offset: 640)
!2880 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !2861, file: !336, line: 146, baseType: !2442, size: 128, offset: 768)
!2881 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !2861, file: !336, line: 148, baseType: !2239, size: 8, offset: 896)
!2882 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !2861, file: !336, line: 149, baseType: !2239, size: 8, offset: 904)
!2883 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !2861, file: !336, line: 153, baseType: !344, size: 32, offset: 928)
!2884 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !2861, file: !336, line: 156, baseType: !2885, size: 64, offset: 960)
!2885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2886, size: 64)
!2886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !336, line: 48, size: 320, elements: !2887)
!2887 = !{!2888, !2892, !2893, !2894}
!2888 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !2886, file: !336, line: 50, baseType: !2889, size: 64)
!2889 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !2248, line: 58, baseType: !2890)
!2890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2891, size: 64)
!2891 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !2248, line: 57, flags: DIFlagFwdDecl)
!2892 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !2886, file: !336, line: 59, baseType: !2442, size: 128, offset: 64)
!2893 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !2886, file: !336, line: 64, baseType: !2239, size: 8, offset: 192)
!2894 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2886, file: !336, line: 67, baseType: !2885, size: 64, offset: 256)
!2895 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !2861, file: !336, line: 159, baseType: !2896, size: 64, offset: 1024)
!2896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2897, size: 64)
!2897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !336, line: 72, size: 256, elements: !2898)
!2898 = !{!2899, !2900, !2901, !2902}
!2899 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !2897, file: !336, line: 74, baseType: !2266, size: 64)
!2900 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2897, file: !336, line: 77, baseType: !2896, size: 64, offset: 64)
!2901 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2897, file: !336, line: 78, baseType: !2896, size: 64, offset: 128)
!2902 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !2897, file: !336, line: 81, baseType: !2896, size: 64, offset: 192)
!2903 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !2861, file: !336, line: 162, baseType: !2239, size: 8, offset: 1088)
!2904 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !2861, file: !336, line: 166, baseType: !2394, size: 64, offset: 1152)
!2905 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !2843, file: !336, line: 197, baseType: !2724, size: 64, offset: 128)
!2906 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !2843, file: !336, line: 200, baseType: !2860, size: 64, offset: 192)
!2907 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !2640, file: !2641, line: 479, baseType: !2724, size: 64, offset: 320)
!2908 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !2640, file: !2641, line: 484, baseType: !2394, size: 64, offset: 384)
!2909 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !2640, file: !2641, line: 488, baseType: !2394, size: 64, offset: 448)
!2910 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !2640, file: !2641, line: 493, baseType: !2394, size: 64, offset: 512)
!2911 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !2640, file: !2641, line: 496, baseType: !2394, size: 64, offset: 576)
!2912 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !2640, file: !2641, line: 501, baseType: !2913, size: 64, offset: 640)
!2913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2914, size: 64)
!2914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !349, line: 2355, size: 576, elements: !2915)
!2915 = !{!2916, !2919, !2920, !2921, !2922, !2924, !2925, !2930, !2931, !2932, !2933, !2934, !2935}
!2916 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !2914, file: !349, line: 2356, baseType: !2917, size: 64)
!2917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2918, size: 64)
!2918 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !349, line: 2356, flags: DIFlagFwdDecl)
!2919 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !2914, file: !349, line: 2357, baseType: !2245, size: 64, offset: 64)
!2920 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !2914, file: !349, line: 2358, baseType: !2240, size: 32, offset: 128)
!2921 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !2914, file: !349, line: 2359, baseType: !2240, size: 32, offset: 160)
!2922 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !2914, file: !349, line: 2360, baseType: !2923, size: 128, offset: 192)
!2923 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2240, size: 128, elements: !2374)
!2924 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !2914, file: !349, line: 2364, baseType: !2240, size: 32, offset: 320)
!2925 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !2914, file: !349, line: 2367, baseType: !2926, size: 128, offset: 384)
!2926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !349, line: 2349, size: 128, elements: !2927)
!2927 = !{!2928, !2929}
!2928 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !2926, file: !349, line: 2351, baseType: !2279, size: 64)
!2929 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2926, file: !349, line: 2352, baseType: !2365, size: 64, offset: 64)
!2930 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !2914, file: !349, line: 2371, baseType: !348, size: 32, offset: 512)
!2931 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !2914, file: !349, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!2932 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !2914, file: !349, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!2933 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !2914, file: !349, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!2934 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !2914, file: !349, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!2935 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !2914, file: !349, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!2936 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !2640, file: !2641, line: 504, baseType: !2937, size: 64, offset: 704)
!2937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2938, size: 64)
!2938 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !2641, line: 504, flags: DIFlagFwdDecl)
!2939 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !2640, file: !2641, line: 507, baseType: !2724, size: 64, offset: 768)
!2940 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !2640, file: !2641, line: 510, baseType: !2240, size: 32, offset: 832)
!2941 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !2640, file: !2641, line: 513, baseType: !2240, size: 32, offset: 864)
!2942 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !2640, file: !2641, line: 516, baseType: !2514, size: 32, offset: 896)
!2943 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !2640, file: !2641, line: 519, baseType: !2514, size: 32, offset: 928)
!2944 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !2640, file: !2641, line: 522, baseType: !7, size: 32, offset: 960)
!2945 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !2640, file: !2641, line: 523, baseType: !7, size: 32, offset: 992)
!2946 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !2640, file: !2641, line: 528, baseType: !2245, size: 64, offset: 1024)
!2947 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !2640, file: !2641, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!2948 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !2640, file: !2641, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!2949 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !2640, file: !2641, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!2950 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !2640, file: !2641, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!2951 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !2640, file: !2641, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!2952 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !2640, file: !2641, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!2953 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !2640, file: !2641, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!2954 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !2640, file: !2641, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!2955 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !2640, file: !2641, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!2956 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !2640, file: !2641, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!2957 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !2640, file: !2641, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!2958 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !2640, file: !2641, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!2959 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !2640, file: !2641, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!2960 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !2640, file: !2641, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!2961 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !2640, file: !2641, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!2962 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !2640, file: !2641, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!2963 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !2635, file: !354, line: 3254, baseType: !2394, size: 64, offset: 1536)
!2964 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !2635, file: !354, line: 3257, baseType: !2394, size: 64, offset: 1600)
!2965 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !2635, file: !354, line: 3258, baseType: !2394, size: 64, offset: 1664)
!2966 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !2635, file: !354, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!2967 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !2635, file: !354, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!2968 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !2635, file: !354, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!2969 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !2635, file: !354, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!2970 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !2635, file: !354, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!2971 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !2635, file: !354, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!2972 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !2635, file: !354, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!2973 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !2635, file: !354, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!2974 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !2635, file: !354, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!2975 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !2635, file: !354, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!2976 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !2635, file: !354, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!2977 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !2635, file: !354, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!2978 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !2635, file: !354, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!2979 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !2635, file: !354, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!2980 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !2635, file: !354, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!2981 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !2635, file: !354, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!2982 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !2635, file: !354, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!2983 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !2635, file: !354, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!2984 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !2396, file: !354, line: 3394, baseType: !2985, size: 1344)
!2985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !354, line: 2279, size: 1344, elements: !2986)
!2986 = !{!2987, !2988, !2989, !2990, !2991, !2992, !2993, !2994, !2995, !2996, !2997, !2998, !2999, !3000, !3001, !3002, !3003, !3004, !3005, !3006, !3007, !3008, !3009, !3012, !3013, !3014, !3022, !3023, !3024, !3025, !3026, !3027, !3028, !3029, !3030}
!2987 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2985, file: !354, line: 2280, baseType: !2432, size: 192)
!2988 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !2985, file: !354, line: 2281, baseType: !2394, size: 64, offset: 192)
!2989 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2985, file: !354, line: 2282, baseType: !2394, size: 64, offset: 256)
!2990 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !2985, file: !354, line: 2283, baseType: !2394, size: 64, offset: 320)
!2991 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !2985, file: !354, line: 2284, baseType: !2394, size: 64, offset: 384)
!2992 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !2985, file: !354, line: 2285, baseType: !7, size: 32, offset: 448)
!2993 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !2985, file: !354, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!2994 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !2985, file: !354, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!2995 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !2985, file: !354, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
