; ModuleID = 'incpath.bc'
source_filename = "incpath.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.cpp_dir = type { %struct.cpp_dir*, i8*, i32, i8, i8, i8*, i8**, i8* (i8*, %struct.cpp_dir*)*, i64, i64 }
%struct.target_c_incpath_s = type { void (i8*, i8*, i32)*, void (i8*, i8*, i32)* }
%struct.default_include = type { i8*, i8*, i8, i8, i8, i8 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.stat64 = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.cpp_reader = type opaque
%struct.cpp_options = type { i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8*, i8*, i8*, i32, i8, i8, %struct.anon, i64, i64, i64, i64, i8, i8, i8, i8, i8 }
%struct.anon = type { i32, i8, i8, i8, i8 }


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "heads", scope: !2, file: !3, line: 63, type: !168, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !30, globals: !66, nameTableKind: None)
!3 = !DIFile(filename: "incpath.c", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!4 = !{!5, !19, !25}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_lang", file: !6, line: 158, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./cpplib.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!9 = !DIEnumerator(name: "CLK_GNUC89", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "CLK_GNUC99", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "CLK_STDC89", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "CLK_STDC94", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "CLK_STDC99", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "CLK_GNUCXX", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "CLK_CXX98", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "CLK_GNUCXX0X", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "CLK_CXX0X", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "CLK_ASM", value: 9, isUnsigned: true)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cpp_normalize_level", file: !6, line: 265, baseType: !7, size: 32, elements: !20)
!20 = !{!21, !22, !23, !24}
!21 = !DIEnumerator(name: "normalized_KC", value: 0, isUnsigned: true)
!22 = !DIEnumerator(name: "normalized_C", value: 1, isUnsigned: true)
!23 = !DIEnumerator(name: "normalized_identifier_C", value: 2, isUnsigned: true)
!24 = !DIEnumerator(name: "normalized_none", value: 3, isUnsigned: true)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cpp_deps_style", file: !6, line: 262, baseType: !7, size: 32, elements: !26)
!26 = !{!27, !28, !29}
!27 = !DIEnumerator(name: "DEPS_NONE", value: 0, isUnsigned: true)
!28 = !DIEnumerator(name: "DEPS_USER", value: 1, isUnsigned: true)
!29 = !DIEnumerator(name: "DEPS_SYSTEM", value: 2, isUnsigned: true)
!30 = !{!31, !32, !33, !34, !37, !38, !40, !35}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!33 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_dir", file: !6, line: 39, baseType: !42)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_dir", file: !6, line: 523, size: 512, elements: !43)
!43 = !{!44, !46, !47, !48, !49, !50, !51, !53, !57, !63}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !42, file: !6, line: 526, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !42, file: !6, line: 529, baseType: !35, size: 64, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !42, file: !6, line: 530, baseType: !7, size: 32, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !42, file: !6, line: 534, baseType: !32, size: 8, offset: 160)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "user_supplied_p", scope: !42, file: !6, line: 537, baseType: !32, size: 8, offset: 168)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "canonical_name", scope: !42, file: !6, line: 541, baseType: !35, size: 64, offset: 192)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "name_map", scope: !42, file: !6, line: 545, baseType: !52, size: 64, offset: 256)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "construct", scope: !42, file: !6, line: 551, baseType: !54, size: 64, offset: 320)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{!35, !38, !40}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !42, file: !6, line: 555, baseType: !58, size: 64, offset: 384)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !59, line: 47, baseType: !60)
!59 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !61, line: 148, baseType: !62)
!61 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!62 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !42, file: !6, line: 556, baseType: !64, size: 64, offset: 448)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !59, line: 59, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !61, line: 145, baseType: !62)
!66 = !{!67, !156, !0, !166, !169, !171, !217}
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression())
!68 = distinct !DIGlobalVariable(name: "lang_env_vars", scope: !69, file: !3, line: 430, type: !152, isLocal: true, isDefinition: true)
!69 = distinct !DISubprogram(name: "register_include_chains", scope: !3, file: !3, line: 426, type: !70, scopeLine: 429, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !76)
!70 = !DISubroutineType(types: !71)
!71 = !{null, !72, !38, !38, !38, !33, !33, !33}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_reader", file: !6, line: 31, baseType: !74)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_reader", file: !75, line: 91, flags: DIFlagFwdDecl)
!75 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!76 = !{!77, !78, !79, !80, !81, !82, !83, !84, !151}
!77 = !DILocalVariable(name: "pfile", arg: 1, scope: !69, file: !3, line: 426, type: !72)
!78 = !DILocalVariable(name: "sysroot", arg: 2, scope: !69, file: !3, line: 426, type: !38)
!79 = !DILocalVariable(name: "iprefix", arg: 3, scope: !69, file: !3, line: 427, type: !38)
!80 = !DILocalVariable(name: "imultilib", arg: 4, scope: !69, file: !3, line: 427, type: !38)
!81 = !DILocalVariable(name: "stdinc", arg: 5, scope: !69, file: !3, line: 428, type: !33)
!82 = !DILocalVariable(name: "cxx_stdinc", arg: 6, scope: !69, file: !3, line: 428, type: !33)
!83 = !DILocalVariable(name: "verbose", arg: 7, scope: !69, file: !3, line: 428, type: !33)
!84 = !DILocalVariable(name: "cpp_opts", scope: !69, file: !3, line: 433, type: !85)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_options", file: !6, line: 33, baseType: !87)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_options", file: !6, line: 279, size: 1024, elements: !88)
!88 = !{!89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !140, !143, !144, !145, !146, !147, !148, !149, !150}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "tabstop", scope: !87, file: !6, line: 282, baseType: !7, size: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "lang", scope: !87, file: !6, line: 285, baseType: !5, size: 32, offset: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "cplusplus", scope: !87, file: !6, line: 288, baseType: !32, size: 8, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "cplusplus_comments", scope: !87, file: !6, line: 291, baseType: !32, size: 8, offset: 72)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "objc", scope: !87, file: !6, line: 296, baseType: !32, size: 8, offset: 80)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "discard_comments", scope: !87, file: !6, line: 299, baseType: !32, size: 8, offset: 88)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "discard_comments_in_macro_exp", scope: !87, file: !6, line: 303, baseType: !32, size: 8, offset: 96)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "trigraphs", scope: !87, file: !6, line: 306, baseType: !32, size: 8, offset: 104)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "digraphs", scope: !87, file: !6, line: 309, baseType: !32, size: 8, offset: 112)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "extended_numbers", scope: !87, file: !6, line: 312, baseType: !32, size: 8, offset: 120)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "uliterals", scope: !87, file: !6, line: 315, baseType: !32, size: 8, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "print_include_names", scope: !87, file: !6, line: 318, baseType: !32, size: 8, offset: 136)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "warn_deprecated", scope: !87, file: !6, line: 321, baseType: !32, size: 8, offset: 144)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "warn_comments", scope: !87, file: !6, line: 324, baseType: !32, size: 8, offset: 152)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "warn_missing_include_dirs", scope: !87, file: !6, line: 328, baseType: !32, size: 8, offset: 160)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "warn_trigraphs", scope: !87, file: !6, line: 331, baseType: !32, size: 8, offset: 168)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "warn_multichar", scope: !87, file: !6, line: 334, baseType: !32, size: 8, offset: 176)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "warn_traditional", scope: !87, file: !6, line: 338, baseType: !32, size: 8, offset: 184)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "warn_long_long", scope: !87, file: !6, line: 341, baseType: !32, size: 8, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "warn_endif_labels", scope: !87, file: !6, line: 344, baseType: !32, size: 8, offset: 200)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "warn_num_sign_change", scope: !87, file: !6, line: 348, baseType: !32, size: 8, offset: 208)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "warn_variadic_macros", scope: !87, file: !6, line: 352, baseType: !32, size: 8, offset: 216)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "warn_builtin_macro_redefined", scope: !87, file: !6, line: 356, baseType: !32, size: 8, offset: 224)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !87, file: !6, line: 360, baseType: !32, size: 8, offset: 232)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "dollars_in_ident", scope: !87, file: !6, line: 363, baseType: !32, size: 8, offset: 240)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "extended_identifiers", scope: !87, file: !6, line: 366, baseType: !32, size: 8, offset: 248)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "warn_dollars", scope: !87, file: !6, line: 370, baseType: !32, size: 8, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "warn_undef", scope: !87, file: !6, line: 373, baseType: !32, size: 8, offset: 264)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "warn_unused_macros", scope: !87, file: !6, line: 376, baseType: !32, size: 8, offset: 272)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "c99", scope: !87, file: !6, line: 379, baseType: !32, size: 8, offset: 280)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "std", scope: !87, file: !6, line: 382, baseType: !32, size: 8, offset: 288)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "pedantic", scope: !87, file: !6, line: 385, baseType: !32, size: 8, offset: 296)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "preprocessed", scope: !87, file: !6, line: 389, baseType: !32, size: 8, offset: 304)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "show_column", scope: !87, file: !6, line: 392, baseType: !32, size: 8, offset: 312)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "operator_names", scope: !87, file: !6, line: 395, baseType: !32, size: 8, offset: 320)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "warn_cxx_operator_names", scope: !87, file: !6, line: 398, baseType: !32, size: 8, offset: 328)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "traditional", scope: !87, file: !6, line: 401, baseType: !32, size: 8, offset: 336)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "narrow_charset", scope: !87, file: !6, line: 404, baseType: !38, size: 64, offset: 384)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "wide_charset", scope: !87, file: !6, line: 407, baseType: !38, size: 64, offset: 448)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "input_charset", scope: !87, file: !6, line: 410, baseType: !38, size: 64, offset: 512)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "warn_normalize", scope: !87, file: !6, line: 414, baseType: !19, size: 32, offset: 576)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "warn_invalid_pch", scope: !87, file: !6, line: 417, baseType: !32, size: 8, offset: 608)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "restore_pch_deps", scope: !87, file: !6, line: 420, baseType: !32, size: 8, offset: 616)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "deps", scope: !87, file: !6, line: 441, baseType: !133, size: 64, offset: 640)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !87, file: !6, line: 423, size: 64, elements: !134)
!134 = !{!135, !136, !137, !138, !139}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !133, file: !6, line: 426, baseType: !25, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "missing_files", scope: !133, file: !6, line: 429, baseType: !32, size: 8, offset: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "phony_targets", scope: !133, file: !6, line: 433, baseType: !32, size: 8, offset: 40)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_main_file", scope: !133, file: !6, line: 436, baseType: !32, size: 8, offset: 48)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "need_preprocessor_output", scope: !133, file: !6, line: 440, baseType: !32, size: 8, offset: 56)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !87, file: !6, line: 447, baseType: !141, size: 64, offset: 704)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !142, line: 46, baseType: !62)
!142 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!143 = !DIDerivedType(tag: DW_TAG_member, name: "char_precision", scope: !87, file: !6, line: 447, baseType: !141, size: 64, offset: 768)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "int_precision", scope: !87, file: !6, line: 447, baseType: !141, size: 64, offset: 832)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "wchar_precision", scope: !87, file: !6, line: 447, baseType: !141, size: 64, offset: 896)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_char", scope: !87, file: !6, line: 450, baseType: !32, size: 8, offset: 960)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_wchar", scope: !87, file: !6, line: 450, baseType: !32, size: 8, offset: 968)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_big_endian", scope: !87, file: !6, line: 454, baseType: !32, size: 8, offset: 976)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "stdc_0_in_system_headers", scope: !87, file: !6, line: 457, baseType: !32, size: 8, offset: 984)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "directives_only", scope: !87, file: !6, line: 460, baseType: !32, size: 8, offset: 992)
!151 = !DILocalVariable(name: "idx", scope: !69, file: !3, line: 434, type: !141)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 256, elements: !154)
!153 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!154 = !{!155}
!155 = !DISubrange(count: 4)
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(name: "target_c_incpath", scope: !2, file: !3, line: 474, type: !158, isLocal: false, isDefinition: true)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "target_c_incpath_s", file: !159, line: 26, size: 128, elements: !160)
!159 = !DIFile(filename: "./incpath.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!160 = !{!161, !165}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "extra_pre_includes", scope: !158, file: !159, line: 28, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{null, !38, !38, !33}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "extra_includes", scope: !158, file: !159, line: 29, baseType: !162, size: 64, offset: 64)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "tails", scope: !2, file: !3, line: 64, type: !168, isLocal: true, isDefinition: true)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 256, elements: !154)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(name: "quote_ignores_source_dir", scope: !2, file: !3, line: 65, type: !32, isLocal: true, isDefinition: true)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "relocated_prefix", scope: !173, file: !3, line: 173, type: !38, isLocal: true, isDefinition: true)
!173 = distinct !DISubprogram(name: "add_standard_paths", scope: !3, file: !3, line: 129, type: !174, scopeLine: 131, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !176)
!174 = !DISubroutineType(types: !175)
!175 = !{null, !38, !38, !38, !33}
!176 = !{!177, !178, !179, !180, !181, !193, !194, !195, !205, !211}
!177 = !DILocalVariable(name: "sysroot", arg: 1, scope: !173, file: !3, line: 129, type: !38)
!178 = !DILocalVariable(name: "iprefix", arg: 2, scope: !173, file: !3, line: 129, type: !38)
!179 = !DILocalVariable(name: "imultilib", arg: 3, scope: !173, file: !3, line: 130, type: !38)
!180 = !DILocalVariable(name: "cxx_stdinc", arg: 4, scope: !173, file: !3, line: 130, type: !33)
!181 = !DILocalVariable(name: "p", scope: !173, file: !3, line: 132, type: !182)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "default_include", file: !185, line: 35, size: 192, elements: !186)
!185 = !DIFile(filename: "./cppdefault.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!186 = !{!187, !188, !189, !190, !191, !192}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !184, file: !185, line: 37, baseType: !153, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "component", scope: !184, file: !185, line: 38, baseType: !153, size: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "cplusplus", scope: !184, file: !185, line: 40, baseType: !39, size: 8, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "cxx_aware", scope: !184, file: !185, line: 41, baseType: !39, size: 8, offset: 136)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "add_sysroot", scope: !184, file: !185, line: 44, baseType: !39, size: 8, offset: 144)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "multilib", scope: !184, file: !185, line: 46, baseType: !39, size: 8, offset: 152)
!193 = !DILocalVariable(name: "relocated", scope: !173, file: !3, line: 133, type: !33)
!194 = !DILocalVariable(name: "len", scope: !173, file: !3, line: 134, type: !141)
!195 = !DILocalVariable(name: "str", scope: !196, file: !3, line: 152, type: !35)
!196 = distinct !DILexicalBlock(scope: !197, file: !3, line: 151, column: 3)
!197 = distinct !DILexicalBlock(scope: !198, file: !3, line: 150, column: 12)
!198 = distinct !DILexicalBlock(scope: !199, file: !3, line: 144, column: 6)
!199 = distinct !DILexicalBlock(scope: !200, file: !3, line: 143, column: 8)
!200 = distinct !DILexicalBlock(scope: !201, file: !3, line: 142, column: 2)
!201 = distinct !DILexicalBlock(scope: !202, file: !3, line: 141, column: 7)
!202 = distinct !DILexicalBlock(scope: !203, file: !3, line: 141, column: 7)
!203 = distinct !DILexicalBlock(scope: !204, file: !3, line: 137, column: 5)
!204 = distinct !DILexicalBlock(scope: !173, file: !3, line: 136, column: 7)
!205 = !DILocalVariable(name: "str", scope: !206, file: !3, line: 165, type: !35)
!206 = distinct !DILexicalBlock(scope: !207, file: !3, line: 164, column: 2)
!207 = distinct !DILexicalBlock(scope: !208, file: !3, line: 163, column: 11)
!208 = distinct !DILexicalBlock(scope: !209, file: !3, line: 162, column: 5)
!209 = distinct !DILexicalBlock(scope: !210, file: !3, line: 161, column: 3)
!210 = distinct !DILexicalBlock(scope: !173, file: !3, line: 161, column: 3)
!211 = !DILocalVariable(name: "dummy", scope: !212, file: !3, line: 181, type: !35)
!212 = distinct !DILexicalBlock(scope: !213, file: !3, line: 180, column: 3)
!213 = distinct !DILexicalBlock(scope: !214, file: !3, line: 179, column: 12)
!214 = distinct !DILexicalBlock(scope: !215, file: !3, line: 172, column: 6)
!215 = distinct !DILexicalBlock(scope: !216, file: !3, line: 170, column: 13)
!216 = distinct !DILexicalBlock(scope: !206, file: !3, line: 168, column: 8)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(name: "dir_separator_str", scope: !2, file: !3, line: 51, type: !219, isLocal: true, isDefinition: true)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 16, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 2)
!222 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!223 = !{i32 2, !"Dwarf Version", i32 4}
!224 = !{i32 2, !"Debug Info Version", i32 3}
!225 = !{i32 1, !"wchar_size", i32 4}
!226 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!227 = distinct !DISubprogram(name: "vprintf", scope: !228, file: !228, line: 39, type: !229, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !239)
!228 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!229 = !DISubroutineType(types: !230)
!230 = !{!33, !231, !232}
!231 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !38)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, size: 192, elements: !234)
!234 = !{!235, !236, !237, !238}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !233, file: !3, baseType: !7, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !233, file: !3, baseType: !7, size: 32, offset: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !233, file: !3, baseType: !37, size: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !233, file: !3, baseType: !37, size: 64, offset: 128)
!239 = !{!240, !241}
!240 = !DILocalVariable(name: "__fmt", arg: 1, scope: !227, file: !228, line: 39, type: !231)
!241 = !DILocalVariable(name: "__arg", arg: 2, scope: !227, file: !228, line: 39, type: !232)
!242 = !DILocation(line: 0, scope: !227)
!243 = !DILocation(line: 41, column: 20, scope: !227)
!244 = !DILocation(line: 41, column: 10, scope: !227)
!245 = !DILocation(line: 41, column: 3, scope: !227)
!246 = distinct !DISubprogram(name: "getchar", scope: !228, file: !228, line: 47, type: !247, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !249)
!247 = !DISubroutineType(types: !248)
!248 = !{!33}
!249 = !{}
!250 = !DILocation(line: 49, column: 16, scope: !246)
!251 = !DILocation(line: 49, column: 10, scope: !246)
!252 = !DILocation(line: 49, column: 3, scope: !246)
!253 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !228, file: !228, line: 56, type: !254, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !311)
!254 = !DISubroutineType(types: !255)
!255 = !{!33, !256}
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !258, line: 7, baseType: !259)
!258 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !260, line: 49, size: 1728, elements: !261)
!260 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!261 = !{!262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !277, !279, !280, !281, !284, !286, !288, !292, !295, !297, !300, !303, !304, !305, !306, !307}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !259, file: !260, line: 51, baseType: !33, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !259, file: !260, line: 54, baseType: !35, size: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !259, file: !260, line: 55, baseType: !35, size: 64, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !259, file: !260, line: 56, baseType: !35, size: 64, offset: 192)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !259, file: !260, line: 57, baseType: !35, size: 64, offset: 256)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !259, file: !260, line: 58, baseType: !35, size: 64, offset: 320)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !259, file: !260, line: 59, baseType: !35, size: 64, offset: 384)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !259, file: !260, line: 60, baseType: !35, size: 64, offset: 448)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !259, file: !260, line: 61, baseType: !35, size: 64, offset: 512)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !259, file: !260, line: 64, baseType: !35, size: 64, offset: 576)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !259, file: !260, line: 65, baseType: !35, size: 64, offset: 640)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !259, file: !260, line: 66, baseType: !35, size: 64, offset: 704)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !259, file: !260, line: 68, baseType: !275, size: 64, offset: 768)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !260, line: 36, flags: DIFlagFwdDecl)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !259, file: !260, line: 70, baseType: !278, size: 64, offset: 832)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !259, file: !260, line: 72, baseType: !33, size: 32, offset: 896)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !259, file: !260, line: 73, baseType: !33, size: 32, offset: 928)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !259, file: !260, line: 74, baseType: !282, size: 64, offset: 960)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !61, line: 152, baseType: !283)
!283 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !259, file: !260, line: 77, baseType: !285, size: 16, offset: 1024)
!285 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !259, file: !260, line: 78, baseType: !287, size: 8, offset: 1040)
!287 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !259, file: !260, line: 79, baseType: !289, size: 8, offset: 1048)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 8, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 1)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !259, file: !260, line: 81, baseType: !293, size: 64, offset: 1088)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !260, line: 43, baseType: null)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !259, file: !260, line: 89, baseType: !296, size: 64, offset: 1152)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !61, line: 153, baseType: !283)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !259, file: !260, line: 91, baseType: !298, size: 64, offset: 1216)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !260, line: 37, flags: DIFlagFwdDecl)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !259, file: !260, line: 92, baseType: !301, size: 64, offset: 1280)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !260, line: 38, flags: DIFlagFwdDecl)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !259, file: !260, line: 93, baseType: !278, size: 64, offset: 1344)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !259, file: !260, line: 94, baseType: !37, size: 64, offset: 1408)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !259, file: !260, line: 95, baseType: !141, size: 64, offset: 1472)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !259, file: !260, line: 96, baseType: !33, size: 32, offset: 1536)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !259, file: !260, line: 98, baseType: !308, size: 160, offset: 1568)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 160, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 20)
!311 = !{!312}
!312 = !DILocalVariable(name: "__fp", arg: 1, scope: !253, file: !228, line: 56, type: !256)
!313 = !DILocation(line: 0, scope: !253)
!314 = !DILocation(line: 58, column: 10, scope: !253)
!315 = !DILocation(line: 58, column: 3, scope: !253)
!316 = distinct !DISubprogram(name: "getc_unlocked", scope: !228, file: !228, line: 66, type: !254, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !317)
!317 = !{!318}
!318 = !DILocalVariable(name: "__fp", arg: 1, scope: !316, file: !228, line: 66, type: !256)
!319 = !DILocation(line: 0, scope: !316)
!320 = !DILocation(line: 68, column: 10, scope: !316)
!321 = !DILocation(line: 68, column: 3, scope: !316)
!322 = distinct !DISubprogram(name: "getchar_unlocked", scope: !228, file: !228, line: 73, type: !247, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !249)
!323 = !DILocation(line: 75, column: 10, scope: !322)
!324 = !DILocation(line: 75, column: 3, scope: !322)
!325 = distinct !DISubprogram(name: "putchar", scope: !228, file: !228, line: 82, type: !326, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !328)
!326 = !DISubroutineType(types: !327)
!327 = !{!33, !33}
!328 = !{!329}
!329 = !DILocalVariable(name: "__c", arg: 1, scope: !325, file: !228, line: 82, type: !33)
!330 = !DILocation(line: 0, scope: !325)
!331 = !DILocation(line: 84, column: 21, scope: !325)
!332 = !DILocation(line: 84, column: 10, scope: !325)
!333 = !DILocation(line: 84, column: 3, scope: !325)
!334 = distinct !DISubprogram(name: "fputc_unlocked", scope: !228, file: !228, line: 91, type: !335, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !337)
!335 = !DISubroutineType(types: !336)
!336 = !{!33, !33, !256}
!337 = !{!338, !339}
!338 = !DILocalVariable(name: "__c", arg: 1, scope: !334, file: !228, line: 91, type: !33)
!339 = !DILocalVariable(name: "__stream", arg: 2, scope: !334, file: !228, line: 91, type: !256)
!340 = !DILocation(line: 0, scope: !334)
!341 = !DILocation(line: 93, column: 10, scope: !334)
!342 = !DILocation(line: 93, column: 3, scope: !334)
!343 = distinct !DISubprogram(name: "putc_unlocked", scope: !228, file: !228, line: 101, type: !335, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !344)
!344 = !{!345, !346}
!345 = !DILocalVariable(name: "__c", arg: 1, scope: !343, file: !228, line: 101, type: !33)
!346 = !DILocalVariable(name: "__stream", arg: 2, scope: !343, file: !228, line: 101, type: !256)
!347 = !DILocation(line: 0, scope: !343)
!348 = !DILocation(line: 103, column: 10, scope: !343)
!349 = !DILocation(line: 103, column: 3, scope: !343)
!350 = distinct !DISubprogram(name: "putchar_unlocked", scope: !228, file: !228, line: 108, type: !326, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !351)
!351 = !{!352}
!352 = !DILocalVariable(name: "__c", arg: 1, scope: !350, file: !228, line: 108, type: !33)
!353 = !DILocation(line: 0, scope: !350)
!354 = !DILocation(line: 110, column: 10, scope: !350)
!355 = !DILocation(line: 110, column: 3, scope: !350)
!356 = distinct !DISubprogram(name: "getline", scope: !228, file: !228, line: 118, type: !357, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !361)
!357 = !DISubroutineType(types: !358)
!358 = !{!359, !34, !360, !256}
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !61, line: 193, baseType: !283)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!361 = !{!362, !363, !364}
!362 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !356, file: !228, line: 118, type: !34)
!363 = !DILocalVariable(name: "__n", arg: 2, scope: !356, file: !228, line: 118, type: !360)
!364 = !DILocalVariable(name: "__stream", arg: 3, scope: !356, file: !228, line: 118, type: !256)
!365 = !DILocation(line: 0, scope: !356)
!366 = !DILocation(line: 120, column: 10, scope: !356)
!367 = !DILocation(line: 120, column: 3, scope: !356)
!368 = distinct !DISubprogram(name: "feof_unlocked", scope: !228, file: !228, line: 128, type: !254, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !369)
!369 = !{!370}
!370 = !DILocalVariable(name: "__stream", arg: 1, scope: !368, file: !228, line: 128, type: !256)
!371 = !DILocation(line: 0, scope: !368)
!372 = !DILocation(line: 130, column: 10, scope: !368)
!373 = !DILocation(line: 130, column: 3, scope: !368)
!374 = distinct !DISubprogram(name: "ferror_unlocked", scope: !228, file: !228, line: 135, type: !254, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !375)
!375 = !{!376}
!376 = !DILocalVariable(name: "__stream", arg: 1, scope: !374, file: !228, line: 135, type: !256)
!377 = !DILocation(line: 0, scope: !374)
!378 = !DILocation(line: 137, column: 10, scope: !374)
!379 = !DILocation(line: 137, column: 3, scope: !374)
!380 = distinct !DISubprogram(name: "tolower", scope: !381, file: !381, line: 207, type: !326, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !382)
!381 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!382 = !{!383}
!383 = !DILocalVariable(name: "__c", arg: 1, scope: !380, file: !381, line: 207, type: !33)
!384 = !DILocation(line: 0, scope: !380)
!385 = !DILocation(line: 209, column: 22, scope: !380)
!386 = !DILocation(line: 209, column: 39, scope: !380)
!387 = !DILocation(line: 209, column: 38, scope: !380)
!388 = !DILocation(line: 209, column: 37, scope: !380)
!389 = !DILocation(line: 209, column: 10, scope: !380)
!390 = !DILocation(line: 209, column: 3, scope: !380)
!391 = distinct !DISubprogram(name: "toupper", scope: !381, file: !381, line: 213, type: !326, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !392)
!392 = !{!393}
!393 = !DILocalVariable(name: "__c", arg: 1, scope: !391, file: !381, line: 213, type: !33)
!394 = !DILocation(line: 0, scope: !391)
!395 = !DILocation(line: 215, column: 22, scope: !391)
!396 = !DILocation(line: 215, column: 39, scope: !391)
!397 = !DILocation(line: 215, column: 38, scope: !391)
!398 = !DILocation(line: 215, column: 37, scope: !391)
!399 = !DILocation(line: 215, column: 10, scope: !391)
!400 = !DILocation(line: 215, column: 3, scope: !391)
!401 = distinct !DISubprogram(name: "atoi", scope: !402, file: !402, line: 361, type: !403, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !405)
!402 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!403 = !DISubroutineType(types: !404)
!404 = !{!33, !38}
!405 = !{!406}
!406 = !DILocalVariable(name: "__nptr", arg: 1, scope: !401, file: !402, line: 361, type: !38)
!407 = !DILocation(line: 0, scope: !401)
!408 = !DILocation(line: 363, column: 16, scope: !401)
!409 = !DILocation(line: 363, column: 10, scope: !401)
!410 = !DILocation(line: 363, column: 3, scope: !401)
!411 = distinct !DISubprogram(name: "atol", scope: !402, file: !402, line: 366, type: !412, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !414)
!412 = !DISubroutineType(types: !413)
!413 = !{!283, !38}
!414 = !{!415}
!415 = !DILocalVariable(name: "__nptr", arg: 1, scope: !411, file: !402, line: 366, type: !38)
!416 = !DILocation(line: 0, scope: !411)
!417 = !DILocation(line: 368, column: 10, scope: !411)
!418 = !DILocation(line: 368, column: 3, scope: !411)
!419 = distinct !DISubprogram(name: "atoll", scope: !402, file: !402, line: 373, type: !420, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !423)
!420 = !DISubroutineType(types: !421)
!421 = !{!422, !38}
!422 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!423 = !{!424}
!424 = !DILocalVariable(name: "__nptr", arg: 1, scope: !419, file: !402, line: 373, type: !38)
!425 = !DILocation(line: 0, scope: !419)
!426 = !DILocation(line: 375, column: 10, scope: !419)
!427 = !DILocation(line: 375, column: 3, scope: !419)
!428 = distinct !DISubprogram(name: "bsearch", scope: !429, file: !429, line: 20, type: !430, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !438)
!429 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!430 = !DISubroutineType(types: !431)
!431 = !{!37, !432, !432, !141, !141, !434}
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !402, line: 808, baseType: !435)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!33, !432, !432}
!438 = !{!439, !440, !441, !442, !443, !444, !445, !446, !447, !448}
!439 = !DILocalVariable(name: "__key", arg: 1, scope: !428, file: !429, line: 20, type: !432)
!440 = !DILocalVariable(name: "__base", arg: 2, scope: !428, file: !429, line: 20, type: !432)
!441 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !428, file: !429, line: 20, type: !141)
!442 = !DILocalVariable(name: "__size", arg: 4, scope: !428, file: !429, line: 20, type: !141)
!443 = !DILocalVariable(name: "__compar", arg: 5, scope: !428, file: !429, line: 21, type: !434)
!444 = !DILocalVariable(name: "__l", scope: !428, file: !429, line: 23, type: !141)
!445 = !DILocalVariable(name: "__u", scope: !428, file: !429, line: 23, type: !141)
!446 = !DILocalVariable(name: "__idx", scope: !428, file: !429, line: 23, type: !141)
!447 = !DILocalVariable(name: "__p", scope: !428, file: !429, line: 24, type: !432)
!448 = !DILocalVariable(name: "__comparison", scope: !428, file: !429, line: 25, type: !33)
!449 = !DILocation(line: 0, scope: !428)
!450 = !DILocation(line: 29, column: 3, scope: !428)
!451 = !DILocation(line: 27, column: 7, scope: !428)
!452 = !DILocation(line: 29, column: 14, scope: !428)
!453 = !DILocation(line: 31, column: 20, scope: !454)
!454 = distinct !DILexicalBlock(scope: !428, file: !429, line: 30, column: 5)
!455 = !DILocation(line: 31, column: 27, scope: !454)
!456 = !DILocation(line: 32, column: 56, scope: !454)
!457 = !DILocation(line: 32, column: 47, scope: !454)
!458 = !DILocation(line: 33, column: 22, scope: !454)
!459 = !DILocation(line: 34, column: 24, scope: !460)
!460 = distinct !DILexicalBlock(scope: !454, file: !429, line: 34, column: 11)
!461 = !DILocation(line: 34, column: 11, scope: !454)
!462 = !DILocation(line: 36, column: 29, scope: !463)
!463 = distinct !DILexicalBlock(scope: !460, file: !429, line: 36, column: 16)
!464 = !DILocation(line: 36, column: 16, scope: !460)
!465 = !DILocation(line: 37, column: 14, scope: !463)
!466 = distinct !{!466, !450, !467}
!467 = !DILocation(line: 40, column: 5, scope: !428)
!468 = !DILocation(line: 43, column: 1, scope: !428)
!469 = distinct !DISubprogram(name: "atof", scope: !470, file: !470, line: 25, type: !471, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !474)
!470 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!471 = !DISubroutineType(types: !472)
!472 = !{!473, !38}
!473 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!474 = !{!475}
!475 = !DILocalVariable(name: "__nptr", arg: 1, scope: !469, file: !470, line: 25, type: !38)
!476 = !DILocation(line: 0, scope: !469)
!477 = !DILocation(line: 27, column: 10, scope: !469)
!478 = !DILocation(line: 27, column: 3, scope: !469)
!479 = distinct !DISubprogram(name: "strtoimax", scope: !480, file: !480, line: 324, type: !481, scopeLine: 326, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !487)
!480 = !DIFile(filename: "/usr/include/inttypes.h", directory: "")
!481 = !DISubroutineType(types: !482)
!482 = !{!483, !231, !486, !33}
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !484, line: 101, baseType: !485)
!484 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !61, line: 72, baseType: !283)
!486 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !34)
!487 = !{!488, !489, !490}
!488 = !DILocalVariable(name: "nptr", arg: 1, scope: !479, file: !480, line: 324, type: !231)
!489 = !DILocalVariable(name: "endptr", arg: 2, scope: !479, file: !480, line: 324, type: !486)
!490 = !DILocalVariable(name: "base", arg: 3, scope: !479, file: !480, line: 324, type: !33)
!491 = !DILocation(line: 0, scope: !479)
!492 = !DILocation(line: 327, column: 10, scope: !479)
!493 = !DILocation(line: 327, column: 3, scope: !479)
!494 = distinct !DISubprogram(name: "strtoumax", scope: !480, file: !480, line: 336, type: !495, scopeLine: 338, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !499)
!495 = !DISubroutineType(types: !496)
!496 = !{!497, !231, !486, !33}
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !484, line: 102, baseType: !498)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !61, line: 73, baseType: !62)
!499 = !{!500, !501, !502}
!500 = !DILocalVariable(name: "nptr", arg: 1, scope: !494, file: !480, line: 336, type: !231)
!501 = !DILocalVariable(name: "endptr", arg: 2, scope: !494, file: !480, line: 336, type: !486)
!502 = !DILocalVariable(name: "base", arg: 3, scope: !494, file: !480, line: 336, type: !33)
!503 = !DILocation(line: 0, scope: !494)
!504 = !DILocation(line: 339, column: 10, scope: !494)
!505 = !DILocation(line: 339, column: 3, scope: !494)
!506 = distinct !DISubprogram(name: "wcstoimax", scope: !480, file: !480, line: 348, type: !507, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !516)
!507 = !DISubroutineType(types: !508)
!508 = !{!483, !509, !513, !33}
!509 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !510)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !512)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gwchar_t", file: !480, line: 34, baseType: !33)
!513 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !514)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!516 = !{!517, !518, !519}
!517 = !DILocalVariable(name: "nptr", arg: 1, scope: !506, file: !480, line: 348, type: !509)
!518 = !DILocalVariable(name: "endptr", arg: 2, scope: !506, file: !480, line: 348, type: !513)
!519 = !DILocalVariable(name: "base", arg: 3, scope: !506, file: !480, line: 348, type: !33)
!520 = !DILocation(line: 0, scope: !506)
!521 = !DILocation(line: 351, column: 10, scope: !506)
!522 = !DILocation(line: 351, column: 3, scope: !506)
!523 = distinct !DISubprogram(name: "wcstoumax", scope: !480, file: !480, line: 362, type: !524, scopeLine: 364, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !526)
!524 = !DISubroutineType(types: !525)
!525 = !{!497, !509, !513, !33}
!526 = !{!527, !528, !529}
!527 = !DILocalVariable(name: "nptr", arg: 1, scope: !523, file: !480, line: 362, type: !509)
!528 = !DILocalVariable(name: "endptr", arg: 2, scope: !523, file: !480, line: 362, type: !513)
!529 = !DILocalVariable(name: "base", arg: 3, scope: !523, file: !480, line: 362, type: !33)
!530 = !DILocation(line: 0, scope: !523)
!531 = !DILocation(line: 365, column: 10, scope: !523)
!532 = !DILocation(line: 365, column: 3, scope: !523)
!533 = distinct !DISubprogram(name: "stat", scope: !534, file: !534, line: 453, type: !535, scopeLine: 454, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !572)
!534 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "")
!535 = !DISubroutineType(types: !536)
!536 = !{!33, !38, !537}
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !539, line: 46, size: 1152, elements: !540)
!539 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!540 = !{!541, !542, !543, !545, !547, !549, !551, !552, !553, !554, !556, !558, !566, !567, !568}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !538, file: !539, line: 48, baseType: !65, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !538, file: !539, line: 53, baseType: !60, size: 64, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !538, file: !539, line: 61, baseType: !544, size: 64, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !61, line: 151, baseType: !62)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !538, file: !539, line: 62, baseType: !546, size: 32, offset: 192)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !61, line: 150, baseType: !7)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !538, file: !539, line: 64, baseType: !548, size: 32, offset: 224)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !61, line: 146, baseType: !7)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !538, file: !539, line: 65, baseType: !550, size: 32, offset: 256)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !61, line: 147, baseType: !7)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !538, file: !539, line: 67, baseType: !33, size: 32, offset: 288)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !538, file: !539, line: 69, baseType: !65, size: 64, offset: 320)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !538, file: !539, line: 74, baseType: !282, size: 64, offset: 384)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !538, file: !539, line: 78, baseType: !555, size: 64, offset: 448)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !61, line: 174, baseType: !283)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !538, file: !539, line: 80, baseType: !557, size: 64, offset: 512)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !61, line: 179, baseType: !283)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !538, file: !539, line: 91, baseType: !559, size: 128, offset: 576)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !560, line: 10, size: 128, elements: !561)
!560 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!561 = !{!562, !564}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !559, file: !560, line: 12, baseType: !563, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !61, line: 160, baseType: !283)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !559, file: !560, line: 16, baseType: !565, size: 64, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !61, line: 196, baseType: !283)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !538, file: !539, line: 92, baseType: !559, size: 128, offset: 704)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !538, file: !539, line: 93, baseType: !559, size: 128, offset: 832)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !538, file: !539, line: 106, baseType: !569, size: 192, offset: 960)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 192, elements: !570)
!570 = !{!571}
!571 = !DISubrange(count: 3)
!572 = !{!573, !574}
!573 = !DILocalVariable(name: "__path", arg: 1, scope: !533, file: !534, line: 453, type: !38)
!574 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !533, file: !534, line: 453, type: !537)
!575 = !DILocation(line: 0, scope: !533)
!576 = !DILocation(line: 455, column: 10, scope: !533)
!577 = !DILocation(line: 455, column: 3, scope: !533)
!578 = distinct !DISubprogram(name: "lstat", scope: !534, file: !534, line: 460, type: !535, scopeLine: 461, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !579)
!579 = !{!580, !581}
!580 = !DILocalVariable(name: "__path", arg: 1, scope: !578, file: !534, line: 460, type: !38)
!581 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !578, file: !534, line: 460, type: !537)
!582 = !DILocation(line: 0, scope: !578)
!583 = !DILocation(line: 462, column: 10, scope: !578)
!584 = !DILocation(line: 462, column: 3, scope: !578)
!585 = distinct !DISubprogram(name: "fstat", scope: !534, file: !534, line: 467, type: !586, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !588)
!586 = !DISubroutineType(types: !587)
!587 = !{!33, !33, !537}
!588 = !{!589, !590}
!589 = !DILocalVariable(name: "__fd", arg: 1, scope: !585, file: !534, line: 467, type: !33)
!590 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !585, file: !534, line: 467, type: !537)
!591 = !DILocation(line: 0, scope: !585)
!592 = !DILocation(line: 469, column: 10, scope: !585)
!593 = !DILocation(line: 469, column: 3, scope: !585)
!594 = distinct !DISubprogram(name: "fstatat", scope: !534, file: !534, line: 474, type: !595, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !597)
!595 = !DISubroutineType(types: !596)
!596 = !{!33, !33, !38, !537, !33}
!597 = !{!598, !599, !600, !601}
!598 = !DILocalVariable(name: "__fd", arg: 1, scope: !594, file: !534, line: 474, type: !33)
!599 = !DILocalVariable(name: "__filename", arg: 2, scope: !594, file: !534, line: 474, type: !38)
!600 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !594, file: !534, line: 474, type: !537)
!601 = !DILocalVariable(name: "__flag", arg: 4, scope: !594, file: !534, line: 474, type: !33)
!602 = !DILocation(line: 0, scope: !594)
!603 = !DILocation(line: 477, column: 10, scope: !594)
!604 = !DILocation(line: 477, column: 3, scope: !594)
!605 = distinct !DISubprogram(name: "mknod", scope: !534, file: !534, line: 483, type: !606, scopeLine: 484, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !608)
!606 = !DISubroutineType(types: !607)
!607 = !{!33, !38, !546, !65}
!608 = !{!609, !610, !611}
!609 = !DILocalVariable(name: "__path", arg: 1, scope: !605, file: !534, line: 483, type: !38)
!610 = !DILocalVariable(name: "__mode", arg: 2, scope: !605, file: !534, line: 483, type: !546)
!611 = !DILocalVariable(name: "__dev", arg: 3, scope: !605, file: !534, line: 483, type: !65)
!612 = !DILocation(line: 0, scope: !605)
!613 = !DILocation(line: 485, column: 10, scope: !605)
!614 = !DILocation(line: 485, column: 3, scope: !605)
!615 = distinct !DISubprogram(name: "mknodat", scope: !534, file: !534, line: 491, type: !616, scopeLine: 493, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !618)
!616 = !DISubroutineType(types: !617)
!617 = !{!33, !33, !38, !546, !65}
!618 = !{!619, !620, !621, !622}
!619 = !DILocalVariable(name: "__fd", arg: 1, scope: !615, file: !534, line: 491, type: !33)
!620 = !DILocalVariable(name: "__path", arg: 2, scope: !615, file: !534, line: 491, type: !38)
!621 = !DILocalVariable(name: "__mode", arg: 3, scope: !615, file: !534, line: 491, type: !546)
!622 = !DILocalVariable(name: "__dev", arg: 4, scope: !615, file: !534, line: 491, type: !65)
!623 = !DILocation(line: 0, scope: !615)
!624 = !DILocation(line: 494, column: 10, scope: !615)
!625 = !DILocation(line: 494, column: 3, scope: !615)
!626 = distinct !DISubprogram(name: "stat64", scope: !534, file: !534, line: 502, type: !627, scopeLine: 503, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !649)
!627 = !DISubroutineType(types: !628)
!628 = !{!33, !38, !629}
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !539, line: 119, size: 1152, elements: !631)
!631 = !{!632, !633, !635, !636, !637, !638, !639, !640, !641, !642, !643, !645, !646, !647, !648}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !630, file: !539, line: 121, baseType: !65, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !630, file: !539, line: 123, baseType: !634, size: 64, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !61, line: 149, baseType: !62)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !630, file: !539, line: 124, baseType: !544, size: 64, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !630, file: !539, line: 125, baseType: !546, size: 32, offset: 192)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !630, file: !539, line: 132, baseType: !548, size: 32, offset: 224)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !630, file: !539, line: 133, baseType: !550, size: 32, offset: 256)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !630, file: !539, line: 135, baseType: !33, size: 32, offset: 288)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !630, file: !539, line: 136, baseType: !65, size: 64, offset: 320)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !630, file: !539, line: 137, baseType: !282, size: 64, offset: 384)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !630, file: !539, line: 143, baseType: !555, size: 64, offset: 448)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !630, file: !539, line: 144, baseType: !644, size: 64, offset: 512)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !61, line: 180, baseType: !283)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !630, file: !539, line: 152, baseType: !559, size: 128, offset: 576)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !630, file: !539, line: 153, baseType: !559, size: 128, offset: 704)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !630, file: !539, line: 154, baseType: !559, size: 128, offset: 832)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !630, file: !539, line: 164, baseType: !569, size: 192, offset: 960)
!649 = !{!650, !651}
!650 = !DILocalVariable(name: "__path", arg: 1, scope: !626, file: !534, line: 502, type: !38)
!651 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !626, file: !534, line: 502, type: !629)
!652 = !DILocation(line: 0, scope: !626)
!653 = !DILocation(line: 504, column: 10, scope: !626)
!654 = !DILocation(line: 504, column: 3, scope: !626)
!655 = distinct !DISubprogram(name: "lstat64", scope: !534, file: !534, line: 509, type: !627, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !656)
!656 = !{!657, !658}
!657 = !DILocalVariable(name: "__path", arg: 1, scope: !655, file: !534, line: 509, type: !38)
!658 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !655, file: !534, line: 509, type: !629)
!659 = !DILocation(line: 0, scope: !655)
!660 = !DILocation(line: 511, column: 10, scope: !655)
!661 = !DILocation(line: 511, column: 3, scope: !655)
!662 = distinct !DISubprogram(name: "fstat64", scope: !534, file: !534, line: 516, type: !663, scopeLine: 517, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !665)
!663 = !DISubroutineType(types: !664)
!664 = !{!33, !33, !629}
!665 = !{!666, !667}
!666 = !DILocalVariable(name: "__fd", arg: 1, scope: !662, file: !534, line: 516, type: !33)
!667 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !662, file: !534, line: 516, type: !629)
!668 = !DILocation(line: 0, scope: !662)
!669 = !DILocation(line: 518, column: 10, scope: !662)
!670 = !DILocation(line: 518, column: 3, scope: !662)
!671 = distinct !DISubprogram(name: "fstatat64", scope: !534, file: !534, line: 523, type: !672, scopeLine: 525, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !674)
!672 = !DISubroutineType(types: !673)
!673 = !{!33, !33, !38, !629, !33}
!674 = !{!675, !676, !677, !678}
!675 = !DILocalVariable(name: "__fd", arg: 1, scope: !671, file: !534, line: 523, type: !33)
!676 = !DILocalVariable(name: "__filename", arg: 2, scope: !671, file: !534, line: 523, type: !38)
!677 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !671, file: !534, line: 523, type: !629)
!678 = !DILocalVariable(name: "__flag", arg: 4, scope: !671, file: !534, line: 523, type: !33)
!679 = !DILocation(line: 0, scope: !671)
!680 = !DILocation(line: 526, column: 10, scope: !671)
!681 = !DILocation(line: 526, column: 3, scope: !671)
!682 = distinct !DISubprogram(name: "split_quote_chain", scope: !3, file: !3, line: 363, type: !683, scopeLine: 364, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !249)
!683 = !DISubroutineType(types: !684)
!684 = !{null}
!685 = !DILocation(line: 365, column: 18, scope: !682)
!686 = !DILocation(line: 365, column: 16, scope: !682)
!687 = !DILocation(line: 366, column: 18, scope: !682)
!688 = !DILocation(line: 366, column: 16, scope: !682)
!689 = !DILocation(line: 367, column: 18, scope: !682)
!690 = !DILocation(line: 368, column: 18, scope: !682)
!691 = !DILocation(line: 370, column: 28, scope: !682)
!692 = !DILocation(line: 371, column: 1, scope: !682)
!693 = distinct !DISubprogram(name: "add_cpp_dir_path", scope: !3, file: !3, line: 376, type: !694, scopeLine: 377, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !696)
!694 = !DISubroutineType(types: !695)
!695 = !{null, !40, !33}
!696 = !{!697, !698}
!697 = !DILocalVariable(name: "p", arg: 1, scope: !693, file: !3, line: 376, type: !40)
!698 = !DILocalVariable(name: "chain", arg: 2, scope: !693, file: !3, line: 376, type: !33)
!699 = !DILocation(line: 0, scope: !693)
!700 = !DILocation(line: 378, column: 7, scope: !701)
!701 = distinct !DILexicalBlock(scope: !693, file: !3, line: 378, column: 7)
!702 = !DILocation(line: 378, column: 7, scope: !693)
