; ModuleID = 'insn-automata.bc'
source_filename = "insn-automata.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.stat64 = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.rtx_def = type { i32, %union.u }
%union.u = type { %struct.block_symbol }
%struct.block_symbol = type { [3 x %union.rtunion_def], %struct.object_block*, i64 }
%union.rtunion_def = type { i8* }
%struct.object_block = type { %union.section*, i32, i64, %struct.VEC_rtx_gc*, %struct.VEC_rtx_gc* }
%union.section = type { %struct.unnamed_section }
%struct.unnamed_section = type { %struct.section_common, void (i8*)*, i8*, %union.section* }
%struct.section_common = type { i32 }
%struct.VEC_rtx_gc = type { %struct.VEC_rtx_base }

!313 = !DIEnumerator(name: "POSTINCREMENT_EXPR", value: 128, isUnsigned: true)
!314 = !DIEnumerator(name: "VA_ARG_EXPR", value: 129, isUnsigned: true)
!315 = !DIEnumerator(name: "TRY_CATCH_EXPR", value: 130, isUnsigned: true)
!316 = !DIEnumerator(name: "TRY_FINALLY_EXPR", value: 131, isUnsigned: true)
!317 = !DIEnumerator(name: "DECL_EXPR", value: 132, isUnsigned: true)
!318 = !DIEnumerator(name: "LABEL_EXPR", value: 133, isUnsigned: true)
!319 = !DIEnumerator(name: "GOTO_EXPR", value: 134, isUnsigned: true)
!320 = !DIEnumerator(name: "RETURN_EXPR", value: 135, isUnsigned: true)
!321 = !DIEnumerator(name: "EXIT_EXPR", value: 136, isUnsigned: true)
!322 = !DIEnumerator(name: "LOOP_EXPR", value: 137, isUnsigned: true)
!323 = !DIEnumerator(name: "SWITCH_EXPR", value: 138, isUnsigned: true)
!324 = !DIEnumerator(name: "CASE_LABEL_EXPR", value: 139, isUnsigned: true)
!325 = !DIEnumerator(name: "ASM_EXPR", value: 140, isUnsigned: true)
!326 = !DIEnumerator(name: "SSA_NAME", value: 141, isUnsigned: true)
!327 = !DIEnumerator(name: "CATCH_EXPR", value: 142, isUnsigned: true)
!328 = !DIEnumerator(name: "EH_FILTER_EXPR", value: 143, isUnsigned: true)
!329 = !DIEnumerator(name: "SCEV_KNOWN", value: 144, isUnsigned: true)
!330 = !DIEnumerator(name: "SCEV_NOT_KNOWN", value: 145, isUnsigned: true)
!331 = !DIEnumerator(name: "POLYNOMIAL_CHREC", value: 146, isUnsigned: true)
!332 = !DIEnumerator(name: "STATEMENT_LIST", value: 147, isUnsigned: true)
!333 = !DIEnumerator(name: "ASSERT_EXPR", value: 148, isUnsigned: true)
!334 = !DIEnumerator(name: "TREE_BINFO", value: 149, isUnsigned: true)
!335 = !DIEnumerator(name: "WITH_SIZE_EXPR", value: 150, isUnsigned: true)
!336 = !DIEnumerator(name: "REALIGN_LOAD_EXPR", value: 151, isUnsigned: true)
!337 = !DIEnumerator(name: "TARGET_MEM_REF", value: 152, isUnsigned: true)
!338 = !DIEnumerator(name: "OMP_PARALLEL", value: 153, isUnsigned: true)
!339 = !DIEnumerator(name: "OMP_TASK", value: 154, isUnsigned: true)
!340 = !DIEnumerator(name: "OMP_FOR", value: 155, isUnsigned: true)
!341 = !DIEnumerator(name: "OMP_SECTIONS", value: 156, isUnsigned: true)
!342 = !DIEnumerator(name: "OMP_SINGLE", value: 157, isUnsigned: true)
!343 = !DIEnumerator(name: "OMP_SECTION", value: 158, isUnsigned: true)
!344 = !DIEnumerator(name: "OMP_MASTER", value: 159, isUnsigned: true)
!345 = !DIEnumerator(name: "OMP_ORDERED", value: 160, isUnsigned: true)
!346 = !DIEnumerator(name: "OMP_CRITICAL", value: 161, isUnsigned: true)
!347 = !DIEnumerator(name: "OMP_ATOMIC", value: 162, isUnsigned: true)
!348 = !DIEnumerator(name: "OMP_CLAUSE", value: 163, isUnsigned: true)
!349 = !DIEnumerator(name: "REDUC_MAX_EXPR", value: 164, isUnsigned: true)
!350 = !DIEnumerator(name: "REDUC_MIN_EXPR", value: 165, isUnsigned: true)
!351 = !DIEnumerator(name: "REDUC_PLUS_EXPR", value: 166, isUnsigned: true)
!352 = !DIEnumerator(name: "DOT_PROD_EXPR", value: 167, isUnsigned: true)
!353 = !DIEnumerator(name: "WIDEN_SUM_EXPR", value: 168, isUnsigned: true)
!354 = !DIEnumerator(name: "WIDEN_MULT_EXPR", value: 169, isUnsigned: true)
!355 = !DIEnumerator(name: "VEC_LSHIFT_EXPR", value: 170, isUnsigned: true)
!356 = !DIEnumerator(name: "VEC_RSHIFT_EXPR", value: 171, isUnsigned: true)
!357 = !DIEnumerator(name: "VEC_WIDEN_MULT_HI_EXPR", value: 172, isUnsigned: true)
!358 = !DIEnumerator(name: "VEC_WIDEN_MULT_LO_EXPR", value: 173, isUnsigned: true)
!359 = !DIEnumerator(name: "VEC_UNPACK_HI_EXPR", value: 174, isUnsigned: true)
!360 = !DIEnumerator(name: "VEC_UNPACK_LO_EXPR", value: 175, isUnsigned: true)
!361 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_HI_EXPR", value: 176, isUnsigned: true)
!362 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_LO_EXPR", value: 177, isUnsigned: true)
!363 = !DIEnumerator(name: "VEC_PACK_TRUNC_EXPR", value: 178, isUnsigned: true)
!364 = !DIEnumerator(name: "VEC_PACK_SAT_EXPR", value: 179, isUnsigned: true)
!365 = !DIEnumerator(name: "VEC_PACK_FIX_TRUNC_EXPR", value: 180, isUnsigned: true)
!366 = !DIEnumerator(name: "VEC_EXTRACT_EVEN_EXPR", value: 181, isUnsigned: true)
!367 = !DIEnumerator(name: "VEC_EXTRACT_ODD_EXPR", value: 182, isUnsigned: true)
!368 = !DIEnumerator(name: "VEC_INTERLEAVE_HIGH_EXPR", value: 183, isUnsigned: true)
!369 = !DIEnumerator(name: "VEC_INTERLEAVE_LOW_EXPR", value: 184, isUnsigned: true)
!370 = !DIEnumerator(name: "PREDICT_EXPR", value: 185, isUnsigned: true)
!371 = !DIEnumerator(name: "OPTIMIZATION_NODE", value: 186, isUnsigned: true)
!372 = !DIEnumerator(name: "TARGET_OPTION_NODE", value: 187, isUnsigned: true)
!373 = !DIEnumerator(name: "LAST_AND_UNUSED_TREE_CODE", value: 188, isUnsigned: true)
!374 = !DIEnumerator(name: "C_MAYBE_CONST_EXPR", value: 189, isUnsigned: true)
!375 = !DIEnumerator(name: "EXCESS_PRECISION_EXPR", value: 190, isUnsigned: true)
!376 = !DIEnumerator(name: "MAX_TREE_CODES", value: 191, isUnsigned: true)
!377 = !{!378, !379, !380, !381, !384, !385, !387, !411}
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!380 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !383)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DFA_chip", file: !3, line: 9150, size: 192, elements: !389)
!389 = !{!390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !409, !410}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "pentium_automaton_state", scope: !388, file: !3, line: 9152, baseType: !379, size: 8)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "pentium_fpu_automaton_state", scope: !388, file: !3, line: 9153, baseType: !379, size: 8, offset: 8)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ppro_decoder_automaton_state", scope: !388, file: !3, line: 9154, baseType: !379, size: 8, offset: 16)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "ppro_core_automaton_state", scope: !388, file: !3, line: 9155, baseType: !379, size: 8, offset: 24)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "ppro_idiv_automaton_state", scope: !388, file: !3, line: 9156, baseType: !379, size: 8, offset: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "ppro_fdiv_automaton_state", scope: !388, file: !3, line: 9157, baseType: !379, size: 8, offset: 40)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "ppro_load_automaton_state", scope: !388, file: !3, line: 9158, baseType: !379, size: 8, offset: 48)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "ppro_store_automaton_state", scope: !388, file: !3, line: 9159, baseType: !379, size: 8, offset: 56)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "k6_decoder_automaton_state", scope: !388, file: !3, line: 9160, baseType: !379, size: 8, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "k6_load_unit_automaton_state", scope: !388, file: !3, line: 9161, baseType: !379, size: 8, offset: 72)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "k6_store_unit_automaton_state", scope: !388, file: !3, line: 9162, baseType: !379, size: 8, offset: 80)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "k6_integer_units_automaton_state", scope: !388, file: !3, line: 9163, baseType: !379, size: 8, offset: 88)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "k6_fpu_unit_automaton_state", scope: !388, file: !3, line: 9164, baseType: !379, size: 8, offset: 96)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "k6_branch_unit_automaton_state", scope: !388, file: !3, line: 9165, baseType: !379, size: 8, offset: 104)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "athlon_automaton_state", scope: !388, file: !3, line: 9166, baseType: !379, size: 8, offset: 112)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "athlon_load_automaton_state", scope: !388, file: !3, line: 9167, baseType: !379, size: 8, offset: 120)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "athlon_mult_automaton_state", scope: !388, file: !3, line: 9168, baseType: !379, size: 8, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "athlon_fp_automaton_state", scope: !388, file: !3, line: 9169, baseType: !408, size: 16, offset: 144)
!408 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "geode_automaton_state", scope: !388, file: !3, line: 9170, baseType: !408, size: 16, offset: 160)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "atom_automaton_state", scope: !388, file: !3, line: 9171, baseType: !379, size: 8, offset: 176)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!412 = !{!0, !413, !1547, !1549, !1551, !1554, !1557, !1562, !1564, !1569, !1571, !1576, !1578, !1583, !1585, !1591, !1593, !1598, !1600, !1605, !1607, !1612, !1614, !1619, !1621, !1623, !1625, !1630, !1632, !1637, !1639, !1641, !1643, !1648, !1650, !1655, !1657, !1662, !1664, !1669, !1671, !1676, !1678, !1683, !1685, !1690, !1692, !1697, !1699, !1704, !1706, !1711, !1713, !1718, !1720, !1725, !1727, !1732, !1734, !1739, !1744, !1747, !1752, !1755, !1757, !1759, !1761, !1766, !1768, !1773, !1775, !1778, !1780, !1785, !1790, !1795, !1800, !1805, !1810}
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "reservation_names", scope: !415, file: !3, line: 14437, type: !1543, isLocal: true, isDefinition: true)
!415 = distinct !DISubprogram(name: "print_reservation", scope: !3, file: !3, line: 14435, type: !416, scopeLine: 14436, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1539)
!416 = !DISubroutineType(types: !417)
!417 = !{null, !418, !476}
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !420, line: 7, baseType: !421)
!420 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !422, line: 49, size: 1728, elements: !423)
!422 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!423 = !{!424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !439, !441, !442, !443, !447, !448, !450, !454, !457, !459, !462, !465, !466, !467, !471, !472}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !421, file: !422, line: 51, baseType: !380, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !421, file: !422, line: 54, baseType: !382, size: 64, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !421, file: !422, line: 55, baseType: !382, size: 64, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !421, file: !422, line: 56, baseType: !382, size: 64, offset: 192)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !421, file: !422, line: 57, baseType: !382, size: 64, offset: 256)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !421, file: !422, line: 58, baseType: !382, size: 64, offset: 320)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !421, file: !422, line: 59, baseType: !382, size: 64, offset: 384)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !421, file: !422, line: 60, baseType: !382, size: 64, offset: 448)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !421, file: !422, line: 61, baseType: !382, size: 64, offset: 512)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !421, file: !422, line: 64, baseType: !382, size: 64, offset: 576)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !421, file: !422, line: 65, baseType: !382, size: 64, offset: 640)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !421, file: !422, line: 66, baseType: !382, size: 64, offset: 704)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !421, file: !422, line: 68, baseType: !437, size: 64, offset: 768)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !422, line: 36, flags: DIFlagFwdDecl)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !421, file: !422, line: 70, baseType: !440, size: 64, offset: 832)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !421, file: !422, line: 72, baseType: !380, size: 32, offset: 896)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !421, file: !422, line: 73, baseType: !380, size: 32, offset: 928)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !421, file: !422, line: 74, baseType: !444, size: 64, offset: 960)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !445, line: 152, baseType: !446)
!445 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!446 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !421, file: !422, line: 77, baseType: !408, size: 16, offset: 1024)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !421, file: !422, line: 78, baseType: !449, size: 8, offset: 1040)
!449 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !421, file: !422, line: 79, baseType: !451, size: 8, offset: 1048)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !383, size: 8, elements: !452)
!452 = !{!453}
!453 = !DISubrange(count: 1)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !421, file: !422, line: 81, baseType: !455, size: 64, offset: 1088)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !422, line: 43, baseType: null)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !421, file: !422, line: 89, baseType: !458, size: 64, offset: 1152)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !445, line: 153, baseType: !446)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !421, file: !422, line: 91, baseType: !460, size: 64, offset: 1216)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !422, line: 37, flags: DIFlagFwdDecl)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !421, file: !422, line: 92, baseType: !463, size: 64, offset: 1280)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !422, line: 38, flags: DIFlagFwdDecl)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !421, file: !422, line: 93, baseType: !440, size: 64, offset: 1344)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !421, file: !422, line: 94, baseType: !384, size: 64, offset: 1408)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !421, file: !422, line: 95, baseType: !468, size: 64, offset: 1472)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !469, line: 46, baseType: !470)
!469 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!470 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !421, file: !422, line: 96, baseType: !380, size: 32, offset: 1536)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !421, file: !422, line: 98, baseType: !473, size: 160, offset: 1568)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !383, size: 160, elements: !474)
!474 = !{!475}
!475 = !DISubrange(count: 20)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !477, line: 50, baseType: !478)
!477 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !480, line: 240, size: 384, elements: !481)
!480 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!481 = !{!482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !479, file: !480, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !479, file: !480, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !479, file: !480, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !479, file: !480, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !479, file: !480, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !479, file: !480, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !479, file: !480, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !479, file: !480, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !479, file: !480, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !479, file: !480, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !479, file: !480, line: 321, baseType: !493, size: 320, offset: 64)
!493 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !480, line: 315, size: 320, elements: !494)
!494 = !{!495, !1474, !1476, !1537, !1538}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !493, file: !480, line: 316, baseType: !496, size: 64)
!496 = !DICompositeType(tag: DW_TAG_array_type, baseType: !497, size: 64, elements: !452)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !480, line: 183, baseType: !498)
!498 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !480, line: 166, size: 64, elements: !499)
!499 = !{!500, !501, !502, !503, !504, !512, !513, !525, !528, !588, !1452, !1453, !1464, !1471}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !498, file: !480, line: 168, baseType: !380, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !498, file: !480, line: 169, baseType: !7, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !498, file: !480, line: 170, baseType: !385, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !498, file: !480, line: 171, baseType: !476, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !498, file: !480, line: 172, baseType: !505, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !477, line: 53, baseType: !506)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !480, line: 359, size: 128, elements: !508)
!508 = !{!509, !510}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !507, file: !480, line: 360, baseType: !380, size: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !507, file: !480, line: 361, baseType: !511, size: 64, offset: 64)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !476, size: 64, elements: !452)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !498, file: !480, line: 173, baseType: !5, size: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !498, file: !480, line: 174, baseType: !514, size: 32)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !480, line: 133, baseType: !515)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !480, line: 115, size: 32, elements: !516)
!516 = !{!517, !518, !519, !520, !521, !522, !523, !524}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !515, file: !480, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !515, file: !480, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !515, file: !480, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !515, file: !480, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !515, file: !480, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !515, file: !480, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !515, file: !480, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !515, file: !480, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !498, file: !480, line: 175, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !480, line: 175, flags: DIFlagFwdDecl)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !498, file: !480, line: 176, baseType: !529, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !531, line: 75, size: 256, elements: !532)
!531 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!532 = !{!533, !547, !548, !549}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !530, file: !531, line: 76, baseType: !534, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !531, line: 68, baseType: !536)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !531, line: 63, size: 320, elements: !537)
!537 = !{!538, !540, !541, !542}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !536, file: !531, line: 64, baseType: !539, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !536, file: !531, line: 65, baseType: !539, size: 64, offset: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !536, file: !531, line: 66, baseType: !7, size: 32, offset: 128)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !536, file: !531, line: 67, baseType: !543, size: 128, offset: 192)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !544, size: 128, elements: !545)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !531, line: 29, baseType: !470)
!545 = !{!546}
!546 = !DISubrange(count: 2)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !530, file: !531, line: 77, baseType: !534, size: 64, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !530, file: !531, line: 78, baseType: !7, size: 32, offset: 128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !530, file: !531, line: 79, baseType: !550, size: 64, offset: 192)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !531, line: 49, baseType: !552)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !531, line: 45, size: 832, elements: !553)
!553 = !{!554, !555, !556}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !552, file: !531, line: 46, baseType: !539, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !552, file: !531, line: 47, baseType: !529, size: 64, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !552, file: !531, line: 48, baseType: !557, size: 704, offset: 128)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !558, line: 164, size: 704, elements: !559)
!558 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!559 = !{!560, !561, !571, !572, !573, !574, !575, !576, !580, !584, !585, !586, !587}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !557, file: !558, line: 166, baseType: !446, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !557, file: !558, line: 167, baseType: !562, size: 64, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !558, line: 157, size: 192, elements: !564)
!564 = !{!565, !566, !567}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !563, file: !558, line: 159, baseType: !382, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !563, file: !558, line: 160, baseType: !562, size: 64, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !563, file: !558, line: 161, baseType: !568, size: 32, offset: 128)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !383, size: 32, elements: !569)
!569 = !{!570}
!570 = !DISubrange(count: 4)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !557, file: !558, line: 168, baseType: !382, size: 64, offset: 128)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !557, file: !558, line: 169, baseType: !382, size: 64, offset: 192)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !557, file: !558, line: 170, baseType: !382, size: 64, offset: 256)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !557, file: !558, line: 171, baseType: !446, size: 64, offset: 320)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !557, file: !558, line: 172, baseType: !380, size: 32, offset: 384)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !557, file: !558, line: 176, baseType: !577, size: 64, offset: 448)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DISubroutineType(types: !579)
!579 = !{!562, !384, !446}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !557, file: !558, line: 177, baseType: !581, size: 64, offset: 512)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DISubroutineType(types: !583)
!583 = !{null, !384, !562}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !557, file: !558, line: 178, baseType: !384, size: 64, offset: 576)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !557, file: !558, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !557, file: !558, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !557, file: !558, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !498, file: !480, line: 177, baseType: !589, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !477, line: 56, baseType: !590)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !151, line: 3371, size: 1792, elements: !592)
!592 = !{!593, !626, !632, !643, !662, !673, !678, !684, !690, !703, !715, !753, !758, !786, !794, !795, !800, !809, !815, !820, !824, !828, !1077, !1126, !1132, !1139, !1146, !1172, !1197, !1214, !1226, !1248, !1263, !1434}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !591, file: !151, line: 3372, baseType: !594, size: 64)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !151, line: 360, size: 64, elements: !595)
!595 = !{!596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !594, file: !151, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !594, file: !151, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !594, file: !151, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !594, file: !151, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !594, file: !151, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !594, file: !151, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !594, file: !151, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !594, file: !151, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !594, file: !151, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !594, file: !151, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !594, file: !151, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !594, file: !151, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !594, file: !151, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !594, file: !151, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !594, file: !151, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !594, file: !151, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !594, file: !151, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !594, file: !151, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !594, file: !151, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !594, file: !151, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !594, file: !151, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !594, file: !151, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !594, file: !151, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !594, file: !151, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !594, file: !151, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !594, file: !151, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !594, file: !151, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !594, file: !151, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !594, file: !151, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !594, file: !151, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !591, file: !151, line: 3373, baseType: !627, size: 192)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !151, line: 402, size: 192, elements: !628)
!628 = !{!629, !630, !631}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !627, file: !151, line: 403, baseType: !594, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !627, file: !151, line: 404, baseType: !589, size: 64, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !627, file: !151, line: 405, baseType: !589, size: 64, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !591, file: !151, line: 3374, baseType: !633, size: 320)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !151, line: 1384, size: 320, elements: !634)
!634 = !{!635, !636}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !633, file: !151, line: 1385, baseType: !627, size: 192)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !633, file: !151, line: 1386, baseType: !637, size: 128, offset: 192)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !638, line: 58, baseType: !639)
!638 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !638, line: 54, size: 128, elements: !640)
!640 = !{!641, !642}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !639, file: !638, line: 56, baseType: !470, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !639, file: !638, line: 57, baseType: !446, size: 64, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !591, file: !151, line: 3375, baseType: !644, size: 256)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !151, line: 1397, size: 256, elements: !645)
!645 = !{!646, !647}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !644, file: !151, line: 1398, baseType: !627, size: 192)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !644, file: !151, line: 1399, baseType: !648, size: 64, offset: 192)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !650, line: 52, size: 256, elements: !651)
!650 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!651 = !{!652, !653, !654, !655, !656, !657, !658}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !649, file: !650, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !649, file: !650, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !649, file: !650, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !649, file: !650, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !649, file: !650, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !649, file: !650, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !649, file: !650, line: 62, baseType: !659, size: 192, offset: 64)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !470, size: 192, elements: !660)
!660 = !{!661}
!661 = !DISubrange(count: 3)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !591, file: !151, line: 3376, baseType: !663, size: 256)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !151, line: 1408, size: 256, elements: !664)
!664 = !{!665, !666}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !663, file: !151, line: 1409, baseType: !627, size: 192)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !663, file: !151, line: 1410, baseType: !667, size: 64, offset: 192)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !669, line: 27, size: 192, elements: !670)
!669 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!670 = !{!671, !672}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !668, file: !669, line: 29, baseType: !637, size: 128)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !668, file: !669, line: 30, baseType: !5, size: 32, offset: 128)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !591, file: !151, line: 3377, baseType: !674, size: 256)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !151, line: 1437, size: 256, elements: !675)
!675 = !{!676, !677}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !674, file: !151, line: 1438, baseType: !627, size: 192)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !674, file: !151, line: 1439, baseType: !589, size: 64, offset: 192)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !591, file: !151, line: 3378, baseType: !679, size: 256)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !151, line: 1418, size: 256, elements: !680)
!680 = !{!681, !682, !683}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !679, file: !151, line: 1419, baseType: !627, size: 192)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !679, file: !151, line: 1420, baseType: !380, size: 32, offset: 192)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !679, file: !151, line: 1421, baseType: !451, size: 8, offset: 224)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !591, file: !151, line: 3379, baseType: !685, size: 320)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !151, line: 1428, size: 320, elements: !686)
!686 = !{!687, !688, !689}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !685, file: !151, line: 1429, baseType: !627, size: 192)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !685, file: !151, line: 1430, baseType: !589, size: 64, offset: 192)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !685, file: !151, line: 1431, baseType: !589, size: 64, offset: 256)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !591, file: !151, line: 3380, baseType: !691, size: 320)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !151, line: 1460, size: 320, elements: !692)
!692 = !{!693, !694}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !691, file: !151, line: 1461, baseType: !627, size: 192)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !691, file: !151, line: 1462, baseType: !695, size: 128, offset: 192)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !696, line: 31, size: 128, elements: !697)
!696 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!697 = !{!698, !701, !702}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !695, file: !696, line: 32, baseType: !699, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !379)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !695, file: !696, line: 33, baseType: !7, size: 32, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !695, file: !696, line: 34, baseType: !7, size: 32, offset: 96)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !591, file: !151, line: 3381, baseType: !704, size: 384)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !151, line: 2507, size: 384, elements: !705)
!705 = !{!706, !707, !712, !713, !714}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !704, file: !151, line: 2508, baseType: !627, size: 192)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !704, file: !151, line: 2509, baseType: !708, size: 32, offset: 192)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !709, line: 58, baseType: !710)
!709 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !711, line: 44, baseType: !7)
!711 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!712 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !704, file: !151, line: 2510, baseType: !7, size: 32, offset: 224)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !704, file: !151, line: 2511, baseType: !589, size: 64, offset: 256)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !704, file: !151, line: 2512, baseType: !589, size: 64, offset: 320)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !591, file: !151, line: 3382, baseType: !716, size: 896)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !151, line: 2652, size: 896, elements: !717)
!717 = !{!718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !716, file: !151, line: 2653, baseType: !704, size: 384)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !716, file: !151, line: 2654, baseType: !589, size: 64, offset: 384)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !716, file: !151, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !716, file: !151, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !716, file: !151, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !716, file: !151, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !716, file: !151, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !716, file: !151, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !716, file: !151, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !716, file: !151, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !716, file: !151, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !716, file: !151, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !716, file: !151, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !716, file: !151, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !716, file: !151, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !716, file: !151, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !716, file: !151, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !716, file: !151, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !716, file: !151, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !716, file: !151, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !716, file: !151, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !716, file: !151, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !716, file: !151, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !716, file: !151, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !716, file: !151, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !716, file: !151, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !716, file: !151, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !716, file: !151, line: 2703, baseType: !7, size: 32, offset: 512)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !716, file: !151, line: 2705, baseType: !589, size: 64, offset: 576)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !716, file: !151, line: 2706, baseType: !589, size: 64, offset: 640)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !716, file: !151, line: 2707, baseType: !589, size: 64, offset: 704)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !716, file: !151, line: 2708, baseType: !589, size: 64, offset: 768)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !716, file: !151, line: 2711, baseType: !751, size: 64, offset: 832)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !151, line: 2711, flags: DIFlagFwdDecl)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !591, file: !151, line: 3383, baseType: !754, size: 960)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !151, line: 2756, size: 960, elements: !755)
!755 = !{!756, !757}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !754, file: !151, line: 2757, baseType: !716, size: 896)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !754, file: !151, line: 2758, baseType: !476, size: 64, offset: 896)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !591, file: !151, line: 3384, baseType: !759, size: 1472)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !151, line: 3114, size: 1472, elements: !760)
!760 = !{!761, !782, !783, !784, !785}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !759, file: !151, line: 3115, baseType: !762, size: 1216)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !151, line: 2984, size: 1216, elements: !763)
!763 = !{!764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !762, file: !151, line: 2985, baseType: !754, size: 960)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !762, file: !151, line: 2986, baseType: !589, size: 64, offset: 960)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !762, file: !151, line: 2987, baseType: !589, size: 64, offset: 1024)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !762, file: !151, line: 2988, baseType: !589, size: 64, offset: 1088)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !762, file: !151, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !762, file: !151, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !762, file: !151, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !762, file: !151, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !762, file: !151, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !762, file: !151, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !762, file: !151, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !762, file: !151, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !762, file: !151, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !762, file: !151, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !762, file: !151, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !762, file: !151, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !762, file: !151, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !762, file: !151, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !759, file: !151, line: 3117, baseType: !589, size: 64, offset: 1216)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !759, file: !151, line: 3119, baseType: !589, size: 64, offset: 1280)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !759, file: !151, line: 3121, baseType: !589, size: 64, offset: 1344)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !759, file: !151, line: 3123, baseType: !589, size: 64, offset: 1408)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !591, file: !151, line: 3385, baseType: !787, size: 1088)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !151, line: 2874, size: 1088, elements: !788)
!788 = !{!789, !790, !791}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !787, file: !151, line: 2875, baseType: !754, size: 960)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !787, file: !151, line: 2876, baseType: !476, size: 64, offset: 960)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !787, file: !151, line: 2877, baseType: !792, size: 64, offset: 1024)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !151, line: 2856, flags: DIFlagFwdDecl)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !591, file: !151, line: 3386, baseType: !762, size: 1216)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !591, file: !151, line: 3387, baseType: !796, size: 1280)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !151, line: 3093, size: 1280, elements: !797)
!797 = !{!798, !799}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !796, file: !151, line: 3094, baseType: !762, size: 1216)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !796, file: !151, line: 3095, baseType: !792, size: 64, offset: 1216)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !591, file: !151, line: 3388, baseType: !801, size: 1216)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !151, line: 2824, size: 1216, elements: !802)
!802 = !{!803, !804, !805, !806, !807, !808}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !801, file: !151, line: 2825, baseType: !716, size: 896)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !801, file: !151, line: 2827, baseType: !589, size: 64, offset: 896)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !801, file: !151, line: 2828, baseType: !589, size: 64, offset: 960)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !801, file: !151, line: 2829, baseType: !589, size: 64, offset: 1024)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !801, file: !151, line: 2830, baseType: !589, size: 64, offset: 1088)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !801, file: !151, line: 2831, baseType: !589, size: 64, offset: 1152)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !591, file: !151, line: 3389, baseType: !810, size: 1024)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !151, line: 2850, size: 1024, elements: !811)
!811 = !{!812, !813, !814}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !810, file: !151, line: 2851, baseType: !754, size: 960)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !810, file: !151, line: 2852, baseType: !380, size: 32, offset: 960)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !810, file: !151, line: 2853, baseType: !380, size: 32, offset: 992)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !591, file: !151, line: 3390, baseType: !816, size: 1024)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !151, line: 2857, size: 1024, elements: !817)
!817 = !{!818, !819}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !816, file: !151, line: 2858, baseType: !754, size: 960)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !816, file: !151, line: 2859, baseType: !792, size: 64, offset: 960)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !591, file: !151, line: 3391, baseType: !821, size: 960)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !151, line: 2862, size: 960, elements: !822)
!822 = !{!823}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !821, file: !151, line: 2863, baseType: !754, size: 960)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !591, file: !151, line: 3392, baseType: !825, size: 1472)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !151, line: 3304, size: 1472, elements: !826)
!826 = !{!827}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !825, file: !151, line: 3305, baseType: !759, size: 1472)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !591, file: !151, line: 3393, baseType: !829, size: 1792)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !151, line: 3248, size: 1792, elements: !830)
!830 = !{!831, !832, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !829, file: !151, line: 3249, baseType: !759, size: 1472)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !829, file: !151, line: 3251, baseType: !833, size: 64, offset: 1472)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !835, line: 463, size: 1152, elements: !836)
!835 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!836 = !{!837, !840, !944, !945, !948, !951, !1001, !1002, !1003, !1004, !1005, !1029, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !834, file: !835, line: 464, baseType: !838, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !835, line: 464, flags: DIFlagFwdDecl)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !834, file: !835, line: 467, baseType: !841, size: 64, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !135, line: 374, size: 640, elements: !843)
!843 = !{!844, !919, !920, !933, !934, !935, !936, !937, !938, !940, !942, !943}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !842, file: !135, line: 377, baseType: !845, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !477, line: 111, baseType: !846)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !135, line: 217, size: 832, elements: !848)
!848 = !{!849, !884, !885, !886, !889, !893, !894, !895, !913, !914, !915, !916, !917, !918}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !847, file: !135, line: 219, baseType: !850, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !135, line: 151, baseType: !852)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !135, line: 151, size: 128, elements: !853)
!853 = !{!854}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !852, file: !135, line: 151, baseType: !855, size: 128)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !135, line: 150, baseType: !856)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !135, line: 150, size: 128, elements: !857)
!857 = !{!858, !859, !860}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !856, file: !135, line: 150, baseType: !7, size: 32)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !856, file: !135, line: 150, baseType: !7, size: 32, offset: 32)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !856, file: !135, line: 150, baseType: !861, size: 64, offset: 64)
!861 = !DICompositeType(tag: DW_TAG_array_type, baseType: !862, size: 64, elements: !452)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !477, line: 108, baseType: !863)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !135, line: 122, size: 512, elements: !865)
!865 = !{!866, !867, !868, !876, !877, !878, !879, !880, !881, !882}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !864, file: !135, line: 124, baseType: !846, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !864, file: !135, line: 125, baseType: !846, size: 64, offset: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !864, file: !135, line: 131, baseType: !869, size: 64, offset: 128)
!869 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !135, line: 128, size: 64, elements: !870)
!870 = !{!871, !875}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !869, file: !135, line: 129, baseType: !872, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !477, line: 66, baseType: !873)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !477, line: 65, flags: DIFlagFwdDecl)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !869, file: !135, line: 130, baseType: !476, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !864, file: !135, line: 134, baseType: !384, size: 64, offset: 192)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !864, file: !135, line: 137, baseType: !589, size: 64, offset: 256)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !864, file: !135, line: 138, baseType: !708, size: 32, offset: 320)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !864, file: !135, line: 142, baseType: !7, size: 32, offset: 352)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !864, file: !135, line: 144, baseType: !380, size: 32, offset: 384)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !864, file: !135, line: 145, baseType: !380, size: 32, offset: 416)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !864, file: !135, line: 146, baseType: !883, size: 64, offset: 448)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !135, line: 119, baseType: !446)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !847, file: !135, line: 220, baseType: !850, size: 64, offset: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !847, file: !135, line: 223, baseType: !384, size: 64, offset: 128)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !847, file: !135, line: 226, baseType: !887, size: 64, offset: 192)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !135, line: 185, flags: DIFlagFwdDecl)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !847, file: !135, line: 229, baseType: !890, size: 128, offset: 256)
!890 = !DICompositeType(tag: DW_TAG_array_type, baseType: !891, size: 128, elements: !545)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !135, line: 229, flags: DIFlagFwdDecl)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !847, file: !135, line: 232, baseType: !846, size: 64, offset: 384)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !847, file: !135, line: 233, baseType: !846, size: 64, offset: 448)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !847, file: !135, line: 238, baseType: !896, size: 64, offset: 512)
!896 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !135, line: 235, size: 64, elements: !897)
!897 = !{!898, !904}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !896, file: !135, line: 236, baseType: !899, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !135, line: 273, size: 128, elements: !901)
!901 = !{!902, !903}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !900, file: !135, line: 275, baseType: !872, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !900, file: !135, line: 278, baseType: !872, size: 64, offset: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !896, file: !135, line: 237, baseType: !905, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !135, line: 259, size: 320, elements: !907)
!907 = !{!908, !909, !910, !911, !912}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !906, file: !135, line: 261, baseType: !476, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !906, file: !135, line: 262, baseType: !476, size: 64, offset: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !906, file: !135, line: 266, baseType: !476, size: 64, offset: 128)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !906, file: !135, line: 267, baseType: !476, size: 64, offset: 192)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !906, file: !135, line: 270, baseType: !380, size: 32, offset: 256)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !847, file: !135, line: 241, baseType: !883, size: 64, offset: 576)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !847, file: !135, line: 244, baseType: !380, size: 32, offset: 640)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !847, file: !135, line: 247, baseType: !380, size: 32, offset: 672)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !847, file: !135, line: 250, baseType: !380, size: 32, offset: 704)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !847, file: !135, line: 253, baseType: !380, size: 32, offset: 736)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !847, file: !135, line: 256, baseType: !380, size: 32, offset: 768)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !842, file: !135, line: 378, baseType: !845, size: 64, offset: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !842, file: !135, line: 381, baseType: !921, size: 64, offset: 128)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !135, line: 282, baseType: !923)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !135, line: 282, size: 128, elements: !924)
!924 = !{!925}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !923, file: !135, line: 282, baseType: !926, size: 128)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !135, line: 281, baseType: !927)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !135, line: 281, size: 128, elements: !928)
!928 = !{!929, !930, !931}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !927, file: !135, line: 281, baseType: !7, size: 32)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !927, file: !135, line: 281, baseType: !7, size: 32, offset: 32)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !927, file: !135, line: 281, baseType: !932, size: 64, offset: 64)
!932 = !DICompositeType(tag: DW_TAG_array_type, baseType: !845, size: 64, elements: !452)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !842, file: !135, line: 384, baseType: !380, size: 32, offset: 192)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !842, file: !135, line: 387, baseType: !380, size: 32, offset: 224)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !842, file: !135, line: 390, baseType: !380, size: 32, offset: 256)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !842, file: !135, line: 394, baseType: !921, size: 64, offset: 320)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !842, file: !135, line: 396, baseType: !134, size: 32, offset: 384)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !842, file: !135, line: 399, baseType: !939, size: 64, offset: 416)
!939 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 64, elements: !545)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !842, file: !135, line: 402, baseType: !941, size: 64, offset: 480)
!941 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !545)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !842, file: !135, line: 406, baseType: !380, size: 32, offset: 544)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !842, file: !135, line: 409, baseType: !380, size: 32, offset: 576)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !834, file: !835, line: 470, baseType: !873, size: 64, offset: 128)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !834, file: !835, line: 473, baseType: !946, size: 64, offset: 192)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !835, line: 166, flags: DIFlagFwdDecl)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !834, file: !835, line: 476, baseType: !949, size: 64, offset: 256)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !835, line: 476, flags: DIFlagFwdDecl)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !834, file: !835, line: 479, baseType: !952, size: 64, offset: 320)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !953, line: 144, baseType: !954)
!953 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !953, line: 100, size: 896, elements: !956)
!956 = !{!957, !965, !970, !975, !977, !978, !979, !980, !981, !982, !987, !989, !990, !995, !1000}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !955, file: !953, line: 102, baseType: !958, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !953, line: 52, baseType: !959)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DISubroutineType(types: !961)
!961 = !{!962, !963}
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !953, line: 47, baseType: !7)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !955, file: !953, line: 105, baseType: !966, size: 64, offset: 64)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !953, line: 59, baseType: !967)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{!380, !963, !963}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !955, file: !953, line: 108, baseType: !971, size: 64, offset: 128)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !953, line: 63, baseType: !972)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DISubroutineType(types: !974)
!974 = !{null, !384}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !955, file: !953, line: 111, baseType: !976, size: 64, offset: 192)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !955, file: !953, line: 114, baseType: !468, size: 64, offset: 256)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !955, file: !953, line: 117, baseType: !468, size: 64, offset: 320)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !955, file: !953, line: 120, baseType: !468, size: 64, offset: 384)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !955, file: !953, line: 124, baseType: !7, size: 32, offset: 448)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !955, file: !953, line: 128, baseType: !7, size: 32, offset: 480)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !955, file: !953, line: 131, baseType: !983, size: 64, offset: 512)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !953, line: 75, baseType: !984)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!384, !468, !468}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !955, file: !953, line: 132, baseType: !988, size: 64, offset: 576)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !953, line: 78, baseType: !972)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !955, file: !953, line: 135, baseType: !384, size: 64, offset: 640)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !955, file: !953, line: 136, baseType: !991, size: 64, offset: 704)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !953, line: 82, baseType: !992)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DISubroutineType(types: !994)
!994 = !{!384, !384, !468, !468}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !955, file: !953, line: 137, baseType: !996, size: 64, offset: 768)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !953, line: 83, baseType: !997)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DISubroutineType(types: !999)
!999 = !{null, !384, !384}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !955, file: !953, line: 141, baseType: !7, size: 32, offset: 832)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !834, file: !835, line: 484, baseType: !589, size: 64, offset: 384)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !834, file: !835, line: 488, baseType: !589, size: 64, offset: 448)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !834, file: !835, line: 493, baseType: !589, size: 64, offset: 512)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !834, file: !835, line: 496, baseType: !589, size: 64, offset: 576)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !834, file: !835, line: 501, baseType: !1006, size: 64, offset: 640)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !146, line: 2355, size: 576, elements: !1008)
!1008 = !{!1009, !1012, !1013, !1014, !1015, !1017, !1018, !1023, !1024, !1025, !1026, !1027, !1028}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1007, file: !146, line: 2356, baseType: !1010, size: 64)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !146, line: 2356, flags: DIFlagFwdDecl)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1007, file: !146, line: 2357, baseType: !385, size: 64, offset: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1007, file: !146, line: 2358, baseType: !380, size: 32, offset: 128)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1007, file: !146, line: 2359, baseType: !380, size: 32, offset: 160)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1007, file: !146, line: 2360, baseType: !1016, size: 128, offset: 192)
!1016 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 128, elements: !569)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1007, file: !146, line: 2364, baseType: !380, size: 32, offset: 320)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1007, file: !146, line: 2367, baseType: !1019, size: 128, offset: 384)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !146, line: 2349, size: 128, elements: !1020)
!1020 = !{!1021, !1022}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1019, file: !146, line: 2351, baseType: !476, size: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1019, file: !146, line: 2352, baseType: !446, size: 64, offset: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1007, file: !146, line: 2371, baseType: !145, size: 32, offset: 512)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1007, file: !146, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1007, file: !146, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1007, file: !146, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1007, file: !146, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1007, file: !146, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !834, file: !835, line: 504, baseType: !1030, size: 64, offset: 704)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !835, line: 504, flags: DIFlagFwdDecl)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !834, file: !835, line: 507, baseType: !952, size: 64, offset: 768)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !834, file: !835, line: 510, baseType: !380, size: 32, offset: 832)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !834, file: !835, line: 513, baseType: !380, size: 32, offset: 864)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !834, file: !835, line: 516, baseType: !708, size: 32, offset: 896)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !834, file: !835, line: 519, baseType: !708, size: 32, offset: 928)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !834, file: !835, line: 522, baseType: !7, size: 32, offset: 960)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !834, file: !835, line: 523, baseType: !7, size: 32, offset: 992)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !834, file: !835, line: 528, baseType: !385, size: 64, offset: 1024)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !834, file: !835, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !834, file: !835, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !834, file: !835, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !834, file: !835, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !834, file: !835, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !834, file: !835, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !834, file: !835, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !834, file: !835, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !834, file: !835, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !834, file: !835, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !834, file: !835, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !834, file: !835, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !834, file: !835, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !834, file: !835, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !834, file: !835, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !834, file: !835, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !829, file: !151, line: 3254, baseType: !589, size: 64, offset: 1536)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !829, file: !151, line: 3257, baseType: !589, size: 64, offset: 1600)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !829, file: !151, line: 3258, baseType: !589, size: 64, offset: 1664)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !829, file: !151, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !829, file: !151, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !829, file: !151, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !829, file: !151, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !829, file: !151, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !829, file: !151, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !829, file: !151, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !829, file: !151, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !829, file: !151, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !829, file: !151, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !829, file: !151, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !829, file: !151, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !829, file: !151, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !829, file: !151, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !829, file: !151, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !829, file: !151, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !829, file: !151, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !829, file: !151, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !591, file: !151, line: 3394, baseType: !1078, size: 1344)
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !151, line: 2279, size: 1344, elements: !1079)
!1079 = !{!1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1105, !1106, !1107, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1078, file: !151, line: 2280, baseType: !627, size: 192)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1078, file: !151, line: 2281, baseType: !589, size: 64, offset: 192)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1078, file: !151, line: 2282, baseType: !589, size: 64, offset: 256)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1078, file: !151, line: 2283, baseType: !589, size: 64, offset: 320)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1078, file: !151, line: 2284, baseType: !589, size: 64, offset: 384)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1078, file: !151, line: 2285, baseType: !7, size: 32, offset: 448)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1078, file: !151, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1078, file: !151, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1078, file: !151, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1078, file: !151, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1078, file: !151, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1078, file: !151, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1078, file: !151, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1078, file: !151, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1078, file: !151, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1078, file: !151, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1078, file: !151, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1078, file: !151, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1078, file: !151, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1078, file: !151, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1078, file: !151, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1078, file: !151, line: 2305, baseType: !7, size: 32, offset: 512)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1078, file: !151, line: 2306, baseType: !1103, size: 32, offset: 544)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1104, line: 31, baseType: !380)
!1104 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1078, file: !151, line: 2307, baseType: !589, size: 64, offset: 576)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1078, file: !151, line: 2308, baseType: !589, size: 64, offset: 640)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1078, file: !151, line: 2314, baseType: !1108, size: 64, offset: 704)
!1108 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !151, line: 2309, size: 64, elements: !1109)
!1109 = !{!1110, !1111, !1112}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1108, file: !151, line: 2310, baseType: !380, size: 32)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1108, file: !151, line: 2311, baseType: !385, size: 64)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1108, file: !151, line: 2312, baseType: !1113, size: 64)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1114 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !151, line: 2277, flags: DIFlagFwdDecl)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1078, file: !151, line: 2315, baseType: !589, size: 64, offset: 768)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1078, file: !151, line: 2316, baseType: !589, size: 64, offset: 832)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1078, file: !151, line: 2317, baseType: !589, size: 64, offset: 896)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1078, file: !151, line: 2318, baseType: !589, size: 64, offset: 960)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1078, file: !151, line: 2319, baseType: !589, size: 64, offset: 1024)
