; ModuleID = 'insn-preds.bc'
source_filename = "insn-preds.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.rtx_def = type { i32, %union.u }
%union.u = type { %struct.block_symbol }
%struct.block_symbol = type { [3 x %union.rtunion_def], %struct.object_block*, i64 }
%union.rtunion_def = type { i8* }
%struct.object_block = type { %union.section*, i32, i64, %struct.VEC_rtx_gc*, %struct.VEC_rtx_gc* }
%union.section = type { %struct.unnamed_section }
%struct.unnamed_section = type { %struct.section_common, void (i8*)*, i8*, %union.section* }
%struct.section_common = type { i32 }
%struct.VEC_rtx_gc = type { %struct.VEC_rtx_base }
%struct.VEC_rtx_base = type { i32, i32, [1 x %struct.rtx_def*] }

!540 = !DIEnumerator(name: "CONSTRAINT_S", value: 9, isUnsigned: true)
!541 = !DIEnumerator(name: "CONSTRAINT_D", value: 10, isUnsigned: true)
!542 = !DIEnumerator(name: "CONSTRAINT_A", value: 11, isUnsigned: true)
!543 = !DIEnumerator(name: "CONSTRAINT_U", value: 12, isUnsigned: true)
!544 = !DIEnumerator(name: "CONSTRAINT_f", value: 13, isUnsigned: true)
!545 = !DIEnumerator(name: "CONSTRAINT_t", value: 14, isUnsigned: true)
!546 = !DIEnumerator(name: "CONSTRAINT_u", value: 15, isUnsigned: true)
!547 = !DIEnumerator(name: "CONSTRAINT_y", value: 16, isUnsigned: true)
!548 = !DIEnumerator(name: "CONSTRAINT_x", value: 17, isUnsigned: true)
!549 = !DIEnumerator(name: "CONSTRAINT_Yz", value: 18, isUnsigned: true)
!550 = !DIEnumerator(name: "CONSTRAINT_Y2", value: 19, isUnsigned: true)
!551 = !DIEnumerator(name: "CONSTRAINT_Yi", value: 20, isUnsigned: true)
!552 = !DIEnumerator(name: "CONSTRAINT_Ym", value: 21, isUnsigned: true)
!553 = !DIEnumerator(name: "CONSTRAINT_I", value: 22, isUnsigned: true)
!554 = !DIEnumerator(name: "CONSTRAINT_J", value: 23, isUnsigned: true)
!555 = !DIEnumerator(name: "CONSTRAINT_K", value: 24, isUnsigned: true)
!556 = !DIEnumerator(name: "CONSTRAINT_L", value: 25, isUnsigned: true)
!557 = !DIEnumerator(name: "CONSTRAINT_M", value: 26, isUnsigned: true)
!558 = !DIEnumerator(name: "CONSTRAINT_N", value: 27, isUnsigned: true)
!559 = !DIEnumerator(name: "CONSTRAINT_O", value: 28, isUnsigned: true)
!560 = !DIEnumerator(name: "CONSTRAINT_G", value: 29, isUnsigned: true)
!561 = !DIEnumerator(name: "CONSTRAINT_C", value: 30, isUnsigned: true)
!562 = !DIEnumerator(name: "CONSTRAINT_e", value: 31, isUnsigned: true)
!563 = !DIEnumerator(name: "CONSTRAINT_Z", value: 32, isUnsigned: true)
!564 = !DIEnumerator(name: "CONSTRAINT__LIMIT", value: 33, isUnsigned: true)
!565 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "reg_class", file: !144, line: 1188, baseType: !5, size: 32, elements: !566)
!566 = !{!567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594}
!567 = !DIEnumerator(name: "NO_REGS", value: 0, isUnsigned: true)
!568 = !DIEnumerator(name: "AREG", value: 1, isUnsigned: true)
!569 = !DIEnumerator(name: "DREG", value: 2, isUnsigned: true)
!570 = !DIEnumerator(name: "CREG", value: 3, isUnsigned: true)
!571 = !DIEnumerator(name: "BREG", value: 4, isUnsigned: true)
!572 = !DIEnumerator(name: "SIREG", value: 5, isUnsigned: true)
!573 = !DIEnumerator(name: "DIREG", value: 6, isUnsigned: true)
!574 = !DIEnumerator(name: "AD_REGS", value: 7, isUnsigned: true)
!575 = !DIEnumerator(name: "CLOBBERED_REGS", value: 8, isUnsigned: true)
!576 = !DIEnumerator(name: "Q_REGS", value: 9, isUnsigned: true)
!577 = !DIEnumerator(name: "NON_Q_REGS", value: 10, isUnsigned: true)
!578 = !DIEnumerator(name: "INDEX_REGS", value: 11, isUnsigned: true)
!579 = !DIEnumerator(name: "LEGACY_REGS", value: 12, isUnsigned: true)
!580 = !DIEnumerator(name: "GENERAL_REGS", value: 13, isUnsigned: true)
!581 = !DIEnumerator(name: "FP_TOP_REG", value: 14, isUnsigned: true)
!582 = !DIEnumerator(name: "FP_SECOND_REG", value: 15, isUnsigned: true)
!583 = !DIEnumerator(name: "FLOAT_REGS", value: 16, isUnsigned: true)
!584 = !DIEnumerator(name: "SSE_FIRST_REG", value: 17, isUnsigned: true)
!585 = !DIEnumerator(name: "SSE_REGS", value: 18, isUnsigned: true)
!586 = !DIEnumerator(name: "MMX_REGS", value: 19, isUnsigned: true)
!587 = !DIEnumerator(name: "FP_TOP_SSE_REGS", value: 20, isUnsigned: true)
!588 = !DIEnumerator(name: "FP_SECOND_SSE_REGS", value: 21, isUnsigned: true)
!589 = !DIEnumerator(name: "FLOAT_SSE_REGS", value: 22, isUnsigned: true)
!590 = !DIEnumerator(name: "FLOAT_INT_REGS", value: 23, isUnsigned: true)
!591 = !DIEnumerator(name: "INT_SSE_REGS", value: 24, isUnsigned: true)
!592 = !DIEnumerator(name: "FLOAT_INT_SSE_REGS", value: 25, isUnsigned: true)
!593 = !DIEnumerator(name: "ALL_REGS", value: 26, isUnsigned: true)
!594 = !DIEnumerator(name: "LIM_REG_CLASSES", value: 27, isUnsigned: true)
!595 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ix86_address_seg", file: !596, line: 254, baseType: !5, size: 32, elements: !597)
!596 = !DIFile(filename: "./config/i386/i386-protos.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!597 = !{!598, !599, !600}
!598 = !DIEnumerator(name: "SEG_DEFAULT", value: 0, isUnsigned: true)
!599 = !DIEnumerator(name: "SEG_FS", value: 1, isUnsigned: true)
!600 = !DIEnumerator(name: "SEG_GS", value: 2, isUnsigned: true)
!601 = !{!602, !603, !604, !605, !608, !609, !375, !611, !3, !518, !612, !5, !613}
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!604 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !607)
!611 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!612 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !519, line: 50, baseType: !614)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !376, line: 240, size: 384, elements: !616)
!616 = !{!617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !615, file: !376, line: 242, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !615, file: !376, line: 245, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !615, file: !376, line: 252, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !615, file: !376, line: 257, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !615, file: !376, line: 265, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !615, file: !376, line: 277, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !615, file: !376, line: 291, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !615, file: !376, line: 298, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !615, file: !376, line: 305, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !615, file: !376, line: 310, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !615, file: !376, line: 321, baseType: !628, size: 320, offset: 64)
!628 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !376, line: 315, size: 320, elements: !629)
!629 = !{!630, !1615, !1617, !1678, !1679}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !628, file: !376, line: 316, baseType: !631, size: 64)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !632, size: 64, elements: !647)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !376, line: 183, baseType: !633)
!633 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !376, line: 166, size: 64, elements: !634)
!634 = !{!635, !636, !637, !638, !639, !649, !650, !662, !665, !725, !1593, !1594, !1605, !1612}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !633, file: !376, line: 168, baseType: !604, size: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !633, file: !376, line: 169, baseType: !5, size: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !633, file: !376, line: 170, baseType: !609, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !633, file: !376, line: 171, baseType: !613, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !633, file: !376, line: 172, baseType: !640, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !519, line: 53, baseType: !641)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !376, line: 359, size: 128, elements: !643)
!643 = !{!644, !645}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !642, file: !376, line: 360, baseType: !604, size: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !642, file: !376, line: 361, baseType: !646, size: 64, offset: 64)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 64, elements: !647)
!647 = !{!648}
!648 = !DISubrange(count: 1)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !633, file: !376, line: 173, baseType: !3, size: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !633, file: !376, line: 174, baseType: !651, size: 32)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !376, line: 133, baseType: !652)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !376, line: 115, size: 32, elements: !653)
!653 = !{!654, !655, !656, !657, !658, !659, !660, !661}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !652, file: !376, line: 118, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !652, file: !376, line: 120, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !652, file: !376, line: 121, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !652, file: !376, line: 123, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !652, file: !376, line: 125, baseType: !5, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !652, file: !376, line: 127, baseType: !5, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !652, file: !376, line: 130, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !652, file: !376, line: 132, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !633, file: !376, line: 175, baseType: !663, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !376, line: 175, flags: DIFlagFwdDecl)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !633, file: !376, line: 176, baseType: !666, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !668, line: 75, size: 256, elements: !669)
!668 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!669 = !{!670, !684, !685, !686}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !667, file: !668, line: 76, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !668, line: 68, baseType: !673)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !668, line: 63, size: 320, elements: !674)
!674 = !{!675, !677, !678, !679}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !673, file: !668, line: 64, baseType: !676, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !673, file: !668, line: 65, baseType: !676, size: 64, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !673, file: !668, line: 66, baseType: !5, size: 32, offset: 128)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !673, file: !668, line: 67, baseType: !680, size: 128, offset: 192)
!680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !681, size: 128, elements: !682)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !668, line: 29, baseType: !611)
!682 = !{!683}
!683 = !DISubrange(count: 2)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !667, file: !668, line: 77, baseType: !671, size: 64, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !667, file: !668, line: 78, baseType: !5, size: 32, offset: 128)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !667, file: !668, line: 79, baseType: !687, size: 64, offset: 192)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !668, line: 49, baseType: !689)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !668, line: 45, size: 832, elements: !690)
!690 = !{!691, !692, !693}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !689, file: !668, line: 46, baseType: !676, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !689, file: !668, line: 47, baseType: !666, size: 64, offset: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !689, file: !668, line: 48, baseType: !694, size: 704, offset: 128)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !695, line: 164, size: 704, elements: !696)
!695 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!696 = !{!697, !698, !708, !709, !710, !711, !712, !713, !717, !721, !722, !723, !724}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !694, file: !695, line: 166, baseType: !612, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !694, file: !695, line: 167, baseType: !699, size: 64, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !695, line: 157, size: 192, elements: !701)
!701 = !{!702, !703, !704}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !700, file: !695, line: 159, baseType: !606, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !700, file: !695, line: 160, baseType: !699, size: 64, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !700, file: !695, line: 161, baseType: !705, size: 32, offset: 128)
!705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !607, size: 32, elements: !706)
!706 = !{!707}
!707 = !DISubrange(count: 4)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !694, file: !695, line: 168, baseType: !606, size: 64, offset: 128)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !694, file: !695, line: 169, baseType: !606, size: 64, offset: 192)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !694, file: !695, line: 170, baseType: !606, size: 64, offset: 256)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !694, file: !695, line: 171, baseType: !612, size: 64, offset: 320)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !694, file: !695, line: 172, baseType: !604, size: 32, offset: 384)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !694, file: !695, line: 176, baseType: !714, size: 64, offset: 448)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{!699, !608, !612}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !694, file: !695, line: 177, baseType: !718, size: 64, offset: 512)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{null, !608, !699}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !694, file: !695, line: 178, baseType: !608, size: 64, offset: 576)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !694, file: !695, line: 179, baseType: !5, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !694, file: !695, line: 180, baseType: !5, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !694, file: !695, line: 184, baseType: !5, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !633, file: !376, line: 177, baseType: !726, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !519, line: 56, baseType: !727)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !149, line: 3371, size: 1792, elements: !729)
!729 = !{!730, !763, !769, !780, !799, !810, !815, !822, !828, !841, !853, !891, !896, !924, !932, !933, !938, !947, !953, !958, !962, !966, !1217, !1266, !1272, !1279, !1286, !1312, !1337, !1354, !1366, !1388, !1403, !1575}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !728, file: !149, line: 3372, baseType: !731, size: 64)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !149, line: 360, size: 64, elements: !732)
!732 = !{!733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !731, file: !149, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !731, file: !149, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !731, file: !149, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !731, file: !149, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !731, file: !149, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !731, file: !149, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !731, file: !149, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !731, file: !149, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !731, file: !149, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !731, file: !149, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !731, file: !149, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !731, file: !149, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !731, file: !149, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !731, file: !149, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !731, file: !149, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !731, file: !149, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !731, file: !149, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !731, file: !149, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !731, file: !149, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !731, file: !149, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !731, file: !149, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !731, file: !149, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !731, file: !149, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !731, file: !149, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !731, file: !149, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !731, file: !149, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !731, file: !149, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !731, file: !149, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !731, file: !149, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !731, file: !149, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !728, file: !149, line: 3373, baseType: !764, size: 192)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !149, line: 402, size: 192, elements: !765)
!765 = !{!766, !767, !768}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !764, file: !149, line: 403, baseType: !731, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !764, file: !149, line: 404, baseType: !726, size: 64, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !764, file: !149, line: 405, baseType: !726, size: 64, offset: 128)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !728, file: !149, line: 3374, baseType: !770, size: 320)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !149, line: 1384, size: 320, elements: !771)
!771 = !{!772, !773}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !770, file: !149, line: 1385, baseType: !764, size: 192)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !770, file: !149, line: 1386, baseType: !774, size: 128, offset: 192)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !775, line: 58, baseType: !776)
!775 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !775, line: 54, size: 128, elements: !777)
!777 = !{!778, !779}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !776, file: !775, line: 56, baseType: !611, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !776, file: !775, line: 57, baseType: !612, size: 64, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !728, file: !149, line: 3375, baseType: !781, size: 256)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !149, line: 1397, size: 256, elements: !782)
!782 = !{!783, !784}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !781, file: !149, line: 1398, baseType: !764, size: 192)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !781, file: !149, line: 1399, baseType: !785, size: 64, offset: 192)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !787, line: 52, size: 256, elements: !788)
!787 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!788 = !{!789, !790, !791, !792, !793, !794, !795}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !786, file: !787, line: 56, baseType: !5, size: 2, flags: DIFlagBitField, extraData: i64 0)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !786, file: !787, line: 57, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !786, file: !787, line: 58, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !786, file: !787, line: 59, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !786, file: !787, line: 60, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !786, file: !787, line: 61, baseType: !5, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !786, file: !787, line: 62, baseType: !796, size: 192, offset: 64)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !611, size: 192, elements: !797)
!797 = !{!798}
!798 = !DISubrange(count: 3)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !728, file: !149, line: 3376, baseType: !800, size: 256)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !149, line: 1408, size: 256, elements: !801)
!801 = !{!802, !803}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !800, file: !149, line: 1409, baseType: !764, size: 192)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !800, file: !149, line: 1410, baseType: !804, size: 64, offset: 192)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !806, line: 27, size: 192, elements: !807)
!806 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!807 = !{!808, !809}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !805, file: !806, line: 29, baseType: !774, size: 128)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !805, file: !806, line: 30, baseType: !3, size: 32, offset: 128)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !728, file: !149, line: 3377, baseType: !811, size: 256)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !149, line: 1437, size: 256, elements: !812)
!812 = !{!813, !814}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !811, file: !149, line: 1438, baseType: !764, size: 192)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !811, file: !149, line: 1439, baseType: !726, size: 64, offset: 192)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !728, file: !149, line: 3378, baseType: !816, size: 256)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !149, line: 1418, size: 256, elements: !817)
!817 = !{!818, !819, !820}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !816, file: !149, line: 1419, baseType: !764, size: 192)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !816, file: !149, line: 1420, baseType: !604, size: 32, offset: 192)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !816, file: !149, line: 1421, baseType: !821, size: 8, offset: 224)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !607, size: 8, elements: !647)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !728, file: !149, line: 3379, baseType: !823, size: 320)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !149, line: 1428, size: 320, elements: !824)
!824 = !{!825, !826, !827}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !823, file: !149, line: 1429, baseType: !764, size: 192)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !823, file: !149, line: 1430, baseType: !726, size: 64, offset: 192)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !823, file: !149, line: 1431, baseType: !726, size: 64, offset: 256)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !728, file: !149, line: 3380, baseType: !829, size: 320)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !149, line: 1460, size: 320, elements: !830)
!830 = !{!831, !832}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !829, file: !149, line: 1461, baseType: !764, size: 192)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !829, file: !149, line: 1462, baseType: !833, size: 128, offset: 192)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !834, line: 31, size: 128, elements: !835)
!834 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!835 = !{!836, !839, !840}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !833, file: !834, line: 32, baseType: !837, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !603)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !833, file: !834, line: 33, baseType: !5, size: 32, offset: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !833, file: !834, line: 34, baseType: !5, size: 32, offset: 96)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !728, file: !149, line: 3381, baseType: !842, size: 384)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !149, line: 2507, size: 384, elements: !843)
!843 = !{!844, !845, !850, !851, !852}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !842, file: !149, line: 2508, baseType: !764, size: 192)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !842, file: !149, line: 2509, baseType: !846, size: 32, offset: 192)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !847, line: 58, baseType: !848)
!847 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !849, line: 44, baseType: !5)
!849 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!850 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !842, file: !149, line: 2510, baseType: !5, size: 32, offset: 224)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !842, file: !149, line: 2511, baseType: !726, size: 64, offset: 256)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !842, file: !149, line: 2512, baseType: !726, size: 64, offset: 320)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !728, file: !149, line: 3382, baseType: !854, size: 896)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !149, line: 2652, size: 896, elements: !855)
!855 = !{!856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !854, file: !149, line: 2653, baseType: !842, size: 384)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !854, file: !149, line: 2654, baseType: !726, size: 64, offset: 384)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !854, file: !149, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !854, file: !149, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !854, file: !149, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !854, file: !149, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !854, file: !149, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !854, file: !149, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !854, file: !149, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !854, file: !149, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !854, file: !149, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !854, file: !149, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !854, file: !149, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !854, file: !149, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !854, file: !149, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !854, file: !149, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !854, file: !149, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !854, file: !149, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !854, file: !149, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !854, file: !149, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !854, file: !149, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !854, file: !149, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !854, file: !149, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !854, file: !149, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !854, file: !149, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !854, file: !149, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !854, file: !149, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !854, file: !149, line: 2703, baseType: !5, size: 32, offset: 512)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !854, file: !149, line: 2705, baseType: !726, size: 64, offset: 576)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !854, file: !149, line: 2706, baseType: !726, size: 64, offset: 640)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !854, file: !149, line: 2707, baseType: !726, size: 64, offset: 704)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !854, file: !149, line: 2708, baseType: !726, size: 64, offset: 768)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !854, file: !149, line: 2711, baseType: !889, size: 64, offset: 832)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !149, line: 2711, flags: DIFlagFwdDecl)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !728, file: !149, line: 3383, baseType: !892, size: 960)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !149, line: 2756, size: 960, elements: !893)
!893 = !{!894, !895}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !892, file: !149, line: 2757, baseType: !854, size: 896)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !892, file: !149, line: 2758, baseType: !613, size: 64, offset: 896)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !728, file: !149, line: 3384, baseType: !897, size: 1472)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !149, line: 3114, size: 1472, elements: !898)
!898 = !{!899, !920, !921, !922, !923}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !897, file: !149, line: 3115, baseType: !900, size: 1216)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !149, line: 2984, size: 1216, elements: !901)
!901 = !{!902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !900, file: !149, line: 2985, baseType: !892, size: 960)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !900, file: !149, line: 2986, baseType: !726, size: 64, offset: 960)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !900, file: !149, line: 2987, baseType: !726, size: 64, offset: 1024)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !900, file: !149, line: 2988, baseType: !726, size: 64, offset: 1088)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !900, file: !149, line: 2991, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !900, file: !149, line: 2992, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !900, file: !149, line: 2993, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !900, file: !149, line: 2994, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !900, file: !149, line: 2995, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !900, file: !149, line: 2996, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !900, file: !149, line: 2998, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !900, file: !149, line: 3000, baseType: !5, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !900, file: !149, line: 3002, baseType: !5, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !900, file: !149, line: 3003, baseType: !5, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !900, file: !149, line: 3004, baseType: !5, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !900, file: !149, line: 3005, baseType: !5, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !900, file: !149, line: 3007, baseType: !5, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !900, file: !149, line: 3010, baseType: !5, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !897, file: !149, line: 3117, baseType: !726, size: 64, offset: 1216)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !897, file: !149, line: 3119, baseType: !726, size: 64, offset: 1280)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !897, file: !149, line: 3121, baseType: !726, size: 64, offset: 1344)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !897, file: !149, line: 3123, baseType: !726, size: 64, offset: 1408)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !728, file: !149, line: 3385, baseType: !925, size: 1088)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !149, line: 2874, size: 1088, elements: !926)
!926 = !{!927, !928, !929}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !925, file: !149, line: 2875, baseType: !892, size: 960)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !925, file: !149, line: 2876, baseType: !613, size: 64, offset: 960)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !925, file: !149, line: 2877, baseType: !930, size: 64, offset: 1024)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !149, line: 2856, flags: DIFlagFwdDecl)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !728, file: !149, line: 3386, baseType: !900, size: 1216)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !728, file: !149, line: 3387, baseType: !934, size: 1280)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !149, line: 3093, size: 1280, elements: !935)
!935 = !{!936, !937}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !934, file: !149, line: 3094, baseType: !900, size: 1216)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !934, file: !149, line: 3095, baseType: !930, size: 64, offset: 1216)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !728, file: !149, line: 3388, baseType: !939, size: 1216)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !149, line: 2824, size: 1216, elements: !940)
!940 = !{!941, !942, !943, !944, !945, !946}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !939, file: !149, line: 2825, baseType: !854, size: 896)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !939, file: !149, line: 2827, baseType: !726, size: 64, offset: 896)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !939, file: !149, line: 2828, baseType: !726, size: 64, offset: 960)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !939, file: !149, line: 2829, baseType: !726, size: 64, offset: 1024)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !939, file: !149, line: 2830, baseType: !726, size: 64, offset: 1088)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !939, file: !149, line: 2831, baseType: !726, size: 64, offset: 1152)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !728, file: !149, line: 3389, baseType: !948, size: 1024)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !149, line: 2850, size: 1024, elements: !949)
!949 = !{!950, !951, !952}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !948, file: !149, line: 2851, baseType: !892, size: 960)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !948, file: !149, line: 2852, baseType: !604, size: 32, offset: 960)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !948, file: !149, line: 2853, baseType: !604, size: 32, offset: 992)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !728, file: !149, line: 3390, baseType: !954, size: 1024)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !149, line: 2857, size: 1024, elements: !955)
!955 = !{!956, !957}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !954, file: !149, line: 2858, baseType: !892, size: 960)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !954, file: !149, line: 2859, baseType: !930, size: 64, offset: 960)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !728, file: !149, line: 3391, baseType: !959, size: 960)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !149, line: 2862, size: 960, elements: !960)
!960 = !{!961}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !959, file: !149, line: 2863, baseType: !892, size: 960)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !728, file: !149, line: 3392, baseType: !963, size: 1472)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !149, line: 3304, size: 1472, elements: !964)
!964 = !{!965}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !963, file: !149, line: 3305, baseType: !897, size: 1472)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !728, file: !149, line: 3393, baseType: !967, size: 1792)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !149, line: 3248, size: 1792, elements: !968)
!968 = !{!969, !970, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !967, file: !149, line: 3249, baseType: !897, size: 1472)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !967, file: !149, line: 3251, baseType: !971, size: 64, offset: 1472)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !973, line: 463, size: 1152, elements: !974)
!973 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!974 = !{!975, !978, !1082, !1083, !1086, !1089, !1141, !1142, !1143, !1144, !1145, !1169, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !972, file: !973, line: 464, baseType: !976, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !973, line: 464, flags: DIFlagFwdDecl)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !972, file: !973, line: 467, baseType: !979, size: 64, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !133, line: 374, size: 640, elements: !981)
!981 = !{!982, !1057, !1058, !1071, !1072, !1073, !1074, !1075, !1076, !1078, !1080, !1081}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !980, file: !133, line: 377, baseType: !983, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !519, line: 111, baseType: !984)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !133, line: 217, size: 832, elements: !986)
!986 = !{!987, !1022, !1023, !1024, !1027, !1031, !1032, !1033, !1051, !1052, !1053, !1054, !1055, !1056}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !985, file: !133, line: 219, baseType: !988, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !133, line: 151, baseType: !990)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !133, line: 151, size: 128, elements: !991)
!991 = !{!992}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !990, file: !133, line: 151, baseType: !993, size: 128)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !133, line: 150, baseType: !994)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !133, line: 150, size: 128, elements: !995)
!995 = !{!996, !997, !998}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !994, file: !133, line: 150, baseType: !5, size: 32)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !994, file: !133, line: 150, baseType: !5, size: 32, offset: 32)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !994, file: !133, line: 150, baseType: !999, size: 64, offset: 64)
!999 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1000, size: 64, elements: !647)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !519, line: 108, baseType: !1001)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !133, line: 122, size: 512, elements: !1003)
!1003 = !{!1004, !1005, !1006, !1014, !1015, !1016, !1017, !1018, !1019, !1020}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1002, file: !133, line: 124, baseType: !984, size: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1002, file: !133, line: 125, baseType: !984, size: 64, offset: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1002, file: !133, line: 131, baseType: !1007, size: 64, offset: 128)
!1007 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !133, line: 128, size: 64, elements: !1008)
!1008 = !{!1009, !1013}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1007, file: !133, line: 129, baseType: !1010, size: 64)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !519, line: 66, baseType: !1011)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !519, line: 65, flags: DIFlagFwdDecl)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1007, file: !133, line: 130, baseType: !613, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1002, file: !133, line: 134, baseType: !608, size: 64, offset: 192)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1002, file: !133, line: 137, baseType: !726, size: 64, offset: 256)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1002, file: !133, line: 138, baseType: !846, size: 32, offset: 320)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1002, file: !133, line: 142, baseType: !5, size: 32, offset: 352)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1002, file: !133, line: 144, baseType: !604, size: 32, offset: 384)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1002, file: !133, line: 145, baseType: !604, size: 32, offset: 416)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1002, file: !133, line: 146, baseType: !1021, size: 64, offset: 448)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !133, line: 119, baseType: !612)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !985, file: !133, line: 220, baseType: !988, size: 64, offset: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !985, file: !133, line: 223, baseType: !608, size: 64, offset: 128)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !985, file: !133, line: 226, baseType: !1025, size: 64, offset: 192)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !133, line: 185, flags: DIFlagFwdDecl)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !985, file: !133, line: 229, baseType: !1028, size: 128, offset: 256)
!1028 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1029, size: 128, elements: !682)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !133, line: 229, flags: DIFlagFwdDecl)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !985, file: !133, line: 232, baseType: !984, size: 64, offset: 384)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !985, file: !133, line: 233, baseType: !984, size: 64, offset: 448)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !985, file: !133, line: 238, baseType: !1034, size: 64, offset: 512)
!1034 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !133, line: 235, size: 64, elements: !1035)
!1035 = !{!1036, !1042}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1034, file: !133, line: 236, baseType: !1037, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !133, line: 273, size: 128, elements: !1039)
!1039 = !{!1040, !1041}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1038, file: !133, line: 275, baseType: !1010, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1038, file: !133, line: 278, baseType: !1010, size: 64, offset: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1034, file: !133, line: 237, baseType: !1043, size: 64)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !133, line: 259, size: 320, elements: !1045)
!1045 = !{!1046, !1047, !1048, !1049, !1050}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1044, file: !133, line: 261, baseType: !613, size: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1044, file: !133, line: 262, baseType: !613, size: 64, offset: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1044, file: !133, line: 266, baseType: !613, size: 64, offset: 128)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1044, file: !133, line: 267, baseType: !613, size: 64, offset: 192)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1044, file: !133, line: 270, baseType: !604, size: 32, offset: 256)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !985, file: !133, line: 241, baseType: !1021, size: 64, offset: 576)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !985, file: !133, line: 244, baseType: !604, size: 32, offset: 640)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !985, file: !133, line: 247, baseType: !604, size: 32, offset: 672)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !985, file: !133, line: 250, baseType: !604, size: 32, offset: 704)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !985, file: !133, line: 253, baseType: !604, size: 32, offset: 736)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !985, file: !133, line: 256, baseType: !604, size: 32, offset: 768)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !980, file: !133, line: 378, baseType: !983, size: 64, offset: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !980, file: !133, line: 381, baseType: !1059, size: 64, offset: 128)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !133, line: 282, baseType: !1061)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !133, line: 282, size: 128, elements: !1062)
!1062 = !{!1063}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1061, file: !133, line: 282, baseType: !1064, size: 128)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !133, line: 281, baseType: !1065)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !133, line: 281, size: 128, elements: !1066)
!1066 = !{!1067, !1068, !1069}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1065, file: !133, line: 281, baseType: !5, size: 32)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1065, file: !133, line: 281, baseType: !5, size: 32, offset: 32)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1065, file: !133, line: 281, baseType: !1070, size: 64, offset: 64)
!1070 = !DICompositeType(tag: DW_TAG_array_type, baseType: !983, size: 64, elements: !647)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !980, file: !133, line: 384, baseType: !604, size: 32, offset: 192)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !980, file: !133, line: 387, baseType: !604, size: 32, offset: 224)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !980, file: !133, line: 390, baseType: !604, size: 32, offset: 256)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !980, file: !133, line: 394, baseType: !1059, size: 64, offset: 320)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !980, file: !133, line: 396, baseType: !132, size: 32, offset: 384)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !980, file: !133, line: 399, baseType: !1077, size: 64, offset: 416)
!1077 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 64, elements: !682)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !980, file: !133, line: 402, baseType: !1079, size: 64, offset: 480)
!1079 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !682)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !980, file: !133, line: 406, baseType: !604, size: 32, offset: 544)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !980, file: !133, line: 409, baseType: !604, size: 32, offset: 576)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !972, file: !973, line: 470, baseType: !1011, size: 64, offset: 128)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !972, file: !973, line: 473, baseType: !1084, size: 64, offset: 192)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64)
!1085 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !973, line: 166, flags: DIFlagFwdDecl)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !972, file: !973, line: 476, baseType: !1087, size: 64, offset: 256)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !973, line: 476, flags: DIFlagFwdDecl)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !972, file: !973, line: 479, baseType: !1090, size: 64, offset: 320)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1091, line: 144, baseType: !1092)
!1091 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1091, line: 100, size: 896, elements: !1094)
!1094 = !{!1095, !1103, !1108, !1113, !1115, !1118, !1119, !1120, !1121, !1122, !1127, !1129, !1130, !1135, !1140}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1093, file: !1091, line: 102, baseType: !1096, size: 64)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1091, line: 52, baseType: !1097)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = !DISubroutineType(types: !1099)
!1099 = !{!1100, !1101}
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1091, line: 47, baseType: !5)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1093, file: !1091, line: 105, baseType: !1104, size: 64, offset: 64)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1091, line: 59, baseType: !1105)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64)
!1106 = !DISubroutineType(types: !1107)
!1107 = !{!604, !1101, !1101}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1093, file: !1091, line: 108, baseType: !1109, size: 64, offset: 128)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1091, line: 63, baseType: !1110)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{null, !608}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1093, file: !1091, line: 111, baseType: !1114, size: 64, offset: 192)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1093, file: !1091, line: 114, baseType: !1116, size: 64, offset: 256)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1117, line: 46, baseType: !611)
!1117 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1093, file: !1091, line: 117, baseType: !1116, size: 64, offset: 320)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1093, file: !1091, line: 120, baseType: !1116, size: 64, offset: 384)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1093, file: !1091, line: 124, baseType: !5, size: 32, offset: 448)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1093, file: !1091, line: 128, baseType: !5, size: 32, offset: 480)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1093, file: !1091, line: 131, baseType: !1123, size: 64, offset: 512)
!1123 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1091, line: 75, baseType: !1124)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64)
!1125 = !DISubroutineType(types: !1126)
!1126 = !{!608, !1116, !1116}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1093, file: !1091, line: 132, baseType: !1128, size: 64, offset: 576)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1091, line: 78, baseType: !1110)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1093, file: !1091, line: 135, baseType: !608, size: 64, offset: 640)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1093, file: !1091, line: 136, baseType: !1131, size: 64, offset: 704)
!1131 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1091, line: 82, baseType: !1132)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64)
!1133 = !DISubroutineType(types: !1134)
!1134 = !{!608, !608, !1116, !1116}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1093, file: !1091, line: 137, baseType: !1136, size: 64, offset: 768)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1091, line: 83, baseType: !1137)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64)
!1138 = !DISubroutineType(types: !1139)
!1139 = !{null, !608, !608}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1093, file: !1091, line: 141, baseType: !5, size: 32, offset: 832)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !972, file: !973, line: 484, baseType: !726, size: 64, offset: 384)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !972, file: !973, line: 488, baseType: !726, size: 64, offset: 448)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !972, file: !973, line: 493, baseType: !726, size: 64, offset: 512)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !972, file: !973, line: 496, baseType: !726, size: 64, offset: 576)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !972, file: !973, line: 501, baseType: !1146, size: 64, offset: 640)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64)
!1147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !144, line: 2355, size: 576, elements: !1148)
!1148 = !{!1149, !1152, !1153, !1154, !1155, !1157, !1158, !1163, !1164, !1165, !1166, !1167, !1168}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1147, file: !144, line: 2356, baseType: !1150, size: 64)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1151 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !144, line: 2356, flags: DIFlagFwdDecl)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1147, file: !144, line: 2357, baseType: !609, size: 64, offset: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1147, file: !144, line: 2358, baseType: !604, size: 32, offset: 128)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1147, file: !144, line: 2359, baseType: !604, size: 32, offset: 160)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1147, file: !144, line: 2360, baseType: !1156, size: 128, offset: 192)
!1156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !604, size: 128, elements: !706)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1147, file: !144, line: 2364, baseType: !604, size: 32, offset: 320)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1147, file: !144, line: 2367, baseType: !1159, size: 128, offset: 384)
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !144, line: 2349, size: 128, elements: !1160)
!1160 = !{!1161, !1162}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1159, file: !144, line: 2351, baseType: !613, size: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1159, file: !144, line: 2352, baseType: !612, size: 64, offset: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1147, file: !144, line: 2371, baseType: !143, size: 32, offset: 512)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1147, file: !144, line: 2374, baseType: !5, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1147, file: !144, line: 2377, baseType: !5, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1147, file: !144, line: 2381, baseType: !5, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1147, file: !144, line: 2392, baseType: !5, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1147, file: !144, line: 2396, baseType: !5, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !972, file: !973, line: 504, baseType: !1170, size: 64, offset: 704)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64)
!1171 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !973, line: 504, flags: DIFlagFwdDecl)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !972, file: !973, line: 507, baseType: !1090, size: 64, offset: 768)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !972, file: !973, line: 510, baseType: !604, size: 32, offset: 832)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !972, file: !973, line: 513, baseType: !604, size: 32, offset: 864)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !972, file: !973, line: 516, baseType: !846, size: 32, offset: 896)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !972, file: !973, line: 519, baseType: !846, size: 32, offset: 928)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !972, file: !973, line: 522, baseType: !5, size: 32, offset: 960)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !972, file: !973, line: 523, baseType: !5, size: 32, offset: 992)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !972, file: !973, line: 528, baseType: !609, size: 64, offset: 1024)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !972, file: !973, line: 535, baseType: !5, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !972, file: !973, line: 539, baseType: !5, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !972, file: !973, line: 543, baseType: !5, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !972, file: !973, line: 546, baseType: !5, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !972, file: !973, line: 550, baseType: !5, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !972, file: !973, line: 554, baseType: !5, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !972, file: !973, line: 559, baseType: !5, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !972, file: !973, line: 562, baseType: !5, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !972, file: !973, line: 571, baseType: !5, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !972, file: !973, line: 573, baseType: !5, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !972, file: !973, line: 574, baseType: !5, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !972, file: !973, line: 581, baseType: !5, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !972, file: !973, line: 585, baseType: !5, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !972, file: !973, line: 588, baseType: !5, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !972, file: !973, line: 592, baseType: !5, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !972, file: !973, line: 598, baseType: !5, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !967, file: !149, line: 3254, baseType: !726, size: 64, offset: 1536)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !967, file: !149, line: 3257, baseType: !726, size: 64, offset: 1600)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !967, file: !149, line: 3258, baseType: !726, size: 64, offset: 1664)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !967, file: !149, line: 3264, baseType: !5, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !967, file: !149, line: 3265, baseType: !5, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !967, file: !149, line: 3267, baseType: !5, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !967, file: !149, line: 3268, baseType: !5, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !967, file: !149, line: 3269, baseType: !5, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !967, file: !149, line: 3271, baseType: !5, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !967, file: !149, line: 3272, baseType: !5, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !967, file: !149, line: 3273, baseType: !5, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !967, file: !149, line: 3274, baseType: !5, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !967, file: !149, line: 3275, baseType: !5, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !967, file: !149, line: 3276, baseType: !5, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !967, file: !149, line: 3277, baseType: !5, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !967, file: !149, line: 3279, baseType: !5, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !967, file: !149, line: 3280, baseType: !5, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !967, file: !149, line: 3281, baseType: !5, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !967, file: !149, line: 3282, baseType: !5, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !967, file: !149, line: 3283, baseType: !5, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !967, file: !149, line: 3284, baseType: !5, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !728, file: !149, line: 3394, baseType: !1218, size: 1344)
!1218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !149, line: 2279, size: 1344, elements: !1219)
!1219 = !{!1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1245, !1246, !1247, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1218, file: !149, line: 2280, baseType: !764, size: 192)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1218, file: !149, line: 2281, baseType: !726, size: 64, offset: 192)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1218, file: !149, line: 2282, baseType: !726, size: 64, offset: 256)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1218, file: !149, line: 2283, baseType: !726, size: 64, offset: 320)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1218, file: !149, line: 2284, baseType: !726, size: 64, offset: 384)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1218, file: !149, line: 2285, baseType: !5, size: 32, offset: 448)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1218, file: !149, line: 2287, baseType: !5, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1218, file: !149, line: 2288, baseType: !5, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1218, file: !149, line: 2289, baseType: !5, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1218, file: !149, line: 2290, baseType: !5, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1218, file: !149, line: 2291, baseType: !5, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1218, file: !149, line: 2292, baseType: !5, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1218, file: !149, line: 2294, baseType: !5, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1218, file: !149, line: 2296, baseType: !5, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1218, file: !149, line: 2297, baseType: !5, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1218, file: !149, line: 2298, baseType: !5, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1218, file: !149, line: 2299, baseType: !5, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1218, file: !149, line: 2300, baseType: !5, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1218, file: !149, line: 2301, baseType: !5, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1218, file: !149, line: 2302, baseType: !5, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1218, file: !149, line: 2303, baseType: !5, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1218, file: !149, line: 2305, baseType: !5, size: 32, offset: 512)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1218, file: !149, line: 2306, baseType: !1243, size: 32, offset: 544)
!1243 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1244, line: 31, baseType: !604)
!1244 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1218, file: !149, line: 2307, baseType: !726, size: 64, offset: 576)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1218, file: !149, line: 2308, baseType: !726, size: 64, offset: 640)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1218, file: !149, line: 2314, baseType: !1248, size: 64, offset: 704)
!1248 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !149, line: 2309, size: 64, elements: !1249)
!1249 = !{!1250, !1251, !1252}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1248, file: !149, line: 2310, baseType: !604, size: 32)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1248, file: !149, line: 2311, baseType: !609, size: 64)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1248, file: !149, line: 2312, baseType: !1253, size: 64)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64)
!1254 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !149, line: 2277, flags: DIFlagFwdDecl)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1218, file: !149, line: 2315, baseType: !726, size: 64, offset: 768)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1218, file: !149, line: 2316, baseType: !726, size: 64, offset: 832)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1218, file: !149, line: 2317, baseType: !726, size: 64, offset: 896)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1218, file: !149, line: 2318, baseType: !726, size: 64, offset: 960)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1218, file: !149, line: 2319, baseType: !726, size: 64, offset: 1024)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1218, file: !149, line: 2320, baseType: !726, size: 64, offset: 1088)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1218, file: !149, line: 2321, baseType: !726, size: 64, offset: 1152)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1218, file: !149, line: 2322, baseType: !726, size: 64, offset: 1216)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1218, file: !149, line: 2324, baseType: !1264, size: 64, offset: 1280)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64)
!1265 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !149, line: 2324, flags: DIFlagFwdDecl)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !728, file: !149, line: 3395, baseType: !1267, size: 320)
!1267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !149, line: 1469, size: 320, elements: !1268)
!1268 = !{!1269, !1270, !1271}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1267, file: !149, line: 1470, baseType: !764, size: 192)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1267, file: !149, line: 1471, baseType: !726, size: 64, offset: 192)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1267, file: !149, line: 1472, baseType: !726, size: 64, offset: 256)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !728, file: !149, line: 3396, baseType: !1273, size: 320)
!1273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !149, line: 1482, size: 320, elements: !1274)
!1274 = !{!1275, !1276, !1277}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1273, file: !149, line: 1483, baseType: !764, size: 192)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1273, file: !149, line: 1484, baseType: !604, size: 32, offset: 192)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1273, file: !149, line: 1485, baseType: !1278, size: 64, offset: 256)
!1278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !726, size: 64, elements: !647)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !728, file: !149, line: 3397, baseType: !1280, size: 384)
!1280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !149, line: 1829, size: 384, elements: !1281)
!1281 = !{!1282, !1283, !1284, !1285}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1280, file: !149, line: 1830, baseType: !764, size: 192)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1280, file: !149, line: 1831, baseType: !846, size: 32, offset: 192)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1280, file: !149, line: 1832, baseType: !726, size: 64, offset: 256)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1280, file: !149, line: 1835, baseType: !1278, size: 64, offset: 320)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !728, file: !149, line: 3398, baseType: !1287, size: 704)
!1287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !149, line: 1898, size: 704, elements: !1288)
!1288 = !{!1289, !1290, !1291, !1295, !1296, !1299}
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1287, file: !149, line: 1899, baseType: !764, size: 192)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1287, file: !149, line: 1902, baseType: !726, size: 64, offset: 192)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1287, file: !149, line: 1905, baseType: !1292, size: 64, offset: 256)
!1292 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !519, line: 58, baseType: !1293)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64)
!1294 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !519, line: 57, flags: DIFlagFwdDecl)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1287, file: !149, line: 1908, baseType: !5, size: 32, offset: 320)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1287, file: !149, line: 1911, baseType: !1297, size: 64, offset: 384)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64)
!1298 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !149, line: 1876, flags: DIFlagFwdDecl)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1287, file: !149, line: 1914, baseType: !1300, size: 256, offset: 448)
!1300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !149, line: 1883, size: 256, elements: !1301)
!1301 = !{!1302, !1304, !1305, !1310}
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1300, file: !149, line: 1884, baseType: !1303, size: 64)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1300, file: !149, line: 1885, baseType: !1303, size: 64, offset: 64)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1300, file: !149, line: 1891, baseType: !1306, size: 64, offset: 128)
!1306 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1300, file: !149, line: 1891, size: 64, elements: !1307)
!1307 = !{!1308, !1309}
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1306, file: !149, line: 1891, baseType: !1292, size: 64)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1306, file: !149, line: 1891, baseType: !726, size: 64)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1300, file: !149, line: 1892, baseType: !1311, size: 64, offset: 192)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !728, file: !149, line: 3399, baseType: !1313, size: 704)
!1313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !149, line: 2008, size: 704, elements: !1314)
!1314 = !{!1315, !1316, !1317, !1318, !1319, !1320, !1332, !1333, !1334, !1335, !1336}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1313, file: !149, line: 2009, baseType: !764, size: 192)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1313, file: !149, line: 2011, baseType: !5, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !1313, file: !149, line: 2012, baseType: !5, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1313, file: !149, line: 2014, baseType: !846, size: 32, offset: 224)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1313, file: !149, line: 2016, baseType: !726, size: 64, offset: 256)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !1313, file: !149, line: 2017, baseType: !1321, size: 64, offset: 320)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64)
!1322 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !149, line: 183, baseType: !1323)
!1323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !149, line: 183, size: 128, elements: !1324)
!1324 = !{!1325}
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1323, file: !149, line: 183, baseType: !1326, size: 128)
!1326 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !149, line: 182, baseType: !1327)
!1327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !149, line: 182, size: 128, elements: !1328)
!1328 = !{!1329, !1330, !1331}
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1327, file: !149, line: 182, baseType: !5, size: 32)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1327, file: !149, line: 182, baseType: !5, size: 32, offset: 32)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1327, file: !149, line: 182, baseType: !1278, size: 64, offset: 64)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !1313, file: !149, line: 2019, baseType: !726, size: 64, offset: 384)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !1313, file: !149, line: 2020, baseType: !726, size: 64, offset: 448)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1313, file: !149, line: 2021, baseType: !726, size: 64, offset: 512)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !1313, file: !149, line: 2022, baseType: !726, size: 64, offset: 576)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !1313, file: !149, line: 2023, baseType: !726, size: 64, offset: 640)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !728, file: !149, line: 3400, baseType: !1338, size: 832)
!1338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !149, line: 2430, size: 832, elements: !1339)
!1339 = !{!1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349}
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1338, file: !149, line: 2431, baseType: !764, size: 192)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1338, file: !149, line: 2433, baseType: !726, size: 64, offset: 192)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !1338, file: !149, line: 2434, baseType: !726, size: 64, offset: 256)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !1338, file: !149, line: 2435, baseType: !726, size: 64, offset: 320)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !1338, file: !149, line: 2436, baseType: !726, size: 64, offset: 384)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "base_accesses", scope: !1338, file: !149, line: 2437, baseType: !1321, size: 64, offset: 448)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "inheritance", scope: !1338, file: !149, line: 2438, baseType: !726, size: 64, offset: 512)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_subvtt", scope: !1338, file: !149, line: 2440, baseType: !726, size: 64, offset: 576)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_vptr", scope: !1338, file: !149, line: 2441, baseType: !726, size: 64, offset: 640)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "base_binfos", scope: !1338, file: !149, line: 2443, baseType: !1350, size: 128, offset: 704)
!1350 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_none", file: !149, line: 182, baseType: !1351)
!1351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_none", file: !149, line: 182, size: 128, elements: !1352)
!1352 = !{!1353}
