; ModuleID = 'integrate.bc'
source_filename = "integrate.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

!652 = !DIEnumerator(name: "GE", value: 82, isUnsigned: true)
!653 = !DIEnumerator(name: "GT", value: 83, isUnsigned: true)
!654 = !DIEnumerator(name: "LE", value: 84, isUnsigned: true)
!655 = !DIEnumerator(name: "LT", value: 85, isUnsigned: true)
!656 = !DIEnumerator(name: "GEU", value: 86, isUnsigned: true)
!657 = !DIEnumerator(name: "GTU", value: 87, isUnsigned: true)
!658 = !DIEnumerator(name: "LEU", value: 88, isUnsigned: true)
!659 = !DIEnumerator(name: "LTU", value: 89, isUnsigned: true)
!660 = !DIEnumerator(name: "UNORDERED", value: 90, isUnsigned: true)
!661 = !DIEnumerator(name: "ORDERED", value: 91, isUnsigned: true)
!662 = !DIEnumerator(name: "UNEQ", value: 92, isUnsigned: true)
!663 = !DIEnumerator(name: "UNGE", value: 93, isUnsigned: true)
!664 = !DIEnumerator(name: "UNGT", value: 94, isUnsigned: true)
!665 = !DIEnumerator(name: "UNLE", value: 95, isUnsigned: true)
!666 = !DIEnumerator(name: "UNLT", value: 96, isUnsigned: true)
!667 = !DIEnumerator(name: "LTGT", value: 97, isUnsigned: true)
!668 = !DIEnumerator(name: "SIGN_EXTEND", value: 98, isUnsigned: true)
!669 = !DIEnumerator(name: "ZERO_EXTEND", value: 99, isUnsigned: true)
!670 = !DIEnumerator(name: "TRUNCATE", value: 100, isUnsigned: true)
!671 = !DIEnumerator(name: "FLOAT_EXTEND", value: 101, isUnsigned: true)
!672 = !DIEnumerator(name: "FLOAT_TRUNCATE", value: 102, isUnsigned: true)
!673 = !DIEnumerator(name: "FLOAT", value: 103, isUnsigned: true)
!674 = !DIEnumerator(name: "FIX", value: 104, isUnsigned: true)
!675 = !DIEnumerator(name: "UNSIGNED_FLOAT", value: 105, isUnsigned: true)
!676 = !DIEnumerator(name: "UNSIGNED_FIX", value: 106, isUnsigned: true)
!677 = !DIEnumerator(name: "FRACT_CONVERT", value: 107, isUnsigned: true)
!678 = !DIEnumerator(name: "UNSIGNED_FRACT_CONVERT", value: 108, isUnsigned: true)
!679 = !DIEnumerator(name: "SAT_FRACT", value: 109, isUnsigned: true)
!680 = !DIEnumerator(name: "UNSIGNED_SAT_FRACT", value: 110, isUnsigned: true)
!681 = !DIEnumerator(name: "ABS", value: 111, isUnsigned: true)
!682 = !DIEnumerator(name: "SQRT", value: 112, isUnsigned: true)
!683 = !DIEnumerator(name: "BSWAP", value: 113, isUnsigned: true)
!684 = !DIEnumerator(name: "FFS", value: 114, isUnsigned: true)
!685 = !DIEnumerator(name: "CLZ", value: 115, isUnsigned: true)
!686 = !DIEnumerator(name: "CTZ", value: 116, isUnsigned: true)
!687 = !DIEnumerator(name: "POPCOUNT", value: 117, isUnsigned: true)
!688 = !DIEnumerator(name: "PARITY", value: 118, isUnsigned: true)
!689 = !DIEnumerator(name: "SIGN_EXTRACT", value: 119, isUnsigned: true)
!690 = !DIEnumerator(name: "ZERO_EXTRACT", value: 120, isUnsigned: true)
!691 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!692 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!693 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!694 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!695 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!696 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!697 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!698 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!699 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!700 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!701 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!702 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!703 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!704 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!705 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!706 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!707 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!708 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!709 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!710 = !{!711, !712, !713, !714, !717, !718, !720, !190, !895, !1888, !1895, !5, !567, !1901, !1354}
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!713 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !721, line: 56, baseType: !722)
!721 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !158, line: 3371, size: 1792, elements: !724)
!724 = !{!725, !758, !764, !777, !796, !807, !812, !821, !827, !840, !852, !890, !1170, !1198, !1206, !1207, !1212, !1221, !1227, !1232, !1236, !1240, !1526, !1573, !1579, !1585, !1592, !1618, !1632, !1649, !1661, !1683, !1698, !1870}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !723, file: !158, line: 3372, baseType: !726, size: 64)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !158, line: 360, size: 64, elements: !727)
!727 = !{!728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !726, file: !158, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !726, file: !158, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !726, file: !158, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !726, file: !158, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !726, file: !158, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !726, file: !158, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !726, file: !158, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !726, file: !158, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !726, file: !158, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !726, file: !158, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !726, file: !158, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !726, file: !158, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !726, file: !158, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !726, file: !158, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !726, file: !158, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !726, file: !158, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !726, file: !158, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !726, file: !158, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !726, file: !158, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !726, file: !158, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !726, file: !158, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !726, file: !158, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !726, file: !158, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !726, file: !158, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !726, file: !158, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !726, file: !158, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !726, file: !158, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !726, file: !158, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !726, file: !158, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !726, file: !158, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !723, file: !158, line: 3373, baseType: !759, size: 192)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !158, line: 402, size: 192, elements: !760)
!760 = !{!761, !762, !763}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !759, file: !158, line: 403, baseType: !726, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !759, file: !158, line: 404, baseType: !720, size: 64, offset: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !759, file: !158, line: 405, baseType: !720, size: 64, offset: 128)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !723, file: !158, line: 3374, baseType: !765, size: 320)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !158, line: 1384, size: 320, elements: !766)
!766 = !{!767, !768}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !765, file: !158, line: 1385, baseType: !759, size: 192)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !765, file: !158, line: 1386, baseType: !769, size: 128, offset: 192)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !770, line: 58, baseType: !771)
!770 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !770, line: 54, size: 128, elements: !772)
!772 = !{!773, !775}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !771, file: !770, line: 56, baseType: !774, size: 64)
!774 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !771, file: !770, line: 57, baseType: !776, size: 64, offset: 64)
!776 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !723, file: !158, line: 3375, baseType: !778, size: 256)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !158, line: 1397, size: 256, elements: !779)
!779 = !{!780, !781}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !778, file: !158, line: 1398, baseType: !759, size: 192)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !778, file: !158, line: 1399, baseType: !782, size: 64, offset: 192)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !784, line: 52, size: 256, elements: !785)
!784 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!785 = !{!786, !787, !788, !789, !790, !791, !792}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !783, file: !784, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !783, file: !784, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !783, file: !784, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !783, file: !784, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !783, file: !784, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !783, file: !784, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !783, file: !784, line: 62, baseType: !793, size: 192, offset: 64)
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !774, size: 192, elements: !794)
!794 = !{!795}
!795 = !DISubrange(count: 3)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !723, file: !158, line: 3376, baseType: !797, size: 256)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !158, line: 1408, size: 256, elements: !798)
!798 = !{!799, !800}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !797, file: !158, line: 1409, baseType: !759, size: 192)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !797, file: !158, line: 1410, baseType: !801, size: 64, offset: 192)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !803, line: 27, size: 192, elements: !804)
!803 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!804 = !{!805, !806}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !802, file: !803, line: 29, baseType: !769, size: 128)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !802, file: !803, line: 30, baseType: !5, size: 32, offset: 128)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !723, file: !158, line: 3377, baseType: !808, size: 256)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !158, line: 1437, size: 256, elements: !809)
!809 = !{!810, !811}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !808, file: !158, line: 1438, baseType: !759, size: 192)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !808, file: !158, line: 1439, baseType: !720, size: 64, offset: 192)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !723, file: !158, line: 3378, baseType: !813, size: 256)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !158, line: 1418, size: 256, elements: !814)
!814 = !{!815, !816, !817}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !813, file: !158, line: 1419, baseType: !759, size: 192)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !813, file: !158, line: 1420, baseType: !713, size: 32, offset: 192)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !813, file: !158, line: 1421, baseType: !818, size: 8, offset: 224)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !716, size: 8, elements: !819)
!819 = !{!820}
!820 = !DISubrange(count: 1)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !723, file: !158, line: 3379, baseType: !822, size: 320)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !158, line: 1428, size: 320, elements: !823)
!823 = !{!824, !825, !826}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !822, file: !158, line: 1429, baseType: !759, size: 192)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !822, file: !158, line: 1430, baseType: !720, size: 64, offset: 192)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !822, file: !158, line: 1431, baseType: !720, size: 64, offset: 256)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !723, file: !158, line: 3380, baseType: !828, size: 320)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !158, line: 1460, size: 320, elements: !829)
!829 = !{!830, !831}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !828, file: !158, line: 1461, baseType: !759, size: 192)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !828, file: !158, line: 1462, baseType: !832, size: 128, offset: 192)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !833, line: 31, size: 128, elements: !834)
!833 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!834 = !{!835, !838, !839}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !832, file: !833, line: 32, baseType: !836, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !712)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !832, file: !833, line: 33, baseType: !7, size: 32, offset: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !832, file: !833, line: 34, baseType: !7, size: 32, offset: 96)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !723, file: !158, line: 3381, baseType: !841, size: 384)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !158, line: 2507, size: 384, elements: !842)
!842 = !{!843, !844, !849, !850, !851}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !841, file: !158, line: 2508, baseType: !759, size: 192)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !841, file: !158, line: 2509, baseType: !845, size: 32, offset: 192)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !846, line: 58, baseType: !847)
!846 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !848, line: 44, baseType: !7)
!848 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!849 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !841, file: !158, line: 2510, baseType: !7, size: 32, offset: 224)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !841, file: !158, line: 2511, baseType: !720, size: 64, offset: 256)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !841, file: !158, line: 2512, baseType: !720, size: 64, offset: 320)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !723, file: !158, line: 3382, baseType: !853, size: 896)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !158, line: 2652, size: 896, elements: !854)
!854 = !{!855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !853, file: !158, line: 2653, baseType: !841, size: 384)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !853, file: !158, line: 2654, baseType: !720, size: 64, offset: 384)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !853, file: !158, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !853, file: !158, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !853, file: !158, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !853, file: !158, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !853, file: !158, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !853, file: !158, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !853, file: !158, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !853, file: !158, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !853, file: !158, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !853, file: !158, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !853, file: !158, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !853, file: !158, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !853, file: !158, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !853, file: !158, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !853, file: !158, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !853, file: !158, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !853, file: !158, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !853, file: !158, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !853, file: !158, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !853, file: !158, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !853, file: !158, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !853, file: !158, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !853, file: !158, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !853, file: !158, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !853, file: !158, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !853, file: !158, line: 2703, baseType: !7, size: 32, offset: 512)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !853, file: !158, line: 2705, baseType: !720, size: 64, offset: 576)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !853, file: !158, line: 2706, baseType: !720, size: 64, offset: 640)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !853, file: !158, line: 2707, baseType: !720, size: 64, offset: 704)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !853, file: !158, line: 2708, baseType: !720, size: 64, offset: 768)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !853, file: !158, line: 2711, baseType: !888, size: 64, offset: 832)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !158, line: 2711, flags: DIFlagFwdDecl)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !723, file: !158, line: 3383, baseType: !891, size: 960)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !158, line: 2756, size: 960, elements: !892)
!892 = !{!893, !894}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !891, file: !158, line: 2757, baseType: !853, size: 896)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !891, file: !158, line: 2758, baseType: !895, size: 64, offset: 896)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !721, line: 50, baseType: !896)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !568, line: 240, size: 384, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !897, file: !568, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !897, file: !568, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !897, file: !568, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !897, file: !568, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !897, file: !568, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !897, file: !568, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !897, file: !568, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !897, file: !568, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !897, file: !568, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !897, file: !568, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !897, file: !568, line: 321, baseType: !910, size: 320, offset: 64)
!910 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !568, line: 315, size: 320, elements: !911)
!911 = !{!912, !1103, !1105, !1168, !1169}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !910, file: !568, line: 316, baseType: !913, size: 64)
!913 = !DICompositeType(tag: DW_TAG_array_type, baseType: !914, size: 64, elements: !819)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !568, line: 183, baseType: !915)
!915 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !568, line: 166, size: 64, elements: !916)
!916 = !{!917, !918, !919, !920, !921, !929, !930, !942, !945, !1005, !1006, !1080, !1093, !1100}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !915, file: !568, line: 168, baseType: !713, size: 32)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !915, file: !568, line: 169, baseType: !7, size: 32)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !915, file: !568, line: 170, baseType: !718, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !915, file: !568, line: 171, baseType: !895, size: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !915, file: !568, line: 172, baseType: !922, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !721, line: 53, baseType: !923)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !568, line: 359, size: 128, elements: !925)
!925 = !{!926, !927}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !924, file: !568, line: 360, baseType: !713, size: 32)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !924, file: !568, line: 361, baseType: !928, size: 64, offset: 64)
!928 = !DICompositeType(tag: DW_TAG_array_type, baseType: !895, size: 64, elements: !819)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !915, file: !568, line: 173, baseType: !5, size: 32)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !915, file: !568, line: 174, baseType: !931, size: 32)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !568, line: 133, baseType: !932)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !568, line: 115, size: 32, elements: !933)
!933 = !{!934, !935, !936, !937, !938, !939, !940, !941}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !932, file: !568, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !932, file: !568, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !932, file: !568, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !932, file: !568, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !932, file: !568, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !932, file: !568, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !932, file: !568, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !932, file: !568, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !915, file: !568, line: 175, baseType: !943, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !568, line: 175, flags: DIFlagFwdDecl)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !915, file: !568, line: 176, baseType: !946, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !948, line: 75, size: 256, elements: !949)
!948 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!949 = !{!950, !964, !965, !966}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !947, file: !948, line: 76, baseType: !951, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !948, line: 68, baseType: !953)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !948, line: 63, size: 320, elements: !954)
!954 = !{!955, !957, !958, !959}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !953, file: !948, line: 64, baseType: !956, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !953, file: !948, line: 65, baseType: !956, size: 64, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !953, file: !948, line: 66, baseType: !7, size: 32, offset: 128)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !953, file: !948, line: 67, baseType: !960, size: 128, offset: 192)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !961, size: 128, elements: !962)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !948, line: 29, baseType: !774)
!962 = !{!963}
!963 = !DISubrange(count: 2)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !947, file: !948, line: 77, baseType: !951, size: 64, offset: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !947, file: !948, line: 78, baseType: !7, size: 32, offset: 128)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !947, file: !948, line: 79, baseType: !967, size: 64, offset: 192)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !948, line: 49, baseType: !969)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !948, line: 45, size: 832, elements: !970)
!970 = !{!971, !972, !973}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !969, file: !948, line: 46, baseType: !956, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !969, file: !948, line: 47, baseType: !946, size: 64, offset: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !969, file: !948, line: 48, baseType: !974, size: 704, offset: 128)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !975, line: 164, size: 704, elements: !976)
!975 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!976 = !{!977, !978, !988, !989, !990, !991, !992, !993, !997, !1001, !1002, !1003, !1004}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !974, file: !975, line: 166, baseType: !776, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !974, file: !975, line: 167, baseType: !979, size: 64, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !975, line: 157, size: 192, elements: !981)
!981 = !{!982, !983, !984}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !980, file: !975, line: 159, baseType: !715, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !980, file: !975, line: 160, baseType: !979, size: 64, offset: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !980, file: !975, line: 161, baseType: !985, size: 32, offset: 128)
!985 = !DICompositeType(tag: DW_TAG_array_type, baseType: !716, size: 32, elements: !986)
!986 = !{!987}
!987 = !DISubrange(count: 4)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !974, file: !975, line: 168, baseType: !715, size: 64, offset: 128)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !974, file: !975, line: 169, baseType: !715, size: 64, offset: 192)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !974, file: !975, line: 170, baseType: !715, size: 64, offset: 256)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !974, file: !975, line: 171, baseType: !776, size: 64, offset: 320)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !974, file: !975, line: 172, baseType: !713, size: 32, offset: 384)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !974, file: !975, line: 176, baseType: !994, size: 64, offset: 448)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DISubroutineType(types: !996)
!996 = !{!979, !717, !776}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !974, file: !975, line: 177, baseType: !998, size: 64, offset: 512)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DISubroutineType(types: !1000)
!1000 = !{null, !717, !979}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !974, file: !975, line: 178, baseType: !717, size: 64, offset: 576)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !974, file: !975, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !974, file: !975, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !974, file: !975, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !915, file: !568, line: 177, baseType: !720, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !915, file: !568, line: 178, baseType: !1007, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !142, line: 217, size: 832, elements: !1009)
!1009 = !{!1010, !1045, !1046, !1047, !1050, !1054, !1055, !1056, !1074, !1075, !1076, !1077, !1078, !1079}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1008, file: !142, line: 219, baseType: !1011, size: 64)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !142, line: 151, baseType: !1013)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !142, line: 151, size: 128, elements: !1014)
!1014 = !{!1015}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1013, file: !142, line: 151, baseType: !1016, size: 128)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !142, line: 150, baseType: !1017)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !142, line: 150, size: 128, elements: !1018)
!1018 = !{!1019, !1020, !1021}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1017, file: !142, line: 150, baseType: !7, size: 32)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1017, file: !142, line: 150, baseType: !7, size: 32, offset: 32)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1017, file: !142, line: 150, baseType: !1022, size: 64, offset: 64)
!1022 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1023, size: 64, elements: !819)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !721, line: 108, baseType: !1024)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !142, line: 122, size: 512, elements: !1026)
!1026 = !{!1027, !1028, !1029, !1037, !1038, !1039, !1040, !1041, !1042, !1043}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1025, file: !142, line: 124, baseType: !1007, size: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1025, file: !142, line: 125, baseType: !1007, size: 64, offset: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1025, file: !142, line: 131, baseType: !1030, size: 64, offset: 128)
!1030 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !142, line: 128, size: 64, elements: !1031)
!1031 = !{!1032, !1036}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1030, file: !142, line: 129, baseType: !1033, size: 64)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !721, line: 66, baseType: !1034)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !721, line: 65, flags: DIFlagFwdDecl)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1030, file: !142, line: 130, baseType: !895, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1025, file: !142, line: 134, baseType: !717, size: 64, offset: 192)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1025, file: !142, line: 137, baseType: !720, size: 64, offset: 256)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1025, file: !142, line: 138, baseType: !845, size: 32, offset: 320)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1025, file: !142, line: 142, baseType: !7, size: 32, offset: 352)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1025, file: !142, line: 144, baseType: !713, size: 32, offset: 384)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1025, file: !142, line: 145, baseType: !713, size: 32, offset: 416)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1025, file: !142, line: 146, baseType: !1044, size: 64, offset: 448)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !142, line: 119, baseType: !776)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1008, file: !142, line: 220, baseType: !1011, size: 64, offset: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1008, file: !142, line: 223, baseType: !717, size: 64, offset: 128)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1008, file: !142, line: 226, baseType: !1048, size: 64, offset: 192)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !142, line: 185, flags: DIFlagFwdDecl)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1008, file: !142, line: 229, baseType: !1051, size: 128, offset: 256)
!1051 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1052, size: 128, elements: !962)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !142, line: 229, flags: DIFlagFwdDecl)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1008, file: !142, line: 232, baseType: !1007, size: 64, offset: 384)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1008, file: !142, line: 233, baseType: !1007, size: 64, offset: 448)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1008, file: !142, line: 238, baseType: !1057, size: 64, offset: 512)
!1057 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !142, line: 235, size: 64, elements: !1058)
!1058 = !{!1059, !1065}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1057, file: !142, line: 236, baseType: !1060, size: 64)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !142, line: 273, size: 128, elements: !1062)
!1062 = !{!1063, !1064}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1061, file: !142, line: 275, baseType: !1033, size: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1061, file: !142, line: 278, baseType: !1033, size: 64, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1057, file: !142, line: 237, baseType: !1066, size: 64)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !142, line: 259, size: 320, elements: !1068)
!1068 = !{!1069, !1070, !1071, !1072, !1073}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1067, file: !142, line: 261, baseType: !895, size: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1067, file: !142, line: 262, baseType: !895, size: 64, offset: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1067, file: !142, line: 266, baseType: !895, size: 64, offset: 128)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1067, file: !142, line: 267, baseType: !895, size: 64, offset: 192)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1067, file: !142, line: 270, baseType: !713, size: 32, offset: 256)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1008, file: !142, line: 241, baseType: !1044, size: 64, offset: 576)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1008, file: !142, line: 244, baseType: !713, size: 32, offset: 640)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1008, file: !142, line: 247, baseType: !713, size: 32, offset: 672)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1008, file: !142, line: 250, baseType: !713, size: 32, offset: 704)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1008, file: !142, line: 253, baseType: !713, size: 32, offset: 736)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1008, file: !142, line: 256, baseType: !713, size: 32, offset: 768)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !915, file: !568, line: 179, baseType: !1081, size: 64)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !568, line: 150, baseType: !1083)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !568, line: 142, size: 320, elements: !1084)
!1084 = !{!1085, !1086, !1087, !1088, !1091, !1092}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1083, file: !568, line: 144, baseType: !720, size: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1083, file: !568, line: 145, baseType: !895, size: 64, offset: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1083, file: !568, line: 146, baseType: !895, size: 64, offset: 128)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1083, file: !568, line: 147, baseType: !1089, size: 32, offset: 192)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1090, line: 31, baseType: !713)
!1090 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1083, file: !568, line: 148, baseType: !7, size: 32, offset: 224)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1083, file: !568, line: 149, baseType: !712, size: 8, offset: 256)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !915, file: !568, line: 180, baseType: !1094, size: 64)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !568, line: 162, baseType: !1096)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !568, line: 159, size: 128, elements: !1097)
!1097 = !{!1098, !1099}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1096, file: !568, line: 160, baseType: !720, size: 64)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1096, file: !568, line: 161, baseType: !776, size: 64, offset: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !915, file: !568, line: 181, baseType: !1101, size: 64)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1102 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !568, line: 181, flags: DIFlagFwdDecl)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !910, file: !568, line: 317, baseType: !1104, size: 64)
!1104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !776, size: 64, elements: !819)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !910, file: !568, line: 318, baseType: !1106, size: 320)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !568, line: 188, size: 320, elements: !1107)
!1107 = !{!1108, !1110, !1167}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1106, file: !568, line: 190, baseType: !1109, size: 192)
!1109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !914, size: 192, elements: !794)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1106, file: !568, line: 193, baseType: !1111, size: 64, offset: 192)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !568, line: 206, size: 320, elements: !1113)
!1113 = !{!1114, !1152, !1153, !1154, !1166}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1112, file: !568, line: 208, baseType: !1115, size: 64)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !721, line: 62, baseType: !1117)
!1117 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1118, line: 538, size: 256, elements: !1119)
!1118 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1119 = !{!1120, !1124, !1130, !1143}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1117, file: !1118, line: 539, baseType: !1121, size: 32)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1118, line: 482, size: 32, elements: !1122)
!1122 = !{!1123}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1121, file: !1118, line: 484, baseType: !7, size: 32)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1117, file: !1118, line: 540, baseType: !1125, size: 192)
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1118, line: 488, size: 192, elements: !1126)
!1126 = !{!1127, !1128, !1129}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1125, file: !1118, line: 489, baseType: !1121, size: 32)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1125, file: !1118, line: 492, baseType: !718, size: 64, offset: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1125, file: !1118, line: 496, baseType: !720, size: 64, offset: 128)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1117, file: !1118, line: 541, baseType: !1131, size: 256)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1118, line: 504, size: 256, elements: !1132)
!1132 = !{!1133, !1134, !1141, !1142}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1131, file: !1118, line: 505, baseType: !1121, size: 32)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1131, file: !1118, line: 509, baseType: !1135, size: 64, offset: 64)
!1135 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1118, line: 501, baseType: !1136)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1137 = !DISubroutineType(types: !1138)
!1138 = !{null, !1139}
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64)
!1140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1131, file: !1118, line: 510, baseType: !1139, size: 64, offset: 128)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1131, file: !1118, line: 513, baseType: !1115, size: 64, offset: 192)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1117, file: !1118, line: 542, baseType: !1144, size: 128)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1118, line: 530, size: 128, elements: !1145)
!1145 = !{!1146, !1147}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1144, file: !1118, line: 531, baseType: !1121, size: 32)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1144, file: !1118, line: 534, baseType: !1148, size: 64, offset: 64)
!1148 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1118, line: 525, baseType: !1149)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64)
!1150 = !DISubroutineType(types: !1151)
!1151 = !{!712, !720, !718, !774, !774}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1112, file: !568, line: 211, baseType: !7, size: 32, offset: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1112, file: !568, line: 214, baseType: !776, size: 64, offset: 128)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1112, file: !568, line: 224, baseType: !1155, size: 64, offset: 192)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !568, line: 202, baseType: !1157)
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !568, line: 202, size: 128, elements: !1158)
!1158 = !{!1159}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1157, file: !568, line: 202, baseType: !1160, size: 128)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !568, line: 200, baseType: !1161)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !568, line: 200, size: 128, elements: !1162)
!1162 = !{!1163, !1164, !1165}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1161, file: !568, line: 200, baseType: !7, size: 32)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1161, file: !568, line: 200, baseType: !7, size: 32, offset: 32)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1161, file: !568, line: 200, baseType: !928, size: 64, offset: 64)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1112, file: !568, line: 234, baseType: !1155, size: 64, offset: 256)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1106, file: !568, line: 197, baseType: !776, size: 64, offset: 256)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !910, file: !568, line: 319, baseType: !783, size: 256)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !910, file: !568, line: 320, baseType: !802, size: 192)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !723, file: !158, line: 3384, baseType: !1171, size: 1472)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !158, line: 3114, size: 1472, elements: !1172)
!1172 = !{!1173, !1194, !1195, !1196, !1197}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1171, file: !158, line: 3115, baseType: !1174, size: 1216)
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !158, line: 2984, size: 1216, elements: !1175)
!1175 = !{!1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1174, file: !158, line: 2985, baseType: !891, size: 960)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1174, file: !158, line: 2986, baseType: !720, size: 64, offset: 960)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1174, file: !158, line: 2987, baseType: !720, size: 64, offset: 1024)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1174, file: !158, line: 2988, baseType: !720, size: 64, offset: 1088)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1174, file: !158, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1174, file: !158, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1174, file: !158, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1174, file: !158, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1174, file: !158, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1174, file: !158, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1174, file: !158, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1174, file: !158, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1174, file: !158, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1174, file: !158, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1174, file: !158, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1174, file: !158, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1174, file: !158, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1174, file: !158, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1171, file: !158, line: 3117, baseType: !720, size: 64, offset: 1216)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1171, file: !158, line: 3119, baseType: !720, size: 64, offset: 1280)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1171, file: !158, line: 3121, baseType: !720, size: 64, offset: 1344)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1171, file: !158, line: 3123, baseType: !720, size: 64, offset: 1408)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !723, file: !158, line: 3385, baseType: !1199, size: 1088)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !158, line: 2874, size: 1088, elements: !1200)
!1200 = !{!1201, !1202, !1203}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1199, file: !158, line: 2875, baseType: !891, size: 960)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1199, file: !158, line: 2876, baseType: !895, size: 64, offset: 960)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1199, file: !158, line: 2877, baseType: !1204, size: 64, offset: 1024)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64)
!1205 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !158, line: 2856, flags: DIFlagFwdDecl)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !723, file: !158, line: 3386, baseType: !1174, size: 1216)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !723, file: !158, line: 3387, baseType: !1208, size: 1280)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !158, line: 3093, size: 1280, elements: !1209)
!1209 = !{!1210, !1211}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1208, file: !158, line: 3094, baseType: !1174, size: 1216)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1208, file: !158, line: 3095, baseType: !1204, size: 64, offset: 1216)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !723, file: !158, line: 3388, baseType: !1213, size: 1216)
!1213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !158, line: 2824, size: 1216, elements: !1214)
!1214 = !{!1215, !1216, !1217, !1218, !1219, !1220}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1213, file: !158, line: 2825, baseType: !853, size: 896)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1213, file: !158, line: 2827, baseType: !720, size: 64, offset: 896)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1213, file: !158, line: 2828, baseType: !720, size: 64, offset: 960)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1213, file: !158, line: 2829, baseType: !720, size: 64, offset: 1024)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1213, file: !158, line: 2830, baseType: !720, size: 64, offset: 1088)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1213, file: !158, line: 2831, baseType: !720, size: 64, offset: 1152)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !723, file: !158, line: 3389, baseType: !1222, size: 1024)
!1222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !158, line: 2850, size: 1024, elements: !1223)
!1223 = !{!1224, !1225, !1226}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1222, file: !158, line: 2851, baseType: !891, size: 960)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1222, file: !158, line: 2852, baseType: !713, size: 32, offset: 960)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1222, file: !158, line: 2853, baseType: !713, size: 32, offset: 992)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !723, file: !158, line: 3390, baseType: !1228, size: 1024)
!1228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !158, line: 2857, size: 1024, elements: !1229)
!1229 = !{!1230, !1231}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1228, file: !158, line: 2858, baseType: !891, size: 960)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1228, file: !158, line: 2859, baseType: !1204, size: 64, offset: 960)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !723, file: !158, line: 3391, baseType: !1233, size: 960)
!1233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !158, line: 2862, size: 960, elements: !1234)
!1234 = !{!1235}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1233, file: !158, line: 2863, baseType: !891, size: 960)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !723, file: !158, line: 3392, baseType: !1237, size: 1472)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !158, line: 3304, size: 1472, elements: !1238)
!1238 = !{!1239}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1237, file: !158, line: 3305, baseType: !1171, size: 1472)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !723, file: !158, line: 3393, baseType: !1241, size: 1792)
!1241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !158, line: 3248, size: 1792, elements: !1242)
!1242 = !{!1243, !1244, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1241, file: !158, line: 3249, baseType: !1171, size: 1472)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1241, file: !158, line: 3251, baseType: !1245, size: 64, offset: 1472)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64)
!1246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1247, line: 463, size: 1152, elements: !1248)
!1247 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1248 = !{!1249, !1411, !1442, !1443, !1446, !1449, !1450, !1451, !1452, !1453, !1454, !1478, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1246, file: !1247, line: 464, baseType: !1250, size: 64)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64)
!1251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !135, line: 194, size: 384, elements: !1252)
!1252 = !{!1253, !1302, !1315, !1329, !1379, !1392}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !1251, file: !135, line: 197, baseType: !1254, size: 64)
!1254 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !135, line: 182, baseType: !1255)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64)
!1256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !135, line: 116, size: 704, elements: !1257)
!1257 = !{!1258, !1259, !1260, !1261, !1262, !1263, !1290, !1299, !1300, !1301}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !1256, file: !135, line: 119, baseType: !1255, size: 64)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1256, file: !135, line: 122, baseType: !1255, size: 64, offset: 64)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !1256, file: !135, line: 123, baseType: !1255, size: 64, offset: 128)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1256, file: !135, line: 126, baseType: !713, size: 32, offset: 192)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1256, file: !135, line: 129, baseType: !134, size: 32, offset: 224)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1256, file: !135, line: 165, baseType: !1264, size: 192, offset: 256)
!1264 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !135, line: 132, size: 192, elements: !1265)
!1265 = !{!1266, !1279, !1285}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !1264, file: !135, line: 137, baseType: !1267, size: 128)
!1267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !135, line: 133, size: 128, elements: !1268)
!1268 = !{!1269, !1278}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !1267, file: !135, line: 135, baseType: !1270, size: 64)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64)
!1271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !135, line: 93, size: 320, elements: !1272)
!1272 = !{!1273, !1274, !1275, !1276, !1277}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !1271, file: !135, line: 96, baseType: !1270, size: 64)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !1271, file: !135, line: 97, baseType: !1270, size: 64, offset: 64)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1271, file: !135, line: 101, baseType: !720, size: 64, offset: 128)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !1271, file: !135, line: 106, baseType: !720, size: 64, offset: 192)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1271, file: !135, line: 111, baseType: !720, size: 64, offset: 256)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !1267, file: !135, line: 136, baseType: !1270, size: 64, offset: 64)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !1264, file: !135, line: 151, baseType: !1280, size: 192)
!1280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !135, line: 139, size: 192, elements: !1281)
!1281 = !{!1282, !1283, !1284}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1280, file: !135, line: 141, baseType: !720, size: 64)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1280, file: !135, line: 145, baseType: !720, size: 64, offset: 64)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1280, file: !135, line: 150, baseType: !713, size: 32, offset: 128)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !1264, file: !135, line: 164, baseType: !1286, size: 128)
!1286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !135, line: 153, size: 128, elements: !1287)
!1287 = !{!1288, !1289}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !1286, file: !135, line: 161, baseType: !720, size: 64)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !1286, file: !135, line: 163, baseType: !845, size: 32, offset: 64)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !1256, file: !135, line: 168, baseType: !1291, size: 64, offset: 448)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64)
!1292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !135, line: 67, size: 320, elements: !1293)
!1293 = !{!1294, !1295, !1296, !1297, !1298}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !1292, file: !135, line: 70, baseType: !1291, size: 64)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1292, file: !135, line: 73, baseType: !1255, size: 64, offset: 64)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !1292, file: !135, line: 78, baseType: !720, size: 64, offset: 128)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !1292, file: !135, line: 85, baseType: !895, size: 64, offset: 192)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1292, file: !135, line: 88, baseType: !713, size: 32, offset: 256)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !1256, file: !135, line: 173, baseType: !895, size: 64, offset: 512)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !1256, file: !135, line: 173, baseType: !895, size: 64, offset: 576)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !1256, file: !135, line: 177, baseType: !712, size: 8, offset: 640)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !1251, file: !135, line: 200, baseType: !1303, size: 64, offset: 64)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64)
!1304 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !135, line: 185, baseType: !1305)
!1305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !135, line: 185, size: 128, elements: !1306)
!1306 = !{!1307}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1305, file: !135, line: 185, baseType: !1308, size: 128)
!1308 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !135, line: 184, baseType: !1309)
!1309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !135, line: 184, size: 128, elements: !1310)
!1310 = !{!1311, !1312, !1313}
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1309, file: !135, line: 184, baseType: !7, size: 32)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1309, file: !135, line: 184, baseType: !7, size: 32, offset: 32)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1309, file: !135, line: 184, baseType: !1314, size: 64, offset: 64)
!1314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1254, size: 64, elements: !819)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !1251, file: !135, line: 203, baseType: !1316, size: 64, offset: 128)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64)
!1317 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, baseType: !1318)
!1318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, size: 128, elements: !1319)
!1319 = !{!1320}
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1318, file: !135, line: 189, baseType: !1321, size: 128)
!1321 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !135, line: 188, baseType: !1322)
!1322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !135, line: 188, size: 128, elements: !1323)
!1323 = !{!1324, !1325, !1326}
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1322, file: !135, line: 188, baseType: !7, size: 32)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1322, file: !135, line: 188, baseType: !7, size: 32, offset: 32)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1322, file: !135, line: 188, baseType: !1327, size: 64, offset: 64)
!1327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1328, size: 64, elements: !819)
!1328 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !135, line: 180, baseType: !1291)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !1251, file: !135, line: 207, baseType: !1330, size: 64, offset: 192)
!1330 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1331, line: 144, baseType: !1332)
!1331 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64)
!1333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1331, line: 100, size: 896, elements: !1334)
!1334 = !{!1335, !1341, !1346, !1351, !1353, !1356, !1357, !1358, !1359, !1360, !1365, !1367, !1368, !1373, !1378}
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1333, file: !1331, line: 102, baseType: !1336, size: 64)
!1336 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1331, line: 52, baseType: !1337)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64)
!1338 = !DISubroutineType(types: !1339)
!1339 = !{!1340, !1139}
!1340 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1331, line: 47, baseType: !7)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1333, file: !1331, line: 105, baseType: !1342, size: 64, offset: 64)
!1342 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1331, line: 59, baseType: !1343)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64)
!1344 = !DISubroutineType(types: !1345)
!1345 = !{!713, !1139, !1139}
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1333, file: !1331, line: 108, baseType: !1347, size: 64, offset: 128)
!1347 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1331, line: 63, baseType: !1348)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64)
!1349 = !DISubroutineType(types: !1350)
!1350 = !{null, !717}
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1333, file: !1331, line: 111, baseType: !1352, size: 64, offset: 192)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1333, file: !1331, line: 114, baseType: !1354, size: 64, offset: 256)
!1354 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1355, line: 46, baseType: !774)
!1355 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1333, file: !1331, line: 117, baseType: !1354, size: 64, offset: 320)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1333, file: !1331, line: 120, baseType: !1354, size: 64, offset: 384)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1333, file: !1331, line: 124, baseType: !7, size: 32, offset: 448)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1333, file: !1331, line: 128, baseType: !7, size: 32, offset: 480)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1333, file: !1331, line: 131, baseType: !1361, size: 64, offset: 512)
!1361 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1331, line: 75, baseType: !1362)
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64)
!1363 = !DISubroutineType(types: !1364)
!1364 = !{!717, !1354, !1354}
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1333, file: !1331, line: 132, baseType: !1366, size: 64, offset: 576)
!1366 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1331, line: 78, baseType: !1348)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1333, file: !1331, line: 135, baseType: !717, size: 64, offset: 640)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1333, file: !1331, line: 136, baseType: !1369, size: 64, offset: 704)
!1369 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1331, line: 82, baseType: !1370)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64)
!1371 = !DISubroutineType(types: !1372)
!1372 = !{!717, !717, !1354, !1354}
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1333, file: !1331, line: 137, baseType: !1374, size: 64, offset: 768)
!1374 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1331, line: 83, baseType: !1375)
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64)
!1376 = !DISubroutineType(types: !1377)
!1377 = !{null, !717, !717}
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1333, file: !1331, line: 141, baseType: !7, size: 32, offset: 832)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !1251, file: !135, line: 211, baseType: !1380, size: 64, offset: 256)
!1380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1381, size: 64)
!1381 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !158, line: 183, baseType: !1382)
!1382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !158, line: 183, size: 128, elements: !1383)
!1383 = !{!1384}
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1382, file: !158, line: 183, baseType: !1385, size: 128)
!1385 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !158, line: 182, baseType: !1386)
!1386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !158, line: 182, size: 128, elements: !1387)
!1387 = !{!1388, !1389, !1390}
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1386, file: !158, line: 182, baseType: !7, size: 32)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1386, file: !158, line: 182, baseType: !7, size: 32, offset: 32)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1386, file: !158, line: 182, baseType: !1391, size: 64, offset: 64)
!1391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !720, size: 64, elements: !819)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !1251, file: !135, line: 220, baseType: !1393, size: 64, offset: 320)
!1393 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !135, line: 217, size: 64, elements: !1394)
!1394 = !{!1395, !1396}
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !1393, file: !135, line: 218, baseType: !1380, size: 64)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !1393, file: !135, line: 219, baseType: !1397, size: 64)
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1398, size: 64)
!1398 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !1399, line: 29, baseType: !1400)
!1399 = !DIFile(filename: "./vecprim.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !1399, line: 29, size: 96, elements: !1401)
!1401 = !{!1402}
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1400, file: !1399, line: 29, baseType: !1403, size: 96)
!1403 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !1399, line: 27, baseType: !1404)
!1404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !1399, line: 27, size: 96, elements: !1405)
!1405 = !{!1406, !1407, !1408}
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1404, file: !1399, line: 27, baseType: !7, size: 32)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1404, file: !1399, line: 27, baseType: !7, size: 32, offset: 32)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1404, file: !1399, line: 27, baseType: !1409, size: 8, offset: 64)
!1409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1410, size: 8, elements: !819)
!1410 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !1399, line: 26, baseType: !712)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1246, file: !1247, line: 467, baseType: !1412, size: 64, offset: 64)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1413, size: 64)
!1413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !142, line: 374, size: 640, elements: !1414)
!1414 = !{!1415, !1417, !1418, !1431, !1432, !1433, !1434, !1435, !1436, !1438, !1440, !1441}
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1413, file: !142, line: 377, baseType: !1416, size: 64)
!1416 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !721, line: 111, baseType: !1007)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1413, file: !142, line: 378, baseType: !1416, size: 64, offset: 64)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1413, file: !142, line: 381, baseType: !1419, size: 64, offset: 128)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64)
!1420 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !142, line: 282, baseType: !1421)
!1421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !142, line: 282, size: 128, elements: !1422)
!1422 = !{!1423}
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1421, file: !142, line: 282, baseType: !1424, size: 128)
!1424 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !142, line: 281, baseType: !1425)
!1425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !142, line: 281, size: 128, elements: !1426)
!1426 = !{!1427, !1428, !1429}
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1425, file: !142, line: 281, baseType: !7, size: 32)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1425, file: !142, line: 281, baseType: !7, size: 32, offset: 32)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1425, file: !142, line: 281, baseType: !1430, size: 64, offset: 64)
!1430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1416, size: 64, elements: !819)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1413, file: !142, line: 384, baseType: !713, size: 32, offset: 192)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1413, file: !142, line: 387, baseType: !713, size: 32, offset: 224)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1413, file: !142, line: 390, baseType: !713, size: 32, offset: 256)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1413, file: !142, line: 394, baseType: !1419, size: 64, offset: 320)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1413, file: !142, line: 396, baseType: !141, size: 32, offset: 384)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1413, file: !142, line: 399, baseType: !1437, size: 64, offset: 416)
!1437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 64, elements: !962)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1413, file: !142, line: 402, baseType: !1439, size: 64, offset: 480)
!1439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !962)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1413, file: !142, line: 406, baseType: !713, size: 32, offset: 544)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1413, file: !142, line: 409, baseType: !713, size: 32, offset: 576)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1246, file: !1247, line: 470, baseType: !1034, size: 64, offset: 128)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1246, file: !1247, line: 473, baseType: !1444, size: 64, offset: 192)
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1445, size: 64)
!1445 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1247, line: 166, flags: DIFlagFwdDecl)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1246, file: !1247, line: 476, baseType: !1447, size: 64, offset: 256)
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1448, size: 64)
!1448 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1247, line: 476, flags: DIFlagFwdDecl)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1246, file: !1247, line: 479, baseType: !1330, size: 64, offset: 320)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1246, file: !1247, line: 484, baseType: !720, size: 64, offset: 384)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1246, file: !1247, line: 488, baseType: !720, size: 64, offset: 448)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1246, file: !1247, line: 493, baseType: !720, size: 64, offset: 512)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1246, file: !1247, line: 496, baseType: !720, size: 64, offset: 576)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1246, file: !1247, line: 501, baseType: !1455, size: 64, offset: 640)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1456, size: 64)
!1456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !153, line: 2355, size: 576, elements: !1457)
!1457 = !{!1458, !1461, !1462, !1463, !1464, !1466, !1467, !1472, !1473, !1474, !1475, !1476, !1477}
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1456, file: !153, line: 2356, baseType: !1459, size: 64)
!1459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1460, size: 64)
!1460 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !153, line: 2356, flags: DIFlagFwdDecl)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1456, file: !153, line: 2357, baseType: !718, size: 64, offset: 64)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1456, file: !153, line: 2358, baseType: !713, size: 32, offset: 128)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1456, file: !153, line: 2359, baseType: !713, size: 32, offset: 160)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1456, file: !153, line: 2360, baseType: !1465, size: 128, offset: 192)
!1465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !713, size: 128, elements: !986)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1456, file: !153, line: 2364, baseType: !713, size: 32, offset: 320)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1456, file: !153, line: 2367, baseType: !1468, size: 128, offset: 384)
!1468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !153, line: 2349, size: 128, elements: !1469)
!1469 = !{!1470, !1471}
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1468, file: !153, line: 2351, baseType: !895, size: 64)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1468, file: !153, line: 2352, baseType: !776, size: 64, offset: 64)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1456, file: !153, line: 2371, baseType: !152, size: 32, offset: 512)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1456, file: !153, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1456, file: !153, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1456, file: !153, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1456, file: !153, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1456, file: !153, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1246, file: !1247, line: 504, baseType: !1479, size: 64, offset: 704)
!1479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1480, size: 64)
!1480 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1247, line: 504, flags: DIFlagFwdDecl)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1246, file: !1247, line: 507, baseType: !1330, size: 64, offset: 768)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1246, file: !1247, line: 510, baseType: !713, size: 32, offset: 832)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1246, file: !1247, line: 513, baseType: !713, size: 32, offset: 864)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1246, file: !1247, line: 516, baseType: !845, size: 32, offset: 896)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1246, file: !1247, line: 519, baseType: !845, size: 32, offset: 928)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1246, file: !1247, line: 522, baseType: !7, size: 32, offset: 960)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1246, file: !1247, line: 523, baseType: !7, size: 32, offset: 992)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1246, file: !1247, line: 528, baseType: !718, size: 64, offset: 1024)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1246, file: !1247, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1246, file: !1247, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1246, file: !1247, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1246, file: !1247, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1246, file: !1247, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1246, file: !1247, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1246, file: !1247, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1246, file: !1247, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1246, file: !1247, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1246, file: !1247, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1246, file: !1247, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1246, file: !1247, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1246, file: !1247, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1246, file: !1247, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1246, file: !1247, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1246, file: !1247, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1241, file: !158, line: 3254, baseType: !720, size: 64, offset: 1536)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1241, file: !158, line: 3257, baseType: !720, size: 64, offset: 1600)
