; ModuleID = 'ipa-pure-const.bc'
source_filename = "ipa-pure-const.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.cgraph_node_set_def = type { %struct.htab*, %struct.VEC_cgraph_node_ptr_gc*, i8* }
%struct.htab = type { i32 (i8*)*, i32 (i8*, i8*)*, void (i8*)*, i8**, i64, i64, i64, i32, i32, i8* (i64, i64)*, void (i8*)*, i8*, i8* (i8*, i64, i64)*, void (i8*, i8*)*, i32 }
%struct.VEC_cgraph_node_ptr_gc = type { %struct.VEC_cgraph_node_ptr_base }
%struct.VEC_cgraph_node_ptr_base = type { i32, i32, [1 x %struct.cgraph_node*] }

!640 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !602, line: 727, baseType: !7, size: 32, elements: !641)
!641 = !{!642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665}
!642 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!643 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!644 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!645 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!646 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!647 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!648 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!649 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!650 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!651 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!652 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!653 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!654 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!655 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!656 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!657 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!658 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!659 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!660 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!661 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!662 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!663 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!664 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!665 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!666 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "lto_section_type", file: !667, line: 256, baseType: !7, size: 32, elements: !668)
!667 = !DIFile(filename: "./lto-streamer.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!668 = !{!669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679}
!669 = !DIEnumerator(name: "LTO_section_decls", value: 0, isUnsigned: true)
!670 = !DIEnumerator(name: "LTO_section_function_body", value: 1, isUnsigned: true)
!671 = !DIEnumerator(name: "LTO_section_static_initializer", value: 2, isUnsigned: true)
!672 = !DIEnumerator(name: "LTO_section_cgraph", value: 3, isUnsigned: true)
!673 = !DIEnumerator(name: "LTO_section_jump_functions", value: 4, isUnsigned: true)
!674 = !DIEnumerator(name: "LTO_section_ipa_pure_const", value: 5, isUnsigned: true)
!675 = !DIEnumerator(name: "LTO_section_ipa_reference", value: 6, isUnsigned: true)
!676 = !DIEnumerator(name: "LTO_section_symtab", value: 7, isUnsigned: true)
!677 = !DIEnumerator(name: "LTO_section_wpa_fixup", value: 8, isUnsigned: true)
!678 = !DIEnumerator(name: "LTO_section_opts", value: 9, isUnsigned: true)
!679 = !DIEnumerator(name: "LTO_N_SECTION_TYPES", value: 10, isUnsigned: true)
!680 = !{!681, !682, !683, !684, !687, !688, !690, !2337, !7, !2347, !2355, !317, !2367, !695, !1020, !2368, !1054, !685, !2370, !1262, !596}
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!683 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !686)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cgraph_node", file: !574, line: 181, size: 2496, elements: !693)
!693 = !{!694, !2080, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2110, !2111, !2112, !2113, !2114, !2115, !2116, !2117, !2118, !2220, !2274, !2284, !2288, !2314, !2323, !2324, !2325, !2326, !2327, !2328, !2329, !2330, !2331, !2332, !2333, !2334, !2335, !2336}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !692, file: !574, line: 182, baseType: !695, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !696, line: 56, baseType: !697)
!696 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !318, line: 3371, size: 1792, elements: !699)
!699 = !{!700, !733, !739, !752, !771, !782, !787, !796, !802, !815, !827, !865, !1410, !1438, !1455, !1456, !1461, !1470, !1476, !1481, !1485, !1489, !1731, !1778, !1784, !1790, !1797, !1810, !1824, !1841, !1853, !1875, !1890, !2062}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !698, file: !318, line: 3372, baseType: !701, size: 64)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !318, line: 360, size: 64, elements: !702)
!702 = !{!703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !701, file: !318, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !701, file: !318, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !701, file: !318, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !701, file: !318, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !701, file: !318, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !701, file: !318, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !701, file: !318, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !701, file: !318, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !701, file: !318, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !701, file: !318, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !701, file: !318, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !701, file: !318, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !701, file: !318, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !701, file: !318, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !701, file: !318, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !701, file: !318, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !701, file: !318, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !701, file: !318, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !701, file: !318, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !701, file: !318, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !701, file: !318, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !701, file: !318, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !701, file: !318, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !701, file: !318, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !701, file: !318, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !701, file: !318, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !701, file: !318, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !701, file: !318, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !701, file: !318, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !701, file: !318, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !698, file: !318, line: 3373, baseType: !734, size: 192)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !318, line: 402, size: 192, elements: !735)
!735 = !{!736, !737, !738}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !734, file: !318, line: 403, baseType: !701, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !734, file: !318, line: 404, baseType: !695, size: 64, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !734, file: !318, line: 405, baseType: !695, size: 64, offset: 128)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !698, file: !318, line: 3374, baseType: !740, size: 320)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !318, line: 1384, size: 320, elements: !741)
!741 = !{!742, !743}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !740, file: !318, line: 1385, baseType: !734, size: 192)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !740, file: !318, line: 1386, baseType: !744, size: 128, offset: 192)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !745, line: 58, baseType: !746)
!745 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !745, line: 54, size: 128, elements: !747)
!747 = !{!748, !750}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !746, file: !745, line: 56, baseType: !749, size: 64)
!749 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !746, file: !745, line: 57, baseType: !751, size: 64, offset: 64)
!751 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !698, file: !318, line: 3375, baseType: !753, size: 256)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !318, line: 1397, size: 256, elements: !754)
!754 = !{!755, !756}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !753, file: !318, line: 1398, baseType: !734, size: 192)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !753, file: !318, line: 1399, baseType: !757, size: 64, offset: 192)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !759, line: 52, size: 256, elements: !760)
!759 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!760 = !{!761, !762, !763, !764, !765, !766, !767}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !758, file: !759, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !758, file: !759, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !758, file: !759, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !758, file: !759, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !758, file: !759, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !758, file: !759, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !758, file: !759, line: 62, baseType: !768, size: 192, offset: 64)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !749, size: 192, elements: !769)
!769 = !{!770}
!770 = !DISubrange(count: 3)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !698, file: !318, line: 3376, baseType: !772, size: 256)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !318, line: 1408, size: 256, elements: !773)
!773 = !{!774, !775}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !772, file: !318, line: 1409, baseType: !734, size: 192)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !772, file: !318, line: 1410, baseType: !776, size: 64, offset: 192)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !778, line: 27, size: 192, elements: !779)
!778 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!779 = !{!780, !781}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !777, file: !778, line: 29, baseType: !744, size: 128)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !777, file: !778, line: 30, baseType: !189, size: 32, offset: 128)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !698, file: !318, line: 3377, baseType: !783, size: 256)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !318, line: 1437, size: 256, elements: !784)
!784 = !{!785, !786}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !783, file: !318, line: 1438, baseType: !734, size: 192)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !783, file: !318, line: 1439, baseType: !695, size: 64, offset: 192)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !698, file: !318, line: 3378, baseType: !788, size: 256)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !318, line: 1418, size: 256, elements: !789)
!789 = !{!790, !791, !792}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !788, file: !318, line: 1419, baseType: !734, size: 192)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !788, file: !318, line: 1420, baseType: !683, size: 32, offset: 192)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !788, file: !318, line: 1421, baseType: !793, size: 8, offset: 224)
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !686, size: 8, elements: !794)
!794 = !{!795}
!795 = !DISubrange(count: 1)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !698, file: !318, line: 3379, baseType: !797, size: 320)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !318, line: 1428, size: 320, elements: !798)
!798 = !{!799, !800, !801}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !797, file: !318, line: 1429, baseType: !734, size: 192)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !797, file: !318, line: 1430, baseType: !695, size: 64, offset: 192)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !797, file: !318, line: 1431, baseType: !695, size: 64, offset: 256)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !698, file: !318, line: 3380, baseType: !803, size: 320)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !318, line: 1460, size: 320, elements: !804)
!804 = !{!805, !806}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !803, file: !318, line: 1461, baseType: !734, size: 192)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !803, file: !318, line: 1462, baseType: !807, size: 128, offset: 192)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !808, line: 31, size: 128, elements: !809)
!808 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!809 = !{!810, !813, !814}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !807, file: !808, line: 32, baseType: !811, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !682)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !807, file: !808, line: 33, baseType: !7, size: 32, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !807, file: !808, line: 34, baseType: !7, size: 32, offset: 96)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !698, file: !318, line: 3381, baseType: !816, size: 384)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !318, line: 2507, size: 384, elements: !817)
!817 = !{!818, !819, !824, !825, !826}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !816, file: !318, line: 2508, baseType: !734, size: 192)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !816, file: !318, line: 2509, baseType: !820, size: 32, offset: 192)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !821, line: 58, baseType: !822)
!821 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !823, line: 44, baseType: !7)
!823 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!824 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !816, file: !318, line: 2510, baseType: !7, size: 32, offset: 224)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !816, file: !318, line: 2511, baseType: !695, size: 64, offset: 256)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !816, file: !318, line: 2512, baseType: !695, size: 64, offset: 320)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !698, file: !318, line: 3382, baseType: !828, size: 896)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !318, line: 2652, size: 896, elements: !829)
!829 = !{!830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !828, file: !318, line: 2653, baseType: !816, size: 384)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !828, file: !318, line: 2654, baseType: !695, size: 64, offset: 384)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !828, file: !318, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !828, file: !318, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !828, file: !318, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !828, file: !318, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !828, file: !318, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !828, file: !318, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !828, file: !318, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !828, file: !318, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !828, file: !318, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !828, file: !318, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !828, file: !318, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !828, file: !318, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !828, file: !318, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !828, file: !318, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !828, file: !318, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !828, file: !318, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !828, file: !318, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !828, file: !318, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !828, file: !318, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !828, file: !318, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !828, file: !318, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !828, file: !318, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !828, file: !318, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !828, file: !318, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !828, file: !318, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !828, file: !318, line: 2703, baseType: !7, size: 32, offset: 512)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !828, file: !318, line: 2705, baseType: !695, size: 64, offset: 576)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !828, file: !318, line: 2706, baseType: !695, size: 64, offset: 640)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !828, file: !318, line: 2707, baseType: !695, size: 64, offset: 704)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !828, file: !318, line: 2708, baseType: !695, size: 64, offset: 768)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !828, file: !318, line: 2711, baseType: !863, size: 64, offset: 832)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !318, line: 2711, flags: DIFlagFwdDecl)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !698, file: !318, line: 3383, baseType: !866, size: 960)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !318, line: 2756, size: 960, elements: !867)
!867 = !{!868, !869}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !866, file: !318, line: 2757, baseType: !828, size: 896)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !866, file: !318, line: 2758, baseType: !870, size: 64, offset: 896)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !696, line: 50, baseType: !871)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !873, line: 240, size: 384, elements: !874)
!873 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!874 = !{!875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !872, file: !873, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !872, file: !873, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !872, file: !873, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !872, file: !873, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !872, file: !873, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !872, file: !873, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !872, file: !873, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !872, file: !873, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !872, file: !873, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !872, file: !873, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !872, file: !873, line: 321, baseType: !886, size: 320, offset: 64)
!886 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !873, line: 315, size: 320, elements: !887)
!887 = !{!888, !1343, !1345, !1408, !1409}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !886, file: !873, line: 316, baseType: !889, size: 64)
!889 = !DICompositeType(tag: DW_TAG_array_type, baseType: !890, size: 64, elements: !794)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !873, line: 183, baseType: !891)
!891 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !873, line: 166, size: 64, elements: !892)
!892 = !{!893, !894, !895, !896, !897, !905, !906, !918, !921, !981, !982, !1320, !1333, !1340}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !891, file: !873, line: 168, baseType: !683, size: 32)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !891, file: !873, line: 169, baseType: !7, size: 32)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !891, file: !873, line: 170, baseType: !688, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !891, file: !873, line: 171, baseType: !870, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !891, file: !873, line: 172, baseType: !898, size: 64)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !696, line: 53, baseType: !899)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !873, line: 359, size: 128, elements: !901)
!901 = !{!902, !903}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !900, file: !873, line: 360, baseType: !683, size: 32)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !900, file: !873, line: 361, baseType: !904, size: 64, offset: 64)
!904 = !DICompositeType(tag: DW_TAG_array_type, baseType: !870, size: 64, elements: !794)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !891, file: !873, line: 173, baseType: !189, size: 32)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !891, file: !873, line: 174, baseType: !907, size: 32)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !873, line: 133, baseType: !908)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !873, line: 115, size: 32, elements: !909)
!909 = !{!910, !911, !912, !913, !914, !915, !916, !917}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !908, file: !873, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !908, file: !873, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !908, file: !873, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !908, file: !873, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !908, file: !873, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !908, file: !873, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !908, file: !873, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !908, file: !873, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !891, file: !873, line: 175, baseType: !919, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !873, line: 175, flags: DIFlagFwdDecl)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !891, file: !873, line: 176, baseType: !922, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !924, line: 75, size: 256, elements: !925)
!924 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!925 = !{!926, !940, !941, !942}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !923, file: !924, line: 76, baseType: !927, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !924, line: 68, baseType: !929)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !924, line: 63, size: 320, elements: !930)
!930 = !{!931, !933, !934, !935}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !929, file: !924, line: 64, baseType: !932, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !929, file: !924, line: 65, baseType: !932, size: 64, offset: 64)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !929, file: !924, line: 66, baseType: !7, size: 32, offset: 128)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !929, file: !924, line: 67, baseType: !936, size: 128, offset: 192)
!936 = !DICompositeType(tag: DW_TAG_array_type, baseType: !937, size: 128, elements: !938)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !924, line: 29, baseType: !749)
!938 = !{!939}
!939 = !DISubrange(count: 2)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !923, file: !924, line: 77, baseType: !927, size: 64, offset: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !923, file: !924, line: 78, baseType: !7, size: 32, offset: 128)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !923, file: !924, line: 79, baseType: !943, size: 64, offset: 192)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !924, line: 49, baseType: !945)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !924, line: 45, size: 832, elements: !946)
!946 = !{!947, !948, !949}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !945, file: !924, line: 46, baseType: !932, size: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !945, file: !924, line: 47, baseType: !922, size: 64, offset: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !945, file: !924, line: 48, baseType: !950, size: 704, offset: 128)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !951, line: 164, size: 704, elements: !952)
!951 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!952 = !{!953, !954, !964, !965, !966, !967, !968, !969, !973, !977, !978, !979, !980}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !950, file: !951, line: 166, baseType: !751, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !950, file: !951, line: 167, baseType: !955, size: 64, offset: 64)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !951, line: 157, size: 192, elements: !957)
!957 = !{!958, !959, !960}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !956, file: !951, line: 159, baseType: !685, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !956, file: !951, line: 160, baseType: !955, size: 64, offset: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !956, file: !951, line: 161, baseType: !961, size: 32, offset: 128)
!961 = !DICompositeType(tag: DW_TAG_array_type, baseType: !686, size: 32, elements: !962)
!962 = !{!963}
!963 = !DISubrange(count: 4)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !950, file: !951, line: 168, baseType: !685, size: 64, offset: 128)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !950, file: !951, line: 169, baseType: !685, size: 64, offset: 192)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !950, file: !951, line: 170, baseType: !685, size: 64, offset: 256)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !950, file: !951, line: 171, baseType: !751, size: 64, offset: 320)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !950, file: !951, line: 172, baseType: !683, size: 32, offset: 384)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !950, file: !951, line: 176, baseType: !970, size: 64, offset: 448)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!955, !687, !751}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !950, file: !951, line: 177, baseType: !974, size: 64, offset: 512)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{null, !687, !955}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !950, file: !951, line: 178, baseType: !687, size: 64, offset: 576)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !950, file: !951, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !950, file: !951, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !950, file: !951, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !891, file: !873, line: 177, baseType: !695, size: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !891, file: !873, line: 178, baseType: !983, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !526, line: 217, size: 832, elements: !985)
!985 = !{!986, !1232, !1233, !1234, !1290, !1294, !1295, !1296, !1314, !1315, !1316, !1317, !1318, !1319}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !984, file: !526, line: 219, baseType: !987, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !526, line: 151, baseType: !989)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !526, line: 151, size: 128, elements: !990)
!990 = !{!991}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !989, file: !526, line: 151, baseType: !992, size: 128)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !526, line: 150, baseType: !993)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !526, line: 150, size: 128, elements: !994)
!994 = !{!995, !996, !997}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !993, file: !526, line: 150, baseType: !7, size: 32)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !993, file: !526, line: 150, baseType: !7, size: 32, offset: 32)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !993, file: !526, line: 150, baseType: !998, size: 64, offset: 64)
!998 = !DICompositeType(tag: DW_TAG_array_type, baseType: !999, size: 64, elements: !794)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !696, line: 108, baseType: !1000)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !526, line: 122, size: 512, elements: !1002)
!1002 = !{!1003, !1004, !1005, !1224, !1225, !1226, !1227, !1228, !1229, !1230}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1001, file: !526, line: 124, baseType: !983, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1001, file: !526, line: 125, baseType: !983, size: 64, offset: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1001, file: !526, line: 131, baseType: !1006, size: 64, offset: 128)
!1006 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !526, line: 128, size: 64, elements: !1007)
!1007 = !{!1008, !1223}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1006, file: !526, line: 129, baseType: !1009, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !696, line: 66, baseType: !1010)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !602, line: 143, size: 192, elements: !1012)
!1012 = !{!1013, !1221, !1222}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1011, file: !602, line: 145, baseType: !1014, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !696, line: 69, baseType: !1015)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !602, line: 136, size: 192, elements: !1017)
!1017 = !{!1018, !1219, !1220}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1016, file: !602, line: 137, baseType: !1019, size: 64)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !696, line: 58, baseType: !1020)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !602, line: 737, size: 768, elements: !1022)
!1022 = !{!1023, !1040, !1074, !1080, !1085, !1090, !1097, !1103, !1109, !1114, !1128, !1133, !1139, !1144, !1154, !1159, !1177, !1184, !1191, !1197, !1202, !1208, !1214}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1021, file: !602, line: 738, baseType: !1024, size: 256)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !602, line: 271, size: 256, elements: !1025)
!1025 = !{!1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1024, file: !602, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !1024, file: !602, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1024, file: !602, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !1024, file: !602, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !1024, file: !602, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !1024, file: !602, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !1024, file: !602, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1024, file: !602, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !1024, file: !602, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1024, file: !602, line: 312, baseType: !7, size: 32, offset: 32)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !1024, file: !602, line: 316, baseType: !820, size: 32, offset: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !1024, file: !602, line: 319, baseType: !7, size: 32, offset: 96)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1024, file: !602, line: 323, baseType: !983, size: 64, offset: 128)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1024, file: !602, line: 327, baseType: !695, size: 64, offset: 192)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !1021, file: !602, line: 739, baseType: !1041, size: 448)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !602, line: 350, size: 448, elements: !1042)
!1042 = !{!1043, !1072}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1041, file: !602, line: 353, baseType: !1044, size: 384)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !602, line: 333, size: 384, elements: !1045)
!1045 = !{!1046, !1047, !1055}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1044, file: !602, line: 336, baseType: !1024, size: 256)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !1044, file: !602, line: 343, baseType: !1048, size: 64, offset: 256)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1050, line: 37, size: 128, elements: !1051)
!1050 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1051 = !{!1052, !1053}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1049, file: !1050, line: 39, baseType: !1048, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1049, file: !1050, line: 40, baseType: !1054, size: 64, offset: 64)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !1044, file: !602, line: 344, baseType: !1056, size: 64, offset: 320)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1050, line: 45, size: 320, elements: !1058)
!1058 = !{!1059, !1060}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1057, file: !1050, line: 47, baseType: !1056, size: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1057, file: !1050, line: 48, baseType: !1061, size: 256, offset: 64)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !318, line: 1883, size: 256, elements: !1062)
!1062 = !{!1063, !1065, !1066, !1071}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1061, file: !318, line: 1884, baseType: !1064, size: 64)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1061, file: !318, line: 1885, baseType: !1064, size: 64, offset: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1061, file: !318, line: 1891, baseType: !1067, size: 64, offset: 128)
!1067 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1061, file: !318, line: 1891, size: 64, elements: !1068)
!1068 = !{!1069, !1070}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1067, file: !318, line: 1891, baseType: !1019, size: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1067, file: !318, line: 1891, baseType: !695, size: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1061, file: !318, line: 1892, baseType: !1054, size: 64, offset: 192)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1041, file: !602, line: 359, baseType: !1073, size: 64, offset: 384)
!1073 = !DICompositeType(tag: DW_TAG_array_type, baseType: !695, size: 64, elements: !794)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !1021, file: !602, line: 740, baseType: !1075, size: 512)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !602, line: 365, size: 512, elements: !1076)
!1076 = !{!1077, !1078, !1079}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1075, file: !602, line: 368, baseType: !1044, size: 384)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1075, file: !602, line: 373, baseType: !695, size: 64, offset: 384)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1075, file: !602, line: 374, baseType: !695, size: 64, offset: 448)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !1021, file: !602, line: 741, baseType: !1081, size: 576)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !602, line: 380, size: 576, elements: !1082)
!1082 = !{!1083, !1084}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1081, file: !602, line: 383, baseType: !1075, size: 512)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1081, file: !602, line: 389, baseType: !1073, size: 64, offset: 512)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1021, file: !602, line: 742, baseType: !1086, size: 320)
!1086 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !602, line: 395, size: 320, elements: !1087)
!1087 = !{!1088, !1089}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1086, file: !602, line: 397, baseType: !1024, size: 256)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1086, file: !602, line: 400, baseType: !1009, size: 64, offset: 256)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !1021, file: !602, line: 743, baseType: !1091, size: 448)
!1091 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !602, line: 406, size: 448, elements: !1092)
!1092 = !{!1093, !1094, !1095, !1096}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1091, file: !602, line: 408, baseType: !1024, size: 256)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1091, file: !602, line: 412, baseType: !695, size: 64, offset: 256)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1091, file: !602, line: 420, baseType: !695, size: 64, offset: 320)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1091, file: !602, line: 423, baseType: !1009, size: 64, offset: 384)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !1021, file: !602, line: 744, baseType: !1098, size: 384)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !602, line: 429, size: 384, elements: !1099)
!1099 = !{!1100, !1101, !1102}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1098, file: !602, line: 431, baseType: !1024, size: 256)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1098, file: !602, line: 434, baseType: !695, size: 64, offset: 256)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1098, file: !602, line: 437, baseType: !1009, size: 64, offset: 320)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !1021, file: !602, line: 745, baseType: !1104, size: 384)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !602, line: 443, size: 384, elements: !1105)
!1105 = !{!1106, !1107, !1108}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1104, file: !602, line: 445, baseType: !1024, size: 256)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1104, file: !602, line: 449, baseType: !695, size: 64, offset: 256)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1104, file: !602, line: 453, baseType: !1009, size: 64, offset: 320)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !1021, file: !602, line: 746, baseType: !1110, size: 320)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !602, line: 459, size: 320, elements: !1111)
!1111 = !{!1112, !1113}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1110, file: !602, line: 461, baseType: !1024, size: 256)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1110, file: !602, line: 464, baseType: !695, size: 64, offset: 256)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !1021, file: !602, line: 747, baseType: !1115, size: 768)
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !602, line: 469, size: 768, elements: !1116)
!1116 = !{!1117, !1118, !1119, !1120, !1121}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1115, file: !602, line: 471, baseType: !1024, size: 256)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1115, file: !602, line: 474, baseType: !7, size: 32, offset: 256)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1115, file: !602, line: 475, baseType: !7, size: 32, offset: 288)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1115, file: !602, line: 478, baseType: !695, size: 64, offset: 320)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1115, file: !602, line: 481, baseType: !1122, size: 384, offset: 384)
!1122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1123, size: 384, elements: !794)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !318, line: 1917, size: 384, elements: !1124)
!1124 = !{!1125, !1126, !1127}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1123, file: !318, line: 1920, baseType: !1061, size: 256)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1123, file: !318, line: 1921, baseType: !695, size: 64, offset: 256)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1123, file: !318, line: 1922, baseType: !820, size: 32, offset: 320)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !1021, file: !602, line: 748, baseType: !1129, size: 320)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !602, line: 487, size: 320, elements: !1130)
!1130 = !{!1131, !1132}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1129, file: !602, line: 490, baseType: !1024, size: 256)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1129, file: !602, line: 494, baseType: !683, size: 32, offset: 256)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !1021, file: !602, line: 749, baseType: !1134, size: 384)
!1134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !602, line: 500, size: 384, elements: !1135)
!1135 = !{!1136, !1137, !1138}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1134, file: !602, line: 502, baseType: !1024, size: 256)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1134, file: !602, line: 506, baseType: !1009, size: 64, offset: 256)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1134, file: !602, line: 510, baseType: !1009, size: 64, offset: 320)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !1021, file: !602, line: 750, baseType: !1140, size: 320)
!1140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !602, line: 529, size: 320, elements: !1141)
!1141 = !{!1142, !1143}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1140, file: !602, line: 531, baseType: !1024, size: 256)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1140, file: !602, line: 540, baseType: !1009, size: 64, offset: 256)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !1021, file: !602, line: 751, baseType: !1145, size: 704)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !602, line: 546, size: 704, elements: !1146)
!1146 = !{!1147, !1148, !1149, !1150, !1151, !1152, !1153}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1145, file: !602, line: 549, baseType: !1075, size: 512)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1145, file: !602, line: 553, baseType: !688, size: 64, offset: 512)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1145, file: !602, line: 557, baseType: !682, size: 8, offset: 576)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1145, file: !602, line: 558, baseType: !682, size: 8, offset: 584)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1145, file: !602, line: 559, baseType: !682, size: 8, offset: 592)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1145, file: !602, line: 560, baseType: !682, size: 8, offset: 600)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1145, file: !602, line: 566, baseType: !1073, size: 64, offset: 640)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !1021, file: !602, line: 752, baseType: !1155, size: 384)
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !602, line: 571, size: 384, elements: !1156)
!1156 = !{!1157, !1158}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1155, file: !602, line: 573, baseType: !1086, size: 320)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1155, file: !602, line: 577, baseType: !695, size: 64, offset: 320)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !1021, file: !602, line: 753, baseType: !1160, size: 576)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !602, line: 600, size: 576, elements: !1161)
!1161 = !{!1162, !1163, !1164, !1167, !1176}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1160, file: !602, line: 602, baseType: !1086, size: 320)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1160, file: !602, line: 605, baseType: !695, size: 64, offset: 320)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1160, file: !602, line: 609, baseType: !1165, size: 64, offset: 384)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1166, line: 46, baseType: !749)
!1166 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1160, file: !602, line: 612, baseType: !1168, size: 64, offset: 448)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64)
!1169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !602, line: 581, size: 320, elements: !1170)
!1170 = !{!1171, !1172, !1173, !1174, !1175}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1169, file: !602, line: 583, baseType: !317, size: 32)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1169, file: !602, line: 586, baseType: !695, size: 64, offset: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1169, file: !602, line: 589, baseType: !695, size: 64, offset: 128)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1169, file: !602, line: 592, baseType: !695, size: 64, offset: 192)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1169, file: !602, line: 595, baseType: !695, size: 64, offset: 256)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1160, file: !602, line: 616, baseType: !1009, size: 64, offset: 512)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !1021, file: !602, line: 754, baseType: !1178, size: 512)
!1178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !602, line: 622, size: 512, elements: !1179)
!1179 = !{!1180, !1181, !1182, !1183}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1178, file: !602, line: 624, baseType: !1086, size: 320)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1178, file: !602, line: 628, baseType: !695, size: 64, offset: 320)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1178, file: !602, line: 632, baseType: !695, size: 64, offset: 384)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1178, file: !602, line: 636, baseType: !695, size: 64, offset: 448)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !1021, file: !602, line: 755, baseType: !1185, size: 704)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !602, line: 642, size: 704, elements: !1186)
!1186 = !{!1187, !1188, !1189, !1190}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1185, file: !602, line: 644, baseType: !1178, size: 512)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1185, file: !602, line: 648, baseType: !695, size: 64, offset: 512)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1185, file: !602, line: 652, baseType: !695, size: 64, offset: 576)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1185, file: !602, line: 653, baseType: !695, size: 64, offset: 640)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !1021, file: !602, line: 756, baseType: !1192, size: 448)
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !602, line: 663, size: 448, elements: !1193)
!1193 = !{!1194, !1195, !1196}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1192, file: !602, line: 665, baseType: !1086, size: 320)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1192, file: !602, line: 668, baseType: !695, size: 64, offset: 320)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1192, file: !602, line: 673, baseType: !695, size: 64, offset: 384)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !1021, file: !602, line: 757, baseType: !1198, size: 384)
!1198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !602, line: 694, size: 384, elements: !1199)
!1199 = !{!1200, !1201}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1198, file: !602, line: 696, baseType: !1086, size: 320)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1198, file: !602, line: 699, baseType: !695, size: 64, offset: 320)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !1021, file: !602, line: 758, baseType: !1203, size: 384)
!1203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !602, line: 681, size: 384, elements: !1204)
!1204 = !{!1205, !1206, !1207}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1203, file: !602, line: 683, baseType: !1024, size: 256)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1203, file: !602, line: 686, baseType: !695, size: 64, offset: 256)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1203, file: !602, line: 689, baseType: !695, size: 64, offset: 320)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !1021, file: !602, line: 759, baseType: !1209, size: 384)
!1209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !602, line: 707, size: 384, elements: !1210)
!1210 = !{!1211, !1212, !1213}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1209, file: !602, line: 709, baseType: !1024, size: 256)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1209, file: !602, line: 712, baseType: !695, size: 64, offset: 256)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1209, file: !602, line: 712, baseType: !695, size: 64, offset: 320)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !1021, file: !602, line: 760, baseType: !1215, size: 320)
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !602, line: 718, size: 320, elements: !1216)
!1216 = !{!1217, !1218}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1215, file: !602, line: 720, baseType: !1024, size: 256)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1215, file: !602, line: 723, baseType: !695, size: 64, offset: 256)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1016, file: !602, line: 138, baseType: !1015, size: 64, offset: 64)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1016, file: !602, line: 139, baseType: !1015, size: 64, offset: 128)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1011, file: !602, line: 146, baseType: !1014, size: 64, offset: 64)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1011, file: !602, line: 152, baseType: !1009, size: 64, offset: 128)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1006, file: !526, line: 130, baseType: !870, size: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1001, file: !526, line: 134, baseType: !687, size: 64, offset: 192)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1001, file: !526, line: 137, baseType: !695, size: 64, offset: 256)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1001, file: !526, line: 138, baseType: !820, size: 32, offset: 320)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1001, file: !526, line: 142, baseType: !7, size: 32, offset: 352)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1001, file: !526, line: 144, baseType: !683, size: 32, offset: 384)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1001, file: !526, line: 145, baseType: !683, size: 32, offset: 416)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1001, file: !526, line: 146, baseType: !1231, size: 64, offset: 448)
!1231 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !526, line: 119, baseType: !751)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !984, file: !526, line: 220, baseType: !987, size: 64, offset: 64)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !984, file: !526, line: 223, baseType: !687, size: 64, offset: 128)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !984, file: !526, line: 226, baseType: !1235, size: 64, offset: 192)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64)
!1236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !513, line: 100, size: 1216, elements: !1237)
!1237 = !{!1238, !1239, !1240, !1241, !1242, !1247, !1248, !1249, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1280, !1288, !1289}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1236, file: !513, line: 102, baseType: !683, size: 32)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1236, file: !513, line: 105, baseType: !7, size: 32, offset: 32)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1236, file: !513, line: 108, baseType: !983, size: 64, offset: 64)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1236, file: !513, line: 111, baseType: !983, size: 64, offset: 128)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1236, file: !513, line: 114, baseType: !1243, size: 64, offset: 192)
!1243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !513, line: 41, size: 64, elements: !1244)
!1244 = !{!1245, !1246}
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1243, file: !513, line: 42, baseType: !512, size: 32)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1243, file: !513, line: 43, baseType: !7, size: 32, offset: 32)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1236, file: !513, line: 117, baseType: !7, size: 32, offset: 256)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1236, file: !513, line: 120, baseType: !7, size: 32, offset: 288)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1236, file: !513, line: 123, baseType: !1250, size: 64, offset: 320)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64)
!1251 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !513, line: 87, baseType: !1252)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !513, line: 87, size: 128, elements: !1253)
!1253 = !{!1254}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1252, file: !513, line: 87, baseType: !1255, size: 128)
!1255 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !513, line: 85, baseType: !1256)
!1256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !513, line: 85, size: 128, elements: !1257)
!1257 = !{!1258, !1259, !1260}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1256, file: !513, line: 85, baseType: !7, size: 32)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1256, file: !513, line: 85, baseType: !7, size: 32, offset: 32)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1256, file: !513, line: 85, baseType: !1261, size: 64, offset: 64)
!1261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1262, size: 64, elements: !794)
!1262 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !513, line: 84, baseType: !1235)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1236, file: !513, line: 126, baseType: !1235, size: 64, offset: 384)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1236, file: !513, line: 129, baseType: !1235, size: 64, offset: 448)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1236, file: !513, line: 132, baseType: !687, size: 64, offset: 512)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1236, file: !513, line: 139, baseType: !695, size: 64, offset: 576)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1236, file: !513, line: 143, baseType: !744, size: 128, offset: 640)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1236, file: !513, line: 146, baseType: !744, size: 128, offset: 768)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1236, file: !513, line: 148, baseType: !682, size: 8, offset: 896)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1236, file: !513, line: 149, baseType: !682, size: 8, offset: 904)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1236, file: !513, line: 153, baseType: !521, size: 32, offset: 928)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1236, file: !513, line: 156, baseType: !1273, size: 64, offset: 960)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64)
!1274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !513, line: 48, size: 320, elements: !1275)
!1275 = !{!1276, !1277, !1278, !1279}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1274, file: !513, line: 50, baseType: !1019, size: 64)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1274, file: !513, line: 59, baseType: !744, size: 128, offset: 64)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1274, file: !513, line: 64, baseType: !682, size: 8, offset: 192)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1274, file: !513, line: 67, baseType: !1273, size: 64, offset: 256)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1236, file: !513, line: 159, baseType: !1281, size: 64, offset: 1024)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64)
!1282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !513, line: 72, size: 256, elements: !1283)
!1283 = !{!1284, !1285, !1286, !1287}
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1282, file: !513, line: 74, baseType: !1000, size: 64)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1282, file: !513, line: 77, baseType: !1281, size: 64, offset: 64)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1282, file: !513, line: 78, baseType: !1281, size: 64, offset: 128)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1282, file: !513, line: 81, baseType: !1281, size: 64, offset: 192)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1236, file: !513, line: 162, baseType: !682, size: 8, offset: 1088)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1236, file: !513, line: 166, baseType: !695, size: 64, offset: 1152)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !984, file: !526, line: 229, baseType: !1291, size: 128, offset: 256)
!1291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1292, size: 128, elements: !938)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64)
!1293 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !526, line: 229, flags: DIFlagFwdDecl)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !984, file: !526, line: 232, baseType: !983, size: 64, offset: 384)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !984, file: !526, line: 233, baseType: !983, size: 64, offset: 448)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !984, file: !526, line: 238, baseType: !1297, size: 64, offset: 512)
!1297 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !526, line: 235, size: 64, elements: !1298)
!1298 = !{!1299, !1305}
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1297, file: !526, line: 236, baseType: !1300, size: 64)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64)
!1301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !526, line: 273, size: 128, elements: !1302)
!1302 = !{!1303, !1304}
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1301, file: !526, line: 275, baseType: !1009, size: 64)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1301, file: !526, line: 278, baseType: !1009, size: 64, offset: 64)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1297, file: !526, line: 237, baseType: !1306, size: 64)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64)
!1307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !526, line: 259, size: 320, elements: !1308)
!1308 = !{!1309, !1310, !1311, !1312, !1313}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1307, file: !526, line: 261, baseType: !870, size: 64)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1307, file: !526, line: 262, baseType: !870, size: 64, offset: 64)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1307, file: !526, line: 266, baseType: !870, size: 64, offset: 128)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1307, file: !526, line: 267, baseType: !870, size: 64, offset: 192)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1307, file: !526, line: 270, baseType: !683, size: 32, offset: 256)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !984, file: !526, line: 241, baseType: !1231, size: 64, offset: 576)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !984, file: !526, line: 244, baseType: !683, size: 32, offset: 640)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !984, file: !526, line: 247, baseType: !683, size: 32, offset: 672)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !984, file: !526, line: 250, baseType: !683, size: 32, offset: 704)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !984, file: !526, line: 253, baseType: !683, size: 32, offset: 736)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !984, file: !526, line: 256, baseType: !683, size: 32, offset: 768)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !891, file: !873, line: 179, baseType: !1321, size: 64)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64)
!1322 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !873, line: 150, baseType: !1323)
!1323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !873, line: 142, size: 320, elements: !1324)
!1324 = !{!1325, !1326, !1327, !1328, !1331, !1332}
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1323, file: !873, line: 144, baseType: !695, size: 64)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1323, file: !873, line: 145, baseType: !870, size: 64, offset: 64)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1323, file: !873, line: 146, baseType: !870, size: 64, offset: 128)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1323, file: !873, line: 147, baseType: !1329, size: 32, offset: 192)
!1329 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1330, line: 31, baseType: !683)
!1330 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1323, file: !873, line: 148, baseType: !7, size: 32, offset: 224)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1323, file: !873, line: 149, baseType: !682, size: 8, offset: 256)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !891, file: !873, line: 180, baseType: !1334, size: 64)
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1335, size: 64)
!1335 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !873, line: 162, baseType: !1336)
!1336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !873, line: 159, size: 128, elements: !1337)
!1337 = !{!1338, !1339}
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1336, file: !873, line: 160, baseType: !695, size: 64)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1336, file: !873, line: 161, baseType: !751, size: 64, offset: 64)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !891, file: !873, line: 181, baseType: !1341, size: 64)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64)
!1342 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !873, line: 181, flags: DIFlagFwdDecl)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !886, file: !873, line: 317, baseType: !1344, size: 64)
!1344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !751, size: 64, elements: !794)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !886, file: !873, line: 318, baseType: !1346, size: 320)
!1346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !873, line: 188, size: 320, elements: !1347)
!1347 = !{!1348, !1350, !1407}
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1346, file: !873, line: 190, baseType: !1349, size: 192)
!1349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !890, size: 192, elements: !769)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1346, file: !873, line: 193, baseType: !1351, size: 64, offset: 192)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64)
!1352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !873, line: 206, size: 320, elements: !1353)
!1353 = !{!1354, !1392, !1393, !1394, !1406}
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1352, file: !873, line: 208, baseType: !1355, size: 64)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64)
!1356 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !696, line: 62, baseType: !1357)
!1357 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1358, line: 538, size: 256, elements: !1359)
!1358 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1359 = !{!1360, !1364, !1370, !1383}
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1357, file: !1358, line: 539, baseType: !1361, size: 32)
!1361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1358, line: 482, size: 32, elements: !1362)
!1362 = !{!1363}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1361, file: !1358, line: 484, baseType: !7, size: 32)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1357, file: !1358, line: 540, baseType: !1365, size: 192)
!1365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1358, line: 488, size: 192, elements: !1366)
!1366 = !{!1367, !1368, !1369}
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1365, file: !1358, line: 489, baseType: !1361, size: 32)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1365, file: !1358, line: 492, baseType: !688, size: 64, offset: 64)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1365, file: !1358, line: 496, baseType: !695, size: 64, offset: 128)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1357, file: !1358, line: 541, baseType: !1371, size: 256)
!1371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1358, line: 504, size: 256, elements: !1372)
!1372 = !{!1373, !1374, !1381, !1382}
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1371, file: !1358, line: 505, baseType: !1361, size: 32)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1371, file: !1358, line: 509, baseType: !1375, size: 64, offset: 64)
!1375 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1358, line: 501, baseType: !1376)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64)
!1377 = !DISubroutineType(types: !1378)
!1378 = !{null, !1379}
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64)
!1380 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1371, file: !1358, line: 510, baseType: !1379, size: 64, offset: 128)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1371, file: !1358, line: 513, baseType: !1355, size: 64, offset: 192)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1357, file: !1358, line: 542, baseType: !1384, size: 128)
!1384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1358, line: 530, size: 128, elements: !1385)
!1385 = !{!1386, !1387}
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1384, file: !1358, line: 531, baseType: !1361, size: 32)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1384, file: !1358, line: 534, baseType: !1388, size: 64, offset: 64)
!1388 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1358, line: 525, baseType: !1389)
!1389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1390, size: 64)
!1390 = !DISubroutineType(types: !1391)
!1391 = !{!682, !695, !688, !749, !749}
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1352, file: !873, line: 211, baseType: !7, size: 32, offset: 64)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1352, file: !873, line: 214, baseType: !751, size: 64, offset: 128)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1352, file: !873, line: 224, baseType: !1395, size: 64, offset: 192)
!1395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1396, size: 64)
!1396 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !873, line: 202, baseType: !1397)
!1397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !873, line: 202, size: 128, elements: !1398)
!1398 = !{!1399}
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1397, file: !873, line: 202, baseType: !1400, size: 128)
!1400 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !873, line: 200, baseType: !1401)
!1401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !873, line: 200, size: 128, elements: !1402)
!1402 = !{!1403, !1404, !1405}
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1401, file: !873, line: 200, baseType: !7, size: 32)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1401, file: !873, line: 200, baseType: !7, size: 32, offset: 32)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1401, file: !873, line: 200, baseType: !904, size: 64, offset: 64)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1352, file: !873, line: 234, baseType: !1395, size: 64, offset: 256)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1346, file: !873, line: 197, baseType: !751, size: 64, offset: 256)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !886, file: !873, line: 319, baseType: !758, size: 256)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !886, file: !873, line: 320, baseType: !777, size: 192)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !698, file: !318, line: 3384, baseType: !1411, size: 1472)
!1411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !318, line: 3114, size: 1472, elements: !1412)
!1412 = !{!1413, !1434, !1435, !1436, !1437}
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1411, file: !318, line: 3115, baseType: !1414, size: 1216)
!1414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !318, line: 2984, size: 1216, elements: !1415)
!1415 = !{!1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433}
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1414, file: !318, line: 2985, baseType: !866, size: 960)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1414, file: !318, line: 2986, baseType: !695, size: 64, offset: 960)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1414, file: !318, line: 2987, baseType: !695, size: 64, offset: 1024)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1414, file: !318, line: 2988, baseType: !695, size: 64, offset: 1088)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1414, file: !318, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1414, file: !318, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1414, file: !318, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1414, file: !318, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1414, file: !318, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1414, file: !318, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1414, file: !318, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1414, file: !318, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1414, file: !318, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1414, file: !318, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1414, file: !318, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1414, file: !318, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1414, file: !318, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1414, file: !318, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1411, file: !318, line: 3117, baseType: !695, size: 64, offset: 1216)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1411, file: !318, line: 3119, baseType: !695, size: 64, offset: 1280)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1411, file: !318, line: 3121, baseType: !695, size: 64, offset: 1344)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1411, file: !318, line: 3123, baseType: !695, size: 64, offset: 1408)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !698, file: !318, line: 3385, baseType: !1439, size: 1088)
!1439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !318, line: 2874, size: 1088, elements: !1440)
!1440 = !{!1441, !1442, !1443}
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1439, file: !318, line: 2875, baseType: !866, size: 960)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1439, file: !318, line: 2876, baseType: !870, size: 64, offset: 960)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1439, file: !318, line: 2877, baseType: !1444, size: 64, offset: 1024)
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1445, size: 64)
!1445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1446, line: 172, size: 128, elements: !1447)
!1446 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1447 = !{!1448, !1449, !1450, !1451, !1452, !1453, !1454}
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1445, file: !1446, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1445, file: !1446, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1445, file: !1446, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1445, file: !1446, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1445, file: !1446, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1445, file: !1446, line: 195, baseType: !7, size: 32, offset: 32)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1445, file: !1446, line: 199, baseType: !695, size: 64, offset: 64)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !698, file: !318, line: 3386, baseType: !1414, size: 1216)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !698, file: !318, line: 3387, baseType: !1457, size: 1280)
!1457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !318, line: 3093, size: 1280, elements: !1458)
!1458 = !{!1459, !1460}
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1457, file: !318, line: 3094, baseType: !1414, size: 1216)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1457, file: !318, line: 3095, baseType: !1444, size: 64, offset: 1216)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !698, file: !318, line: 3388, baseType: !1462, size: 1216)
!1462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !318, line: 2824, size: 1216, elements: !1463)
!1463 = !{!1464, !1465, !1466, !1467, !1468, !1469}
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1462, file: !318, line: 2825, baseType: !828, size: 896)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1462, file: !318, line: 2827, baseType: !695, size: 64, offset: 896)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1462, file: !318, line: 2828, baseType: !695, size: 64, offset: 960)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1462, file: !318, line: 2829, baseType: !695, size: 64, offset: 1024)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1462, file: !318, line: 2830, baseType: !695, size: 64, offset: 1088)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1462, file: !318, line: 2831, baseType: !695, size: 64, offset: 1152)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !698, file: !318, line: 3389, baseType: !1471, size: 1024)
!1471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !318, line: 2850, size: 1024, elements: !1472)
!1472 = !{!1473, !1474, !1475}
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1471, file: !318, line: 2851, baseType: !866, size: 960)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1471, file: !318, line: 2852, baseType: !683, size: 32, offset: 960)
