; ModuleID = 'ipa-inline.bc'
source_filename = "ipa-inline.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.cgraph_node = type { %union.tree_node*, %struct.cgraph_edge*, %struct.cgraph_edge*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.htab*, i8*, %struct.VEC_ipa_opt_pass_heap*, %struct.cgraph_local_info, %struct.cgraph_global_info, %struct.cgraph_rtl_info, %struct.cgraph_clone_info, %struct.cgraph_thunk_info, i64, i32, i32, i32, i16 }
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }

!638 = !DIEnumerator(name: "GIMPLE_INVALID_RHS", value: 0, isUnsigned: true)
!639 = !DIEnumerator(name: "GIMPLE_BINARY_RHS", value: 1, isUnsigned: true)
!640 = !DIEnumerator(name: "GIMPLE_UNARY_RHS", value: 2, isUnsigned: true)
!641 = !DIEnumerator(name: "GIMPLE_SINGLE_RHS", value: 3, isUnsigned: true)
!642 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !598, line: 727, baseType: !7, size: 32, elements: !643)
!643 = !{!644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667}
!644 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!645 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!646 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!647 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!648 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!649 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!650 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!651 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!652 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!653 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!654 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!655 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!656 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!657 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!658 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!659 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!660 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!661 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!662 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!663 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!664 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!665 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!666 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!667 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!668 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ipa_lattice_type", file: !669, line: 66, baseType: !7, size: 32, elements: !670)
!669 = !DIFile(filename: "./ipa-prop.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!670 = !{!671, !672, !673}
!671 = !DIEnumerator(name: "IPA_BOTTOM", value: 0, isUnsigned: true)
!672 = !DIEnumerator(name: "IPA_CONST_VALUE", value: 1, isUnsigned: true)
!673 = !DIEnumerator(name: "IPA_TOP", value: 2, isUnsigned: true)
!674 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "jump_func_type", file: !669, line: 48, baseType: !7, size: 32, elements: !675)
!675 = !{!676, !677, !678, !679, !680}
!676 = !DIEnumerator(name: "IPA_JF_UNKNOWN", value: 0, isUnsigned: true)
!677 = !DIEnumerator(name: "IPA_JF_CONST", value: 1, isUnsigned: true)
!678 = !DIEnumerator(name: "IPA_JF_CONST_MEMBER_PTR", value: 2, isUnsigned: true)
!679 = !DIEnumerator(name: "IPA_JF_PASS_THROUGH", value: 3, isUnsigned: true)
!680 = !DIEnumerator(name: "IPA_JF_ANCESTOR", value: 4, isUnsigned: true)
!681 = !{!682, !683, !684, !685, !688, !689, !691, !590, !693, !696, !134, !636, !757, !2084, !877, !1384, !686, !2086, !2092, !2316, !2317, !2318, !692, !2331, !7, !2345, !2390}
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!684 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !687)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !337, line: 119, baseType: !692)
!692 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !694, line: 46, baseType: !695)
!694 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!695 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !697, line: 47, baseType: !698)
!697 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !700, line: 75, size: 256, elements: !701)
!700 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!701 = !{!702, !716, !717, !718}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !699, file: !700, line: 76, baseType: !703, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !700, line: 68, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !700, line: 63, size: 320, elements: !706)
!706 = !{!707, !709, !710, !711}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !705, file: !700, line: 64, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !705, file: !700, line: 65, baseType: !708, size: 64, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !705, file: !700, line: 66, baseType: !7, size: 32, offset: 128)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !705, file: !700, line: 67, baseType: !712, size: 128, offset: 192)
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !713, size: 128, elements: !714)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !700, line: 29, baseType: !695)
!714 = !{!715}
!715 = !DISubrange(count: 2)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !699, file: !700, line: 77, baseType: !703, size: 64, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !699, file: !700, line: 78, baseType: !7, size: 32, offset: 128)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !699, file: !700, line: 79, baseType: !719, size: 64, offset: 192)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !700, line: 49, baseType: !721)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !700, line: 45, size: 832, elements: !722)
!722 = !{!723, !724, !725}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !721, file: !700, line: 46, baseType: !708, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !721, file: !700, line: 47, baseType: !698, size: 64, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !721, file: !700, line: 48, baseType: !726, size: 704, offset: 128)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !727, line: 164, size: 704, elements: !728)
!727 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!728 = !{!729, !730, !740, !741, !742, !743, !744, !745, !749, !753, !754, !755, !756}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !726, file: !727, line: 166, baseType: !692, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !726, file: !727, line: 167, baseType: !731, size: 64, offset: 64)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !727, line: 157, size: 192, elements: !733)
!733 = !{!734, !735, !736}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !732, file: !727, line: 159, baseType: !686, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !732, file: !727, line: 160, baseType: !731, size: 64, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !732, file: !727, line: 161, baseType: !737, size: 32, offset: 128)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !687, size: 32, elements: !738)
!738 = !{!739}
!739 = !DISubrange(count: 4)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !726, file: !727, line: 168, baseType: !686, size: 64, offset: 128)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !726, file: !727, line: 169, baseType: !686, size: 64, offset: 192)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !726, file: !727, line: 170, baseType: !686, size: 64, offset: 256)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !726, file: !727, line: 171, baseType: !692, size: 64, offset: 320)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !726, file: !727, line: 172, baseType: !684, size: 32, offset: 384)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !726, file: !727, line: 176, baseType: !746, size: 64, offset: 448)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{!731, !688, !692}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !726, file: !727, line: 177, baseType: !750, size: 64, offset: 512)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DISubroutineType(types: !752)
!752 = !{null, !688, !731}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !726, file: !727, line: 178, baseType: !688, size: 64, offset: 576)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !726, file: !727, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !726, file: !727, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !726, file: !727, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !598, line: 737, size: 768, elements: !759)
!759 = !{!760, !1931, !1941, !1947, !1952, !1957, !1964, !1970, !1976, !1981, !1995, !2000, !2006, !2011, !2021, !2026, !2042, !2049, !2056, !2062, !2067, !2073, !2079}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !758, file: !598, line: 738, baseType: !761, size: 256)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !598, line: 271, size: 256, elements: !762)
!762 = !{!763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !778, !779, !1930}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !761, file: !598, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !761, file: !598, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !761, file: !598, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !761, file: !598, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !761, file: !598, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !761, file: !598, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !761, file: !598, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !761, file: !598, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !761, file: !598, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !761, file: !598, line: 312, baseType: !7, size: 32, offset: 32)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !761, file: !598, line: 316, baseType: !774, size: 32, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !775, line: 58, baseType: !776)
!775 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !777, line: 44, baseType: !7)
!777 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!778 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !761, file: !598, line: 319, baseType: !7, size: 32, offset: 96)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !761, file: !598, line: 323, baseType: !780, size: 64, offset: 128)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !337, line: 217, size: 832, elements: !782)
!782 = !{!783, !1895, !1896, !1897, !1900, !1904, !1905, !1906, !1924, !1925, !1926, !1927, !1928, !1929}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !781, file: !337, line: 219, baseType: !784, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !337, line: 151, baseType: !786)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !337, line: 151, size: 128, elements: !787)
!787 = !{!788}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !786, file: !337, line: 151, baseType: !789, size: 128)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !337, line: 150, baseType: !790)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !337, line: 150, size: 128, elements: !791)
!791 = !{!792, !793, !794}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !790, file: !337, line: 150, baseType: !7, size: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !790, file: !337, line: 150, baseType: !7, size: 32, offset: 32)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !790, file: !337, line: 150, baseType: !795, size: 64, offset: 64)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !796, size: 64, elements: !857)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !697, line: 108, baseType: !797)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !337, line: 122, size: 512, elements: !799)
!799 = !{!800, !801, !802, !1888, !1889, !1890, !1891, !1892, !1893, !1894}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !798, file: !337, line: 124, baseType: !780, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !798, file: !337, line: 125, baseType: !780, size: 64, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !798, file: !337, line: 131, baseType: !803, size: 64, offset: 128)
!803 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !337, line: 128, size: 64, elements: !804)
!804 = !{!805, !821}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !803, file: !337, line: 129, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !697, line: 66, baseType: !807)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !598, line: 143, size: 192, elements: !809)
!809 = !{!810, !819, !820}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !808, file: !598, line: 145, baseType: !811, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !697, line: 69, baseType: !812)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !598, line: 136, size: 192, elements: !814)
!814 = !{!815, !817, !818}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !813, file: !598, line: 137, baseType: !816, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !697, line: 58, baseType: !757)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !813, file: !598, line: 138, baseType: !812, size: 64, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !813, file: !598, line: 139, baseType: !812, size: 64, offset: 128)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !808, file: !598, line: 146, baseType: !811, size: 64, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !808, file: !598, line: 152, baseType: !806, size: 64, offset: 128)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !803, file: !337, line: 130, baseType: !822, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !697, line: 50, baseType: !823)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !825, line: 240, size: 384, elements: !826)
!825 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!826 = !{!827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !824, file: !825, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !824, file: !825, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !824, file: !825, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !824, file: !825, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !824, file: !825, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !824, file: !825, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !824, file: !825, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !824, file: !825, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !824, file: !825, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !824, file: !825, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !824, file: !825, line: 321, baseType: !838, size: 320, offset: 64)
!838 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !825, line: 315, size: 320, elements: !839)
!839 = !{!840, !1855, !1857, !1886, !1887}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !838, file: !825, line: 316, baseType: !841, size: 64)
!841 = !DICompositeType(tag: DW_TAG_array_type, baseType: !842, size: 64, elements: !857)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !825, line: 183, baseType: !843)
!843 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !825, line: 166, size: 64, elements: !844)
!844 = !{!845, !846, !847, !848, !849, !859, !860, !872, !875, !876, !1833, !1834, !1845, !1852}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !843, file: !825, line: 168, baseType: !684, size: 32)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !843, file: !825, line: 169, baseType: !7, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !843, file: !825, line: 170, baseType: !689, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !843, file: !825, line: 171, baseType: !822, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !843, file: !825, line: 172, baseType: !850, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !697, line: 53, baseType: !851)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !825, line: 359, size: 128, elements: !853)
!853 = !{!854, !855}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !852, file: !825, line: 360, baseType: !684, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !852, file: !825, line: 361, baseType: !856, size: 64, offset: 64)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !822, size: 64, elements: !857)
!857 = !{!858}
!858 = !DISubrange(count: 1)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !843, file: !825, line: 173, baseType: !5, size: 32)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !843, file: !825, line: 174, baseType: !861, size: 32)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !825, line: 133, baseType: !862)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !825, line: 115, size: 32, elements: !863)
!863 = !{!864, !865, !866, !867, !868, !869, !870, !871}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !862, file: !825, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !862, file: !825, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !862, file: !825, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !862, file: !825, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !862, file: !825, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !862, file: !825, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !862, file: !825, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !862, file: !825, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !843, file: !825, line: 175, baseType: !873, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !825, line: 175, flags: DIFlagFwdDecl)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !843, file: !825, line: 176, baseType: !698, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !843, file: !825, line: 177, baseType: !877, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !697, line: 56, baseType: !878)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !135, line: 3371, size: 1792, elements: !880)
!880 = !{!881, !914, !920, !931, !950, !961, !966, !973, !979, !992, !1000, !1038, !1043, !1071, !1088, !1089, !1094, !1103, !1109, !1114, !1118, !1122, !1482, !1531, !1537, !1543, !1550, !1563, !1577, !1594, !1606, !1628, !1643, !1815}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !879, file: !135, line: 3372, baseType: !882, size: 64)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !135, line: 360, size: 64, elements: !883)
!883 = !{!884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !882, file: !135, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !882, file: !135, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !882, file: !135, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !882, file: !135, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !882, file: !135, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !882, file: !135, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !882, file: !135, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !882, file: !135, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !882, file: !135, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !882, file: !135, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !882, file: !135, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !882, file: !135, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !882, file: !135, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !882, file: !135, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !882, file: !135, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !882, file: !135, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !882, file: !135, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !882, file: !135, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !882, file: !135, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !882, file: !135, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !882, file: !135, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !882, file: !135, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !882, file: !135, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !882, file: !135, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !882, file: !135, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !882, file: !135, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !882, file: !135, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !882, file: !135, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !882, file: !135, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !882, file: !135, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !879, file: !135, line: 3373, baseType: !915, size: 192)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !135, line: 402, size: 192, elements: !916)
!916 = !{!917, !918, !919}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !915, file: !135, line: 403, baseType: !882, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !915, file: !135, line: 404, baseType: !877, size: 64, offset: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !915, file: !135, line: 405, baseType: !877, size: 64, offset: 128)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !879, file: !135, line: 3374, baseType: !921, size: 320)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !135, line: 1384, size: 320, elements: !922)
!922 = !{!923, !924}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !921, file: !135, line: 1385, baseType: !915, size: 192)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !921, file: !135, line: 1386, baseType: !925, size: 128, offset: 192)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !926, line: 58, baseType: !927)
!926 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !926, line: 54, size: 128, elements: !928)
!928 = !{!929, !930}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !927, file: !926, line: 56, baseType: !695, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !927, file: !926, line: 57, baseType: !692, size: 64, offset: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !879, file: !135, line: 3375, baseType: !932, size: 256)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !135, line: 1397, size: 256, elements: !933)
!933 = !{!934, !935}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !932, file: !135, line: 1398, baseType: !915, size: 192)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !932, file: !135, line: 1399, baseType: !936, size: 64, offset: 192)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !938, line: 52, size: 256, elements: !939)
!938 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!939 = !{!940, !941, !942, !943, !944, !945, !946}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !937, file: !938, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !937, file: !938, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !937, file: !938, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !937, file: !938, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !937, file: !938, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !937, file: !938, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !937, file: !938, line: 62, baseType: !947, size: 192, offset: 64)
!947 = !DICompositeType(tag: DW_TAG_array_type, baseType: !695, size: 192, elements: !948)
!948 = !{!949}
!949 = !DISubrange(count: 3)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !879, file: !135, line: 3376, baseType: !951, size: 256)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !135, line: 1408, size: 256, elements: !952)
!952 = !{!953, !954}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !951, file: !135, line: 1409, baseType: !915, size: 192)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !951, file: !135, line: 1410, baseType: !955, size: 64, offset: 192)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !957, line: 27, size: 192, elements: !958)
!957 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!958 = !{!959, !960}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !956, file: !957, line: 29, baseType: !925, size: 128)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !956, file: !957, line: 30, baseType: !5, size: 32, offset: 128)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !879, file: !135, line: 3377, baseType: !962, size: 256)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !135, line: 1437, size: 256, elements: !963)
!963 = !{!964, !965}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !962, file: !135, line: 1438, baseType: !915, size: 192)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !962, file: !135, line: 1439, baseType: !877, size: 64, offset: 192)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !879, file: !135, line: 3378, baseType: !967, size: 256)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !135, line: 1418, size: 256, elements: !968)
!968 = !{!969, !970, !971}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !967, file: !135, line: 1419, baseType: !915, size: 192)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !967, file: !135, line: 1420, baseType: !684, size: 32, offset: 192)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !967, file: !135, line: 1421, baseType: !972, size: 8, offset: 224)
!972 = !DICompositeType(tag: DW_TAG_array_type, baseType: !687, size: 8, elements: !857)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !879, file: !135, line: 3379, baseType: !974, size: 320)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !135, line: 1428, size: 320, elements: !975)
!975 = !{!976, !977, !978}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !974, file: !135, line: 1429, baseType: !915, size: 192)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !974, file: !135, line: 1430, baseType: !877, size: 64, offset: 192)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !974, file: !135, line: 1431, baseType: !877, size: 64, offset: 256)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !879, file: !135, line: 3380, baseType: !980, size: 320)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !135, line: 1460, size: 320, elements: !981)
!981 = !{!982, !983}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !980, file: !135, line: 1461, baseType: !915, size: 192)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !980, file: !135, line: 1462, baseType: !984, size: 128, offset: 192)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !985, line: 31, size: 128, elements: !986)
!985 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!986 = !{!987, !990, !991}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !984, file: !985, line: 32, baseType: !988, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !683)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !984, file: !985, line: 33, baseType: !7, size: 32, offset: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !984, file: !985, line: 34, baseType: !7, size: 32, offset: 96)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !879, file: !135, line: 3381, baseType: !993, size: 384)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !135, line: 2507, size: 384, elements: !994)
!994 = !{!995, !996, !997, !998, !999}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !993, file: !135, line: 2508, baseType: !915, size: 192)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !993, file: !135, line: 2509, baseType: !774, size: 32, offset: 192)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !993, file: !135, line: 2510, baseType: !7, size: 32, offset: 224)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !993, file: !135, line: 2511, baseType: !877, size: 64, offset: 256)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !993, file: !135, line: 2512, baseType: !877, size: 64, offset: 320)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !879, file: !135, line: 3382, baseType: !1001, size: 896)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !135, line: 2652, size: 896, elements: !1002)
!1002 = !{!1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1001, file: !135, line: 2653, baseType: !993, size: 384)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1001, file: !135, line: 2654, baseType: !877, size: 64, offset: 384)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1001, file: !135, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1001, file: !135, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1001, file: !135, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1001, file: !135, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1001, file: !135, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1001, file: !135, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1001, file: !135, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1001, file: !135, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1001, file: !135, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1001, file: !135, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1001, file: !135, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1001, file: !135, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1001, file: !135, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1001, file: !135, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1001, file: !135, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1001, file: !135, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1001, file: !135, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1001, file: !135, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1001, file: !135, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1001, file: !135, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1001, file: !135, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1001, file: !135, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1001, file: !135, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1001, file: !135, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1001, file: !135, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1001, file: !135, line: 2703, baseType: !7, size: 32, offset: 512)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1001, file: !135, line: 2705, baseType: !877, size: 64, offset: 576)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1001, file: !135, line: 2706, baseType: !877, size: 64, offset: 640)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1001, file: !135, line: 2707, baseType: !877, size: 64, offset: 704)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1001, file: !135, line: 2708, baseType: !877, size: 64, offset: 768)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1001, file: !135, line: 2711, baseType: !1036, size: 64, offset: 832)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !135, line: 2711, flags: DIFlagFwdDecl)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !879, file: !135, line: 3383, baseType: !1039, size: 960)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !135, line: 2756, size: 960, elements: !1040)
!1040 = !{!1041, !1042}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1039, file: !135, line: 2757, baseType: !1001, size: 896)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1039, file: !135, line: 2758, baseType: !822, size: 64, offset: 896)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !879, file: !135, line: 3384, baseType: !1044, size: 1472)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !135, line: 3114, size: 1472, elements: !1045)
!1045 = !{!1046, !1067, !1068, !1069, !1070}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1044, file: !135, line: 3115, baseType: !1047, size: 1216)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !135, line: 2984, size: 1216, elements: !1048)
!1048 = !{!1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1047, file: !135, line: 2985, baseType: !1039, size: 960)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1047, file: !135, line: 2986, baseType: !877, size: 64, offset: 960)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1047, file: !135, line: 2987, baseType: !877, size: 64, offset: 1024)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1047, file: !135, line: 2988, baseType: !877, size: 64, offset: 1088)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1047, file: !135, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1047, file: !135, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1047, file: !135, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1047, file: !135, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1047, file: !135, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1047, file: !135, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1047, file: !135, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1047, file: !135, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1047, file: !135, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1047, file: !135, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1047, file: !135, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1047, file: !135, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1047, file: !135, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1047, file: !135, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1044, file: !135, line: 3117, baseType: !877, size: 64, offset: 1216)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1044, file: !135, line: 3119, baseType: !877, size: 64, offset: 1280)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1044, file: !135, line: 3121, baseType: !877, size: 64, offset: 1344)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1044, file: !135, line: 3123, baseType: !877, size: 64, offset: 1408)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !879, file: !135, line: 3385, baseType: !1072, size: 1088)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !135, line: 2874, size: 1088, elements: !1073)
!1073 = !{!1074, !1075, !1076}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1072, file: !135, line: 2875, baseType: !1039, size: 960)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1072, file: !135, line: 2876, baseType: !822, size: 64, offset: 960)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1072, file: !135, line: 2877, baseType: !1077, size: 64, offset: 1024)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1079, line: 172, size: 128, elements: !1080)
!1079 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1080 = !{!1081, !1082, !1083, !1084, !1085, !1086, !1087}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1078, file: !1079, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1078, file: !1079, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1078, file: !1079, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1078, file: !1079, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1078, file: !1079, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1078, file: !1079, line: 195, baseType: !7, size: 32, offset: 32)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1078, file: !1079, line: 199, baseType: !877, size: 64, offset: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !879, file: !135, line: 3386, baseType: !1047, size: 1216)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !879, file: !135, line: 3387, baseType: !1090, size: 1280)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !135, line: 3093, size: 1280, elements: !1091)
!1091 = !{!1092, !1093}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1090, file: !135, line: 3094, baseType: !1047, size: 1216)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1090, file: !135, line: 3095, baseType: !1077, size: 64, offset: 1216)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !879, file: !135, line: 3388, baseType: !1095, size: 1216)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !135, line: 2824, size: 1216, elements: !1096)
!1096 = !{!1097, !1098, !1099, !1100, !1101, !1102}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1095, file: !135, line: 2825, baseType: !1001, size: 896)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1095, file: !135, line: 2827, baseType: !877, size: 64, offset: 896)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1095, file: !135, line: 2828, baseType: !877, size: 64, offset: 960)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1095, file: !135, line: 2829, baseType: !877, size: 64, offset: 1024)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1095, file: !135, line: 2830, baseType: !877, size: 64, offset: 1088)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1095, file: !135, line: 2831, baseType: !877, size: 64, offset: 1152)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !879, file: !135, line: 3389, baseType: !1104, size: 1024)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !135, line: 2850, size: 1024, elements: !1105)
!1105 = !{!1106, !1107, !1108}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1104, file: !135, line: 2851, baseType: !1039, size: 960)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1104, file: !135, line: 2852, baseType: !684, size: 32, offset: 960)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1104, file: !135, line: 2853, baseType: !684, size: 32, offset: 992)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !879, file: !135, line: 3390, baseType: !1110, size: 1024)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !135, line: 2857, size: 1024, elements: !1111)
!1111 = !{!1112, !1113}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1110, file: !135, line: 2858, baseType: !1039, size: 960)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1110, file: !135, line: 2859, baseType: !1077, size: 64, offset: 960)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !879, file: !135, line: 3391, baseType: !1115, size: 960)
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !135, line: 2862, size: 960, elements: !1116)
!1116 = !{!1117}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1115, file: !135, line: 2863, baseType: !1039, size: 960)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !879, file: !135, line: 3392, baseType: !1119, size: 1472)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !135, line: 3304, size: 1472, elements: !1120)
!1120 = !{!1121}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1119, file: !135, line: 3305, baseType: !1044, size: 1472)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !879, file: !135, line: 3393, baseType: !1123, size: 1792)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !135, line: 3248, size: 1792, elements: !1124)
!1124 = !{!1125, !1126, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1123, file: !135, line: 3249, baseType: !1044, size: 1472)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1123, file: !135, line: 3251, baseType: !1127, size: 64, offset: 1472)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1129, line: 463, size: 1152, elements: !1130)
!1129 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1130 = !{!1131, !1293, !1324, !1325, !1402, !1405, !1406, !1407, !1408, !1409, !1410, !1434, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1128, file: !1129, line: 464, baseType: !1132, size: 64)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !330, line: 194, size: 384, elements: !1134)
!1134 = !{!1135, !1184, !1197, !1211, !1261, !1274}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !1133, file: !330, line: 197, baseType: !1136, size: 64)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !330, line: 182, baseType: !1137)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !330, line: 116, size: 704, elements: !1139)
!1139 = !{!1140, !1141, !1142, !1143, !1144, !1145, !1172, !1181, !1182, !1183}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !1138, file: !330, line: 119, baseType: !1137, size: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1138, file: !330, line: 122, baseType: !1137, size: 64, offset: 64)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !1138, file: !330, line: 123, baseType: !1137, size: 64, offset: 128)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1138, file: !330, line: 126, baseType: !684, size: 32, offset: 192)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1138, file: !330, line: 129, baseType: !329, size: 32, offset: 224)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1138, file: !330, line: 165, baseType: !1146, size: 192, offset: 256)
!1146 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !330, line: 132, size: 192, elements: !1147)
!1147 = !{!1148, !1161, !1167}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !1146, file: !330, line: 137, baseType: !1149, size: 128)
!1149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !330, line: 133, size: 128, elements: !1150)
!1150 = !{!1151, !1160}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !1149, file: !330, line: 135, baseType: !1152, size: 64)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !330, line: 93, size: 320, elements: !1154)
!1154 = !{!1155, !1156, !1157, !1158, !1159}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !1153, file: !330, line: 96, baseType: !1152, size: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !1153, file: !330, line: 97, baseType: !1152, size: 64, offset: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1153, file: !330, line: 101, baseType: !877, size: 64, offset: 128)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !1153, file: !330, line: 106, baseType: !877, size: 64, offset: 192)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1153, file: !330, line: 111, baseType: !877, size: 64, offset: 256)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !1149, file: !330, line: 136, baseType: !1152, size: 64, offset: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !1146, file: !330, line: 151, baseType: !1162, size: 192)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !330, line: 139, size: 192, elements: !1163)
!1163 = !{!1164, !1165, !1166}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1162, file: !330, line: 141, baseType: !877, size: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1162, file: !330, line: 145, baseType: !877, size: 64, offset: 64)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1162, file: !330, line: 150, baseType: !684, size: 32, offset: 128)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !1146, file: !330, line: 164, baseType: !1168, size: 128)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !330, line: 153, size: 128, elements: !1169)
!1169 = !{!1170, !1171}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !1168, file: !330, line: 161, baseType: !877, size: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !1168, file: !330, line: 163, baseType: !774, size: 32, offset: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !1138, file: !330, line: 168, baseType: !1173, size: 64, offset: 448)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64)
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !330, line: 67, size: 320, elements: !1175)
!1175 = !{!1176, !1177, !1178, !1179, !1180}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !1174, file: !330, line: 70, baseType: !1173, size: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1174, file: !330, line: 73, baseType: !1137, size: 64, offset: 64)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !1174, file: !330, line: 78, baseType: !877, size: 64, offset: 128)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !1174, file: !330, line: 85, baseType: !822, size: 64, offset: 192)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1174, file: !330, line: 88, baseType: !684, size: 32, offset: 256)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !1138, file: !330, line: 173, baseType: !822, size: 64, offset: 512)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !1138, file: !330, line: 173, baseType: !822, size: 64, offset: 576)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !1138, file: !330, line: 177, baseType: !683, size: 8, offset: 640)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !1133, file: !330, line: 200, baseType: !1185, size: 64, offset: 64)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64)
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !330, line: 185, baseType: !1187)
!1187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !330, line: 185, size: 128, elements: !1188)
!1188 = !{!1189}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1187, file: !330, line: 185, baseType: !1190, size: 128)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !330, line: 184, baseType: !1191)
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !330, line: 184, size: 128, elements: !1192)
!1192 = !{!1193, !1194, !1195}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1191, file: !330, line: 184, baseType: !7, size: 32)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1191, file: !330, line: 184, baseType: !7, size: 32, offset: 32)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1191, file: !330, line: 184, baseType: !1196, size: 64, offset: 64)
!1196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1136, size: 64, elements: !857)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !1133, file: !330, line: 203, baseType: !1198, size: 64, offset: 128)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64)
!1199 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !330, line: 189, baseType: !1200)
!1200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !330, line: 189, size: 128, elements: !1201)
!1201 = !{!1202}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1200, file: !330, line: 189, baseType: !1203, size: 128)
!1203 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !330, line: 188, baseType: !1204)
!1204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !330, line: 188, size: 128, elements: !1205)
!1205 = !{!1206, !1207, !1208}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1204, file: !330, line: 188, baseType: !7, size: 32)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1204, file: !330, line: 188, baseType: !7, size: 32, offset: 32)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1204, file: !330, line: 188, baseType: !1209, size: 64, offset: 64)
!1209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1210, size: 64, elements: !857)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !330, line: 180, baseType: !1173)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !1133, file: !330, line: 207, baseType: !1212, size: 64, offset: 192)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1213, line: 144, baseType: !1214)
!1213 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64)
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1213, line: 100, size: 896, elements: !1216)
!1216 = !{!1217, !1225, !1230, !1235, !1237, !1238, !1239, !1240, !1241, !1242, !1247, !1249, !1250, !1255, !1260}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1215, file: !1213, line: 102, baseType: !1218, size: 64)
!1218 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1213, line: 52, baseType: !1219)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64)
!1220 = !DISubroutineType(types: !1221)
!1221 = !{!1222, !1223}
!1222 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1213, line: 47, baseType: !7)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64)
!1224 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1215, file: !1213, line: 105, baseType: !1226, size: 64, offset: 64)
!1226 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1213, line: 59, baseType: !1227)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64)
!1228 = !DISubroutineType(types: !1229)
!1229 = !{!684, !1223, !1223}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1215, file: !1213, line: 108, baseType: !1231, size: 64, offset: 128)
!1231 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1213, line: 63, baseType: !1232)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64)
!1233 = !DISubroutineType(types: !1234)
!1234 = !{null, !688}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1215, file: !1213, line: 111, baseType: !1236, size: 64, offset: 192)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1215, file: !1213, line: 114, baseType: !693, size: 64, offset: 256)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1215, file: !1213, line: 117, baseType: !693, size: 64, offset: 320)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1215, file: !1213, line: 120, baseType: !693, size: 64, offset: 384)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1215, file: !1213, line: 124, baseType: !7, size: 32, offset: 448)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1215, file: !1213, line: 128, baseType: !7, size: 32, offset: 480)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1215, file: !1213, line: 131, baseType: !1243, size: 64, offset: 512)
!1243 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1213, line: 75, baseType: !1244)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64)
!1245 = !DISubroutineType(types: !1246)
!1246 = !{!688, !693, !693}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1215, file: !1213, line: 132, baseType: !1248, size: 64, offset: 576)
!1248 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1213, line: 78, baseType: !1232)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1215, file: !1213, line: 135, baseType: !688, size: 64, offset: 640)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1215, file: !1213, line: 136, baseType: !1251, size: 64, offset: 704)
!1251 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1213, line: 82, baseType: !1252)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64)
!1253 = !DISubroutineType(types: !1254)
!1254 = !{!688, !688, !693, !693}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1215, file: !1213, line: 137, baseType: !1256, size: 64, offset: 768)
!1256 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1213, line: 83, baseType: !1257)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64)
!1258 = !DISubroutineType(types: !1259)
!1259 = !{null, !688, !688}
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1215, file: !1213, line: 141, baseType: !7, size: 32, offset: 832)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !1133, file: !330, line: 211, baseType: !1262, size: 64, offset: 256)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64)
!1263 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !135, line: 183, baseType: !1264)
!1264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !135, line: 183, size: 128, elements: !1265)
!1265 = !{!1266}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1264, file: !135, line: 183, baseType: !1267, size: 128)
!1267 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !135, line: 182, baseType: !1268)
!1268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !135, line: 182, size: 128, elements: !1269)
!1269 = !{!1270, !1271, !1272}
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1268, file: !135, line: 182, baseType: !7, size: 32)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1268, file: !135, line: 182, baseType: !7, size: 32, offset: 32)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1268, file: !135, line: 182, baseType: !1273, size: 64, offset: 64)
!1273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !877, size: 64, elements: !857)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !1133, file: !330, line: 220, baseType: !1275, size: 64, offset: 320)
!1275 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !330, line: 217, size: 64, elements: !1276)
!1276 = !{!1277, !1278}
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !1275, file: !330, line: 218, baseType: !1262, size: 64)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !1275, file: !330, line: 219, baseType: !1279, size: 64)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64)
!1280 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !1281, line: 29, baseType: !1282)
!1281 = !DIFile(filename: "./vecprim.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !1281, line: 29, size: 96, elements: !1283)
!1283 = !{!1284}
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1282, file: !1281, line: 29, baseType: !1285, size: 96)
!1285 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !1281, line: 27, baseType: !1286)
!1286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !1281, line: 27, size: 96, elements: !1287)
!1287 = !{!1288, !1289, !1290}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1286, file: !1281, line: 27, baseType: !7, size: 32)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1286, file: !1281, line: 27, baseType: !7, size: 32, offset: 32)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1286, file: !1281, line: 27, baseType: !1291, size: 8, offset: 64)
!1291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1292, size: 8, elements: !857)
!1292 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !1281, line: 26, baseType: !683)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1128, file: !1129, line: 467, baseType: !1294, size: 64, offset: 64)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64)
!1295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !337, line: 374, size: 640, elements: !1296)
!1296 = !{!1297, !1299, !1300, !1313, !1314, !1315, !1316, !1317, !1318, !1320, !1322, !1323}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1295, file: !337, line: 377, baseType: !1298, size: 64)
!1298 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !697, line: 111, baseType: !780)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1295, file: !337, line: 378, baseType: !1298, size: 64, offset: 64)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1295, file: !337, line: 381, baseType: !1301, size: 64, offset: 128)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64)
!1302 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !337, line: 282, baseType: !1303)
!1303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !337, line: 282, size: 128, elements: !1304)
!1304 = !{!1305}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1303, file: !337, line: 282, baseType: !1306, size: 128)
!1306 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !337, line: 281, baseType: !1307)
!1307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !337, line: 281, size: 128, elements: !1308)
!1308 = !{!1309, !1310, !1311}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1307, file: !337, line: 281, baseType: !7, size: 32)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1307, file: !337, line: 281, baseType: !7, size: 32, offset: 32)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1307, file: !337, line: 281, baseType: !1312, size: 64, offset: 64)
!1312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1298, size: 64, elements: !857)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1295, file: !337, line: 384, baseType: !684, size: 32, offset: 192)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1295, file: !337, line: 387, baseType: !684, size: 32, offset: 224)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1295, file: !337, line: 390, baseType: !684, size: 32, offset: 256)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1295, file: !337, line: 394, baseType: !1301, size: 64, offset: 320)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1295, file: !337, line: 396, baseType: !336, size: 32, offset: 384)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1295, file: !337, line: 399, baseType: !1319, size: 64, offset: 416)
!1319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 64, elements: !714)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1295, file: !337, line: 402, baseType: !1321, size: 64, offset: 480)
!1321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !714)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1295, file: !337, line: 406, baseType: !684, size: 32, offset: 544)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1295, file: !337, line: 409, baseType: !684, size: 32, offset: 576)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1128, file: !1129, line: 470, baseType: !807, size: 64, offset: 128)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1128, file: !1129, line: 473, baseType: !1326, size: 64, offset: 192)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64)
!1327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1079, line: 39, size: 1152, elements: !1328)
!1328 = !{!1329, !1330, !1343, !1344, !1345, !1356, !1357, !1361, !1362, !1363, !1364, !1365}
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1327, file: !1079, line: 41, baseType: !1212, size: 64)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1327, file: !1079, line: 48, baseType: !1331, size: 64, offset: 64)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64)
!1332 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !598, line: 35, baseType: !1333)
!1333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !598, line: 35, size: 128, elements: !1334)
!1334 = !{!1335}
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1333, file: !598, line: 35, baseType: !1336, size: 128)
!1336 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !598, line: 33, baseType: !1337)
!1337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !598, line: 33, size: 128, elements: !1338)
!1338 = !{!1339, !1340, !1341}
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1337, file: !598, line: 33, baseType: !7, size: 32)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1337, file: !598, line: 33, baseType: !7, size: 32, offset: 32)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1337, file: !598, line: 33, baseType: !1342, size: 64, offset: 64)
!1342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !816, size: 64, elements: !857)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1327, file: !1079, line: 51, baseType: !1262, size: 64, offset: 128)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1327, file: !1079, line: 54, baseType: !877, size: 64, offset: 192)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1327, file: !1079, line: 57, baseType: !1346, size: 128, offset: 256)
!1346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1347, line: 31, size: 128, elements: !1348)
!1347 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1348 = !{!1349, !1350, !1351, !1352, !1353, !1354, !1355}
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1346, file: !1347, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1346, file: !1347, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1346, file: !1347, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1346, file: !1347, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1346, file: !1347, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1346, file: !1347, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1346, file: !1347, line: 56, baseType: !696, size: 64, offset: 64)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !1327, file: !1079, line: 60, baseType: !1346, size: 128, offset: 384)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !1327, file: !1079, line: 64, baseType: !1358, size: 64, offset: 512)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64)
!1359 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1360, line: 33, flags: DIFlagFwdDecl)
!1360 = !DIFile(filename: "./pointer-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !1327, file: !1079, line: 67, baseType: !877, size: 64, offset: 576)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !1327, file: !1079, line: 73, baseType: !1212, size: 64, offset: 640)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !1327, file: !1079, line: 77, baseType: !696, size: 64, offset: 704)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !1327, file: !1079, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !1327, file: !1079, line: 82, baseType: !1366, size: 320, offset: 832)
!1366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !1367, line: 62, size: 320, elements: !1368)
!1367 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1368 = !{!1369, !1375, !1376, !1377, !1378, !1385}
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1366, file: !1367, line: 63, baseType: !1370, size: 64)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64)
!1371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !1367, line: 56, size: 128, elements: !1372)
!1372 = !{!1373, !1374}
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1371, file: !1367, line: 57, baseType: !1370, size: 64)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1371, file: !1367, line: 58, baseType: !972, size: 8, offset: 64)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1366, file: !1367, line: 64, baseType: !7, size: 32, offset: 64)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1366, file: !1367, line: 66, baseType: !7, size: 32, offset: 96)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1366, file: !1367, line: 68, baseType: !683, size: 8, offset: 128)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1366, file: !1367, line: 70, baseType: !1379, size: 64, offset: 192)
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64)
!1380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1367, line: 37, size: 128, elements: !1381)
!1381 = !{!1382, !1383}
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1380, file: !1367, line: 39, baseType: !1379, size: 64)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1380, file: !1367, line: 40, baseType: !1384, size: 64, offset: 64)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1366, file: !1367, line: 71, baseType: !1386, size: 64, offset: 256)
!1386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1387, size: 64)
!1387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1367, line: 45, size: 320, elements: !1388)
!1388 = !{!1389, !1390}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1387, file: !1367, line: 47, baseType: !1386, size: 64)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1387, file: !1367, line: 48, baseType: !1391, size: 256, offset: 64)
!1391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !135, line: 1883, size: 256, elements: !1392)
!1392 = !{!1393, !1395, !1396, !1401}
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1391, file: !135, line: 1884, baseType: !1394, size: 64)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1391, file: !135, line: 1885, baseType: !1394, size: 64, offset: 64)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1391, file: !135, line: 1891, baseType: !1397, size: 64, offset: 128)
!1397 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1391, file: !135, line: 1891, size: 64, elements: !1398)
!1398 = !{!1399, !1400}
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1397, file: !135, line: 1891, baseType: !816, size: 64)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1397, file: !135, line: 1891, baseType: !877, size: 64)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1391, file: !135, line: 1892, baseType: !1384, size: 64, offset: 192)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1128, file: !1129, line: 476, baseType: !1403, size: 64, offset: 256)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64)
!1404 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1129, line: 476, flags: DIFlagFwdDecl)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1128, file: !1129, line: 479, baseType: !1212, size: 64, offset: 320)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1128, file: !1129, line: 484, baseType: !877, size: 64, offset: 384)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1128, file: !1129, line: 488, baseType: !877, size: 64, offset: 448)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1128, file: !1129, line: 493, baseType: !877, size: 64, offset: 512)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1128, file: !1129, line: 496, baseType: !877, size: 64, offset: 576)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1128, file: !1129, line: 501, baseType: !1411, size: 64, offset: 640)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64)
!1412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !348, line: 2355, size: 576, elements: !1413)
!1413 = !{!1414, !1417, !1418, !1419, !1420, !1422, !1423, !1428, !1429, !1430, !1431, !1432, !1433}
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1412, file: !348, line: 2356, baseType: !1415, size: 64)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64)
!1416 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !348, line: 2356, flags: DIFlagFwdDecl)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1412, file: !348, line: 2357, baseType: !689, size: 64, offset: 64)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1412, file: !348, line: 2358, baseType: !684, size: 32, offset: 128)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1412, file: !348, line: 2359, baseType: !684, size: 32, offset: 160)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1412, file: !348, line: 2360, baseType: !1421, size: 128, offset: 192)
!1421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !684, size: 128, elements: !738)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1412, file: !348, line: 2364, baseType: !684, size: 32, offset: 320)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1412, file: !348, line: 2367, baseType: !1424, size: 128, offset: 384)
!1424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !348, line: 2349, size: 128, elements: !1425)
!1425 = !{!1426, !1427}
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1424, file: !348, line: 2351, baseType: !822, size: 64)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1424, file: !348, line: 2352, baseType: !692, size: 64, offset: 64)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1412, file: !348, line: 2371, baseType: !347, size: 32, offset: 512)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1412, file: !348, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1412, file: !348, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1412, file: !348, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1412, file: !348, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1412, file: !348, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1128, file: !1129, line: 504, baseType: !1435, size: 64, offset: 704)
!1435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1436, size: 64)
!1436 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1129, line: 504, flags: DIFlagFwdDecl)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1128, file: !1129, line: 507, baseType: !1212, size: 64, offset: 768)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1128, file: !1129, line: 510, baseType: !684, size: 32, offset: 832)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1128, file: !1129, line: 513, baseType: !684, size: 32, offset: 864)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1128, file: !1129, line: 516, baseType: !774, size: 32, offset: 896)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1128, file: !1129, line: 519, baseType: !774, size: 32, offset: 928)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1128, file: !1129, line: 522, baseType: !7, size: 32, offset: 960)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1128, file: !1129, line: 523, baseType: !7, size: 32, offset: 992)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1128, file: !1129, line: 528, baseType: !689, size: 64, offset: 1024)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1128, file: !1129, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1128, file: !1129, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1128, file: !1129, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1128, file: !1129, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1128, file: !1129, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1128, file: !1129, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1128, file: !1129, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1128, file: !1129, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1128, file: !1129, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1128, file: !1129, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1128, file: !1129, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1128, file: !1129, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1128, file: !1129, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1128, file: !1129, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1128, file: !1129, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
