; ModuleID = 'ipa-utils.bc'
source_filename = "ipa-utils.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.cgraph_node = type { %union.tree_node*, %struct.cgraph_edge*, %struct.cgraph_edge*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.htab*, i8*, %struct.VEC_ipa_opt_pass_heap*, %struct.cgraph_local_info, %struct.cgraph_global_info, %struct.cgraph_rtl_info, %struct.cgraph_clone_info, %struct.cgraph_thunk_info, i64, i32, i32, i32, i16 }
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }

!415 = !DIEnumerator(name: "TV_WEB", value: 135, isUnsigned: true)
!416 = !DIEnumerator(name: "TV_AUTO_INC_DEC", value: 136, isUnsigned: true)
!417 = !DIEnumerator(name: "TV_CSE2", value: 137, isUnsigned: true)
!418 = !DIEnumerator(name: "TV_BRANCH_PROB", value: 138, isUnsigned: true)
!419 = !DIEnumerator(name: "TV_VPT", value: 139, isUnsigned: true)
!420 = !DIEnumerator(name: "TV_COMBINE", value: 140, isUnsigned: true)
!421 = !DIEnumerator(name: "TV_IFCVT", value: 141, isUnsigned: true)
!422 = !DIEnumerator(name: "TV_REGMOVE", value: 142, isUnsigned: true)
!423 = !DIEnumerator(name: "TV_MODE_SWITCH", value: 143, isUnsigned: true)
!424 = !DIEnumerator(name: "TV_SMS", value: 144, isUnsigned: true)
!425 = !DIEnumerator(name: "TV_SCHED", value: 145, isUnsigned: true)
!426 = !DIEnumerator(name: "TV_LOCAL_ALLOC", value: 146, isUnsigned: true)
!427 = !DIEnumerator(name: "TV_GLOBAL_ALLOC", value: 147, isUnsigned: true)
!428 = !DIEnumerator(name: "TV_IRA", value: 148, isUnsigned: true)
!429 = !DIEnumerator(name: "TV_RELOAD", value: 149, isUnsigned: true)
!430 = !DIEnumerator(name: "TV_RELOAD_CSE_REGS", value: 150, isUnsigned: true)
!431 = !DIEnumerator(name: "TV_SEQABSTR", value: 151, isUnsigned: true)
!432 = !DIEnumerator(name: "TV_GCSE_AFTER_RELOAD", value: 152, isUnsigned: true)
!433 = !DIEnumerator(name: "TV_THREAD_PROLOGUE_AND_EPILOGUE", value: 153, isUnsigned: true)
!434 = !DIEnumerator(name: "TV_IFCVT2", value: 154, isUnsigned: true)
!435 = !DIEnumerator(name: "TV_COMBINE_STACK_ADJUST", value: 155, isUnsigned: true)
!436 = !DIEnumerator(name: "TV_PEEPHOLE2", value: 156, isUnsigned: true)
!437 = !DIEnumerator(name: "TV_RENAME_REGISTERS", value: 157, isUnsigned: true)
!438 = !DIEnumerator(name: "TV_CPROP_REGISTERS", value: 158, isUnsigned: true)
!439 = !DIEnumerator(name: "TV_SCHED2", value: 159, isUnsigned: true)
!440 = !DIEnumerator(name: "TV_MACH_DEP", value: 160, isUnsigned: true)
!441 = !DIEnumerator(name: "TV_DBR_SCHED", value: 161, isUnsigned: true)
!442 = !DIEnumerator(name: "TV_REORDER_BLOCKS", value: 162, isUnsigned: true)
!443 = !DIEnumerator(name: "TV_SHORTEN_BRANCH", value: 163, isUnsigned: true)
!444 = !DIEnumerator(name: "TV_REG_STACK", value: 164, isUnsigned: true)
!445 = !DIEnumerator(name: "TV_FINAL", value: 165, isUnsigned: true)
!446 = !DIEnumerator(name: "TV_SYMOUT", value: 166, isUnsigned: true)
!447 = !DIEnumerator(name: "TV_VAR_TRACKING", value: 167, isUnsigned: true)
!448 = !DIEnumerator(name: "TV_TREE_IFCOMBINE", value: 168, isUnsigned: true)
!449 = !DIEnumerator(name: "TV_PLUGIN_INIT", value: 169, isUnsigned: true)
!450 = !DIEnumerator(name: "TV_PLUGIN_RUN", value: 170, isUnsigned: true)
!451 = !DIEnumerator(name: "TV_REST_OF_COMPILATION", value: 171, isUnsigned: true)
!452 = !DIEnumerator(name: "TIMEVAR_LAST", value: 172, isUnsigned: true)
!453 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "availability", file: !248, line: 27, baseType: !5, size: 32, elements: !454)
!454 = !{!455, !456, !457, !458, !459}
!455 = !DIEnumerator(name: "AVAIL_UNSET", value: 0, isUnsigned: true)
!456 = !DIEnumerator(name: "AVAIL_NOT_AVAILABLE", value: 1, isUnsigned: true)
!457 = !DIEnumerator(name: "AVAIL_OVERWRITABLE", value: 2, isUnsigned: true)
!458 = !DIEnumerator(name: "AVAIL_AVAILABLE", value: 3, isUnsigned: true)
!459 = !DIEnumerator(name: "AVAIL_LOCAL", value: 4, isUnsigned: true)
!460 = !{!461, !462, !463, !464, !467, !468, !470, !1875, !1885, !1888, !471, !3}
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!463 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !466)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cgraph_node", file: !248, line: 181, size: 2496, elements: !473)
!473 = !{!474, !1650, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1790, !1812, !1822, !1826, !1852, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !472, file: !248, line: 182, baseType: !475, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !476, line: 56, baseType: !477)
!476 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !4, line: 3371, size: 1792, elements: !479)
!479 = !{!480, !513, !519, !532, !539, !546, !551, !560, !566, !579, !591, !629, !637, !665, !682, !683, !688, !697, !703, !708, !712, !716, !1299, !1348, !1354, !1360, !1367, !1380, !1394, !1411, !1423, !1445, !1460, !1632}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !478, file: !4, line: 3372, baseType: !481, size: 64)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !4, line: 360, size: 64, elements: !482)
!482 = !{!483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !481, file: !4, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !481, file: !4, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !481, file: !4, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !481, file: !4, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !481, file: !4, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !481, file: !4, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !481, file: !4, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !481, file: !4, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !481, file: !4, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !481, file: !4, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !481, file: !4, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !481, file: !4, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !481, file: !4, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !481, file: !4, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !481, file: !4, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !481, file: !4, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !481, file: !4, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !481, file: !4, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !481, file: !4, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !481, file: !4, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !481, file: !4, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !481, file: !4, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !481, file: !4, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !481, file: !4, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !481, file: !4, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !481, file: !4, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !481, file: !4, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !481, file: !4, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !481, file: !4, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !481, file: !4, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !478, file: !4, line: 3373, baseType: !514, size: 192)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !4, line: 402, size: 192, elements: !515)
!515 = !{!516, !517, !518}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !514, file: !4, line: 403, baseType: !481, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !514, file: !4, line: 404, baseType: !475, size: 64, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !514, file: !4, line: 405, baseType: !475, size: 64, offset: 128)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !478, file: !4, line: 3374, baseType: !520, size: 320)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !4, line: 1384, size: 320, elements: !521)
!521 = !{!522, !523}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !520, file: !4, line: 1385, baseType: !514, size: 192)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !520, file: !4, line: 1386, baseType: !524, size: 128, offset: 192)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !525, line: 58, baseType: !526)
!525 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !525, line: 54, size: 128, elements: !527)
!527 = !{!528, !530}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !526, file: !525, line: 56, baseType: !529, size: 64)
!529 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !526, file: !525, line: 57, baseType: !531, size: 64, offset: 64)
!531 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !478, file: !4, line: 3375, baseType: !533, size: 256)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !4, line: 1397, size: 256, elements: !534)
!534 = !{!535, !536}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !533, file: !4, line: 1398, baseType: !514, size: 192)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !533, file: !4, line: 1399, baseType: !537, size: 64, offset: 192)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !4, line: 1392, flags: DIFlagFwdDecl)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !478, file: !4, line: 3376, baseType: !540, size: 256)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !4, line: 1408, size: 256, elements: !541)
!541 = !{!542, !543}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !540, file: !4, line: 1409, baseType: !514, size: 192)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !540, file: !4, line: 1410, baseType: !544, size: 64, offset: 192)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !4, line: 1403, flags: DIFlagFwdDecl)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !478, file: !4, line: 3377, baseType: !547, size: 256)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !4, line: 1437, size: 256, elements: !548)
!548 = !{!549, !550}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !547, file: !4, line: 1438, baseType: !514, size: 192)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !547, file: !4, line: 1439, baseType: !475, size: 64, offset: 192)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !478, file: !4, line: 3378, baseType: !552, size: 256)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !4, line: 1418, size: 256, elements: !553)
!553 = !{!554, !555, !556}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !552, file: !4, line: 1419, baseType: !514, size: 192)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !552, file: !4, line: 1420, baseType: !463, size: 32, offset: 192)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !552, file: !4, line: 1421, baseType: !557, size: 8, offset: 224)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !466, size: 8, elements: !558)
!558 = !{!559}
!559 = !DISubrange(count: 1)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !478, file: !4, line: 3379, baseType: !561, size: 320)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !4, line: 1428, size: 320, elements: !562)
!562 = !{!563, !564, !565}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !561, file: !4, line: 1429, baseType: !514, size: 192)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !561, file: !4, line: 1430, baseType: !475, size: 64, offset: 192)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !561, file: !4, line: 1431, baseType: !475, size: 64, offset: 256)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !478, file: !4, line: 3380, baseType: !567, size: 320)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !4, line: 1460, size: 320, elements: !568)
!568 = !{!569, !570}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !567, file: !4, line: 1461, baseType: !514, size: 192)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !567, file: !4, line: 1462, baseType: !571, size: 128, offset: 192)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !572, line: 31, size: 128, elements: !573)
!572 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!573 = !{!574, !577, !578}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !571, file: !572, line: 32, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !462)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !571, file: !572, line: 33, baseType: !5, size: 32, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !571, file: !572, line: 34, baseType: !5, size: 32, offset: 96)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !478, file: !4, line: 3381, baseType: !580, size: 384)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !4, line: 2507, size: 384, elements: !581)
!581 = !{!582, !583, !588, !589, !590}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !580, file: !4, line: 2508, baseType: !514, size: 192)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !580, file: !4, line: 2509, baseType: !584, size: 32, offset: 192)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !585, line: 58, baseType: !586)
!585 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !587, line: 44, baseType: !5)
!587 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!588 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !580, file: !4, line: 2510, baseType: !5, size: 32, offset: 224)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !580, file: !4, line: 2511, baseType: !475, size: 64, offset: 256)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !580, file: !4, line: 2512, baseType: !475, size: 64, offset: 320)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !478, file: !4, line: 3382, baseType: !592, size: 896)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !4, line: 2652, size: 896, elements: !593)
!593 = !{!594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !592, file: !4, line: 2653, baseType: !580, size: 384)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !592, file: !4, line: 2654, baseType: !475, size: 64, offset: 384)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !592, file: !4, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !592, file: !4, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !592, file: !4, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !592, file: !4, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !592, file: !4, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !592, file: !4, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !592, file: !4, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !592, file: !4, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !592, file: !4, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !592, file: !4, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !592, file: !4, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !592, file: !4, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !592, file: !4, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !592, file: !4, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !592, file: !4, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !592, file: !4, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !592, file: !4, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !592, file: !4, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !592, file: !4, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !592, file: !4, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !592, file: !4, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !592, file: !4, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !592, file: !4, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !592, file: !4, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !592, file: !4, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !592, file: !4, line: 2703, baseType: !5, size: 32, offset: 512)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !592, file: !4, line: 2705, baseType: !475, size: 64, offset: 576)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !592, file: !4, line: 2706, baseType: !475, size: 64, offset: 640)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !592, file: !4, line: 2707, baseType: !475, size: 64, offset: 704)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !592, file: !4, line: 2708, baseType: !475, size: 64, offset: 768)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !592, file: !4, line: 2711, baseType: !627, size: 64, offset: 832)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !4, line: 2711, flags: DIFlagFwdDecl)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !478, file: !4, line: 3383, baseType: !630, size: 960)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !4, line: 2756, size: 960, elements: !631)
!631 = !{!632, !633}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !630, file: !4, line: 2757, baseType: !592, size: 896)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !630, file: !4, line: 2758, baseType: !634, size: 64, offset: 896)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !476, line: 50, baseType: !635)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !476, line: 49, flags: DIFlagFwdDecl)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !478, file: !4, line: 3384, baseType: !638, size: 1472)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !4, line: 3114, size: 1472, elements: !639)
!639 = !{!640, !661, !662, !663, !664}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !638, file: !4, line: 3115, baseType: !641, size: 1216)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !4, line: 2984, size: 1216, elements: !642)
!642 = !{!643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !641, file: !4, line: 2985, baseType: !630, size: 960)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !641, file: !4, line: 2986, baseType: !475, size: 64, offset: 960)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !641, file: !4, line: 2987, baseType: !475, size: 64, offset: 1024)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !641, file: !4, line: 2988, baseType: !475, size: 64, offset: 1088)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !641, file: !4, line: 2991, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !641, file: !4, line: 2992, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !641, file: !4, line: 2993, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !641, file: !4, line: 2994, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !641, file: !4, line: 2995, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !641, file: !4, line: 2996, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !641, file: !4, line: 2998, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !641, file: !4, line: 3000, baseType: !5, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !641, file: !4, line: 3002, baseType: !5, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !641, file: !4, line: 3003, baseType: !5, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !641, file: !4, line: 3004, baseType: !5, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !641, file: !4, line: 3005, baseType: !5, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !641, file: !4, line: 3007, baseType: !5, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !641, file: !4, line: 3010, baseType: !5, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !638, file: !4, line: 3117, baseType: !475, size: 64, offset: 1216)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !638, file: !4, line: 3119, baseType: !475, size: 64, offset: 1280)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !638, file: !4, line: 3121, baseType: !475, size: 64, offset: 1344)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !638, file: !4, line: 3123, baseType: !475, size: 64, offset: 1408)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !478, file: !4, line: 3385, baseType: !666, size: 1088)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !4, line: 2874, size: 1088, elements: !667)
!667 = !{!668, !669, !670}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !666, file: !4, line: 2875, baseType: !630, size: 960)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !666, file: !4, line: 2876, baseType: !634, size: 64, offset: 960)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !666, file: !4, line: 2877, baseType: !671, size: 64, offset: 1024)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !673, line: 172, size: 128, elements: !674)
!673 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!674 = !{!675, !676, !677, !678, !679, !680, !681}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !672, file: !673, line: 174, baseType: !5, size: 1, flags: DIFlagBitField, extraData: i64 0)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !672, file: !673, line: 178, baseType: !5, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !672, file: !673, line: 183, baseType: !5, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !672, file: !673, line: 187, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !672, file: !673, line: 192, baseType: !5, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !672, file: !673, line: 195, baseType: !5, size: 32, offset: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !672, file: !673, line: 199, baseType: !475, size: 64, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !478, file: !4, line: 3386, baseType: !641, size: 1216)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !478, file: !4, line: 3387, baseType: !684, size: 1280)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !4, line: 3093, size: 1280, elements: !685)
!685 = !{!686, !687}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !684, file: !4, line: 3094, baseType: !641, size: 1216)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !684, file: !4, line: 3095, baseType: !671, size: 64, offset: 1216)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !478, file: !4, line: 3388, baseType: !689, size: 1216)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !4, line: 2824, size: 1216, elements: !690)
!690 = !{!691, !692, !693, !694, !695, !696}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !689, file: !4, line: 2825, baseType: !592, size: 896)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !689, file: !4, line: 2827, baseType: !475, size: 64, offset: 896)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !689, file: !4, line: 2828, baseType: !475, size: 64, offset: 960)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !689, file: !4, line: 2829, baseType: !475, size: 64, offset: 1024)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !689, file: !4, line: 2830, baseType: !475, size: 64, offset: 1088)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !689, file: !4, line: 2831, baseType: !475, size: 64, offset: 1152)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !478, file: !4, line: 3389, baseType: !698, size: 1024)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !4, line: 2850, size: 1024, elements: !699)
!699 = !{!700, !701, !702}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !698, file: !4, line: 2851, baseType: !630, size: 960)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !698, file: !4, line: 2852, baseType: !463, size: 32, offset: 960)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !698, file: !4, line: 2853, baseType: !463, size: 32, offset: 992)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !478, file: !4, line: 3390, baseType: !704, size: 1024)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !4, line: 2857, size: 1024, elements: !705)
!705 = !{!706, !707}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !704, file: !4, line: 2858, baseType: !630, size: 960)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !704, file: !4, line: 2859, baseType: !671, size: 64, offset: 960)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !478, file: !4, line: 3391, baseType: !709, size: 960)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !4, line: 2862, size: 960, elements: !710)
!710 = !{!711}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !709, file: !4, line: 2863, baseType: !630, size: 960)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !478, file: !4, line: 3392, baseType: !713, size: 1472)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !4, line: 3304, size: 1472, elements: !714)
!714 = !{!715}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !713, file: !4, line: 3305, baseType: !638, size: 1472)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !478, file: !4, line: 3393, baseType: !717, size: 1792)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !4, line: 3248, size: 1792, elements: !718)
!718 = !{!719, !720, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !717, file: !4, line: 3249, baseType: !638, size: 1472)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !717, file: !4, line: 3251, baseType: !721, size: 64, offset: 1472)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !723, line: 463, size: 1152, elements: !724)
!723 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!724 = !{!725, !728, !1046, !1047, !1219, !1222, !1223, !1224, !1225, !1226, !1227, !1251, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !722, file: !723, line: 464, baseType: !726, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !723, line: 464, flags: DIFlagFwdDecl)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !722, file: !723, line: 467, baseType: !729, size: 64, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !200, line: 374, size: 640, elements: !731)
!731 = !{!732, !1021, !1022, !1035, !1036, !1037, !1038, !1039, !1040, !1042, !1044, !1045}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !730, file: !200, line: 377, baseType: !733, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !476, line: 111, baseType: !734)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !200, line: 217, size: 832, elements: !736)
!736 = !{!737, !984, !985, !986, !989, !995, !996, !997, !1015, !1016, !1017, !1018, !1019, !1020}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !735, file: !200, line: 219, baseType: !738, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !200, line: 151, baseType: !740)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !200, line: 151, size: 128, elements: !741)
!741 = !{!742}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !740, file: !200, line: 151, baseType: !743, size: 128)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !200, line: 150, baseType: !744)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !200, line: 150, size: 128, elements: !745)
!745 = !{!746, !747, !748}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !744, file: !200, line: 150, baseType: !5, size: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !744, file: !200, line: 150, baseType: !5, size: 32, offset: 32)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !744, file: !200, line: 150, baseType: !749, size: 64, offset: 64)
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !750, size: 64, elements: !558)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !476, line: 108, baseType: !751)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !200, line: 122, size: 512, elements: !753)
!753 = !{!754, !755, !756, !976, !977, !978, !979, !980, !981, !982}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !752, file: !200, line: 124, baseType: !734, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !752, file: !200, line: 125, baseType: !734, size: 64, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !752, file: !200, line: 131, baseType: !757, size: 64, offset: 128)
!757 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !200, line: 128, size: 64, elements: !758)
!758 = !{!759, !975}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !757, file: !200, line: 129, baseType: !760, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !476, line: 66, baseType: !761)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !763, line: 143, size: 192, elements: !764)
!763 = !DIFile(filename: "./gimple.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!764 = !{!765, !973, !974}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !762, file: !763, line: 145, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !476, line: 69, baseType: !767)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !763, line: 136, size: 192, elements: !769)
!769 = !{!770, !971, !972}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !768, file: !763, line: 137, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !476, line: 58, baseType: !772)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !763, line: 737, size: 768, elements: !774)
!774 = !{!775, !792, !826, !832, !837, !842, !849, !855, !861, !866, !880, !885, !891, !896, !906, !911, !929, !936, !943, !949, !954, !960, !966}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !773, file: !763, line: 738, baseType: !776, size: 256)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !763, line: 271, size: 256, elements: !777)
!777 = !{!778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !776, file: !763, line: 274, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !776, file: !763, line: 277, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !776, file: !763, line: 281, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !776, file: !763, line: 284, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !776, file: !763, line: 291, baseType: !5, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !776, file: !763, line: 295, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !776, file: !763, line: 298, baseType: !5, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !776, file: !763, line: 301, baseType: !5, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !776, file: !763, line: 307, baseType: !5, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !776, file: !763, line: 312, baseType: !5, size: 32, offset: 32)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !776, file: !763, line: 316, baseType: !584, size: 32, offset: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !776, file: !763, line: 319, baseType: !5, size: 32, offset: 96)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !776, file: !763, line: 323, baseType: !734, size: 64, offset: 128)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !776, file: !763, line: 327, baseType: !475, size: 64, offset: 192)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !773, file: !763, line: 739, baseType: !793, size: 448)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !763, line: 350, size: 448, elements: !794)
!794 = !{!795, !824}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !793, file: !763, line: 353, baseType: !796, size: 384)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !763, line: 333, size: 384, elements: !797)
!797 = !{!798, !799, !807}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !796, file: !763, line: 336, baseType: !776, size: 256)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !796, file: !763, line: 343, baseType: !800, size: 64, offset: 256)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !802, line: 37, size: 128, elements: !803)
!802 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!803 = !{!804, !805}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !801, file: !802, line: 39, baseType: !800, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !801, file: !802, line: 40, baseType: !806, size: 64, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !796, file: !763, line: 344, baseType: !808, size: 64, offset: 320)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !802, line: 45, size: 320, elements: !810)
!810 = !{!811, !812}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !809, file: !802, line: 47, baseType: !808, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !809, file: !802, line: 48, baseType: !813, size: 256, offset: 64)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !4, line: 1883, size: 256, elements: !814)
!814 = !{!815, !817, !818, !823}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !813, file: !4, line: 1884, baseType: !816, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !813, file: !4, line: 1885, baseType: !816, size: 64, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !813, file: !4, line: 1891, baseType: !819, size: 64, offset: 128)
!819 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !813, file: !4, line: 1891, size: 64, elements: !820)
!820 = !{!821, !822}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !819, file: !4, line: 1891, baseType: !771, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !819, file: !4, line: 1891, baseType: !475, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !813, file: !4, line: 1892, baseType: !806, size: 64, offset: 192)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !793, file: !763, line: 359, baseType: !825, size: 64, offset: 384)
!825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !475, size: 64, elements: !558)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !773, file: !763, line: 740, baseType: !827, size: 512)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !763, line: 365, size: 512, elements: !828)
!828 = !{!829, !830, !831}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !827, file: !763, line: 368, baseType: !796, size: 384)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !827, file: !763, line: 373, baseType: !475, size: 64, offset: 384)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !827, file: !763, line: 374, baseType: !475, size: 64, offset: 448)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !773, file: !763, line: 741, baseType: !833, size: 576)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !763, line: 380, size: 576, elements: !834)
!834 = !{!835, !836}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !833, file: !763, line: 383, baseType: !827, size: 512)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !833, file: !763, line: 389, baseType: !825, size: 64, offset: 512)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !773, file: !763, line: 742, baseType: !838, size: 320)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !763, line: 395, size: 320, elements: !839)
!839 = !{!840, !841}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !838, file: !763, line: 397, baseType: !776, size: 256)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !838, file: !763, line: 400, baseType: !760, size: 64, offset: 256)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !773, file: !763, line: 743, baseType: !843, size: 448)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !763, line: 406, size: 448, elements: !844)
!844 = !{!845, !846, !847, !848}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !843, file: !763, line: 408, baseType: !776, size: 256)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !843, file: !763, line: 412, baseType: !475, size: 64, offset: 256)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !843, file: !763, line: 420, baseType: !475, size: 64, offset: 320)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !843, file: !763, line: 423, baseType: !760, size: 64, offset: 384)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !773, file: !763, line: 744, baseType: !850, size: 384)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !763, line: 429, size: 384, elements: !851)
!851 = !{!852, !853, !854}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !850, file: !763, line: 431, baseType: !776, size: 256)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !850, file: !763, line: 434, baseType: !475, size: 64, offset: 256)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !850, file: !763, line: 437, baseType: !760, size: 64, offset: 320)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !773, file: !763, line: 745, baseType: !856, size: 384)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !763, line: 443, size: 384, elements: !857)
!857 = !{!858, !859, !860}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !856, file: !763, line: 445, baseType: !776, size: 256)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !856, file: !763, line: 449, baseType: !475, size: 64, offset: 256)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !856, file: !763, line: 453, baseType: !760, size: 64, offset: 320)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !773, file: !763, line: 746, baseType: !862, size: 320)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !763, line: 459, size: 320, elements: !863)
!863 = !{!864, !865}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !862, file: !763, line: 461, baseType: !776, size: 256)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !862, file: !763, line: 464, baseType: !475, size: 64, offset: 256)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !773, file: !763, line: 747, baseType: !867, size: 768)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !763, line: 469, size: 768, elements: !868)
!868 = !{!869, !870, !871, !872, !873}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !867, file: !763, line: 471, baseType: !776, size: 256)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !867, file: !763, line: 474, baseType: !5, size: 32, offset: 256)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !867, file: !763, line: 475, baseType: !5, size: 32, offset: 288)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !867, file: !763, line: 478, baseType: !475, size: 64, offset: 320)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !867, file: !763, line: 481, baseType: !874, size: 384, offset: 384)
!874 = !DICompositeType(tag: DW_TAG_array_type, baseType: !875, size: 384, elements: !558)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !4, line: 1917, size: 384, elements: !876)
!876 = !{!877, !878, !879}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !875, file: !4, line: 1920, baseType: !813, size: 256)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !875, file: !4, line: 1921, baseType: !475, size: 64, offset: 256)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !875, file: !4, line: 1922, baseType: !584, size: 32, offset: 320)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !773, file: !763, line: 748, baseType: !881, size: 320)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !763, line: 487, size: 320, elements: !882)
!882 = !{!883, !884}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !881, file: !763, line: 490, baseType: !776, size: 256)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !881, file: !763, line: 494, baseType: !463, size: 32, offset: 256)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !773, file: !763, line: 749, baseType: !886, size: 384)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !763, line: 500, size: 384, elements: !887)
!887 = !{!888, !889, !890}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !886, file: !763, line: 502, baseType: !776, size: 256)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !886, file: !763, line: 506, baseType: !760, size: 64, offset: 256)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !886, file: !763, line: 510, baseType: !760, size: 64, offset: 320)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !773, file: !763, line: 750, baseType: !892, size: 320)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !763, line: 529, size: 320, elements: !893)
!893 = !{!894, !895}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !892, file: !763, line: 531, baseType: !776, size: 256)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !892, file: !763, line: 540, baseType: !760, size: 64, offset: 256)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !773, file: !763, line: 751, baseType: !897, size: 704)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !763, line: 546, size: 704, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !904, !905}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !897, file: !763, line: 549, baseType: !827, size: 512)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !897, file: !763, line: 553, baseType: !468, size: 64, offset: 512)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !897, file: !763, line: 557, baseType: !462, size: 8, offset: 576)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !897, file: !763, line: 558, baseType: !462, size: 8, offset: 584)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !897, file: !763, line: 559, baseType: !462, size: 8, offset: 592)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !897, file: !763, line: 560, baseType: !462, size: 8, offset: 600)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !897, file: !763, line: 566, baseType: !825, size: 64, offset: 640)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !773, file: !763, line: 752, baseType: !907, size: 384)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !763, line: 571, size: 384, elements: !908)
!908 = !{!909, !910}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !907, file: !763, line: 573, baseType: !838, size: 320)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !907, file: !763, line: 577, baseType: !475, size: 64, offset: 320)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !773, file: !763, line: 753, baseType: !912, size: 576)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !763, line: 600, size: 576, elements: !913)
!913 = !{!914, !915, !916, !919, !928}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !912, file: !763, line: 602, baseType: !838, size: 320)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !912, file: !763, line: 605, baseType: !475, size: 64, offset: 320)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !912, file: !763, line: 609, baseType: !917, size: 64, offset: 384)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !918, line: 46, baseType: !529)
!918 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!919 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !912, file: !763, line: 612, baseType: !920, size: 64, offset: 448)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !763, line: 581, size: 320, elements: !922)
!922 = !{!923, !924, !925, !926, !927}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !921, file: !763, line: 583, baseType: !3, size: 32)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !921, file: !763, line: 586, baseType: !475, size: 64, offset: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !921, file: !763, line: 589, baseType: !475, size: 64, offset: 128)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !921, file: !763, line: 592, baseType: !475, size: 64, offset: 192)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !921, file: !763, line: 595, baseType: !475, size: 64, offset: 256)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !912, file: !763, line: 616, baseType: !760, size: 64, offset: 512)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !773, file: !763, line: 754, baseType: !930, size: 512)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !763, line: 622, size: 512, elements: !931)
!931 = !{!932, !933, !934, !935}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !930, file: !763, line: 624, baseType: !838, size: 320)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !930, file: !763, line: 628, baseType: !475, size: 64, offset: 320)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !930, file: !763, line: 632, baseType: !475, size: 64, offset: 384)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !930, file: !763, line: 636, baseType: !475, size: 64, offset: 448)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !773, file: !763, line: 755, baseType: !937, size: 704)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !763, line: 642, size: 704, elements: !938)
!938 = !{!939, !940, !941, !942}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !937, file: !763, line: 644, baseType: !930, size: 512)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !937, file: !763, line: 648, baseType: !475, size: 64, offset: 512)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !937, file: !763, line: 652, baseType: !475, size: 64, offset: 576)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !937, file: !763, line: 653, baseType: !475, size: 64, offset: 640)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !773, file: !763, line: 756, baseType: !944, size: 448)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !763, line: 663, size: 448, elements: !945)
!945 = !{!946, !947, !948}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !944, file: !763, line: 665, baseType: !838, size: 320)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !944, file: !763, line: 668, baseType: !475, size: 64, offset: 320)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !944, file: !763, line: 673, baseType: !475, size: 64, offset: 384)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !773, file: !763, line: 757, baseType: !950, size: 384)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !763, line: 694, size: 384, elements: !951)
!951 = !{!952, !953}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !950, file: !763, line: 696, baseType: !838, size: 320)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !950, file: !763, line: 699, baseType: !475, size: 64, offset: 320)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !773, file: !763, line: 758, baseType: !955, size: 384)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !763, line: 681, size: 384, elements: !956)
!956 = !{!957, !958, !959}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !955, file: !763, line: 683, baseType: !776, size: 256)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !955, file: !763, line: 686, baseType: !475, size: 64, offset: 256)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !955, file: !763, line: 689, baseType: !475, size: 64, offset: 320)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !773, file: !763, line: 759, baseType: !961, size: 384)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !763, line: 707, size: 384, elements: !962)
!962 = !{!963, !964, !965}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !961, file: !763, line: 709, baseType: !776, size: 256)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !961, file: !763, line: 712, baseType: !475, size: 64, offset: 256)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !961, file: !763, line: 712, baseType: !475, size: 64, offset: 320)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !773, file: !763, line: 760, baseType: !967, size: 320)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !763, line: 718, size: 320, elements: !968)
!968 = !{!969, !970}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !967, file: !763, line: 720, baseType: !776, size: 256)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !967, file: !763, line: 723, baseType: !475, size: 64, offset: 256)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !768, file: !763, line: 138, baseType: !767, size: 64, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !768, file: !763, line: 139, baseType: !767, size: 64, offset: 128)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !762, file: !763, line: 146, baseType: !766, size: 64, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !762, file: !763, line: 152, baseType: !760, size: 64, offset: 128)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !757, file: !200, line: 130, baseType: !634, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !752, file: !200, line: 134, baseType: !467, size: 64, offset: 192)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !752, file: !200, line: 137, baseType: !475, size: 64, offset: 256)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !752, file: !200, line: 138, baseType: !584, size: 32, offset: 320)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !752, file: !200, line: 142, baseType: !5, size: 32, offset: 352)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !752, file: !200, line: 144, baseType: !463, size: 32, offset: 384)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !752, file: !200, line: 145, baseType: !463, size: 32, offset: 416)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !752, file: !200, line: 146, baseType: !983, size: 64, offset: 448)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !200, line: 119, baseType: !531)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !735, file: !200, line: 220, baseType: !738, size: 64, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !735, file: !200, line: 223, baseType: !467, size: 64, offset: 128)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !735, file: !200, line: 226, baseType: !987, size: 64, offset: 192)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !200, line: 185, flags: DIFlagFwdDecl)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !735, file: !200, line: 229, baseType: !990, size: 128, offset: 256)
!990 = !DICompositeType(tag: DW_TAG_array_type, baseType: !991, size: 128, elements: !993)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !200, line: 229, flags: DIFlagFwdDecl)
!993 = !{!994}
!994 = !DISubrange(count: 2)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !735, file: !200, line: 232, baseType: !734, size: 64, offset: 384)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !735, file: !200, line: 233, baseType: !734, size: 64, offset: 448)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !735, file: !200, line: 238, baseType: !998, size: 64, offset: 512)
!998 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !200, line: 235, size: 64, elements: !999)
!999 = !{!1000, !1006}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !998, file: !200, line: 236, baseType: !1001, size: 64)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !200, line: 273, size: 128, elements: !1003)
!1003 = !{!1004, !1005}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1002, file: !200, line: 275, baseType: !760, size: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1002, file: !200, line: 278, baseType: !760, size: 64, offset: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !998, file: !200, line: 237, baseType: !1007, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !200, line: 259, size: 320, elements: !1009)
!1009 = !{!1010, !1011, !1012, !1013, !1014}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1008, file: !200, line: 261, baseType: !634, size: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1008, file: !200, line: 262, baseType: !634, size: 64, offset: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1008, file: !200, line: 266, baseType: !634, size: 64, offset: 128)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1008, file: !200, line: 267, baseType: !634, size: 64, offset: 192)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1008, file: !200, line: 270, baseType: !463, size: 32, offset: 256)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !735, file: !200, line: 241, baseType: !983, size: 64, offset: 576)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !735, file: !200, line: 244, baseType: !463, size: 32, offset: 640)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !735, file: !200, line: 247, baseType: !463, size: 32, offset: 672)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !735, file: !200, line: 250, baseType: !463, size: 32, offset: 704)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !735, file: !200, line: 253, baseType: !463, size: 32, offset: 736)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !735, file: !200, line: 256, baseType: !463, size: 32, offset: 768)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !730, file: !200, line: 378, baseType: !733, size: 64, offset: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !730, file: !200, line: 381, baseType: !1023, size: 64, offset: 128)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !200, line: 282, baseType: !1025)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !200, line: 282, size: 128, elements: !1026)
!1026 = !{!1027}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1025, file: !200, line: 282, baseType: !1028, size: 128)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !200, line: 281, baseType: !1029)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !200, line: 281, size: 128, elements: !1030)
!1030 = !{!1031, !1032, !1033}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1029, file: !200, line: 281, baseType: !5, size: 32)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1029, file: !200, line: 281, baseType: !5, size: 32, offset: 32)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1029, file: !200, line: 281, baseType: !1034, size: 64, offset: 64)
!1034 = !DICompositeType(tag: DW_TAG_array_type, baseType: !733, size: 64, elements: !558)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !730, file: !200, line: 384, baseType: !463, size: 32, offset: 192)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !730, file: !200, line: 387, baseType: !463, size: 32, offset: 224)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !730, file: !200, line: 390, baseType: !463, size: 32, offset: 256)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !730, file: !200, line: 394, baseType: !1023, size: 64, offset: 320)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !730, file: !200, line: 396, baseType: !199, size: 32, offset: 384)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !730, file: !200, line: 399, baseType: !1041, size: 64, offset: 416)
!1041 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 64, elements: !993)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !730, file: !200, line: 402, baseType: !1043, size: 64, offset: 480)
!1043 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !993)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !730, file: !200, line: 406, baseType: !463, size: 32, offset: 544)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !730, file: !200, line: 409, baseType: !463, size: 32, offset: 576)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !722, file: !723, line: 470, baseType: !761, size: 64, offset: 128)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !722, file: !723, line: 473, baseType: !1048, size: 64, offset: 192)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !673, line: 39, size: 1152, elements: !1050)
!1050 = !{!1051, !1101, !1114, !1126, !1127, !1196, !1197, !1201, !1202, !1203, !1204, !1205}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1049, file: !673, line: 41, baseType: !1052, size: 64)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1053, line: 144, baseType: !1054)
!1053 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1053, line: 100, size: 896, elements: !1056)
!1056 = !{!1057, !1065, !1070, !1075, !1077, !1078, !1079, !1080, !1081, !1082, !1087, !1089, !1090, !1095, !1100}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1055, file: !1053, line: 102, baseType: !1058, size: 64)
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1053, line: 52, baseType: !1059)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1060 = !DISubroutineType(types: !1061)
!1061 = !{!1062, !1063}
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1053, line: 47, baseType: !5)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1055, file: !1053, line: 105, baseType: !1066, size: 64, offset: 64)
!1066 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1053, line: 59, baseType: !1067)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{!463, !1063, !1063}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1055, file: !1053, line: 108, baseType: !1071, size: 64, offset: 128)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1053, line: 63, baseType: !1072)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{null, !467}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1055, file: !1053, line: 111, baseType: !1076, size: 64, offset: 192)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1055, file: !1053, line: 114, baseType: !917, size: 64, offset: 256)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1055, file: !1053, line: 117, baseType: !917, size: 64, offset: 320)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1055, file: !1053, line: 120, baseType: !917, size: 64, offset: 384)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1055, file: !1053, line: 124, baseType: !5, size: 32, offset: 448)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1055, file: !1053, line: 128, baseType: !5, size: 32, offset: 480)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1055, file: !1053, line: 131, baseType: !1083, size: 64, offset: 512)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1053, line: 75, baseType: !1084)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{!467, !917, !917}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1055, file: !1053, line: 132, baseType: !1088, size: 64, offset: 576)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1053, line: 78, baseType: !1072)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1055, file: !1053, line: 135, baseType: !467, size: 64, offset: 640)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1055, file: !1053, line: 136, baseType: !1091, size: 64, offset: 704)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1053, line: 82, baseType: !1092)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{!467, !467, !917, !917}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1055, file: !1053, line: 137, baseType: !1096, size: 64, offset: 768)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1053, line: 83, baseType: !1097)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = !DISubroutineType(types: !1099)
!1099 = !{null, !467, !467}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1055, file: !1053, line: 141, baseType: !5, size: 32, offset: 832)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1049, file: !673, line: 48, baseType: !1102, size: 64, offset: 64)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !763, line: 35, baseType: !1104)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !763, line: 35, size: 128, elements: !1105)
!1105 = !{!1106}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1104, file: !763, line: 35, baseType: !1107, size: 128)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !763, line: 33, baseType: !1108)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !763, line: 33, size: 128, elements: !1109)
!1109 = !{!1110, !1111, !1112}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1108, file: !763, line: 33, baseType: !5, size: 32)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1108, file: !763, line: 33, baseType: !5, size: 32, offset: 32)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1108, file: !763, line: 33, baseType: !1113, size: 64, offset: 64)
!1113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !771, size: 64, elements: !558)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1049, file: !673, line: 51, baseType: !1115, size: 64, offset: 128)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !4, line: 183, baseType: !1117)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !4, line: 183, size: 128, elements: !1118)
!1118 = !{!1119}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1117, file: !4, line: 183, baseType: !1120, size: 128)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !4, line: 182, baseType: !1121)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !4, line: 182, size: 128, elements: !1122)
!1122 = !{!1123, !1124, !1125}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1121, file: !4, line: 182, baseType: !5, size: 32)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1121, file: !4, line: 182, baseType: !5, size: 32, offset: 32)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1121, file: !4, line: 182, baseType: !825, size: 64, offset: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1049, file: !673, line: 54, baseType: !475, size: 64, offset: 192)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1049, file: !673, line: 57, baseType: !1128, size: 128, offset: 256)
!1128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1129, line: 31, size: 128, elements: !1130)
!1129 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1130 = !{!1131, !1132, !1133, !1134, !1135, !1136, !1137}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1128, file: !1129, line: 35, baseType: !5, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1128, file: !1129, line: 39, baseType: !5, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1128, file: !1129, line: 42, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1128, file: !1129, line: 46, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1128, file: !1129, line: 50, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1128, file: !1129, line: 53, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1128, file: !1129, line: 56, baseType: !1138, size: 64, offset: 64)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !476, line: 47, baseType: !1139)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64)
!1140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1141, line: 75, size: 256, elements: !1142)
!1141 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1142 = !{!1143, !1155, !1156, !1157}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1140, file: !1141, line: 76, baseType: !1144, size: 64)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1141, line: 68, baseType: !1146)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1141, line: 63, size: 320, elements: !1147)
!1147 = !{!1148, !1150, !1151, !1152}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1146, file: !1141, line: 64, baseType: !1149, size: 64)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1146, file: !1141, line: 65, baseType: !1149, size: 64, offset: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1146, file: !1141, line: 66, baseType: !5, size: 32, offset: 128)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1146, file: !1141, line: 67, baseType: !1153, size: 128, offset: 192)
!1153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1154, size: 128, elements: !993)
!1154 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1141, line: 29, baseType: !529)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1140, file: !1141, line: 77, baseType: !1144, size: 64, offset: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1140, file: !1141, line: 78, baseType: !5, size: 32, offset: 128)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1140, file: !1141, line: 79, baseType: !1158, size: 64, offset: 192)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1141, line: 49, baseType: !1160)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1141, line: 45, size: 832, elements: !1161)
!1161 = !{!1162, !1163, !1164}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1160, file: !1141, line: 46, baseType: !1149, size: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1160, file: !1141, line: 47, baseType: !1139, size: 64, offset: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1160, file: !1141, line: 48, baseType: !1165, size: 704, offset: 128)
!1165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1166, line: 164, size: 704, elements: !1167)
!1166 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1167 = !{!1168, !1169, !1179, !1180, !1181, !1182, !1183, !1184, !1188, !1192, !1193, !1194, !1195}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1165, file: !1166, line: 166, baseType: !531, size: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1165, file: !1166, line: 167, baseType: !1170, size: 64, offset: 64)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1166, line: 157, size: 192, elements: !1172)
!1172 = !{!1173, !1174, !1175}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1171, file: !1166, line: 159, baseType: !465, size: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1171, file: !1166, line: 160, baseType: !1170, size: 64, offset: 64)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1171, file: !1166, line: 161, baseType: !1176, size: 32, offset: 128)
!1176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !466, size: 32, elements: !1177)
!1177 = !{!1178}
!1178 = !DISubrange(count: 4)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1165, file: !1166, line: 168, baseType: !465, size: 64, offset: 128)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1165, file: !1166, line: 169, baseType: !465, size: 64, offset: 192)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1165, file: !1166, line: 170, baseType: !465, size: 64, offset: 256)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1165, file: !1166, line: 171, baseType: !531, size: 64, offset: 320)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1165, file: !1166, line: 172, baseType: !463, size: 32, offset: 384)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1165, file: !1166, line: 176, baseType: !1185, size: 64, offset: 448)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64)
!1186 = !DISubroutineType(types: !1187)
!1187 = !{!1170, !467, !531}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1165, file: !1166, line: 177, baseType: !1189, size: 64, offset: 512)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64)
!1190 = !DISubroutineType(types: !1191)
!1191 = !{null, !467, !1170}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1165, file: !1166, line: 178, baseType: !467, size: 64, offset: 576)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1165, file: !1166, line: 179, baseType: !5, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1165, file: !1166, line: 180, baseType: !5, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1165, file: !1166, line: 184, baseType: !5, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !1049, file: !673, line: 60, baseType: !1128, size: 128, offset: 384)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !1049, file: !673, line: 64, baseType: !1198, size: 64, offset: 512)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64)
!1199 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1200, line: 33, flags: DIFlagFwdDecl)
!1200 = !DIFile(filename: "./pointer-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !1049, file: !673, line: 67, baseType: !475, size: 64, offset: 576)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !1049, file: !673, line: 73, baseType: !1052, size: 64, offset: 640)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !1049, file: !673, line: 77, baseType: !1138, size: 64, offset: 704)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !1049, file: !673, line: 80, baseType: !5, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !1049, file: !673, line: 82, baseType: !1206, size: 320, offset: 832)
!1206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !802, line: 62, size: 320, elements: !1207)
!1207 = !{!1208, !1214, !1215, !1216, !1217, !1218}
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1206, file: !802, line: 63, baseType: !1209, size: 64)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64)
!1210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !802, line: 56, size: 128, elements: !1211)
!1211 = !{!1212, !1213}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1210, file: !802, line: 57, baseType: !1209, size: 64)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1210, file: !802, line: 58, baseType: !557, size: 8, offset: 64)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1206, file: !802, line: 64, baseType: !5, size: 32, offset: 64)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1206, file: !802, line: 66, baseType: !5, size: 32, offset: 96)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1206, file: !802, line: 68, baseType: !462, size: 8, offset: 128)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1206, file: !802, line: 70, baseType: !800, size: 64, offset: 192)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1206, file: !802, line: 71, baseType: !808, size: 64, offset: 256)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !722, file: !723, line: 476, baseType: !1220, size: 64, offset: 256)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1221 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !723, line: 476, flags: DIFlagFwdDecl)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !722, file: !723, line: 479, baseType: !1052, size: 64, offset: 320)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !722, file: !723, line: 484, baseType: !475, size: 64, offset: 384)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !722, file: !723, line: 488, baseType: !475, size: 64, offset: 448)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !722, file: !723, line: 493, baseType: !475, size: 64, offset: 512)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !722, file: !723, line: 496, baseType: !475, size: 64, offset: 576)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !722, file: !723, line: 501, baseType: !1228, size: 64, offset: 640)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64)
!1229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !211, line: 2355, size: 576, elements: !1230)
!1230 = !{!1231, !1234, !1235, !1236, !1237, !1239, !1240, !1245, !1246, !1247, !1248, !1249, !1250}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1229, file: !211, line: 2356, baseType: !1232, size: 64)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64)
!1233 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !211, line: 2356, flags: DIFlagFwdDecl)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1229, file: !211, line: 2357, baseType: !468, size: 64, offset: 64)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1229, file: !211, line: 2358, baseType: !463, size: 32, offset: 128)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1229, file: !211, line: 2359, baseType: !463, size: 32, offset: 160)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1229, file: !211, line: 2360, baseType: !1238, size: 128, offset: 192)
!1238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 128, elements: !1177)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1229, file: !211, line: 2364, baseType: !463, size: 32, offset: 320)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1229, file: !211, line: 2367, baseType: !1241, size: 128, offset: 384)
!1241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !211, line: 2349, size: 128, elements: !1242)
!1242 = !{!1243, !1244}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1241, file: !211, line: 2351, baseType: !634, size: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1241, file: !211, line: 2352, baseType: !531, size: 64, offset: 64)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1229, file: !211, line: 2371, baseType: !210, size: 32, offset: 512)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1229, file: !211, line: 2374, baseType: !5, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1229, file: !211, line: 2377, baseType: !5, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1229, file: !211, line: 2381, baseType: !5, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1229, file: !211, line: 2392, baseType: !5, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1229, file: !211, line: 2396, baseType: !5, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !722, file: !723, line: 504, baseType: !1252, size: 64, offset: 704)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64)
!1253 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !723, line: 504, flags: DIFlagFwdDecl)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !722, file: !723, line: 507, baseType: !1052, size: 64, offset: 768)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !722, file: !723, line: 510, baseType: !463, size: 32, offset: 832)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !722, file: !723, line: 513, baseType: !463, size: 32, offset: 864)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !722, file: !723, line: 516, baseType: !584, size: 32, offset: 896)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !722, file: !723, line: 519, baseType: !584, size: 32, offset: 928)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !722, file: !723, line: 522, baseType: !5, size: 32, offset: 960)
