; ModuleID = 'ipa-reference.bc'
source_filename = "ipa-reference.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.ipa_opt_pass_d = type { %struct.opt_pass, void ()*, void (%struct.cgraph_node_set_def*)*, void ()*, void (%struct.cgraph_node*)*, void (%struct.cgraph_node*, %union.gimple_statement_d**)*, i32, i32 (%struct.cgraph_node*)*, void (%struct.varpool_node*)* }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.cgraph_node_set_def = type { %struct.htab*, %struct.VEC_cgraph_node_ptr_gc*, i8* }
%struct.htab = type { i32 (i8*)*, i32 (i8*, i8*)*, void (i8*)*, i8**, i64, i64, i64, i32, i32, i8* (i64, i64)*, void (i8*)*, i8*, i8* (i8*, i64, i64)*, void (i8*, i8*)*, i32 }
%struct.VEC_cgraph_node_ptr_gc = type { %struct.VEC_cgraph_node_ptr_base }
%struct.VEC_cgraph_node_ptr_base = type { i32, i32, [1 x %struct.cgraph_node*] }

!501 = !DIEnumerator(name: "GIMPLE_BIND", value: 10, isUnsigned: true)
!502 = !DIEnumerator(name: "GIMPLE_CATCH", value: 11, isUnsigned: true)
!503 = !DIEnumerator(name: "GIMPLE_EH_FILTER", value: 12, isUnsigned: true)
!504 = !DIEnumerator(name: "GIMPLE_EH_MUST_NOT_THROW", value: 13, isUnsigned: true)
!505 = !DIEnumerator(name: "GIMPLE_RESX", value: 14, isUnsigned: true)
!506 = !DIEnumerator(name: "GIMPLE_EH_DISPATCH", value: 15, isUnsigned: true)
!507 = !DIEnumerator(name: "GIMPLE_PHI", value: 16, isUnsigned: true)
!508 = !DIEnumerator(name: "GIMPLE_TRY", value: 17, isUnsigned: true)
!509 = !DIEnumerator(name: "GIMPLE_NOP", value: 18, isUnsigned: true)
!510 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!511 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!512 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!513 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!514 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!515 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!516 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!517 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!518 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!519 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!520 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!521 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!522 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!523 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!524 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!525 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!526 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!527 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "lto_section_type", file: !528, line: 256, baseType: !7, size: 32, elements: !529)
!528 = !DIFile(filename: "./lto-streamer.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!529 = !{!530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540}
!530 = !DIEnumerator(name: "LTO_section_decls", value: 0, isUnsigned: true)
!531 = !DIEnumerator(name: "LTO_section_function_body", value: 1, isUnsigned: true)
!532 = !DIEnumerator(name: "LTO_section_static_initializer", value: 2, isUnsigned: true)
!533 = !DIEnumerator(name: "LTO_section_cgraph", value: 3, isUnsigned: true)
!534 = !DIEnumerator(name: "LTO_section_jump_functions", value: 4, isUnsigned: true)
!535 = !DIEnumerator(name: "LTO_section_ipa_pure_const", value: 5, isUnsigned: true)
!536 = !DIEnumerator(name: "LTO_section_ipa_reference", value: 6, isUnsigned: true)
!537 = !DIEnumerator(name: "LTO_section_symtab", value: 7, isUnsigned: true)
!538 = !DIEnumerator(name: "LTO_section_wpa_fixup", value: 8, isUnsigned: true)
!539 = !DIEnumerator(name: "LTO_section_opts", value: 9, isUnsigned: true)
!540 = !DIEnumerator(name: "LTO_N_SECTION_TYPES", value: 10, isUnsigned: true)
!541 = !{!542, !543, !544, !545, !548, !549, !7, !551, !1986, !1993, !1217, !556, !2003, !2016, !2021, !5, !2030, !2033, !2020, !852, !2036, !885, !546}
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!544 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !547)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cgraph_node", file: !250, line: 181, size: 2496, elements: !554)
!554 = !{!555, !1729, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1869, !1923, !1933, !1937, !1963, !1972, !1973, !1974, !1975, !1976, !1977, !1978, !1979, !1980, !1981, !1982, !1983, !1984, !1985}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !553, file: !250, line: 182, baseType: !556, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !557, line: 56, baseType: !558)
!557 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !6, line: 3371, size: 1792, elements: !560)
!560 = !{!561, !594, !600, !613, !620, !627, !632, !641, !647, !660, !672, !710, !718, !746, !763, !764, !769, !778, !784, !789, !793, !797, !1378, !1427, !1433, !1439, !1446, !1459, !1473, !1490, !1502, !1524, !1539, !1711}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !559, file: !6, line: 3372, baseType: !562, size: 64)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !6, line: 360, size: 64, elements: !563)
!563 = !{!564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !562, file: !6, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !562, file: !6, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !562, file: !6, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !562, file: !6, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !562, file: !6, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !562, file: !6, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !562, file: !6, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !562, file: !6, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !562, file: !6, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !562, file: !6, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !562, file: !6, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !562, file: !6, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !562, file: !6, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !562, file: !6, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !562, file: !6, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !562, file: !6, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !562, file: !6, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !562, file: !6, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !562, file: !6, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !562, file: !6, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !562, file: !6, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !562, file: !6, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !562, file: !6, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !562, file: !6, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !562, file: !6, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !562, file: !6, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !562, file: !6, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !562, file: !6, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !562, file: !6, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !562, file: !6, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !559, file: !6, line: 3373, baseType: !595, size: 192)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !6, line: 402, size: 192, elements: !596)
!596 = !{!597, !598, !599}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !595, file: !6, line: 403, baseType: !562, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !595, file: !6, line: 404, baseType: !556, size: 64, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !595, file: !6, line: 405, baseType: !556, size: 64, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !559, file: !6, line: 3374, baseType: !601, size: 320)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !6, line: 1384, size: 320, elements: !602)
!602 = !{!603, !604}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !601, file: !6, line: 1385, baseType: !595, size: 192)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !601, file: !6, line: 1386, baseType: !605, size: 128, offset: 192)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !606, line: 58, baseType: !607)
!606 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !606, line: 54, size: 128, elements: !608)
!608 = !{!609, !611}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !607, file: !606, line: 56, baseType: !610, size: 64)
!610 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !607, file: !606, line: 57, baseType: !612, size: 64, offset: 64)
!612 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !559, file: !6, line: 3375, baseType: !614, size: 256)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !6, line: 1397, size: 256, elements: !615)
!615 = !{!616, !617}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !614, file: !6, line: 1398, baseType: !595, size: 192)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !614, file: !6, line: 1399, baseType: !618, size: 64, offset: 192)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !6, line: 1392, flags: DIFlagFwdDecl)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !559, file: !6, line: 3376, baseType: !621, size: 256)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !6, line: 1408, size: 256, elements: !622)
!622 = !{!623, !624}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !621, file: !6, line: 1409, baseType: !595, size: 192)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !621, file: !6, line: 1410, baseType: !625, size: 64, offset: 192)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !6, line: 1403, flags: DIFlagFwdDecl)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !559, file: !6, line: 3377, baseType: !628, size: 256)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !6, line: 1437, size: 256, elements: !629)
!629 = !{!630, !631}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !628, file: !6, line: 1438, baseType: !595, size: 192)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !628, file: !6, line: 1439, baseType: !556, size: 64, offset: 192)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !559, file: !6, line: 3378, baseType: !633, size: 256)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !6, line: 1418, size: 256, elements: !634)
!634 = !{!635, !636, !637}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !633, file: !6, line: 1419, baseType: !595, size: 192)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !633, file: !6, line: 1420, baseType: !544, size: 32, offset: 192)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !633, file: !6, line: 1421, baseType: !638, size: 8, offset: 224)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !547, size: 8, elements: !639)
!639 = !{!640}
!640 = !DISubrange(count: 1)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !559, file: !6, line: 3379, baseType: !642, size: 320)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !6, line: 1428, size: 320, elements: !643)
!643 = !{!644, !645, !646}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !642, file: !6, line: 1429, baseType: !595, size: 192)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !642, file: !6, line: 1430, baseType: !556, size: 64, offset: 192)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !642, file: !6, line: 1431, baseType: !556, size: 64, offset: 256)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !559, file: !6, line: 3380, baseType: !648, size: 320)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !6, line: 1460, size: 320, elements: !649)
!649 = !{!650, !651}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !648, file: !6, line: 1461, baseType: !595, size: 192)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !648, file: !6, line: 1462, baseType: !652, size: 128, offset: 192)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !653, line: 31, size: 128, elements: !654)
!653 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!654 = !{!655, !658, !659}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !652, file: !653, line: 32, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !543)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !652, file: !653, line: 33, baseType: !7, size: 32, offset: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !652, file: !653, line: 34, baseType: !7, size: 32, offset: 96)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !559, file: !6, line: 3381, baseType: !661, size: 384)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !6, line: 2507, size: 384, elements: !662)
!662 = !{!663, !664, !669, !670, !671}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !661, file: !6, line: 2508, baseType: !595, size: 192)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !661, file: !6, line: 2509, baseType: !665, size: 32, offset: 192)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !666, line: 58, baseType: !667)
!666 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !668, line: 44, baseType: !7)
!668 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!669 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !661, file: !6, line: 2510, baseType: !7, size: 32, offset: 224)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !661, file: !6, line: 2511, baseType: !556, size: 64, offset: 256)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !661, file: !6, line: 2512, baseType: !556, size: 64, offset: 320)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !559, file: !6, line: 3382, baseType: !673, size: 896)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !6, line: 2652, size: 896, elements: !674)
!674 = !{!675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !673, file: !6, line: 2653, baseType: !661, size: 384)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !673, file: !6, line: 2654, baseType: !556, size: 64, offset: 384)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !673, file: !6, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !673, file: !6, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !673, file: !6, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !673, file: !6, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !673, file: !6, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !673, file: !6, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !673, file: !6, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !673, file: !6, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !673, file: !6, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !673, file: !6, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !673, file: !6, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !673, file: !6, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !673, file: !6, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !673, file: !6, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !673, file: !6, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !673, file: !6, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !673, file: !6, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !673, file: !6, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !673, file: !6, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !673, file: !6, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !673, file: !6, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !673, file: !6, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !673, file: !6, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !673, file: !6, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !673, file: !6, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !673, file: !6, line: 2703, baseType: !7, size: 32, offset: 512)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !673, file: !6, line: 2705, baseType: !556, size: 64, offset: 576)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !673, file: !6, line: 2706, baseType: !556, size: 64, offset: 640)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !673, file: !6, line: 2707, baseType: !556, size: 64, offset: 704)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !673, file: !6, line: 2708, baseType: !556, size: 64, offset: 768)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !673, file: !6, line: 2711, baseType: !708, size: 64, offset: 832)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !6, line: 2711, flags: DIFlagFwdDecl)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !559, file: !6, line: 3383, baseType: !711, size: 960)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !6, line: 2756, size: 960, elements: !712)
!712 = !{!713, !714}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !711, file: !6, line: 2757, baseType: !673, size: 896)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !711, file: !6, line: 2758, baseType: !715, size: 64, offset: 896)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !557, line: 50, baseType: !716)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !557, line: 49, flags: DIFlagFwdDecl)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !559, file: !6, line: 3384, baseType: !719, size: 1472)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !6, line: 3114, size: 1472, elements: !720)
!720 = !{!721, !742, !743, !744, !745}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !719, file: !6, line: 3115, baseType: !722, size: 1216)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !6, line: 2984, size: 1216, elements: !723)
!723 = !{!724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !722, file: !6, line: 2985, baseType: !711, size: 960)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !722, file: !6, line: 2986, baseType: !556, size: 64, offset: 960)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !722, file: !6, line: 2987, baseType: !556, size: 64, offset: 1024)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !722, file: !6, line: 2988, baseType: !556, size: 64, offset: 1088)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !722, file: !6, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !722, file: !6, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !722, file: !6, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !722, file: !6, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !722, file: !6, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !722, file: !6, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !722, file: !6, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !722, file: !6, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !722, file: !6, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !722, file: !6, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !722, file: !6, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !722, file: !6, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !722, file: !6, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !722, file: !6, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !719, file: !6, line: 3117, baseType: !556, size: 64, offset: 1216)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !719, file: !6, line: 3119, baseType: !556, size: 64, offset: 1280)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !719, file: !6, line: 3121, baseType: !556, size: 64, offset: 1344)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !719, file: !6, line: 3123, baseType: !556, size: 64, offset: 1408)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !559, file: !6, line: 3385, baseType: !747, size: 1088)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !6, line: 2874, size: 1088, elements: !748)
!748 = !{!749, !750, !751}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !747, file: !6, line: 2875, baseType: !711, size: 960)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !747, file: !6, line: 2876, baseType: !715, size: 64, offset: 960)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !747, file: !6, line: 2877, baseType: !752, size: 64, offset: 1024)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !754, line: 172, size: 128, elements: !755)
!754 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!755 = !{!756, !757, !758, !759, !760, !761, !762}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !753, file: !754, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !753, file: !754, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !753, file: !754, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !753, file: !754, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !753, file: !754, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !753, file: !754, line: 195, baseType: !7, size: 32, offset: 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !753, file: !754, line: 199, baseType: !556, size: 64, offset: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !559, file: !6, line: 3386, baseType: !722, size: 1216)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !559, file: !6, line: 3387, baseType: !765, size: 1280)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !6, line: 3093, size: 1280, elements: !766)
!766 = !{!767, !768}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !765, file: !6, line: 3094, baseType: !722, size: 1216)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !765, file: !6, line: 3095, baseType: !752, size: 64, offset: 1216)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !559, file: !6, line: 3388, baseType: !770, size: 1216)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !6, line: 2824, size: 1216, elements: !771)
!771 = !{!772, !773, !774, !775, !776, !777}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !770, file: !6, line: 2825, baseType: !673, size: 896)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !770, file: !6, line: 2827, baseType: !556, size: 64, offset: 896)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !770, file: !6, line: 2828, baseType: !556, size: 64, offset: 960)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !770, file: !6, line: 2829, baseType: !556, size: 64, offset: 1024)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !770, file: !6, line: 2830, baseType: !556, size: 64, offset: 1088)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !770, file: !6, line: 2831, baseType: !556, size: 64, offset: 1152)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !559, file: !6, line: 3389, baseType: !779, size: 1024)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !6, line: 2850, size: 1024, elements: !780)
!780 = !{!781, !782, !783}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !779, file: !6, line: 2851, baseType: !711, size: 960)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !779, file: !6, line: 2852, baseType: !544, size: 32, offset: 960)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !779, file: !6, line: 2853, baseType: !544, size: 32, offset: 992)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !559, file: !6, line: 3390, baseType: !785, size: 1024)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !6, line: 2857, size: 1024, elements: !786)
!786 = !{!787, !788}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !785, file: !6, line: 2858, baseType: !711, size: 960)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !785, file: !6, line: 2859, baseType: !752, size: 64, offset: 960)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !559, file: !6, line: 3391, baseType: !790, size: 960)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !6, line: 2862, size: 960, elements: !791)
!791 = !{!792}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !790, file: !6, line: 2863, baseType: !711, size: 960)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !559, file: !6, line: 3392, baseType: !794, size: 1472)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !6, line: 3304, size: 1472, elements: !795)
!795 = !{!796}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !794, file: !6, line: 3305, baseType: !719, size: 1472)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !559, file: !6, line: 3393, baseType: !798, size: 1792)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !6, line: 3248, size: 1792, elements: !799)
!799 = !{!800, !801, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !798, file: !6, line: 3249, baseType: !719, size: 1472)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !798, file: !6, line: 3251, baseType: !802, size: 64, offset: 1472)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !804, line: 463, size: 1152, elements: !805)
!804 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!805 = !{!806, !809, !1125, !1126, !1298, !1301, !1302, !1303, !1304, !1305, !1306, !1330, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !803, file: !804, line: 464, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !804, line: 464, flags: DIFlagFwdDecl)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !803, file: !804, line: 467, baseType: !810, size: 64, offset: 64)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !202, line: 374, size: 640, elements: !812)
!812 = !{!813, !1100, !1101, !1114, !1115, !1116, !1117, !1118, !1119, !1121, !1123, !1124}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !811, file: !202, line: 377, baseType: !814, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !557, line: 111, baseType: !815)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !202, line: 217, size: 832, elements: !817)
!817 = !{!818, !1063, !1064, !1065, !1068, !1074, !1075, !1076, !1094, !1095, !1096, !1097, !1098, !1099}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !816, file: !202, line: 219, baseType: !819, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !202, line: 151, baseType: !821)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !202, line: 151, size: 128, elements: !822)
!822 = !{!823}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !821, file: !202, line: 151, baseType: !824, size: 128)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !202, line: 150, baseType: !825)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !202, line: 150, size: 128, elements: !826)
!826 = !{!827, !828, !829}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !825, file: !202, line: 150, baseType: !7, size: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !825, file: !202, line: 150, baseType: !7, size: 32, offset: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !825, file: !202, line: 150, baseType: !830, size: 64, offset: 64)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !831, size: 64, elements: !639)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !557, line: 108, baseType: !832)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !202, line: 122, size: 512, elements: !834)
!834 = !{!835, !836, !837, !1055, !1056, !1057, !1058, !1059, !1060, !1061}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !833, file: !202, line: 124, baseType: !815, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !833, file: !202, line: 125, baseType: !815, size: 64, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !833, file: !202, line: 131, baseType: !838, size: 64, offset: 128)
!838 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !202, line: 128, size: 64, elements: !839)
!839 = !{!840, !1054}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !838, file: !202, line: 129, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !557, line: 66, baseType: !842)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !463, line: 143, size: 192, elements: !844)
!844 = !{!845, !1052, !1053}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !843, file: !463, line: 145, baseType: !846, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !557, line: 69, baseType: !847)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !463, line: 136, size: 192, elements: !849)
!849 = !{!850, !1050, !1051}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !848, file: !463, line: 137, baseType: !851, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !557, line: 58, baseType: !852)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !463, line: 737, size: 768, elements: !854)
!854 = !{!855, !872, !905, !911, !916, !921, !928, !934, !940, !945, !959, !964, !970, !975, !985, !990, !1008, !1015, !1022, !1028, !1033, !1039, !1045}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !853, file: !463, line: 738, baseType: !856, size: 256)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !463, line: 271, size: 256, elements: !857)
!857 = !{!858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !856, file: !463, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !856, file: !463, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !856, file: !463, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !856, file: !463, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !856, file: !463, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !856, file: !463, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !856, file: !463, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !856, file: !463, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !856, file: !463, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !856, file: !463, line: 312, baseType: !7, size: 32, offset: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !856, file: !463, line: 316, baseType: !665, size: 32, offset: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !856, file: !463, line: 319, baseType: !7, size: 32, offset: 96)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !856, file: !463, line: 323, baseType: !815, size: 64, offset: 128)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !856, file: !463, line: 327, baseType: !556, size: 64, offset: 192)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !853, file: !463, line: 739, baseType: !873, size: 448)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !463, line: 350, size: 448, elements: !874)
!874 = !{!875, !903}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !873, file: !463, line: 353, baseType: !876, size: 384)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !463, line: 333, size: 384, elements: !877)
!877 = !{!878, !879, !886}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !876, file: !463, line: 336, baseType: !856, size: 256)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !876, file: !463, line: 343, baseType: !880, size: 64, offset: 256)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !456, line: 37, size: 128, elements: !882)
!882 = !{!883, !884}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !881, file: !456, line: 39, baseType: !880, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !881, file: !456, line: 40, baseType: !885, size: 64, offset: 64)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !876, file: !463, line: 344, baseType: !887, size: 64, offset: 320)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !456, line: 45, size: 320, elements: !889)
!889 = !{!890, !891}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !888, file: !456, line: 47, baseType: !887, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !888, file: !456, line: 48, baseType: !892, size: 256, offset: 64)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !6, line: 1883, size: 256, elements: !893)
!893 = !{!894, !896, !897, !902}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !892, file: !6, line: 1884, baseType: !895, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !892, file: !6, line: 1885, baseType: !895, size: 64, offset: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !892, file: !6, line: 1891, baseType: !898, size: 64, offset: 128)
!898 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !892, file: !6, line: 1891, size: 64, elements: !899)
!899 = !{!900, !901}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !898, file: !6, line: 1891, baseType: !851, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !898, file: !6, line: 1891, baseType: !556, size: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !892, file: !6, line: 1892, baseType: !885, size: 64, offset: 192)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !873, file: !463, line: 359, baseType: !904, size: 64, offset: 384)
!904 = !DICompositeType(tag: DW_TAG_array_type, baseType: !556, size: 64, elements: !639)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !853, file: !463, line: 740, baseType: !906, size: 512)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !463, line: 365, size: 512, elements: !907)
!907 = !{!908, !909, !910}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !906, file: !463, line: 368, baseType: !876, size: 384)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !906, file: !463, line: 373, baseType: !556, size: 64, offset: 384)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !906, file: !463, line: 374, baseType: !556, size: 64, offset: 448)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !853, file: !463, line: 741, baseType: !912, size: 576)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !463, line: 380, size: 576, elements: !913)
!913 = !{!914, !915}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !912, file: !463, line: 383, baseType: !906, size: 512)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !912, file: !463, line: 389, baseType: !904, size: 64, offset: 512)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !853, file: !463, line: 742, baseType: !917, size: 320)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !463, line: 395, size: 320, elements: !918)
!918 = !{!919, !920}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !917, file: !463, line: 397, baseType: !856, size: 256)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !917, file: !463, line: 400, baseType: !841, size: 64, offset: 256)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !853, file: !463, line: 743, baseType: !922, size: 448)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !463, line: 406, size: 448, elements: !923)
!923 = !{!924, !925, !926, !927}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !922, file: !463, line: 408, baseType: !856, size: 256)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !922, file: !463, line: 412, baseType: !556, size: 64, offset: 256)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !922, file: !463, line: 420, baseType: !556, size: 64, offset: 320)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !922, file: !463, line: 423, baseType: !841, size: 64, offset: 384)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !853, file: !463, line: 744, baseType: !929, size: 384)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !463, line: 429, size: 384, elements: !930)
!930 = !{!931, !932, !933}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !929, file: !463, line: 431, baseType: !856, size: 256)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !929, file: !463, line: 434, baseType: !556, size: 64, offset: 256)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !929, file: !463, line: 437, baseType: !841, size: 64, offset: 320)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !853, file: !463, line: 745, baseType: !935, size: 384)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !463, line: 443, size: 384, elements: !936)
!936 = !{!937, !938, !939}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !935, file: !463, line: 445, baseType: !856, size: 256)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !935, file: !463, line: 449, baseType: !556, size: 64, offset: 256)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !935, file: !463, line: 453, baseType: !841, size: 64, offset: 320)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !853, file: !463, line: 746, baseType: !941, size: 320)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !463, line: 459, size: 320, elements: !942)
!942 = !{!943, !944}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !941, file: !463, line: 461, baseType: !856, size: 256)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !941, file: !463, line: 464, baseType: !556, size: 64, offset: 256)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !853, file: !463, line: 747, baseType: !946, size: 768)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !463, line: 469, size: 768, elements: !947)
!947 = !{!948, !949, !950, !951, !952}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !946, file: !463, line: 471, baseType: !856, size: 256)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !946, file: !463, line: 474, baseType: !7, size: 32, offset: 256)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !946, file: !463, line: 475, baseType: !7, size: 32, offset: 288)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !946, file: !463, line: 478, baseType: !556, size: 64, offset: 320)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !946, file: !463, line: 481, baseType: !953, size: 384, offset: 384)
!953 = !DICompositeType(tag: DW_TAG_array_type, baseType: !954, size: 384, elements: !639)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !6, line: 1917, size: 384, elements: !955)
!955 = !{!956, !957, !958}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !954, file: !6, line: 1920, baseType: !892, size: 256)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !954, file: !6, line: 1921, baseType: !556, size: 64, offset: 256)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !954, file: !6, line: 1922, baseType: !665, size: 32, offset: 320)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !853, file: !463, line: 748, baseType: !960, size: 320)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !463, line: 487, size: 320, elements: !961)
!961 = !{!962, !963}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !960, file: !463, line: 490, baseType: !856, size: 256)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !960, file: !463, line: 494, baseType: !544, size: 32, offset: 256)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !853, file: !463, line: 749, baseType: !965, size: 384)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !463, line: 500, size: 384, elements: !966)
!966 = !{!967, !968, !969}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !965, file: !463, line: 502, baseType: !856, size: 256)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !965, file: !463, line: 506, baseType: !841, size: 64, offset: 256)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !965, file: !463, line: 510, baseType: !841, size: 64, offset: 320)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !853, file: !463, line: 750, baseType: !971, size: 320)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !463, line: 529, size: 320, elements: !972)
!972 = !{!973, !974}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !971, file: !463, line: 531, baseType: !856, size: 256)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !971, file: !463, line: 540, baseType: !841, size: 64, offset: 256)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !853, file: !463, line: 751, baseType: !976, size: 704)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !463, line: 546, size: 704, elements: !977)
!977 = !{!978, !979, !980, !981, !982, !983, !984}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !976, file: !463, line: 549, baseType: !906, size: 512)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !976, file: !463, line: 553, baseType: !549, size: 64, offset: 512)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !976, file: !463, line: 557, baseType: !543, size: 8, offset: 576)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !976, file: !463, line: 558, baseType: !543, size: 8, offset: 584)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !976, file: !463, line: 559, baseType: !543, size: 8, offset: 592)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !976, file: !463, line: 560, baseType: !543, size: 8, offset: 600)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !976, file: !463, line: 566, baseType: !904, size: 64, offset: 640)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !853, file: !463, line: 752, baseType: !986, size: 384)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !463, line: 571, size: 384, elements: !987)
!987 = !{!988, !989}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !986, file: !463, line: 573, baseType: !917, size: 320)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !986, file: !463, line: 577, baseType: !556, size: 64, offset: 320)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !853, file: !463, line: 753, baseType: !991, size: 576)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !463, line: 600, size: 576, elements: !992)
!992 = !{!993, !994, !995, !998, !1007}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !991, file: !463, line: 602, baseType: !917, size: 320)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !991, file: !463, line: 605, baseType: !556, size: 64, offset: 320)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !991, file: !463, line: 609, baseType: !996, size: 64, offset: 384)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !997, line: 46, baseType: !610)
!997 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!998 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !991, file: !463, line: 612, baseType: !999, size: 64, offset: 448)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !463, line: 581, size: 320, elements: !1001)
!1001 = !{!1002, !1003, !1004, !1005, !1006}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1000, file: !463, line: 583, baseType: !5, size: 32)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1000, file: !463, line: 586, baseType: !556, size: 64, offset: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1000, file: !463, line: 589, baseType: !556, size: 64, offset: 128)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1000, file: !463, line: 592, baseType: !556, size: 64, offset: 192)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1000, file: !463, line: 595, baseType: !556, size: 64, offset: 256)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !991, file: !463, line: 616, baseType: !841, size: 64, offset: 512)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !853, file: !463, line: 754, baseType: !1009, size: 512)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !463, line: 622, size: 512, elements: !1010)
!1010 = !{!1011, !1012, !1013, !1014}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1009, file: !463, line: 624, baseType: !917, size: 320)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1009, file: !463, line: 628, baseType: !556, size: 64, offset: 320)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1009, file: !463, line: 632, baseType: !556, size: 64, offset: 384)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1009, file: !463, line: 636, baseType: !556, size: 64, offset: 448)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !853, file: !463, line: 755, baseType: !1016, size: 704)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !463, line: 642, size: 704, elements: !1017)
!1017 = !{!1018, !1019, !1020, !1021}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1016, file: !463, line: 644, baseType: !1009, size: 512)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1016, file: !463, line: 648, baseType: !556, size: 64, offset: 512)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1016, file: !463, line: 652, baseType: !556, size: 64, offset: 576)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1016, file: !463, line: 653, baseType: !556, size: 64, offset: 640)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !853, file: !463, line: 756, baseType: !1023, size: 448)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !463, line: 663, size: 448, elements: !1024)
!1024 = !{!1025, !1026, !1027}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1023, file: !463, line: 665, baseType: !917, size: 320)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1023, file: !463, line: 668, baseType: !556, size: 64, offset: 320)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1023, file: !463, line: 673, baseType: !556, size: 64, offset: 384)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !853, file: !463, line: 757, baseType: !1029, size: 384)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !463, line: 694, size: 384, elements: !1030)
!1030 = !{!1031, !1032}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1029, file: !463, line: 696, baseType: !917, size: 320)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1029, file: !463, line: 699, baseType: !556, size: 64, offset: 320)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !853, file: !463, line: 758, baseType: !1034, size: 384)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !463, line: 681, size: 384, elements: !1035)
!1035 = !{!1036, !1037, !1038}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1034, file: !463, line: 683, baseType: !856, size: 256)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1034, file: !463, line: 686, baseType: !556, size: 64, offset: 256)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1034, file: !463, line: 689, baseType: !556, size: 64, offset: 320)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !853, file: !463, line: 759, baseType: !1040, size: 384)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !463, line: 707, size: 384, elements: !1041)
!1041 = !{!1042, !1043, !1044}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1040, file: !463, line: 709, baseType: !856, size: 256)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1040, file: !463, line: 712, baseType: !556, size: 64, offset: 256)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1040, file: !463, line: 712, baseType: !556, size: 64, offset: 320)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !853, file: !463, line: 760, baseType: !1046, size: 320)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !463, line: 718, size: 320, elements: !1047)
!1047 = !{!1048, !1049}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1046, file: !463, line: 720, baseType: !856, size: 256)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1046, file: !463, line: 723, baseType: !556, size: 64, offset: 256)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !848, file: !463, line: 138, baseType: !847, size: 64, offset: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !848, file: !463, line: 139, baseType: !847, size: 64, offset: 128)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !843, file: !463, line: 146, baseType: !846, size: 64, offset: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !843, file: !463, line: 152, baseType: !841, size: 64, offset: 128)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !838, file: !202, line: 130, baseType: !715, size: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !833, file: !202, line: 134, baseType: !548, size: 64, offset: 192)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !833, file: !202, line: 137, baseType: !556, size: 64, offset: 256)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !833, file: !202, line: 138, baseType: !665, size: 32, offset: 320)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !833, file: !202, line: 142, baseType: !7, size: 32, offset: 352)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !833, file: !202, line: 144, baseType: !544, size: 32, offset: 384)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !833, file: !202, line: 145, baseType: !544, size: 32, offset: 416)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !833, file: !202, line: 146, baseType: !1062, size: 64, offset: 448)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !202, line: 119, baseType: !612)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !816, file: !202, line: 220, baseType: !819, size: 64, offset: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !816, file: !202, line: 223, baseType: !548, size: 64, offset: 128)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !816, file: !202, line: 226, baseType: !1066, size: 64, offset: 192)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !202, line: 185, flags: DIFlagFwdDecl)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !816, file: !202, line: 229, baseType: !1069, size: 128, offset: 256)
!1069 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1070, size: 128, elements: !1072)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !202, line: 229, flags: DIFlagFwdDecl)
!1072 = !{!1073}
!1073 = !DISubrange(count: 2)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !816, file: !202, line: 232, baseType: !815, size: 64, offset: 384)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !816, file: !202, line: 233, baseType: !815, size: 64, offset: 448)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !816, file: !202, line: 238, baseType: !1077, size: 64, offset: 512)
!1077 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !202, line: 235, size: 64, elements: !1078)
!1078 = !{!1079, !1085}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1077, file: !202, line: 236, baseType: !1080, size: 64)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !202, line: 273, size: 128, elements: !1082)
!1082 = !{!1083, !1084}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1081, file: !202, line: 275, baseType: !841, size: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1081, file: !202, line: 278, baseType: !841, size: 64, offset: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1077, file: !202, line: 237, baseType: !1086, size: 64)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !202, line: 259, size: 320, elements: !1088)
!1088 = !{!1089, !1090, !1091, !1092, !1093}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1087, file: !202, line: 261, baseType: !715, size: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1087, file: !202, line: 262, baseType: !715, size: 64, offset: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1087, file: !202, line: 266, baseType: !715, size: 64, offset: 128)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1087, file: !202, line: 267, baseType: !715, size: 64, offset: 192)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1087, file: !202, line: 270, baseType: !544, size: 32, offset: 256)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !816, file: !202, line: 241, baseType: !1062, size: 64, offset: 576)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !816, file: !202, line: 244, baseType: !544, size: 32, offset: 640)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !816, file: !202, line: 247, baseType: !544, size: 32, offset: 672)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !816, file: !202, line: 250, baseType: !544, size: 32, offset: 704)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !816, file: !202, line: 253, baseType: !544, size: 32, offset: 736)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !816, file: !202, line: 256, baseType: !544, size: 32, offset: 768)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !811, file: !202, line: 378, baseType: !814, size: 64, offset: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !811, file: !202, line: 381, baseType: !1102, size: 64, offset: 128)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !202, line: 282, baseType: !1104)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !202, line: 282, size: 128, elements: !1105)
!1105 = !{!1106}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1104, file: !202, line: 282, baseType: !1107, size: 128)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !202, line: 281, baseType: !1108)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !202, line: 281, size: 128, elements: !1109)
!1109 = !{!1110, !1111, !1112}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1108, file: !202, line: 281, baseType: !7, size: 32)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1108, file: !202, line: 281, baseType: !7, size: 32, offset: 32)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1108, file: !202, line: 281, baseType: !1113, size: 64, offset: 64)
!1113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !814, size: 64, elements: !639)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !811, file: !202, line: 384, baseType: !544, size: 32, offset: 192)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !811, file: !202, line: 387, baseType: !544, size: 32, offset: 224)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !811, file: !202, line: 390, baseType: !544, size: 32, offset: 256)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !811, file: !202, line: 394, baseType: !1102, size: 64, offset: 320)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !811, file: !202, line: 396, baseType: !201, size: 32, offset: 384)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !811, file: !202, line: 399, baseType: !1120, size: 64, offset: 416)
!1120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 64, elements: !1072)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !811, file: !202, line: 402, baseType: !1122, size: 64, offset: 480)
!1122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !1072)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !811, file: !202, line: 406, baseType: !544, size: 32, offset: 544)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !811, file: !202, line: 409, baseType: !544, size: 32, offset: 576)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !803, file: !804, line: 470, baseType: !842, size: 64, offset: 128)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !803, file: !804, line: 473, baseType: !1127, size: 64, offset: 192)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !754, line: 39, size: 1152, elements: !1129)
!1129 = !{!1130, !1180, !1193, !1205, !1206, !1275, !1276, !1280, !1281, !1282, !1283, !1284}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1128, file: !754, line: 41, baseType: !1131, size: 64)
!1131 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1132, line: 144, baseType: !1133)
!1132 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64)
!1134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1132, line: 100, size: 896, elements: !1135)
!1135 = !{!1136, !1144, !1149, !1154, !1156, !1157, !1158, !1159, !1160, !1161, !1166, !1168, !1169, !1174, !1179}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1134, file: !1132, line: 102, baseType: !1137, size: 64)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1132, line: 52, baseType: !1138)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64)
!1139 = !DISubroutineType(types: !1140)
!1140 = !{!1141, !1142}
!1141 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1132, line: 47, baseType: !7)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64)
!1143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1134, file: !1132, line: 105, baseType: !1145, size: 64, offset: 64)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1132, line: 59, baseType: !1146)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64)
!1147 = !DISubroutineType(types: !1148)
!1148 = !{!544, !1142, !1142}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1134, file: !1132, line: 108, baseType: !1150, size: 64, offset: 128)
!1150 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1132, line: 63, baseType: !1151)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64)
!1152 = !DISubroutineType(types: !1153)
!1153 = !{null, !548}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1134, file: !1132, line: 111, baseType: !1155, size: 64, offset: 192)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1134, file: !1132, line: 114, baseType: !996, size: 64, offset: 256)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1134, file: !1132, line: 117, baseType: !996, size: 64, offset: 320)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1134, file: !1132, line: 120, baseType: !996, size: 64, offset: 384)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1134, file: !1132, line: 124, baseType: !7, size: 32, offset: 448)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1134, file: !1132, line: 128, baseType: !7, size: 32, offset: 480)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1134, file: !1132, line: 131, baseType: !1162, size: 64, offset: 512)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1132, line: 75, baseType: !1163)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64)
!1164 = !DISubroutineType(types: !1165)
!1165 = !{!548, !996, !996}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1134, file: !1132, line: 132, baseType: !1167, size: 64, offset: 576)
!1167 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1132, line: 78, baseType: !1151)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1134, file: !1132, line: 135, baseType: !548, size: 64, offset: 640)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1134, file: !1132, line: 136, baseType: !1170, size: 64, offset: 704)
!1170 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1132, line: 82, baseType: !1171)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = !DISubroutineType(types: !1173)
!1173 = !{!548, !548, !996, !996}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1134, file: !1132, line: 137, baseType: !1175, size: 64, offset: 768)
!1175 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1132, line: 83, baseType: !1176)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64)
!1177 = !DISubroutineType(types: !1178)
!1178 = !{null, !548, !548}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1134, file: !1132, line: 141, baseType: !7, size: 32, offset: 832)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1128, file: !754, line: 48, baseType: !1181, size: 64, offset: 64)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64)
!1182 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !463, line: 35, baseType: !1183)
!1183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !463, line: 35, size: 128, elements: !1184)
!1184 = !{!1185}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1183, file: !463, line: 35, baseType: !1186, size: 128)
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !463, line: 33, baseType: !1187)
!1187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !463, line: 33, size: 128, elements: !1188)
!1188 = !{!1189, !1190, !1191}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1187, file: !463, line: 33, baseType: !7, size: 32)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1187, file: !463, line: 33, baseType: !7, size: 32, offset: 32)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1187, file: !463, line: 33, baseType: !1192, size: 64, offset: 64)
!1192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !851, size: 64, elements: !639)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1128, file: !754, line: 51, baseType: !1194, size: 64, offset: 128)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64)
!1195 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !6, line: 183, baseType: !1196)
!1196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !6, line: 183, size: 128, elements: !1197)
!1197 = !{!1198}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1196, file: !6, line: 183, baseType: !1199, size: 128)
!1199 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !6, line: 182, baseType: !1200)
!1200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !6, line: 182, size: 128, elements: !1201)
!1201 = !{!1202, !1203, !1204}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1200, file: !6, line: 182, baseType: !7, size: 32)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1200, file: !6, line: 182, baseType: !7, size: 32, offset: 32)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1200, file: !6, line: 182, baseType: !904, size: 64, offset: 64)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1128, file: !754, line: 54, baseType: !556, size: 64, offset: 192)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1128, file: !754, line: 57, baseType: !1207, size: 128, offset: 256)
!1207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1208, line: 31, size: 128, elements: !1209)
!1208 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1209 = !{!1210, !1211, !1212, !1213, !1214, !1215, !1216}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1207, file: !1208, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1207, file: !1208, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1207, file: !1208, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1207, file: !1208, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1207, file: !1208, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1207, file: !1208, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1207, file: !1208, line: 56, baseType: !1217, size: 64, offset: 64)
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !557, line: 47, baseType: !1218)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64)
!1219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1220, line: 75, size: 256, elements: !1221)
!1220 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1221 = !{!1222, !1234, !1235, !1236}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1219, file: !1220, line: 76, baseType: !1223, size: 64)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1220, line: 68, baseType: !1225)
!1225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1220, line: 63, size: 320, elements: !1226)
!1226 = !{!1227, !1229, !1230, !1231}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1225, file: !1220, line: 64, baseType: !1228, size: 64)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1225, file: !1220, line: 65, baseType: !1228, size: 64, offset: 64)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1225, file: !1220, line: 66, baseType: !7, size: 32, offset: 128)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1225, file: !1220, line: 67, baseType: !1232, size: 128, offset: 192)
!1232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1233, size: 128, elements: !1072)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1220, line: 29, baseType: !610)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1219, file: !1220, line: 77, baseType: !1223, size: 64, offset: 64)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1219, file: !1220, line: 78, baseType: !7, size: 32, offset: 128)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1219, file: !1220, line: 79, baseType: !1237, size: 64, offset: 192)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1220, line: 49, baseType: !1239)
!1239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1220, line: 45, size: 832, elements: !1240)
!1240 = !{!1241, !1242, !1243}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1239, file: !1220, line: 46, baseType: !1228, size: 64)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1239, file: !1220, line: 47, baseType: !1218, size: 64, offset: 64)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1239, file: !1220, line: 48, baseType: !1244, size: 704, offset: 128)
!1244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1245, line: 164, size: 704, elements: !1246)
!1245 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1246 = !{!1247, !1248, !1258, !1259, !1260, !1261, !1262, !1263, !1267, !1271, !1272, !1273, !1274}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1244, file: !1245, line: 166, baseType: !612, size: 64)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1244, file: !1245, line: 167, baseType: !1249, size: 64, offset: 64)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64)
!1250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1245, line: 157, size: 192, elements: !1251)
!1251 = !{!1252, !1253, !1254}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1250, file: !1245, line: 159, baseType: !546, size: 64)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1250, file: !1245, line: 160, baseType: !1249, size: 64, offset: 64)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1250, file: !1245, line: 161, baseType: !1255, size: 32, offset: 128)
!1255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !547, size: 32, elements: !1256)
!1256 = !{!1257}
!1257 = !DISubrange(count: 4)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1244, file: !1245, line: 168, baseType: !546, size: 64, offset: 128)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1244, file: !1245, line: 169, baseType: !546, size: 64, offset: 192)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1244, file: !1245, line: 170, baseType: !546, size: 64, offset: 256)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1244, file: !1245, line: 171, baseType: !612, size: 64, offset: 320)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1244, file: !1245, line: 172, baseType: !544, size: 32, offset: 384)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1244, file: !1245, line: 176, baseType: !1264, size: 64, offset: 448)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64)
!1265 = !DISubroutineType(types: !1266)
!1266 = !{!1249, !548, !612}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1244, file: !1245, line: 177, baseType: !1268, size: 64, offset: 512)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64)
!1269 = !DISubroutineType(types: !1270)
!1270 = !{null, !548, !1249}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1244, file: !1245, line: 178, baseType: !548, size: 64, offset: 576)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1244, file: !1245, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1244, file: !1245, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1244, file: !1245, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !1128, file: !754, line: 60, baseType: !1207, size: 128, offset: 384)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !1128, file: !754, line: 64, baseType: !1277, size: 64, offset: 512)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64)
!1278 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1279, line: 33, flags: DIFlagFwdDecl)
!1279 = !DIFile(filename: "./pointer-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !1128, file: !754, line: 67, baseType: !556, size: 64, offset: 576)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !1128, file: !754, line: 73, baseType: !1131, size: 64, offset: 640)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !1128, file: !754, line: 77, baseType: !1217, size: 64, offset: 704)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !1128, file: !754, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !1128, file: !754, line: 82, baseType: !1285, size: 320, offset: 832)
!1285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !456, line: 62, size: 320, elements: !1286)
!1286 = !{!1287, !1293, !1294, !1295, !1296, !1297}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1285, file: !456, line: 63, baseType: !1288, size: 64)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64)
!1289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !456, line: 56, size: 128, elements: !1290)
!1290 = !{!1291, !1292}
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1289, file: !456, line: 57, baseType: !1288, size: 64)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1289, file: !456, line: 58, baseType: !638, size: 8, offset: 64)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1285, file: !456, line: 64, baseType: !7, size: 32, offset: 64)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1285, file: !456, line: 66, baseType: !7, size: 32, offset: 96)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1285, file: !456, line: 68, baseType: !543, size: 8, offset: 128)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1285, file: !456, line: 70, baseType: !880, size: 64, offset: 192)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1285, file: !456, line: 71, baseType: !887, size: 64, offset: 256)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !803, file: !804, line: 476, baseType: !1299, size: 64, offset: 256)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64)
!1300 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !804, line: 476, flags: DIFlagFwdDecl)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !803, file: !804, line: 479, baseType: !1131, size: 64, offset: 320)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !803, file: !804, line: 484, baseType: !556, size: 64, offset: 384)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !803, file: !804, line: 488, baseType: !556, size: 64, offset: 448)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !803, file: !804, line: 493, baseType: !556, size: 64, offset: 512)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !803, file: !804, line: 496, baseType: !556, size: 64, offset: 576)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !803, file: !804, line: 501, baseType: !1307, size: 64, offset: 640)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64)
!1308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !213, line: 2355, size: 576, elements: !1309)
!1309 = !{!1310, !1313, !1314, !1315, !1316, !1318, !1319, !1324, !1325, !1326, !1327, !1328, !1329}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1308, file: !213, line: 2356, baseType: !1311, size: 64)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64)
!1312 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !213, line: 2356, flags: DIFlagFwdDecl)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1308, file: !213, line: 2357, baseType: !549, size: 64, offset: 64)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1308, file: !213, line: 2358, baseType: !544, size: 32, offset: 128)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1308, file: !213, line: 2359, baseType: !544, size: 32, offset: 160)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1308, file: !213, line: 2360, baseType: !1317, size: 128, offset: 192)
!1317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !544, size: 128, elements: !1256)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1308, file: !213, line: 2364, baseType: !544, size: 32, offset: 320)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1308, file: !213, line: 2367, baseType: !1320, size: 128, offset: 384)
!1320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !213, line: 2349, size: 128, elements: !1321)
!1321 = !{!1322, !1323}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1320, file: !213, line: 2351, baseType: !715, size: 64)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1320, file: !213, line: 2352, baseType: !612, size: 64, offset: 64)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1308, file: !213, line: 2371, baseType: !212, size: 32, offset: 512)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1308, file: !213, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1308, file: !213, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1308, file: !213, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1308, file: !213, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1308, file: !213, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !803, file: !804, line: 504, baseType: !1331, size: 64, offset: 704)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64)
!1332 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !804, line: 504, flags: DIFlagFwdDecl)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !803, file: !804, line: 507, baseType: !1131, size: 64, offset: 768)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !803, file: !804, line: 510, baseType: !544, size: 32, offset: 832)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !803, file: !804, line: 513, baseType: !544, size: 32, offset: 864)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !803, file: !804, line: 516, baseType: !665, size: 32, offset: 896)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !803, file: !804, line: 519, baseType: !665, size: 32, offset: 928)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !803, file: !804, line: 522, baseType: !7, size: 32, offset: 960)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !803, file: !804, line: 523, baseType: !7, size: 32, offset: 992)
