; ModuleID = 'ipa-type-escape.bc'
source_filename = "ipa-type-escape.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.bitmap_head_def = type { %struct.bitmap_element_def*, %struct.bitmap_element_def*, i32, %struct.bitmap_obstack* }
%struct.bitmap_element_def = type { %struct.bitmap_element_def*, %struct.bitmap_element_def*, i32, [2 x i64] }
%struct.bitmap_obstack = type { %struct.bitmap_element_def*, %struct.bitmap_head_def*, %struct.obstack }
%struct.obstack = type { i64, %struct._obstack_chunk*, i8*, i8*, i8*, i64, i32, %struct._obstack_chunk* (i8*, i64)*, void (i8*, %struct._obstack_chunk*)*, i8*, i8 }
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [4 x i8] }
%struct.splay_tree_s = type { %struct.splay_tree_node_s*, i32 (i64, i64)*, void (i64)*, void (i64)*, i8* (i32, i8*)*, void (i8*, i8*)*, i8* }
%struct.splay_tree_node_s = type { i64, i64, %struct.splay_tree_node_s*, %struct.splay_tree_node_s* }
%struct.pointer_set_t = type opaque
%struct.simple_ipa_opt_pass = type { %struct.opt_pass }

!513 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!514 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!515 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!516 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!517 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!518 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!519 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_rhs_class", file: !440, line: 80, baseType: !7, size: 32, elements: !520)
!520 = !{!521, !522, !523, !524}
!521 = !DIEnumerator(name: "GIMPLE_INVALID_RHS", value: 0, isUnsigned: true)
!522 = !DIEnumerator(name: "GIMPLE_BINARY_RHS", value: 1, isUnsigned: true)
!523 = !DIEnumerator(name: "GIMPLE_UNARY_RHS", value: 2, isUnsigned: true)
!524 = !DIEnumerator(name: "GIMPLE_SINGLE_RHS", value: 3, isUnsigned: true)
!525 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !526, line: 309, baseType: !7, size: 32, elements: !527)
!526 = !DIFile(filename: "./cgraph.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!527 = !{!528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547}
!528 = !DIEnumerator(name: "CIF_OK", value: 0, isUnsigned: true)
!529 = !DIEnumerator(name: "CIF_UNSPECIFIED", value: 1, isUnsigned: true)
!530 = !DIEnumerator(name: "CIF_FUNCTION_NOT_CONSIDERED", value: 2, isUnsigned: true)
!531 = !DIEnumerator(name: "CIF_BODY_NOT_AVAILABLE", value: 3, isUnsigned: true)
!532 = !DIEnumerator(name: "CIF_REDEFINED_EXTERN_INLINE", value: 4, isUnsigned: true)
!533 = !DIEnumerator(name: "CIF_FUNCTION_NOT_INLINABLE", value: 5, isUnsigned: true)
!534 = !DIEnumerator(name: "CIF_FUNCTION_NOT_INLINE_CANDIDATE", value: 6, isUnsigned: true)
!535 = !DIEnumerator(name: "CIF_LARGE_FUNCTION_GROWTH_LIMIT", value: 7, isUnsigned: true)
!536 = !DIEnumerator(name: "CIF_LARGE_STACK_FRAME_GROWTH_LIMIT", value: 8, isUnsigned: true)
!537 = !DIEnumerator(name: "CIF_MAX_INLINE_INSNS_SINGLE_LIMIT", value: 9, isUnsigned: true)
!538 = !DIEnumerator(name: "CIF_MAX_INLINE_INSNS_AUTO_LIMIT", value: 10, isUnsigned: true)
!539 = !DIEnumerator(name: "CIF_INLINE_UNIT_GROWTH_LIMIT", value: 11, isUnsigned: true)
!540 = !DIEnumerator(name: "CIF_RECURSIVE_INLINING", value: 12, isUnsigned: true)
!541 = !DIEnumerator(name: "CIF_UNLIKELY_CALL", value: 13, isUnsigned: true)
!542 = !DIEnumerator(name: "CIF_NOT_DECLARED_INLINED", value: 14, isUnsigned: true)
!543 = !DIEnumerator(name: "CIF_OPTIMIZING_FOR_SIZE", value: 15, isUnsigned: true)
!544 = !DIEnumerator(name: "CIF_TARGET_OPTION_MISMATCH", value: 16, isUnsigned: true)
!545 = !DIEnumerator(name: "CIF_MISMATCHED_ARGUMENTS", value: 17, isUnsigned: true)
!546 = !DIEnumerator(name: "CIF_ORIGINALLY_INDIRECT_CALL", value: 18, isUnsigned: true)
!547 = !DIEnumerator(name: "CIF_N_REASONS", value: 19, isUnsigned: true)
!548 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "availability", file: !526, line: 27, baseType: !7, size: 32, elements: !549)
!549 = !{!550, !551, !552, !553, !554}
!550 = !DIEnumerator(name: "AVAIL_UNSET", value: 0, isUnsigned: true)
!551 = !DIEnumerator(name: "AVAIL_NOT_AVAILABLE", value: 1, isUnsigned: true)
!552 = !DIEnumerator(name: "AVAIL_OVERWRITABLE", value: 2, isUnsigned: true)
!553 = !DIEnumerator(name: "AVAIL_AVAILABLE", value: 3, isUnsigned: true)
!554 = !DIEnumerator(name: "AVAIL_LOCAL", value: 4, isUnsigned: true)
!555 = !{!556, !557, !558, !559, !562, !563, !5, !565, !569, !631, !1741, !1746, !1747, !924, !1753, !957, !560, !1755, !519}
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!558 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !561)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "splay_tree_key", file: !566, line: 62, baseType: !567)
!566 = !DIFile(filename: "./include/splay-tree.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "libi_uhostptr_t", file: !566, line: 41, baseType: !568)
!568 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !570, line: 47, baseType: !571)
!570 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !573, line: 75, size: 256, elements: !574)
!573 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!574 = !{!575, !589, !590, !591}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !572, file: !573, line: 76, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !573, line: 68, baseType: !578)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !573, line: 63, size: 320, elements: !579)
!579 = !{!580, !582, !583, !584}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !578, file: !573, line: 64, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !578, file: !573, line: 65, baseType: !581, size: 64, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !578, file: !573, line: 66, baseType: !7, size: 32, offset: 128)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !578, file: !573, line: 67, baseType: !585, size: 128, offset: 192)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, size: 128, elements: !587)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !573, line: 29, baseType: !568)
!587 = !{!588}
!588 = !DISubrange(count: 2)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !572, file: !573, line: 77, baseType: !576, size: 64, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !572, file: !573, line: 78, baseType: !7, size: 32, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !572, file: !573, line: 79, baseType: !592, size: 64, offset: 192)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !573, line: 49, baseType: !594)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !573, line: 45, size: 832, elements: !595)
!595 = !{!596, !597, !598}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !594, file: !573, line: 46, baseType: !581, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !594, file: !573, line: 47, baseType: !571, size: 64, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !594, file: !573, line: 48, baseType: !599, size: 704, offset: 128)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !600, line: 164, size: 704, elements: !601)
!600 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!601 = !{!602, !604, !614, !615, !616, !617, !618, !619, !623, !627, !628, !629, !630}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !599, file: !600, line: 166, baseType: !603, size: 64)
!603 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !599, file: !600, line: 167, baseType: !605, size: 64, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !600, line: 157, size: 192, elements: !607)
!607 = !{!608, !609, !610}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !606, file: !600, line: 159, baseType: !560, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !606, file: !600, line: 160, baseType: !605, size: 64, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !606, file: !600, line: 161, baseType: !611, size: 32, offset: 128)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !561, size: 32, elements: !612)
!612 = !{!613}
!613 = !DISubrange(count: 4)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !599, file: !600, line: 168, baseType: !560, size: 64, offset: 128)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !599, file: !600, line: 169, baseType: !560, size: 64, offset: 192)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !599, file: !600, line: 170, baseType: !560, size: 64, offset: 256)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !599, file: !600, line: 171, baseType: !603, size: 64, offset: 320)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !599, file: !600, line: 172, baseType: !558, size: 32, offset: 384)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !599, file: !600, line: 176, baseType: !620, size: 64, offset: 448)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{!605, !562, !603}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !599, file: !600, line: 177, baseType: !624, size: 64, offset: 512)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DISubroutineType(types: !626)
!626 = !{null, !562, !605}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !599, file: !600, line: 178, baseType: !562, size: 64, offset: 576)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !599, file: !600, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !599, file: !600, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !599, file: !600, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !570, line: 56, baseType: !632)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !6, line: 3371, size: 1792, elements: !634)
!634 = !{!635, !668, !674, !685, !692, !699, !704, !713, !719, !732, !744, !782, !790, !818, !835, !836, !841, !850, !856, !861, !865, !869, !1390, !1439, !1445, !1451, !1458, !1471, !1485, !1502, !1514, !1536, !1551, !1723}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !633, file: !6, line: 3372, baseType: !636, size: 64)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !6, line: 360, size: 64, elements: !637)
!637 = !{!638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !636, file: !6, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !636, file: !6, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !636, file: !6, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !636, file: !6, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !636, file: !6, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !636, file: !6, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !636, file: !6, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !636, file: !6, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !636, file: !6, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !636, file: !6, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !636, file: !6, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !636, file: !6, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !636, file: !6, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !636, file: !6, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !636, file: !6, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !636, file: !6, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !636, file: !6, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !636, file: !6, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !636, file: !6, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !636, file: !6, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !636, file: !6, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !636, file: !6, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !636, file: !6, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !636, file: !6, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !636, file: !6, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !636, file: !6, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !636, file: !6, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !636, file: !6, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !636, file: !6, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !636, file: !6, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !633, file: !6, line: 3373, baseType: !669, size: 192)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !6, line: 402, size: 192, elements: !670)
!670 = !{!671, !672, !673}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !669, file: !6, line: 403, baseType: !636, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !669, file: !6, line: 404, baseType: !631, size: 64, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !669, file: !6, line: 405, baseType: !631, size: 64, offset: 128)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !633, file: !6, line: 3374, baseType: !675, size: 320)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !6, line: 1384, size: 320, elements: !676)
!676 = !{!677, !678}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !675, file: !6, line: 1385, baseType: !669, size: 192)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !675, file: !6, line: 1386, baseType: !679, size: 128, offset: 192)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !680, line: 58, baseType: !681)
!680 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !680, line: 54, size: 128, elements: !682)
!682 = !{!683, !684}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !681, file: !680, line: 56, baseType: !568, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !681, file: !680, line: 57, baseType: !603, size: 64, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !633, file: !6, line: 3375, baseType: !686, size: 256)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !6, line: 1397, size: 256, elements: !687)
!687 = !{!688, !689}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !686, file: !6, line: 1398, baseType: !669, size: 192)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !686, file: !6, line: 1399, baseType: !690, size: 64, offset: 192)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !6, line: 1392, flags: DIFlagFwdDecl)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !633, file: !6, line: 3376, baseType: !693, size: 256)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !6, line: 1408, size: 256, elements: !694)
!694 = !{!695, !696}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !693, file: !6, line: 1409, baseType: !669, size: 192)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !693, file: !6, line: 1410, baseType: !697, size: 64, offset: 192)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !6, line: 1403, flags: DIFlagFwdDecl)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !633, file: !6, line: 3377, baseType: !700, size: 256)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !6, line: 1437, size: 256, elements: !701)
!701 = !{!702, !703}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !700, file: !6, line: 1438, baseType: !669, size: 192)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !700, file: !6, line: 1439, baseType: !631, size: 64, offset: 192)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !633, file: !6, line: 3378, baseType: !705, size: 256)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !6, line: 1418, size: 256, elements: !706)
!706 = !{!707, !708, !709}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !705, file: !6, line: 1419, baseType: !669, size: 192)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !705, file: !6, line: 1420, baseType: !558, size: 32, offset: 192)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !705, file: !6, line: 1421, baseType: !710, size: 8, offset: 224)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !561, size: 8, elements: !711)
!711 = !{!712}
!712 = !DISubrange(count: 1)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !633, file: !6, line: 3379, baseType: !714, size: 320)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !6, line: 1428, size: 320, elements: !715)
!715 = !{!716, !717, !718}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !714, file: !6, line: 1429, baseType: !669, size: 192)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !714, file: !6, line: 1430, baseType: !631, size: 64, offset: 192)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !714, file: !6, line: 1431, baseType: !631, size: 64, offset: 256)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !633, file: !6, line: 3380, baseType: !720, size: 320)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !6, line: 1460, size: 320, elements: !721)
!721 = !{!722, !723}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !720, file: !6, line: 1461, baseType: !669, size: 192)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !720, file: !6, line: 1462, baseType: !724, size: 128, offset: 192)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !725, line: 31, size: 128, elements: !726)
!725 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!726 = !{!727, !730, !731}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !724, file: !725, line: 32, baseType: !728, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !557)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !724, file: !725, line: 33, baseType: !7, size: 32, offset: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !724, file: !725, line: 34, baseType: !7, size: 32, offset: 96)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !633, file: !6, line: 3381, baseType: !733, size: 384)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !6, line: 2507, size: 384, elements: !734)
!734 = !{!735, !736, !741, !742, !743}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !733, file: !6, line: 2508, baseType: !669, size: 192)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !733, file: !6, line: 2509, baseType: !737, size: 32, offset: 192)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !738, line: 58, baseType: !739)
!738 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !740, line: 44, baseType: !7)
!740 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!741 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !733, file: !6, line: 2510, baseType: !7, size: 32, offset: 224)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !733, file: !6, line: 2511, baseType: !631, size: 64, offset: 256)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !733, file: !6, line: 2512, baseType: !631, size: 64, offset: 320)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !633, file: !6, line: 3382, baseType: !745, size: 896)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !6, line: 2652, size: 896, elements: !746)
!746 = !{!747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !745, file: !6, line: 2653, baseType: !733, size: 384)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !745, file: !6, line: 2654, baseType: !631, size: 64, offset: 384)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !745, file: !6, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !745, file: !6, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !745, file: !6, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !745, file: !6, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !745, file: !6, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !745, file: !6, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !745, file: !6, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !745, file: !6, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !745, file: !6, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !745, file: !6, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !745, file: !6, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !745, file: !6, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !745, file: !6, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !745, file: !6, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !745, file: !6, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !745, file: !6, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !745, file: !6, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !745, file: !6, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !745, file: !6, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !745, file: !6, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !745, file: !6, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !745, file: !6, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !745, file: !6, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !745, file: !6, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !745, file: !6, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !745, file: !6, line: 2703, baseType: !7, size: 32, offset: 512)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !745, file: !6, line: 2705, baseType: !631, size: 64, offset: 576)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !745, file: !6, line: 2706, baseType: !631, size: 64, offset: 640)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !745, file: !6, line: 2707, baseType: !631, size: 64, offset: 704)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !745, file: !6, line: 2708, baseType: !631, size: 64, offset: 768)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !745, file: !6, line: 2711, baseType: !780, size: 64, offset: 832)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !6, line: 2711, flags: DIFlagFwdDecl)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !633, file: !6, line: 3383, baseType: !783, size: 960)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !6, line: 2756, size: 960, elements: !784)
!784 = !{!785, !786}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !783, file: !6, line: 2757, baseType: !745, size: 896)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !783, file: !6, line: 2758, baseType: !787, size: 64, offset: 896)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !570, line: 50, baseType: !788)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !570, line: 49, flags: DIFlagFwdDecl)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !633, file: !6, line: 3384, baseType: !791, size: 1472)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !6, line: 3114, size: 1472, elements: !792)
!792 = !{!793, !814, !815, !816, !817}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !791, file: !6, line: 3115, baseType: !794, size: 1216)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !6, line: 2984, size: 1216, elements: !795)
!795 = !{!796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !794, file: !6, line: 2985, baseType: !783, size: 960)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !794, file: !6, line: 2986, baseType: !631, size: 64, offset: 960)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !794, file: !6, line: 2987, baseType: !631, size: 64, offset: 1024)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !794, file: !6, line: 2988, baseType: !631, size: 64, offset: 1088)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !794, file: !6, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !794, file: !6, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !794, file: !6, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !794, file: !6, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !794, file: !6, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !794, file: !6, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !794, file: !6, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !794, file: !6, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !794, file: !6, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !794, file: !6, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !794, file: !6, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !794, file: !6, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !794, file: !6, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !794, file: !6, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !791, file: !6, line: 3117, baseType: !631, size: 64, offset: 1216)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !791, file: !6, line: 3119, baseType: !631, size: 64, offset: 1280)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !791, file: !6, line: 3121, baseType: !631, size: 64, offset: 1344)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !791, file: !6, line: 3123, baseType: !631, size: 64, offset: 1408)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !633, file: !6, line: 3385, baseType: !819, size: 1088)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !6, line: 2874, size: 1088, elements: !820)
!820 = !{!821, !822, !823}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !819, file: !6, line: 2875, baseType: !783, size: 960)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !819, file: !6, line: 2876, baseType: !787, size: 64, offset: 960)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !819, file: !6, line: 2877, baseType: !824, size: 64, offset: 1024)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !826, line: 172, size: 128, elements: !827)
!826 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!827 = !{!828, !829, !830, !831, !832, !833, !834}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !825, file: !826, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !825, file: !826, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !825, file: !826, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !825, file: !826, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !825, file: !826, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !825, file: !826, line: 195, baseType: !7, size: 32, offset: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !825, file: !826, line: 199, baseType: !631, size: 64, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !633, file: !6, line: 3386, baseType: !794, size: 1216)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !633, file: !6, line: 3387, baseType: !837, size: 1280)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !6, line: 3093, size: 1280, elements: !838)
!838 = !{!839, !840}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !837, file: !6, line: 3094, baseType: !794, size: 1216)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !837, file: !6, line: 3095, baseType: !824, size: 64, offset: 1216)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !633, file: !6, line: 3388, baseType: !842, size: 1216)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !6, line: 2824, size: 1216, elements: !843)
!843 = !{!844, !845, !846, !847, !848, !849}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !842, file: !6, line: 2825, baseType: !745, size: 896)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !842, file: !6, line: 2827, baseType: !631, size: 64, offset: 896)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !842, file: !6, line: 2828, baseType: !631, size: 64, offset: 960)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !842, file: !6, line: 2829, baseType: !631, size: 64, offset: 1024)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !842, file: !6, line: 2830, baseType: !631, size: 64, offset: 1088)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !842, file: !6, line: 2831, baseType: !631, size: 64, offset: 1152)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !633, file: !6, line: 3389, baseType: !851, size: 1024)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !6, line: 2850, size: 1024, elements: !852)
!852 = !{!853, !854, !855}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !851, file: !6, line: 2851, baseType: !783, size: 960)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !851, file: !6, line: 2852, baseType: !558, size: 32, offset: 960)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !851, file: !6, line: 2853, baseType: !558, size: 32, offset: 992)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !633, file: !6, line: 3390, baseType: !857, size: 1024)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !6, line: 2857, size: 1024, elements: !858)
!858 = !{!859, !860}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !857, file: !6, line: 2858, baseType: !783, size: 960)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !857, file: !6, line: 2859, baseType: !824, size: 64, offset: 960)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !633, file: !6, line: 3391, baseType: !862, size: 960)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !6, line: 2862, size: 960, elements: !863)
!863 = !{!864}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !862, file: !6, line: 2863, baseType: !783, size: 960)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !633, file: !6, line: 3392, baseType: !866, size: 1472)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !6, line: 3304, size: 1472, elements: !867)
!867 = !{!868}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !866, file: !6, line: 3305, baseType: !791, size: 1472)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !633, file: !6, line: 3393, baseType: !870, size: 1792)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !6, line: 3248, size: 1792, elements: !871)
!871 = !{!872, !873, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !870, file: !6, line: 3249, baseType: !791, size: 1472)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !870, file: !6, line: 3251, baseType: !874, size: 64, offset: 1472)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !876, line: 463, size: 1152, elements: !877)
!876 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!877 = !{!878, !881, !1195, !1196, !1310, !1313, !1314, !1315, !1316, !1317, !1318, !1342, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !875, file: !876, line: 464, baseType: !879, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !876, line: 464, flags: DIFlagFwdDecl)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !875, file: !876, line: 467, baseType: !882, size: 64, offset: 64)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !202, line: 374, size: 640, elements: !884)
!884 = !{!885, !1170, !1171, !1184, !1185, !1186, !1187, !1188, !1189, !1191, !1193, !1194}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !883, file: !202, line: 377, baseType: !886, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !570, line: 111, baseType: !887)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !202, line: 217, size: 832, elements: !889)
!889 = !{!890, !1135, !1136, !1137, !1140, !1144, !1145, !1146, !1164, !1165, !1166, !1167, !1168, !1169}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !888, file: !202, line: 219, baseType: !891, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !202, line: 151, baseType: !893)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !202, line: 151, size: 128, elements: !894)
!894 = !{!895}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !893, file: !202, line: 151, baseType: !896, size: 128)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !202, line: 150, baseType: !897)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !202, line: 150, size: 128, elements: !898)
!898 = !{!899, !900, !901}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !897, file: !202, line: 150, baseType: !7, size: 32)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !897, file: !202, line: 150, baseType: !7, size: 32, offset: 32)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !897, file: !202, line: 150, baseType: !902, size: 64, offset: 64)
!902 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 64, elements: !711)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !570, line: 108, baseType: !904)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !202, line: 122, size: 512, elements: !906)
!906 = !{!907, !908, !909, !1127, !1128, !1129, !1130, !1131, !1132, !1133}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !905, file: !202, line: 124, baseType: !887, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !905, file: !202, line: 125, baseType: !887, size: 64, offset: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !905, file: !202, line: 131, baseType: !910, size: 64, offset: 128)
!910 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !202, line: 128, size: 64, elements: !911)
!911 = !{!912, !1126}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !910, file: !202, line: 129, baseType: !913, size: 64)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !570, line: 66, baseType: !914)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !440, line: 143, size: 192, elements: !916)
!916 = !{!917, !1124, !1125}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !915, file: !440, line: 145, baseType: !918, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !570, line: 69, baseType: !919)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !440, line: 136, size: 192, elements: !921)
!921 = !{!922, !1122, !1123}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !920, file: !440, line: 137, baseType: !923, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !570, line: 58, baseType: !924)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !440, line: 737, size: 768, elements: !926)
!926 = !{!927, !944, !977, !983, !988, !993, !1000, !1006, !1012, !1017, !1031, !1036, !1042, !1047, !1057, !1062, !1080, !1087, !1094, !1100, !1105, !1111, !1117}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !925, file: !440, line: 738, baseType: !928, size: 256)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !440, line: 271, size: 256, elements: !929)
!929 = !{!930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !928, file: !440, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !928, file: !440, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !928, file: !440, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !928, file: !440, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !928, file: !440, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !928, file: !440, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !928, file: !440, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !928, file: !440, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !928, file: !440, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !928, file: !440, line: 312, baseType: !7, size: 32, offset: 32)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !928, file: !440, line: 316, baseType: !737, size: 32, offset: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !928, file: !440, line: 319, baseType: !7, size: 32, offset: 96)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !928, file: !440, line: 323, baseType: !887, size: 64, offset: 128)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !928, file: !440, line: 327, baseType: !631, size: 64, offset: 192)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !925, file: !440, line: 739, baseType: !945, size: 448)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !440, line: 350, size: 448, elements: !946)
!946 = !{!947, !975}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !945, file: !440, line: 353, baseType: !948, size: 384)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !440, line: 333, size: 384, elements: !949)
!949 = !{!950, !951, !958}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !948, file: !440, line: 336, baseType: !928, size: 256)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !948, file: !440, line: 343, baseType: !952, size: 64, offset: 256)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !433, line: 37, size: 128, elements: !954)
!954 = !{!955, !956}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !953, file: !433, line: 39, baseType: !952, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !953, file: !433, line: 40, baseType: !957, size: 64, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !948, file: !440, line: 344, baseType: !959, size: 64, offset: 320)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !433, line: 45, size: 320, elements: !961)
!961 = !{!962, !963}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !960, file: !433, line: 47, baseType: !959, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !960, file: !433, line: 48, baseType: !964, size: 256, offset: 64)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !6, line: 1883, size: 256, elements: !965)
!965 = !{!966, !968, !969, !974}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !964, file: !6, line: 1884, baseType: !967, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !964, file: !6, line: 1885, baseType: !967, size: 64, offset: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !964, file: !6, line: 1891, baseType: !970, size: 64, offset: 128)
!970 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !964, file: !6, line: 1891, size: 64, elements: !971)
!971 = !{!972, !973}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !970, file: !6, line: 1891, baseType: !923, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !970, file: !6, line: 1891, baseType: !631, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !964, file: !6, line: 1892, baseType: !957, size: 64, offset: 192)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !945, file: !440, line: 359, baseType: !976, size: 64, offset: 384)
!976 = !DICompositeType(tag: DW_TAG_array_type, baseType: !631, size: 64, elements: !711)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !925, file: !440, line: 740, baseType: !978, size: 512)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !440, line: 365, size: 512, elements: !979)
!979 = !{!980, !981, !982}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !978, file: !440, line: 368, baseType: !948, size: 384)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !978, file: !440, line: 373, baseType: !631, size: 64, offset: 384)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !978, file: !440, line: 374, baseType: !631, size: 64, offset: 448)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !925, file: !440, line: 741, baseType: !984, size: 576)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !440, line: 380, size: 576, elements: !985)
!985 = !{!986, !987}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !984, file: !440, line: 383, baseType: !978, size: 512)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !984, file: !440, line: 389, baseType: !976, size: 64, offset: 512)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !925, file: !440, line: 742, baseType: !989, size: 320)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !440, line: 395, size: 320, elements: !990)
!990 = !{!991, !992}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !989, file: !440, line: 397, baseType: !928, size: 256)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !989, file: !440, line: 400, baseType: !913, size: 64, offset: 256)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !925, file: !440, line: 743, baseType: !994, size: 448)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !440, line: 406, size: 448, elements: !995)
!995 = !{!996, !997, !998, !999}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !994, file: !440, line: 408, baseType: !928, size: 256)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !994, file: !440, line: 412, baseType: !631, size: 64, offset: 256)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !994, file: !440, line: 420, baseType: !631, size: 64, offset: 320)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !994, file: !440, line: 423, baseType: !913, size: 64, offset: 384)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !925, file: !440, line: 744, baseType: !1001, size: 384)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !440, line: 429, size: 384, elements: !1002)
!1002 = !{!1003, !1004, !1005}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1001, file: !440, line: 431, baseType: !928, size: 256)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1001, file: !440, line: 434, baseType: !631, size: 64, offset: 256)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1001, file: !440, line: 437, baseType: !913, size: 64, offset: 320)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !925, file: !440, line: 745, baseType: !1007, size: 384)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !440, line: 443, size: 384, elements: !1008)
!1008 = !{!1009, !1010, !1011}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1007, file: !440, line: 445, baseType: !928, size: 256)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1007, file: !440, line: 449, baseType: !631, size: 64, offset: 256)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1007, file: !440, line: 453, baseType: !913, size: 64, offset: 320)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !925, file: !440, line: 746, baseType: !1013, size: 320)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !440, line: 459, size: 320, elements: !1014)
!1014 = !{!1015, !1016}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1013, file: !440, line: 461, baseType: !928, size: 256)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1013, file: !440, line: 464, baseType: !631, size: 64, offset: 256)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !925, file: !440, line: 747, baseType: !1018, size: 768)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !440, line: 469, size: 768, elements: !1019)
!1019 = !{!1020, !1021, !1022, !1023, !1024}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1018, file: !440, line: 471, baseType: !928, size: 256)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1018, file: !440, line: 474, baseType: !7, size: 32, offset: 256)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1018, file: !440, line: 475, baseType: !7, size: 32, offset: 288)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1018, file: !440, line: 478, baseType: !631, size: 64, offset: 320)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1018, file: !440, line: 481, baseType: !1025, size: 384, offset: 384)
!1025 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1026, size: 384, elements: !711)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !6, line: 1917, size: 384, elements: !1027)
!1027 = !{!1028, !1029, !1030}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1026, file: !6, line: 1920, baseType: !964, size: 256)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1026, file: !6, line: 1921, baseType: !631, size: 64, offset: 256)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1026, file: !6, line: 1922, baseType: !737, size: 32, offset: 320)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !925, file: !440, line: 748, baseType: !1032, size: 320)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !440, line: 487, size: 320, elements: !1033)
!1033 = !{!1034, !1035}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1032, file: !440, line: 490, baseType: !928, size: 256)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1032, file: !440, line: 494, baseType: !558, size: 32, offset: 256)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !925, file: !440, line: 749, baseType: !1037, size: 384)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !440, line: 500, size: 384, elements: !1038)
!1038 = !{!1039, !1040, !1041}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1037, file: !440, line: 502, baseType: !928, size: 256)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1037, file: !440, line: 506, baseType: !913, size: 64, offset: 256)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1037, file: !440, line: 510, baseType: !913, size: 64, offset: 320)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !925, file: !440, line: 750, baseType: !1043, size: 320)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !440, line: 529, size: 320, elements: !1044)
!1044 = !{!1045, !1046}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1043, file: !440, line: 531, baseType: !928, size: 256)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1043, file: !440, line: 540, baseType: !913, size: 64, offset: 256)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !925, file: !440, line: 751, baseType: !1048, size: 704)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !440, line: 546, size: 704, elements: !1049)
!1049 = !{!1050, !1051, !1052, !1053, !1054, !1055, !1056}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1048, file: !440, line: 549, baseType: !978, size: 512)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1048, file: !440, line: 553, baseType: !563, size: 64, offset: 512)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1048, file: !440, line: 557, baseType: !557, size: 8, offset: 576)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1048, file: !440, line: 558, baseType: !557, size: 8, offset: 584)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1048, file: !440, line: 559, baseType: !557, size: 8, offset: 592)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1048, file: !440, line: 560, baseType: !557, size: 8, offset: 600)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1048, file: !440, line: 566, baseType: !976, size: 64, offset: 640)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !925, file: !440, line: 752, baseType: !1058, size: 384)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !440, line: 571, size: 384, elements: !1059)
!1059 = !{!1060, !1061}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1058, file: !440, line: 573, baseType: !989, size: 320)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1058, file: !440, line: 577, baseType: !631, size: 64, offset: 320)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !925, file: !440, line: 753, baseType: !1063, size: 576)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !440, line: 600, size: 576, elements: !1064)
!1064 = !{!1065, !1066, !1067, !1070, !1079}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1063, file: !440, line: 602, baseType: !989, size: 320)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1063, file: !440, line: 605, baseType: !631, size: 64, offset: 320)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1063, file: !440, line: 609, baseType: !1068, size: 64, offset: 384)
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1069, line: 46, baseType: !568)
!1069 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1063, file: !440, line: 612, baseType: !1071, size: 64, offset: 448)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !440, line: 581, size: 320, elements: !1073)
!1073 = !{!1074, !1075, !1076, !1077, !1078}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1072, file: !440, line: 583, baseType: !5, size: 32)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1072, file: !440, line: 586, baseType: !631, size: 64, offset: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1072, file: !440, line: 589, baseType: !631, size: 64, offset: 128)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1072, file: !440, line: 592, baseType: !631, size: 64, offset: 192)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1072, file: !440, line: 595, baseType: !631, size: 64, offset: 256)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1063, file: !440, line: 616, baseType: !913, size: 64, offset: 512)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !925, file: !440, line: 754, baseType: !1081, size: 512)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !440, line: 622, size: 512, elements: !1082)
!1082 = !{!1083, !1084, !1085, !1086}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1081, file: !440, line: 624, baseType: !989, size: 320)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1081, file: !440, line: 628, baseType: !631, size: 64, offset: 320)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1081, file: !440, line: 632, baseType: !631, size: 64, offset: 384)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1081, file: !440, line: 636, baseType: !631, size: 64, offset: 448)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !925, file: !440, line: 755, baseType: !1088, size: 704)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !440, line: 642, size: 704, elements: !1089)
!1089 = !{!1090, !1091, !1092, !1093}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1088, file: !440, line: 644, baseType: !1081, size: 512)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1088, file: !440, line: 648, baseType: !631, size: 64, offset: 512)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1088, file: !440, line: 652, baseType: !631, size: 64, offset: 576)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1088, file: !440, line: 653, baseType: !631, size: 64, offset: 640)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !925, file: !440, line: 756, baseType: !1095, size: 448)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !440, line: 663, size: 448, elements: !1096)
!1096 = !{!1097, !1098, !1099}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1095, file: !440, line: 665, baseType: !989, size: 320)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1095, file: !440, line: 668, baseType: !631, size: 64, offset: 320)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1095, file: !440, line: 673, baseType: !631, size: 64, offset: 384)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !925, file: !440, line: 757, baseType: !1101, size: 384)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !440, line: 694, size: 384, elements: !1102)
!1102 = !{!1103, !1104}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1101, file: !440, line: 696, baseType: !989, size: 320)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1101, file: !440, line: 699, baseType: !631, size: 64, offset: 320)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !925, file: !440, line: 758, baseType: !1106, size: 384)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !440, line: 681, size: 384, elements: !1107)
!1107 = !{!1108, !1109, !1110}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1106, file: !440, line: 683, baseType: !928, size: 256)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1106, file: !440, line: 686, baseType: !631, size: 64, offset: 256)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1106, file: !440, line: 689, baseType: !631, size: 64, offset: 320)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !925, file: !440, line: 759, baseType: !1112, size: 384)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !440, line: 707, size: 384, elements: !1113)
!1113 = !{!1114, !1115, !1116}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1112, file: !440, line: 709, baseType: !928, size: 256)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1112, file: !440, line: 712, baseType: !631, size: 64, offset: 256)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1112, file: !440, line: 712, baseType: !631, size: 64, offset: 320)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !925, file: !440, line: 760, baseType: !1118, size: 320)
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !440, line: 718, size: 320, elements: !1119)
!1119 = !{!1120, !1121}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1118, file: !440, line: 720, baseType: !928, size: 256)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1118, file: !440, line: 723, baseType: !631, size: 64, offset: 256)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !920, file: !440, line: 138, baseType: !919, size: 64, offset: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !920, file: !440, line: 139, baseType: !919, size: 64, offset: 128)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !915, file: !440, line: 146, baseType: !918, size: 64, offset: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !915, file: !440, line: 152, baseType: !913, size: 64, offset: 128)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !910, file: !202, line: 130, baseType: !787, size: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !905, file: !202, line: 134, baseType: !562, size: 64, offset: 192)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !905, file: !202, line: 137, baseType: !631, size: 64, offset: 256)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !905, file: !202, line: 138, baseType: !737, size: 32, offset: 320)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !905, file: !202, line: 142, baseType: !7, size: 32, offset: 352)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !905, file: !202, line: 144, baseType: !558, size: 32, offset: 384)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !905, file: !202, line: 145, baseType: !558, size: 32, offset: 416)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !905, file: !202, line: 146, baseType: !1134, size: 64, offset: 448)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !202, line: 119, baseType: !603)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !888, file: !202, line: 220, baseType: !891, size: 64, offset: 64)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !888, file: !202, line: 223, baseType: !562, size: 64, offset: 128)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !888, file: !202, line: 226, baseType: !1138, size: 64, offset: 192)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64)
!1139 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !202, line: 185, flags: DIFlagFwdDecl)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !888, file: !202, line: 229, baseType: !1141, size: 128, offset: 256)
!1141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1142, size: 128, elements: !587)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64)
!1143 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !202, line: 229, flags: DIFlagFwdDecl)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !888, file: !202, line: 232, baseType: !887, size: 64, offset: 384)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !888, file: !202, line: 233, baseType: !887, size: 64, offset: 448)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !888, file: !202, line: 238, baseType: !1147, size: 64, offset: 512)
!1147 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !202, line: 235, size: 64, elements: !1148)
!1148 = !{!1149, !1155}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1147, file: !202, line: 236, baseType: !1150, size: 64)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !202, line: 273, size: 128, elements: !1152)
!1152 = !{!1153, !1154}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1151, file: !202, line: 275, baseType: !913, size: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1151, file: !202, line: 278, baseType: !913, size: 64, offset: 64)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1147, file: !202, line: 237, baseType: !1156, size: 64)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !202, line: 259, size: 320, elements: !1158)
!1158 = !{!1159, !1160, !1161, !1162, !1163}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1157, file: !202, line: 261, baseType: !787, size: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1157, file: !202, line: 262, baseType: !787, size: 64, offset: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1157, file: !202, line: 266, baseType: !787, size: 64, offset: 128)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1157, file: !202, line: 267, baseType: !787, size: 64, offset: 192)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1157, file: !202, line: 270, baseType: !558, size: 32, offset: 256)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !888, file: !202, line: 241, baseType: !1134, size: 64, offset: 576)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !888, file: !202, line: 244, baseType: !558, size: 32, offset: 640)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !888, file: !202, line: 247, baseType: !558, size: 32, offset: 672)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !888, file: !202, line: 250, baseType: !558, size: 32, offset: 704)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !888, file: !202, line: 253, baseType: !558, size: 32, offset: 736)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !888, file: !202, line: 256, baseType: !558, size: 32, offset: 768)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !883, file: !202, line: 378, baseType: !886, size: 64, offset: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !883, file: !202, line: 381, baseType: !1172, size: 64, offset: 128)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64)
!1173 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !202, line: 282, baseType: !1174)
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !202, line: 282, size: 128, elements: !1175)
!1175 = !{!1176}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1174, file: !202, line: 282, baseType: !1177, size: 128)
!1177 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !202, line: 281, baseType: !1178)
!1178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !202, line: 281, size: 128, elements: !1179)
!1179 = !{!1180, !1181, !1182}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1178, file: !202, line: 281, baseType: !7, size: 32)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1178, file: !202, line: 281, baseType: !7, size: 32, offset: 32)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1178, file: !202, line: 281, baseType: !1183, size: 64, offset: 64)
!1183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !886, size: 64, elements: !711)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !883, file: !202, line: 384, baseType: !558, size: 32, offset: 192)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !883, file: !202, line: 387, baseType: !558, size: 32, offset: 224)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !883, file: !202, line: 390, baseType: !558, size: 32, offset: 256)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !883, file: !202, line: 394, baseType: !1172, size: 64, offset: 320)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !883, file: !202, line: 396, baseType: !201, size: 32, offset: 384)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !883, file: !202, line: 399, baseType: !1190, size: 64, offset: 416)
!1190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 64, elements: !587)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !883, file: !202, line: 402, baseType: !1192, size: 64, offset: 480)
!1192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !587)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !883, file: !202, line: 406, baseType: !558, size: 32, offset: 544)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !883, file: !202, line: 409, baseType: !558, size: 32, offset: 576)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !875, file: !876, line: 470, baseType: !914, size: 64, offset: 128)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !875, file: !876, line: 473, baseType: !1197, size: 64, offset: 192)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64)
!1198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !826, line: 39, size: 1152, elements: !1199)
!1199 = !{!1200, !1250, !1263, !1275, !1276, !1287, !1288, !1292, !1293, !1294, !1295, !1296}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1198, file: !826, line: 41, baseType: !1201, size: 64)
!1201 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1202, line: 144, baseType: !1203)
!1202 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64)
!1204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1202, line: 100, size: 896, elements: !1205)
!1205 = !{!1206, !1214, !1219, !1224, !1226, !1227, !1228, !1229, !1230, !1231, !1236, !1238, !1239, !1244, !1249}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1204, file: !1202, line: 102, baseType: !1207, size: 64)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1202, line: 52, baseType: !1208)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64)
!1209 = !DISubroutineType(types: !1210)
!1210 = !{!1211, !1212}
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1202, line: 47, baseType: !7)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64)
!1213 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1204, file: !1202, line: 105, baseType: !1215, size: 64, offset: 64)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1202, line: 59, baseType: !1216)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1217 = !DISubroutineType(types: !1218)
!1218 = !{!558, !1212, !1212}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1204, file: !1202, line: 108, baseType: !1220, size: 64, offset: 128)
!1220 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1202, line: 63, baseType: !1221)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64)
!1222 = !DISubroutineType(types: !1223)
!1223 = !{null, !562}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1204, file: !1202, line: 111, baseType: !1225, size: 64, offset: 192)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1204, file: !1202, line: 114, baseType: !1068, size: 64, offset: 256)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1204, file: !1202, line: 117, baseType: !1068, size: 64, offset: 320)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1204, file: !1202, line: 120, baseType: !1068, size: 64, offset: 384)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1204, file: !1202, line: 124, baseType: !7, size: 32, offset: 448)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1204, file: !1202, line: 128, baseType: !7, size: 32, offset: 480)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1204, file: !1202, line: 131, baseType: !1232, size: 64, offset: 512)
!1232 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1202, line: 75, baseType: !1233)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64)
!1234 = !DISubroutineType(types: !1235)
!1235 = !{!562, !1068, !1068}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1204, file: !1202, line: 132, baseType: !1237, size: 64, offset: 576)
!1237 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1202, line: 78, baseType: !1221)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1204, file: !1202, line: 135, baseType: !562, size: 64, offset: 640)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1204, file: !1202, line: 136, baseType: !1240, size: 64, offset: 704)
!1240 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1202, line: 82, baseType: !1241)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64)
!1242 = !DISubroutineType(types: !1243)
!1243 = !{!562, !562, !1068, !1068}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1204, file: !1202, line: 137, baseType: !1245, size: 64, offset: 768)
!1245 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1202, line: 83, baseType: !1246)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64)
!1247 = !DISubroutineType(types: !1248)
!1248 = !{null, !562, !562}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1204, file: !1202, line: 141, baseType: !7, size: 32, offset: 832)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1198, file: !826, line: 48, baseType: !1251, size: 64, offset: 64)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64)
!1252 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !440, line: 35, baseType: !1253)
!1253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !440, line: 35, size: 128, elements: !1254)
!1254 = !{!1255}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1253, file: !440, line: 35, baseType: !1256, size: 128)
!1256 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !440, line: 33, baseType: !1257)
!1257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !440, line: 33, size: 128, elements: !1258)
!1258 = !{!1259, !1260, !1261}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1257, file: !440, line: 33, baseType: !7, size: 32)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1257, file: !440, line: 33, baseType: !7, size: 32, offset: 32)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1257, file: !440, line: 33, baseType: !1262, size: 64, offset: 64)
!1262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !923, size: 64, elements: !711)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1198, file: !826, line: 51, baseType: !1264, size: 64, offset: 128)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64)
!1265 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !6, line: 183, baseType: !1266)
!1266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !6, line: 183, size: 128, elements: !1267)
!1267 = !{!1268}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1266, file: !6, line: 183, baseType: !1269, size: 128)
!1269 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !6, line: 182, baseType: !1270)
!1270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !6, line: 182, size: 128, elements: !1271)
!1271 = !{!1272, !1273, !1274}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1270, file: !6, line: 182, baseType: !7, size: 32)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1270, file: !6, line: 182, baseType: !7, size: 32, offset: 32)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1270, file: !6, line: 182, baseType: !976, size: 64, offset: 64)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1198, file: !826, line: 54, baseType: !631, size: 64, offset: 192)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1198, file: !826, line: 57, baseType: !1277, size: 128, offset: 256)
!1277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1278, line: 31, size: 128, elements: !1279)
!1278 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1279 = !{!1280, !1281, !1282, !1283, !1284, !1285, !1286}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1277, file: !1278, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1277, file: !1278, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1277, file: !1278, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1277, file: !1278, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1277, file: !1278, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1277, file: !1278, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1277, file: !1278, line: 56, baseType: !569, size: 64, offset: 64)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !1198, file: !826, line: 60, baseType: !1277, size: 128, offset: 384)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !1198, file: !826, line: 64, baseType: !1289, size: 64, offset: 512)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64)
!1290 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1291, line: 33, flags: DIFlagFwdDecl)
!1291 = !DIFile(filename: "./pointer-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !1198, file: !826, line: 67, baseType: !631, size: 64, offset: 576)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !1198, file: !826, line: 73, baseType: !1201, size: 64, offset: 640)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !1198, file: !826, line: 77, baseType: !569, size: 64, offset: 704)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !1198, file: !826, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !1198, file: !826, line: 82, baseType: !1297, size: 320, offset: 832)
!1297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !433, line: 62, size: 320, elements: !1298)
!1298 = !{!1299, !1305, !1306, !1307, !1308, !1309}
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1297, file: !433, line: 63, baseType: !1300, size: 64)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64)
!1301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !433, line: 56, size: 128, elements: !1302)
!1302 = !{!1303, !1304}
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1301, file: !433, line: 57, baseType: !1300, size: 64)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1301, file: !433, line: 58, baseType: !710, size: 8, offset: 64)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1297, file: !433, line: 64, baseType: !7, size: 32, offset: 64)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1297, file: !433, line: 66, baseType: !7, size: 32, offset: 96)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1297, file: !433, line: 68, baseType: !557, size: 8, offset: 128)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1297, file: !433, line: 70, baseType: !952, size: 64, offset: 192)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1297, file: !433, line: 71, baseType: !959, size: 64, offset: 256)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !875, file: !876, line: 476, baseType: !1311, size: 64, offset: 256)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64)
!1312 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !876, line: 476, flags: DIFlagFwdDecl)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !875, file: !876, line: 479, baseType: !1201, size: 64, offset: 320)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !875, file: !876, line: 484, baseType: !631, size: 64, offset: 384)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !875, file: !876, line: 488, baseType: !631, size: 64, offset: 448)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !875, file: !876, line: 493, baseType: !631, size: 64, offset: 512)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !875, file: !876, line: 496, baseType: !631, size: 64, offset: 576)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !875, file: !876, line: 501, baseType: !1319, size: 64, offset: 640)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64)
!1320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !213, line: 2355, size: 576, elements: !1321)
!1321 = !{!1322, !1325, !1326, !1327, !1328, !1330, !1331, !1336, !1337, !1338, !1339, !1340, !1341}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1320, file: !213, line: 2356, baseType: !1323, size: 64)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64)
!1324 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !213, line: 2356, flags: DIFlagFwdDecl)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1320, file: !213, line: 2357, baseType: !563, size: 64, offset: 64)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1320, file: !213, line: 2358, baseType: !558, size: 32, offset: 128)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1320, file: !213, line: 2359, baseType: !558, size: 32, offset: 160)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1320, file: !213, line: 2360, baseType: !1329, size: 128, offset: 192)
!1329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 128, elements: !612)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1320, file: !213, line: 2364, baseType: !558, size: 32, offset: 320)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1320, file: !213, line: 2367, baseType: !1332, size: 128, offset: 384)
!1332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !213, line: 2349, size: 128, elements: !1333)
!1333 = !{!1334, !1335}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1332, file: !213, line: 2351, baseType: !787, size: 64)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1332, file: !213, line: 2352, baseType: !603, size: 64, offset: 64)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1320, file: !213, line: 2371, baseType: !212, size: 32, offset: 512)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1320, file: !213, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1320, file: !213, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1320, file: !213, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1320, file: !213, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1320, file: !213, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !875, file: !876, line: 504, baseType: !1343, size: 64, offset: 704)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64)
!1344 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !876, line: 504, flags: DIFlagFwdDecl)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !875, file: !876, line: 507, baseType: !1201, size: 64, offset: 768)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !875, file: !876, line: 510, baseType: !558, size: 32, offset: 832)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !875, file: !876, line: 513, baseType: !558, size: 32, offset: 864)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !875, file: !876, line: 516, baseType: !737, size: 32, offset: 896)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !875, file: !876, line: 519, baseType: !737, size: 32, offset: 928)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !875, file: !876, line: 522, baseType: !7, size: 32, offset: 960)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !875, file: !876, line: 523, baseType: !7, size: 32, offset: 992)
