; ModuleID = 'ipa-struct-reorg.bc'
source_filename = "ipa-struct-reorg.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.htab = type { i32 (i8*)*, i32 (i8*, i8*)*, void (i8*)*, i8**, i64, i64, i64, i32, i32, i8* (i64, i64)*, void (i8*)*, i8*, i8* (i8*, i64, i64)*, void (i8*, i8*)*, i32 }
%struct.simple_ipa_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.VEC_structure_heap = type { %struct.VEC_structure_base }
%struct.VEC_structure_base = type { i32, i32, [1 x %struct.data_structure] }
%struct.data_structure = type { %union.tree_node*, i32, i64, %struct.field_entry*, %struct.htab*, %struct.field_cluster*, %struct.VEC_tree_heap* }
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }

!616 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!617 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!618 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!619 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!620 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!621 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!622 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "availability", file: !561, line: 27, baseType: !7, size: 32, elements: !623)
!623 = !{!624, !625, !626, !627, !628}
!624 = !DIEnumerator(name: "AVAIL_UNSET", value: 0, isUnsigned: true)
!625 = !DIEnumerator(name: "AVAIL_NOT_AVAILABLE", value: 1, isUnsigned: true)
!626 = !DIEnumerator(name: "AVAIL_OVERWRITABLE", value: 2, isUnsigned: true)
!627 = !DIEnumerator(name: "AVAIL_AVAILABLE", value: 3, isUnsigned: true)
!628 = !DIEnumerator(name: "AVAIL_LOCAL", value: 4, isUnsigned: true)
!629 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !584, line: 727, baseType: !7, size: 32, elements: !630)
!630 = !{!631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654}
!631 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!632 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!633 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!634 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!635 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!636 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!637 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!638 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!639 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!640 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!641 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!642 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!643 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!644 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!645 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!646 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!647 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!648 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!649 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!650 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!651 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!652 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!653 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!654 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!655 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_rhs_class", file: !584, line: 80, baseType: !7, size: 32, elements: !656)
!656 = !{!657, !658, !659, !660}
!657 = !DIEnumerator(name: "GIMPLE_INVALID_RHS", value: 0, isUnsigned: true)
!658 = !DIEnumerator(name: "GIMPLE_BINARY_RHS", value: 1, isUnsigned: true)
!659 = !DIEnumerator(name: "GIMPLE_UNARY_RHS", value: 2, isUnsigned: true)
!660 = !DIEnumerator(name: "GIMPLE_SINGLE_RHS", value: 3, isUnsigned: true)
!661 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ssa_op_iter_type", file: !662, line: 119, baseType: !7, size: 32, elements: !663)
!662 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!663 = !{!664, !665, !666, !667}
!664 = !DIEnumerator(name: "ssa_op_iter_none", value: 0, isUnsigned: true)
!665 = !DIEnumerator(name: "ssa_op_iter_tree", value: 1, isUnsigned: true)
!666 = !DIEnumerator(name: "ssa_op_iter_use", value: 2, isUnsigned: true)
!667 = !DIEnumerator(name: "ssa_op_iter_def", value: 3, isUnsigned: true)
!668 = !{!669, !670, !671, !672, !675, !676, !678, !1977, !317, !690, !7, !1997, !2023, !2036, !2039, !2045, !2069, !2071, !2073, !2075, !2078, !1015, !2037, !1048, !673, !2081, !2046, !2047, !2052, !2084, !1014, !2074, !2072, !655, !2103, !2108, !1224, !744, !2007, !2113, !2120, !2121, !2122, !2139, !817, !2140, !2146}
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!671 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !674)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_heap", file: !318, line: 184, baseType: !680)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_heap", file: !318, line: 184, size: 128, elements: !681)
!681 = !{!682}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !680, file: !318, line: 184, baseType: !683, size: 128)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !318, line: 182, baseType: !684)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !318, line: 182, size: 128, elements: !685)
!685 = !{!686, !687, !688}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !684, file: !318, line: 182, baseType: !7, size: 32)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !684, file: !318, line: 182, baseType: !7, size: 32, offset: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !684, file: !318, line: 182, baseType: !689, size: 64, offset: 64)
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !690, size: 64, elements: !789)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !691, line: 56, baseType: !692)
!691 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !318, line: 3371, size: 1792, elements: !694)
!694 = !{!695, !728, !734, !747, !766, !777, !782, !791, !797, !810, !822, !860, !1316, !1344, !1361, !1362, !1367, !1376, !1382, !1387, !1391, !1395, !1628, !1675, !1681, !1687, !1694, !1707, !1721, !1738, !1750, !1772, !1787, !1959}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !693, file: !318, line: 3372, baseType: !696, size: 64)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !318, line: 360, size: 64, elements: !697)
!697 = !{!698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !696, file: !318, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !696, file: !318, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !696, file: !318, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !696, file: !318, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !696, file: !318, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !696, file: !318, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !696, file: !318, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !696, file: !318, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !696, file: !318, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !696, file: !318, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !696, file: !318, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !696, file: !318, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !696, file: !318, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !696, file: !318, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !696, file: !318, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !696, file: !318, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !696, file: !318, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !696, file: !318, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !696, file: !318, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !696, file: !318, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !696, file: !318, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !696, file: !318, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !696, file: !318, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !696, file: !318, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !696, file: !318, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !696, file: !318, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !696, file: !318, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !696, file: !318, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !696, file: !318, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !696, file: !318, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !693, file: !318, line: 3373, baseType: !729, size: 192)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !318, line: 402, size: 192, elements: !730)
!730 = !{!731, !732, !733}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !729, file: !318, line: 403, baseType: !696, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !729, file: !318, line: 404, baseType: !690, size: 64, offset: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !729, file: !318, line: 405, baseType: !690, size: 64, offset: 128)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !693, file: !318, line: 3374, baseType: !735, size: 320)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !318, line: 1384, size: 320, elements: !736)
!736 = !{!737, !738}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !735, file: !318, line: 1385, baseType: !729, size: 192)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !735, file: !318, line: 1386, baseType: !739, size: 128, offset: 192)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !740, line: 58, baseType: !741)
!740 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !740, line: 54, size: 128, elements: !742)
!742 = !{!743, !745}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !741, file: !740, line: 56, baseType: !744, size: 64)
!744 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !741, file: !740, line: 57, baseType: !746, size: 64, offset: 64)
!746 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !693, file: !318, line: 3375, baseType: !748, size: 256)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !318, line: 1397, size: 256, elements: !749)
!749 = !{!750, !751}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !748, file: !318, line: 1398, baseType: !729, size: 192)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !748, file: !318, line: 1399, baseType: !752, size: 64, offset: 192)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !754, line: 52, size: 256, elements: !755)
!754 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!755 = !{!756, !757, !758, !759, !760, !761, !762}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !753, file: !754, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !753, file: !754, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !753, file: !754, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !753, file: !754, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !753, file: !754, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !753, file: !754, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !753, file: !754, line: 62, baseType: !763, size: 192, offset: 64)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !744, size: 192, elements: !764)
!764 = !{!765}
!765 = !DISubrange(count: 3)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !693, file: !318, line: 3376, baseType: !767, size: 256)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !318, line: 1408, size: 256, elements: !768)
!768 = !{!769, !770}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !767, file: !318, line: 1409, baseType: !729, size: 192)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !767, file: !318, line: 1410, baseType: !771, size: 64, offset: 192)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !773, line: 27, size: 192, elements: !774)
!773 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!774 = !{!775, !776}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !772, file: !773, line: 29, baseType: !739, size: 128)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !772, file: !773, line: 30, baseType: !189, size: 32, offset: 128)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !693, file: !318, line: 3377, baseType: !778, size: 256)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !318, line: 1437, size: 256, elements: !779)
!779 = !{!780, !781}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !778, file: !318, line: 1438, baseType: !729, size: 192)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !778, file: !318, line: 1439, baseType: !690, size: 64, offset: 192)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !693, file: !318, line: 3378, baseType: !783, size: 256)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !318, line: 1418, size: 256, elements: !784)
!784 = !{!785, !786, !787}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !783, file: !318, line: 1419, baseType: !729, size: 192)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !783, file: !318, line: 1420, baseType: !671, size: 32, offset: 192)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !783, file: !318, line: 1421, baseType: !788, size: 8, offset: 224)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !674, size: 8, elements: !789)
!789 = !{!790}
!790 = !DISubrange(count: 1)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !693, file: !318, line: 3379, baseType: !792, size: 320)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !318, line: 1428, size: 320, elements: !793)
!793 = !{!794, !795, !796}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !792, file: !318, line: 1429, baseType: !729, size: 192)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !792, file: !318, line: 1430, baseType: !690, size: 64, offset: 192)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !792, file: !318, line: 1431, baseType: !690, size: 64, offset: 256)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !693, file: !318, line: 3380, baseType: !798, size: 320)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !318, line: 1460, size: 320, elements: !799)
!799 = !{!800, !801}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !798, file: !318, line: 1461, baseType: !729, size: 192)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !798, file: !318, line: 1462, baseType: !802, size: 128, offset: 192)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !803, line: 31, size: 128, elements: !804)
!803 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!804 = !{!805, !808, !809}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !802, file: !803, line: 32, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !670)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !802, file: !803, line: 33, baseType: !7, size: 32, offset: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !802, file: !803, line: 34, baseType: !7, size: 32, offset: 96)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !693, file: !318, line: 3381, baseType: !811, size: 384)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !318, line: 2507, size: 384, elements: !812)
!812 = !{!813, !814, !819, !820, !821}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !811, file: !318, line: 2508, baseType: !729, size: 192)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !811, file: !318, line: 2509, baseType: !815, size: 32, offset: 192)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !816, line: 58, baseType: !817)
!816 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !818, line: 44, baseType: !7)
!818 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!819 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !811, file: !318, line: 2510, baseType: !7, size: 32, offset: 224)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !811, file: !318, line: 2511, baseType: !690, size: 64, offset: 256)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !811, file: !318, line: 2512, baseType: !690, size: 64, offset: 320)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !693, file: !318, line: 3382, baseType: !823, size: 896)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !318, line: 2652, size: 896, elements: !824)
!824 = !{!825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !823, file: !318, line: 2653, baseType: !811, size: 384)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !823, file: !318, line: 2654, baseType: !690, size: 64, offset: 384)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !823, file: !318, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !823, file: !318, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !823, file: !318, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !823, file: !318, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !823, file: !318, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !823, file: !318, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !823, file: !318, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !823, file: !318, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !823, file: !318, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !823, file: !318, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !823, file: !318, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !823, file: !318, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !823, file: !318, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !823, file: !318, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !823, file: !318, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !823, file: !318, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !823, file: !318, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !823, file: !318, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !823, file: !318, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !823, file: !318, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !823, file: !318, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !823, file: !318, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !823, file: !318, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !823, file: !318, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !823, file: !318, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !823, file: !318, line: 2703, baseType: !7, size: 32, offset: 512)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !823, file: !318, line: 2705, baseType: !690, size: 64, offset: 576)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !823, file: !318, line: 2706, baseType: !690, size: 64, offset: 640)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !823, file: !318, line: 2707, baseType: !690, size: 64, offset: 704)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !823, file: !318, line: 2708, baseType: !690, size: 64, offset: 768)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !823, file: !318, line: 2711, baseType: !858, size: 64, offset: 832)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !318, line: 2711, flags: DIFlagFwdDecl)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !693, file: !318, line: 3383, baseType: !861, size: 960)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !318, line: 2756, size: 960, elements: !862)
!862 = !{!863, !864}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !861, file: !318, line: 2757, baseType: !823, size: 896)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !861, file: !318, line: 2758, baseType: !865, size: 64, offset: 896)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !691, line: 50, baseType: !866)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !868, line: 240, size: 384, elements: !869)
!868 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!869 = !{!870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !867, file: !868, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !867, file: !868, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !867, file: !868, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !867, file: !868, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !867, file: !868, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !867, file: !868, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !867, file: !868, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !867, file: !868, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !867, file: !868, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !867, file: !868, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !867, file: !868, line: 321, baseType: !881, size: 320, offset: 64)
!881 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !868, line: 315, size: 320, elements: !882)
!882 = !{!883, !1283, !1285, !1314, !1315}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !881, file: !868, line: 316, baseType: !884, size: 64)
!884 = !DICompositeType(tag: DW_TAG_array_type, baseType: !885, size: 64, elements: !789)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !868, line: 183, baseType: !886)
!886 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !868, line: 166, size: 64, elements: !887)
!887 = !{!888, !889, !890, !891, !892, !900, !901, !913, !916, !976, !977, !1260, !1273, !1280}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !886, file: !868, line: 168, baseType: !671, size: 32)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !886, file: !868, line: 169, baseType: !7, size: 32)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !886, file: !868, line: 170, baseType: !676, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !886, file: !868, line: 171, baseType: !865, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !886, file: !868, line: 172, baseType: !893, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !691, line: 53, baseType: !894)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !868, line: 359, size: 128, elements: !896)
!896 = !{!897, !898}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !895, file: !868, line: 360, baseType: !671, size: 32)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !895, file: !868, line: 361, baseType: !899, size: 64, offset: 64)
!899 = !DICompositeType(tag: DW_TAG_array_type, baseType: !865, size: 64, elements: !789)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !886, file: !868, line: 173, baseType: !189, size: 32)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !886, file: !868, line: 174, baseType: !902, size: 32)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !868, line: 133, baseType: !903)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !868, line: 115, size: 32, elements: !904)
!904 = !{!905, !906, !907, !908, !909, !910, !911, !912}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !903, file: !868, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !903, file: !868, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !903, file: !868, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !903, file: !868, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !903, file: !868, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !903, file: !868, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !903, file: !868, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !903, file: !868, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !886, file: !868, line: 175, baseType: !914, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !868, line: 175, flags: DIFlagFwdDecl)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !886, file: !868, line: 176, baseType: !917, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !919, line: 75, size: 256, elements: !920)
!919 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!920 = !{!921, !935, !936, !937}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !918, file: !919, line: 76, baseType: !922, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !919, line: 68, baseType: !924)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !919, line: 63, size: 320, elements: !925)
!925 = !{!926, !928, !929, !930}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !924, file: !919, line: 64, baseType: !927, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !924, file: !919, line: 65, baseType: !927, size: 64, offset: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !924, file: !919, line: 66, baseType: !7, size: 32, offset: 128)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !924, file: !919, line: 67, baseType: !931, size: 128, offset: 192)
!931 = !DICompositeType(tag: DW_TAG_array_type, baseType: !932, size: 128, elements: !933)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !919, line: 29, baseType: !744)
!933 = !{!934}
!934 = !DISubrange(count: 2)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !918, file: !919, line: 77, baseType: !922, size: 64, offset: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !918, file: !919, line: 78, baseType: !7, size: 32, offset: 128)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !918, file: !919, line: 79, baseType: !938, size: 64, offset: 192)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !919, line: 49, baseType: !940)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !919, line: 45, size: 832, elements: !941)
!941 = !{!942, !943, !944}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !940, file: !919, line: 46, baseType: !927, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !940, file: !919, line: 47, baseType: !917, size: 64, offset: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !940, file: !919, line: 48, baseType: !945, size: 704, offset: 128)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !946, line: 164, size: 704, elements: !947)
!946 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!947 = !{!948, !949, !959, !960, !961, !962, !963, !964, !968, !972, !973, !974, !975}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !945, file: !946, line: 166, baseType: !746, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !945, file: !946, line: 167, baseType: !950, size: 64, offset: 64)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !946, line: 157, size: 192, elements: !952)
!952 = !{!953, !954, !955}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !951, file: !946, line: 159, baseType: !673, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !951, file: !946, line: 160, baseType: !950, size: 64, offset: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !951, file: !946, line: 161, baseType: !956, size: 32, offset: 128)
!956 = !DICompositeType(tag: DW_TAG_array_type, baseType: !674, size: 32, elements: !957)
!957 = !{!958}
!958 = !DISubrange(count: 4)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !945, file: !946, line: 168, baseType: !673, size: 64, offset: 128)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !945, file: !946, line: 169, baseType: !673, size: 64, offset: 192)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !945, file: !946, line: 170, baseType: !673, size: 64, offset: 256)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !945, file: !946, line: 171, baseType: !746, size: 64, offset: 320)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !945, file: !946, line: 172, baseType: !671, size: 32, offset: 384)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !945, file: !946, line: 176, baseType: !965, size: 64, offset: 448)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{!950, !675, !746}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !945, file: !946, line: 177, baseType: !969, size: 64, offset: 512)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DISubroutineType(types: !971)
!971 = !{null, !675, !950}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !945, file: !946, line: 178, baseType: !675, size: 64, offset: 576)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !945, file: !946, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !945, file: !946, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !945, file: !946, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !886, file: !868, line: 177, baseType: !690, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !886, file: !868, line: 178, baseType: !978, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !513, line: 217, size: 832, elements: !980)
!980 = !{!981, !1225, !1226, !1227, !1230, !1234, !1235, !1236, !1254, !1255, !1256, !1257, !1258, !1259}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !979, file: !513, line: 219, baseType: !982, size: 64)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !513, line: 151, baseType: !984)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !513, line: 151, size: 128, elements: !985)
!985 = !{!986}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !984, file: !513, line: 151, baseType: !987, size: 128)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !513, line: 150, baseType: !988)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !513, line: 150, size: 128, elements: !989)
!989 = !{!990, !991, !992}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !988, file: !513, line: 150, baseType: !7, size: 32)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !988, file: !513, line: 150, baseType: !7, size: 32, offset: 32)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !988, file: !513, line: 150, baseType: !993, size: 64, offset: 64)
!993 = !DICompositeType(tag: DW_TAG_array_type, baseType: !994, size: 64, elements: !789)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !691, line: 108, baseType: !995)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !513, line: 122, size: 512, elements: !997)
!997 = !{!998, !999, !1000, !1217, !1218, !1219, !1220, !1221, !1222, !1223}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !996, file: !513, line: 124, baseType: !978, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !996, file: !513, line: 125, baseType: !978, size: 64, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !996, file: !513, line: 131, baseType: !1001, size: 64, offset: 128)
!1001 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !513, line: 128, size: 64, elements: !1002)
!1002 = !{!1003, !1216}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1001, file: !513, line: 129, baseType: !1004, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !691, line: 66, baseType: !1005)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !584, line: 143, size: 192, elements: !1007)
!1007 = !{!1008, !1214, !1215}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1006, file: !584, line: 145, baseType: !1009, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !691, line: 69, baseType: !1010)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !584, line: 136, size: 192, elements: !1012)
!1012 = !{!1013, !1212, !1213}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1011, file: !584, line: 137, baseType: !1014, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !691, line: 58, baseType: !1015)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !584, line: 737, size: 768, elements: !1017)
!1017 = !{!1018, !1035, !1067, !1073, !1078, !1083, !1090, !1096, !1102, !1107, !1121, !1126, !1132, !1137, !1147, !1152, !1170, !1177, !1184, !1190, !1195, !1201, !1207}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1016, file: !584, line: 738, baseType: !1019, size: 256)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !584, line: 271, size: 256, elements: !1020)
!1020 = !{!1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1019, file: !584, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !1019, file: !584, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1019, file: !584, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !1019, file: !584, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !1019, file: !584, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !1019, file: !584, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !1019, file: !584, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1019, file: !584, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !1019, file: !584, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1019, file: !584, line: 312, baseType: !7, size: 32, offset: 32)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !1019, file: !584, line: 316, baseType: !815, size: 32, offset: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !1019, file: !584, line: 319, baseType: !7, size: 32, offset: 96)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1019, file: !584, line: 323, baseType: !978, size: 64, offset: 128)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1019, file: !584, line: 327, baseType: !690, size: 64, offset: 192)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !1016, file: !584, line: 739, baseType: !1036, size: 448)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !584, line: 350, size: 448, elements: !1037)
!1037 = !{!1038, !1066}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1036, file: !584, line: 353, baseType: !1039, size: 384)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !584, line: 333, size: 384, elements: !1040)
!1040 = !{!1041, !1042, !1049}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1039, file: !584, line: 336, baseType: !1019, size: 256)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !1039, file: !584, line: 343, baseType: !1043, size: 64, offset: 256)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !662, line: 37, size: 128, elements: !1045)
!1045 = !{!1046, !1047}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1044, file: !662, line: 39, baseType: !1043, size: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1044, file: !662, line: 40, baseType: !1048, size: 64, offset: 64)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !1039, file: !584, line: 344, baseType: !1050, size: 64, offset: 320)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !662, line: 45, size: 320, elements: !1052)
!1052 = !{!1053, !1054}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1051, file: !662, line: 47, baseType: !1050, size: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1051, file: !662, line: 48, baseType: !1055, size: 256, offset: 64)
!1055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !318, line: 1883, size: 256, elements: !1056)
!1056 = !{!1057, !1059, !1060, !1065}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1055, file: !318, line: 1884, baseType: !1058, size: 64)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1055, file: !318, line: 1885, baseType: !1058, size: 64, offset: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1055, file: !318, line: 1891, baseType: !1061, size: 64, offset: 128)
!1061 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1055, file: !318, line: 1891, size: 64, elements: !1062)
!1062 = !{!1063, !1064}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1061, file: !318, line: 1891, baseType: !1014, size: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1061, file: !318, line: 1891, baseType: !690, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1055, file: !318, line: 1892, baseType: !1048, size: 64, offset: 192)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1036, file: !584, line: 359, baseType: !689, size: 64, offset: 384)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !1016, file: !584, line: 740, baseType: !1068, size: 512)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !584, line: 365, size: 512, elements: !1069)
!1069 = !{!1070, !1071, !1072}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1068, file: !584, line: 368, baseType: !1039, size: 384)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1068, file: !584, line: 373, baseType: !690, size: 64, offset: 384)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1068, file: !584, line: 374, baseType: !690, size: 64, offset: 448)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !1016, file: !584, line: 741, baseType: !1074, size: 576)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !584, line: 380, size: 576, elements: !1075)
!1075 = !{!1076, !1077}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1074, file: !584, line: 383, baseType: !1068, size: 512)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1074, file: !584, line: 389, baseType: !689, size: 64, offset: 512)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1016, file: !584, line: 742, baseType: !1079, size: 320)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !584, line: 395, size: 320, elements: !1080)
!1080 = !{!1081, !1082}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1079, file: !584, line: 397, baseType: !1019, size: 256)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1079, file: !584, line: 400, baseType: !1004, size: 64, offset: 256)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !1016, file: !584, line: 743, baseType: !1084, size: 448)
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !584, line: 406, size: 448, elements: !1085)
!1085 = !{!1086, !1087, !1088, !1089}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1084, file: !584, line: 408, baseType: !1019, size: 256)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1084, file: !584, line: 412, baseType: !690, size: 64, offset: 256)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1084, file: !584, line: 420, baseType: !690, size: 64, offset: 320)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1084, file: !584, line: 423, baseType: !1004, size: 64, offset: 384)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !1016, file: !584, line: 744, baseType: !1091, size: 384)
!1091 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !584, line: 429, size: 384, elements: !1092)
!1092 = !{!1093, !1094, !1095}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1091, file: !584, line: 431, baseType: !1019, size: 256)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1091, file: !584, line: 434, baseType: !690, size: 64, offset: 256)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1091, file: !584, line: 437, baseType: !1004, size: 64, offset: 320)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !1016, file: !584, line: 745, baseType: !1097, size: 384)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !584, line: 443, size: 384, elements: !1098)
!1098 = !{!1099, !1100, !1101}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1097, file: !584, line: 445, baseType: !1019, size: 256)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1097, file: !584, line: 449, baseType: !690, size: 64, offset: 256)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1097, file: !584, line: 453, baseType: !1004, size: 64, offset: 320)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !1016, file: !584, line: 746, baseType: !1103, size: 320)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !584, line: 459, size: 320, elements: !1104)
!1104 = !{!1105, !1106}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1103, file: !584, line: 461, baseType: !1019, size: 256)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1103, file: !584, line: 464, baseType: !690, size: 64, offset: 256)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !1016, file: !584, line: 747, baseType: !1108, size: 768)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !584, line: 469, size: 768, elements: !1109)
!1109 = !{!1110, !1111, !1112, !1113, !1114}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1108, file: !584, line: 471, baseType: !1019, size: 256)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1108, file: !584, line: 474, baseType: !7, size: 32, offset: 256)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1108, file: !584, line: 475, baseType: !7, size: 32, offset: 288)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1108, file: !584, line: 478, baseType: !690, size: 64, offset: 320)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1108, file: !584, line: 481, baseType: !1115, size: 384, offset: 384)
!1115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1116, size: 384, elements: !789)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !318, line: 1917, size: 384, elements: !1117)
!1117 = !{!1118, !1119, !1120}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1116, file: !318, line: 1920, baseType: !1055, size: 256)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1116, file: !318, line: 1921, baseType: !690, size: 64, offset: 256)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1116, file: !318, line: 1922, baseType: !815, size: 32, offset: 320)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !1016, file: !584, line: 748, baseType: !1122, size: 320)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !584, line: 487, size: 320, elements: !1123)
!1123 = !{!1124, !1125}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1122, file: !584, line: 490, baseType: !1019, size: 256)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1122, file: !584, line: 494, baseType: !671, size: 32, offset: 256)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !1016, file: !584, line: 749, baseType: !1127, size: 384)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !584, line: 500, size: 384, elements: !1128)
!1128 = !{!1129, !1130, !1131}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1127, file: !584, line: 502, baseType: !1019, size: 256)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1127, file: !584, line: 506, baseType: !1004, size: 64, offset: 256)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1127, file: !584, line: 510, baseType: !1004, size: 64, offset: 320)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !1016, file: !584, line: 750, baseType: !1133, size: 320)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !584, line: 529, size: 320, elements: !1134)
!1134 = !{!1135, !1136}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1133, file: !584, line: 531, baseType: !1019, size: 256)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1133, file: !584, line: 540, baseType: !1004, size: 64, offset: 256)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !1016, file: !584, line: 751, baseType: !1138, size: 704)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !584, line: 546, size: 704, elements: !1139)
!1139 = !{!1140, !1141, !1142, !1143, !1144, !1145, !1146}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1138, file: !584, line: 549, baseType: !1068, size: 512)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1138, file: !584, line: 553, baseType: !676, size: 64, offset: 512)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1138, file: !584, line: 557, baseType: !670, size: 8, offset: 576)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1138, file: !584, line: 558, baseType: !670, size: 8, offset: 584)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1138, file: !584, line: 559, baseType: !670, size: 8, offset: 592)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1138, file: !584, line: 560, baseType: !670, size: 8, offset: 600)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1138, file: !584, line: 566, baseType: !689, size: 64, offset: 640)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !1016, file: !584, line: 752, baseType: !1148, size: 384)
!1148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !584, line: 571, size: 384, elements: !1149)
!1149 = !{!1150, !1151}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1148, file: !584, line: 573, baseType: !1079, size: 320)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1148, file: !584, line: 577, baseType: !690, size: 64, offset: 320)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !1016, file: !584, line: 753, baseType: !1153, size: 576)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !584, line: 600, size: 576, elements: !1154)
!1154 = !{!1155, !1156, !1157, !1160, !1169}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1153, file: !584, line: 602, baseType: !1079, size: 320)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1153, file: !584, line: 605, baseType: !690, size: 64, offset: 320)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1153, file: !584, line: 609, baseType: !1158, size: 64, offset: 384)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1159, line: 46, baseType: !744)
!1159 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1153, file: !584, line: 612, baseType: !1161, size: 64, offset: 448)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !584, line: 581, size: 320, elements: !1163)
!1163 = !{!1164, !1165, !1166, !1167, !1168}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1162, file: !584, line: 583, baseType: !317, size: 32)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1162, file: !584, line: 586, baseType: !690, size: 64, offset: 64)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1162, file: !584, line: 589, baseType: !690, size: 64, offset: 128)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1162, file: !584, line: 592, baseType: !690, size: 64, offset: 192)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1162, file: !584, line: 595, baseType: !690, size: 64, offset: 256)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1153, file: !584, line: 616, baseType: !1004, size: 64, offset: 512)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !1016, file: !584, line: 754, baseType: !1171, size: 512)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !584, line: 622, size: 512, elements: !1172)
!1172 = !{!1173, !1174, !1175, !1176}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1171, file: !584, line: 624, baseType: !1079, size: 320)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1171, file: !584, line: 628, baseType: !690, size: 64, offset: 320)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1171, file: !584, line: 632, baseType: !690, size: 64, offset: 384)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1171, file: !584, line: 636, baseType: !690, size: 64, offset: 448)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !1016, file: !584, line: 755, baseType: !1178, size: 704)
!1178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !584, line: 642, size: 704, elements: !1179)
!1179 = !{!1180, !1181, !1182, !1183}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1178, file: !584, line: 644, baseType: !1171, size: 512)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1178, file: !584, line: 648, baseType: !690, size: 64, offset: 512)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1178, file: !584, line: 652, baseType: !690, size: 64, offset: 576)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1178, file: !584, line: 653, baseType: !690, size: 64, offset: 640)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !1016, file: !584, line: 756, baseType: !1185, size: 448)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !584, line: 663, size: 448, elements: !1186)
!1186 = !{!1187, !1188, !1189}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1185, file: !584, line: 665, baseType: !1079, size: 320)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1185, file: !584, line: 668, baseType: !690, size: 64, offset: 320)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1185, file: !584, line: 673, baseType: !690, size: 64, offset: 384)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !1016, file: !584, line: 757, baseType: !1191, size: 384)
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !584, line: 694, size: 384, elements: !1192)
!1192 = !{!1193, !1194}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1191, file: !584, line: 696, baseType: !1079, size: 320)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1191, file: !584, line: 699, baseType: !690, size: 64, offset: 320)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !1016, file: !584, line: 758, baseType: !1196, size: 384)
!1196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !584, line: 681, size: 384, elements: !1197)
!1197 = !{!1198, !1199, !1200}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1196, file: !584, line: 683, baseType: !1019, size: 256)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1196, file: !584, line: 686, baseType: !690, size: 64, offset: 256)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1196, file: !584, line: 689, baseType: !690, size: 64, offset: 320)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !1016, file: !584, line: 759, baseType: !1202, size: 384)
!1202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !584, line: 707, size: 384, elements: !1203)
!1203 = !{!1204, !1205, !1206}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1202, file: !584, line: 709, baseType: !1019, size: 256)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1202, file: !584, line: 712, baseType: !690, size: 64, offset: 256)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1202, file: !584, line: 712, baseType: !690, size: 64, offset: 320)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !1016, file: !584, line: 760, baseType: !1208, size: 320)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !584, line: 718, size: 320, elements: !1209)
!1209 = !{!1210, !1211}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1208, file: !584, line: 720, baseType: !1019, size: 256)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1208, file: !584, line: 723, baseType: !690, size: 64, offset: 256)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1011, file: !584, line: 138, baseType: !1010, size: 64, offset: 64)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1011, file: !584, line: 139, baseType: !1010, size: 64, offset: 128)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1006, file: !584, line: 146, baseType: !1009, size: 64, offset: 64)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1006, file: !584, line: 152, baseType: !1004, size: 64, offset: 128)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1001, file: !513, line: 130, baseType: !865, size: 64)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !996, file: !513, line: 134, baseType: !675, size: 64, offset: 192)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !996, file: !513, line: 137, baseType: !690, size: 64, offset: 256)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !996, file: !513, line: 138, baseType: !815, size: 32, offset: 320)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !996, file: !513, line: 142, baseType: !7, size: 32, offset: 352)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !996, file: !513, line: 144, baseType: !671, size: 32, offset: 384)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !996, file: !513, line: 145, baseType: !671, size: 32, offset: 416)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !996, file: !513, line: 146, baseType: !1224, size: 64, offset: 448)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !513, line: 119, baseType: !746)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !979, file: !513, line: 220, baseType: !982, size: 64, offset: 64)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !979, file: !513, line: 223, baseType: !675, size: 64, offset: 128)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !979, file: !513, line: 226, baseType: !1228, size: 64, offset: 192)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64)
!1229 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !513, line: 185, flags: DIFlagFwdDecl)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !979, file: !513, line: 229, baseType: !1231, size: 128, offset: 256)
!1231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1232, size: 128, elements: !933)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64)
!1233 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !513, line: 229, flags: DIFlagFwdDecl)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !979, file: !513, line: 232, baseType: !978, size: 64, offset: 384)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !979, file: !513, line: 233, baseType: !978, size: 64, offset: 448)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !979, file: !513, line: 238, baseType: !1237, size: 64, offset: 512)
!1237 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !513, line: 235, size: 64, elements: !1238)
!1238 = !{!1239, !1245}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1237, file: !513, line: 236, baseType: !1240, size: 64)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64)
!1241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !513, line: 273, size: 128, elements: !1242)
!1242 = !{!1243, !1244}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1241, file: !513, line: 275, baseType: !1004, size: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1241, file: !513, line: 278, baseType: !1004, size: 64, offset: 64)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1237, file: !513, line: 237, baseType: !1246, size: 64)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !513, line: 259, size: 320, elements: !1248)
!1248 = !{!1249, !1250, !1251, !1252, !1253}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1247, file: !513, line: 261, baseType: !865, size: 64)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1247, file: !513, line: 262, baseType: !865, size: 64, offset: 64)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1247, file: !513, line: 266, baseType: !865, size: 64, offset: 128)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1247, file: !513, line: 267, baseType: !865, size: 64, offset: 192)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1247, file: !513, line: 270, baseType: !671, size: 32, offset: 256)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !979, file: !513, line: 241, baseType: !1224, size: 64, offset: 576)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !979, file: !513, line: 244, baseType: !671, size: 32, offset: 640)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !979, file: !513, line: 247, baseType: !671, size: 32, offset: 672)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !979, file: !513, line: 250, baseType: !671, size: 32, offset: 704)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !979, file: !513, line: 253, baseType: !671, size: 32, offset: 736)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !979, file: !513, line: 256, baseType: !671, size: 32, offset: 768)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !886, file: !868, line: 179, baseType: !1261, size: 64)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64)
!1262 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !868, line: 150, baseType: !1263)
!1263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !868, line: 142, size: 320, elements: !1264)
!1264 = !{!1265, !1266, !1267, !1268, !1271, !1272}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1263, file: !868, line: 144, baseType: !690, size: 64)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1263, file: !868, line: 145, baseType: !865, size: 64, offset: 64)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1263, file: !868, line: 146, baseType: !865, size: 64, offset: 128)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1263, file: !868, line: 147, baseType: !1269, size: 32, offset: 192)
!1269 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1270, line: 31, baseType: !671)
!1270 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1263, file: !868, line: 148, baseType: !7, size: 32, offset: 224)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1263, file: !868, line: 149, baseType: !670, size: 8, offset: 256)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !886, file: !868, line: 180, baseType: !1274, size: 64)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64)
!1275 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !868, line: 162, baseType: !1276)
!1276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !868, line: 159, size: 128, elements: !1277)
!1277 = !{!1278, !1279}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1276, file: !868, line: 160, baseType: !690, size: 64)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1276, file: !868, line: 161, baseType: !746, size: 64, offset: 64)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !886, file: !868, line: 181, baseType: !1281, size: 64)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64)
!1282 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !868, line: 181, flags: DIFlagFwdDecl)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !881, file: !868, line: 317, baseType: !1284, size: 64)
!1284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !746, size: 64, elements: !789)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !881, file: !868, line: 318, baseType: !1286, size: 320)
!1286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !868, line: 188, size: 320, elements: !1287)
!1287 = !{!1288, !1290, !1313}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1286, file: !868, line: 190, baseType: !1289, size: 192)
!1289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !885, size: 192, elements: !764)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1286, file: !868, line: 193, baseType: !1291, size: 64, offset: 192)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64)
!1292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !868, line: 206, size: 320, elements: !1293)
!1293 = !{!1294, !1298, !1299, !1300, !1312}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1292, file: !868, line: 208, baseType: !1295, size: 64)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64)
!1296 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !691, line: 62, baseType: !1297)
!1297 = !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !691, line: 61, flags: DIFlagFwdDecl)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1292, file: !868, line: 211, baseType: !7, size: 32, offset: 64)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1292, file: !868, line: 214, baseType: !746, size: 64, offset: 128)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1292, file: !868, line: 224, baseType: !1301, size: 64, offset: 192)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64)
!1302 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !868, line: 202, baseType: !1303)
!1303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !868, line: 202, size: 128, elements: !1304)
!1304 = !{!1305}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1303, file: !868, line: 202, baseType: !1306, size: 128)
!1306 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !868, line: 200, baseType: !1307)
!1307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !868, line: 200, size: 128, elements: !1308)
!1308 = !{!1309, !1310, !1311}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1307, file: !868, line: 200, baseType: !7, size: 32)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1307, file: !868, line: 200, baseType: !7, size: 32, offset: 32)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1307, file: !868, line: 200, baseType: !899, size: 64, offset: 64)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1292, file: !868, line: 234, baseType: !1301, size: 64, offset: 256)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1286, file: !868, line: 197, baseType: !746, size: 64, offset: 256)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !881, file: !868, line: 319, baseType: !753, size: 256)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !881, file: !868, line: 320, baseType: !772, size: 192)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !693, file: !318, line: 3384, baseType: !1317, size: 1472)
!1317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !318, line: 3114, size: 1472, elements: !1318)
!1318 = !{!1319, !1340, !1341, !1342, !1343}
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1317, file: !318, line: 3115, baseType: !1320, size: 1216)
!1320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !318, line: 2984, size: 1216, elements: !1321)
!1321 = !{!1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1320, file: !318, line: 2985, baseType: !861, size: 960)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1320, file: !318, line: 2986, baseType: !690, size: 64, offset: 960)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1320, file: !318, line: 2987, baseType: !690, size: 64, offset: 1024)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1320, file: !318, line: 2988, baseType: !690, size: 64, offset: 1088)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1320, file: !318, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1320, file: !318, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1320, file: !318, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1320, file: !318, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1320, file: !318, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1320, file: !318, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1320, file: !318, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1320, file: !318, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1320, file: !318, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1320, file: !318, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1320, file: !318, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1320, file: !318, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1320, file: !318, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1320, file: !318, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1317, file: !318, line: 3117, baseType: !690, size: 64, offset: 1216)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1317, file: !318, line: 3119, baseType: !690, size: 64, offset: 1280)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1317, file: !318, line: 3121, baseType: !690, size: 64, offset: 1344)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1317, file: !318, line: 3123, baseType: !690, size: 64, offset: 1408)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !693, file: !318, line: 3385, baseType: !1345, size: 1088)
!1345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !318, line: 2874, size: 1088, elements: !1346)
!1346 = !{!1347, !1348, !1349}
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1345, file: !318, line: 2875, baseType: !861, size: 960)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1345, file: !318, line: 2876, baseType: !865, size: 64, offset: 960)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1345, file: !318, line: 2877, baseType: !1350, size: 64, offset: 1024)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64)
!1351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1352, line: 172, size: 128, elements: !1353)
!1352 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1353 = !{!1354, !1355, !1356, !1357, !1358, !1359, !1360}
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1351, file: !1352, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1351, file: !1352, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1351, file: !1352, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1351, file: !1352, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1351, file: !1352, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1351, file: !1352, line: 195, baseType: !7, size: 32, offset: 32)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1351, file: !1352, line: 199, baseType: !690, size: 64, offset: 64)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !693, file: !318, line: 3386, baseType: !1320, size: 1216)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !693, file: !318, line: 3387, baseType: !1363, size: 1280)
!1363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !318, line: 3093, size: 1280, elements: !1364)
!1364 = !{!1365, !1366}
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1363, file: !318, line: 3094, baseType: !1320, size: 1216)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1363, file: !318, line: 3095, baseType: !1350, size: 64, offset: 1216)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !693, file: !318, line: 3388, baseType: !1368, size: 1216)
!1368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !318, line: 2824, size: 1216, elements: !1369)
!1369 = !{!1370, !1371, !1372, !1373, !1374, !1375}
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1368, file: !318, line: 2825, baseType: !823, size: 896)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1368, file: !318, line: 2827, baseType: !690, size: 64, offset: 896)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1368, file: !318, line: 2828, baseType: !690, size: 64, offset: 960)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1368, file: !318, line: 2829, baseType: !690, size: 64, offset: 1024)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1368, file: !318, line: 2830, baseType: !690, size: 64, offset: 1088)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1368, file: !318, line: 2831, baseType: !690, size: 64, offset: 1152)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !693, file: !318, line: 3389, baseType: !1377, size: 1024)
!1377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !318, line: 2850, size: 1024, elements: !1378)
!1378 = !{!1379, !1380, !1381}
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1377, file: !318, line: 2851, baseType: !861, size: 960)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1377, file: !318, line: 2852, baseType: !671, size: 32, offset: 960)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1377, file: !318, line: 2853, baseType: !671, size: 32, offset: 992)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !693, file: !318, line: 3390, baseType: !1383, size: 1024)
!1383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !318, line: 2857, size: 1024, elements: !1384)
!1384 = !{!1385, !1386}
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1383, file: !318, line: 2858, baseType: !861, size: 960)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1383, file: !318, line: 2859, baseType: !1350, size: 64, offset: 960)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !693, file: !318, line: 3391, baseType: !1388, size: 960)
!1388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !318, line: 2862, size: 960, elements: !1389)
!1389 = !{!1390}
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1388, file: !318, line: 2863, baseType: !861, size: 960)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !693, file: !318, line: 3392, baseType: !1392, size: 1472)
!1392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !318, line: 3304, size: 1472, elements: !1393)
!1393 = !{!1394}
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1392, file: !318, line: 3305, baseType: !1317, size: 1472)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !693, file: !318, line: 3393, baseType: !1396, size: 1792)
!1396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !318, line: 3248, size: 1792, elements: !1397)
!1397 = !{!1398, !1399, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627}
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1396, file: !318, line: 3249, baseType: !1317, size: 1472)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1396, file: !318, line: 3251, baseType: !1400, size: 64, offset: 1472)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1401, size: 64)
!1401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1402, line: 463, size: 1152, elements: !1403)
!1402 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1403 = !{!1404, !1407, !1438, !1439, !1548, !1551, !1552, !1553, !1554, !1555, !1556, !1580, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606}
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1401, file: !1402, line: 464, baseType: !1405, size: 64)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64)
!1406 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1402, line: 464, flags: DIFlagFwdDecl)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1401, file: !1402, line: 467, baseType: !1408, size: 64, offset: 64)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64)
!1409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !513, line: 374, size: 640, elements: !1410)
!1410 = !{!1411, !1413, !1414, !1427, !1428, !1429, !1430, !1431, !1432, !1434, !1436, !1437}
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1409, file: !513, line: 377, baseType: !1412, size: 64)
!1412 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !691, line: 111, baseType: !978)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1409, file: !513, line: 378, baseType: !1412, size: 64, offset: 64)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1409, file: !513, line: 381, baseType: !1415, size: 64, offset: 128)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64)
!1416 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !513, line: 282, baseType: !1417)
!1417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !513, line: 282, size: 128, elements: !1418)
!1418 = !{!1419}
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1417, file: !513, line: 282, baseType: !1420, size: 128)
!1420 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !513, line: 281, baseType: !1421)
!1421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !513, line: 281, size: 128, elements: !1422)
!1422 = !{!1423, !1424, !1425}
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1421, file: !513, line: 281, baseType: !7, size: 32)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1421, file: !513, line: 281, baseType: !7, size: 32, offset: 32)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1421, file: !513, line: 281, baseType: !1426, size: 64, offset: 64)
!1426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1412, size: 64, elements: !789)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1409, file: !513, line: 384, baseType: !671, size: 32, offset: 192)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1409, file: !513, line: 387, baseType: !671, size: 32, offset: 224)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1409, file: !513, line: 390, baseType: !671, size: 32, offset: 256)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1409, file: !513, line: 394, baseType: !1415, size: 64, offset: 320)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1409, file: !513, line: 396, baseType: !512, size: 32, offset: 384)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1409, file: !513, line: 399, baseType: !1433, size: 64, offset: 416)
!1433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !518, size: 64, elements: !933)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1409, file: !513, line: 402, baseType: !1435, size: 64, offset: 480)
!1435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !933)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1409, file: !513, line: 406, baseType: !671, size: 32, offset: 544)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1409, file: !513, line: 409, baseType: !671, size: 32, offset: 576)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1401, file: !1402, line: 470, baseType: !1005, size: 64, offset: 128)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1401, file: !1402, line: 473, baseType: !1440, size: 64, offset: 192)
!1440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1441, size: 64)
!1441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1352, line: 39, size: 1152, elements: !1442)
!1442 = !{!1443, !1493, !1506, !1512, !1513, !1525, !1526, !1530, !1531, !1532, !1533, !1534}
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1441, file: !1352, line: 41, baseType: !1444, size: 64)
!1444 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1445, line: 144, baseType: !1446)
!1445 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1447, size: 64)
!1447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1445, line: 100, size: 896, elements: !1448)
!1448 = !{!1449, !1457, !1462, !1467, !1469, !1470, !1471, !1472, !1473, !1474, !1479, !1481, !1482, !1487, !1492}
