; ModuleID = 'ipa-cp.bc'
source_filename = "ipa-cp.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.cgraph_node_set_def = type { %struct.htab*, %struct.VEC_cgraph_node_ptr_gc*, i8* }
%struct.htab = type { i32 (i8*)*, i32 (i8*, i8*)*, void (i8*)*, i8**, i64, i64, i64, i32, i32, i8* (i64, i64)*, void (i8*)*, i8*, i8* (i8*, i64, i64)*, void (i8*, i8*)*, i32 }
%struct.VEC_cgraph_node_ptr_gc = type { %struct.VEC_cgraph_node_ptr_base }
%struct.VEC_cgraph_node_ptr_base = type { i32, i32, [1 x %struct.cgraph_node*] }

!483 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!484 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!485 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!486 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!487 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!488 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!489 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!490 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!491 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!492 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!493 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!494 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!495 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!496 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!497 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!498 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!499 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!500 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !462, line: 727, baseType: !7, size: 32, elements: !501)
!501 = !{!502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525}
!502 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!503 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!504 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!505 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!506 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!507 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!508 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!509 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!510 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!511 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!512 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!513 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!514 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!515 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!516 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!517 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!518 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!519 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!520 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!521 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!522 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!523 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!524 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!525 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!526 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "jump_func_type", file: !456, line: 48, baseType: !7, size: 32, elements: !527)
!527 = !{!528, !529, !530, !531, !532}
!528 = !DIEnumerator(name: "IPA_JF_UNKNOWN", value: 0, isUnsigned: true)
!529 = !DIEnumerator(name: "IPA_JF_CONST", value: 1, isUnsigned: true)
!530 = !DIEnumerator(name: "IPA_JF_CONST_MEMBER_PTR", value: 2, isUnsigned: true)
!531 = !DIEnumerator(name: "IPA_JF_PASS_THROUGH", value: 3, isUnsigned: true)
!532 = !DIEnumerator(name: "IPA_JF_ANCESTOR", value: 4, isUnsigned: true)
!533 = !{!534, !535, !536, !537, !540, !541, !543, !189, !839, !1717, !873, !538, !599, !7, !1719, !1993, !654, !1760, !2035, !1205, !1943, !1956, !2049}
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!536 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !539)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !544, line: 56, baseType: !545)
!544 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !190, line: 3371, size: 1792, elements: !547)
!547 = !{!548, !581, !587, !600, !607, !614, !619, !628, !634, !647, !659, !697, !705, !733, !750, !751, !756, !765, !771, !776, !780, !784, !1366, !1415, !1421, !1427, !1434, !1447, !1461, !1478, !1490, !1512, !1527, !1699}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !546, file: !190, line: 3372, baseType: !549, size: 64)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !190, line: 360, size: 64, elements: !550)
!550 = !{!551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !549, file: !190, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !549, file: !190, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !549, file: !190, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !549, file: !190, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !549, file: !190, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !549, file: !190, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !549, file: !190, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !549, file: !190, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !549, file: !190, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !549, file: !190, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !549, file: !190, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !549, file: !190, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !549, file: !190, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !549, file: !190, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !549, file: !190, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !549, file: !190, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !549, file: !190, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !549, file: !190, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !549, file: !190, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !549, file: !190, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !549, file: !190, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !549, file: !190, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !549, file: !190, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !549, file: !190, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !549, file: !190, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !549, file: !190, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !549, file: !190, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !549, file: !190, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !549, file: !190, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !549, file: !190, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !546, file: !190, line: 3373, baseType: !582, size: 192)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !190, line: 402, size: 192, elements: !583)
!583 = !{!584, !585, !586}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !582, file: !190, line: 403, baseType: !549, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !582, file: !190, line: 404, baseType: !543, size: 64, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !582, file: !190, line: 405, baseType: !543, size: 64, offset: 128)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !546, file: !190, line: 3374, baseType: !588, size: 320)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !190, line: 1384, size: 320, elements: !589)
!589 = !{!590, !591}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !588, file: !190, line: 1385, baseType: !582, size: 192)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !588, file: !190, line: 1386, baseType: !592, size: 128, offset: 192)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !593, line: 58, baseType: !594)
!593 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !593, line: 54, size: 128, elements: !595)
!595 = !{!596, !598}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !594, file: !593, line: 56, baseType: !597, size: 64)
!597 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !594, file: !593, line: 57, baseType: !599, size: 64, offset: 64)
!599 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !546, file: !190, line: 3375, baseType: !601, size: 256)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !190, line: 1397, size: 256, elements: !602)
!602 = !{!603, !604}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !601, file: !190, line: 1398, baseType: !582, size: 192)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !601, file: !190, line: 1399, baseType: !605, size: 64, offset: 192)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !190, line: 1392, flags: DIFlagFwdDecl)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !546, file: !190, line: 3376, baseType: !608, size: 256)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !190, line: 1408, size: 256, elements: !609)
!609 = !{!610, !611}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !608, file: !190, line: 1409, baseType: !582, size: 192)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !608, file: !190, line: 1410, baseType: !612, size: 64, offset: 192)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !190, line: 1403, flags: DIFlagFwdDecl)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !546, file: !190, line: 3377, baseType: !615, size: 256)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !190, line: 1437, size: 256, elements: !616)
!616 = !{!617, !618}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !615, file: !190, line: 1438, baseType: !582, size: 192)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !615, file: !190, line: 1439, baseType: !543, size: 64, offset: 192)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !546, file: !190, line: 3378, baseType: !620, size: 256)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !190, line: 1418, size: 256, elements: !621)
!621 = !{!622, !623, !624}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !620, file: !190, line: 1419, baseType: !582, size: 192)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !620, file: !190, line: 1420, baseType: !536, size: 32, offset: 192)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !620, file: !190, line: 1421, baseType: !625, size: 8, offset: 224)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !539, size: 8, elements: !626)
!626 = !{!627}
!627 = !DISubrange(count: 1)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !546, file: !190, line: 3379, baseType: !629, size: 320)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !190, line: 1428, size: 320, elements: !630)
!630 = !{!631, !632, !633}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !629, file: !190, line: 1429, baseType: !582, size: 192)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !629, file: !190, line: 1430, baseType: !543, size: 64, offset: 192)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !629, file: !190, line: 1431, baseType: !543, size: 64, offset: 256)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !546, file: !190, line: 3380, baseType: !635, size: 320)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !190, line: 1460, size: 320, elements: !636)
!636 = !{!637, !638}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !635, file: !190, line: 1461, baseType: !582, size: 192)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !635, file: !190, line: 1462, baseType: !639, size: 128, offset: 192)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !640, line: 31, size: 128, elements: !641)
!640 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!641 = !{!642, !645, !646}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !639, file: !640, line: 32, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !535)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !639, file: !640, line: 33, baseType: !7, size: 32, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !639, file: !640, line: 34, baseType: !7, size: 32, offset: 96)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !546, file: !190, line: 3381, baseType: !648, size: 384)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !190, line: 2507, size: 384, elements: !649)
!649 = !{!650, !651, !656, !657, !658}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !648, file: !190, line: 2508, baseType: !582, size: 192)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !648, file: !190, line: 2509, baseType: !652, size: 32, offset: 192)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !653, line: 58, baseType: !654)
!653 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !655, line: 44, baseType: !7)
!655 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!656 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !648, file: !190, line: 2510, baseType: !7, size: 32, offset: 224)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !648, file: !190, line: 2511, baseType: !543, size: 64, offset: 256)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !648, file: !190, line: 2512, baseType: !543, size: 64, offset: 320)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !546, file: !190, line: 3382, baseType: !660, size: 896)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !190, line: 2652, size: 896, elements: !661)
!661 = !{!662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !660, file: !190, line: 2653, baseType: !648, size: 384)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !660, file: !190, line: 2654, baseType: !543, size: 64, offset: 384)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !660, file: !190, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !660, file: !190, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !660, file: !190, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !660, file: !190, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !660, file: !190, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !660, file: !190, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !660, file: !190, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !660, file: !190, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !660, file: !190, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !660, file: !190, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !660, file: !190, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !660, file: !190, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !660, file: !190, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !660, file: !190, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !660, file: !190, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !660, file: !190, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !660, file: !190, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !660, file: !190, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !660, file: !190, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !660, file: !190, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !660, file: !190, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !660, file: !190, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !660, file: !190, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !660, file: !190, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !660, file: !190, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !660, file: !190, line: 2703, baseType: !7, size: 32, offset: 512)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !660, file: !190, line: 2705, baseType: !543, size: 64, offset: 576)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !660, file: !190, line: 2706, baseType: !543, size: 64, offset: 640)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !660, file: !190, line: 2707, baseType: !543, size: 64, offset: 704)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !660, file: !190, line: 2708, baseType: !543, size: 64, offset: 768)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !660, file: !190, line: 2711, baseType: !695, size: 64, offset: 832)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !190, line: 2711, flags: DIFlagFwdDecl)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !546, file: !190, line: 3383, baseType: !698, size: 960)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !190, line: 2756, size: 960, elements: !699)
!699 = !{!700, !701}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !698, file: !190, line: 2757, baseType: !660, size: 896)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !698, file: !190, line: 2758, baseType: !702, size: 64, offset: 896)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !544, line: 50, baseType: !703)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !544, line: 49, flags: DIFlagFwdDecl)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !546, file: !190, line: 3384, baseType: !706, size: 1472)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !190, line: 3114, size: 1472, elements: !707)
!707 = !{!708, !729, !730, !731, !732}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !706, file: !190, line: 3115, baseType: !709, size: 1216)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !190, line: 2984, size: 1216, elements: !710)
!710 = !{!711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !709, file: !190, line: 2985, baseType: !698, size: 960)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !709, file: !190, line: 2986, baseType: !543, size: 64, offset: 960)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !709, file: !190, line: 2987, baseType: !543, size: 64, offset: 1024)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !709, file: !190, line: 2988, baseType: !543, size: 64, offset: 1088)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !709, file: !190, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !709, file: !190, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !709, file: !190, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !709, file: !190, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !709, file: !190, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !709, file: !190, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !709, file: !190, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !709, file: !190, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !709, file: !190, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !709, file: !190, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !709, file: !190, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !709, file: !190, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !709, file: !190, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !709, file: !190, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !706, file: !190, line: 3117, baseType: !543, size: 64, offset: 1216)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !706, file: !190, line: 3119, baseType: !543, size: 64, offset: 1280)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !706, file: !190, line: 3121, baseType: !543, size: 64, offset: 1344)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !706, file: !190, line: 3123, baseType: !543, size: 64, offset: 1408)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !546, file: !190, line: 3385, baseType: !734, size: 1088)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !190, line: 2874, size: 1088, elements: !735)
!735 = !{!736, !737, !738}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !734, file: !190, line: 2875, baseType: !698, size: 960)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !734, file: !190, line: 2876, baseType: !702, size: 64, offset: 960)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !734, file: !190, line: 2877, baseType: !739, size: 64, offset: 1024)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !741, line: 172, size: 128, elements: !742)
!741 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!742 = !{!743, !744, !745, !746, !747, !748, !749}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !740, file: !741, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !740, file: !741, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !740, file: !741, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !740, file: !741, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !740, file: !741, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !740, file: !741, line: 195, baseType: !7, size: 32, offset: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !740, file: !741, line: 199, baseType: !543, size: 64, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !546, file: !190, line: 3386, baseType: !709, size: 1216)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !546, file: !190, line: 3387, baseType: !752, size: 1280)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !190, line: 3093, size: 1280, elements: !753)
!753 = !{!754, !755}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !752, file: !190, line: 3094, baseType: !709, size: 1216)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !752, file: !190, line: 3095, baseType: !739, size: 64, offset: 1216)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !546, file: !190, line: 3388, baseType: !757, size: 1216)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !190, line: 2824, size: 1216, elements: !758)
!758 = !{!759, !760, !761, !762, !763, !764}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !757, file: !190, line: 2825, baseType: !660, size: 896)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !757, file: !190, line: 2827, baseType: !543, size: 64, offset: 896)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !757, file: !190, line: 2828, baseType: !543, size: 64, offset: 960)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !757, file: !190, line: 2829, baseType: !543, size: 64, offset: 1024)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !757, file: !190, line: 2830, baseType: !543, size: 64, offset: 1088)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !757, file: !190, line: 2831, baseType: !543, size: 64, offset: 1152)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !546, file: !190, line: 3389, baseType: !766, size: 1024)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !190, line: 2850, size: 1024, elements: !767)
!767 = !{!768, !769, !770}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !766, file: !190, line: 2851, baseType: !698, size: 960)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !766, file: !190, line: 2852, baseType: !536, size: 32, offset: 960)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !766, file: !190, line: 2853, baseType: !536, size: 32, offset: 992)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !546, file: !190, line: 3390, baseType: !772, size: 1024)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !190, line: 2857, size: 1024, elements: !773)
!773 = !{!774, !775}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !772, file: !190, line: 2858, baseType: !698, size: 960)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !772, file: !190, line: 2859, baseType: !739, size: 64, offset: 960)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !546, file: !190, line: 3391, baseType: !777, size: 960)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !190, line: 2862, size: 960, elements: !778)
!778 = !{!779}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !777, file: !190, line: 2863, baseType: !698, size: 960)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !546, file: !190, line: 3392, baseType: !781, size: 1472)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !190, line: 3304, size: 1472, elements: !782)
!782 = !{!783}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !781, file: !190, line: 3305, baseType: !706, size: 1472)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !546, file: !190, line: 3393, baseType: !785, size: 1792)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !190, line: 3248, size: 1792, elements: !786)
!786 = !{!787, !788, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !785, file: !190, line: 3249, baseType: !706, size: 1472)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !785, file: !190, line: 3251, baseType: !789, size: 64, offset: 1472)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !791, line: 463, size: 1152, elements: !792)
!791 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!792 = !{!793, !796, !1113, !1114, !1286, !1289, !1290, !1291, !1292, !1293, !1294, !1318, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !790, file: !791, line: 464, baseType: !794, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !791, line: 464, flags: DIFlagFwdDecl)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !790, file: !791, line: 467, baseType: !797, size: 64, offset: 64)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !385, line: 374, size: 640, elements: !799)
!799 = !{!800, !1088, !1089, !1102, !1103, !1104, !1105, !1106, !1107, !1109, !1111, !1112}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !798, file: !385, line: 377, baseType: !801, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !544, line: 111, baseType: !802)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !385, line: 217, size: 832, elements: !804)
!804 = !{!805, !1051, !1052, !1053, !1056, !1062, !1063, !1064, !1082, !1083, !1084, !1085, !1086, !1087}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !803, file: !385, line: 219, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !385, line: 151, baseType: !808)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !385, line: 151, size: 128, elements: !809)
!809 = !{!810}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !808, file: !385, line: 151, baseType: !811, size: 128)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !385, line: 150, baseType: !812)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !385, line: 150, size: 128, elements: !813)
!813 = !{!814, !815, !816}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !812, file: !385, line: 150, baseType: !7, size: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !812, file: !385, line: 150, baseType: !7, size: 32, offset: 32)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !812, file: !385, line: 150, baseType: !817, size: 64, offset: 64)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !818, size: 64, elements: !626)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !544, line: 108, baseType: !819)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !385, line: 122, size: 512, elements: !821)
!821 = !{!822, !823, !824, !1043, !1044, !1045, !1046, !1047, !1048, !1049}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !820, file: !385, line: 124, baseType: !802, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !820, file: !385, line: 125, baseType: !802, size: 64, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !820, file: !385, line: 131, baseType: !825, size: 64, offset: 128)
!825 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !385, line: 128, size: 64, elements: !826)
!826 = !{!827, !1042}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !825, file: !385, line: 129, baseType: !828, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !544, line: 66, baseType: !829)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !462, line: 143, size: 192, elements: !831)
!831 = !{!832, !1040, !1041}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !830, file: !462, line: 145, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !544, line: 69, baseType: !834)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !462, line: 136, size: 192, elements: !836)
!836 = !{!837, !1038, !1039}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !835, file: !462, line: 137, baseType: !838, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !544, line: 58, baseType: !839)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !462, line: 737, size: 768, elements: !841)
!841 = !{!842, !859, !893, !899, !904, !909, !916, !922, !928, !933, !947, !952, !958, !963, !973, !978, !996, !1003, !1010, !1016, !1021, !1027, !1033}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !840, file: !462, line: 738, baseType: !843, size: 256)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !462, line: 271, size: 256, elements: !844)
!844 = !{!845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !843, file: !462, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !843, file: !462, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !843, file: !462, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !843, file: !462, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !843, file: !462, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !843, file: !462, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !843, file: !462, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !843, file: !462, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !843, file: !462, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !843, file: !462, line: 312, baseType: !7, size: 32, offset: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !843, file: !462, line: 316, baseType: !652, size: 32, offset: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !843, file: !462, line: 319, baseType: !7, size: 32, offset: 96)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !843, file: !462, line: 323, baseType: !802, size: 64, offset: 128)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !843, file: !462, line: 327, baseType: !543, size: 64, offset: 192)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !840, file: !462, line: 739, baseType: !860, size: 448)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !462, line: 350, size: 448, elements: !861)
!861 = !{!862, !891}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !860, file: !462, line: 353, baseType: !863, size: 384)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !462, line: 333, size: 384, elements: !864)
!864 = !{!865, !866, !874}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !863, file: !462, line: 336, baseType: !843, size: 256)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !863, file: !462, line: 343, baseType: !867, size: 64, offset: 256)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !869, line: 37, size: 128, elements: !870)
!869 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!870 = !{!871, !872}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !868, file: !869, line: 39, baseType: !867, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !868, file: !869, line: 40, baseType: !873, size: 64, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !863, file: !462, line: 344, baseType: !875, size: 64, offset: 320)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !869, line: 45, size: 320, elements: !877)
!877 = !{!878, !879}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !876, file: !869, line: 47, baseType: !875, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !876, file: !869, line: 48, baseType: !880, size: 256, offset: 64)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !190, line: 1883, size: 256, elements: !881)
!881 = !{!882, !884, !885, !890}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !880, file: !190, line: 1884, baseType: !883, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !880, file: !190, line: 1885, baseType: !883, size: 64, offset: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !880, file: !190, line: 1891, baseType: !886, size: 64, offset: 128)
!886 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !880, file: !190, line: 1891, size: 64, elements: !887)
!887 = !{!888, !889}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !886, file: !190, line: 1891, baseType: !838, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !886, file: !190, line: 1891, baseType: !543, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !880, file: !190, line: 1892, baseType: !873, size: 64, offset: 192)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !860, file: !462, line: 359, baseType: !892, size: 64, offset: 384)
!892 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 64, elements: !626)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !840, file: !462, line: 740, baseType: !894, size: 512)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !462, line: 365, size: 512, elements: !895)
!895 = !{!896, !897, !898}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !894, file: !462, line: 368, baseType: !863, size: 384)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !894, file: !462, line: 373, baseType: !543, size: 64, offset: 384)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !894, file: !462, line: 374, baseType: !543, size: 64, offset: 448)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !840, file: !462, line: 741, baseType: !900, size: 576)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !462, line: 380, size: 576, elements: !901)
!901 = !{!902, !903}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !900, file: !462, line: 383, baseType: !894, size: 512)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !900, file: !462, line: 389, baseType: !892, size: 64, offset: 512)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !840, file: !462, line: 742, baseType: !905, size: 320)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !462, line: 395, size: 320, elements: !906)
!906 = !{!907, !908}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !905, file: !462, line: 397, baseType: !843, size: 256)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !905, file: !462, line: 400, baseType: !828, size: 64, offset: 256)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !840, file: !462, line: 743, baseType: !910, size: 448)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !462, line: 406, size: 448, elements: !911)
!911 = !{!912, !913, !914, !915}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !910, file: !462, line: 408, baseType: !843, size: 256)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !910, file: !462, line: 412, baseType: !543, size: 64, offset: 256)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !910, file: !462, line: 420, baseType: !543, size: 64, offset: 320)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !910, file: !462, line: 423, baseType: !828, size: 64, offset: 384)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !840, file: !462, line: 744, baseType: !917, size: 384)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !462, line: 429, size: 384, elements: !918)
!918 = !{!919, !920, !921}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !917, file: !462, line: 431, baseType: !843, size: 256)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !917, file: !462, line: 434, baseType: !543, size: 64, offset: 256)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !917, file: !462, line: 437, baseType: !828, size: 64, offset: 320)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !840, file: !462, line: 745, baseType: !923, size: 384)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !462, line: 443, size: 384, elements: !924)
!924 = !{!925, !926, !927}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !923, file: !462, line: 445, baseType: !843, size: 256)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !923, file: !462, line: 449, baseType: !543, size: 64, offset: 256)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !923, file: !462, line: 453, baseType: !828, size: 64, offset: 320)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !840, file: !462, line: 746, baseType: !929, size: 320)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !462, line: 459, size: 320, elements: !930)
!930 = !{!931, !932}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !929, file: !462, line: 461, baseType: !843, size: 256)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !929, file: !462, line: 464, baseType: !543, size: 64, offset: 256)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !840, file: !462, line: 747, baseType: !934, size: 768)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !462, line: 469, size: 768, elements: !935)
!935 = !{!936, !937, !938, !939, !940}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !934, file: !462, line: 471, baseType: !843, size: 256)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !934, file: !462, line: 474, baseType: !7, size: 32, offset: 256)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !934, file: !462, line: 475, baseType: !7, size: 32, offset: 288)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !934, file: !462, line: 478, baseType: !543, size: 64, offset: 320)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !934, file: !462, line: 481, baseType: !941, size: 384, offset: 384)
!941 = !DICompositeType(tag: DW_TAG_array_type, baseType: !942, size: 384, elements: !626)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !190, line: 1917, size: 384, elements: !943)
!943 = !{!944, !945, !946}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !942, file: !190, line: 1920, baseType: !880, size: 256)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !942, file: !190, line: 1921, baseType: !543, size: 64, offset: 256)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !942, file: !190, line: 1922, baseType: !652, size: 32, offset: 320)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !840, file: !462, line: 748, baseType: !948, size: 320)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !462, line: 487, size: 320, elements: !949)
!949 = !{!950, !951}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !948, file: !462, line: 490, baseType: !843, size: 256)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !948, file: !462, line: 494, baseType: !536, size: 32, offset: 256)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !840, file: !462, line: 749, baseType: !953, size: 384)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !462, line: 500, size: 384, elements: !954)
!954 = !{!955, !956, !957}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !953, file: !462, line: 502, baseType: !843, size: 256)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !953, file: !462, line: 506, baseType: !828, size: 64, offset: 256)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !953, file: !462, line: 510, baseType: !828, size: 64, offset: 320)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !840, file: !462, line: 750, baseType: !959, size: 320)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !462, line: 529, size: 320, elements: !960)
!960 = !{!961, !962}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !959, file: !462, line: 531, baseType: !843, size: 256)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !959, file: !462, line: 540, baseType: !828, size: 64, offset: 256)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !840, file: !462, line: 751, baseType: !964, size: 704)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !462, line: 546, size: 704, elements: !965)
!965 = !{!966, !967, !968, !969, !970, !971, !972}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !964, file: !462, line: 549, baseType: !894, size: 512)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !964, file: !462, line: 553, baseType: !541, size: 64, offset: 512)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !964, file: !462, line: 557, baseType: !535, size: 8, offset: 576)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !964, file: !462, line: 558, baseType: !535, size: 8, offset: 584)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !964, file: !462, line: 559, baseType: !535, size: 8, offset: 592)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !964, file: !462, line: 560, baseType: !535, size: 8, offset: 600)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !964, file: !462, line: 566, baseType: !892, size: 64, offset: 640)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !840, file: !462, line: 752, baseType: !974, size: 384)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !462, line: 571, size: 384, elements: !975)
!975 = !{!976, !977}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !974, file: !462, line: 573, baseType: !905, size: 320)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !974, file: !462, line: 577, baseType: !543, size: 64, offset: 320)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !840, file: !462, line: 753, baseType: !979, size: 576)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !462, line: 600, size: 576, elements: !980)
!980 = !{!981, !982, !983, !986, !995}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !979, file: !462, line: 602, baseType: !905, size: 320)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !979, file: !462, line: 605, baseType: !543, size: 64, offset: 320)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !979, file: !462, line: 609, baseType: !984, size: 64, offset: 384)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !985, line: 46, baseType: !597)
!985 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!986 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !979, file: !462, line: 612, baseType: !987, size: 64, offset: 448)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !462, line: 581, size: 320, elements: !989)
!989 = !{!990, !991, !992, !993, !994}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !988, file: !462, line: 583, baseType: !189, size: 32)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !988, file: !462, line: 586, baseType: !543, size: 64, offset: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !988, file: !462, line: 589, baseType: !543, size: 64, offset: 128)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !988, file: !462, line: 592, baseType: !543, size: 64, offset: 192)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !988, file: !462, line: 595, baseType: !543, size: 64, offset: 256)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !979, file: !462, line: 616, baseType: !828, size: 64, offset: 512)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !840, file: !462, line: 754, baseType: !997, size: 512)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !462, line: 622, size: 512, elements: !998)
!998 = !{!999, !1000, !1001, !1002}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !997, file: !462, line: 624, baseType: !905, size: 320)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !997, file: !462, line: 628, baseType: !543, size: 64, offset: 320)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !997, file: !462, line: 632, baseType: !543, size: 64, offset: 384)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !997, file: !462, line: 636, baseType: !543, size: 64, offset: 448)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !840, file: !462, line: 755, baseType: !1004, size: 704)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !462, line: 642, size: 704, elements: !1005)
!1005 = !{!1006, !1007, !1008, !1009}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1004, file: !462, line: 644, baseType: !997, size: 512)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1004, file: !462, line: 648, baseType: !543, size: 64, offset: 512)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1004, file: !462, line: 652, baseType: !543, size: 64, offset: 576)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1004, file: !462, line: 653, baseType: !543, size: 64, offset: 640)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !840, file: !462, line: 756, baseType: !1011, size: 448)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !462, line: 663, size: 448, elements: !1012)
!1012 = !{!1013, !1014, !1015}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1011, file: !462, line: 665, baseType: !905, size: 320)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1011, file: !462, line: 668, baseType: !543, size: 64, offset: 320)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1011, file: !462, line: 673, baseType: !543, size: 64, offset: 384)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !840, file: !462, line: 757, baseType: !1017, size: 384)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !462, line: 694, size: 384, elements: !1018)
!1018 = !{!1019, !1020}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1017, file: !462, line: 696, baseType: !905, size: 320)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1017, file: !462, line: 699, baseType: !543, size: 64, offset: 320)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !840, file: !462, line: 758, baseType: !1022, size: 384)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !462, line: 681, size: 384, elements: !1023)
!1023 = !{!1024, !1025, !1026}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1022, file: !462, line: 683, baseType: !843, size: 256)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1022, file: !462, line: 686, baseType: !543, size: 64, offset: 256)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1022, file: !462, line: 689, baseType: !543, size: 64, offset: 320)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !840, file: !462, line: 759, baseType: !1028, size: 384)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !462, line: 707, size: 384, elements: !1029)
!1029 = !{!1030, !1031, !1032}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1028, file: !462, line: 709, baseType: !843, size: 256)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1028, file: !462, line: 712, baseType: !543, size: 64, offset: 256)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1028, file: !462, line: 712, baseType: !543, size: 64, offset: 320)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !840, file: !462, line: 760, baseType: !1034, size: 320)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !462, line: 718, size: 320, elements: !1035)
!1035 = !{!1036, !1037}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1034, file: !462, line: 720, baseType: !843, size: 256)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1034, file: !462, line: 723, baseType: !543, size: 64, offset: 256)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !835, file: !462, line: 138, baseType: !834, size: 64, offset: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !835, file: !462, line: 139, baseType: !834, size: 64, offset: 128)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !830, file: !462, line: 146, baseType: !833, size: 64, offset: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !830, file: !462, line: 152, baseType: !828, size: 64, offset: 128)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !825, file: !385, line: 130, baseType: !702, size: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !820, file: !385, line: 134, baseType: !540, size: 64, offset: 192)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !820, file: !385, line: 137, baseType: !543, size: 64, offset: 256)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !820, file: !385, line: 138, baseType: !652, size: 32, offset: 320)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !820, file: !385, line: 142, baseType: !7, size: 32, offset: 352)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !820, file: !385, line: 144, baseType: !536, size: 32, offset: 384)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !820, file: !385, line: 145, baseType: !536, size: 32, offset: 416)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !820, file: !385, line: 146, baseType: !1050, size: 64, offset: 448)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !385, line: 119, baseType: !599)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !803, file: !385, line: 220, baseType: !806, size: 64, offset: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !803, file: !385, line: 223, baseType: !540, size: 64, offset: 128)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !803, file: !385, line: 226, baseType: !1054, size: 64, offset: 192)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !385, line: 185, flags: DIFlagFwdDecl)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !803, file: !385, line: 229, baseType: !1057, size: 128, offset: 256)
!1057 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1058, size: 128, elements: !1060)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !385, line: 229, flags: DIFlagFwdDecl)
!1060 = !{!1061}
!1061 = !DISubrange(count: 2)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !803, file: !385, line: 232, baseType: !802, size: 64, offset: 384)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !803, file: !385, line: 233, baseType: !802, size: 64, offset: 448)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !803, file: !385, line: 238, baseType: !1065, size: 64, offset: 512)
!1065 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !385, line: 235, size: 64, elements: !1066)
!1066 = !{!1067, !1073}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1065, file: !385, line: 236, baseType: !1068, size: 64)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !385, line: 273, size: 128, elements: !1070)
!1070 = !{!1071, !1072}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1069, file: !385, line: 275, baseType: !828, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1069, file: !385, line: 278, baseType: !828, size: 64, offset: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1065, file: !385, line: 237, baseType: !1074, size: 64)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !385, line: 259, size: 320, elements: !1076)
!1076 = !{!1077, !1078, !1079, !1080, !1081}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1075, file: !385, line: 261, baseType: !702, size: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1075, file: !385, line: 262, baseType: !702, size: 64, offset: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1075, file: !385, line: 266, baseType: !702, size: 64, offset: 128)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1075, file: !385, line: 267, baseType: !702, size: 64, offset: 192)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1075, file: !385, line: 270, baseType: !536, size: 32, offset: 256)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !803, file: !385, line: 241, baseType: !1050, size: 64, offset: 576)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !803, file: !385, line: 244, baseType: !536, size: 32, offset: 640)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !803, file: !385, line: 247, baseType: !536, size: 32, offset: 672)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !803, file: !385, line: 250, baseType: !536, size: 32, offset: 704)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !803, file: !385, line: 253, baseType: !536, size: 32, offset: 736)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !803, file: !385, line: 256, baseType: !536, size: 32, offset: 768)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !798, file: !385, line: 378, baseType: !801, size: 64, offset: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !798, file: !385, line: 381, baseType: !1090, size: 64, offset: 128)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !385, line: 282, baseType: !1092)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !385, line: 282, size: 128, elements: !1093)
!1093 = !{!1094}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1092, file: !385, line: 282, baseType: !1095, size: 128)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !385, line: 281, baseType: !1096)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !385, line: 281, size: 128, elements: !1097)
!1097 = !{!1098, !1099, !1100}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1096, file: !385, line: 281, baseType: !7, size: 32)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1096, file: !385, line: 281, baseType: !7, size: 32, offset: 32)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1096, file: !385, line: 281, baseType: !1101, size: 64, offset: 64)
!1101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !801, size: 64, elements: !626)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !798, file: !385, line: 384, baseType: !536, size: 32, offset: 192)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !798, file: !385, line: 387, baseType: !536, size: 32, offset: 224)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !798, file: !385, line: 390, baseType: !536, size: 32, offset: 256)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !798, file: !385, line: 394, baseType: !1090, size: 64, offset: 320)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !798, file: !385, line: 396, baseType: !384, size: 32, offset: 384)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !798, file: !385, line: 399, baseType: !1108, size: 64, offset: 416)
!1108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 64, elements: !1060)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !798, file: !385, line: 402, baseType: !1110, size: 64, offset: 480)
!1110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !1060)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !798, file: !385, line: 406, baseType: !536, size: 32, offset: 544)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !798, file: !385, line: 409, baseType: !536, size: 32, offset: 576)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !790, file: !791, line: 470, baseType: !829, size: 64, offset: 128)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !790, file: !791, line: 473, baseType: !1115, size: 64, offset: 192)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !741, line: 39, size: 1152, elements: !1117)
!1117 = !{!1118, !1168, !1181, !1193, !1194, !1263, !1264, !1268, !1269, !1270, !1271, !1272}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1116, file: !741, line: 41, baseType: !1119, size: 64)
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1120, line: 144, baseType: !1121)
!1120 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1120, line: 100, size: 896, elements: !1123)
!1123 = !{!1124, !1132, !1137, !1142, !1144, !1145, !1146, !1147, !1148, !1149, !1154, !1156, !1157, !1162, !1167}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1122, file: !1120, line: 102, baseType: !1125, size: 64)
!1125 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1120, line: 52, baseType: !1126)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = !DISubroutineType(types: !1128)
!1128 = !{!1129, !1130}
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1120, line: 47, baseType: !7)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1122, file: !1120, line: 105, baseType: !1133, size: 64, offset: 64)
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1120, line: 59, baseType: !1134)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64)
!1135 = !DISubroutineType(types: !1136)
!1136 = !{!536, !1130, !1130}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1122, file: !1120, line: 108, baseType: !1138, size: 64, offset: 128)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1120, line: 63, baseType: !1139)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64)
!1140 = !DISubroutineType(types: !1141)
!1141 = !{null, !540}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1122, file: !1120, line: 111, baseType: !1143, size: 64, offset: 192)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1122, file: !1120, line: 114, baseType: !984, size: 64, offset: 256)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1122, file: !1120, line: 117, baseType: !984, size: 64, offset: 320)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1122, file: !1120, line: 120, baseType: !984, size: 64, offset: 384)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1122, file: !1120, line: 124, baseType: !7, size: 32, offset: 448)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1122, file: !1120, line: 128, baseType: !7, size: 32, offset: 480)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1122, file: !1120, line: 131, baseType: !1150, size: 64, offset: 512)
!1150 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1120, line: 75, baseType: !1151)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64)
!1152 = !DISubroutineType(types: !1153)
!1153 = !{!540, !984, !984}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1122, file: !1120, line: 132, baseType: !1155, size: 64, offset: 576)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1120, line: 78, baseType: !1139)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1122, file: !1120, line: 135, baseType: !540, size: 64, offset: 640)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1122, file: !1120, line: 136, baseType: !1158, size: 64, offset: 704)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1120, line: 82, baseType: !1159)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64)
!1160 = !DISubroutineType(types: !1161)
!1161 = !{!540, !540, !984, !984}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1122, file: !1120, line: 137, baseType: !1163, size: 64, offset: 768)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1120, line: 83, baseType: !1164)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64)
!1165 = !DISubroutineType(types: !1166)
!1166 = !{null, !540, !540}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1122, file: !1120, line: 141, baseType: !7, size: 32, offset: 832)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1116, file: !741, line: 48, baseType: !1169, size: 64, offset: 64)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64)
!1170 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !462, line: 35, baseType: !1171)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !462, line: 35, size: 128, elements: !1172)
!1172 = !{!1173}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1171, file: !462, line: 35, baseType: !1174, size: 128)
!1174 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !462, line: 33, baseType: !1175)
!1175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !462, line: 33, size: 128, elements: !1176)
!1176 = !{!1177, !1178, !1179}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1175, file: !462, line: 33, baseType: !7, size: 32)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1175, file: !462, line: 33, baseType: !7, size: 32, offset: 32)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1175, file: !462, line: 33, baseType: !1180, size: 64, offset: 64)
!1180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !838, size: 64, elements: !626)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1116, file: !741, line: 51, baseType: !1182, size: 64, offset: 128)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64)
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !190, line: 183, baseType: !1184)
!1184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !190, line: 183, size: 128, elements: !1185)
!1185 = !{!1186}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1184, file: !190, line: 183, baseType: !1187, size: 128)
!1187 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !190, line: 182, baseType: !1188)
!1188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !190, line: 182, size: 128, elements: !1189)
!1189 = !{!1190, !1191, !1192}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1188, file: !190, line: 182, baseType: !7, size: 32)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1188, file: !190, line: 182, baseType: !7, size: 32, offset: 32)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1188, file: !190, line: 182, baseType: !892, size: 64, offset: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1116, file: !741, line: 54, baseType: !543, size: 64, offset: 192)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1116, file: !741, line: 57, baseType: !1195, size: 128, offset: 256)
!1195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1196, line: 31, size: 128, elements: !1197)
!1196 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1197 = !{!1198, !1199, !1200, !1201, !1202, !1203, !1204}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1195, file: !1196, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1195, file: !1196, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1195, file: !1196, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1195, file: !1196, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1195, file: !1196, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1195, file: !1196, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1195, file: !1196, line: 56, baseType: !1205, size: 64, offset: 64)
!1205 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !544, line: 47, baseType: !1206)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64)
!1207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1208, line: 75, size: 256, elements: !1209)
!1208 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1209 = !{!1210, !1222, !1223, !1224}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1207, file: !1208, line: 76, baseType: !1211, size: 64)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1208, line: 68, baseType: !1213)
!1213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1208, line: 63, size: 320, elements: !1214)
!1214 = !{!1215, !1217, !1218, !1219}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1213, file: !1208, line: 64, baseType: !1216, size: 64)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1213, file: !1208, line: 65, baseType: !1216, size: 64, offset: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1213, file: !1208, line: 66, baseType: !7, size: 32, offset: 128)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1213, file: !1208, line: 67, baseType: !1220, size: 128, offset: 192)
!1220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1221, size: 128, elements: !1060)
!1221 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1208, line: 29, baseType: !597)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1207, file: !1208, line: 77, baseType: !1211, size: 64, offset: 64)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1207, file: !1208, line: 78, baseType: !7, size: 32, offset: 128)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1207, file: !1208, line: 79, baseType: !1225, size: 64, offset: 192)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64)
!1226 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1208, line: 49, baseType: !1227)
!1227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1208, line: 45, size: 832, elements: !1228)
!1228 = !{!1229, !1230, !1231}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1227, file: !1208, line: 46, baseType: !1216, size: 64)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1227, file: !1208, line: 47, baseType: !1206, size: 64, offset: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1227, file: !1208, line: 48, baseType: !1232, size: 704, offset: 128)
!1232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1233, line: 164, size: 704, elements: !1234)
!1233 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1234 = !{!1235, !1236, !1246, !1247, !1248, !1249, !1250, !1251, !1255, !1259, !1260, !1261, !1262}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1232, file: !1233, line: 166, baseType: !599, size: 64)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1232, file: !1233, line: 167, baseType: !1237, size: 64, offset: 64)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64)
!1238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1233, line: 157, size: 192, elements: !1239)
!1239 = !{!1240, !1241, !1242}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1238, file: !1233, line: 159, baseType: !538, size: 64)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1238, file: !1233, line: 160, baseType: !1237, size: 64, offset: 64)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1238, file: !1233, line: 161, baseType: !1243, size: 32, offset: 128)
!1243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !539, size: 32, elements: !1244)
!1244 = !{!1245}
!1245 = !DISubrange(count: 4)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1232, file: !1233, line: 168, baseType: !538, size: 64, offset: 128)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1232, file: !1233, line: 169, baseType: !538, size: 64, offset: 192)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1232, file: !1233, line: 170, baseType: !538, size: 64, offset: 256)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1232, file: !1233, line: 171, baseType: !599, size: 64, offset: 320)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1232, file: !1233, line: 172, baseType: !536, size: 32, offset: 384)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1232, file: !1233, line: 176, baseType: !1252, size: 64, offset: 448)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64)
!1253 = !DISubroutineType(types: !1254)
!1254 = !{!1237, !540, !599}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1232, file: !1233, line: 177, baseType: !1256, size: 64, offset: 512)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64)
!1257 = !DISubroutineType(types: !1258)
!1258 = !{null, !540, !1237}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1232, file: !1233, line: 178, baseType: !540, size: 64, offset: 576)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1232, file: !1233, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1232, file: !1233, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1232, file: !1233, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !1116, file: !741, line: 60, baseType: !1195, size: 128, offset: 384)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !1116, file: !741, line: 64, baseType: !1265, size: 64, offset: 512)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64)
!1266 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1267, line: 33, flags: DIFlagFwdDecl)
!1267 = !DIFile(filename: "./pointer-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !1116, file: !741, line: 67, baseType: !543, size: 64, offset: 576)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !1116, file: !741, line: 73, baseType: !1119, size: 64, offset: 640)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !1116, file: !741, line: 77, baseType: !1205, size: 64, offset: 704)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !1116, file: !741, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !1116, file: !741, line: 82, baseType: !1273, size: 320, offset: 832)
!1273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !869, line: 62, size: 320, elements: !1274)
!1274 = !{!1275, !1281, !1282, !1283, !1284, !1285}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1273, file: !869, line: 63, baseType: !1276, size: 64)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64)
!1277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !869, line: 56, size: 128, elements: !1278)
!1278 = !{!1279, !1280}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1277, file: !869, line: 57, baseType: !1276, size: 64)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1277, file: !869, line: 58, baseType: !625, size: 8, offset: 64)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1273, file: !869, line: 64, baseType: !7, size: 32, offset: 64)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1273, file: !869, line: 66, baseType: !7, size: 32, offset: 96)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1273, file: !869, line: 68, baseType: !535, size: 8, offset: 128)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1273, file: !869, line: 70, baseType: !867, size: 64, offset: 192)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1273, file: !869, line: 71, baseType: !875, size: 64, offset: 256)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !790, file: !791, line: 476, baseType: !1287, size: 64, offset: 256)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64)
!1288 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !791, line: 476, flags: DIFlagFwdDecl)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !790, file: !791, line: 479, baseType: !1119, size: 64, offset: 320)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !790, file: !791, line: 484, baseType: !543, size: 64, offset: 384)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !790, file: !791, line: 488, baseType: !543, size: 64, offset: 448)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !790, file: !791, line: 493, baseType: !543, size: 64, offset: 512)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !790, file: !791, line: 496, baseType: !543, size: 64, offset: 576)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !790, file: !791, line: 501, baseType: !1295, size: 64, offset: 640)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64)
!1296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !396, line: 2355, size: 576, elements: !1297)
!1297 = !{!1298, !1301, !1302, !1303, !1304, !1306, !1307, !1312, !1313, !1314, !1315, !1316, !1317}
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1296, file: !396, line: 2356, baseType: !1299, size: 64)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64)
!1300 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !396, line: 2356, flags: DIFlagFwdDecl)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1296, file: !396, line: 2357, baseType: !541, size: 64, offset: 64)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1296, file: !396, line: 2358, baseType: !536, size: 32, offset: 128)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1296, file: !396, line: 2359, baseType: !536, size: 32, offset: 160)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1296, file: !396, line: 2360, baseType: !1305, size: 128, offset: 192)
!1305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !536, size: 128, elements: !1244)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1296, file: !396, line: 2364, baseType: !536, size: 32, offset: 320)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1296, file: !396, line: 2367, baseType: !1308, size: 128, offset: 384)
!1308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !396, line: 2349, size: 128, elements: !1309)
!1309 = !{!1310, !1311}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1308, file: !396, line: 2351, baseType: !702, size: 64)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1308, file: !396, line: 2352, baseType: !599, size: 64, offset: 64)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1296, file: !396, line: 2371, baseType: !395, size: 32, offset: 512)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1296, file: !396, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1296, file: !396, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1296, file: !396, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1296, file: !396, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1296, file: !396, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !790, file: !791, line: 504, baseType: !1319, size: 64, offset: 704)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64)
!1320 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !791, line: 504, flags: DIFlagFwdDecl)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !790, file: !791, line: 507, baseType: !1119, size: 64, offset: 768)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !790, file: !791, line: 510, baseType: !536, size: 32, offset: 832)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !790, file: !791, line: 513, baseType: !536, size: 32, offset: 864)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !790, file: !791, line: 516, baseType: !652, size: 32, offset: 896)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !790, file: !791, line: 519, baseType: !652, size: 32, offset: 928)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !790, file: !791, line: 522, baseType: !7, size: 32, offset: 960)
