; ModuleID = 'ipa-prop.bc'
source_filename = "ipa-prop.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.cgraph_node = type { %union.tree_node*, %struct.cgraph_edge*, %struct.cgraph_edge*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.htab*, i8*, %struct.VEC_ipa_opt_pass_heap*, %struct.cgraph_local_info, %struct.cgraph_global_info, %struct.cgraph_rtl_info, %struct.cgraph_clone_info, %struct.cgraph_thunk_info, i64, i32, i32, i32, i16 }
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }

!527 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!528 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!529 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!530 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!531 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!532 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!533 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!534 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!535 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!536 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!537 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!538 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!539 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!540 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!541 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!542 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!543 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!544 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!545 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!546 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!547 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_rhs_class", file: !483, line: 80, baseType: !7, size: 32, elements: !548)
!548 = !{!549, !550, !551, !552}
!549 = !DIEnumerator(name: "GIMPLE_INVALID_RHS", value: 0, isUnsigned: true)
!550 = !DIEnumerator(name: "GIMPLE_BINARY_RHS", value: 1, isUnsigned: true)
!551 = !DIEnumerator(name: "GIMPLE_UNARY_RHS", value: 2, isUnsigned: true)
!552 = !DIEnumerator(name: "GIMPLE_SINGLE_RHS", value: 3, isUnsigned: true)
!553 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ld_plugin_symbol_resolution", file: !554, line: 123, baseType: !7, size: 32, elements: !555)
!554 = !DIFile(filename: "./include/plugin-api.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!555 = !{!556, !557, !558, !559, !560, !561, !562, !563, !564}
!556 = !DIEnumerator(name: "LDPR_UNKNOWN", value: 0, isUnsigned: true)
!557 = !DIEnumerator(name: "LDPR_UNDEF", value: 1, isUnsigned: true)
!558 = !DIEnumerator(name: "LDPR_PREVAILING_DEF", value: 2, isUnsigned: true)
!559 = !DIEnumerator(name: "LDPR_PREVAILING_DEF_IRONLY", value: 3, isUnsigned: true)
!560 = !DIEnumerator(name: "LDPR_PREEMPTED_REG", value: 4, isUnsigned: true)
!561 = !DIEnumerator(name: "LDPR_PREEMPTED_IR", value: 5, isUnsigned: true)
!562 = !DIEnumerator(name: "LDPR_RESOLVED_IR", value: 6, isUnsigned: true)
!563 = !DIEnumerator(name: "LDPR_RESOLVED_EXEC", value: 7, isUnsigned: true)
!564 = !DIEnumerator(name: "LDPR_RESOLVED_DYN", value: 8, isUnsigned: true)
!565 = !{!566, !567, !568, !569, !572, !573, !575, !2015, !7, !2025, !5, !583, !694, !639, !2050, !2073, !879, !2090, !913, !570, !547, !2056, !2092, !2105, !2110, !2135, !2148, !461, !1090}
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!568 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !571)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipa_func_list", file: !456, line: 390, size: 128, elements: !577)
!577 = !{!578, !2014}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !576, file: !456, line: 392, baseType: !579, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cgraph_node", file: !250, line: 181, size: 2496, elements: !581)
!581 = !{!582, !1757, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1897, !1951, !1961, !1965, !1991, !2000, !2001, !2002, !2003, !2004, !2005, !2006, !2007, !2008, !2009, !2010, !2011, !2012, !2013}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !580, file: !250, line: 182, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !584, line: 56, baseType: !585)
!584 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !6, line: 3371, size: 1792, elements: !587)
!587 = !{!588, !621, !627, !640, !647, !654, !659, !668, !674, !687, !699, !737, !745, !773, !790, !791, !796, !805, !811, !816, !820, !824, !1406, !1455, !1461, !1467, !1474, !1487, !1501, !1518, !1530, !1552, !1567, !1739}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !586, file: !6, line: 3372, baseType: !589, size: 64)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !6, line: 360, size: 64, elements: !590)
!590 = !{!591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !589, file: !6, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !589, file: !6, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !589, file: !6, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !589, file: !6, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !589, file: !6, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !589, file: !6, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !589, file: !6, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !589, file: !6, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !589, file: !6, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !589, file: !6, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !589, file: !6, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !589, file: !6, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !589, file: !6, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !589, file: !6, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !589, file: !6, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !589, file: !6, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !589, file: !6, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !589, file: !6, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !589, file: !6, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !589, file: !6, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !589, file: !6, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !589, file: !6, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !589, file: !6, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !589, file: !6, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !589, file: !6, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !589, file: !6, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !589, file: !6, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !589, file: !6, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !589, file: !6, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !589, file: !6, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !586, file: !6, line: 3373, baseType: !622, size: 192)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !6, line: 402, size: 192, elements: !623)
!623 = !{!624, !625, !626}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !622, file: !6, line: 403, baseType: !589, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !622, file: !6, line: 404, baseType: !583, size: 64, offset: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !622, file: !6, line: 405, baseType: !583, size: 64, offset: 128)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !586, file: !6, line: 3374, baseType: !628, size: 320)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !6, line: 1384, size: 320, elements: !629)
!629 = !{!630, !631}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !628, file: !6, line: 1385, baseType: !622, size: 192)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !628, file: !6, line: 1386, baseType: !632, size: 128, offset: 192)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !633, line: 58, baseType: !634)
!633 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !633, line: 54, size: 128, elements: !635)
!635 = !{!636, !638}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !634, file: !633, line: 56, baseType: !637, size: 64)
!637 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !634, file: !633, line: 57, baseType: !639, size: 64, offset: 64)
!639 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !586, file: !6, line: 3375, baseType: !641, size: 256)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !6, line: 1397, size: 256, elements: !642)
!642 = !{!643, !644}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !641, file: !6, line: 1398, baseType: !622, size: 192)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !641, file: !6, line: 1399, baseType: !645, size: 64, offset: 192)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !6, line: 1392, flags: DIFlagFwdDecl)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !586, file: !6, line: 3376, baseType: !648, size: 256)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !6, line: 1408, size: 256, elements: !649)
!649 = !{!650, !651}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !648, file: !6, line: 1409, baseType: !622, size: 192)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !648, file: !6, line: 1410, baseType: !652, size: 64, offset: 192)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !6, line: 1403, flags: DIFlagFwdDecl)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !586, file: !6, line: 3377, baseType: !655, size: 256)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !6, line: 1437, size: 256, elements: !656)
!656 = !{!657, !658}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !655, file: !6, line: 1438, baseType: !622, size: 192)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !655, file: !6, line: 1439, baseType: !583, size: 64, offset: 192)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !586, file: !6, line: 3378, baseType: !660, size: 256)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !6, line: 1418, size: 256, elements: !661)
!661 = !{!662, !663, !664}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !660, file: !6, line: 1419, baseType: !622, size: 192)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !660, file: !6, line: 1420, baseType: !568, size: 32, offset: 192)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !660, file: !6, line: 1421, baseType: !665, size: 8, offset: 224)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !571, size: 8, elements: !666)
!666 = !{!667}
!667 = !DISubrange(count: 1)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !586, file: !6, line: 3379, baseType: !669, size: 320)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !6, line: 1428, size: 320, elements: !670)
!670 = !{!671, !672, !673}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !669, file: !6, line: 1429, baseType: !622, size: 192)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !669, file: !6, line: 1430, baseType: !583, size: 64, offset: 192)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !669, file: !6, line: 1431, baseType: !583, size: 64, offset: 256)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !586, file: !6, line: 3380, baseType: !675, size: 320)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !6, line: 1460, size: 320, elements: !676)
!676 = !{!677, !678}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !675, file: !6, line: 1461, baseType: !622, size: 192)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !675, file: !6, line: 1462, baseType: !679, size: 128, offset: 192)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !680, line: 31, size: 128, elements: !681)
!680 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!681 = !{!682, !685, !686}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !679, file: !680, line: 32, baseType: !683, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !567)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !679, file: !680, line: 33, baseType: !7, size: 32, offset: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !679, file: !680, line: 34, baseType: !7, size: 32, offset: 96)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !586, file: !6, line: 3381, baseType: !688, size: 384)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !6, line: 2507, size: 384, elements: !689)
!689 = !{!690, !691, !696, !697, !698}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !688, file: !6, line: 2508, baseType: !622, size: 192)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !688, file: !6, line: 2509, baseType: !692, size: 32, offset: 192)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !693, line: 58, baseType: !694)
!693 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !695, line: 44, baseType: !7)
!695 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!696 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !688, file: !6, line: 2510, baseType: !7, size: 32, offset: 224)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !688, file: !6, line: 2511, baseType: !583, size: 64, offset: 256)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !688, file: !6, line: 2512, baseType: !583, size: 64, offset: 320)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !586, file: !6, line: 3382, baseType: !700, size: 896)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !6, line: 2652, size: 896, elements: !701)
!701 = !{!702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !700, file: !6, line: 2653, baseType: !688, size: 384)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !700, file: !6, line: 2654, baseType: !583, size: 64, offset: 384)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !700, file: !6, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !700, file: !6, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !700, file: !6, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !700, file: !6, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !700, file: !6, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !700, file: !6, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !700, file: !6, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !700, file: !6, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !700, file: !6, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !700, file: !6, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !700, file: !6, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !700, file: !6, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !700, file: !6, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !700, file: !6, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !700, file: !6, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !700, file: !6, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !700, file: !6, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !700, file: !6, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !700, file: !6, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !700, file: !6, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !700, file: !6, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !700, file: !6, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !700, file: !6, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !700, file: !6, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !700, file: !6, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !700, file: !6, line: 2703, baseType: !7, size: 32, offset: 512)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !700, file: !6, line: 2705, baseType: !583, size: 64, offset: 576)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !700, file: !6, line: 2706, baseType: !583, size: 64, offset: 640)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !700, file: !6, line: 2707, baseType: !583, size: 64, offset: 704)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !700, file: !6, line: 2708, baseType: !583, size: 64, offset: 768)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !700, file: !6, line: 2711, baseType: !735, size: 64, offset: 832)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !6, line: 2711, flags: DIFlagFwdDecl)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !586, file: !6, line: 3383, baseType: !738, size: 960)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !6, line: 2756, size: 960, elements: !739)
!739 = !{!740, !741}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !738, file: !6, line: 2757, baseType: !700, size: 896)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !738, file: !6, line: 2758, baseType: !742, size: 64, offset: 896)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !584, line: 50, baseType: !743)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !584, line: 49, flags: DIFlagFwdDecl)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !586, file: !6, line: 3384, baseType: !746, size: 1472)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !6, line: 3114, size: 1472, elements: !747)
!747 = !{!748, !769, !770, !771, !772}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !746, file: !6, line: 3115, baseType: !749, size: 1216)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !6, line: 2984, size: 1216, elements: !750)
!750 = !{!751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !749, file: !6, line: 2985, baseType: !738, size: 960)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !749, file: !6, line: 2986, baseType: !583, size: 64, offset: 960)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !749, file: !6, line: 2987, baseType: !583, size: 64, offset: 1024)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !749, file: !6, line: 2988, baseType: !583, size: 64, offset: 1088)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !749, file: !6, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !749, file: !6, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !749, file: !6, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !749, file: !6, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !749, file: !6, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !749, file: !6, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !749, file: !6, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !749, file: !6, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !749, file: !6, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !749, file: !6, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !749, file: !6, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !749, file: !6, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !749, file: !6, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !749, file: !6, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !746, file: !6, line: 3117, baseType: !583, size: 64, offset: 1216)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !746, file: !6, line: 3119, baseType: !583, size: 64, offset: 1280)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !746, file: !6, line: 3121, baseType: !583, size: 64, offset: 1344)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !746, file: !6, line: 3123, baseType: !583, size: 64, offset: 1408)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !586, file: !6, line: 3385, baseType: !774, size: 1088)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !6, line: 2874, size: 1088, elements: !775)
!775 = !{!776, !777, !778}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !774, file: !6, line: 2875, baseType: !738, size: 960)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !774, file: !6, line: 2876, baseType: !742, size: 64, offset: 960)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !774, file: !6, line: 2877, baseType: !779, size: 64, offset: 1024)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !781, line: 172, size: 128, elements: !782)
!781 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!782 = !{!783, !784, !785, !786, !787, !788, !789}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !780, file: !781, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !780, file: !781, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !780, file: !781, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !780, file: !781, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !780, file: !781, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !780, file: !781, line: 195, baseType: !7, size: 32, offset: 32)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !780, file: !781, line: 199, baseType: !583, size: 64, offset: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !586, file: !6, line: 3386, baseType: !749, size: 1216)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !586, file: !6, line: 3387, baseType: !792, size: 1280)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !6, line: 3093, size: 1280, elements: !793)
!793 = !{!794, !795}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !792, file: !6, line: 3094, baseType: !749, size: 1216)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !792, file: !6, line: 3095, baseType: !779, size: 64, offset: 1216)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !586, file: !6, line: 3388, baseType: !797, size: 1216)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !6, line: 2824, size: 1216, elements: !798)
!798 = !{!799, !800, !801, !802, !803, !804}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !797, file: !6, line: 2825, baseType: !700, size: 896)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !797, file: !6, line: 2827, baseType: !583, size: 64, offset: 896)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !797, file: !6, line: 2828, baseType: !583, size: 64, offset: 960)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !797, file: !6, line: 2829, baseType: !583, size: 64, offset: 1024)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !797, file: !6, line: 2830, baseType: !583, size: 64, offset: 1088)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !797, file: !6, line: 2831, baseType: !583, size: 64, offset: 1152)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !586, file: !6, line: 3389, baseType: !806, size: 1024)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !6, line: 2850, size: 1024, elements: !807)
!807 = !{!808, !809, !810}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !806, file: !6, line: 2851, baseType: !738, size: 960)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !806, file: !6, line: 2852, baseType: !568, size: 32, offset: 960)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !806, file: !6, line: 2853, baseType: !568, size: 32, offset: 992)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !586, file: !6, line: 3390, baseType: !812, size: 1024)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !6, line: 2857, size: 1024, elements: !813)
!813 = !{!814, !815}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !812, file: !6, line: 2858, baseType: !738, size: 960)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !812, file: !6, line: 2859, baseType: !779, size: 64, offset: 960)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !586, file: !6, line: 3391, baseType: !817, size: 960)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !6, line: 2862, size: 960, elements: !818)
!818 = !{!819}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !817, file: !6, line: 2863, baseType: !738, size: 960)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !586, file: !6, line: 3392, baseType: !821, size: 1472)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !6, line: 3304, size: 1472, elements: !822)
!822 = !{!823}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !821, file: !6, line: 3305, baseType: !746, size: 1472)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !586, file: !6, line: 3393, baseType: !825, size: 1792)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !6, line: 3248, size: 1792, elements: !826)
!826 = !{!827, !828, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !825, file: !6, line: 3249, baseType: !746, size: 1472)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !825, file: !6, line: 3251, baseType: !829, size: 64, offset: 1472)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !831, line: 463, size: 1152, elements: !832)
!831 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!832 = !{!833, !836, !1153, !1154, !1326, !1329, !1330, !1331, !1332, !1333, !1334, !1358, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !830, file: !831, line: 464, baseType: !834, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !831, line: 464, flags: DIFlagFwdDecl)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !830, file: !831, line: 467, baseType: !837, size: 64, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !202, line: 374, size: 640, elements: !839)
!839 = !{!840, !1128, !1129, !1142, !1143, !1144, !1145, !1146, !1147, !1149, !1151, !1152}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !838, file: !202, line: 377, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !584, line: 111, baseType: !842)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !202, line: 217, size: 832, elements: !844)
!844 = !{!845, !1091, !1092, !1093, !1096, !1102, !1103, !1104, !1122, !1123, !1124, !1125, !1126, !1127}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !843, file: !202, line: 219, baseType: !846, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !202, line: 151, baseType: !848)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !202, line: 151, size: 128, elements: !849)
!849 = !{!850}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !848, file: !202, line: 151, baseType: !851, size: 128)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !202, line: 150, baseType: !852)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !202, line: 150, size: 128, elements: !853)
!853 = !{!854, !855, !856}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !852, file: !202, line: 150, baseType: !7, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !852, file: !202, line: 150, baseType: !7, size: 32, offset: 32)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !852, file: !202, line: 150, baseType: !857, size: 64, offset: 64)
!857 = !DICompositeType(tag: DW_TAG_array_type, baseType: !858, size: 64, elements: !666)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !584, line: 108, baseType: !859)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !202, line: 122, size: 512, elements: !861)
!861 = !{!862, !863, !864, !1083, !1084, !1085, !1086, !1087, !1088, !1089}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !860, file: !202, line: 124, baseType: !842, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !860, file: !202, line: 125, baseType: !842, size: 64, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !860, file: !202, line: 131, baseType: !865, size: 64, offset: 128)
!865 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !202, line: 128, size: 64, elements: !866)
!866 = !{!867, !1082}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !865, file: !202, line: 129, baseType: !868, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !584, line: 66, baseType: !869)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !483, line: 143, size: 192, elements: !871)
!871 = !{!872, !1080, !1081}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !870, file: !483, line: 145, baseType: !873, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !584, line: 69, baseType: !874)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !483, line: 136, size: 192, elements: !876)
!876 = !{!877, !1078, !1079}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !875, file: !483, line: 137, baseType: !878, size: 64)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !584, line: 58, baseType: !879)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !483, line: 737, size: 768, elements: !881)
!881 = !{!882, !899, !933, !939, !944, !949, !956, !962, !968, !973, !987, !992, !998, !1003, !1013, !1018, !1036, !1043, !1050, !1056, !1061, !1067, !1073}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !880, file: !483, line: 738, baseType: !883, size: 256)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !483, line: 271, size: 256, elements: !884)
!884 = !{!885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !883, file: !483, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !883, file: !483, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !883, file: !483, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !883, file: !483, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !883, file: !483, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !883, file: !483, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !883, file: !483, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !883, file: !483, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !883, file: !483, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !883, file: !483, line: 312, baseType: !7, size: 32, offset: 32)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !883, file: !483, line: 316, baseType: !692, size: 32, offset: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !883, file: !483, line: 319, baseType: !7, size: 32, offset: 96)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !883, file: !483, line: 323, baseType: !842, size: 64, offset: 128)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !883, file: !483, line: 327, baseType: !583, size: 64, offset: 192)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !880, file: !483, line: 739, baseType: !900, size: 448)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !483, line: 350, size: 448, elements: !901)
!901 = !{!902, !931}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !900, file: !483, line: 353, baseType: !903, size: 384)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !483, line: 333, size: 384, elements: !904)
!904 = !{!905, !906, !914}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !903, file: !483, line: 336, baseType: !883, size: 256)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !903, file: !483, line: 343, baseType: !907, size: 64, offset: 256)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !909, line: 37, size: 128, elements: !910)
!909 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!910 = !{!911, !912}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !908, file: !909, line: 39, baseType: !907, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !908, file: !909, line: 40, baseType: !913, size: 64, offset: 64)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !903, file: !483, line: 344, baseType: !915, size: 64, offset: 320)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !909, line: 45, size: 320, elements: !917)
!917 = !{!918, !919}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !916, file: !909, line: 47, baseType: !915, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !916, file: !909, line: 48, baseType: !920, size: 256, offset: 64)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !6, line: 1883, size: 256, elements: !921)
!921 = !{!922, !924, !925, !930}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !920, file: !6, line: 1884, baseType: !923, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !920, file: !6, line: 1885, baseType: !923, size: 64, offset: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !920, file: !6, line: 1891, baseType: !926, size: 64, offset: 128)
!926 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !920, file: !6, line: 1891, size: 64, elements: !927)
!927 = !{!928, !929}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !926, file: !6, line: 1891, baseType: !878, size: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !926, file: !6, line: 1891, baseType: !583, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !920, file: !6, line: 1892, baseType: !913, size: 64, offset: 192)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !900, file: !483, line: 359, baseType: !932, size: 64, offset: 384)
!932 = !DICompositeType(tag: DW_TAG_array_type, baseType: !583, size: 64, elements: !666)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !880, file: !483, line: 740, baseType: !934, size: 512)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !483, line: 365, size: 512, elements: !935)
!935 = !{!936, !937, !938}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !934, file: !483, line: 368, baseType: !903, size: 384)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !934, file: !483, line: 373, baseType: !583, size: 64, offset: 384)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !934, file: !483, line: 374, baseType: !583, size: 64, offset: 448)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !880, file: !483, line: 741, baseType: !940, size: 576)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !483, line: 380, size: 576, elements: !941)
!941 = !{!942, !943}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !940, file: !483, line: 383, baseType: !934, size: 512)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !940, file: !483, line: 389, baseType: !932, size: 64, offset: 512)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !880, file: !483, line: 742, baseType: !945, size: 320)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !483, line: 395, size: 320, elements: !946)
!946 = !{!947, !948}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !945, file: !483, line: 397, baseType: !883, size: 256)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !945, file: !483, line: 400, baseType: !868, size: 64, offset: 256)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !880, file: !483, line: 743, baseType: !950, size: 448)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !483, line: 406, size: 448, elements: !951)
!951 = !{!952, !953, !954, !955}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !950, file: !483, line: 408, baseType: !883, size: 256)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !950, file: !483, line: 412, baseType: !583, size: 64, offset: 256)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !950, file: !483, line: 420, baseType: !583, size: 64, offset: 320)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !950, file: !483, line: 423, baseType: !868, size: 64, offset: 384)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !880, file: !483, line: 744, baseType: !957, size: 384)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !483, line: 429, size: 384, elements: !958)
!958 = !{!959, !960, !961}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !957, file: !483, line: 431, baseType: !883, size: 256)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !957, file: !483, line: 434, baseType: !583, size: 64, offset: 256)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !957, file: !483, line: 437, baseType: !868, size: 64, offset: 320)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !880, file: !483, line: 745, baseType: !963, size: 384)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !483, line: 443, size: 384, elements: !964)
!964 = !{!965, !966, !967}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !963, file: !483, line: 445, baseType: !883, size: 256)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !963, file: !483, line: 449, baseType: !583, size: 64, offset: 256)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !963, file: !483, line: 453, baseType: !868, size: 64, offset: 320)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !880, file: !483, line: 746, baseType: !969, size: 320)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !483, line: 459, size: 320, elements: !970)
!970 = !{!971, !972}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !969, file: !483, line: 461, baseType: !883, size: 256)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !969, file: !483, line: 464, baseType: !583, size: 64, offset: 256)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !880, file: !483, line: 747, baseType: !974, size: 768)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !483, line: 469, size: 768, elements: !975)
!975 = !{!976, !977, !978, !979, !980}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !974, file: !483, line: 471, baseType: !883, size: 256)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !974, file: !483, line: 474, baseType: !7, size: 32, offset: 256)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !974, file: !483, line: 475, baseType: !7, size: 32, offset: 288)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !974, file: !483, line: 478, baseType: !583, size: 64, offset: 320)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !974, file: !483, line: 481, baseType: !981, size: 384, offset: 384)
!981 = !DICompositeType(tag: DW_TAG_array_type, baseType: !982, size: 384, elements: !666)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !6, line: 1917, size: 384, elements: !983)
!983 = !{!984, !985, !986}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !982, file: !6, line: 1920, baseType: !920, size: 256)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !982, file: !6, line: 1921, baseType: !583, size: 64, offset: 256)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !982, file: !6, line: 1922, baseType: !692, size: 32, offset: 320)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !880, file: !483, line: 748, baseType: !988, size: 320)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !483, line: 487, size: 320, elements: !989)
!989 = !{!990, !991}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !988, file: !483, line: 490, baseType: !883, size: 256)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !988, file: !483, line: 494, baseType: !568, size: 32, offset: 256)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !880, file: !483, line: 749, baseType: !993, size: 384)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !483, line: 500, size: 384, elements: !994)
!994 = !{!995, !996, !997}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !993, file: !483, line: 502, baseType: !883, size: 256)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !993, file: !483, line: 506, baseType: !868, size: 64, offset: 256)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !993, file: !483, line: 510, baseType: !868, size: 64, offset: 320)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !880, file: !483, line: 750, baseType: !999, size: 320)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !483, line: 529, size: 320, elements: !1000)
!1000 = !{!1001, !1002}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !999, file: !483, line: 531, baseType: !883, size: 256)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !999, file: !483, line: 540, baseType: !868, size: 64, offset: 256)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !880, file: !483, line: 751, baseType: !1004, size: 704)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !483, line: 546, size: 704, elements: !1005)
!1005 = !{!1006, !1007, !1008, !1009, !1010, !1011, !1012}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1004, file: !483, line: 549, baseType: !934, size: 512)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1004, file: !483, line: 553, baseType: !573, size: 64, offset: 512)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1004, file: !483, line: 557, baseType: !567, size: 8, offset: 576)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1004, file: !483, line: 558, baseType: !567, size: 8, offset: 584)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1004, file: !483, line: 559, baseType: !567, size: 8, offset: 592)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1004, file: !483, line: 560, baseType: !567, size: 8, offset: 600)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1004, file: !483, line: 566, baseType: !932, size: 64, offset: 640)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !880, file: !483, line: 752, baseType: !1014, size: 384)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !483, line: 571, size: 384, elements: !1015)
!1015 = !{!1016, !1017}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1014, file: !483, line: 573, baseType: !945, size: 320)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1014, file: !483, line: 577, baseType: !583, size: 64, offset: 320)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !880, file: !483, line: 753, baseType: !1019, size: 576)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !483, line: 600, size: 576, elements: !1020)
!1020 = !{!1021, !1022, !1023, !1026, !1035}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1019, file: !483, line: 602, baseType: !945, size: 320)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1019, file: !483, line: 605, baseType: !583, size: 64, offset: 320)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1019, file: !483, line: 609, baseType: !1024, size: 64, offset: 384)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1025, line: 46, baseType: !637)
!1025 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1019, file: !483, line: 612, baseType: !1027, size: 64, offset: 448)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !483, line: 581, size: 320, elements: !1029)
!1029 = !{!1030, !1031, !1032, !1033, !1034}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1028, file: !483, line: 583, baseType: !5, size: 32)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1028, file: !483, line: 586, baseType: !583, size: 64, offset: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1028, file: !483, line: 589, baseType: !583, size: 64, offset: 128)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1028, file: !483, line: 592, baseType: !583, size: 64, offset: 192)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1028, file: !483, line: 595, baseType: !583, size: 64, offset: 256)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1019, file: !483, line: 616, baseType: !868, size: 64, offset: 512)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !880, file: !483, line: 754, baseType: !1037, size: 512)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !483, line: 622, size: 512, elements: !1038)
!1038 = !{!1039, !1040, !1041, !1042}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1037, file: !483, line: 624, baseType: !945, size: 320)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1037, file: !483, line: 628, baseType: !583, size: 64, offset: 320)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1037, file: !483, line: 632, baseType: !583, size: 64, offset: 384)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1037, file: !483, line: 636, baseType: !583, size: 64, offset: 448)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !880, file: !483, line: 755, baseType: !1044, size: 704)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !483, line: 642, size: 704, elements: !1045)
!1045 = !{!1046, !1047, !1048, !1049}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1044, file: !483, line: 644, baseType: !1037, size: 512)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1044, file: !483, line: 648, baseType: !583, size: 64, offset: 512)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1044, file: !483, line: 652, baseType: !583, size: 64, offset: 576)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1044, file: !483, line: 653, baseType: !583, size: 64, offset: 640)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !880, file: !483, line: 756, baseType: !1051, size: 448)
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !483, line: 663, size: 448, elements: !1052)
!1052 = !{!1053, !1054, !1055}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1051, file: !483, line: 665, baseType: !945, size: 320)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1051, file: !483, line: 668, baseType: !583, size: 64, offset: 320)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1051, file: !483, line: 673, baseType: !583, size: 64, offset: 384)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !880, file: !483, line: 757, baseType: !1057, size: 384)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !483, line: 694, size: 384, elements: !1058)
!1058 = !{!1059, !1060}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1057, file: !483, line: 696, baseType: !945, size: 320)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1057, file: !483, line: 699, baseType: !583, size: 64, offset: 320)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !880, file: !483, line: 758, baseType: !1062, size: 384)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !483, line: 681, size: 384, elements: !1063)
!1063 = !{!1064, !1065, !1066}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1062, file: !483, line: 683, baseType: !883, size: 256)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1062, file: !483, line: 686, baseType: !583, size: 64, offset: 256)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1062, file: !483, line: 689, baseType: !583, size: 64, offset: 320)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !880, file: !483, line: 759, baseType: !1068, size: 384)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !483, line: 707, size: 384, elements: !1069)
!1069 = !{!1070, !1071, !1072}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1068, file: !483, line: 709, baseType: !883, size: 256)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1068, file: !483, line: 712, baseType: !583, size: 64, offset: 256)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1068, file: !483, line: 712, baseType: !583, size: 64, offset: 320)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !880, file: !483, line: 760, baseType: !1074, size: 320)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !483, line: 718, size: 320, elements: !1075)
!1075 = !{!1076, !1077}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1074, file: !483, line: 720, baseType: !883, size: 256)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1074, file: !483, line: 723, baseType: !583, size: 64, offset: 256)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !875, file: !483, line: 138, baseType: !874, size: 64, offset: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !875, file: !483, line: 139, baseType: !874, size: 64, offset: 128)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !870, file: !483, line: 146, baseType: !873, size: 64, offset: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !870, file: !483, line: 152, baseType: !868, size: 64, offset: 128)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !865, file: !202, line: 130, baseType: !742, size: 64)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !860, file: !202, line: 134, baseType: !572, size: 64, offset: 192)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !860, file: !202, line: 137, baseType: !583, size: 64, offset: 256)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !860, file: !202, line: 138, baseType: !692, size: 32, offset: 320)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !860, file: !202, line: 142, baseType: !7, size: 32, offset: 352)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !860, file: !202, line: 144, baseType: !568, size: 32, offset: 384)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !860, file: !202, line: 145, baseType: !568, size: 32, offset: 416)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !860, file: !202, line: 146, baseType: !1090, size: 64, offset: 448)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !202, line: 119, baseType: !639)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !843, file: !202, line: 220, baseType: !846, size: 64, offset: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !843, file: !202, line: 223, baseType: !572, size: 64, offset: 128)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !843, file: !202, line: 226, baseType: !1094, size: 64, offset: 192)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64)
!1095 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !202, line: 185, flags: DIFlagFwdDecl)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !843, file: !202, line: 229, baseType: !1097, size: 128, offset: 256)
!1097 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1098, size: 128, elements: !1100)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64)
!1099 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !202, line: 229, flags: DIFlagFwdDecl)
!1100 = !{!1101}
!1101 = !DISubrange(count: 2)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !843, file: !202, line: 232, baseType: !842, size: 64, offset: 384)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !843, file: !202, line: 233, baseType: !842, size: 64, offset: 448)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !843, file: !202, line: 238, baseType: !1105, size: 64, offset: 512)
!1105 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !202, line: 235, size: 64, elements: !1106)
!1106 = !{!1107, !1113}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1105, file: !202, line: 236, baseType: !1108, size: 64)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !202, line: 273, size: 128, elements: !1110)
!1110 = !{!1111, !1112}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1109, file: !202, line: 275, baseType: !868, size: 64)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1109, file: !202, line: 278, baseType: !868, size: 64, offset: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1105, file: !202, line: 237, baseType: !1114, size: 64)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !202, line: 259, size: 320, elements: !1116)
!1116 = !{!1117, !1118, !1119, !1120, !1121}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1115, file: !202, line: 261, baseType: !742, size: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1115, file: !202, line: 262, baseType: !742, size: 64, offset: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1115, file: !202, line: 266, baseType: !742, size: 64, offset: 128)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1115, file: !202, line: 267, baseType: !742, size: 64, offset: 192)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1115, file: !202, line: 270, baseType: !568, size: 32, offset: 256)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !843, file: !202, line: 241, baseType: !1090, size: 64, offset: 576)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !843, file: !202, line: 244, baseType: !568, size: 32, offset: 640)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !843, file: !202, line: 247, baseType: !568, size: 32, offset: 672)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !843, file: !202, line: 250, baseType: !568, size: 32, offset: 704)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !843, file: !202, line: 253, baseType: !568, size: 32, offset: 736)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !843, file: !202, line: 256, baseType: !568, size: 32, offset: 768)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !838, file: !202, line: 378, baseType: !841, size: 64, offset: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !838, file: !202, line: 381, baseType: !1130, size: 64, offset: 128)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1131 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !202, line: 282, baseType: !1132)
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !202, line: 282, size: 128, elements: !1133)
!1133 = !{!1134}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1132, file: !202, line: 282, baseType: !1135, size: 128)
!1135 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !202, line: 281, baseType: !1136)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !202, line: 281, size: 128, elements: !1137)
!1137 = !{!1138, !1139, !1140}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1136, file: !202, line: 281, baseType: !7, size: 32)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1136, file: !202, line: 281, baseType: !7, size: 32, offset: 32)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1136, file: !202, line: 281, baseType: !1141, size: 64, offset: 64)
!1141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !841, size: 64, elements: !666)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !838, file: !202, line: 384, baseType: !568, size: 32, offset: 192)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !838, file: !202, line: 387, baseType: !568, size: 32, offset: 224)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !838, file: !202, line: 390, baseType: !568, size: 32, offset: 256)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !838, file: !202, line: 394, baseType: !1130, size: 64, offset: 320)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !838, file: !202, line: 396, baseType: !201, size: 32, offset: 384)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !838, file: !202, line: 399, baseType: !1148, size: 64, offset: 416)
!1148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 64, elements: !1100)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !838, file: !202, line: 402, baseType: !1150, size: 64, offset: 480)
!1150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !1100)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !838, file: !202, line: 406, baseType: !568, size: 32, offset: 544)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !838, file: !202, line: 409, baseType: !568, size: 32, offset: 576)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !830, file: !831, line: 470, baseType: !869, size: 64, offset: 128)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !830, file: !831, line: 473, baseType: !1155, size: 64, offset: 192)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !781, line: 39, size: 1152, elements: !1157)
!1157 = !{!1158, !1208, !1221, !1233, !1234, !1303, !1304, !1308, !1309, !1310, !1311, !1312}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1156, file: !781, line: 41, baseType: !1159, size: 64)
!1159 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1160, line: 144, baseType: !1161)
!1160 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1160, line: 100, size: 896, elements: !1163)
!1163 = !{!1164, !1172, !1177, !1182, !1184, !1185, !1186, !1187, !1188, !1189, !1194, !1196, !1197, !1202, !1207}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1162, file: !1160, line: 102, baseType: !1165, size: 64)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1160, line: 52, baseType: !1166)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64)
!1167 = !DISubroutineType(types: !1168)
!1168 = !{!1169, !1170}
!1169 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1160, line: 47, baseType: !7)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64)
!1171 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1162, file: !1160, line: 105, baseType: !1173, size: 64, offset: 64)
!1173 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1160, line: 59, baseType: !1174)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64)
!1175 = !DISubroutineType(types: !1176)
!1176 = !{!568, !1170, !1170}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1162, file: !1160, line: 108, baseType: !1178, size: 64, offset: 128)
!1178 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1160, line: 63, baseType: !1179)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64)
!1180 = !DISubroutineType(types: !1181)
!1181 = !{null, !572}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1162, file: !1160, line: 111, baseType: !1183, size: 64, offset: 192)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1162, file: !1160, line: 114, baseType: !1024, size: 64, offset: 256)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1162, file: !1160, line: 117, baseType: !1024, size: 64, offset: 320)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1162, file: !1160, line: 120, baseType: !1024, size: 64, offset: 384)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1162, file: !1160, line: 124, baseType: !7, size: 32, offset: 448)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1162, file: !1160, line: 128, baseType: !7, size: 32, offset: 480)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1162, file: !1160, line: 131, baseType: !1190, size: 64, offset: 512)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1160, line: 75, baseType: !1191)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64)
!1192 = !DISubroutineType(types: !1193)
!1193 = !{!572, !1024, !1024}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1162, file: !1160, line: 132, baseType: !1195, size: 64, offset: 576)
!1195 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1160, line: 78, baseType: !1179)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1162, file: !1160, line: 135, baseType: !572, size: 64, offset: 640)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1162, file: !1160, line: 136, baseType: !1198, size: 64, offset: 704)
!1198 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1160, line: 82, baseType: !1199)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64)
!1200 = !DISubroutineType(types: !1201)
!1201 = !{!572, !572, !1024, !1024}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1162, file: !1160, line: 137, baseType: !1203, size: 64, offset: 768)
!1203 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1160, line: 83, baseType: !1204)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64)
!1205 = !DISubroutineType(types: !1206)
!1206 = !{null, !572, !572}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1162, file: !1160, line: 141, baseType: !7, size: 32, offset: 832)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1156, file: !781, line: 48, baseType: !1209, size: 64, offset: 64)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !483, line: 35, baseType: !1211)
!1211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !483, line: 35, size: 128, elements: !1212)
!1212 = !{!1213}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1211, file: !483, line: 35, baseType: !1214, size: 128)
!1214 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !483, line: 33, baseType: !1215)
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !483, line: 33, size: 128, elements: !1216)
!1216 = !{!1217, !1218, !1219}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1215, file: !483, line: 33, baseType: !7, size: 32)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1215, file: !483, line: 33, baseType: !7, size: 32, offset: 32)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1215, file: !483, line: 33, baseType: !1220, size: 64, offset: 64)
!1220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !878, size: 64, elements: !666)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1156, file: !781, line: 51, baseType: !1222, size: 64, offset: 128)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64)
!1223 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !6, line: 183, baseType: !1224)
!1224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !6, line: 183, size: 128, elements: !1225)
!1225 = !{!1226}
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1224, file: !6, line: 183, baseType: !1227, size: 128)
!1227 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !6, line: 182, baseType: !1228)
!1228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !6, line: 182, size: 128, elements: !1229)
!1229 = !{!1230, !1231, !1232}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1228, file: !6, line: 182, baseType: !7, size: 32)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1228, file: !6, line: 182, baseType: !7, size: 32, offset: 32)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1228, file: !6, line: 182, baseType: !932, size: 64, offset: 64)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1156, file: !781, line: 54, baseType: !583, size: 64, offset: 192)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1156, file: !781, line: 57, baseType: !1235, size: 128, offset: 256)
!1235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1236, line: 31, size: 128, elements: !1237)
!1236 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1237 = !{!1238, !1239, !1240, !1241, !1242, !1243, !1244}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1235, file: !1236, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1235, file: !1236, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1235, file: !1236, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1235, file: !1236, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1235, file: !1236, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1235, file: !1236, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1235, file: !1236, line: 56, baseType: !1245, size: 64, offset: 64)
!1245 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !584, line: 47, baseType: !1246)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1248, line: 75, size: 256, elements: !1249)
!1248 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1249 = !{!1250, !1262, !1263, !1264}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1247, file: !1248, line: 76, baseType: !1251, size: 64)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64)
!1252 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1248, line: 68, baseType: !1253)
!1253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1248, line: 63, size: 320, elements: !1254)
!1254 = !{!1255, !1257, !1258, !1259}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1253, file: !1248, line: 64, baseType: !1256, size: 64)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1253, file: !1248, line: 65, baseType: !1256, size: 64, offset: 64)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1253, file: !1248, line: 66, baseType: !7, size: 32, offset: 128)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1253, file: !1248, line: 67, baseType: !1260, size: 128, offset: 192)
!1260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1261, size: 128, elements: !1100)
!1261 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1248, line: 29, baseType: !637)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1247, file: !1248, line: 77, baseType: !1251, size: 64, offset: 64)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1247, file: !1248, line: 78, baseType: !7, size: 32, offset: 128)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1247, file: !1248, line: 79, baseType: !1265, size: 64, offset: 192)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64)
!1266 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1248, line: 49, baseType: !1267)
!1267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1248, line: 45, size: 832, elements: !1268)
!1268 = !{!1269, !1270, !1271}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1267, file: !1248, line: 46, baseType: !1256, size: 64)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1267, file: !1248, line: 47, baseType: !1246, size: 64, offset: 64)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1267, file: !1248, line: 48, baseType: !1272, size: 704, offset: 128)
!1272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1273, line: 164, size: 704, elements: !1274)
!1273 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1274 = !{!1275, !1276, !1286, !1287, !1288, !1289, !1290, !1291, !1295, !1299, !1300, !1301, !1302}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1272, file: !1273, line: 166, baseType: !639, size: 64)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1272, file: !1273, line: 167, baseType: !1277, size: 64, offset: 64)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64)
!1278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1273, line: 157, size: 192, elements: !1279)
!1279 = !{!1280, !1281, !1282}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1278, file: !1273, line: 159, baseType: !570, size: 64)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1278, file: !1273, line: 160, baseType: !1277, size: 64, offset: 64)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1278, file: !1273, line: 161, baseType: !1283, size: 32, offset: 128)
!1283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !571, size: 32, elements: !1284)
!1284 = !{!1285}
!1285 = !DISubrange(count: 4)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1272, file: !1273, line: 168, baseType: !570, size: 64, offset: 128)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1272, file: !1273, line: 169, baseType: !570, size: 64, offset: 192)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1272, file: !1273, line: 170, baseType: !570, size: 64, offset: 256)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1272, file: !1273, line: 171, baseType: !639, size: 64, offset: 320)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1272, file: !1273, line: 172, baseType: !568, size: 32, offset: 384)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1272, file: !1273, line: 176, baseType: !1292, size: 64, offset: 448)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64)
!1293 = !DISubroutineType(types: !1294)
!1294 = !{!1277, !572, !639}
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1272, file: !1273, line: 177, baseType: !1296, size: 64, offset: 512)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64)
!1297 = !DISubroutineType(types: !1298)
!1298 = !{null, !572, !1277}
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1272, file: !1273, line: 178, baseType: !572, size: 64, offset: 576)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1272, file: !1273, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1272, file: !1273, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1272, file: !1273, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !1156, file: !781, line: 60, baseType: !1235, size: 128, offset: 384)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !1156, file: !781, line: 64, baseType: !1305, size: 64, offset: 512)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64)
!1306 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1307, line: 33, flags: DIFlagFwdDecl)
!1307 = !DIFile(filename: "./pointer-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !1156, file: !781, line: 67, baseType: !583, size: 64, offset: 576)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !1156, file: !781, line: 73, baseType: !1159, size: 64, offset: 640)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !1156, file: !781, line: 77, baseType: !1245, size: 64, offset: 704)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !1156, file: !781, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !1156, file: !781, line: 82, baseType: !1313, size: 320, offset: 832)
!1313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !909, line: 62, size: 320, elements: !1314)
!1314 = !{!1315, !1321, !1322, !1323, !1324, !1325}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1313, file: !909, line: 63, baseType: !1316, size: 64)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64)
!1317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !909, line: 56, size: 128, elements: !1318)
!1318 = !{!1319, !1320}
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1317, file: !909, line: 57, baseType: !1316, size: 64)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1317, file: !909, line: 58, baseType: !665, size: 8, offset: 64)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1313, file: !909, line: 64, baseType: !7, size: 32, offset: 64)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1313, file: !909, line: 66, baseType: !7, size: 32, offset: 96)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1313, file: !909, line: 68, baseType: !567, size: 8, offset: 128)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1313, file: !909, line: 70, baseType: !907, size: 64, offset: 192)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1313, file: !909, line: 71, baseType: !915, size: 64, offset: 256)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !830, file: !831, line: 476, baseType: !1327, size: 64, offset: 256)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64)
!1328 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !831, line: 476, flags: DIFlagFwdDecl)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !830, file: !831, line: 479, baseType: !1159, size: 64, offset: 320)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !830, file: !831, line: 484, baseType: !583, size: 64, offset: 384)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !830, file: !831, line: 488, baseType: !583, size: 64, offset: 448)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !830, file: !831, line: 493, baseType: !583, size: 64, offset: 512)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !830, file: !831, line: 496, baseType: !583, size: 64, offset: 576)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !830, file: !831, line: 501, baseType: !1335, size: 64, offset: 640)
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1336, size: 64)
!1336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !213, line: 2355, size: 576, elements: !1337)
!1337 = !{!1338, !1341, !1342, !1343, !1344, !1346, !1347, !1352, !1353, !1354, !1355, !1356, !1357}
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1336, file: !213, line: 2356, baseType: !1339, size: 64)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64)
!1340 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !213, line: 2356, flags: DIFlagFwdDecl)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1336, file: !213, line: 2357, baseType: !573, size: 64, offset: 64)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1336, file: !213, line: 2358, baseType: !568, size: 32, offset: 128)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1336, file: !213, line: 2359, baseType: !568, size: 32, offset: 160)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1336, file: !213, line: 2360, baseType: !1345, size: 128, offset: 192)
!1345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !568, size: 128, elements: !1284)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1336, file: !213, line: 2364, baseType: !568, size: 32, offset: 320)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1336, file: !213, line: 2367, baseType: !1348, size: 128, offset: 384)
!1348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !213, line: 2349, size: 128, elements: !1349)
!1349 = !{!1350, !1351}
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1348, file: !213, line: 2351, baseType: !742, size: 64)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1348, file: !213, line: 2352, baseType: !639, size: 64, offset: 64)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1336, file: !213, line: 2371, baseType: !212, size: 32, offset: 512)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1336, file: !213, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1336, file: !213, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1336, file: !213, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1336, file: !213, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1336, file: !213, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !830, file: !831, line: 504, baseType: !1359, size: 64, offset: 704)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64)
!1360 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !831, line: 504, flags: DIFlagFwdDecl)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !830, file: !831, line: 507, baseType: !1159, size: 64, offset: 768)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !830, file: !831, line: 510, baseType: !568, size: 32, offset: 832)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !830, file: !831, line: 513, baseType: !568, size: 32, offset: 864)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !830, file: !831, line: 516, baseType: !692, size: 32, offset: 896)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !830, file: !831, line: 519, baseType: !692, size: 32, offset: 928)
