; ModuleID = 'ipa.bc'
source_filename = "ipa.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.cgraph_node = type { %union.tree_node*, %struct.cgraph_edge*, %struct.cgraph_edge*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.htab*, i8*, %struct.VEC_ipa_opt_pass_heap*, %struct.cgraph_local_info, %struct.cgraph_global_info, %struct.cgraph_rtl_info, %struct.cgraph_clone_info, %struct.cgraph_thunk_info, i64, i32, i32, i32, i16 }
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }

!410 = !DIEnumerator(name: "TV_LOOP_UNROLL", value: 128, isUnsigned: true)
!411 = !DIEnumerator(name: "TV_LOOP_DOLOOP", value: 129, isUnsigned: true)
!412 = !DIEnumerator(name: "TV_CPROP", value: 130, isUnsigned: true)
!413 = !DIEnumerator(name: "TV_PRE", value: 131, isUnsigned: true)
!414 = !DIEnumerator(name: "TV_HOIST", value: 132, isUnsigned: true)
!415 = !DIEnumerator(name: "TV_LSM", value: 133, isUnsigned: true)
!416 = !DIEnumerator(name: "TV_TRACER", value: 134, isUnsigned: true)
!417 = !DIEnumerator(name: "TV_WEB", value: 135, isUnsigned: true)
!418 = !DIEnumerator(name: "TV_AUTO_INC_DEC", value: 136, isUnsigned: true)
!419 = !DIEnumerator(name: "TV_CSE2", value: 137, isUnsigned: true)
!420 = !DIEnumerator(name: "TV_BRANCH_PROB", value: 138, isUnsigned: true)
!421 = !DIEnumerator(name: "TV_VPT", value: 139, isUnsigned: true)
!422 = !DIEnumerator(name: "TV_COMBINE", value: 140, isUnsigned: true)
!423 = !DIEnumerator(name: "TV_IFCVT", value: 141, isUnsigned: true)
!424 = !DIEnumerator(name: "TV_REGMOVE", value: 142, isUnsigned: true)
!425 = !DIEnumerator(name: "TV_MODE_SWITCH", value: 143, isUnsigned: true)
!426 = !DIEnumerator(name: "TV_SMS", value: 144, isUnsigned: true)
!427 = !DIEnumerator(name: "TV_SCHED", value: 145, isUnsigned: true)
!428 = !DIEnumerator(name: "TV_LOCAL_ALLOC", value: 146, isUnsigned: true)
!429 = !DIEnumerator(name: "TV_GLOBAL_ALLOC", value: 147, isUnsigned: true)
!430 = !DIEnumerator(name: "TV_IRA", value: 148, isUnsigned: true)
!431 = !DIEnumerator(name: "TV_RELOAD", value: 149, isUnsigned: true)
!432 = !DIEnumerator(name: "TV_RELOAD_CSE_REGS", value: 150, isUnsigned: true)
!433 = !DIEnumerator(name: "TV_SEQABSTR", value: 151, isUnsigned: true)
!434 = !DIEnumerator(name: "TV_GCSE_AFTER_RELOAD", value: 152, isUnsigned: true)
!435 = !DIEnumerator(name: "TV_THREAD_PROLOGUE_AND_EPILOGUE", value: 153, isUnsigned: true)
!436 = !DIEnumerator(name: "TV_IFCVT2", value: 154, isUnsigned: true)
!437 = !DIEnumerator(name: "TV_COMBINE_STACK_ADJUST", value: 155, isUnsigned: true)
!438 = !DIEnumerator(name: "TV_PEEPHOLE2", value: 156, isUnsigned: true)
!439 = !DIEnumerator(name: "TV_RENAME_REGISTERS", value: 157, isUnsigned: true)
!440 = !DIEnumerator(name: "TV_CPROP_REGISTERS", value: 158, isUnsigned: true)
!441 = !DIEnumerator(name: "TV_SCHED2", value: 159, isUnsigned: true)
!442 = !DIEnumerator(name: "TV_MACH_DEP", value: 160, isUnsigned: true)
!443 = !DIEnumerator(name: "TV_DBR_SCHED", value: 161, isUnsigned: true)
!444 = !DIEnumerator(name: "TV_REORDER_BLOCKS", value: 162, isUnsigned: true)
!445 = !DIEnumerator(name: "TV_SHORTEN_BRANCH", value: 163, isUnsigned: true)
!446 = !DIEnumerator(name: "TV_REG_STACK", value: 164, isUnsigned: true)
!447 = !DIEnumerator(name: "TV_FINAL", value: 165, isUnsigned: true)
!448 = !DIEnumerator(name: "TV_SYMOUT", value: 166, isUnsigned: true)
!449 = !DIEnumerator(name: "TV_VAR_TRACKING", value: 167, isUnsigned: true)
!450 = !DIEnumerator(name: "TV_TREE_IFCOMBINE", value: 168, isUnsigned: true)
!451 = !DIEnumerator(name: "TV_PLUGIN_INIT", value: 169, isUnsigned: true)
!452 = !DIEnumerator(name: "TV_PLUGIN_RUN", value: 170, isUnsigned: true)
!453 = !DIEnumerator(name: "TV_REST_OF_COMPILATION", value: 171, isUnsigned: true)
!454 = !DIEnumerator(name: "TIMEVAR_LAST", value: 172, isUnsigned: true)
!455 = !{!456, !457, !458, !459, !462, !463, !465, !1528, !466, !1614, !1808, !1809, !7, !1814, !1619}
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!458 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !461)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cgraph_node", file: !250, line: 181, size: 2496, elements: !468)
!468 = !{!469, !1527, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1667, !1689, !1699, !1703, !1785, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !467, file: !250, line: 182, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !471, line: 56, baseType: !472)
!471 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !6, line: 3371, size: 1792, elements: !474)
!474 = !{!475, !508, !514, !527, !534, !541, !546, !555, !561, !574, !586, !624, !632, !660, !668, !669, !674, !683, !689, !694, !698, !702, !1167, !1216, !1222, !1228, !1235, !1246, !1271, !1288, !1300, !1322, !1337, !1509}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !473, file: !6, line: 3372, baseType: !476, size: 64)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !6, line: 360, size: 64, elements: !477)
!477 = !{!478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !476, file: !6, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !476, file: !6, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !476, file: !6, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !476, file: !6, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !476, file: !6, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !476, file: !6, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !476, file: !6, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !476, file: !6, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !476, file: !6, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !476, file: !6, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !476, file: !6, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !476, file: !6, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !476, file: !6, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !476, file: !6, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !476, file: !6, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !476, file: !6, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !476, file: !6, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !476, file: !6, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !476, file: !6, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !476, file: !6, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !476, file: !6, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !476, file: !6, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !476, file: !6, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !476, file: !6, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !476, file: !6, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !476, file: !6, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !476, file: !6, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !476, file: !6, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !476, file: !6, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !476, file: !6, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !473, file: !6, line: 3373, baseType: !509, size: 192)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !6, line: 402, size: 192, elements: !510)
!510 = !{!511, !512, !513}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !509, file: !6, line: 403, baseType: !476, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !509, file: !6, line: 404, baseType: !470, size: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !509, file: !6, line: 405, baseType: !470, size: 64, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !473, file: !6, line: 3374, baseType: !515, size: 320)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !6, line: 1384, size: 320, elements: !516)
!516 = !{!517, !518}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !515, file: !6, line: 1385, baseType: !509, size: 192)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !515, file: !6, line: 1386, baseType: !519, size: 128, offset: 192)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !520, line: 58, baseType: !521)
!520 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !520, line: 54, size: 128, elements: !522)
!522 = !{!523, !525}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !521, file: !520, line: 56, baseType: !524, size: 64)
!524 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !521, file: !520, line: 57, baseType: !526, size: 64, offset: 64)
!526 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !473, file: !6, line: 3375, baseType: !528, size: 256)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !6, line: 1397, size: 256, elements: !529)
!529 = !{!530, !531}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !528, file: !6, line: 1398, baseType: !509, size: 192)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !528, file: !6, line: 1399, baseType: !532, size: 64, offset: 192)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !6, line: 1392, flags: DIFlagFwdDecl)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !473, file: !6, line: 3376, baseType: !535, size: 256)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !6, line: 1408, size: 256, elements: !536)
!536 = !{!537, !538}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !535, file: !6, line: 1409, baseType: !509, size: 192)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !535, file: !6, line: 1410, baseType: !539, size: 64, offset: 192)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !6, line: 1403, flags: DIFlagFwdDecl)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !473, file: !6, line: 3377, baseType: !542, size: 256)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !6, line: 1437, size: 256, elements: !543)
!543 = !{!544, !545}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !542, file: !6, line: 1438, baseType: !509, size: 192)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !542, file: !6, line: 1439, baseType: !470, size: 64, offset: 192)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !473, file: !6, line: 3378, baseType: !547, size: 256)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !6, line: 1418, size: 256, elements: !548)
!548 = !{!549, !550, !551}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !547, file: !6, line: 1419, baseType: !509, size: 192)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !547, file: !6, line: 1420, baseType: !458, size: 32, offset: 192)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !547, file: !6, line: 1421, baseType: !552, size: 8, offset: 224)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !461, size: 8, elements: !553)
!553 = !{!554}
!554 = !DISubrange(count: 1)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !473, file: !6, line: 3379, baseType: !556, size: 320)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !6, line: 1428, size: 320, elements: !557)
!557 = !{!558, !559, !560}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !556, file: !6, line: 1429, baseType: !509, size: 192)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !556, file: !6, line: 1430, baseType: !470, size: 64, offset: 192)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !556, file: !6, line: 1431, baseType: !470, size: 64, offset: 256)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !473, file: !6, line: 3380, baseType: !562, size: 320)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !6, line: 1460, size: 320, elements: !563)
!563 = !{!564, !565}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !562, file: !6, line: 1461, baseType: !509, size: 192)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !562, file: !6, line: 1462, baseType: !566, size: 128, offset: 192)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !567, line: 31, size: 128, elements: !568)
!567 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!568 = !{!569, !572, !573}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !566, file: !567, line: 32, baseType: !570, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !457)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !566, file: !567, line: 33, baseType: !7, size: 32, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !566, file: !567, line: 34, baseType: !7, size: 32, offset: 96)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !473, file: !6, line: 3381, baseType: !575, size: 384)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !6, line: 2507, size: 384, elements: !576)
!576 = !{!577, !578, !583, !584, !585}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !575, file: !6, line: 2508, baseType: !509, size: 192)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !575, file: !6, line: 2509, baseType: !579, size: 32, offset: 192)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !580, line: 58, baseType: !581)
!580 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !582, line: 44, baseType: !7)
!582 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!583 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !575, file: !6, line: 2510, baseType: !7, size: 32, offset: 224)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !575, file: !6, line: 2511, baseType: !470, size: 64, offset: 256)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !575, file: !6, line: 2512, baseType: !470, size: 64, offset: 320)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !473, file: !6, line: 3382, baseType: !587, size: 896)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !6, line: 2652, size: 896, elements: !588)
!588 = !{!589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !587, file: !6, line: 2653, baseType: !575, size: 384)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !587, file: !6, line: 2654, baseType: !470, size: 64, offset: 384)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !587, file: !6, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !587, file: !6, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !587, file: !6, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !587, file: !6, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !587, file: !6, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !587, file: !6, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !587, file: !6, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !587, file: !6, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !587, file: !6, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !587, file: !6, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !587, file: !6, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !587, file: !6, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !587, file: !6, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !587, file: !6, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !587, file: !6, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !587, file: !6, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !587, file: !6, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !587, file: !6, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !587, file: !6, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !587, file: !6, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !587, file: !6, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !587, file: !6, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !587, file: !6, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !587, file: !6, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !587, file: !6, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !587, file: !6, line: 2703, baseType: !7, size: 32, offset: 512)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !587, file: !6, line: 2705, baseType: !470, size: 64, offset: 576)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !587, file: !6, line: 2706, baseType: !470, size: 64, offset: 640)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !587, file: !6, line: 2707, baseType: !470, size: 64, offset: 704)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !587, file: !6, line: 2708, baseType: !470, size: 64, offset: 768)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !587, file: !6, line: 2711, baseType: !622, size: 64, offset: 832)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !6, line: 2711, flags: DIFlagFwdDecl)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !473, file: !6, line: 3383, baseType: !625, size: 960)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !6, line: 2756, size: 960, elements: !626)
!626 = !{!627, !628}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !625, file: !6, line: 2757, baseType: !587, size: 896)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !625, file: !6, line: 2758, baseType: !629, size: 64, offset: 896)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !471, line: 50, baseType: !630)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !471, line: 49, flags: DIFlagFwdDecl)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !473, file: !6, line: 3384, baseType: !633, size: 1472)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !6, line: 3114, size: 1472, elements: !634)
!634 = !{!635, !656, !657, !658, !659}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !633, file: !6, line: 3115, baseType: !636, size: 1216)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !6, line: 2984, size: 1216, elements: !637)
!637 = !{!638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !636, file: !6, line: 2985, baseType: !625, size: 960)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !636, file: !6, line: 2986, baseType: !470, size: 64, offset: 960)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !636, file: !6, line: 2987, baseType: !470, size: 64, offset: 1024)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !636, file: !6, line: 2988, baseType: !470, size: 64, offset: 1088)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !636, file: !6, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !636, file: !6, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !636, file: !6, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !636, file: !6, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !636, file: !6, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !636, file: !6, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !636, file: !6, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !636, file: !6, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !636, file: !6, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !636, file: !6, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !636, file: !6, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !636, file: !6, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !636, file: !6, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !636, file: !6, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !633, file: !6, line: 3117, baseType: !470, size: 64, offset: 1216)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !633, file: !6, line: 3119, baseType: !470, size: 64, offset: 1280)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !633, file: !6, line: 3121, baseType: !470, size: 64, offset: 1344)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !633, file: !6, line: 3123, baseType: !470, size: 64, offset: 1408)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !473, file: !6, line: 3385, baseType: !661, size: 1088)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !6, line: 2874, size: 1088, elements: !662)
!662 = !{!663, !664, !665}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !661, file: !6, line: 2875, baseType: !625, size: 960)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !661, file: !6, line: 2876, baseType: !629, size: 64, offset: 960)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !661, file: !6, line: 2877, baseType: !666, size: 64, offset: 1024)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !6, line: 2856, flags: DIFlagFwdDecl)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !473, file: !6, line: 3386, baseType: !636, size: 1216)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !473, file: !6, line: 3387, baseType: !670, size: 1280)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !6, line: 3093, size: 1280, elements: !671)
!671 = !{!672, !673}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !670, file: !6, line: 3094, baseType: !636, size: 1216)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !670, file: !6, line: 3095, baseType: !666, size: 64, offset: 1216)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !473, file: !6, line: 3388, baseType: !675, size: 1216)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !6, line: 2824, size: 1216, elements: !676)
!676 = !{!677, !678, !679, !680, !681, !682}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !675, file: !6, line: 2825, baseType: !587, size: 896)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !675, file: !6, line: 2827, baseType: !470, size: 64, offset: 896)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !675, file: !6, line: 2828, baseType: !470, size: 64, offset: 960)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !675, file: !6, line: 2829, baseType: !470, size: 64, offset: 1024)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !675, file: !6, line: 2830, baseType: !470, size: 64, offset: 1088)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !675, file: !6, line: 2831, baseType: !470, size: 64, offset: 1152)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !473, file: !6, line: 3389, baseType: !684, size: 1024)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !6, line: 2850, size: 1024, elements: !685)
!685 = !{!686, !687, !688}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !684, file: !6, line: 2851, baseType: !625, size: 960)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !684, file: !6, line: 2852, baseType: !458, size: 32, offset: 960)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !684, file: !6, line: 2853, baseType: !458, size: 32, offset: 992)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !473, file: !6, line: 3390, baseType: !690, size: 1024)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !6, line: 2857, size: 1024, elements: !691)
!691 = !{!692, !693}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !690, file: !6, line: 2858, baseType: !625, size: 960)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !690, file: !6, line: 2859, baseType: !666, size: 64, offset: 960)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !473, file: !6, line: 3391, baseType: !695, size: 960)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !6, line: 2862, size: 960, elements: !696)
!696 = !{!697}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !695, file: !6, line: 2863, baseType: !625, size: 960)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !473, file: !6, line: 3392, baseType: !699, size: 1472)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !6, line: 3304, size: 1472, elements: !700)
!700 = !{!701}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !699, file: !6, line: 3305, baseType: !633, size: 1472)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !473, file: !6, line: 3393, baseType: !703, size: 1792)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !6, line: 3248, size: 1792, elements: !704)
!704 = !{!705, !706, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !703, file: !6, line: 3249, baseType: !633, size: 1472)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !703, file: !6, line: 3251, baseType: !707, size: 64, offset: 1472)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !709, line: 463, size: 1152, elements: !710)
!709 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!710 = !{!711, !714, !1032, !1033, !1036, !1039, !1089, !1090, !1091, !1092, !1093, !1119, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !708, file: !709, line: 464, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !709, line: 464, flags: DIFlagFwdDecl)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !708, file: !709, line: 467, baseType: !715, size: 64, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !202, line: 374, size: 640, elements: !717)
!717 = !{!718, !1007, !1008, !1021, !1022, !1023, !1024, !1025, !1026, !1028, !1030, !1031}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !716, file: !202, line: 377, baseType: !719, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !471, line: 111, baseType: !720)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !202, line: 217, size: 832, elements: !722)
!722 = !{!723, !970, !971, !972, !975, !981, !982, !983, !1001, !1002, !1003, !1004, !1005, !1006}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !721, file: !202, line: 219, baseType: !724, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !202, line: 151, baseType: !726)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !202, line: 151, size: 128, elements: !727)
!727 = !{!728}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !726, file: !202, line: 151, baseType: !729, size: 128)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !202, line: 150, baseType: !730)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !202, line: 150, size: 128, elements: !731)
!731 = !{!732, !733, !734}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !730, file: !202, line: 150, baseType: !7, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !730, file: !202, line: 150, baseType: !7, size: 32, offset: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !730, file: !202, line: 150, baseType: !735, size: 64, offset: 64)
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !736, size: 64, elements: !553)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !471, line: 108, baseType: !737)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !202, line: 122, size: 512, elements: !739)
!739 = !{!740, !741, !742, !962, !963, !964, !965, !966, !967, !968}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !738, file: !202, line: 124, baseType: !720, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !738, file: !202, line: 125, baseType: !720, size: 64, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !738, file: !202, line: 131, baseType: !743, size: 64, offset: 128)
!743 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !202, line: 128, size: 64, elements: !744)
!744 = !{!745, !961}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !743, file: !202, line: 129, baseType: !746, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !471, line: 66, baseType: !747)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !749, line: 143, size: 192, elements: !750)
!749 = !DIFile(filename: "./gimple.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!750 = !{!751, !959, !960}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !748, file: !749, line: 145, baseType: !752, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !471, line: 69, baseType: !753)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !749, line: 136, size: 192, elements: !755)
!755 = !{!756, !957, !958}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !754, file: !749, line: 137, baseType: !757, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !471, line: 58, baseType: !758)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !749, line: 737, size: 768, elements: !760)
!760 = !{!761, !778, !812, !818, !823, !828, !835, !841, !847, !852, !866, !871, !877, !882, !892, !897, !915, !922, !929, !935, !940, !946, !952}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !759, file: !749, line: 738, baseType: !762, size: 256)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !749, line: 271, size: 256, elements: !763)
!763 = !{!764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !762, file: !749, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !762, file: !749, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !762, file: !749, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !762, file: !749, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !762, file: !749, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !762, file: !749, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !762, file: !749, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !762, file: !749, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !762, file: !749, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !762, file: !749, line: 312, baseType: !7, size: 32, offset: 32)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !762, file: !749, line: 316, baseType: !579, size: 32, offset: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !762, file: !749, line: 319, baseType: !7, size: 32, offset: 96)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !762, file: !749, line: 323, baseType: !720, size: 64, offset: 128)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !762, file: !749, line: 327, baseType: !470, size: 64, offset: 192)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !759, file: !749, line: 739, baseType: !779, size: 448)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !749, line: 350, size: 448, elements: !780)
!780 = !{!781, !810}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !779, file: !749, line: 353, baseType: !782, size: 384)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !749, line: 333, size: 384, elements: !783)
!783 = !{!784, !785, !793}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !782, file: !749, line: 336, baseType: !762, size: 256)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !782, file: !749, line: 343, baseType: !786, size: 64, offset: 256)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !788, line: 37, size: 128, elements: !789)
!788 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!789 = !{!790, !791}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !787, file: !788, line: 39, baseType: !786, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !787, file: !788, line: 40, baseType: !792, size: 64, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !782, file: !749, line: 344, baseType: !794, size: 64, offset: 320)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !788, line: 45, size: 320, elements: !796)
!796 = !{!797, !798}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !795, file: !788, line: 47, baseType: !794, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !795, file: !788, line: 48, baseType: !799, size: 256, offset: 64)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !6, line: 1883, size: 256, elements: !800)
!800 = !{!801, !803, !804, !809}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !799, file: !6, line: 1884, baseType: !802, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !799, file: !6, line: 1885, baseType: !802, size: 64, offset: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !799, file: !6, line: 1891, baseType: !805, size: 64, offset: 128)
!805 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !799, file: !6, line: 1891, size: 64, elements: !806)
!806 = !{!807, !808}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !805, file: !6, line: 1891, baseType: !757, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !805, file: !6, line: 1891, baseType: !470, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !799, file: !6, line: 1892, baseType: !792, size: 64, offset: 192)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !779, file: !749, line: 359, baseType: !811, size: 64, offset: 384)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !470, size: 64, elements: !553)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !759, file: !749, line: 740, baseType: !813, size: 512)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !749, line: 365, size: 512, elements: !814)
!814 = !{!815, !816, !817}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !813, file: !749, line: 368, baseType: !782, size: 384)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !813, file: !749, line: 373, baseType: !470, size: 64, offset: 384)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !813, file: !749, line: 374, baseType: !470, size: 64, offset: 448)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !759, file: !749, line: 741, baseType: !819, size: 576)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !749, line: 380, size: 576, elements: !820)
!820 = !{!821, !822}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !819, file: !749, line: 383, baseType: !813, size: 512)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !819, file: !749, line: 389, baseType: !811, size: 64, offset: 512)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !759, file: !749, line: 742, baseType: !824, size: 320)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !749, line: 395, size: 320, elements: !825)
!825 = !{!826, !827}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !824, file: !749, line: 397, baseType: !762, size: 256)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !824, file: !749, line: 400, baseType: !746, size: 64, offset: 256)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !759, file: !749, line: 743, baseType: !829, size: 448)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !749, line: 406, size: 448, elements: !830)
!830 = !{!831, !832, !833, !834}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !829, file: !749, line: 408, baseType: !762, size: 256)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !829, file: !749, line: 412, baseType: !470, size: 64, offset: 256)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !829, file: !749, line: 420, baseType: !470, size: 64, offset: 320)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !829, file: !749, line: 423, baseType: !746, size: 64, offset: 384)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !759, file: !749, line: 744, baseType: !836, size: 384)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !749, line: 429, size: 384, elements: !837)
!837 = !{!838, !839, !840}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !836, file: !749, line: 431, baseType: !762, size: 256)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !836, file: !749, line: 434, baseType: !470, size: 64, offset: 256)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !836, file: !749, line: 437, baseType: !746, size: 64, offset: 320)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !759, file: !749, line: 745, baseType: !842, size: 384)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !749, line: 443, size: 384, elements: !843)
!843 = !{!844, !845, !846}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !842, file: !749, line: 445, baseType: !762, size: 256)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !842, file: !749, line: 449, baseType: !470, size: 64, offset: 256)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !842, file: !749, line: 453, baseType: !746, size: 64, offset: 320)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !759, file: !749, line: 746, baseType: !848, size: 320)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !749, line: 459, size: 320, elements: !849)
!849 = !{!850, !851}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !848, file: !749, line: 461, baseType: !762, size: 256)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !848, file: !749, line: 464, baseType: !470, size: 64, offset: 256)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !759, file: !749, line: 747, baseType: !853, size: 768)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !749, line: 469, size: 768, elements: !854)
!854 = !{!855, !856, !857, !858, !859}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !853, file: !749, line: 471, baseType: !762, size: 256)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !853, file: !749, line: 474, baseType: !7, size: 32, offset: 256)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !853, file: !749, line: 475, baseType: !7, size: 32, offset: 288)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !853, file: !749, line: 478, baseType: !470, size: 64, offset: 320)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !853, file: !749, line: 481, baseType: !860, size: 384, offset: 384)
!860 = !DICompositeType(tag: DW_TAG_array_type, baseType: !861, size: 384, elements: !553)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !6, line: 1917, size: 384, elements: !862)
!862 = !{!863, !864, !865}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !861, file: !6, line: 1920, baseType: !799, size: 256)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !861, file: !6, line: 1921, baseType: !470, size: 64, offset: 256)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !861, file: !6, line: 1922, baseType: !579, size: 32, offset: 320)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !759, file: !749, line: 748, baseType: !867, size: 320)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !749, line: 487, size: 320, elements: !868)
!868 = !{!869, !870}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !867, file: !749, line: 490, baseType: !762, size: 256)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !867, file: !749, line: 494, baseType: !458, size: 32, offset: 256)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !759, file: !749, line: 749, baseType: !872, size: 384)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !749, line: 500, size: 384, elements: !873)
!873 = !{!874, !875, !876}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !872, file: !749, line: 502, baseType: !762, size: 256)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !872, file: !749, line: 506, baseType: !746, size: 64, offset: 256)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !872, file: !749, line: 510, baseType: !746, size: 64, offset: 320)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !759, file: !749, line: 750, baseType: !878, size: 320)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !749, line: 529, size: 320, elements: !879)
!879 = !{!880, !881}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !878, file: !749, line: 531, baseType: !762, size: 256)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !878, file: !749, line: 540, baseType: !746, size: 64, offset: 256)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !759, file: !749, line: 751, baseType: !883, size: 704)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !749, line: 546, size: 704, elements: !884)
!884 = !{!885, !886, !887, !888, !889, !890, !891}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !883, file: !749, line: 549, baseType: !813, size: 512)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !883, file: !749, line: 553, baseType: !463, size: 64, offset: 512)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !883, file: !749, line: 557, baseType: !457, size: 8, offset: 576)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !883, file: !749, line: 558, baseType: !457, size: 8, offset: 584)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !883, file: !749, line: 559, baseType: !457, size: 8, offset: 592)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !883, file: !749, line: 560, baseType: !457, size: 8, offset: 600)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !883, file: !749, line: 566, baseType: !811, size: 64, offset: 640)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !759, file: !749, line: 752, baseType: !893, size: 384)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !749, line: 571, size: 384, elements: !894)
!894 = !{!895, !896}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !893, file: !749, line: 573, baseType: !824, size: 320)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !893, file: !749, line: 577, baseType: !470, size: 64, offset: 320)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !759, file: !749, line: 753, baseType: !898, size: 576)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !749, line: 600, size: 576, elements: !899)
!899 = !{!900, !901, !902, !905, !914}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !898, file: !749, line: 602, baseType: !824, size: 320)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !898, file: !749, line: 605, baseType: !470, size: 64, offset: 320)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !898, file: !749, line: 609, baseType: !903, size: 64, offset: 384)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !904, line: 46, baseType: !524)
!904 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!905 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !898, file: !749, line: 612, baseType: !906, size: 64, offset: 448)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !749, line: 581, size: 320, elements: !908)
!908 = !{!909, !910, !911, !912, !913}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !907, file: !749, line: 583, baseType: !5, size: 32)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !907, file: !749, line: 586, baseType: !470, size: 64, offset: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !907, file: !749, line: 589, baseType: !470, size: 64, offset: 128)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !907, file: !749, line: 592, baseType: !470, size: 64, offset: 192)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !907, file: !749, line: 595, baseType: !470, size: 64, offset: 256)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !898, file: !749, line: 616, baseType: !746, size: 64, offset: 512)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !759, file: !749, line: 754, baseType: !916, size: 512)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !749, line: 622, size: 512, elements: !917)
!917 = !{!918, !919, !920, !921}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !916, file: !749, line: 624, baseType: !824, size: 320)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !916, file: !749, line: 628, baseType: !470, size: 64, offset: 320)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !916, file: !749, line: 632, baseType: !470, size: 64, offset: 384)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !916, file: !749, line: 636, baseType: !470, size: 64, offset: 448)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !759, file: !749, line: 755, baseType: !923, size: 704)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !749, line: 642, size: 704, elements: !924)
!924 = !{!925, !926, !927, !928}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !923, file: !749, line: 644, baseType: !916, size: 512)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !923, file: !749, line: 648, baseType: !470, size: 64, offset: 512)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !923, file: !749, line: 652, baseType: !470, size: 64, offset: 576)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !923, file: !749, line: 653, baseType: !470, size: 64, offset: 640)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !759, file: !749, line: 756, baseType: !930, size: 448)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !749, line: 663, size: 448, elements: !931)
!931 = !{!932, !933, !934}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !930, file: !749, line: 665, baseType: !824, size: 320)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !930, file: !749, line: 668, baseType: !470, size: 64, offset: 320)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !930, file: !749, line: 673, baseType: !470, size: 64, offset: 384)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !759, file: !749, line: 757, baseType: !936, size: 384)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !749, line: 694, size: 384, elements: !937)
!937 = !{!938, !939}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !936, file: !749, line: 696, baseType: !824, size: 320)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !936, file: !749, line: 699, baseType: !470, size: 64, offset: 320)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !759, file: !749, line: 758, baseType: !941, size: 384)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !749, line: 681, size: 384, elements: !942)
!942 = !{!943, !944, !945}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !941, file: !749, line: 683, baseType: !762, size: 256)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !941, file: !749, line: 686, baseType: !470, size: 64, offset: 256)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !941, file: !749, line: 689, baseType: !470, size: 64, offset: 320)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !759, file: !749, line: 759, baseType: !947, size: 384)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !749, line: 707, size: 384, elements: !948)
!948 = !{!949, !950, !951}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !947, file: !749, line: 709, baseType: !762, size: 256)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !947, file: !749, line: 712, baseType: !470, size: 64, offset: 256)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !947, file: !749, line: 712, baseType: !470, size: 64, offset: 320)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !759, file: !749, line: 760, baseType: !953, size: 320)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !749, line: 718, size: 320, elements: !954)
!954 = !{!955, !956}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !953, file: !749, line: 720, baseType: !762, size: 256)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !953, file: !749, line: 723, baseType: !470, size: 64, offset: 256)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !754, file: !749, line: 138, baseType: !753, size: 64, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !754, file: !749, line: 139, baseType: !753, size: 64, offset: 128)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !748, file: !749, line: 146, baseType: !752, size: 64, offset: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !748, file: !749, line: 152, baseType: !746, size: 64, offset: 128)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !743, file: !202, line: 130, baseType: !629, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !738, file: !202, line: 134, baseType: !462, size: 64, offset: 192)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !738, file: !202, line: 137, baseType: !470, size: 64, offset: 256)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !738, file: !202, line: 138, baseType: !579, size: 32, offset: 320)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !738, file: !202, line: 142, baseType: !7, size: 32, offset: 352)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !738, file: !202, line: 144, baseType: !458, size: 32, offset: 384)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !738, file: !202, line: 145, baseType: !458, size: 32, offset: 416)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !738, file: !202, line: 146, baseType: !969, size: 64, offset: 448)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !202, line: 119, baseType: !526)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !721, file: !202, line: 220, baseType: !724, size: 64, offset: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !721, file: !202, line: 223, baseType: !462, size: 64, offset: 128)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !721, file: !202, line: 226, baseType: !973, size: 64, offset: 192)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !202, line: 185, flags: DIFlagFwdDecl)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !721, file: !202, line: 229, baseType: !976, size: 128, offset: 256)
!976 = !DICompositeType(tag: DW_TAG_array_type, baseType: !977, size: 128, elements: !979)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !202, line: 229, flags: DIFlagFwdDecl)
!979 = !{!980}
!980 = !DISubrange(count: 2)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !721, file: !202, line: 232, baseType: !720, size: 64, offset: 384)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !721, file: !202, line: 233, baseType: !720, size: 64, offset: 448)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !721, file: !202, line: 238, baseType: !984, size: 64, offset: 512)
!984 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !202, line: 235, size: 64, elements: !985)
!985 = !{!986, !992}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !984, file: !202, line: 236, baseType: !987, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !202, line: 273, size: 128, elements: !989)
!989 = !{!990, !991}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !988, file: !202, line: 275, baseType: !746, size: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !988, file: !202, line: 278, baseType: !746, size: 64, offset: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !984, file: !202, line: 237, baseType: !993, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !202, line: 259, size: 320, elements: !995)
!995 = !{!996, !997, !998, !999, !1000}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !994, file: !202, line: 261, baseType: !629, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !994, file: !202, line: 262, baseType: !629, size: 64, offset: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !994, file: !202, line: 266, baseType: !629, size: 64, offset: 128)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !994, file: !202, line: 267, baseType: !629, size: 64, offset: 192)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !994, file: !202, line: 270, baseType: !458, size: 32, offset: 256)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !721, file: !202, line: 241, baseType: !969, size: 64, offset: 576)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !721, file: !202, line: 244, baseType: !458, size: 32, offset: 640)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !721, file: !202, line: 247, baseType: !458, size: 32, offset: 672)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !721, file: !202, line: 250, baseType: !458, size: 32, offset: 704)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !721, file: !202, line: 253, baseType: !458, size: 32, offset: 736)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !721, file: !202, line: 256, baseType: !458, size: 32, offset: 768)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !716, file: !202, line: 378, baseType: !719, size: 64, offset: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !716, file: !202, line: 381, baseType: !1009, size: 64, offset: 128)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !202, line: 282, baseType: !1011)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !202, line: 282, size: 128, elements: !1012)
!1012 = !{!1013}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1011, file: !202, line: 282, baseType: !1014, size: 128)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !202, line: 281, baseType: !1015)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !202, line: 281, size: 128, elements: !1016)
!1016 = !{!1017, !1018, !1019}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1015, file: !202, line: 281, baseType: !7, size: 32)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1015, file: !202, line: 281, baseType: !7, size: 32, offset: 32)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1015, file: !202, line: 281, baseType: !1020, size: 64, offset: 64)
!1020 = !DICompositeType(tag: DW_TAG_array_type, baseType: !719, size: 64, elements: !553)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !716, file: !202, line: 384, baseType: !458, size: 32, offset: 192)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !716, file: !202, line: 387, baseType: !458, size: 32, offset: 224)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !716, file: !202, line: 390, baseType: !458, size: 32, offset: 256)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !716, file: !202, line: 394, baseType: !1009, size: 64, offset: 320)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !716, file: !202, line: 396, baseType: !201, size: 32, offset: 384)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !716, file: !202, line: 399, baseType: !1027, size: 64, offset: 416)
!1027 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 64, elements: !979)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !716, file: !202, line: 402, baseType: !1029, size: 64, offset: 480)
!1029 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !979)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !716, file: !202, line: 406, baseType: !458, size: 32, offset: 544)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !716, file: !202, line: 409, baseType: !458, size: 32, offset: 576)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !708, file: !709, line: 470, baseType: !747, size: 64, offset: 128)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !708, file: !709, line: 473, baseType: !1034, size: 64, offset: 192)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !709, line: 166, flags: DIFlagFwdDecl)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !708, file: !709, line: 476, baseType: !1037, size: 64, offset: 256)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !709, line: 476, flags: DIFlagFwdDecl)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !708, file: !709, line: 479, baseType: !1040, size: 64, offset: 320)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1041, line: 144, baseType: !1042)
!1041 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1041, line: 100, size: 896, elements: !1044)
!1044 = !{!1045, !1053, !1058, !1063, !1065, !1066, !1067, !1068, !1069, !1070, !1075, !1077, !1078, !1083, !1088}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1043, file: !1041, line: 102, baseType: !1046, size: 64)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1041, line: 52, baseType: !1047)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!1050, !1051}
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1041, line: 47, baseType: !7)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1043, file: !1041, line: 105, baseType: !1054, size: 64, offset: 64)
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1041, line: 59, baseType: !1055)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!458, !1051, !1051}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1043, file: !1041, line: 108, baseType: !1059, size: 64, offset: 128)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1041, line: 63, baseType: !1060)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{null, !462}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1043, file: !1041, line: 111, baseType: !1064, size: 64, offset: 192)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1043, file: !1041, line: 114, baseType: !903, size: 64, offset: 256)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1043, file: !1041, line: 117, baseType: !903, size: 64, offset: 320)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1043, file: !1041, line: 120, baseType: !903, size: 64, offset: 384)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1043, file: !1041, line: 124, baseType: !7, size: 32, offset: 448)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1043, file: !1041, line: 128, baseType: !7, size: 32, offset: 480)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1043, file: !1041, line: 131, baseType: !1071, size: 64, offset: 512)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1041, line: 75, baseType: !1072)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{!462, !903, !903}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1043, file: !1041, line: 132, baseType: !1076, size: 64, offset: 576)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1041, line: 78, baseType: !1060)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1043, file: !1041, line: 135, baseType: !462, size: 64, offset: 640)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1043, file: !1041, line: 136, baseType: !1079, size: 64, offset: 704)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1041, line: 82, baseType: !1080)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!462, !462, !903, !903}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1043, file: !1041, line: 137, baseType: !1084, size: 64, offset: 768)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1041, line: 83, baseType: !1085)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{null, !462, !462}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1043, file: !1041, line: 141, baseType: !7, size: 32, offset: 832)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !708, file: !709, line: 484, baseType: !470, size: 64, offset: 384)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !708, file: !709, line: 488, baseType: !470, size: 64, offset: 448)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !708, file: !709, line: 493, baseType: !470, size: 64, offset: 512)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !708, file: !709, line: 496, baseType: !470, size: 64, offset: 576)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !708, file: !709, line: 501, baseType: !1094, size: 64, offset: 640)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !213, line: 2355, size: 576, elements: !1096)
!1096 = !{!1097, !1100, !1101, !1102, !1103, !1107, !1108, !1113, !1114, !1115, !1116, !1117, !1118}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1095, file: !213, line: 2356, baseType: !1098, size: 64)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64)
!1099 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !213, line: 2356, flags: DIFlagFwdDecl)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1095, file: !213, line: 2357, baseType: !463, size: 64, offset: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1095, file: !213, line: 2358, baseType: !458, size: 32, offset: 128)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1095, file: !213, line: 2359, baseType: !458, size: 32, offset: 160)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1095, file: !213, line: 2360, baseType: !1104, size: 128, offset: 192)
!1104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !458, size: 128, elements: !1105)
!1105 = !{!1106}
!1106 = !DISubrange(count: 4)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1095, file: !213, line: 2364, baseType: !458, size: 32, offset: 320)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1095, file: !213, line: 2367, baseType: !1109, size: 128, offset: 384)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !213, line: 2349, size: 128, elements: !1110)
!1110 = !{!1111, !1112}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1109, file: !213, line: 2351, baseType: !629, size: 64)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1109, file: !213, line: 2352, baseType: !526, size: 64, offset: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1095, file: !213, line: 2371, baseType: !212, size: 32, offset: 512)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1095, file: !213, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1095, file: !213, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1095, file: !213, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1095, file: !213, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1095, file: !213, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !708, file: !709, line: 504, baseType: !1120, size: 64, offset: 704)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64)
!1121 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !709, line: 504, flags: DIFlagFwdDecl)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !708, file: !709, line: 507, baseType: !1040, size: 64, offset: 768)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !708, file: !709, line: 510, baseType: !458, size: 32, offset: 832)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !708, file: !709, line: 513, baseType: !458, size: 32, offset: 864)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !708, file: !709, line: 516, baseType: !579, size: 32, offset: 896)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !708, file: !709, line: 519, baseType: !579, size: 32, offset: 928)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !708, file: !709, line: 522, baseType: !7, size: 32, offset: 960)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !708, file: !709, line: 523, baseType: !7, size: 32, offset: 992)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !708, file: !709, line: 528, baseType: !463, size: 64, offset: 1024)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !708, file: !709, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !708, file: !709, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !708, file: !709, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !708, file: !709, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !708, file: !709, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !708, file: !709, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !708, file: !709, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !708, file: !709, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !708, file: !709, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !708, file: !709, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !708, file: !709, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !708, file: !709, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !708, file: !709, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !708, file: !709, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !708, file: !709, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !708, file: !709, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !703, file: !6, line: 3254, baseType: !470, size: 64, offset: 1536)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !703, file: !6, line: 3257, baseType: !470, size: 64, offset: 1600)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !703, file: !6, line: 3258, baseType: !470, size: 64, offset: 1664)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !703, file: !6, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !703, file: !6, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !703, file: !6, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !703, file: !6, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !703, file: !6, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !703, file: !6, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !703, file: !6, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !703, file: !6, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !703, file: !6, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !703, file: !6, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !703, file: !6, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !703, file: !6, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !703, file: !6, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !703, file: !6, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !703, file: !6, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !703, file: !6, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !703, file: !6, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !703, file: !6, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !473, file: !6, line: 3394, baseType: !1168, size: 1344)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !6, line: 2279, size: 1344, elements: !1169)
!1169 = !{!1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1195, !1196, !1197, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1168, file: !6, line: 2280, baseType: !509, size: 192)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1168, file: !6, line: 2281, baseType: !470, size: 64, offset: 192)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1168, file: !6, line: 2282, baseType: !470, size: 64, offset: 256)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1168, file: !6, line: 2283, baseType: !470, size: 64, offset: 320)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1168, file: !6, line: 2284, baseType: !470, size: 64, offset: 384)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1168, file: !6, line: 2285, baseType: !7, size: 32, offset: 448)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1168, file: !6, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1168, file: !6, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1168, file: !6, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1168, file: !6, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1168, file: !6, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1168, file: !6, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1168, file: !6, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1168, file: !6, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1168, file: !6, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1168, file: !6, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1168, file: !6, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1168, file: !6, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1168, file: !6, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1168, file: !6, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1168, file: !6, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1168, file: !6, line: 2305, baseType: !7, size: 32, offset: 512)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1168, file: !6, line: 2306, baseType: !1193, size: 32, offset: 544)
!1193 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1194, line: 31, baseType: !458)
!1194 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1168, file: !6, line: 2307, baseType: !470, size: 64, offset: 576)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1168, file: !6, line: 2308, baseType: !470, size: 64, offset: 640)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1168, file: !6, line: 2314, baseType: !1198, size: 64, offset: 704)
!1198 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !6, line: 2309, size: 64, elements: !1199)
!1199 = !{!1200, !1201, !1202}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1198, file: !6, line: 2310, baseType: !458, size: 32)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1198, file: !6, line: 2311, baseType: !463, size: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1198, file: !6, line: 2312, baseType: !1203, size: 64)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64)
!1204 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !6, line: 2277, flags: DIFlagFwdDecl)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1168, file: !6, line: 2315, baseType: !470, size: 64, offset: 768)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1168, file: !6, line: 2316, baseType: !470, size: 64, offset: 832)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1168, file: !6, line: 2317, baseType: !470, size: 64, offset: 896)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1168, file: !6, line: 2318, baseType: !470, size: 64, offset: 960)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1168, file: !6, line: 2319, baseType: !470, size: 64, offset: 1024)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1168, file: !6, line: 2320, baseType: !470, size: 64, offset: 1088)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1168, file: !6, line: 2321, baseType: !470, size: 64, offset: 1152)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1168, file: !6, line: 2322, baseType: !470, size: 64, offset: 1216)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1168, file: !6, line: 2324, baseType: !1214, size: 64, offset: 1280)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64)
!1215 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !6, line: 2324, flags: DIFlagFwdDecl)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !473, file: !6, line: 3395, baseType: !1217, size: 320)
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !6, line: 1469, size: 320, elements: !1218)
!1218 = !{!1219, !1220, !1221}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1217, file: !6, line: 1470, baseType: !509, size: 192)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1217, file: !6, line: 1471, baseType: !470, size: 64, offset: 192)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1217, file: !6, line: 1472, baseType: !470, size: 64, offset: 256)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !473, file: !6, line: 3396, baseType: !1223, size: 320)
!1223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !6, line: 1482, size: 320, elements: !1224)
!1224 = !{!1225, !1226, !1227}
