; ModuleID = 'ira-color.bc'
source_filename = "ira-color.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }

!503 = !DIEnumerator(name: "NE", value: 80, isUnsigned: true)
!504 = !DIEnumerator(name: "EQ", value: 81, isUnsigned: true)
!505 = !DIEnumerator(name: "GE", value: 82, isUnsigned: true)
!506 = !DIEnumerator(name: "GT", value: 83, isUnsigned: true)
!507 = !DIEnumerator(name: "LE", value: 84, isUnsigned: true)
!508 = !DIEnumerator(name: "LT", value: 85, isUnsigned: true)
!509 = !DIEnumerator(name: "GEU", value: 86, isUnsigned: true)
!510 = !DIEnumerator(name: "GTU", value: 87, isUnsigned: true)
!511 = !DIEnumerator(name: "LEU", value: 88, isUnsigned: true)
!512 = !DIEnumerator(name: "LTU", value: 89, isUnsigned: true)
!513 = !DIEnumerator(name: "UNORDERED", value: 90, isUnsigned: true)
!514 = !DIEnumerator(name: "ORDERED", value: 91, isUnsigned: true)
!515 = !DIEnumerator(name: "UNEQ", value: 92, isUnsigned: true)
!516 = !DIEnumerator(name: "UNGE", value: 93, isUnsigned: true)
!517 = !DIEnumerator(name: "UNGT", value: 94, isUnsigned: true)
!518 = !DIEnumerator(name: "UNLE", value: 95, isUnsigned: true)
!519 = !DIEnumerator(name: "UNLT", value: 96, isUnsigned: true)
!520 = !DIEnumerator(name: "LTGT", value: 97, isUnsigned: true)
!521 = !DIEnumerator(name: "SIGN_EXTEND", value: 98, isUnsigned: true)
!522 = !DIEnumerator(name: "ZERO_EXTEND", value: 99, isUnsigned: true)
!523 = !DIEnumerator(name: "TRUNCATE", value: 100, isUnsigned: true)
!524 = !DIEnumerator(name: "FLOAT_EXTEND", value: 101, isUnsigned: true)
!525 = !DIEnumerator(name: "FLOAT_TRUNCATE", value: 102, isUnsigned: true)
!526 = !DIEnumerator(name: "FLOAT", value: 103, isUnsigned: true)
!527 = !DIEnumerator(name: "FIX", value: 104, isUnsigned: true)
!528 = !DIEnumerator(name: "UNSIGNED_FLOAT", value: 105, isUnsigned: true)
!529 = !DIEnumerator(name: "UNSIGNED_FIX", value: 106, isUnsigned: true)
!530 = !DIEnumerator(name: "FRACT_CONVERT", value: 107, isUnsigned: true)
!531 = !DIEnumerator(name: "UNSIGNED_FRACT_CONVERT", value: 108, isUnsigned: true)
!532 = !DIEnumerator(name: "SAT_FRACT", value: 109, isUnsigned: true)
!533 = !DIEnumerator(name: "UNSIGNED_SAT_FRACT", value: 110, isUnsigned: true)
!534 = !DIEnumerator(name: "ABS", value: 111, isUnsigned: true)
!535 = !DIEnumerator(name: "SQRT", value: 112, isUnsigned: true)
!536 = !DIEnumerator(name: "BSWAP", value: 113, isUnsigned: true)
!537 = !DIEnumerator(name: "FFS", value: 114, isUnsigned: true)
!538 = !DIEnumerator(name: "CLZ", value: 115, isUnsigned: true)
!539 = !DIEnumerator(name: "CTZ", value: 116, isUnsigned: true)
!540 = !DIEnumerator(name: "POPCOUNT", value: 117, isUnsigned: true)
!541 = !DIEnumerator(name: "PARITY", value: 118, isUnsigned: true)
!542 = !DIEnumerator(name: "SIGN_EXTRACT", value: 119, isUnsigned: true)
!543 = !DIEnumerator(name: "ZERO_EXTRACT", value: 120, isUnsigned: true)
!544 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!545 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!546 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!547 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!548 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!549 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!550 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!551 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!552 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!553 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!554 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!555 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!556 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!557 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!558 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!559 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!560 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!561 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!562 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!563 = !{!564, !565, !566, !567, !570, !571, !573, !574, !585, !1780, !5, !7, !1781, !975, !1789, !1790, !1752, !1792, !1804, !1805, !1807, !1809, !420, !1810, !1816, !1819, !575, !1820}
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!566 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !569)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "ira_allocno_t", file: !576, line: 63, baseType: !577)
!576 = !DIFile(filename: "./ira-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ira_allocno", file: !576, line: 232, size: 1984, elements: !579)
!579 = !{!580, !581, !582, !583, !584, !1681, !1682, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1731, !1732, !1733, !1734, !1735, !1746, !1747, !1748, !1749, !1750, !1751, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !578, file: !576, line: 237, baseType: !566, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "regno", scope: !578, file: !576, line: 239, baseType: !566, size: 32, offset: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !578, file: !576, line: 242, baseType: !5, size: 32, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "hard_regno", scope: !578, file: !576, line: 249, baseType: !566, size: 32, offset: 96)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !578, file: !576, line: 251, baseType: !585, size: 64, offset: 128)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !586, line: 50, baseType: !587)
!586 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !421, line: 240, size: 384, elements: !589)
!589 = !{!590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !588, file: !421, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !588, file: !421, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !588, file: !421, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !588, file: !421, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !588, file: !421, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !588, file: !421, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !588, file: !421, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !588, file: !421, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !588, file: !421, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !588, file: !421, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !588, file: !421, line: 321, baseType: !601, size: 320, offset: 64)
!601 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !421, line: 315, size: 320, elements: !602)
!602 = !{!603, !1648, !1650, !1679, !1680}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !601, file: !421, line: 316, baseType: !604, size: 64)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !605, size: 64, elements: !620)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !421, line: 183, baseType: !606)
!606 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !421, line: 166, size: 64, elements: !607)
!607 = !{!608, !609, !610, !611, !612, !622, !623, !635, !638, !700, !1626, !1627, !1638, !1645}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !606, file: !421, line: 168, baseType: !566, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !606, file: !421, line: 169, baseType: !7, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !606, file: !421, line: 170, baseType: !571, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !606, file: !421, line: 171, baseType: !585, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !606, file: !421, line: 172, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !586, line: 53, baseType: !614)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !421, line: 359, size: 128, elements: !616)
!616 = !{!617, !618}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !615, file: !421, line: 360, baseType: !566, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !615, file: !421, line: 361, baseType: !619, size: 64, offset: 64)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !585, size: 64, elements: !620)
!620 = !{!621}
!621 = !DISubrange(count: 1)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !606, file: !421, line: 173, baseType: !5, size: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !606, file: !421, line: 174, baseType: !624, size: 32)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !421, line: 133, baseType: !625)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !421, line: 115, size: 32, elements: !626)
!626 = !{!627, !628, !629, !630, !631, !632, !633, !634}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !625, file: !421, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !625, file: !421, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !625, file: !421, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !625, file: !421, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !625, file: !421, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !625, file: !421, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !625, file: !421, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !625, file: !421, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !606, file: !421, line: 175, baseType: !636, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !421, line: 175, flags: DIFlagFwdDecl)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !606, file: !421, line: 176, baseType: !639, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !641, line: 75, size: 256, elements: !642)
!641 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!642 = !{!643, !658, !659, !660}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !640, file: !641, line: 76, baseType: !644, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !641, line: 68, baseType: !646)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !641, line: 63, size: 320, elements: !647)
!647 = !{!648, !650, !651, !652}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !646, file: !641, line: 64, baseType: !649, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !646, file: !641, line: 65, baseType: !649, size: 64, offset: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !646, file: !641, line: 66, baseType: !7, size: 32, offset: 128)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !646, file: !641, line: 67, baseType: !653, size: 128, offset: 192)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !654, size: 128, elements: !656)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !641, line: 29, baseType: !655)
!655 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!656 = !{!657}
!657 = !DISubrange(count: 2)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !640, file: !641, line: 77, baseType: !644, size: 64, offset: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !640, file: !641, line: 78, baseType: !7, size: 32, offset: 128)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !640, file: !641, line: 79, baseType: !661, size: 64, offset: 192)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !641, line: 49, baseType: !663)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !641, line: 45, size: 832, elements: !664)
!664 = !{!665, !666, !667}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !663, file: !641, line: 46, baseType: !649, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !663, file: !641, line: 47, baseType: !639, size: 64, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !663, file: !641, line: 48, baseType: !668, size: 704, offset: 128)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !669, line: 164, size: 704, elements: !670)
!669 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!670 = !{!671, !673, !683, !684, !685, !686, !687, !688, !692, !696, !697, !698, !699}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !668, file: !669, line: 166, baseType: !672, size: 64)
!672 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !668, file: !669, line: 167, baseType: !674, size: 64, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !669, line: 157, size: 192, elements: !676)
!676 = !{!677, !678, !679}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !675, file: !669, line: 159, baseType: !568, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !675, file: !669, line: 160, baseType: !674, size: 64, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !675, file: !669, line: 161, baseType: !680, size: 32, offset: 128)
!680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 32, elements: !681)
!681 = !{!682}
!682 = !DISubrange(count: 4)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !668, file: !669, line: 168, baseType: !568, size: 64, offset: 128)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !668, file: !669, line: 169, baseType: !568, size: 64, offset: 192)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !668, file: !669, line: 170, baseType: !568, size: 64, offset: 256)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !668, file: !669, line: 171, baseType: !672, size: 64, offset: 320)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !668, file: !669, line: 172, baseType: !566, size: 32, offset: 384)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !668, file: !669, line: 176, baseType: !689, size: 64, offset: 448)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{!674, !570, !672}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !668, file: !669, line: 177, baseType: !693, size: 64, offset: 512)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DISubroutineType(types: !695)
!695 = !{null, !570, !674}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !668, file: !669, line: 178, baseType: !570, size: 64, offset: 576)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !668, file: !669, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !668, file: !669, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !668, file: !669, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !606, file: !421, line: 177, baseType: !701, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !586, line: 56, baseType: !702)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !164, line: 3371, size: 1792, elements: !704)
!704 = !{!705, !738, !744, !755, !774, !785, !790, !797, !803, !816, !828, !866, !871, !899, !907, !908, !913, !922, !928, !933, !937, !941, !1253, !1302, !1308, !1315, !1322, !1345, !1370, !1387, !1399, !1421, !1436, !1608}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !703, file: !164, line: 3372, baseType: !706, size: 64)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !164, line: 360, size: 64, elements: !707)
!707 = !{!708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !706, file: !164, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !706, file: !164, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !706, file: !164, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !706, file: !164, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !706, file: !164, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !706, file: !164, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !706, file: !164, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !706, file: !164, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !706, file: !164, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !706, file: !164, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !706, file: !164, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !706, file: !164, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !706, file: !164, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !706, file: !164, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !706, file: !164, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !706, file: !164, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !706, file: !164, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !706, file: !164, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !706, file: !164, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !706, file: !164, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !706, file: !164, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !706, file: !164, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !706, file: !164, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !706, file: !164, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !706, file: !164, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !706, file: !164, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !706, file: !164, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !706, file: !164, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !706, file: !164, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !706, file: !164, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !703, file: !164, line: 3373, baseType: !739, size: 192)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !164, line: 402, size: 192, elements: !740)
!740 = !{!741, !742, !743}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !739, file: !164, line: 403, baseType: !706, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !739, file: !164, line: 404, baseType: !701, size: 64, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !739, file: !164, line: 405, baseType: !701, size: 64, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !703, file: !164, line: 3374, baseType: !745, size: 320)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !164, line: 1384, size: 320, elements: !746)
!746 = !{!747, !748}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !745, file: !164, line: 1385, baseType: !739, size: 192)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !745, file: !164, line: 1386, baseType: !749, size: 128, offset: 192)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !750, line: 58, baseType: !751)
!750 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !750, line: 54, size: 128, elements: !752)
!752 = !{!753, !754}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !751, file: !750, line: 56, baseType: !655, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !751, file: !750, line: 57, baseType: !672, size: 64, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !703, file: !164, line: 3375, baseType: !756, size: 256)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !164, line: 1397, size: 256, elements: !757)
!757 = !{!758, !759}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !756, file: !164, line: 1398, baseType: !739, size: 192)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !756, file: !164, line: 1399, baseType: !760, size: 64, offset: 192)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !762, line: 52, size: 256, elements: !763)
!762 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!763 = !{!764, !765, !766, !767, !768, !769, !770}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !761, file: !762, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !761, file: !762, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !761, file: !762, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !761, file: !762, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !761, file: !762, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !761, file: !762, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !761, file: !762, line: 62, baseType: !771, size: 192, offset: 64)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !655, size: 192, elements: !772)
!772 = !{!773}
!773 = !DISubrange(count: 3)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !703, file: !164, line: 3376, baseType: !775, size: 256)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !164, line: 1408, size: 256, elements: !776)
!776 = !{!777, !778}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !775, file: !164, line: 1409, baseType: !739, size: 192)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !775, file: !164, line: 1410, baseType: !779, size: 64, offset: 192)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !781, line: 27, size: 192, elements: !782)
!781 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!782 = !{!783, !784}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !780, file: !781, line: 29, baseType: !749, size: 128)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !780, file: !781, line: 30, baseType: !5, size: 32, offset: 128)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !703, file: !164, line: 3377, baseType: !786, size: 256)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !164, line: 1437, size: 256, elements: !787)
!787 = !{!788, !789}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !786, file: !164, line: 1438, baseType: !739, size: 192)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !786, file: !164, line: 1439, baseType: !701, size: 64, offset: 192)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !703, file: !164, line: 3378, baseType: !791, size: 256)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !164, line: 1418, size: 256, elements: !792)
!792 = !{!793, !794, !795}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !791, file: !164, line: 1419, baseType: !739, size: 192)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !791, file: !164, line: 1420, baseType: !566, size: 32, offset: 192)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !791, file: !164, line: 1421, baseType: !796, size: 8, offset: 224)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 8, elements: !620)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !703, file: !164, line: 3379, baseType: !798, size: 320)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !164, line: 1428, size: 320, elements: !799)
!799 = !{!800, !801, !802}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !798, file: !164, line: 1429, baseType: !739, size: 192)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !798, file: !164, line: 1430, baseType: !701, size: 64, offset: 192)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !798, file: !164, line: 1431, baseType: !701, size: 64, offset: 256)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !703, file: !164, line: 3380, baseType: !804, size: 320)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !164, line: 1460, size: 320, elements: !805)
!805 = !{!806, !807}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !804, file: !164, line: 1461, baseType: !739, size: 192)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !804, file: !164, line: 1462, baseType: !808, size: 128, offset: 192)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !809, line: 31, size: 128, elements: !810)
!809 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!810 = !{!811, !814, !815}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !808, file: !809, line: 32, baseType: !812, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !565)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !808, file: !809, line: 33, baseType: !7, size: 32, offset: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !808, file: !809, line: 34, baseType: !7, size: 32, offset: 96)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !703, file: !164, line: 3381, baseType: !817, size: 384)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !164, line: 2507, size: 384, elements: !818)
!818 = !{!819, !820, !825, !826, !827}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !817, file: !164, line: 2508, baseType: !739, size: 192)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !817, file: !164, line: 2509, baseType: !821, size: 32, offset: 192)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !822, line: 58, baseType: !823)
!822 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !824, line: 44, baseType: !7)
!824 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!825 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !817, file: !164, line: 2510, baseType: !7, size: 32, offset: 224)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !817, file: !164, line: 2511, baseType: !701, size: 64, offset: 256)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !817, file: !164, line: 2512, baseType: !701, size: 64, offset: 320)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !703, file: !164, line: 3382, baseType: !829, size: 896)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !164, line: 2652, size: 896, elements: !830)
!830 = !{!831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !829, file: !164, line: 2653, baseType: !817, size: 384)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !829, file: !164, line: 2654, baseType: !701, size: 64, offset: 384)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !829, file: !164, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !829, file: !164, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !829, file: !164, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !829, file: !164, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !829, file: !164, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !829, file: !164, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !829, file: !164, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !829, file: !164, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !829, file: !164, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !829, file: !164, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !829, file: !164, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !829, file: !164, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !829, file: !164, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !829, file: !164, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !829, file: !164, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !829, file: !164, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !829, file: !164, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !829, file: !164, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !829, file: !164, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !829, file: !164, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !829, file: !164, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !829, file: !164, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !829, file: !164, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !829, file: !164, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !829, file: !164, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !829, file: !164, line: 2703, baseType: !7, size: 32, offset: 512)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !829, file: !164, line: 2705, baseType: !701, size: 64, offset: 576)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !829, file: !164, line: 2706, baseType: !701, size: 64, offset: 640)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !829, file: !164, line: 2707, baseType: !701, size: 64, offset: 704)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !829, file: !164, line: 2708, baseType: !701, size: 64, offset: 768)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !829, file: !164, line: 2711, baseType: !864, size: 64, offset: 832)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !164, line: 2711, flags: DIFlagFwdDecl)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !703, file: !164, line: 3383, baseType: !867, size: 960)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !164, line: 2756, size: 960, elements: !868)
!868 = !{!869, !870}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !867, file: !164, line: 2757, baseType: !829, size: 896)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !867, file: !164, line: 2758, baseType: !585, size: 64, offset: 896)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !703, file: !164, line: 3384, baseType: !872, size: 1472)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !164, line: 3114, size: 1472, elements: !873)
!873 = !{!874, !895, !896, !897, !898}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !872, file: !164, line: 3115, baseType: !875, size: 1216)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !164, line: 2984, size: 1216, elements: !876)
!876 = !{!877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !875, file: !164, line: 2985, baseType: !867, size: 960)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !875, file: !164, line: 2986, baseType: !701, size: 64, offset: 960)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !875, file: !164, line: 2987, baseType: !701, size: 64, offset: 1024)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !875, file: !164, line: 2988, baseType: !701, size: 64, offset: 1088)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !875, file: !164, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !875, file: !164, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !875, file: !164, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !875, file: !164, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !875, file: !164, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !875, file: !164, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !875, file: !164, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !875, file: !164, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !875, file: !164, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !875, file: !164, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !875, file: !164, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !875, file: !164, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !875, file: !164, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !875, file: !164, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !872, file: !164, line: 3117, baseType: !701, size: 64, offset: 1216)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !872, file: !164, line: 3119, baseType: !701, size: 64, offset: 1280)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !872, file: !164, line: 3121, baseType: !701, size: 64, offset: 1344)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !872, file: !164, line: 3123, baseType: !701, size: 64, offset: 1408)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !703, file: !164, line: 3385, baseType: !900, size: 1088)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !164, line: 2874, size: 1088, elements: !901)
!901 = !{!902, !903, !904}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !900, file: !164, line: 2875, baseType: !867, size: 960)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !900, file: !164, line: 2876, baseType: !585, size: 64, offset: 960)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !900, file: !164, line: 2877, baseType: !905, size: 64, offset: 1024)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !164, line: 2856, flags: DIFlagFwdDecl)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !703, file: !164, line: 3386, baseType: !875, size: 1216)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !703, file: !164, line: 3387, baseType: !909, size: 1280)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !164, line: 3093, size: 1280, elements: !910)
!910 = !{!911, !912}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !909, file: !164, line: 3094, baseType: !875, size: 1216)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !909, file: !164, line: 3095, baseType: !905, size: 64, offset: 1216)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !703, file: !164, line: 3388, baseType: !914, size: 1216)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !164, line: 2824, size: 1216, elements: !915)
!915 = !{!916, !917, !918, !919, !920, !921}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !914, file: !164, line: 2825, baseType: !829, size: 896)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !914, file: !164, line: 2827, baseType: !701, size: 64, offset: 896)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !914, file: !164, line: 2828, baseType: !701, size: 64, offset: 960)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !914, file: !164, line: 2829, baseType: !701, size: 64, offset: 1024)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !914, file: !164, line: 2830, baseType: !701, size: 64, offset: 1088)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !914, file: !164, line: 2831, baseType: !701, size: 64, offset: 1152)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !703, file: !164, line: 3389, baseType: !923, size: 1024)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !164, line: 2850, size: 1024, elements: !924)
!924 = !{!925, !926, !927}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !923, file: !164, line: 2851, baseType: !867, size: 960)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !923, file: !164, line: 2852, baseType: !566, size: 32, offset: 960)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !923, file: !164, line: 2853, baseType: !566, size: 32, offset: 992)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !703, file: !164, line: 3390, baseType: !929, size: 1024)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !164, line: 2857, size: 1024, elements: !930)
!930 = !{!931, !932}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !929, file: !164, line: 2858, baseType: !867, size: 960)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !929, file: !164, line: 2859, baseType: !905, size: 64, offset: 960)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !703, file: !164, line: 3391, baseType: !934, size: 960)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !164, line: 2862, size: 960, elements: !935)
!935 = !{!936}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !934, file: !164, line: 2863, baseType: !867, size: 960)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !703, file: !164, line: 3392, baseType: !938, size: 1472)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !164, line: 3304, size: 1472, elements: !939)
!939 = !{!940}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !938, file: !164, line: 3305, baseType: !872, size: 1472)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !703, file: !164, line: 3393, baseType: !942, size: 1792)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !164, line: 3248, size: 1792, elements: !943)
!943 = !{!944, !945, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !942, file: !164, line: 3249, baseType: !872, size: 1472)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !942, file: !164, line: 3251, baseType: !946, size: 64, offset: 1472)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !948, line: 463, size: 1152, elements: !949)
!948 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!949 = !{!950, !953, !1113, !1114, !1117, !1176, !1177, !1178, !1179, !1180, !1181, !1205, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !947, file: !948, line: 464, baseType: !951, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !948, line: 464, flags: DIFlagFwdDecl)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !947, file: !948, line: 467, baseType: !954, size: 64, offset: 64)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !135, line: 374, size: 640, elements: !956)
!956 = !{!957, !1088, !1089, !1102, !1103, !1104, !1105, !1106, !1107, !1109, !1111, !1112}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !955, file: !135, line: 377, baseType: !958, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !586, line: 111, baseType: !959)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !135, line: 217, size: 832, elements: !961)
!961 = !{!962, !997, !998, !999, !1058, !1062, !1063, !1064, !1082, !1083, !1084, !1085, !1086, !1087}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !960, file: !135, line: 219, baseType: !963, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !135, line: 151, baseType: !965)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !135, line: 151, size: 128, elements: !966)
!966 = !{!967}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !965, file: !135, line: 151, baseType: !968, size: 128)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !135, line: 150, baseType: !969)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !135, line: 150, size: 128, elements: !970)
!970 = !{!971, !972, !973}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !969, file: !135, line: 150, baseType: !7, size: 32)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !969, file: !135, line: 150, baseType: !7, size: 32, offset: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !969, file: !135, line: 150, baseType: !974, size: 64, offset: 64)
!974 = !DICompositeType(tag: DW_TAG_array_type, baseType: !975, size: 64, elements: !620)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !586, line: 108, baseType: !976)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !135, line: 122, size: 512, elements: !978)
!978 = !{!979, !980, !981, !989, !990, !991, !992, !993, !994, !995}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !977, file: !135, line: 124, baseType: !959, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !977, file: !135, line: 125, baseType: !959, size: 64, offset: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !977, file: !135, line: 131, baseType: !982, size: 64, offset: 128)
!982 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !135, line: 128, size: 64, elements: !983)
!983 = !{!984, !988}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !982, file: !135, line: 129, baseType: !985, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !586, line: 66, baseType: !986)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !586, line: 65, flags: DIFlagFwdDecl)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !982, file: !135, line: 130, baseType: !585, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !977, file: !135, line: 134, baseType: !570, size: 64, offset: 192)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !977, file: !135, line: 137, baseType: !701, size: 64, offset: 256)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !977, file: !135, line: 138, baseType: !821, size: 32, offset: 320)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !977, file: !135, line: 142, baseType: !7, size: 32, offset: 352)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !977, file: !135, line: 144, baseType: !566, size: 32, offset: 384)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !977, file: !135, line: 145, baseType: !566, size: 32, offset: 416)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !977, file: !135, line: 146, baseType: !996, size: 64, offset: 448)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !135, line: 119, baseType: !672)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !960, file: !135, line: 220, baseType: !963, size: 64, offset: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !960, file: !135, line: 223, baseType: !570, size: 64, offset: 128)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !960, file: !135, line: 226, baseType: !1000, size: 64, offset: 192)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !146, line: 100, size: 1216, elements: !1002)
!1002 = !{!1003, !1004, !1005, !1006, !1007, !1012, !1013, !1014, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1048, !1056, !1057}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1001, file: !146, line: 102, baseType: !566, size: 32)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1001, file: !146, line: 105, baseType: !7, size: 32, offset: 32)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1001, file: !146, line: 108, baseType: !959, size: 64, offset: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1001, file: !146, line: 111, baseType: !959, size: 64, offset: 128)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1001, file: !146, line: 114, baseType: !1008, size: 64, offset: 192)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !146, line: 41, size: 64, elements: !1009)
!1009 = !{!1010, !1011}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1008, file: !146, line: 42, baseType: !145, size: 32)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1008, file: !146, line: 43, baseType: !7, size: 32, offset: 32)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1001, file: !146, line: 117, baseType: !7, size: 32, offset: 256)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1001, file: !146, line: 120, baseType: !7, size: 32, offset: 288)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1001, file: !146, line: 123, baseType: !1015, size: 64, offset: 320)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !146, line: 87, baseType: !1017)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !146, line: 87, size: 128, elements: !1018)
!1018 = !{!1019}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1017, file: !146, line: 87, baseType: !1020, size: 128)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !146, line: 85, baseType: !1021)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !146, line: 85, size: 128, elements: !1022)
!1022 = !{!1023, !1024, !1025}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1021, file: !146, line: 85, baseType: !7, size: 32)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1021, file: !146, line: 85, baseType: !7, size: 32, offset: 32)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1021, file: !146, line: 85, baseType: !1026, size: 64, offset: 64)
!1026 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1027, size: 64, elements: !620)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !146, line: 84, baseType: !1000)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1001, file: !146, line: 126, baseType: !1000, size: 64, offset: 384)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1001, file: !146, line: 129, baseType: !1000, size: 64, offset: 448)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1001, file: !146, line: 132, baseType: !570, size: 64, offset: 512)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1001, file: !146, line: 139, baseType: !701, size: 64, offset: 576)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1001, file: !146, line: 143, baseType: !749, size: 128, offset: 640)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1001, file: !146, line: 146, baseType: !749, size: 128, offset: 768)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1001, file: !146, line: 148, baseType: !565, size: 8, offset: 896)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1001, file: !146, line: 149, baseType: !565, size: 8, offset: 904)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1001, file: !146, line: 153, baseType: !154, size: 32, offset: 928)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1001, file: !146, line: 156, baseType: !1038, size: 64, offset: 960)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !146, line: 48, size: 320, elements: !1040)
!1040 = !{!1041, !1045, !1046, !1047}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1039, file: !146, line: 50, baseType: !1042, size: 64)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !586, line: 58, baseType: !1043)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !586, line: 57, flags: DIFlagFwdDecl)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1039, file: !146, line: 59, baseType: !749, size: 128, offset: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1039, file: !146, line: 64, baseType: !565, size: 8, offset: 192)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1039, file: !146, line: 67, baseType: !1038, size: 64, offset: 256)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1001, file: !146, line: 159, baseType: !1049, size: 64, offset: 1024)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !146, line: 72, size: 256, elements: !1051)
!1051 = !{!1052, !1053, !1054, !1055}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1050, file: !146, line: 74, baseType: !976, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1050, file: !146, line: 77, baseType: !1049, size: 64, offset: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1050, file: !146, line: 78, baseType: !1049, size: 64, offset: 128)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1050, file: !146, line: 81, baseType: !1049, size: 64, offset: 192)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1001, file: !146, line: 162, baseType: !565, size: 8, offset: 1088)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1001, file: !146, line: 166, baseType: !701, size: 64, offset: 1152)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !960, file: !135, line: 229, baseType: !1059, size: 128, offset: 256)
!1059 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1060, size: 128, elements: !656)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !135, line: 229, flags: DIFlagFwdDecl)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !960, file: !135, line: 232, baseType: !959, size: 64, offset: 384)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !960, file: !135, line: 233, baseType: !959, size: 64, offset: 448)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !960, file: !135, line: 238, baseType: !1065, size: 64, offset: 512)
!1065 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !135, line: 235, size: 64, elements: !1066)
!1066 = !{!1067, !1073}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1065, file: !135, line: 236, baseType: !1068, size: 64)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !135, line: 273, size: 128, elements: !1070)
!1070 = !{!1071, !1072}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1069, file: !135, line: 275, baseType: !985, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1069, file: !135, line: 278, baseType: !985, size: 64, offset: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1065, file: !135, line: 237, baseType: !1074, size: 64)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !135, line: 259, size: 320, elements: !1076)
!1076 = !{!1077, !1078, !1079, !1080, !1081}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1075, file: !135, line: 261, baseType: !585, size: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1075, file: !135, line: 262, baseType: !585, size: 64, offset: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1075, file: !135, line: 266, baseType: !585, size: 64, offset: 128)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1075, file: !135, line: 267, baseType: !585, size: 64, offset: 192)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1075, file: !135, line: 270, baseType: !566, size: 32, offset: 256)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !960, file: !135, line: 241, baseType: !996, size: 64, offset: 576)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !960, file: !135, line: 244, baseType: !566, size: 32, offset: 640)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !960, file: !135, line: 247, baseType: !566, size: 32, offset: 672)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !960, file: !135, line: 250, baseType: !566, size: 32, offset: 704)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !960, file: !135, line: 253, baseType: !566, size: 32, offset: 736)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !960, file: !135, line: 256, baseType: !566, size: 32, offset: 768)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !955, file: !135, line: 378, baseType: !958, size: 64, offset: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !955, file: !135, line: 381, baseType: !1090, size: 64, offset: 128)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !135, line: 282, baseType: !1092)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !135, line: 282, size: 128, elements: !1093)
!1093 = !{!1094}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1092, file: !135, line: 282, baseType: !1095, size: 128)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !135, line: 281, baseType: !1096)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !135, line: 281, size: 128, elements: !1097)
!1097 = !{!1098, !1099, !1100}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1096, file: !135, line: 281, baseType: !7, size: 32)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1096, file: !135, line: 281, baseType: !7, size: 32, offset: 32)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1096, file: !135, line: 281, baseType: !1101, size: 64, offset: 64)
!1101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !958, size: 64, elements: !620)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !955, file: !135, line: 384, baseType: !566, size: 32, offset: 192)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !955, file: !135, line: 387, baseType: !566, size: 32, offset: 224)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !955, file: !135, line: 390, baseType: !566, size: 32, offset: 256)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !955, file: !135, line: 394, baseType: !1090, size: 64, offset: 320)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !955, file: !135, line: 396, baseType: !134, size: 32, offset: 384)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !955, file: !135, line: 399, baseType: !1108, size: 64, offset: 416)
!1108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 64, elements: !656)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !955, file: !135, line: 402, baseType: !1110, size: 64, offset: 480)
!1110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !656)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !955, file: !135, line: 406, baseType: !566, size: 32, offset: 544)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !955, file: !135, line: 409, baseType: !566, size: 32, offset: 576)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !947, file: !948, line: 470, baseType: !986, size: 64, offset: 128)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !947, file: !948, line: 473, baseType: !1115, size: 64, offset: 192)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !948, line: 166, flags: DIFlagFwdDecl)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !947, file: !948, line: 476, baseType: !1118, size: 64, offset: 256)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !146, line: 187, size: 256, elements: !1120)
!1120 = !{!1121, !1122, !1123, !1175}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1119, file: !146, line: 189, baseType: !566, size: 32)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !1119, file: !146, line: 192, baseType: !1015, size: 64, offset: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1119, file: !146, line: 197, baseType: !1124, size: 64, offset: 128)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1125, line: 144, baseType: !1126)
!1125 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1125, line: 100, size: 896, elements: !1128)
!1128 = !{!1129, !1137, !1142, !1147, !1149, !1152, !1153, !1154, !1155, !1156, !1161, !1163, !1164, !1169, !1174}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1127, file: !1125, line: 102, baseType: !1130, size: 64)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1125, line: 52, baseType: !1131)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64)
!1132 = !DISubroutineType(types: !1133)
!1133 = !{!1134, !1135}
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1125, line: 47, baseType: !7)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1127, file: !1125, line: 105, baseType: !1138, size: 64, offset: 64)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1125, line: 59, baseType: !1139)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64)
!1140 = !DISubroutineType(types: !1141)
!1141 = !{!566, !1135, !1135}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1127, file: !1125, line: 108, baseType: !1143, size: 64, offset: 128)
!1143 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1125, line: 63, baseType: !1144)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1145 = !DISubroutineType(types: !1146)
!1146 = !{null, !570}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1127, file: !1125, line: 111, baseType: !1148, size: 64, offset: 192)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1127, file: !1125, line: 114, baseType: !1150, size: 64, offset: 256)
!1150 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1151, line: 46, baseType: !655)
!1151 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1127, file: !1125, line: 117, baseType: !1150, size: 64, offset: 320)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1127, file: !1125, line: 120, baseType: !1150, size: 64, offset: 384)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1127, file: !1125, line: 124, baseType: !7, size: 32, offset: 448)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1127, file: !1125, line: 128, baseType: !7, size: 32, offset: 480)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1127, file: !1125, line: 131, baseType: !1157, size: 64, offset: 512)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1125, line: 75, baseType: !1158)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = !DISubroutineType(types: !1160)
!1160 = !{!570, !1150, !1150}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1127, file: !1125, line: 132, baseType: !1162, size: 64, offset: 576)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1125, line: 78, baseType: !1144)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1127, file: !1125, line: 135, baseType: !570, size: 64, offset: 640)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1127, file: !1125, line: 136, baseType: !1165, size: 64, offset: 704)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1125, line: 82, baseType: !1166)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64)
!1167 = !DISubroutineType(types: !1168)
!1168 = !{!570, !570, !1150, !1150}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1127, file: !1125, line: 137, baseType: !1170, size: 64, offset: 768)
!1170 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1125, line: 83, baseType: !1171)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = !DISubroutineType(types: !1173)
!1173 = !{null, !570, !570}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1127, file: !1125, line: 141, baseType: !7, size: 32, offset: 832)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !1119, file: !146, line: 200, baseType: !1000, size: 64, offset: 192)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !947, file: !948, line: 479, baseType: !1124, size: 64, offset: 320)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !947, file: !948, line: 484, baseType: !701, size: 64, offset: 384)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !947, file: !948, line: 488, baseType: !701, size: 64, offset: 448)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !947, file: !948, line: 493, baseType: !701, size: 64, offset: 512)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !947, file: !948, line: 496, baseType: !701, size: 64, offset: 576)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !947, file: !948, line: 501, baseType: !1182, size: 64, offset: 640)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64)
!1183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !159, line: 2355, size: 576, elements: !1184)
!1184 = !{!1185, !1188, !1189, !1190, !1191, !1193, !1194, !1199, !1200, !1201, !1202, !1203, !1204}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1183, file: !159, line: 2356, baseType: !1186, size: 64)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64)
!1187 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !159, line: 2356, flags: DIFlagFwdDecl)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1183, file: !159, line: 2357, baseType: !571, size: 64, offset: 64)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1183, file: !159, line: 2358, baseType: !566, size: 32, offset: 128)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1183, file: !159, line: 2359, baseType: !566, size: 32, offset: 160)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1183, file: !159, line: 2360, baseType: !1192, size: 128, offset: 192)
!1192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 128, elements: !681)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1183, file: !159, line: 2364, baseType: !566, size: 32, offset: 320)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1183, file: !159, line: 2367, baseType: !1195, size: 128, offset: 384)
!1195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !159, line: 2349, size: 128, elements: !1196)
!1196 = !{!1197, !1198}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1195, file: !159, line: 2351, baseType: !585, size: 64)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1195, file: !159, line: 2352, baseType: !672, size: 64, offset: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1183, file: !159, line: 2371, baseType: !158, size: 32, offset: 512)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1183, file: !159, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1183, file: !159, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1183, file: !159, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1183, file: !159, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1183, file: !159, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !947, file: !948, line: 504, baseType: !1206, size: 64, offset: 704)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64)
!1207 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !948, line: 504, flags: DIFlagFwdDecl)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !947, file: !948, line: 507, baseType: !1124, size: 64, offset: 768)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !947, file: !948, line: 510, baseType: !566, size: 32, offset: 832)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !947, file: !948, line: 513, baseType: !566, size: 32, offset: 864)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !947, file: !948, line: 516, baseType: !821, size: 32, offset: 896)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !947, file: !948, line: 519, baseType: !821, size: 32, offset: 928)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !947, file: !948, line: 522, baseType: !7, size: 32, offset: 960)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !947, file: !948, line: 523, baseType: !7, size: 32, offset: 992)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !947, file: !948, line: 528, baseType: !571, size: 64, offset: 1024)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !947, file: !948, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !947, file: !948, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !947, file: !948, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !947, file: !948, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !947, file: !948, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !947, file: !948, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !947, file: !948, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !947, file: !948, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !947, file: !948, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !947, file: !948, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !947, file: !948, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !947, file: !948, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !947, file: !948, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !947, file: !948, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !947, file: !948, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !947, file: !948, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !942, file: !164, line: 3254, baseType: !701, size: 64, offset: 1536)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !942, file: !164, line: 3257, baseType: !701, size: 64, offset: 1600)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !942, file: !164, line: 3258, baseType: !701, size: 64, offset: 1664)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !942, file: !164, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !942, file: !164, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !942, file: !164, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !942, file: !164, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !942, file: !164, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !942, file: !164, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !942, file: !164, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !942, file: !164, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !942, file: !164, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !942, file: !164, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !942, file: !164, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !942, file: !164, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !942, file: !164, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !942, file: !164, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !942, file: !164, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !942, file: !164, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !942, file: !164, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !942, file: !164, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !703, file: !164, line: 3394, baseType: !1254, size: 1344)
!1254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !164, line: 2279, size: 1344, elements: !1255)
!1255 = !{!1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1281, !1282, !1283, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1254, file: !164, line: 2280, baseType: !739, size: 192)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1254, file: !164, line: 2281, baseType: !701, size: 64, offset: 192)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1254, file: !164, line: 2282, baseType: !701, size: 64, offset: 256)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1254, file: !164, line: 2283, baseType: !701, size: 64, offset: 320)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1254, file: !164, line: 2284, baseType: !701, size: 64, offset: 384)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1254, file: !164, line: 2285, baseType: !7, size: 32, offset: 448)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1254, file: !164, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1254, file: !164, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1254, file: !164, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1254, file: !164, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1254, file: !164, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1254, file: !164, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1254, file: !164, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1254, file: !164, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1254, file: !164, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1254, file: !164, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1254, file: !164, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1254, file: !164, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1254, file: !164, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1254, file: !164, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1254, file: !164, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1254, file: !164, line: 2305, baseType: !7, size: 32, offset: 512)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1254, file: !164, line: 2306, baseType: !1279, size: 32, offset: 544)
!1279 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1280, line: 31, baseType: !566)
!1280 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1254, file: !164, line: 2307, baseType: !701, size: 64, offset: 576)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1254, file: !164, line: 2308, baseType: !701, size: 64, offset: 640)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1254, file: !164, line: 2314, baseType: !1284, size: 64, offset: 704)
!1284 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !164, line: 2309, size: 64, elements: !1285)
!1285 = !{!1286, !1287, !1288}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1284, file: !164, line: 2310, baseType: !566, size: 32)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1284, file: !164, line: 2311, baseType: !571, size: 64)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1284, file: !164, line: 2312, baseType: !1289, size: 64)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64)
!1290 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !164, line: 2277, flags: DIFlagFwdDecl)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1254, file: !164, line: 2315, baseType: !701, size: 64, offset: 768)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1254, file: !164, line: 2316, baseType: !701, size: 64, offset: 832)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1254, file: !164, line: 2317, baseType: !701, size: 64, offset: 896)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1254, file: !164, line: 2318, baseType: !701, size: 64, offset: 960)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1254, file: !164, line: 2319, baseType: !701, size: 64, offset: 1024)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1254, file: !164, line: 2320, baseType: !701, size: 64, offset: 1088)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1254, file: !164, line: 2321, baseType: !701, size: 64, offset: 1152)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1254, file: !164, line: 2322, baseType: !701, size: 64, offset: 1216)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1254, file: !164, line: 2324, baseType: !1300, size: 64, offset: 1280)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64)
!1301 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !164, line: 2324, flags: DIFlagFwdDecl)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !703, file: !164, line: 3395, baseType: !1303, size: 320)
!1303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !164, line: 1469, size: 320, elements: !1304)
!1304 = !{!1305, !1306, !1307}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1303, file: !164, line: 1470, baseType: !739, size: 192)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1303, file: !164, line: 1471, baseType: !701, size: 64, offset: 192)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1303, file: !164, line: 1472, baseType: !701, size: 64, offset: 256)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !703, file: !164, line: 3396, baseType: !1309, size: 320)
!1309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !164, line: 1482, size: 320, elements: !1310)
!1310 = !{!1311, !1312, !1313}
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1309, file: !164, line: 1483, baseType: !739, size: 192)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1309, file: !164, line: 1484, baseType: !566, size: 32, offset: 192)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1309, file: !164, line: 1485, baseType: !1314, size: 64, offset: 256)
