; ModuleID = 'ira-emit.bc'
source_filename = "ira-emit.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.rtx_def = type { i32, %union.u }
%union.u = type { %struct.block_symbol }
%struct.block_symbol = type { [3 x %union.rtunion_def], %struct.object_block*, i64 }
%union.rtunion_def = type { i8* }
%struct.object_block = type { %union.section*, i32, i64, %struct.VEC_rtx_gc*, %struct.VEC_rtx_gc* }
%union.section = type { %struct.unnamed_section }
%struct.unnamed_section = type { %struct.section_common, void (i8*)*, i8*, %union.section* }
%struct.section_common = type { i32 }
%struct.VEC_rtx_gc = type { %struct.VEC_rtx_base }
%struct.VEC_rtx_base = type { i32, i32, [1 x %struct.rtx_def*] }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque

!508 = !DIEnumerator(name: "LT", value: 85, isUnsigned: true)
!509 = !DIEnumerator(name: "GEU", value: 86, isUnsigned: true)
!510 = !DIEnumerator(name: "GTU", value: 87, isUnsigned: true)
!511 = !DIEnumerator(name: "LEU", value: 88, isUnsigned: true)
!512 = !DIEnumerator(name: "LTU", value: 89, isUnsigned: true)
!513 = !DIEnumerator(name: "UNORDERED", value: 90, isUnsigned: true)
!514 = !DIEnumerator(name: "ORDERED", value: 91, isUnsigned: true)
!515 = !DIEnumerator(name: "UNEQ", value: 92, isUnsigned: true)
!516 = !DIEnumerator(name: "UNGE", value: 93, isUnsigned: true)
!517 = !DIEnumerator(name: "UNGT", value: 94, isUnsigned: true)
!518 = !DIEnumerator(name: "UNLE", value: 95, isUnsigned: true)
!519 = !DIEnumerator(name: "UNLT", value: 96, isUnsigned: true)
!520 = !DIEnumerator(name: "LTGT", value: 97, isUnsigned: true)
!521 = !DIEnumerator(name: "SIGN_EXTEND", value: 98, isUnsigned: true)
!522 = !DIEnumerator(name: "ZERO_EXTEND", value: 99, isUnsigned: true)
!523 = !DIEnumerator(name: "TRUNCATE", value: 100, isUnsigned: true)
!524 = !DIEnumerator(name: "FLOAT_EXTEND", value: 101, isUnsigned: true)
!525 = !DIEnumerator(name: "FLOAT_TRUNCATE", value: 102, isUnsigned: true)
!526 = !DIEnumerator(name: "FLOAT", value: 103, isUnsigned: true)
!527 = !DIEnumerator(name: "FIX", value: 104, isUnsigned: true)
!528 = !DIEnumerator(name: "UNSIGNED_FLOAT", value: 105, isUnsigned: true)
!529 = !DIEnumerator(name: "UNSIGNED_FIX", value: 106, isUnsigned: true)
!530 = !DIEnumerator(name: "FRACT_CONVERT", value: 107, isUnsigned: true)
!531 = !DIEnumerator(name: "UNSIGNED_FRACT_CONVERT", value: 108, isUnsigned: true)
!532 = !DIEnumerator(name: "SAT_FRACT", value: 109, isUnsigned: true)
!533 = !DIEnumerator(name: "UNSIGNED_SAT_FRACT", value: 110, isUnsigned: true)
!534 = !DIEnumerator(name: "ABS", value: 111, isUnsigned: true)
!535 = !DIEnumerator(name: "SQRT", value: 112, isUnsigned: true)
!536 = !DIEnumerator(name: "BSWAP", value: 113, isUnsigned: true)
!537 = !DIEnumerator(name: "FFS", value: 114, isUnsigned: true)
!538 = !DIEnumerator(name: "CLZ", value: 115, isUnsigned: true)
!539 = !DIEnumerator(name: "CTZ", value: 116, isUnsigned: true)
!540 = !DIEnumerator(name: "POPCOUNT", value: 117, isUnsigned: true)
!541 = !DIEnumerator(name: "PARITY", value: 118, isUnsigned: true)
!542 = !DIEnumerator(name: "SIGN_EXTRACT", value: 119, isUnsigned: true)
!543 = !DIEnumerator(name: "ZERO_EXTRACT", value: 120, isUnsigned: true)
!544 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!545 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!546 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!547 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!548 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!549 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!550 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!551 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!552 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!553 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!554 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!555 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!556 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!557 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!558 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!559 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!560 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!561 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!562 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!563 = !{!564, !565, !566, !567, !570, !571, !573, !1809, !574, !420, !1789, !589, !5, !1031, !1824, !7, !1832}
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!566 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !569)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "move_t", file: !3, line: 48, baseType: !575)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "move", file: !3, line: 52, size: 384, elements: !577)
!577 = !{!578, !1818, !1819, !1820, !1821, !1822, !1823}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !576, file: !3, line: 55, baseType: !579, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "ira_allocno_t", file: !580, line: 63, baseType: !581)
!580 = !DIFile(filename: "./ira-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ira_allocno", file: !580, line: 232, size: 1984, elements: !583)
!583 = !{!584, !585, !586, !587, !588, !1717, !1718, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1768, !1769, !1770, !1771, !1772, !1783, !1784, !1785, !1786, !1787, !1788, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !582, file: !580, line: 237, baseType: !566, size: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "regno", scope: !582, file: !580, line: 239, baseType: !566, size: 32, offset: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !582, file: !580, line: 242, baseType: !5, size: 32, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "hard_regno", scope: !582, file: !580, line: 249, baseType: !566, size: 32, offset: 96)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !582, file: !580, line: 251, baseType: !589, size: 64, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !590, line: 50, baseType: !591)
!590 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !421, line: 240, size: 384, elements: !593)
!593 = !{!594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !592, file: !421, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !592, file: !421, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !592, file: !421, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !592, file: !421, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !592, file: !421, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !592, file: !421, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !592, file: !421, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !592, file: !421, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !592, file: !421, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !592, file: !421, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !592, file: !421, line: 321, baseType: !605, size: 320, offset: 64)
!605 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !421, line: 315, size: 320, elements: !606)
!606 = !{!607, !1652, !1654, !1715, !1716}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !605, file: !421, line: 316, baseType: !608, size: 64)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !609, size: 64, elements: !624)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !421, line: 183, baseType: !610)
!610 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !421, line: 166, size: 64, elements: !611)
!611 = !{!612, !613, !614, !615, !616, !626, !627, !639, !642, !704, !1630, !1631, !1642, !1649}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !610, file: !421, line: 168, baseType: !566, size: 32)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !610, file: !421, line: 169, baseType: !7, size: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !610, file: !421, line: 170, baseType: !571, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !610, file: !421, line: 171, baseType: !589, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !610, file: !421, line: 172, baseType: !617, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !590, line: 53, baseType: !618)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !421, line: 359, size: 128, elements: !620)
!620 = !{!621, !622}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !619, file: !421, line: 360, baseType: !566, size: 32)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !619, file: !421, line: 361, baseType: !623, size: 64, offset: 64)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !589, size: 64, elements: !624)
!624 = !{!625}
!625 = !DISubrange(count: 1)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !610, file: !421, line: 173, baseType: !5, size: 32)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !610, file: !421, line: 174, baseType: !628, size: 32)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !421, line: 133, baseType: !629)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !421, line: 115, size: 32, elements: !630)
!630 = !{!631, !632, !633, !634, !635, !636, !637, !638}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !629, file: !421, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !629, file: !421, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !629, file: !421, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !629, file: !421, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !629, file: !421, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !629, file: !421, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !629, file: !421, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !629, file: !421, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !610, file: !421, line: 175, baseType: !640, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !421, line: 175, flags: DIFlagFwdDecl)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !610, file: !421, line: 176, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !645, line: 75, size: 256, elements: !646)
!645 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!646 = !{!647, !662, !663, !664}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !644, file: !645, line: 76, baseType: !648, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !645, line: 68, baseType: !650)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !645, line: 63, size: 320, elements: !651)
!651 = !{!652, !654, !655, !656}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !650, file: !645, line: 64, baseType: !653, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !650, file: !645, line: 65, baseType: !653, size: 64, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !650, file: !645, line: 66, baseType: !7, size: 32, offset: 128)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !650, file: !645, line: 67, baseType: !657, size: 128, offset: 192)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !658, size: 128, elements: !660)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !645, line: 29, baseType: !659)
!659 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!660 = !{!661}
!661 = !DISubrange(count: 2)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !644, file: !645, line: 77, baseType: !648, size: 64, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !644, file: !645, line: 78, baseType: !7, size: 32, offset: 128)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !644, file: !645, line: 79, baseType: !665, size: 64, offset: 192)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !645, line: 49, baseType: !667)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !645, line: 45, size: 832, elements: !668)
!668 = !{!669, !670, !671}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !667, file: !645, line: 46, baseType: !653, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !667, file: !645, line: 47, baseType: !643, size: 64, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !667, file: !645, line: 48, baseType: !672, size: 704, offset: 128)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !673, line: 164, size: 704, elements: !674)
!673 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!674 = !{!675, !677, !687, !688, !689, !690, !691, !692, !696, !700, !701, !702, !703}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !672, file: !673, line: 166, baseType: !676, size: 64)
!676 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !672, file: !673, line: 167, baseType: !678, size: 64, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !673, line: 157, size: 192, elements: !680)
!680 = !{!681, !682, !683}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !679, file: !673, line: 159, baseType: !568, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !679, file: !673, line: 160, baseType: !678, size: 64, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !679, file: !673, line: 161, baseType: !684, size: 32, offset: 128)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 32, elements: !685)
!685 = !{!686}
!686 = !DISubrange(count: 4)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !672, file: !673, line: 168, baseType: !568, size: 64, offset: 128)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !672, file: !673, line: 169, baseType: !568, size: 64, offset: 192)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !672, file: !673, line: 170, baseType: !568, size: 64, offset: 256)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !672, file: !673, line: 171, baseType: !676, size: 64, offset: 320)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !672, file: !673, line: 172, baseType: !566, size: 32, offset: 384)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !672, file: !673, line: 176, baseType: !693, size: 64, offset: 448)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DISubroutineType(types: !695)
!695 = !{!678, !570, !676}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !672, file: !673, line: 177, baseType: !697, size: 64, offset: 512)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DISubroutineType(types: !699)
!699 = !{null, !570, !678}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !672, file: !673, line: 178, baseType: !570, size: 64, offset: 576)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !672, file: !673, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !672, file: !673, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !672, file: !673, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !610, file: !421, line: 177, baseType: !705, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !590, line: 56, baseType: !706)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !164, line: 3371, size: 1792, elements: !708)
!708 = !{!709, !742, !748, !759, !778, !789, !794, !801, !807, !820, !832, !870, !875, !903, !911, !912, !917, !926, !932, !937, !941, !945, !1257, !1306, !1312, !1319, !1326, !1349, !1374, !1391, !1403, !1425, !1440, !1612}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !707, file: !164, line: 3372, baseType: !710, size: 64)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !164, line: 360, size: 64, elements: !711)
!711 = !{!712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !710, file: !164, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !710, file: !164, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !710, file: !164, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !710, file: !164, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !710, file: !164, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !710, file: !164, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !710, file: !164, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !710, file: !164, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !710, file: !164, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !710, file: !164, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !710, file: !164, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !710, file: !164, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !710, file: !164, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !710, file: !164, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !710, file: !164, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !710, file: !164, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !710, file: !164, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !710, file: !164, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !710, file: !164, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !710, file: !164, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !710, file: !164, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !710, file: !164, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !710, file: !164, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !710, file: !164, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !710, file: !164, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !710, file: !164, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !710, file: !164, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !710, file: !164, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !710, file: !164, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !710, file: !164, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !707, file: !164, line: 3373, baseType: !743, size: 192)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !164, line: 402, size: 192, elements: !744)
!744 = !{!745, !746, !747}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !743, file: !164, line: 403, baseType: !710, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !743, file: !164, line: 404, baseType: !705, size: 64, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !743, file: !164, line: 405, baseType: !705, size: 64, offset: 128)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !707, file: !164, line: 3374, baseType: !749, size: 320)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !164, line: 1384, size: 320, elements: !750)
!750 = !{!751, !752}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !749, file: !164, line: 1385, baseType: !743, size: 192)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !749, file: !164, line: 1386, baseType: !753, size: 128, offset: 192)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !754, line: 58, baseType: !755)
!754 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !754, line: 54, size: 128, elements: !756)
!756 = !{!757, !758}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !755, file: !754, line: 56, baseType: !659, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !755, file: !754, line: 57, baseType: !676, size: 64, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !707, file: !164, line: 3375, baseType: !760, size: 256)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !164, line: 1397, size: 256, elements: !761)
!761 = !{!762, !763}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !760, file: !164, line: 1398, baseType: !743, size: 192)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !760, file: !164, line: 1399, baseType: !764, size: 64, offset: 192)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !766, line: 52, size: 256, elements: !767)
!766 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!767 = !{!768, !769, !770, !771, !772, !773, !774}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !765, file: !766, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !765, file: !766, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !765, file: !766, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !765, file: !766, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !765, file: !766, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !765, file: !766, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !765, file: !766, line: 62, baseType: !775, size: 192, offset: 64)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !659, size: 192, elements: !776)
!776 = !{!777}
!777 = !DISubrange(count: 3)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !707, file: !164, line: 3376, baseType: !779, size: 256)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !164, line: 1408, size: 256, elements: !780)
!780 = !{!781, !782}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !779, file: !164, line: 1409, baseType: !743, size: 192)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !779, file: !164, line: 1410, baseType: !783, size: 64, offset: 192)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !785, line: 27, size: 192, elements: !786)
!785 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!786 = !{!787, !788}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !784, file: !785, line: 29, baseType: !753, size: 128)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !784, file: !785, line: 30, baseType: !5, size: 32, offset: 128)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !707, file: !164, line: 3377, baseType: !790, size: 256)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !164, line: 1437, size: 256, elements: !791)
!791 = !{!792, !793}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !790, file: !164, line: 1438, baseType: !743, size: 192)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !790, file: !164, line: 1439, baseType: !705, size: 64, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !707, file: !164, line: 3378, baseType: !795, size: 256)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !164, line: 1418, size: 256, elements: !796)
!796 = !{!797, !798, !799}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !795, file: !164, line: 1419, baseType: !743, size: 192)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !795, file: !164, line: 1420, baseType: !566, size: 32, offset: 192)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !795, file: !164, line: 1421, baseType: !800, size: 8, offset: 224)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 8, elements: !624)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !707, file: !164, line: 3379, baseType: !802, size: 320)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !164, line: 1428, size: 320, elements: !803)
!803 = !{!804, !805, !806}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !802, file: !164, line: 1429, baseType: !743, size: 192)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !802, file: !164, line: 1430, baseType: !705, size: 64, offset: 192)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !802, file: !164, line: 1431, baseType: !705, size: 64, offset: 256)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !707, file: !164, line: 3380, baseType: !808, size: 320)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !164, line: 1460, size: 320, elements: !809)
!809 = !{!810, !811}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !808, file: !164, line: 1461, baseType: !743, size: 192)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !808, file: !164, line: 1462, baseType: !812, size: 128, offset: 192)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !813, line: 31, size: 128, elements: !814)
!813 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!814 = !{!815, !818, !819}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !812, file: !813, line: 32, baseType: !816, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !565)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !812, file: !813, line: 33, baseType: !7, size: 32, offset: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !812, file: !813, line: 34, baseType: !7, size: 32, offset: 96)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !707, file: !164, line: 3381, baseType: !821, size: 384)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !164, line: 2507, size: 384, elements: !822)
!822 = !{!823, !824, !829, !830, !831}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !821, file: !164, line: 2508, baseType: !743, size: 192)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !821, file: !164, line: 2509, baseType: !825, size: 32, offset: 192)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !826, line: 58, baseType: !827)
!826 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !828, line: 44, baseType: !7)
!828 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!829 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !821, file: !164, line: 2510, baseType: !7, size: 32, offset: 224)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !821, file: !164, line: 2511, baseType: !705, size: 64, offset: 256)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !821, file: !164, line: 2512, baseType: !705, size: 64, offset: 320)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !707, file: !164, line: 3382, baseType: !833, size: 896)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !164, line: 2652, size: 896, elements: !834)
!834 = !{!835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !833, file: !164, line: 2653, baseType: !821, size: 384)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !833, file: !164, line: 2654, baseType: !705, size: 64, offset: 384)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !833, file: !164, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !833, file: !164, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !833, file: !164, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !833, file: !164, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !833, file: !164, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !833, file: !164, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !833, file: !164, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !833, file: !164, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !833, file: !164, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !833, file: !164, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !833, file: !164, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !833, file: !164, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !833, file: !164, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !833, file: !164, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !833, file: !164, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !833, file: !164, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !833, file: !164, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !833, file: !164, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !833, file: !164, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !833, file: !164, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !833, file: !164, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !833, file: !164, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !833, file: !164, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !833, file: !164, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !833, file: !164, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !833, file: !164, line: 2703, baseType: !7, size: 32, offset: 512)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !833, file: !164, line: 2705, baseType: !705, size: 64, offset: 576)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !833, file: !164, line: 2706, baseType: !705, size: 64, offset: 640)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !833, file: !164, line: 2707, baseType: !705, size: 64, offset: 704)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !833, file: !164, line: 2708, baseType: !705, size: 64, offset: 768)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !833, file: !164, line: 2711, baseType: !868, size: 64, offset: 832)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !164, line: 2711, flags: DIFlagFwdDecl)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !707, file: !164, line: 3383, baseType: !871, size: 960)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !164, line: 2756, size: 960, elements: !872)
!872 = !{!873, !874}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !871, file: !164, line: 2757, baseType: !833, size: 896)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !871, file: !164, line: 2758, baseType: !589, size: 64, offset: 896)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !707, file: !164, line: 3384, baseType: !876, size: 1472)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !164, line: 3114, size: 1472, elements: !877)
!877 = !{!878, !899, !900, !901, !902}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !876, file: !164, line: 3115, baseType: !879, size: 1216)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !164, line: 2984, size: 1216, elements: !880)
!880 = !{!881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !879, file: !164, line: 2985, baseType: !871, size: 960)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !879, file: !164, line: 2986, baseType: !705, size: 64, offset: 960)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !879, file: !164, line: 2987, baseType: !705, size: 64, offset: 1024)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !879, file: !164, line: 2988, baseType: !705, size: 64, offset: 1088)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !879, file: !164, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !879, file: !164, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !879, file: !164, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !879, file: !164, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !879, file: !164, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !879, file: !164, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !879, file: !164, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !879, file: !164, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !879, file: !164, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !879, file: !164, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !879, file: !164, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !879, file: !164, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !879, file: !164, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !879, file: !164, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !876, file: !164, line: 3117, baseType: !705, size: 64, offset: 1216)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !876, file: !164, line: 3119, baseType: !705, size: 64, offset: 1280)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !876, file: !164, line: 3121, baseType: !705, size: 64, offset: 1344)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !876, file: !164, line: 3123, baseType: !705, size: 64, offset: 1408)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !707, file: !164, line: 3385, baseType: !904, size: 1088)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !164, line: 2874, size: 1088, elements: !905)
!905 = !{!906, !907, !908}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !904, file: !164, line: 2875, baseType: !871, size: 960)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !904, file: !164, line: 2876, baseType: !589, size: 64, offset: 960)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !904, file: !164, line: 2877, baseType: !909, size: 64, offset: 1024)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !164, line: 2856, flags: DIFlagFwdDecl)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !707, file: !164, line: 3386, baseType: !879, size: 1216)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !707, file: !164, line: 3387, baseType: !913, size: 1280)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !164, line: 3093, size: 1280, elements: !914)
!914 = !{!915, !916}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !913, file: !164, line: 3094, baseType: !879, size: 1216)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !913, file: !164, line: 3095, baseType: !909, size: 64, offset: 1216)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !707, file: !164, line: 3388, baseType: !918, size: 1216)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !164, line: 2824, size: 1216, elements: !919)
!919 = !{!920, !921, !922, !923, !924, !925}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !918, file: !164, line: 2825, baseType: !833, size: 896)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !918, file: !164, line: 2827, baseType: !705, size: 64, offset: 896)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !918, file: !164, line: 2828, baseType: !705, size: 64, offset: 960)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !918, file: !164, line: 2829, baseType: !705, size: 64, offset: 1024)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !918, file: !164, line: 2830, baseType: !705, size: 64, offset: 1088)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !918, file: !164, line: 2831, baseType: !705, size: 64, offset: 1152)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !707, file: !164, line: 3389, baseType: !927, size: 1024)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !164, line: 2850, size: 1024, elements: !928)
!928 = !{!929, !930, !931}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !927, file: !164, line: 2851, baseType: !871, size: 960)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !927, file: !164, line: 2852, baseType: !566, size: 32, offset: 960)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !927, file: !164, line: 2853, baseType: !566, size: 32, offset: 992)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !707, file: !164, line: 3390, baseType: !933, size: 1024)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !164, line: 2857, size: 1024, elements: !934)
!934 = !{!935, !936}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !933, file: !164, line: 2858, baseType: !871, size: 960)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !933, file: !164, line: 2859, baseType: !909, size: 64, offset: 960)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !707, file: !164, line: 3391, baseType: !938, size: 960)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !164, line: 2862, size: 960, elements: !939)
!939 = !{!940}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !938, file: !164, line: 2863, baseType: !871, size: 960)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !707, file: !164, line: 3392, baseType: !942, size: 1472)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !164, line: 3304, size: 1472, elements: !943)
!943 = !{!944}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !942, file: !164, line: 3305, baseType: !876, size: 1472)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !707, file: !164, line: 3393, baseType: !946, size: 1792)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !164, line: 3248, size: 1792, elements: !947)
!947 = !{!948, !949, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !946, file: !164, line: 3249, baseType: !876, size: 1472)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !946, file: !164, line: 3251, baseType: !950, size: 64, offset: 1472)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !952, line: 463, size: 1152, elements: !953)
!952 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!953 = !{!954, !957, !1117, !1118, !1121, !1180, !1181, !1182, !1183, !1184, !1185, !1209, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !951, file: !952, line: 464, baseType: !955, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !952, line: 464, flags: DIFlagFwdDecl)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !951, file: !952, line: 467, baseType: !958, size: 64, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !148, line: 374, size: 640, elements: !960)
!960 = !{!961, !1092, !1093, !1106, !1107, !1108, !1109, !1110, !1111, !1113, !1115, !1116}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !959, file: !148, line: 377, baseType: !962, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !590, line: 111, baseType: !963)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !148, line: 217, size: 832, elements: !965)
!965 = !{!966, !1001, !1002, !1003, !1062, !1066, !1067, !1068, !1086, !1087, !1088, !1089, !1090, !1091}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !964, file: !148, line: 219, baseType: !967, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !148, line: 151, baseType: !969)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !148, line: 151, size: 128, elements: !970)
!970 = !{!971}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !969, file: !148, line: 151, baseType: !972, size: 128)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !148, line: 150, baseType: !973)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !148, line: 150, size: 128, elements: !974)
!974 = !{!975, !976, !977}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !973, file: !148, line: 150, baseType: !7, size: 32)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !973, file: !148, line: 150, baseType: !7, size: 32, offset: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !973, file: !148, line: 150, baseType: !978, size: 64, offset: 64)
!978 = !DICompositeType(tag: DW_TAG_array_type, baseType: !979, size: 64, elements: !624)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !590, line: 108, baseType: !980)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !148, line: 122, size: 512, elements: !982)
!982 = !{!983, !984, !985, !993, !994, !995, !996, !997, !998, !999}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !981, file: !148, line: 124, baseType: !963, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !981, file: !148, line: 125, baseType: !963, size: 64, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !981, file: !148, line: 131, baseType: !986, size: 64, offset: 128)
!986 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !148, line: 128, size: 64, elements: !987)
!987 = !{!988, !992}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !986, file: !148, line: 129, baseType: !989, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !590, line: 66, baseType: !990)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !590, line: 65, flags: DIFlagFwdDecl)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !986, file: !148, line: 130, baseType: !589, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !981, file: !148, line: 134, baseType: !570, size: 64, offset: 192)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !981, file: !148, line: 137, baseType: !705, size: 64, offset: 256)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !981, file: !148, line: 138, baseType: !825, size: 32, offset: 320)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !981, file: !148, line: 142, baseType: !7, size: 32, offset: 352)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !981, file: !148, line: 144, baseType: !566, size: 32, offset: 384)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !981, file: !148, line: 145, baseType: !566, size: 32, offset: 416)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !981, file: !148, line: 146, baseType: !1000, size: 64, offset: 448)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !148, line: 119, baseType: !676)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !964, file: !148, line: 220, baseType: !967, size: 64, offset: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !964, file: !148, line: 223, baseType: !570, size: 64, offset: 128)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !964, file: !148, line: 226, baseType: !1004, size: 64, offset: 192)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !135, line: 100, size: 1216, elements: !1006)
!1006 = !{!1007, !1008, !1009, !1010, !1011, !1016, !1017, !1018, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1052, !1060, !1061}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1005, file: !135, line: 102, baseType: !566, size: 32)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1005, file: !135, line: 105, baseType: !7, size: 32, offset: 32)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1005, file: !135, line: 108, baseType: !963, size: 64, offset: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1005, file: !135, line: 111, baseType: !963, size: 64, offset: 128)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1005, file: !135, line: 114, baseType: !1012, size: 64, offset: 192)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !135, line: 41, size: 64, elements: !1013)
!1013 = !{!1014, !1015}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1012, file: !135, line: 42, baseType: !134, size: 32)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1012, file: !135, line: 43, baseType: !7, size: 32, offset: 32)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1005, file: !135, line: 117, baseType: !7, size: 32, offset: 256)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1005, file: !135, line: 120, baseType: !7, size: 32, offset: 288)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1005, file: !135, line: 123, baseType: !1019, size: 64, offset: 320)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !135, line: 87, baseType: !1021)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !135, line: 87, size: 128, elements: !1022)
!1022 = !{!1023}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1021, file: !135, line: 87, baseType: !1024, size: 128)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !135, line: 85, baseType: !1025)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !135, line: 85, size: 128, elements: !1026)
!1026 = !{!1027, !1028, !1029}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1025, file: !135, line: 85, baseType: !7, size: 32)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1025, file: !135, line: 85, baseType: !7, size: 32, offset: 32)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1025, file: !135, line: 85, baseType: !1030, size: 64, offset: 64)
!1030 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1031, size: 64, elements: !624)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !135, line: 84, baseType: !1004)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1005, file: !135, line: 126, baseType: !1004, size: 64, offset: 384)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1005, file: !135, line: 129, baseType: !1004, size: 64, offset: 448)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1005, file: !135, line: 132, baseType: !570, size: 64, offset: 512)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1005, file: !135, line: 139, baseType: !705, size: 64, offset: 576)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1005, file: !135, line: 143, baseType: !753, size: 128, offset: 640)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1005, file: !135, line: 146, baseType: !753, size: 128, offset: 768)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1005, file: !135, line: 148, baseType: !565, size: 8, offset: 896)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1005, file: !135, line: 149, baseType: !565, size: 8, offset: 904)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1005, file: !135, line: 153, baseType: !143, size: 32, offset: 928)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1005, file: !135, line: 156, baseType: !1042, size: 64, offset: 960)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !135, line: 48, size: 320, elements: !1044)
!1044 = !{!1045, !1049, !1050, !1051}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1043, file: !135, line: 50, baseType: !1046, size: 64)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !590, line: 58, baseType: !1047)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !590, line: 57, flags: DIFlagFwdDecl)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1043, file: !135, line: 59, baseType: !753, size: 128, offset: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1043, file: !135, line: 64, baseType: !565, size: 8, offset: 192)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1043, file: !135, line: 67, baseType: !1042, size: 64, offset: 256)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1005, file: !135, line: 159, baseType: !1053, size: 64, offset: 1024)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !135, line: 72, size: 256, elements: !1055)
!1055 = !{!1056, !1057, !1058, !1059}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1054, file: !135, line: 74, baseType: !980, size: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1054, file: !135, line: 77, baseType: !1053, size: 64, offset: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1054, file: !135, line: 78, baseType: !1053, size: 64, offset: 128)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1054, file: !135, line: 81, baseType: !1053, size: 64, offset: 192)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1005, file: !135, line: 162, baseType: !565, size: 8, offset: 1088)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1005, file: !135, line: 166, baseType: !705, size: 64, offset: 1152)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !964, file: !148, line: 229, baseType: !1063, size: 128, offset: 256)
!1063 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1064, size: 128, elements: !660)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !148, line: 229, flags: DIFlagFwdDecl)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !964, file: !148, line: 232, baseType: !963, size: 64, offset: 384)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !964, file: !148, line: 233, baseType: !963, size: 64, offset: 448)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !964, file: !148, line: 238, baseType: !1069, size: 64, offset: 512)
!1069 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !148, line: 235, size: 64, elements: !1070)
!1070 = !{!1071, !1077}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1069, file: !148, line: 236, baseType: !1072, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !148, line: 273, size: 128, elements: !1074)
!1074 = !{!1075, !1076}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1073, file: !148, line: 275, baseType: !989, size: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1073, file: !148, line: 278, baseType: !989, size: 64, offset: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1069, file: !148, line: 237, baseType: !1078, size: 64)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !148, line: 259, size: 320, elements: !1080)
!1080 = !{!1081, !1082, !1083, !1084, !1085}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1079, file: !148, line: 261, baseType: !589, size: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1079, file: !148, line: 262, baseType: !589, size: 64, offset: 64)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1079, file: !148, line: 266, baseType: !589, size: 64, offset: 128)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1079, file: !148, line: 267, baseType: !589, size: 64, offset: 192)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1079, file: !148, line: 270, baseType: !566, size: 32, offset: 256)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !964, file: !148, line: 241, baseType: !1000, size: 64, offset: 576)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !964, file: !148, line: 244, baseType: !566, size: 32, offset: 640)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !964, file: !148, line: 247, baseType: !566, size: 32, offset: 672)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !964, file: !148, line: 250, baseType: !566, size: 32, offset: 704)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !964, file: !148, line: 253, baseType: !566, size: 32, offset: 736)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !964, file: !148, line: 256, baseType: !566, size: 32, offset: 768)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !959, file: !148, line: 378, baseType: !962, size: 64, offset: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !959, file: !148, line: 381, baseType: !1094, size: 64, offset: 128)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !148, line: 282, baseType: !1096)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !148, line: 282, size: 128, elements: !1097)
!1097 = !{!1098}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1096, file: !148, line: 282, baseType: !1099, size: 128)
!1099 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !148, line: 281, baseType: !1100)
!1100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !148, line: 281, size: 128, elements: !1101)
!1101 = !{!1102, !1103, !1104}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1100, file: !148, line: 281, baseType: !7, size: 32)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1100, file: !148, line: 281, baseType: !7, size: 32, offset: 32)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1100, file: !148, line: 281, baseType: !1105, size: 64, offset: 64)
!1105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !962, size: 64, elements: !624)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !959, file: !148, line: 384, baseType: !566, size: 32, offset: 192)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !959, file: !148, line: 387, baseType: !566, size: 32, offset: 224)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !959, file: !148, line: 390, baseType: !566, size: 32, offset: 256)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !959, file: !148, line: 394, baseType: !1094, size: 64, offset: 320)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !959, file: !148, line: 396, baseType: !147, size: 32, offset: 384)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !959, file: !148, line: 399, baseType: !1112, size: 64, offset: 416)
!1112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 64, elements: !660)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !959, file: !148, line: 402, baseType: !1114, size: 64, offset: 480)
!1114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !660)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !959, file: !148, line: 406, baseType: !566, size: 32, offset: 544)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !959, file: !148, line: 409, baseType: !566, size: 32, offset: 576)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !951, file: !952, line: 470, baseType: !990, size: 64, offset: 128)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !951, file: !952, line: 473, baseType: !1119, size: 64, offset: 192)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64)
!1120 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !952, line: 166, flags: DIFlagFwdDecl)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !951, file: !952, line: 476, baseType: !1122, size: 64, offset: 256)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !135, line: 187, size: 256, elements: !1124)
!1124 = !{!1125, !1126, !1127, !1179}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1123, file: !135, line: 189, baseType: !566, size: 32)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !1123, file: !135, line: 192, baseType: !1019, size: 64, offset: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1123, file: !135, line: 197, baseType: !1128, size: 64, offset: 128)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1129, line: 144, baseType: !1130)
!1129 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1129, line: 100, size: 896, elements: !1132)
!1132 = !{!1133, !1141, !1146, !1151, !1153, !1156, !1157, !1158, !1159, !1160, !1165, !1167, !1168, !1173, !1178}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1131, file: !1129, line: 102, baseType: !1134, size: 64)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1129, line: 52, baseType: !1135)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = !DISubroutineType(types: !1137)
!1137 = !{!1138, !1139}
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1129, line: 47, baseType: !7)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64)
!1140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1131, file: !1129, line: 105, baseType: !1142, size: 64, offset: 64)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1129, line: 59, baseType: !1143)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = !DISubroutineType(types: !1145)
!1145 = !{!566, !1139, !1139}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1131, file: !1129, line: 108, baseType: !1147, size: 64, offset: 128)
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1129, line: 63, baseType: !1148)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = !DISubroutineType(types: !1150)
!1150 = !{null, !570}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1131, file: !1129, line: 111, baseType: !1152, size: 64, offset: 192)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1131, file: !1129, line: 114, baseType: !1154, size: 64, offset: 256)
!1154 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1155, line: 46, baseType: !659)
!1155 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1131, file: !1129, line: 117, baseType: !1154, size: 64, offset: 320)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1131, file: !1129, line: 120, baseType: !1154, size: 64, offset: 384)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1131, file: !1129, line: 124, baseType: !7, size: 32, offset: 448)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1131, file: !1129, line: 128, baseType: !7, size: 32, offset: 480)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1131, file: !1129, line: 131, baseType: !1161, size: 64, offset: 512)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1129, line: 75, baseType: !1162)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = !DISubroutineType(types: !1164)
!1164 = !{!570, !1154, !1154}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1131, file: !1129, line: 132, baseType: !1166, size: 64, offset: 576)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1129, line: 78, baseType: !1148)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1131, file: !1129, line: 135, baseType: !570, size: 64, offset: 640)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1131, file: !1129, line: 136, baseType: !1169, size: 64, offset: 704)
!1169 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1129, line: 82, baseType: !1170)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64)
!1171 = !DISubroutineType(types: !1172)
!1172 = !{!570, !570, !1154, !1154}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1131, file: !1129, line: 137, baseType: !1174, size: 64, offset: 768)
!1174 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1129, line: 83, baseType: !1175)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = !DISubroutineType(types: !1177)
!1177 = !{null, !570, !570}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1131, file: !1129, line: 141, baseType: !7, size: 32, offset: 832)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !1123, file: !135, line: 200, baseType: !1004, size: 64, offset: 192)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !951, file: !952, line: 479, baseType: !1128, size: 64, offset: 320)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !951, file: !952, line: 484, baseType: !705, size: 64, offset: 384)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !951, file: !952, line: 488, baseType: !705, size: 64, offset: 448)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !951, file: !952, line: 493, baseType: !705, size: 64, offset: 512)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !951, file: !952, line: 496, baseType: !705, size: 64, offset: 576)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !951, file: !952, line: 501, baseType: !1186, size: 64, offset: 640)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64)
!1187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !159, line: 2355, size: 576, elements: !1188)
!1188 = !{!1189, !1192, !1193, !1194, !1195, !1197, !1198, !1203, !1204, !1205, !1206, !1207, !1208}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1187, file: !159, line: 2356, baseType: !1190, size: 64)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64)
!1191 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !159, line: 2356, flags: DIFlagFwdDecl)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1187, file: !159, line: 2357, baseType: !571, size: 64, offset: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1187, file: !159, line: 2358, baseType: !566, size: 32, offset: 128)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1187, file: !159, line: 2359, baseType: !566, size: 32, offset: 160)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1187, file: !159, line: 2360, baseType: !1196, size: 128, offset: 192)
!1196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 128, elements: !685)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1187, file: !159, line: 2364, baseType: !566, size: 32, offset: 320)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1187, file: !159, line: 2367, baseType: !1199, size: 128, offset: 384)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !159, line: 2349, size: 128, elements: !1200)
!1200 = !{!1201, !1202}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1199, file: !159, line: 2351, baseType: !589, size: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1199, file: !159, line: 2352, baseType: !676, size: 64, offset: 64)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1187, file: !159, line: 2371, baseType: !158, size: 32, offset: 512)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1187, file: !159, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1187, file: !159, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1187, file: !159, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1187, file: !159, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1187, file: !159, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !951, file: !952, line: 504, baseType: !1210, size: 64, offset: 704)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64)
!1211 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !952, line: 504, flags: DIFlagFwdDecl)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !951, file: !952, line: 507, baseType: !1128, size: 64, offset: 768)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !951, file: !952, line: 510, baseType: !566, size: 32, offset: 832)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !951, file: !952, line: 513, baseType: !566, size: 32, offset: 864)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !951, file: !952, line: 516, baseType: !825, size: 32, offset: 896)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !951, file: !952, line: 519, baseType: !825, size: 32, offset: 928)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !951, file: !952, line: 522, baseType: !7, size: 32, offset: 960)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !951, file: !952, line: 523, baseType: !7, size: 32, offset: 992)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !951, file: !952, line: 528, baseType: !571, size: 64, offset: 1024)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !951, file: !952, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !951, file: !952, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !951, file: !952, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !951, file: !952, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !951, file: !952, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !951, file: !952, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !951, file: !952, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !951, file: !952, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !951, file: !952, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !951, file: !952, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !951, file: !952, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !951, file: !952, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !951, file: !952, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !951, file: !952, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !951, file: !952, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !951, file: !952, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !946, file: !164, line: 3254, baseType: !705, size: 64, offset: 1536)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !946, file: !164, line: 3257, baseType: !705, size: 64, offset: 1600)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !946, file: !164, line: 3258, baseType: !705, size: 64, offset: 1664)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !946, file: !164, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !946, file: !164, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !946, file: !164, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !946, file: !164, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !946, file: !164, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !946, file: !164, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !946, file: !164, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !946, file: !164, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !946, file: !164, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !946, file: !164, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !946, file: !164, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !946, file: !164, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !946, file: !164, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !946, file: !164, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !946, file: !164, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !946, file: !164, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !946, file: !164, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !946, file: !164, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !707, file: !164, line: 3394, baseType: !1258, size: 1344)
!1258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !164, line: 2279, size: 1344, elements: !1259)
!1259 = !{!1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1285, !1286, !1287, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303}
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1258, file: !164, line: 2280, baseType: !743, size: 192)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1258, file: !164, line: 2281, baseType: !705, size: 64, offset: 192)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1258, file: !164, line: 2282, baseType: !705, size: 64, offset: 256)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1258, file: !164, line: 2283, baseType: !705, size: 64, offset: 320)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1258, file: !164, line: 2284, baseType: !705, size: 64, offset: 384)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1258, file: !164, line: 2285, baseType: !7, size: 32, offset: 448)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1258, file: !164, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1258, file: !164, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1258, file: !164, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1258, file: !164, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1258, file: !164, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1258, file: !164, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1258, file: !164, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1258, file: !164, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1258, file: !164, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1258, file: !164, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1258, file: !164, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1258, file: !164, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1258, file: !164, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1258, file: !164, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1258, file: !164, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1258, file: !164, line: 2305, baseType: !7, size: 32, offset: 512)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1258, file: !164, line: 2306, baseType: !1283, size: 32, offset: 544)
!1283 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1284, line: 31, baseType: !566)
!1284 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1258, file: !164, line: 2307, baseType: !705, size: 64, offset: 576)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1258, file: !164, line: 2308, baseType: !705, size: 64, offset: 640)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1258, file: !164, line: 2314, baseType: !1288, size: 64, offset: 704)
!1288 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !164, line: 2309, size: 64, elements: !1289)
!1289 = !{!1290, !1291, !1292}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1288, file: !164, line: 2310, baseType: !566, size: 32)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1288, file: !164, line: 2311, baseType: !571, size: 64)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1288, file: !164, line: 2312, baseType: !1293, size: 64)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64)
!1294 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !164, line: 2277, flags: DIFlagFwdDecl)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1258, file: !164, line: 2315, baseType: !705, size: 64, offset: 768)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1258, file: !164, line: 2316, baseType: !705, size: 64, offset: 832)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1258, file: !164, line: 2317, baseType: !705, size: 64, offset: 896)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1258, file: !164, line: 2318, baseType: !705, size: 64, offset: 960)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1258, file: !164, line: 2319, baseType: !705, size: 64, offset: 1024)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1258, file: !164, line: 2320, baseType: !705, size: 64, offset: 1088)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1258, file: !164, line: 2321, baseType: !705, size: 64, offset: 1152)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1258, file: !164, line: 2322, baseType: !705, size: 64, offset: 1216)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1258, file: !164, line: 2324, baseType: !1304, size: 64, offset: 1280)
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64)
!1305 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !164, line: 2324, flags: DIFlagFwdDecl)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !707, file: !164, line: 3395, baseType: !1307, size: 320)
!1307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !164, line: 1469, size: 320, elements: !1308)
!1308 = !{!1309, !1310, !1311}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1307, file: !164, line: 1470, baseType: !743, size: 192)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1307, file: !164, line: 1471, baseType: !705, size: 64, offset: 192)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1307, file: !164, line: 1472, baseType: !705, size: 64, offset: 256)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !707, file: !164, line: 3396, baseType: !1313, size: 320)
!1313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !164, line: 1482, size: 320, elements: !1314)
!1314 = !{!1315, !1316, !1317}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1313, file: !164, line: 1483, baseType: !743, size: 192)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1313, file: !164, line: 1484, baseType: !566, size: 32, offset: 192)
