; ModuleID = 'ira-conflicts.bc'
source_filename = "ira-conflicts.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.ira_loop_tree_node = type { %struct.basic_block_def*, %struct.loop*, %struct.ira_loop_tree_node*, %struct.ira_loop_tree_node*, %struct.ira_loop_tree_node*, %struct.ira_loop_tree_node*, %struct.ira_loop_tree_node*, i32, i8, %struct.ira_allocno**, i8, [27 x i32], %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def* }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }
%struct.edge_def = type { %struct.basic_block_def*, %struct.basic_block_def*, %union.edge_def_insns, i8*, %union.tree_node*, i32, i32, i32, i32, i64 }
%union.edge_def_insns = type { %struct.gimple_seq_d* }

!535 = !DIEnumerator(name: "SQRT", value: 112, isUnsigned: true)
!536 = !DIEnumerator(name: "BSWAP", value: 113, isUnsigned: true)
!537 = !DIEnumerator(name: "FFS", value: 114, isUnsigned: true)
!538 = !DIEnumerator(name: "CLZ", value: 115, isUnsigned: true)
!539 = !DIEnumerator(name: "CTZ", value: 116, isUnsigned: true)
!540 = !DIEnumerator(name: "POPCOUNT", value: 117, isUnsigned: true)
!541 = !DIEnumerator(name: "PARITY", value: 118, isUnsigned: true)
!542 = !DIEnumerator(name: "SIGN_EXTRACT", value: 119, isUnsigned: true)
!543 = !DIEnumerator(name: "ZERO_EXTRACT", value: 120, isUnsigned: true)
!544 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!545 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!546 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!547 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!548 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!549 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!550 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!551 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!552 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!553 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!554 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!555 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!556 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!557 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!558 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!559 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!560 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!561 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!562 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!563 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mode_class", file: !564, line: 36, baseType: !7, size: 32, elements: !565)
!564 = !DIFile(filename: "./machmode.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!565 = !{!566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584}
!566 = !DIEnumerator(name: "MODE_RANDOM", value: 0, isUnsigned: true)
!567 = !DIEnumerator(name: "MODE_CC", value: 1, isUnsigned: true)
!568 = !DIEnumerator(name: "MODE_INT", value: 2, isUnsigned: true)
!569 = !DIEnumerator(name: "MODE_PARTIAL_INT", value: 3, isUnsigned: true)
!570 = !DIEnumerator(name: "MODE_FRACT", value: 4, isUnsigned: true)
!571 = !DIEnumerator(name: "MODE_UFRACT", value: 5, isUnsigned: true)
!572 = !DIEnumerator(name: "MODE_ACCUM", value: 6, isUnsigned: true)
!573 = !DIEnumerator(name: "MODE_UACCUM", value: 7, isUnsigned: true)
!574 = !DIEnumerator(name: "MODE_FLOAT", value: 8, isUnsigned: true)
!575 = !DIEnumerator(name: "MODE_DECIMAL_FLOAT", value: 9, isUnsigned: true)
!576 = !DIEnumerator(name: "MODE_COMPLEX_INT", value: 10, isUnsigned: true)
!577 = !DIEnumerator(name: "MODE_COMPLEX_FLOAT", value: 11, isUnsigned: true)
!578 = !DIEnumerator(name: "MODE_VECTOR_INT", value: 12, isUnsigned: true)
!579 = !DIEnumerator(name: "MODE_VECTOR_FRACT", value: 13, isUnsigned: true)
!580 = !DIEnumerator(name: "MODE_VECTOR_UFRACT", value: 14, isUnsigned: true)
!581 = !DIEnumerator(name: "MODE_VECTOR_ACCUM", value: 15, isUnsigned: true)
!582 = !DIEnumerator(name: "MODE_VECTOR_UACCUM", value: 16, isUnsigned: true)
!583 = !DIEnumerator(name: "MODE_VECTOR_FLOAT", value: 17, isUnsigned: true)
!584 = !DIEnumerator(name: "MAX_MODE_CLASS", value: 18, isUnsigned: true)
!585 = !{!586, !587, !588, !589, !592, !593, !595, !196, !598, !600, !1803, !1804, !599, !7, !420, !611, !597, !563, !1805, !5}
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!588 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !591)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "HARD_REG_ELT_TYPE", file: !596, line: 42, baseType: !597)
!596 = !DIFile(filename: "./hard-reg-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!597 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "ira_allocno_t", file: !602, line: 63, baseType: !603)
!602 = !DIFile(filename: "./ira-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ira_allocno", file: !602, line: 232, size: 1984, elements: !605)
!605 = !{!606, !607, !608, !609, !610, !1705, !1706, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1755, !1756, !1757, !1758, !1759, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !604, file: !602, line: 237, baseType: !588, size: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "regno", scope: !604, file: !602, line: 239, baseType: !588, size: 32, offset: 32)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !604, file: !602, line: 242, baseType: !5, size: 32, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "hard_regno", scope: !604, file: !602, line: 249, baseType: !588, size: 32, offset: 96)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !604, file: !602, line: 251, baseType: !611, size: 64, offset: 128)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !612, line: 50, baseType: !613)
!612 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !421, line: 240, size: 384, elements: !615)
!615 = !{!616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !614, file: !421, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !614, file: !421, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !614, file: !421, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !614, file: !421, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !614, file: !421, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !614, file: !421, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !614, file: !421, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !614, file: !421, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !614, file: !421, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !614, file: !421, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !614, file: !421, line: 321, baseType: !627, size: 320, offset: 64)
!627 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !421, line: 315, size: 320, elements: !628)
!628 = !{!629, !1672, !1674, !1703, !1704}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !627, file: !421, line: 316, baseType: !630, size: 64)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !631, size: 64, elements: !646)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !421, line: 183, baseType: !632)
!632 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !421, line: 166, size: 64, elements: !633)
!633 = !{!634, !635, !636, !637, !638, !648, !649, !661, !664, !724, !1650, !1651, !1662, !1669}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !632, file: !421, line: 168, baseType: !588, size: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !632, file: !421, line: 169, baseType: !7, size: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !632, file: !421, line: 170, baseType: !593, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !632, file: !421, line: 171, baseType: !611, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !632, file: !421, line: 172, baseType: !639, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !612, line: 53, baseType: !640)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !421, line: 359, size: 128, elements: !642)
!642 = !{!643, !644}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !641, file: !421, line: 360, baseType: !588, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !641, file: !421, line: 361, baseType: !645, size: 64, offset: 64)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !611, size: 64, elements: !646)
!646 = !{!647}
!647 = !DISubrange(count: 1)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !632, file: !421, line: 173, baseType: !5, size: 32)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !632, file: !421, line: 174, baseType: !650, size: 32)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !421, line: 133, baseType: !651)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !421, line: 115, size: 32, elements: !652)
!652 = !{!653, !654, !655, !656, !657, !658, !659, !660}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !651, file: !421, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !651, file: !421, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !651, file: !421, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !651, file: !421, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !651, file: !421, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !651, file: !421, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !651, file: !421, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !651, file: !421, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !632, file: !421, line: 175, baseType: !662, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !421, line: 175, flags: DIFlagFwdDecl)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !632, file: !421, line: 176, baseType: !665, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !667, line: 75, size: 256, elements: !668)
!667 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!668 = !{!669, !683, !684, !685}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !666, file: !667, line: 76, baseType: !670, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !667, line: 68, baseType: !672)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !667, line: 63, size: 320, elements: !673)
!673 = !{!674, !676, !677, !678}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !672, file: !667, line: 64, baseType: !675, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !672, file: !667, line: 65, baseType: !675, size: 64, offset: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !672, file: !667, line: 66, baseType: !7, size: 32, offset: 128)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !672, file: !667, line: 67, baseType: !679, size: 128, offset: 192)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !680, size: 128, elements: !681)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !667, line: 29, baseType: !597)
!681 = !{!682}
!682 = !DISubrange(count: 2)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !666, file: !667, line: 77, baseType: !670, size: 64, offset: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !666, file: !667, line: 78, baseType: !7, size: 32, offset: 128)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !666, file: !667, line: 79, baseType: !686, size: 64, offset: 192)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !667, line: 49, baseType: !688)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !667, line: 45, size: 832, elements: !689)
!689 = !{!690, !691, !692}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !688, file: !667, line: 46, baseType: !675, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !688, file: !667, line: 47, baseType: !665, size: 64, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !688, file: !667, line: 48, baseType: !693, size: 704, offset: 128)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !694, line: 164, size: 704, elements: !695)
!694 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!695 = !{!696, !697, !707, !708, !709, !710, !711, !712, !716, !720, !721, !722, !723}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !693, file: !694, line: 166, baseType: !599, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !693, file: !694, line: 167, baseType: !698, size: 64, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !694, line: 157, size: 192, elements: !700)
!700 = !{!701, !702, !703}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !699, file: !694, line: 159, baseType: !590, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !699, file: !694, line: 160, baseType: !698, size: 64, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !699, file: !694, line: 161, baseType: !704, size: 32, offset: 128)
!704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !591, size: 32, elements: !705)
!705 = !{!706}
!706 = !DISubrange(count: 4)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !693, file: !694, line: 168, baseType: !590, size: 64, offset: 128)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !693, file: !694, line: 169, baseType: !590, size: 64, offset: 192)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !693, file: !694, line: 170, baseType: !590, size: 64, offset: 256)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !693, file: !694, line: 171, baseType: !599, size: 64, offset: 320)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !693, file: !694, line: 172, baseType: !588, size: 32, offset: 384)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !693, file: !694, line: 176, baseType: !713, size: 64, offset: 448)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{!698, !592, !599}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !693, file: !694, line: 177, baseType: !717, size: 64, offset: 512)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DISubroutineType(types: !719)
!719 = !{null, !592, !698}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !693, file: !694, line: 178, baseType: !592, size: 64, offset: 576)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !693, file: !694, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !693, file: !694, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !693, file: !694, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !632, file: !421, line: 177, baseType: !725, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !612, line: 56, baseType: !726)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !164, line: 3371, size: 1792, elements: !728)
!728 = !{!729, !762, !768, !779, !798, !809, !814, !821, !827, !840, !852, !890, !895, !923, !931, !932, !937, !946, !952, !957, !961, !965, !1277, !1326, !1332, !1339, !1346, !1369, !1394, !1411, !1423, !1445, !1460, !1632}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !727, file: !164, line: 3372, baseType: !730, size: 64)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !164, line: 360, size: 64, elements: !731)
!731 = !{!732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !730, file: !164, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !730, file: !164, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !730, file: !164, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !730, file: !164, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !730, file: !164, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !730, file: !164, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !730, file: !164, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !730, file: !164, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !730, file: !164, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !730, file: !164, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !730, file: !164, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !730, file: !164, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !730, file: !164, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !730, file: !164, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !730, file: !164, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !730, file: !164, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !730, file: !164, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !730, file: !164, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !730, file: !164, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !730, file: !164, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !730, file: !164, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !730, file: !164, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !730, file: !164, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !730, file: !164, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !730, file: !164, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !730, file: !164, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !730, file: !164, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !730, file: !164, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !730, file: !164, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !730, file: !164, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !727, file: !164, line: 3373, baseType: !763, size: 192)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !164, line: 402, size: 192, elements: !764)
!764 = !{!765, !766, !767}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !763, file: !164, line: 403, baseType: !730, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !763, file: !164, line: 404, baseType: !725, size: 64, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !763, file: !164, line: 405, baseType: !725, size: 64, offset: 128)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !727, file: !164, line: 3374, baseType: !769, size: 320)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !164, line: 1384, size: 320, elements: !770)
!770 = !{!771, !772}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !769, file: !164, line: 1385, baseType: !763, size: 192)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !769, file: !164, line: 1386, baseType: !773, size: 128, offset: 192)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !774, line: 58, baseType: !775)
!774 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !774, line: 54, size: 128, elements: !776)
!776 = !{!777, !778}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !775, file: !774, line: 56, baseType: !597, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !775, file: !774, line: 57, baseType: !599, size: 64, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !727, file: !164, line: 3375, baseType: !780, size: 256)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !164, line: 1397, size: 256, elements: !781)
!781 = !{!782, !783}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !780, file: !164, line: 1398, baseType: !763, size: 192)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !780, file: !164, line: 1399, baseType: !784, size: 64, offset: 192)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !786, line: 52, size: 256, elements: !787)
!786 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!787 = !{!788, !789, !790, !791, !792, !793, !794}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !785, file: !786, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !785, file: !786, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !785, file: !786, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !785, file: !786, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !785, file: !786, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !785, file: !786, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !785, file: !786, line: 62, baseType: !795, size: 192, offset: 64)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !597, size: 192, elements: !796)
!796 = !{!797}
!797 = !DISubrange(count: 3)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !727, file: !164, line: 3376, baseType: !799, size: 256)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !164, line: 1408, size: 256, elements: !800)
!800 = !{!801, !802}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !799, file: !164, line: 1409, baseType: !763, size: 192)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !799, file: !164, line: 1410, baseType: !803, size: 64, offset: 192)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !805, line: 27, size: 192, elements: !806)
!805 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!806 = !{!807, !808}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !804, file: !805, line: 29, baseType: !773, size: 128)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !804, file: !805, line: 30, baseType: !5, size: 32, offset: 128)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !727, file: !164, line: 3377, baseType: !810, size: 256)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !164, line: 1437, size: 256, elements: !811)
!811 = !{!812, !813}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !810, file: !164, line: 1438, baseType: !763, size: 192)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !810, file: !164, line: 1439, baseType: !725, size: 64, offset: 192)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !727, file: !164, line: 3378, baseType: !815, size: 256)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !164, line: 1418, size: 256, elements: !816)
!816 = !{!817, !818, !819}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !815, file: !164, line: 1419, baseType: !763, size: 192)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !815, file: !164, line: 1420, baseType: !588, size: 32, offset: 192)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !815, file: !164, line: 1421, baseType: !820, size: 8, offset: 224)
!820 = !DICompositeType(tag: DW_TAG_array_type, baseType: !591, size: 8, elements: !646)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !727, file: !164, line: 3379, baseType: !822, size: 320)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !164, line: 1428, size: 320, elements: !823)
!823 = !{!824, !825, !826}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !822, file: !164, line: 1429, baseType: !763, size: 192)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !822, file: !164, line: 1430, baseType: !725, size: 64, offset: 192)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !822, file: !164, line: 1431, baseType: !725, size: 64, offset: 256)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !727, file: !164, line: 3380, baseType: !828, size: 320)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !164, line: 1460, size: 320, elements: !829)
!829 = !{!830, !831}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !828, file: !164, line: 1461, baseType: !763, size: 192)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !828, file: !164, line: 1462, baseType: !832, size: 128, offset: 192)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !833, line: 31, size: 128, elements: !834)
!833 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!834 = !{!835, !838, !839}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !832, file: !833, line: 32, baseType: !836, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !587)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !832, file: !833, line: 33, baseType: !7, size: 32, offset: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !832, file: !833, line: 34, baseType: !7, size: 32, offset: 96)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !727, file: !164, line: 3381, baseType: !841, size: 384)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !164, line: 2507, size: 384, elements: !842)
!842 = !{!843, !844, !849, !850, !851}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !841, file: !164, line: 2508, baseType: !763, size: 192)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !841, file: !164, line: 2509, baseType: !845, size: 32, offset: 192)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !846, line: 58, baseType: !847)
!846 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !848, line: 44, baseType: !7)
!848 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!849 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !841, file: !164, line: 2510, baseType: !7, size: 32, offset: 224)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !841, file: !164, line: 2511, baseType: !725, size: 64, offset: 256)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !841, file: !164, line: 2512, baseType: !725, size: 64, offset: 320)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !727, file: !164, line: 3382, baseType: !853, size: 896)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !164, line: 2652, size: 896, elements: !854)
!854 = !{!855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !853, file: !164, line: 2653, baseType: !841, size: 384)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !853, file: !164, line: 2654, baseType: !725, size: 64, offset: 384)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !853, file: !164, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !853, file: !164, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !853, file: !164, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !853, file: !164, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !853, file: !164, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !853, file: !164, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !853, file: !164, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !853, file: !164, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !853, file: !164, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !853, file: !164, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !853, file: !164, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !853, file: !164, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !853, file: !164, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !853, file: !164, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !853, file: !164, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !853, file: !164, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !853, file: !164, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !853, file: !164, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !853, file: !164, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !853, file: !164, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !853, file: !164, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !853, file: !164, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !853, file: !164, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !853, file: !164, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !853, file: !164, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !853, file: !164, line: 2703, baseType: !7, size: 32, offset: 512)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !853, file: !164, line: 2705, baseType: !725, size: 64, offset: 576)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !853, file: !164, line: 2706, baseType: !725, size: 64, offset: 640)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !853, file: !164, line: 2707, baseType: !725, size: 64, offset: 704)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !853, file: !164, line: 2708, baseType: !725, size: 64, offset: 768)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !853, file: !164, line: 2711, baseType: !888, size: 64, offset: 832)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !164, line: 2711, flags: DIFlagFwdDecl)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !727, file: !164, line: 3383, baseType: !891, size: 960)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !164, line: 2756, size: 960, elements: !892)
!892 = !{!893, !894}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !891, file: !164, line: 2757, baseType: !853, size: 896)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !891, file: !164, line: 2758, baseType: !611, size: 64, offset: 896)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !727, file: !164, line: 3384, baseType: !896, size: 1472)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !164, line: 3114, size: 1472, elements: !897)
!897 = !{!898, !919, !920, !921, !922}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !896, file: !164, line: 3115, baseType: !899, size: 1216)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !164, line: 2984, size: 1216, elements: !900)
!900 = !{!901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !899, file: !164, line: 2985, baseType: !891, size: 960)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !899, file: !164, line: 2986, baseType: !725, size: 64, offset: 960)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !899, file: !164, line: 2987, baseType: !725, size: 64, offset: 1024)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !899, file: !164, line: 2988, baseType: !725, size: 64, offset: 1088)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !899, file: !164, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !899, file: !164, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !899, file: !164, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !899, file: !164, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !899, file: !164, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !899, file: !164, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !899, file: !164, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !899, file: !164, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !899, file: !164, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !899, file: !164, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !899, file: !164, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !899, file: !164, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !899, file: !164, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !899, file: !164, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !896, file: !164, line: 3117, baseType: !725, size: 64, offset: 1216)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !896, file: !164, line: 3119, baseType: !725, size: 64, offset: 1280)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !896, file: !164, line: 3121, baseType: !725, size: 64, offset: 1344)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !896, file: !164, line: 3123, baseType: !725, size: 64, offset: 1408)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !727, file: !164, line: 3385, baseType: !924, size: 1088)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !164, line: 2874, size: 1088, elements: !925)
!925 = !{!926, !927, !928}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !924, file: !164, line: 2875, baseType: !891, size: 960)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !924, file: !164, line: 2876, baseType: !611, size: 64, offset: 960)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !924, file: !164, line: 2877, baseType: !929, size: 64, offset: 1024)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !164, line: 2856, flags: DIFlagFwdDecl)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !727, file: !164, line: 3386, baseType: !899, size: 1216)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !727, file: !164, line: 3387, baseType: !933, size: 1280)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !164, line: 3093, size: 1280, elements: !934)
!934 = !{!935, !936}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !933, file: !164, line: 3094, baseType: !899, size: 1216)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !933, file: !164, line: 3095, baseType: !929, size: 64, offset: 1216)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !727, file: !164, line: 3388, baseType: !938, size: 1216)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !164, line: 2824, size: 1216, elements: !939)
!939 = !{!940, !941, !942, !943, !944, !945}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !938, file: !164, line: 2825, baseType: !853, size: 896)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !938, file: !164, line: 2827, baseType: !725, size: 64, offset: 896)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !938, file: !164, line: 2828, baseType: !725, size: 64, offset: 960)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !938, file: !164, line: 2829, baseType: !725, size: 64, offset: 1024)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !938, file: !164, line: 2830, baseType: !725, size: 64, offset: 1088)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !938, file: !164, line: 2831, baseType: !725, size: 64, offset: 1152)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !727, file: !164, line: 3389, baseType: !947, size: 1024)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !164, line: 2850, size: 1024, elements: !948)
!948 = !{!949, !950, !951}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !947, file: !164, line: 2851, baseType: !891, size: 960)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !947, file: !164, line: 2852, baseType: !588, size: 32, offset: 960)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !947, file: !164, line: 2853, baseType: !588, size: 32, offset: 992)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !727, file: !164, line: 3390, baseType: !953, size: 1024)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !164, line: 2857, size: 1024, elements: !954)
!954 = !{!955, !956}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !953, file: !164, line: 2858, baseType: !891, size: 960)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !953, file: !164, line: 2859, baseType: !929, size: 64, offset: 960)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !727, file: !164, line: 3391, baseType: !958, size: 960)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !164, line: 2862, size: 960, elements: !959)
!959 = !{!960}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !958, file: !164, line: 2863, baseType: !891, size: 960)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !727, file: !164, line: 3392, baseType: !962, size: 1472)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !164, line: 3304, size: 1472, elements: !963)
!963 = !{!964}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !962, file: !164, line: 3305, baseType: !896, size: 1472)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !727, file: !164, line: 3393, baseType: !966, size: 1792)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !164, line: 3248, size: 1792, elements: !967)
!967 = !{!968, !969, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !966, file: !164, line: 3249, baseType: !896, size: 1472)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !966, file: !164, line: 3251, baseType: !970, size: 64, offset: 1472)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !972, line: 463, size: 1152, elements: !973)
!972 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!973 = !{!974, !977, !1137, !1138, !1141, !1200, !1201, !1202, !1203, !1204, !1205, !1229, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !971, file: !972, line: 464, baseType: !975, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !972, line: 464, flags: DIFlagFwdDecl)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !971, file: !972, line: 467, baseType: !978, size: 64, offset: 64)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !148, line: 374, size: 640, elements: !980)
!980 = !{!981, !1112, !1113, !1126, !1127, !1128, !1129, !1130, !1131, !1133, !1135, !1136}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !979, file: !148, line: 377, baseType: !982, size: 64)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !612, line: 111, baseType: !983)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !148, line: 217, size: 832, elements: !985)
!985 = !{!986, !1021, !1022, !1023, !1082, !1086, !1087, !1088, !1106, !1107, !1108, !1109, !1110, !1111}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !984, file: !148, line: 219, baseType: !987, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !148, line: 151, baseType: !989)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !148, line: 151, size: 128, elements: !990)
!990 = !{!991}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !989, file: !148, line: 151, baseType: !992, size: 128)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !148, line: 150, baseType: !993)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !148, line: 150, size: 128, elements: !994)
!994 = !{!995, !996, !997}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !993, file: !148, line: 150, baseType: !7, size: 32)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !993, file: !148, line: 150, baseType: !7, size: 32, offset: 32)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !993, file: !148, line: 150, baseType: !998, size: 64, offset: 64)
!998 = !DICompositeType(tag: DW_TAG_array_type, baseType: !999, size: 64, elements: !646)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !612, line: 108, baseType: !1000)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !148, line: 122, size: 512, elements: !1002)
!1002 = !{!1003, !1004, !1005, !1013, !1014, !1015, !1016, !1017, !1018, !1019}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1001, file: !148, line: 124, baseType: !983, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1001, file: !148, line: 125, baseType: !983, size: 64, offset: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1001, file: !148, line: 131, baseType: !1006, size: 64, offset: 128)
!1006 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !148, line: 128, size: 64, elements: !1007)
!1007 = !{!1008, !1012}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1006, file: !148, line: 129, baseType: !1009, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !612, line: 66, baseType: !1010)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !612, line: 65, flags: DIFlagFwdDecl)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1006, file: !148, line: 130, baseType: !611, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1001, file: !148, line: 134, baseType: !592, size: 64, offset: 192)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1001, file: !148, line: 137, baseType: !725, size: 64, offset: 256)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1001, file: !148, line: 138, baseType: !845, size: 32, offset: 320)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1001, file: !148, line: 142, baseType: !7, size: 32, offset: 352)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1001, file: !148, line: 144, baseType: !588, size: 32, offset: 384)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1001, file: !148, line: 145, baseType: !588, size: 32, offset: 416)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1001, file: !148, line: 146, baseType: !1020, size: 64, offset: 448)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !148, line: 119, baseType: !599)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !984, file: !148, line: 220, baseType: !987, size: 64, offset: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !984, file: !148, line: 223, baseType: !592, size: 64, offset: 128)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !984, file: !148, line: 226, baseType: !1024, size: 64, offset: 192)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !135, line: 100, size: 1216, elements: !1026)
!1026 = !{!1027, !1028, !1029, !1030, !1031, !1036, !1037, !1038, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1072, !1080, !1081}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1025, file: !135, line: 102, baseType: !588, size: 32)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1025, file: !135, line: 105, baseType: !7, size: 32, offset: 32)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1025, file: !135, line: 108, baseType: !983, size: 64, offset: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1025, file: !135, line: 111, baseType: !983, size: 64, offset: 128)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1025, file: !135, line: 114, baseType: !1032, size: 64, offset: 192)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !135, line: 41, size: 64, elements: !1033)
!1033 = !{!1034, !1035}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1032, file: !135, line: 42, baseType: !134, size: 32)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1032, file: !135, line: 43, baseType: !7, size: 32, offset: 32)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1025, file: !135, line: 117, baseType: !7, size: 32, offset: 256)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1025, file: !135, line: 120, baseType: !7, size: 32, offset: 288)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1025, file: !135, line: 123, baseType: !1039, size: 64, offset: 320)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !135, line: 87, baseType: !1041)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !135, line: 87, size: 128, elements: !1042)
!1042 = !{!1043}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1041, file: !135, line: 87, baseType: !1044, size: 128)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !135, line: 85, baseType: !1045)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !135, line: 85, size: 128, elements: !1046)
!1046 = !{!1047, !1048, !1049}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1045, file: !135, line: 85, baseType: !7, size: 32)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1045, file: !135, line: 85, baseType: !7, size: 32, offset: 32)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1045, file: !135, line: 85, baseType: !1050, size: 64, offset: 64)
!1050 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1051, size: 64, elements: !646)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !135, line: 84, baseType: !1024)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1025, file: !135, line: 126, baseType: !1024, size: 64, offset: 384)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1025, file: !135, line: 129, baseType: !1024, size: 64, offset: 448)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1025, file: !135, line: 132, baseType: !592, size: 64, offset: 512)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1025, file: !135, line: 139, baseType: !725, size: 64, offset: 576)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1025, file: !135, line: 143, baseType: !773, size: 128, offset: 640)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1025, file: !135, line: 146, baseType: !773, size: 128, offset: 768)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1025, file: !135, line: 148, baseType: !587, size: 8, offset: 896)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1025, file: !135, line: 149, baseType: !587, size: 8, offset: 904)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1025, file: !135, line: 153, baseType: !143, size: 32, offset: 928)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1025, file: !135, line: 156, baseType: !1062, size: 64, offset: 960)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !135, line: 48, size: 320, elements: !1064)
!1064 = !{!1065, !1069, !1070, !1071}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1063, file: !135, line: 50, baseType: !1066, size: 64)
!1066 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !612, line: 58, baseType: !1067)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !612, line: 57, flags: DIFlagFwdDecl)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1063, file: !135, line: 59, baseType: !773, size: 128, offset: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1063, file: !135, line: 64, baseType: !587, size: 8, offset: 192)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1063, file: !135, line: 67, baseType: !1062, size: 64, offset: 256)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1025, file: !135, line: 159, baseType: !1073, size: 64, offset: 1024)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !135, line: 72, size: 256, elements: !1075)
!1075 = !{!1076, !1077, !1078, !1079}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1074, file: !135, line: 74, baseType: !1000, size: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1074, file: !135, line: 77, baseType: !1073, size: 64, offset: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1074, file: !135, line: 78, baseType: !1073, size: 64, offset: 128)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1074, file: !135, line: 81, baseType: !1073, size: 64, offset: 192)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1025, file: !135, line: 162, baseType: !587, size: 8, offset: 1088)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1025, file: !135, line: 166, baseType: !725, size: 64, offset: 1152)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !984, file: !148, line: 229, baseType: !1083, size: 128, offset: 256)
!1083 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1084, size: 128, elements: !681)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64)
!1085 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !148, line: 229, flags: DIFlagFwdDecl)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !984, file: !148, line: 232, baseType: !983, size: 64, offset: 384)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !984, file: !148, line: 233, baseType: !983, size: 64, offset: 448)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !984, file: !148, line: 238, baseType: !1089, size: 64, offset: 512)
!1089 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !148, line: 235, size: 64, elements: !1090)
!1090 = !{!1091, !1097}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1089, file: !148, line: 236, baseType: !1092, size: 64)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !148, line: 273, size: 128, elements: !1094)
!1094 = !{!1095, !1096}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1093, file: !148, line: 275, baseType: !1009, size: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1093, file: !148, line: 278, baseType: !1009, size: 64, offset: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1089, file: !148, line: 237, baseType: !1098, size: 64)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !148, line: 259, size: 320, elements: !1100)
!1100 = !{!1101, !1102, !1103, !1104, !1105}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1099, file: !148, line: 261, baseType: !611, size: 64)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1099, file: !148, line: 262, baseType: !611, size: 64, offset: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1099, file: !148, line: 266, baseType: !611, size: 64, offset: 128)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1099, file: !148, line: 267, baseType: !611, size: 64, offset: 192)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1099, file: !148, line: 270, baseType: !588, size: 32, offset: 256)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !984, file: !148, line: 241, baseType: !1020, size: 64, offset: 576)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !984, file: !148, line: 244, baseType: !588, size: 32, offset: 640)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !984, file: !148, line: 247, baseType: !588, size: 32, offset: 672)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !984, file: !148, line: 250, baseType: !588, size: 32, offset: 704)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !984, file: !148, line: 253, baseType: !588, size: 32, offset: 736)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !984, file: !148, line: 256, baseType: !588, size: 32, offset: 768)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !979, file: !148, line: 378, baseType: !982, size: 64, offset: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !979, file: !148, line: 381, baseType: !1114, size: 64, offset: 128)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !148, line: 282, baseType: !1116)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !148, line: 282, size: 128, elements: !1117)
!1117 = !{!1118}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1116, file: !148, line: 282, baseType: !1119, size: 128)
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !148, line: 281, baseType: !1120)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !148, line: 281, size: 128, elements: !1121)
!1121 = !{!1122, !1123, !1124}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1120, file: !148, line: 281, baseType: !7, size: 32)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1120, file: !148, line: 281, baseType: !7, size: 32, offset: 32)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1120, file: !148, line: 281, baseType: !1125, size: 64, offset: 64)
!1125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !982, size: 64, elements: !646)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !979, file: !148, line: 384, baseType: !588, size: 32, offset: 192)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !979, file: !148, line: 387, baseType: !588, size: 32, offset: 224)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !979, file: !148, line: 390, baseType: !588, size: 32, offset: 256)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !979, file: !148, line: 394, baseType: !1114, size: 64, offset: 320)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !979, file: !148, line: 396, baseType: !147, size: 32, offset: 384)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !979, file: !148, line: 399, baseType: !1132, size: 64, offset: 416)
!1132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 64, elements: !681)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !979, file: !148, line: 402, baseType: !1134, size: 64, offset: 480)
!1134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !681)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !979, file: !148, line: 406, baseType: !588, size: 32, offset: 544)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !979, file: !148, line: 409, baseType: !588, size: 32, offset: 576)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !971, file: !972, line: 470, baseType: !1010, size: 64, offset: 128)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !971, file: !972, line: 473, baseType: !1139, size: 64, offset: 192)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64)
!1140 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !972, line: 166, flags: DIFlagFwdDecl)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !971, file: !972, line: 476, baseType: !1142, size: 64, offset: 256)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64)
!1143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !135, line: 187, size: 256, elements: !1144)
!1144 = !{!1145, !1146, !1147, !1199}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1143, file: !135, line: 189, baseType: !588, size: 32)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !1143, file: !135, line: 192, baseType: !1039, size: 64, offset: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1143, file: !135, line: 197, baseType: !1148, size: 64, offset: 128)
!1148 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1149, line: 144, baseType: !1150)
!1149 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1149, line: 100, size: 896, elements: !1152)
!1152 = !{!1153, !1161, !1166, !1171, !1173, !1176, !1177, !1178, !1179, !1180, !1185, !1187, !1188, !1193, !1198}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1151, file: !1149, line: 102, baseType: !1154, size: 64)
!1154 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1149, line: 52, baseType: !1155)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1156 = !DISubroutineType(types: !1157)
!1157 = !{!1158, !1159}
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1149, line: 47, baseType: !7)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64)
!1160 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1151, file: !1149, line: 105, baseType: !1162, size: 64, offset: 64)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1149, line: 59, baseType: !1163)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64)
!1164 = !DISubroutineType(types: !1165)
!1165 = !{!588, !1159, !1159}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1151, file: !1149, line: 108, baseType: !1167, size: 64, offset: 128)
!1167 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1149, line: 63, baseType: !1168)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64)
!1169 = !DISubroutineType(types: !1170)
!1170 = !{null, !592}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1151, file: !1149, line: 111, baseType: !1172, size: 64, offset: 192)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1151, file: !1149, line: 114, baseType: !1174, size: 64, offset: 256)
!1174 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1175, line: 46, baseType: !597)
!1175 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1151, file: !1149, line: 117, baseType: !1174, size: 64, offset: 320)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1151, file: !1149, line: 120, baseType: !1174, size: 64, offset: 384)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1151, file: !1149, line: 124, baseType: !7, size: 32, offset: 448)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1151, file: !1149, line: 128, baseType: !7, size: 32, offset: 480)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1151, file: !1149, line: 131, baseType: !1181, size: 64, offset: 512)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1149, line: 75, baseType: !1182)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64)
!1183 = !DISubroutineType(types: !1184)
!1184 = !{!592, !1174, !1174}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1151, file: !1149, line: 132, baseType: !1186, size: 64, offset: 576)
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1149, line: 78, baseType: !1168)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1151, file: !1149, line: 135, baseType: !592, size: 64, offset: 640)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1151, file: !1149, line: 136, baseType: !1189, size: 64, offset: 704)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1149, line: 82, baseType: !1190)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64)
!1191 = !DISubroutineType(types: !1192)
!1192 = !{!592, !592, !1174, !1174}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1151, file: !1149, line: 137, baseType: !1194, size: 64, offset: 768)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1149, line: 83, baseType: !1195)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64)
!1196 = !DISubroutineType(types: !1197)
!1197 = !{null, !592, !592}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1151, file: !1149, line: 141, baseType: !7, size: 32, offset: 832)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !1143, file: !135, line: 200, baseType: !1024, size: 64, offset: 192)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !971, file: !972, line: 479, baseType: !1148, size: 64, offset: 320)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !971, file: !972, line: 484, baseType: !725, size: 64, offset: 384)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !971, file: !972, line: 488, baseType: !725, size: 64, offset: 448)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !971, file: !972, line: 493, baseType: !725, size: 64, offset: 512)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !971, file: !972, line: 496, baseType: !725, size: 64, offset: 576)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !971, file: !972, line: 501, baseType: !1206, size: 64, offset: 640)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64)
!1207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !159, line: 2355, size: 576, elements: !1208)
!1208 = !{!1209, !1212, !1213, !1214, !1215, !1217, !1218, !1223, !1224, !1225, !1226, !1227, !1228}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1207, file: !159, line: 2356, baseType: !1210, size: 64)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64)
!1211 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !159, line: 2356, flags: DIFlagFwdDecl)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1207, file: !159, line: 2357, baseType: !593, size: 64, offset: 64)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1207, file: !159, line: 2358, baseType: !588, size: 32, offset: 128)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1207, file: !159, line: 2359, baseType: !588, size: 32, offset: 160)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1207, file: !159, line: 2360, baseType: !1216, size: 128, offset: 192)
!1216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 128, elements: !705)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1207, file: !159, line: 2364, baseType: !588, size: 32, offset: 320)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1207, file: !159, line: 2367, baseType: !1219, size: 128, offset: 384)
!1219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !159, line: 2349, size: 128, elements: !1220)
!1220 = !{!1221, !1222}
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1219, file: !159, line: 2351, baseType: !611, size: 64)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1219, file: !159, line: 2352, baseType: !599, size: 64, offset: 64)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1207, file: !159, line: 2371, baseType: !158, size: 32, offset: 512)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1207, file: !159, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1207, file: !159, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1207, file: !159, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1207, file: !159, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1207, file: !159, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !971, file: !972, line: 504, baseType: !1230, size: 64, offset: 704)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64)
!1231 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !972, line: 504, flags: DIFlagFwdDecl)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !971, file: !972, line: 507, baseType: !1148, size: 64, offset: 768)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !971, file: !972, line: 510, baseType: !588, size: 32, offset: 832)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !971, file: !972, line: 513, baseType: !588, size: 32, offset: 864)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !971, file: !972, line: 516, baseType: !845, size: 32, offset: 896)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !971, file: !972, line: 519, baseType: !845, size: 32, offset: 928)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !971, file: !972, line: 522, baseType: !7, size: 32, offset: 960)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !971, file: !972, line: 523, baseType: !7, size: 32, offset: 992)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !971, file: !972, line: 528, baseType: !593, size: 64, offset: 1024)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !971, file: !972, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !971, file: !972, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !971, file: !972, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !971, file: !972, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !971, file: !972, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !971, file: !972, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !971, file: !972, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !971, file: !972, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !971, file: !972, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !971, file: !972, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !971, file: !972, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !971, file: !972, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !971, file: !972, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !971, file: !972, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !971, file: !972, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !971, file: !972, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !966, file: !164, line: 3254, baseType: !725, size: 64, offset: 1536)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !966, file: !164, line: 3257, baseType: !725, size: 64, offset: 1600)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !966, file: !164, line: 3258, baseType: !725, size: 64, offset: 1664)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !966, file: !164, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !966, file: !164, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !966, file: !164, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !966, file: !164, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !966, file: !164, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !966, file: !164, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !966, file: !164, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !966, file: !164, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !966, file: !164, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !966, file: !164, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !966, file: !164, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !966, file: !164, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !966, file: !164, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !966, file: !164, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !966, file: !164, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !966, file: !164, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !966, file: !164, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !966, file: !164, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !727, file: !164, line: 3394, baseType: !1278, size: 1344)
!1278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !164, line: 2279, size: 1344, elements: !1279)
!1279 = !{!1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1305, !1306, !1307, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1278, file: !164, line: 2280, baseType: !763, size: 192)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1278, file: !164, line: 2281, baseType: !725, size: 64, offset: 192)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1278, file: !164, line: 2282, baseType: !725, size: 64, offset: 256)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1278, file: !164, line: 2283, baseType: !725, size: 64, offset: 320)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1278, file: !164, line: 2284, baseType: !725, size: 64, offset: 384)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1278, file: !164, line: 2285, baseType: !7, size: 32, offset: 448)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1278, file: !164, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1278, file: !164, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1278, file: !164, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1278, file: !164, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1278, file: !164, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1278, file: !164, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1278, file: !164, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1278, file: !164, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1278, file: !164, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1278, file: !164, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1278, file: !164, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1278, file: !164, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1278, file: !164, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1278, file: !164, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1278, file: !164, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1278, file: !164, line: 2305, baseType: !7, size: 32, offset: 512)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1278, file: !164, line: 2306, baseType: !1303, size: 32, offset: 544)
!1303 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1304, line: 31, baseType: !588)
!1304 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1278, file: !164, line: 2307, baseType: !725, size: 64, offset: 576)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1278, file: !164, line: 2308, baseType: !725, size: 64, offset: 640)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1278, file: !164, line: 2314, baseType: !1308, size: 64, offset: 704)
!1308 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !164, line: 2309, size: 64, elements: !1309)
!1309 = !{!1310, !1311, !1312}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1308, file: !164, line: 2310, baseType: !588, size: 32)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1308, file: !164, line: 2311, baseType: !593, size: 64)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1308, file: !164, line: 2312, baseType: !1313, size: 64)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64)
!1314 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !164, line: 2277, flags: DIFlagFwdDecl)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1278, file: !164, line: 2315, baseType: !725, size: 64, offset: 768)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1278, file: !164, line: 2316, baseType: !725, size: 64, offset: 832)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1278, file: !164, line: 2317, baseType: !725, size: 64, offset: 896)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1278, file: !164, line: 2318, baseType: !725, size: 64, offset: 960)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1278, file: !164, line: 2319, baseType: !725, size: 64, offset: 1024)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1278, file: !164, line: 2320, baseType: !725, size: 64, offset: 1088)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1278, file: !164, line: 2321, baseType: !725, size: 64, offset: 1152)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1278, file: !164, line: 2322, baseType: !725, size: 64, offset: 1216)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1278, file: !164, line: 2324, baseType: !1324, size: 64, offset: 1280)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64)
!1325 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !164, line: 2324, flags: DIFlagFwdDecl)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !727, file: !164, line: 3395, baseType: !1327, size: 320)
!1327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !164, line: 1469, size: 320, elements: !1328)
!1328 = !{!1329, !1330, !1331}
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1327, file: !164, line: 1470, baseType: !763, size: 192)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1327, file: !164, line: 1471, baseType: !725, size: 64, offset: 192)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1327, file: !164, line: 1472, baseType: !725, size: 64, offset: 256)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !727, file: !164, line: 3396, baseType: !1333, size: 320)
!1333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !164, line: 1482, size: 320, elements: !1334)
!1334 = !{!1335, !1336, !1337}
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1333, file: !164, line: 1483, baseType: !763, size: 192)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1333, file: !164, line: 1484, baseType: !588, size: 32, offset: 192)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1333, file: !164, line: 1485, baseType: !1338, size: 64, offset: 256)
!1338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !725, size: 64, elements: !646)
