; ModuleID = 'ira-build.bc'
source_filename = "ira-build.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.alloc_pool_def = type { i8*, i64, %struct.alloc_pool_list_def*, i8*, i64, i64, i64, i64, %struct.alloc_pool_list_def*, i64, i64 }
%struct.alloc_pool_list_def = type { %struct.alloc_pool_list_def* }
%struct.ira_allocno = type { i32, i32, i32, i32, %struct.rtx_def*, %struct.ira_allocno*, %struct.ira_loop_tree_node*, i32, i32, i32, i32, i32, i32, i32, i32, %struct.ira_allocno_copy*, %struct.ira_allocno*, %struct.ira_allocno*, %struct.ira_allocno*, %struct.ira_allocno*, %struct.ira_allocno_live_range*, i32, i32, i8*, i32, i32, i64, i64, i32, i32, i32, i16, %struct.ira_allocno*, i32*, i32*, i32*, i32*, i32, i32, %struct.ira_allocno*, %struct.ira_allocno*, i32 }
%struct.rtx_def = type { i32, %union.u }
%union.u = type { %struct.block_symbol }
%struct.block_symbol = type { [3 x %union.rtunion_def], %struct.object_block*, i64 }
%union.rtunion_def = type { i8* }

!501 = !DIEnumerator(name: "PRE_MODIFY", value: 78, isUnsigned: true)
!502 = !DIEnumerator(name: "POST_MODIFY", value: 79, isUnsigned: true)
!503 = !DIEnumerator(name: "NE", value: 80, isUnsigned: true)
!504 = !DIEnumerator(name: "EQ", value: 81, isUnsigned: true)
!505 = !DIEnumerator(name: "GE", value: 82, isUnsigned: true)
!506 = !DIEnumerator(name: "GT", value: 83, isUnsigned: true)
!507 = !DIEnumerator(name: "LE", value: 84, isUnsigned: true)
!508 = !DIEnumerator(name: "LT", value: 85, isUnsigned: true)
!509 = !DIEnumerator(name: "GEU", value: 86, isUnsigned: true)
!510 = !DIEnumerator(name: "GTU", value: 87, isUnsigned: true)
!511 = !DIEnumerator(name: "LEU", value: 88, isUnsigned: true)
!512 = !DIEnumerator(name: "LTU", value: 89, isUnsigned: true)
!513 = !DIEnumerator(name: "UNORDERED", value: 90, isUnsigned: true)
!514 = !DIEnumerator(name: "ORDERED", value: 91, isUnsigned: true)
!515 = !DIEnumerator(name: "UNEQ", value: 92, isUnsigned: true)
!516 = !DIEnumerator(name: "UNGE", value: 93, isUnsigned: true)
!517 = !DIEnumerator(name: "UNGT", value: 94, isUnsigned: true)
!518 = !DIEnumerator(name: "UNLE", value: 95, isUnsigned: true)
!519 = !DIEnumerator(name: "UNLT", value: 96, isUnsigned: true)
!520 = !DIEnumerator(name: "LTGT", value: 97, isUnsigned: true)
!521 = !DIEnumerator(name: "SIGN_EXTEND", value: 98, isUnsigned: true)
!522 = !DIEnumerator(name: "ZERO_EXTEND", value: 99, isUnsigned: true)
!523 = !DIEnumerator(name: "TRUNCATE", value: 100, isUnsigned: true)
!524 = !DIEnumerator(name: "FLOAT_EXTEND", value: 101, isUnsigned: true)
!525 = !DIEnumerator(name: "FLOAT_TRUNCATE", value: 102, isUnsigned: true)
!526 = !DIEnumerator(name: "FLOAT", value: 103, isUnsigned: true)
!527 = !DIEnumerator(name: "FIX", value: 104, isUnsigned: true)
!528 = !DIEnumerator(name: "UNSIGNED_FLOAT", value: 105, isUnsigned: true)
!529 = !DIEnumerator(name: "UNSIGNED_FIX", value: 106, isUnsigned: true)
!530 = !DIEnumerator(name: "FRACT_CONVERT", value: 107, isUnsigned: true)
!531 = !DIEnumerator(name: "UNSIGNED_FRACT_CONVERT", value: 108, isUnsigned: true)
!532 = !DIEnumerator(name: "SAT_FRACT", value: 109, isUnsigned: true)
!533 = !DIEnumerator(name: "UNSIGNED_SAT_FRACT", value: 110, isUnsigned: true)
!534 = !DIEnumerator(name: "ABS", value: 111, isUnsigned: true)
!535 = !DIEnumerator(name: "SQRT", value: 112, isUnsigned: true)
!536 = !DIEnumerator(name: "BSWAP", value: 113, isUnsigned: true)
!537 = !DIEnumerator(name: "FFS", value: 114, isUnsigned: true)
!538 = !DIEnumerator(name: "CLZ", value: 115, isUnsigned: true)
!539 = !DIEnumerator(name: "CTZ", value: 116, isUnsigned: true)
!540 = !DIEnumerator(name: "POPCOUNT", value: 117, isUnsigned: true)
!541 = !DIEnumerator(name: "PARITY", value: 118, isUnsigned: true)
!542 = !DIEnumerator(name: "SIGN_EXTRACT", value: 119, isUnsigned: true)
!543 = !DIEnumerator(name: "ZERO_EXTRACT", value: 120, isUnsigned: true)
!544 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!545 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!546 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!547 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!548 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!549 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!550 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!551 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!552 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!553 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!554 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!555 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!556 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!557 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!558 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!559 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!560 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!561 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!562 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!563 = !{!564, !565, !566, !567, !570, !571, !573, !5, !1727, !1767, !1747, !1803, !1812, !7, !1824, !568, !670, !1825, !1025, !1714, !973, !420, !1837, !1845, !1846, !1848, !1860}
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!566 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !569)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "ira_allocno_t", file: !574, line: 63, baseType: !575)
!574 = !DIFile(filename: "./ira-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ira_allocno", file: !574, line: 232, size: 1984, elements: !577)
!577 = !{!578, !579, !580, !581, !582, !1711, !1712, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1762, !1763, !1764, !1765, !1766, !1777, !1778, !1779, !1780, !1781, !1782, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !576, file: !574, line: 237, baseType: !566, size: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "regno", scope: !576, file: !574, line: 239, baseType: !566, size: 32, offset: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !576, file: !574, line: 242, baseType: !5, size: 32, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "hard_regno", scope: !576, file: !574, line: 249, baseType: !566, size: 32, offset: 96)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !576, file: !574, line: 251, baseType: !583, size: 64, offset: 128)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !584, line: 50, baseType: !585)
!584 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !421, line: 240, size: 384, elements: !587)
!587 = !{!588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !586, file: !421, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !586, file: !421, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !586, file: !421, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !586, file: !421, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !586, file: !421, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !586, file: !421, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !586, file: !421, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !586, file: !421, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !586, file: !421, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !586, file: !421, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !586, file: !421, line: 321, baseType: !599, size: 320, offset: 64)
!599 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !421, line: 315, size: 320, elements: !600)
!600 = !{!601, !1646, !1648, !1709, !1710}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !599, file: !421, line: 316, baseType: !602, size: 64)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !603, size: 64, elements: !618)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !421, line: 183, baseType: !604)
!604 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !421, line: 166, size: 64, elements: !605)
!605 = !{!606, !607, !608, !609, !610, !620, !621, !633, !636, !698, !1624, !1625, !1636, !1643}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !604, file: !421, line: 168, baseType: !566, size: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !604, file: !421, line: 169, baseType: !7, size: 32)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !604, file: !421, line: 170, baseType: !571, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !604, file: !421, line: 171, baseType: !583, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !604, file: !421, line: 172, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !584, line: 53, baseType: !612)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !421, line: 359, size: 128, elements: !614)
!614 = !{!615, !616}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !613, file: !421, line: 360, baseType: !566, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !613, file: !421, line: 361, baseType: !617, size: 64, offset: 64)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !583, size: 64, elements: !618)
!618 = !{!619}
!619 = !DISubrange(count: 1)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !604, file: !421, line: 173, baseType: !5, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !604, file: !421, line: 174, baseType: !622, size: 32)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !421, line: 133, baseType: !623)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !421, line: 115, size: 32, elements: !624)
!624 = !{!625, !626, !627, !628, !629, !630, !631, !632}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !623, file: !421, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !623, file: !421, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !623, file: !421, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !623, file: !421, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !623, file: !421, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !623, file: !421, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !623, file: !421, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !623, file: !421, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !604, file: !421, line: 175, baseType: !634, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !421, line: 175, flags: DIFlagFwdDecl)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !604, file: !421, line: 176, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !639, line: 75, size: 256, elements: !640)
!639 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!640 = !{!641, !656, !657, !658}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !638, file: !639, line: 76, baseType: !642, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !639, line: 68, baseType: !644)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !639, line: 63, size: 320, elements: !645)
!645 = !{!646, !648, !649, !650}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !644, file: !639, line: 64, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !644, file: !639, line: 65, baseType: !647, size: 64, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !644, file: !639, line: 66, baseType: !7, size: 32, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !644, file: !639, line: 67, baseType: !651, size: 128, offset: 192)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !652, size: 128, elements: !654)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !639, line: 29, baseType: !653)
!653 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!654 = !{!655}
!655 = !DISubrange(count: 2)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !638, file: !639, line: 77, baseType: !642, size: 64, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !638, file: !639, line: 78, baseType: !7, size: 32, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !638, file: !639, line: 79, baseType: !659, size: 64, offset: 192)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !639, line: 49, baseType: !661)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !639, line: 45, size: 832, elements: !662)
!662 = !{!663, !664, !665}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !661, file: !639, line: 46, baseType: !647, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !661, file: !639, line: 47, baseType: !637, size: 64, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !661, file: !639, line: 48, baseType: !666, size: 704, offset: 128)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !667, line: 164, size: 704, elements: !668)
!667 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!668 = !{!669, !671, !681, !682, !683, !684, !685, !686, !690, !694, !695, !696, !697}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !666, file: !667, line: 166, baseType: !670, size: 64)
!670 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !666, file: !667, line: 167, baseType: !672, size: 64, offset: 64)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !667, line: 157, size: 192, elements: !674)
!674 = !{!675, !676, !677}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !673, file: !667, line: 159, baseType: !568, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !673, file: !667, line: 160, baseType: !672, size: 64, offset: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !673, file: !667, line: 161, baseType: !678, size: 32, offset: 128)
!678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 32, elements: !679)
!679 = !{!680}
!680 = !DISubrange(count: 4)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !666, file: !667, line: 168, baseType: !568, size: 64, offset: 128)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !666, file: !667, line: 169, baseType: !568, size: 64, offset: 192)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !666, file: !667, line: 170, baseType: !568, size: 64, offset: 256)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !666, file: !667, line: 171, baseType: !670, size: 64, offset: 320)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !666, file: !667, line: 172, baseType: !566, size: 32, offset: 384)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !666, file: !667, line: 176, baseType: !687, size: 64, offset: 448)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DISubroutineType(types: !689)
!689 = !{!672, !570, !670}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !666, file: !667, line: 177, baseType: !691, size: 64, offset: 512)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DISubroutineType(types: !693)
!693 = !{null, !570, !672}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !666, file: !667, line: 178, baseType: !570, size: 64, offset: 576)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !666, file: !667, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !666, file: !667, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !666, file: !667, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !604, file: !421, line: 177, baseType: !699, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !584, line: 56, baseType: !700)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !164, line: 3371, size: 1792, elements: !702)
!702 = !{!703, !736, !742, !753, !772, !783, !788, !795, !801, !814, !826, !864, !869, !897, !905, !906, !911, !920, !926, !931, !935, !939, !1251, !1300, !1306, !1313, !1320, !1343, !1368, !1385, !1397, !1419, !1434, !1606}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !701, file: !164, line: 3372, baseType: !704, size: 64)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !164, line: 360, size: 64, elements: !705)
!705 = !{!706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !704, file: !164, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !704, file: !164, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !704, file: !164, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !704, file: !164, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !704, file: !164, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !704, file: !164, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !704, file: !164, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !704, file: !164, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !704, file: !164, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !704, file: !164, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !704, file: !164, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !704, file: !164, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !704, file: !164, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !704, file: !164, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !704, file: !164, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !704, file: !164, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !704, file: !164, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !704, file: !164, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !704, file: !164, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !704, file: !164, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !704, file: !164, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !704, file: !164, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !704, file: !164, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !704, file: !164, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !704, file: !164, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !704, file: !164, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !704, file: !164, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !704, file: !164, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !704, file: !164, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !704, file: !164, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !701, file: !164, line: 3373, baseType: !737, size: 192)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !164, line: 402, size: 192, elements: !738)
!738 = !{!739, !740, !741}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !737, file: !164, line: 403, baseType: !704, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !737, file: !164, line: 404, baseType: !699, size: 64, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !737, file: !164, line: 405, baseType: !699, size: 64, offset: 128)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !701, file: !164, line: 3374, baseType: !743, size: 320)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !164, line: 1384, size: 320, elements: !744)
!744 = !{!745, !746}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !743, file: !164, line: 1385, baseType: !737, size: 192)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !743, file: !164, line: 1386, baseType: !747, size: 128, offset: 192)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !748, line: 58, baseType: !749)
!748 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !748, line: 54, size: 128, elements: !750)
!750 = !{!751, !752}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !749, file: !748, line: 56, baseType: !653, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !749, file: !748, line: 57, baseType: !670, size: 64, offset: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !701, file: !164, line: 3375, baseType: !754, size: 256)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !164, line: 1397, size: 256, elements: !755)
!755 = !{!756, !757}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !754, file: !164, line: 1398, baseType: !737, size: 192)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !754, file: !164, line: 1399, baseType: !758, size: 64, offset: 192)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !760, line: 52, size: 256, elements: !761)
!760 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!761 = !{!762, !763, !764, !765, !766, !767, !768}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !759, file: !760, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !759, file: !760, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !759, file: !760, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !759, file: !760, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !759, file: !760, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !759, file: !760, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !759, file: !760, line: 62, baseType: !769, size: 192, offset: 64)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !653, size: 192, elements: !770)
!770 = !{!771}
!771 = !DISubrange(count: 3)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !701, file: !164, line: 3376, baseType: !773, size: 256)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !164, line: 1408, size: 256, elements: !774)
!774 = !{!775, !776}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !773, file: !164, line: 1409, baseType: !737, size: 192)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !773, file: !164, line: 1410, baseType: !777, size: 64, offset: 192)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !779, line: 27, size: 192, elements: !780)
!779 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!780 = !{!781, !782}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !778, file: !779, line: 29, baseType: !747, size: 128)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !778, file: !779, line: 30, baseType: !5, size: 32, offset: 128)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !701, file: !164, line: 3377, baseType: !784, size: 256)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !164, line: 1437, size: 256, elements: !785)
!785 = !{!786, !787}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !784, file: !164, line: 1438, baseType: !737, size: 192)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !784, file: !164, line: 1439, baseType: !699, size: 64, offset: 192)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !701, file: !164, line: 3378, baseType: !789, size: 256)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !164, line: 1418, size: 256, elements: !790)
!790 = !{!791, !792, !793}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !789, file: !164, line: 1419, baseType: !737, size: 192)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !789, file: !164, line: 1420, baseType: !566, size: 32, offset: 192)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !789, file: !164, line: 1421, baseType: !794, size: 8, offset: 224)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 8, elements: !618)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !701, file: !164, line: 3379, baseType: !796, size: 320)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !164, line: 1428, size: 320, elements: !797)
!797 = !{!798, !799, !800}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !796, file: !164, line: 1429, baseType: !737, size: 192)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !796, file: !164, line: 1430, baseType: !699, size: 64, offset: 192)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !796, file: !164, line: 1431, baseType: !699, size: 64, offset: 256)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !701, file: !164, line: 3380, baseType: !802, size: 320)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !164, line: 1460, size: 320, elements: !803)
!803 = !{!804, !805}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !802, file: !164, line: 1461, baseType: !737, size: 192)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !802, file: !164, line: 1462, baseType: !806, size: 128, offset: 192)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !807, line: 31, size: 128, elements: !808)
!807 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!808 = !{!809, !812, !813}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !806, file: !807, line: 32, baseType: !810, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !565)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !806, file: !807, line: 33, baseType: !7, size: 32, offset: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !806, file: !807, line: 34, baseType: !7, size: 32, offset: 96)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !701, file: !164, line: 3381, baseType: !815, size: 384)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !164, line: 2507, size: 384, elements: !816)
!816 = !{!817, !818, !823, !824, !825}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !815, file: !164, line: 2508, baseType: !737, size: 192)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !815, file: !164, line: 2509, baseType: !819, size: 32, offset: 192)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !820, line: 58, baseType: !821)
!820 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !822, line: 44, baseType: !7)
!822 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!823 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !815, file: !164, line: 2510, baseType: !7, size: 32, offset: 224)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !815, file: !164, line: 2511, baseType: !699, size: 64, offset: 256)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !815, file: !164, line: 2512, baseType: !699, size: 64, offset: 320)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !701, file: !164, line: 3382, baseType: !827, size: 896)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !164, line: 2652, size: 896, elements: !828)
!828 = !{!829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !827, file: !164, line: 2653, baseType: !815, size: 384)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !827, file: !164, line: 2654, baseType: !699, size: 64, offset: 384)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !827, file: !164, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !827, file: !164, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !827, file: !164, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !827, file: !164, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !827, file: !164, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !827, file: !164, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !827, file: !164, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !827, file: !164, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !827, file: !164, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !827, file: !164, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !827, file: !164, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !827, file: !164, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !827, file: !164, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !827, file: !164, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !827, file: !164, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !827, file: !164, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !827, file: !164, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !827, file: !164, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !827, file: !164, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !827, file: !164, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !827, file: !164, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !827, file: !164, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !827, file: !164, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !827, file: !164, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !827, file: !164, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !827, file: !164, line: 2703, baseType: !7, size: 32, offset: 512)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !827, file: !164, line: 2705, baseType: !699, size: 64, offset: 576)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !827, file: !164, line: 2706, baseType: !699, size: 64, offset: 640)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !827, file: !164, line: 2707, baseType: !699, size: 64, offset: 704)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !827, file: !164, line: 2708, baseType: !699, size: 64, offset: 768)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !827, file: !164, line: 2711, baseType: !862, size: 64, offset: 832)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !164, line: 2711, flags: DIFlagFwdDecl)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !701, file: !164, line: 3383, baseType: !865, size: 960)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !164, line: 2756, size: 960, elements: !866)
!866 = !{!867, !868}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !865, file: !164, line: 2757, baseType: !827, size: 896)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !865, file: !164, line: 2758, baseType: !583, size: 64, offset: 896)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !701, file: !164, line: 3384, baseType: !870, size: 1472)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !164, line: 3114, size: 1472, elements: !871)
!871 = !{!872, !893, !894, !895, !896}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !870, file: !164, line: 3115, baseType: !873, size: 1216)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !164, line: 2984, size: 1216, elements: !874)
!874 = !{!875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !873, file: !164, line: 2985, baseType: !865, size: 960)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !873, file: !164, line: 2986, baseType: !699, size: 64, offset: 960)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !873, file: !164, line: 2987, baseType: !699, size: 64, offset: 1024)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !873, file: !164, line: 2988, baseType: !699, size: 64, offset: 1088)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !873, file: !164, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !873, file: !164, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !873, file: !164, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !873, file: !164, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !873, file: !164, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !873, file: !164, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !873, file: !164, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !873, file: !164, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !873, file: !164, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !873, file: !164, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !873, file: !164, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !873, file: !164, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !873, file: !164, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !873, file: !164, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !870, file: !164, line: 3117, baseType: !699, size: 64, offset: 1216)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !870, file: !164, line: 3119, baseType: !699, size: 64, offset: 1280)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !870, file: !164, line: 3121, baseType: !699, size: 64, offset: 1344)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !870, file: !164, line: 3123, baseType: !699, size: 64, offset: 1408)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !701, file: !164, line: 3385, baseType: !898, size: 1088)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !164, line: 2874, size: 1088, elements: !899)
!899 = !{!900, !901, !902}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !898, file: !164, line: 2875, baseType: !865, size: 960)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !898, file: !164, line: 2876, baseType: !583, size: 64, offset: 960)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !898, file: !164, line: 2877, baseType: !903, size: 64, offset: 1024)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !164, line: 2856, flags: DIFlagFwdDecl)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !701, file: !164, line: 3386, baseType: !873, size: 1216)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !701, file: !164, line: 3387, baseType: !907, size: 1280)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !164, line: 3093, size: 1280, elements: !908)
!908 = !{!909, !910}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !907, file: !164, line: 3094, baseType: !873, size: 1216)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !907, file: !164, line: 3095, baseType: !903, size: 64, offset: 1216)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !701, file: !164, line: 3388, baseType: !912, size: 1216)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !164, line: 2824, size: 1216, elements: !913)
!913 = !{!914, !915, !916, !917, !918, !919}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !912, file: !164, line: 2825, baseType: !827, size: 896)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !912, file: !164, line: 2827, baseType: !699, size: 64, offset: 896)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !912, file: !164, line: 2828, baseType: !699, size: 64, offset: 960)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !912, file: !164, line: 2829, baseType: !699, size: 64, offset: 1024)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !912, file: !164, line: 2830, baseType: !699, size: 64, offset: 1088)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !912, file: !164, line: 2831, baseType: !699, size: 64, offset: 1152)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !701, file: !164, line: 3389, baseType: !921, size: 1024)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !164, line: 2850, size: 1024, elements: !922)
!922 = !{!923, !924, !925}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !921, file: !164, line: 2851, baseType: !865, size: 960)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !921, file: !164, line: 2852, baseType: !566, size: 32, offset: 960)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !921, file: !164, line: 2853, baseType: !566, size: 32, offset: 992)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !701, file: !164, line: 3390, baseType: !927, size: 1024)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !164, line: 2857, size: 1024, elements: !928)
!928 = !{!929, !930}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !927, file: !164, line: 2858, baseType: !865, size: 960)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !927, file: !164, line: 2859, baseType: !903, size: 64, offset: 960)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !701, file: !164, line: 3391, baseType: !932, size: 960)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !164, line: 2862, size: 960, elements: !933)
!933 = !{!934}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !932, file: !164, line: 2863, baseType: !865, size: 960)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !701, file: !164, line: 3392, baseType: !936, size: 1472)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !164, line: 3304, size: 1472, elements: !937)
!937 = !{!938}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !936, file: !164, line: 3305, baseType: !870, size: 1472)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !701, file: !164, line: 3393, baseType: !940, size: 1792)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !164, line: 3248, size: 1792, elements: !941)
!941 = !{!942, !943, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !940, file: !164, line: 3249, baseType: !870, size: 1472)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !940, file: !164, line: 3251, baseType: !944, size: 64, offset: 1472)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !946, line: 463, size: 1152, elements: !947)
!946 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!947 = !{!948, !951, !1111, !1112, !1115, !1174, !1175, !1176, !1177, !1178, !1179, !1203, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !945, file: !946, line: 464, baseType: !949, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !946, line: 464, flags: DIFlagFwdDecl)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !945, file: !946, line: 467, baseType: !952, size: 64, offset: 64)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !148, line: 374, size: 640, elements: !954)
!954 = !{!955, !1086, !1087, !1100, !1101, !1102, !1103, !1104, !1105, !1107, !1109, !1110}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !953, file: !148, line: 377, baseType: !956, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !584, line: 111, baseType: !957)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !148, line: 217, size: 832, elements: !959)
!959 = !{!960, !995, !996, !997, !1056, !1060, !1061, !1062, !1080, !1081, !1082, !1083, !1084, !1085}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !958, file: !148, line: 219, baseType: !961, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !148, line: 151, baseType: !963)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !148, line: 151, size: 128, elements: !964)
!964 = !{!965}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !963, file: !148, line: 151, baseType: !966, size: 128)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !148, line: 150, baseType: !967)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !148, line: 150, size: 128, elements: !968)
!968 = !{!969, !970, !971}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !967, file: !148, line: 150, baseType: !7, size: 32)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !967, file: !148, line: 150, baseType: !7, size: 32, offset: 32)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !967, file: !148, line: 150, baseType: !972, size: 64, offset: 64)
!972 = !DICompositeType(tag: DW_TAG_array_type, baseType: !973, size: 64, elements: !618)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !584, line: 108, baseType: !974)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !148, line: 122, size: 512, elements: !976)
!976 = !{!977, !978, !979, !987, !988, !989, !990, !991, !992, !993}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !975, file: !148, line: 124, baseType: !957, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !975, file: !148, line: 125, baseType: !957, size: 64, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !975, file: !148, line: 131, baseType: !980, size: 64, offset: 128)
!980 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !148, line: 128, size: 64, elements: !981)
!981 = !{!982, !986}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !980, file: !148, line: 129, baseType: !983, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !584, line: 66, baseType: !984)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !584, line: 65, flags: DIFlagFwdDecl)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !980, file: !148, line: 130, baseType: !583, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !975, file: !148, line: 134, baseType: !570, size: 64, offset: 192)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !975, file: !148, line: 137, baseType: !699, size: 64, offset: 256)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !975, file: !148, line: 138, baseType: !819, size: 32, offset: 320)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !975, file: !148, line: 142, baseType: !7, size: 32, offset: 352)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !975, file: !148, line: 144, baseType: !566, size: 32, offset: 384)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !975, file: !148, line: 145, baseType: !566, size: 32, offset: 416)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !975, file: !148, line: 146, baseType: !994, size: 64, offset: 448)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !148, line: 119, baseType: !670)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !958, file: !148, line: 220, baseType: !961, size: 64, offset: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !958, file: !148, line: 223, baseType: !570, size: 64, offset: 128)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !958, file: !148, line: 226, baseType: !998, size: 64, offset: 192)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !135, line: 100, size: 1216, elements: !1000)
!1000 = !{!1001, !1002, !1003, !1004, !1005, !1010, !1011, !1012, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1046, !1054, !1055}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !999, file: !135, line: 102, baseType: !566, size: 32)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !999, file: !135, line: 105, baseType: !7, size: 32, offset: 32)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !999, file: !135, line: 108, baseType: !957, size: 64, offset: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !999, file: !135, line: 111, baseType: !957, size: 64, offset: 128)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !999, file: !135, line: 114, baseType: !1006, size: 64, offset: 192)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !135, line: 41, size: 64, elements: !1007)
!1007 = !{!1008, !1009}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1006, file: !135, line: 42, baseType: !134, size: 32)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1006, file: !135, line: 43, baseType: !7, size: 32, offset: 32)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !999, file: !135, line: 117, baseType: !7, size: 32, offset: 256)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !999, file: !135, line: 120, baseType: !7, size: 32, offset: 288)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !999, file: !135, line: 123, baseType: !1013, size: 64, offset: 320)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !135, line: 87, baseType: !1015)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !135, line: 87, size: 128, elements: !1016)
!1016 = !{!1017}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1015, file: !135, line: 87, baseType: !1018, size: 128)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !135, line: 85, baseType: !1019)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !135, line: 85, size: 128, elements: !1020)
!1020 = !{!1021, !1022, !1023}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1019, file: !135, line: 85, baseType: !7, size: 32)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1019, file: !135, line: 85, baseType: !7, size: 32, offset: 32)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1019, file: !135, line: 85, baseType: !1024, size: 64, offset: 64)
!1024 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1025, size: 64, elements: !618)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !135, line: 84, baseType: !998)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !999, file: !135, line: 126, baseType: !998, size: 64, offset: 384)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !999, file: !135, line: 129, baseType: !998, size: 64, offset: 448)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !999, file: !135, line: 132, baseType: !570, size: 64, offset: 512)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !999, file: !135, line: 139, baseType: !699, size: 64, offset: 576)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !999, file: !135, line: 143, baseType: !747, size: 128, offset: 640)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !999, file: !135, line: 146, baseType: !747, size: 128, offset: 768)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !999, file: !135, line: 148, baseType: !565, size: 8, offset: 896)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !999, file: !135, line: 149, baseType: !565, size: 8, offset: 904)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !999, file: !135, line: 153, baseType: !143, size: 32, offset: 928)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !999, file: !135, line: 156, baseType: !1036, size: 64, offset: 960)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !135, line: 48, size: 320, elements: !1038)
!1038 = !{!1039, !1043, !1044, !1045}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1037, file: !135, line: 50, baseType: !1040, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !584, line: 58, baseType: !1041)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !584, line: 57, flags: DIFlagFwdDecl)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1037, file: !135, line: 59, baseType: !747, size: 128, offset: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1037, file: !135, line: 64, baseType: !565, size: 8, offset: 192)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1037, file: !135, line: 67, baseType: !1036, size: 64, offset: 256)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !999, file: !135, line: 159, baseType: !1047, size: 64, offset: 1024)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !135, line: 72, size: 256, elements: !1049)
!1049 = !{!1050, !1051, !1052, !1053}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1048, file: !135, line: 74, baseType: !974, size: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1048, file: !135, line: 77, baseType: !1047, size: 64, offset: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1048, file: !135, line: 78, baseType: !1047, size: 64, offset: 128)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1048, file: !135, line: 81, baseType: !1047, size: 64, offset: 192)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !999, file: !135, line: 162, baseType: !565, size: 8, offset: 1088)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !999, file: !135, line: 166, baseType: !699, size: 64, offset: 1152)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !958, file: !148, line: 229, baseType: !1057, size: 128, offset: 256)
!1057 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1058, size: 128, elements: !654)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !148, line: 229, flags: DIFlagFwdDecl)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !958, file: !148, line: 232, baseType: !957, size: 64, offset: 384)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !958, file: !148, line: 233, baseType: !957, size: 64, offset: 448)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !958, file: !148, line: 238, baseType: !1063, size: 64, offset: 512)
!1063 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !148, line: 235, size: 64, elements: !1064)
!1064 = !{!1065, !1071}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1063, file: !148, line: 236, baseType: !1066, size: 64)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !148, line: 273, size: 128, elements: !1068)
!1068 = !{!1069, !1070}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1067, file: !148, line: 275, baseType: !983, size: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1067, file: !148, line: 278, baseType: !983, size: 64, offset: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1063, file: !148, line: 237, baseType: !1072, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !148, line: 259, size: 320, elements: !1074)
!1074 = !{!1075, !1076, !1077, !1078, !1079}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1073, file: !148, line: 261, baseType: !583, size: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1073, file: !148, line: 262, baseType: !583, size: 64, offset: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1073, file: !148, line: 266, baseType: !583, size: 64, offset: 128)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1073, file: !148, line: 267, baseType: !583, size: 64, offset: 192)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1073, file: !148, line: 270, baseType: !566, size: 32, offset: 256)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !958, file: !148, line: 241, baseType: !994, size: 64, offset: 576)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !958, file: !148, line: 244, baseType: !566, size: 32, offset: 640)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !958, file: !148, line: 247, baseType: !566, size: 32, offset: 672)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !958, file: !148, line: 250, baseType: !566, size: 32, offset: 704)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !958, file: !148, line: 253, baseType: !566, size: 32, offset: 736)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !958, file: !148, line: 256, baseType: !566, size: 32, offset: 768)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !953, file: !148, line: 378, baseType: !956, size: 64, offset: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !953, file: !148, line: 381, baseType: !1088, size: 64, offset: 128)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !148, line: 282, baseType: !1090)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !148, line: 282, size: 128, elements: !1091)
!1091 = !{!1092}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1090, file: !148, line: 282, baseType: !1093, size: 128)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !148, line: 281, baseType: !1094)
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !148, line: 281, size: 128, elements: !1095)
!1095 = !{!1096, !1097, !1098}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1094, file: !148, line: 281, baseType: !7, size: 32)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1094, file: !148, line: 281, baseType: !7, size: 32, offset: 32)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1094, file: !148, line: 281, baseType: !1099, size: 64, offset: 64)
!1099 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 64, elements: !618)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !953, file: !148, line: 384, baseType: !566, size: 32, offset: 192)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !953, file: !148, line: 387, baseType: !566, size: 32, offset: 224)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !953, file: !148, line: 390, baseType: !566, size: 32, offset: 256)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !953, file: !148, line: 394, baseType: !1088, size: 64, offset: 320)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !953, file: !148, line: 396, baseType: !147, size: 32, offset: 384)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !953, file: !148, line: 399, baseType: !1106, size: 64, offset: 416)
!1106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 64, elements: !654)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !953, file: !148, line: 402, baseType: !1108, size: 64, offset: 480)
!1108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !654)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !953, file: !148, line: 406, baseType: !566, size: 32, offset: 544)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !953, file: !148, line: 409, baseType: !566, size: 32, offset: 576)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !945, file: !946, line: 470, baseType: !984, size: 64, offset: 128)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !945, file: !946, line: 473, baseType: !1113, size: 64, offset: 192)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1114 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !946, line: 166, flags: DIFlagFwdDecl)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !945, file: !946, line: 476, baseType: !1116, size: 64, offset: 256)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !135, line: 187, size: 256, elements: !1118)
!1118 = !{!1119, !1120, !1121, !1173}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1117, file: !135, line: 189, baseType: !566, size: 32)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !1117, file: !135, line: 192, baseType: !1013, size: 64, offset: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1117, file: !135, line: 197, baseType: !1122, size: 64, offset: 128)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1123, line: 144, baseType: !1124)
!1123 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64)
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1123, line: 100, size: 896, elements: !1126)
!1126 = !{!1127, !1135, !1140, !1145, !1147, !1150, !1151, !1152, !1153, !1154, !1159, !1161, !1162, !1167, !1172}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1125, file: !1123, line: 102, baseType: !1128, size: 64)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1123, line: 52, baseType: !1129)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64)
!1130 = !DISubroutineType(types: !1131)
!1131 = !{!1132, !1133}
!1132 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1123, line: 47, baseType: !7)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64)
!1134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1125, file: !1123, line: 105, baseType: !1136, size: 64, offset: 64)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1123, line: 59, baseType: !1137)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64)
!1138 = !DISubroutineType(types: !1139)
!1139 = !{!566, !1133, !1133}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1125, file: !1123, line: 108, baseType: !1141, size: 64, offset: 128)
!1141 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1123, line: 63, baseType: !1142)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64)
!1143 = !DISubroutineType(types: !1144)
!1144 = !{null, !570}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1125, file: !1123, line: 111, baseType: !1146, size: 64, offset: 192)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1125, file: !1123, line: 114, baseType: !1148, size: 64, offset: 256)
!1148 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1149, line: 46, baseType: !653)
!1149 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1125, file: !1123, line: 117, baseType: !1148, size: 64, offset: 320)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1125, file: !1123, line: 120, baseType: !1148, size: 64, offset: 384)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1125, file: !1123, line: 124, baseType: !7, size: 32, offset: 448)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1125, file: !1123, line: 128, baseType: !7, size: 32, offset: 480)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1125, file: !1123, line: 131, baseType: !1155, size: 64, offset: 512)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1123, line: 75, baseType: !1156)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = !DISubroutineType(types: !1158)
!1158 = !{!570, !1148, !1148}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1125, file: !1123, line: 132, baseType: !1160, size: 64, offset: 576)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1123, line: 78, baseType: !1142)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1125, file: !1123, line: 135, baseType: !570, size: 64, offset: 640)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1125, file: !1123, line: 136, baseType: !1163, size: 64, offset: 704)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1123, line: 82, baseType: !1164)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64)
!1165 = !DISubroutineType(types: !1166)
!1166 = !{!570, !570, !1148, !1148}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1125, file: !1123, line: 137, baseType: !1168, size: 64, offset: 768)
!1168 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1123, line: 83, baseType: !1169)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64)
!1170 = !DISubroutineType(types: !1171)
!1171 = !{null, !570, !570}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1125, file: !1123, line: 141, baseType: !7, size: 32, offset: 832)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !1117, file: !135, line: 200, baseType: !998, size: 64, offset: 192)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !945, file: !946, line: 479, baseType: !1122, size: 64, offset: 320)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !945, file: !946, line: 484, baseType: !699, size: 64, offset: 384)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !945, file: !946, line: 488, baseType: !699, size: 64, offset: 448)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !945, file: !946, line: 493, baseType: !699, size: 64, offset: 512)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !945, file: !946, line: 496, baseType: !699, size: 64, offset: 576)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !945, file: !946, line: 501, baseType: !1180, size: 64, offset: 640)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64)
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !159, line: 2355, size: 576, elements: !1182)
!1182 = !{!1183, !1186, !1187, !1188, !1189, !1191, !1192, !1197, !1198, !1199, !1200, !1201, !1202}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1181, file: !159, line: 2356, baseType: !1184, size: 64)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !159, line: 2356, flags: DIFlagFwdDecl)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1181, file: !159, line: 2357, baseType: !571, size: 64, offset: 64)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1181, file: !159, line: 2358, baseType: !566, size: 32, offset: 128)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1181, file: !159, line: 2359, baseType: !566, size: 32, offset: 160)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1181, file: !159, line: 2360, baseType: !1190, size: 128, offset: 192)
!1190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 128, elements: !679)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1181, file: !159, line: 2364, baseType: !566, size: 32, offset: 320)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1181, file: !159, line: 2367, baseType: !1193, size: 128, offset: 384)
!1193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !159, line: 2349, size: 128, elements: !1194)
!1194 = !{!1195, !1196}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1193, file: !159, line: 2351, baseType: !583, size: 64)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1193, file: !159, line: 2352, baseType: !670, size: 64, offset: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1181, file: !159, line: 2371, baseType: !158, size: 32, offset: 512)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1181, file: !159, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1181, file: !159, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1181, file: !159, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1181, file: !159, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1181, file: !159, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !945, file: !946, line: 504, baseType: !1204, size: 64, offset: 704)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64)
!1205 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !946, line: 504, flags: DIFlagFwdDecl)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !945, file: !946, line: 507, baseType: !1122, size: 64, offset: 768)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !945, file: !946, line: 510, baseType: !566, size: 32, offset: 832)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !945, file: !946, line: 513, baseType: !566, size: 32, offset: 864)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !945, file: !946, line: 516, baseType: !819, size: 32, offset: 896)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !945, file: !946, line: 519, baseType: !819, size: 32, offset: 928)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !945, file: !946, line: 522, baseType: !7, size: 32, offset: 960)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !945, file: !946, line: 523, baseType: !7, size: 32, offset: 992)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !945, file: !946, line: 528, baseType: !571, size: 64, offset: 1024)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !945, file: !946, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !945, file: !946, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !945, file: !946, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !945, file: !946, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !945, file: !946, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !945, file: !946, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !945, file: !946, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !945, file: !946, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !945, file: !946, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !945, file: !946, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !945, file: !946, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !945, file: !946, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !945, file: !946, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !945, file: !946, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !945, file: !946, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !945, file: !946, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !940, file: !164, line: 3254, baseType: !699, size: 64, offset: 1536)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !940, file: !164, line: 3257, baseType: !699, size: 64, offset: 1600)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !940, file: !164, line: 3258, baseType: !699, size: 64, offset: 1664)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !940, file: !164, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !940, file: !164, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !940, file: !164, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !940, file: !164, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !940, file: !164, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !940, file: !164, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !940, file: !164, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !940, file: !164, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !940, file: !164, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !940, file: !164, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !940, file: !164, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !940, file: !164, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !940, file: !164, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !940, file: !164, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !940, file: !164, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !940, file: !164, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !940, file: !164, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !940, file: !164, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !701, file: !164, line: 3394, baseType: !1252, size: 1344)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !164, line: 2279, size: 1344, elements: !1253)
!1253 = !{!1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1279, !1280, !1281, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1252, file: !164, line: 2280, baseType: !737, size: 192)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1252, file: !164, line: 2281, baseType: !699, size: 64, offset: 192)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1252, file: !164, line: 2282, baseType: !699, size: 64, offset: 256)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1252, file: !164, line: 2283, baseType: !699, size: 64, offset: 320)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1252, file: !164, line: 2284, baseType: !699, size: 64, offset: 384)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1252, file: !164, line: 2285, baseType: !7, size: 32, offset: 448)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1252, file: !164, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1252, file: !164, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1252, file: !164, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1252, file: !164, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1252, file: !164, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1252, file: !164, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1252, file: !164, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1252, file: !164, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1252, file: !164, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1252, file: !164, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1252, file: !164, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1252, file: !164, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1252, file: !164, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1252, file: !164, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1252, file: !164, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1252, file: !164, line: 2305, baseType: !7, size: 32, offset: 512)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1252, file: !164, line: 2306, baseType: !1277, size: 32, offset: 544)
!1277 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1278, line: 31, baseType: !566)
!1278 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1252, file: !164, line: 2307, baseType: !699, size: 64, offset: 576)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1252, file: !164, line: 2308, baseType: !699, size: 64, offset: 640)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1252, file: !164, line: 2314, baseType: !1282, size: 64, offset: 704)
!1282 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !164, line: 2309, size: 64, elements: !1283)
!1283 = !{!1284, !1285, !1286}
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1282, file: !164, line: 2310, baseType: !566, size: 32)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1282, file: !164, line: 2311, baseType: !571, size: 64)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1282, file: !164, line: 2312, baseType: !1287, size: 64)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64)
!1288 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !164, line: 2277, flags: DIFlagFwdDecl)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1252, file: !164, line: 2315, baseType: !699, size: 64, offset: 768)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1252, file: !164, line: 2316, baseType: !699, size: 64, offset: 832)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1252, file: !164, line: 2317, baseType: !699, size: 64, offset: 896)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1252, file: !164, line: 2318, baseType: !699, size: 64, offset: 960)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1252, file: !164, line: 2319, baseType: !699, size: 64, offset: 1024)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1252, file: !164, line: 2320, baseType: !699, size: 64, offset: 1088)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1252, file: !164, line: 2321, baseType: !699, size: 64, offset: 1152)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1252, file: !164, line: 2322, baseType: !699, size: 64, offset: 1216)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1252, file: !164, line: 2324, baseType: !1298, size: 64, offset: 1280)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64)
!1299 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !164, line: 2324, flags: DIFlagFwdDecl)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !701, file: !164, line: 3395, baseType: !1301, size: 320)
!1301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !164, line: 1469, size: 320, elements: !1302)
!1302 = !{!1303, !1304, !1305}
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1301, file: !164, line: 1470, baseType: !737, size: 192)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1301, file: !164, line: 1471, baseType: !699, size: 64, offset: 192)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1301, file: !164, line: 1472, baseType: !699, size: 64, offset: 256)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !701, file: !164, line: 3396, baseType: !1307, size: 320)
!1307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !164, line: 1482, size: 320, elements: !1308)
!1308 = !{!1309, !1310, !1311}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1307, file: !164, line: 1483, baseType: !737, size: 192)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1307, file: !164, line: 1484, baseType: !566, size: 32, offset: 192)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1307, file: !164, line: 1485, baseType: !1312, size: 64, offset: 256)
!1312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !699, size: 64, elements: !618)
