; ModuleID = 'ira-lives.bc'
source_filename = "ira-lives.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.recog_data = type { [30 x %struct.rtx_def*], [30 x %struct.rtx_def**], [30 x i8*], [30 x i32], [30 x i32], [14 x %struct.rtx_def**], [14 x i8], i8, i8, i8, [30 x i8], %struct.rtx_def* }
%struct.rtx_def = type { i32, %union.u }
%union.u = type { %struct.block_symbol }
%struct.block_symbol = type { [3 x %union.rtunion_def], %struct.object_block*, i64 }
%union.rtunion_def = type { i8* }
%struct.object_block = type { %union.section*, i32, i64, %struct.VEC_rtx_gc*, %struct.VEC_rtx_gc* }
%union.section = type opaque
%struct.VEC_rtx_gc = type { %struct.VEC_rtx_base }
%struct.VEC_rtx_base = type { i32, i32, [1 x %struct.rtx_def*] }
%struct.ira_allocno_live_range = type { %struct.ira_allocno*, i32, i32, %struct.ira_allocno_live_range*, %struct.ira_allocno_live_range*, %struct.ira_allocno_live_range* }

!548 = !DIEnumerator(name: "PARITY", value: 118, isUnsigned: true)
!549 = !DIEnumerator(name: "SIGN_EXTRACT", value: 119, isUnsigned: true)
!550 = !DIEnumerator(name: "ZERO_EXTRACT", value: 120, isUnsigned: true)
!551 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!552 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!553 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!554 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!555 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!556 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!557 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!558 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!559 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!560 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!561 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!562 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!563 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!564 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!565 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!566 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!567 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!568 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!569 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!570 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mode_class", file: !571, line: 36, baseType: !7, size: 32, elements: !572)
!571 = !DIFile(filename: "./machmode.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!572 = !{!573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591}
!573 = !DIEnumerator(name: "MODE_RANDOM", value: 0, isUnsigned: true)
!574 = !DIEnumerator(name: "MODE_CC", value: 1, isUnsigned: true)
!575 = !DIEnumerator(name: "MODE_INT", value: 2, isUnsigned: true)
!576 = !DIEnumerator(name: "MODE_PARTIAL_INT", value: 3, isUnsigned: true)
!577 = !DIEnumerator(name: "MODE_FRACT", value: 4, isUnsigned: true)
!578 = !DIEnumerator(name: "MODE_UFRACT", value: 5, isUnsigned: true)
!579 = !DIEnumerator(name: "MODE_ACCUM", value: 6, isUnsigned: true)
!580 = !DIEnumerator(name: "MODE_UACCUM", value: 7, isUnsigned: true)
!581 = !DIEnumerator(name: "MODE_FLOAT", value: 8, isUnsigned: true)
!582 = !DIEnumerator(name: "MODE_DECIMAL_FLOAT", value: 9, isUnsigned: true)
!583 = !DIEnumerator(name: "MODE_COMPLEX_INT", value: 10, isUnsigned: true)
!584 = !DIEnumerator(name: "MODE_COMPLEX_FLOAT", value: 11, isUnsigned: true)
!585 = !DIEnumerator(name: "MODE_VECTOR_INT", value: 12, isUnsigned: true)
!586 = !DIEnumerator(name: "MODE_VECTOR_FRACT", value: 13, isUnsigned: true)
!587 = !DIEnumerator(name: "MODE_VECTOR_UFRACT", value: 14, isUnsigned: true)
!588 = !DIEnumerator(name: "MODE_VECTOR_ACCUM", value: 15, isUnsigned: true)
!589 = !DIEnumerator(name: "MODE_VECTOR_UACCUM", value: 16, isUnsigned: true)
!590 = !DIEnumerator(name: "MODE_VECTOR_FLOAT", value: 17, isUnsigned: true)
!591 = !DIEnumerator(name: "MAX_MODE_CLASS", value: 18, isUnsigned: true)
!592 = !{!593, !594, !595, !596, !599, !600, !602, !427, !37, !605, !606, !622, !7, !1908, !570, !1916}
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!595 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !598)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "HARD_REG_ELT_TYPE", file: !603, line: 42, baseType: !604)
!603 = !DIFile(filename: "./hard-reg-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!604 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocno_live_range_t", file: !608, line: 62, baseType: !609)
!608 = !DIFile(filename: "./ira-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ira_allocno_live_range", file: !608, line: 199, size: 320, elements: !611)
!611 = !{!612, !1903, !1904, !1905, !1906, !1907}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "allocno", scope: !610, file: !608, line: 202, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "ira_allocno_t", file: !608, line: 63, baseType: !614)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ira_allocno", file: !608, line: 232, size: 1984, elements: !616)
!616 = !{!617, !618, !619, !620, !621, !1815, !1816, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1894, !1895, !1896, !1897, !1898, !1899, !1900, !1901, !1902}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !615, file: !608, line: 237, baseType: !595, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "regno", scope: !615, file: !608, line: 239, baseType: !595, size: 32, offset: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !615, file: !608, line: 242, baseType: !37, size: 32, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "hard_regno", scope: !615, file: !608, line: 249, baseType: !595, size: 32, offset: 96)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !615, file: !608, line: 251, baseType: !622, size: 64, offset: 128)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !623, line: 50, baseType: !624)
!623 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !428, line: 240, size: 384, elements: !626)
!626 = !{!627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !625, file: !428, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !625, file: !428, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !625, file: !428, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !625, file: !428, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !625, file: !428, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !625, file: !428, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !625, file: !428, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !625, file: !428, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !625, file: !428, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !625, file: !428, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !625, file: !428, line: 321, baseType: !638, size: 320, offset: 64)
!638 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !428, line: 315, size: 320, elements: !639)
!639 = !{!640, !1782, !1784, !1813, !1814}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !638, file: !428, line: 316, baseType: !641, size: 64)
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !642, size: 64, elements: !657)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !428, line: 183, baseType: !643)
!643 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !428, line: 166, size: 64, elements: !644)
!644 = !{!645, !646, !647, !648, !649, !659, !660, !672, !675, !736, !1760, !1761, !1772, !1779}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !643, file: !428, line: 168, baseType: !595, size: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !643, file: !428, line: 169, baseType: !7, size: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !643, file: !428, line: 170, baseType: !600, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !643, file: !428, line: 171, baseType: !622, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !643, file: !428, line: 172, baseType: !650, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !623, line: 53, baseType: !651)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !428, line: 359, size: 128, elements: !653)
!653 = !{!654, !655}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !652, file: !428, line: 360, baseType: !595, size: 32)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !652, file: !428, line: 361, baseType: !656, size: 64, offset: 64)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 64, elements: !657)
!657 = !{!658}
!658 = !DISubrange(count: 1)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !643, file: !428, line: 173, baseType: !37, size: 32)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !643, file: !428, line: 174, baseType: !661, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !428, line: 133, baseType: !662)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !428, line: 115, size: 32, elements: !663)
!663 = !{!664, !665, !666, !667, !668, !669, !670, !671}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !662, file: !428, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !662, file: !428, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !662, file: !428, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !662, file: !428, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !662, file: !428, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !662, file: !428, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !662, file: !428, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !662, file: !428, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !643, file: !428, line: 175, baseType: !673, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !428, line: 175, flags: DIFlagFwdDecl)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !643, file: !428, line: 176, baseType: !676, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !678, line: 75, size: 256, elements: !679)
!678 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!679 = !{!680, !694, !695, !696}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !677, file: !678, line: 76, baseType: !681, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !678, line: 68, baseType: !683)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !678, line: 63, size: 320, elements: !684)
!684 = !{!685, !687, !688, !689}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !683, file: !678, line: 64, baseType: !686, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !683, file: !678, line: 65, baseType: !686, size: 64, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !683, file: !678, line: 66, baseType: !7, size: 32, offset: 128)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !683, file: !678, line: 67, baseType: !690, size: 128, offset: 192)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !691, size: 128, elements: !692)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !678, line: 29, baseType: !604)
!692 = !{!693}
!693 = !DISubrange(count: 2)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !677, file: !678, line: 77, baseType: !681, size: 64, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !677, file: !678, line: 78, baseType: !7, size: 32, offset: 128)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !677, file: !678, line: 79, baseType: !697, size: 64, offset: 192)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !678, line: 49, baseType: !699)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !678, line: 45, size: 832, elements: !700)
!700 = !{!701, !702, !703}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !699, file: !678, line: 46, baseType: !686, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !699, file: !678, line: 47, baseType: !676, size: 64, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !699, file: !678, line: 48, baseType: !704, size: 704, offset: 128)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !705, line: 164, size: 704, elements: !706)
!705 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!706 = !{!707, !709, !719, !720, !721, !722, !723, !724, !728, !732, !733, !734, !735}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !704, file: !705, line: 166, baseType: !708, size: 64)
!708 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !704, file: !705, line: 167, baseType: !710, size: 64, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !705, line: 157, size: 192, elements: !712)
!712 = !{!713, !714, !715}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !711, file: !705, line: 159, baseType: !597, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !711, file: !705, line: 160, baseType: !710, size: 64, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !711, file: !705, line: 161, baseType: !716, size: 32, offset: 128)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !598, size: 32, elements: !717)
!717 = !{!718}
!718 = !DISubrange(count: 4)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !704, file: !705, line: 168, baseType: !597, size: 64, offset: 128)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !704, file: !705, line: 169, baseType: !597, size: 64, offset: 192)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !704, file: !705, line: 170, baseType: !597, size: 64, offset: 256)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !704, file: !705, line: 171, baseType: !708, size: 64, offset: 320)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !704, file: !705, line: 172, baseType: !595, size: 32, offset: 384)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !704, file: !705, line: 176, baseType: !725, size: 64, offset: 448)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DISubroutineType(types: !727)
!727 = !{!710, !599, !708}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !704, file: !705, line: 177, baseType: !729, size: 64, offset: 512)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{null, !599, !710}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !704, file: !705, line: 178, baseType: !599, size: 64, offset: 576)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !704, file: !705, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !704, file: !705, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !704, file: !705, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !643, file: !428, line: 177, baseType: !737, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !623, line: 56, baseType: !738)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !201, line: 3371, size: 1792, elements: !740)
!740 = !{!741, !774, !780, !791, !810, !821, !826, !833, !839, !852, !864, !902, !907, !935, !943, !944, !949, !958, !964, !969, !973, !977, !1399, !1448, !1454, !1460, !1467, !1490, !1504, !1521, !1533, !1555, !1570, !1742}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !739, file: !201, line: 3372, baseType: !742, size: 64)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !201, line: 360, size: 64, elements: !743)
!743 = !{!744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !742, file: !201, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !742, file: !201, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !742, file: !201, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !742, file: !201, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !742, file: !201, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !742, file: !201, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !742, file: !201, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !742, file: !201, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !742, file: !201, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !742, file: !201, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !742, file: !201, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !742, file: !201, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !742, file: !201, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !742, file: !201, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !742, file: !201, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !742, file: !201, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !742, file: !201, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !742, file: !201, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !742, file: !201, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !742, file: !201, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !742, file: !201, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !742, file: !201, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !742, file: !201, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !742, file: !201, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !742, file: !201, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !742, file: !201, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !742, file: !201, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !742, file: !201, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !742, file: !201, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !742, file: !201, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !739, file: !201, line: 3373, baseType: !775, size: 192)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !201, line: 402, size: 192, elements: !776)
!776 = !{!777, !778, !779}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !775, file: !201, line: 403, baseType: !742, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !775, file: !201, line: 404, baseType: !737, size: 64, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !775, file: !201, line: 405, baseType: !737, size: 64, offset: 128)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !739, file: !201, line: 3374, baseType: !781, size: 320)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !201, line: 1384, size: 320, elements: !782)
!782 = !{!783, !784}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !781, file: !201, line: 1385, baseType: !775, size: 192)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !781, file: !201, line: 1386, baseType: !785, size: 128, offset: 192)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !786, line: 58, baseType: !787)
!786 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !786, line: 54, size: 128, elements: !788)
!788 = !{!789, !790}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !787, file: !786, line: 56, baseType: !604, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !787, file: !786, line: 57, baseType: !708, size: 64, offset: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !739, file: !201, line: 3375, baseType: !792, size: 256)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !201, line: 1397, size: 256, elements: !793)
!793 = !{!794, !795}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !792, file: !201, line: 1398, baseType: !775, size: 192)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !792, file: !201, line: 1399, baseType: !796, size: 64, offset: 192)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !798, line: 52, size: 256, elements: !799)
!798 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!799 = !{!800, !801, !802, !803, !804, !805, !806}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !797, file: !798, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !797, file: !798, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !797, file: !798, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !797, file: !798, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !797, file: !798, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !797, file: !798, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !797, file: !798, line: 62, baseType: !807, size: 192, offset: 64)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !604, size: 192, elements: !808)
!808 = !{!809}
!809 = !DISubrange(count: 3)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !739, file: !201, line: 3376, baseType: !811, size: 256)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !201, line: 1408, size: 256, elements: !812)
!812 = !{!813, !814}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !811, file: !201, line: 1409, baseType: !775, size: 192)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !811, file: !201, line: 1410, baseType: !815, size: 64, offset: 192)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !817, line: 27, size: 192, elements: !818)
!817 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!818 = !{!819, !820}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !816, file: !817, line: 29, baseType: !785, size: 128)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !816, file: !817, line: 30, baseType: !37, size: 32, offset: 128)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !739, file: !201, line: 3377, baseType: !822, size: 256)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !201, line: 1437, size: 256, elements: !823)
!823 = !{!824, !825}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !822, file: !201, line: 1438, baseType: !775, size: 192)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !822, file: !201, line: 1439, baseType: !737, size: 64, offset: 192)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !739, file: !201, line: 3378, baseType: !827, size: 256)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !201, line: 1418, size: 256, elements: !828)
!828 = !{!829, !830, !831}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !827, file: !201, line: 1419, baseType: !775, size: 192)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !827, file: !201, line: 1420, baseType: !595, size: 32, offset: 192)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !827, file: !201, line: 1421, baseType: !832, size: 8, offset: 224)
!832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !598, size: 8, elements: !657)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !739, file: !201, line: 3379, baseType: !834, size: 320)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !201, line: 1428, size: 320, elements: !835)
!835 = !{!836, !837, !838}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !834, file: !201, line: 1429, baseType: !775, size: 192)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !834, file: !201, line: 1430, baseType: !737, size: 64, offset: 192)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !834, file: !201, line: 1431, baseType: !737, size: 64, offset: 256)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !739, file: !201, line: 3380, baseType: !840, size: 320)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !201, line: 1460, size: 320, elements: !841)
!841 = !{!842, !843}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !840, file: !201, line: 1461, baseType: !775, size: 192)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !840, file: !201, line: 1462, baseType: !844, size: 128, offset: 192)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !845, line: 31, size: 128, elements: !846)
!845 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!846 = !{!847, !850, !851}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !844, file: !845, line: 32, baseType: !848, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !594)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !844, file: !845, line: 33, baseType: !7, size: 32, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !844, file: !845, line: 34, baseType: !7, size: 32, offset: 96)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !739, file: !201, line: 3381, baseType: !853, size: 384)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !201, line: 2507, size: 384, elements: !854)
!854 = !{!855, !856, !861, !862, !863}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !853, file: !201, line: 2508, baseType: !775, size: 192)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !853, file: !201, line: 2509, baseType: !857, size: 32, offset: 192)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !858, line: 58, baseType: !859)
!858 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !860, line: 44, baseType: !7)
!860 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!861 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !853, file: !201, line: 2510, baseType: !7, size: 32, offset: 224)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !853, file: !201, line: 2511, baseType: !737, size: 64, offset: 256)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !853, file: !201, line: 2512, baseType: !737, size: 64, offset: 320)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !739, file: !201, line: 3382, baseType: !865, size: 896)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !201, line: 2652, size: 896, elements: !866)
!866 = !{!867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !865, file: !201, line: 2653, baseType: !853, size: 384)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !865, file: !201, line: 2654, baseType: !737, size: 64, offset: 384)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !865, file: !201, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !865, file: !201, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !865, file: !201, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !865, file: !201, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !865, file: !201, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !865, file: !201, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !865, file: !201, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !865, file: !201, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !865, file: !201, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !865, file: !201, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !865, file: !201, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !865, file: !201, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !865, file: !201, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !865, file: !201, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !865, file: !201, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !865, file: !201, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !865, file: !201, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !865, file: !201, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !865, file: !201, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !865, file: !201, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !865, file: !201, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !865, file: !201, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !865, file: !201, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !865, file: !201, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !865, file: !201, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !865, file: !201, line: 2703, baseType: !7, size: 32, offset: 512)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !865, file: !201, line: 2705, baseType: !737, size: 64, offset: 576)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !865, file: !201, line: 2706, baseType: !737, size: 64, offset: 640)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !865, file: !201, line: 2707, baseType: !737, size: 64, offset: 704)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !865, file: !201, line: 2708, baseType: !737, size: 64, offset: 768)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !865, file: !201, line: 2711, baseType: !900, size: 64, offset: 832)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !201, line: 2711, flags: DIFlagFwdDecl)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !739, file: !201, line: 3383, baseType: !903, size: 960)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !201, line: 2756, size: 960, elements: !904)
!904 = !{!905, !906}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !903, file: !201, line: 2757, baseType: !865, size: 896)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !903, file: !201, line: 2758, baseType: !622, size: 64, offset: 896)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !739, file: !201, line: 3384, baseType: !908, size: 1472)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !201, line: 3114, size: 1472, elements: !909)
!909 = !{!910, !931, !932, !933, !934}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !908, file: !201, line: 3115, baseType: !911, size: 1216)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !201, line: 2984, size: 1216, elements: !912)
!912 = !{!913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !911, file: !201, line: 2985, baseType: !903, size: 960)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !911, file: !201, line: 2986, baseType: !737, size: 64, offset: 960)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !911, file: !201, line: 2987, baseType: !737, size: 64, offset: 1024)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !911, file: !201, line: 2988, baseType: !737, size: 64, offset: 1088)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !911, file: !201, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !911, file: !201, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !911, file: !201, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !911, file: !201, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !911, file: !201, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !911, file: !201, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !911, file: !201, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !911, file: !201, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !911, file: !201, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !911, file: !201, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !911, file: !201, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !911, file: !201, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !911, file: !201, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !911, file: !201, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !908, file: !201, line: 3117, baseType: !737, size: 64, offset: 1216)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !908, file: !201, line: 3119, baseType: !737, size: 64, offset: 1280)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !908, file: !201, line: 3121, baseType: !737, size: 64, offset: 1344)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !908, file: !201, line: 3123, baseType: !737, size: 64, offset: 1408)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !739, file: !201, line: 3385, baseType: !936, size: 1088)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !201, line: 2874, size: 1088, elements: !937)
!937 = !{!938, !939, !940}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !936, file: !201, line: 2875, baseType: !903, size: 960)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !936, file: !201, line: 2876, baseType: !622, size: 64, offset: 960)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !936, file: !201, line: 2877, baseType: !941, size: 64, offset: 1024)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !201, line: 2856, flags: DIFlagFwdDecl)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !739, file: !201, line: 3386, baseType: !911, size: 1216)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !739, file: !201, line: 3387, baseType: !945, size: 1280)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !201, line: 3093, size: 1280, elements: !946)
!946 = !{!947, !948}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !945, file: !201, line: 3094, baseType: !911, size: 1216)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !945, file: !201, line: 3095, baseType: !941, size: 64, offset: 1216)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !739, file: !201, line: 3388, baseType: !950, size: 1216)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !201, line: 2824, size: 1216, elements: !951)
!951 = !{!952, !953, !954, !955, !956, !957}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !950, file: !201, line: 2825, baseType: !865, size: 896)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !950, file: !201, line: 2827, baseType: !737, size: 64, offset: 896)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !950, file: !201, line: 2828, baseType: !737, size: 64, offset: 960)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !950, file: !201, line: 2829, baseType: !737, size: 64, offset: 1024)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !950, file: !201, line: 2830, baseType: !737, size: 64, offset: 1088)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !950, file: !201, line: 2831, baseType: !737, size: 64, offset: 1152)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !739, file: !201, line: 3389, baseType: !959, size: 1024)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !201, line: 2850, size: 1024, elements: !960)
!960 = !{!961, !962, !963}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !959, file: !201, line: 2851, baseType: !903, size: 960)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !959, file: !201, line: 2852, baseType: !595, size: 32, offset: 960)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !959, file: !201, line: 2853, baseType: !595, size: 32, offset: 992)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !739, file: !201, line: 3390, baseType: !965, size: 1024)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !201, line: 2857, size: 1024, elements: !966)
!966 = !{!967, !968}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !965, file: !201, line: 2858, baseType: !903, size: 960)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !965, file: !201, line: 2859, baseType: !941, size: 64, offset: 960)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !739, file: !201, line: 3391, baseType: !970, size: 960)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !201, line: 2862, size: 960, elements: !971)
!971 = !{!972}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !970, file: !201, line: 2863, baseType: !903, size: 960)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !739, file: !201, line: 3392, baseType: !974, size: 1472)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !201, line: 3304, size: 1472, elements: !975)
!975 = !{!976}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !974, file: !201, line: 3305, baseType: !908, size: 1472)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !739, file: !201, line: 3393, baseType: !978, size: 1792)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !201, line: 3248, size: 1792, elements: !979)
!979 = !{!980, !981, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !978, file: !201, line: 3249, baseType: !908, size: 1472)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !978, file: !201, line: 3251, baseType: !982, size: 64, offset: 1472)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !984, line: 463, size: 1152, elements: !985)
!984 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!985 = !{!986, !1150, !1310, !1311, !1314, !1322, !1323, !1324, !1325, !1326, !1327, !1351, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !983, file: !984, line: 464, baseType: !987, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !166, line: 194, size: 384, elements: !989)
!989 = !{!990, !1039, !1052, !1066, !1118, !1131}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !988, file: !166, line: 197, baseType: !991, size: 64)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !166, line: 182, baseType: !992)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !166, line: 116, size: 704, elements: !994)
!994 = !{!995, !996, !997, !998, !999, !1000, !1027, !1036, !1037, !1038}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !993, file: !166, line: 119, baseType: !992, size: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !993, file: !166, line: 122, baseType: !992, size: 64, offset: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !993, file: !166, line: 123, baseType: !992, size: 64, offset: 128)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !993, file: !166, line: 126, baseType: !595, size: 32, offset: 192)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !993, file: !166, line: 129, baseType: !165, size: 32, offset: 224)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !993, file: !166, line: 165, baseType: !1001, size: 192, offset: 256)
!1001 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !166, line: 132, size: 192, elements: !1002)
!1002 = !{!1003, !1016, !1022}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !1001, file: !166, line: 137, baseType: !1004, size: 128)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !166, line: 133, size: 128, elements: !1005)
!1005 = !{!1006, !1015}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !1004, file: !166, line: 135, baseType: !1007, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !166, line: 93, size: 320, elements: !1009)
!1009 = !{!1010, !1011, !1012, !1013, !1014}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !1008, file: !166, line: 96, baseType: !1007, size: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !1008, file: !166, line: 97, baseType: !1007, size: 64, offset: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1008, file: !166, line: 101, baseType: !737, size: 64, offset: 128)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !1008, file: !166, line: 106, baseType: !737, size: 64, offset: 192)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1008, file: !166, line: 111, baseType: !737, size: 64, offset: 256)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !1004, file: !166, line: 136, baseType: !1007, size: 64, offset: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !1001, file: !166, line: 151, baseType: !1017, size: 192)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !166, line: 139, size: 192, elements: !1018)
!1018 = !{!1019, !1020, !1021}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1017, file: !166, line: 141, baseType: !737, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1017, file: !166, line: 145, baseType: !737, size: 64, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1017, file: !166, line: 150, baseType: !595, size: 32, offset: 128)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !1001, file: !166, line: 164, baseType: !1023, size: 128)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !166, line: 153, size: 128, elements: !1024)
!1024 = !{!1025, !1026}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !1023, file: !166, line: 161, baseType: !737, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !1023, file: !166, line: 163, baseType: !857, size: 32, offset: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !993, file: !166, line: 168, baseType: !1028, size: 64, offset: 448)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !166, line: 67, size: 320, elements: !1030)
!1030 = !{!1031, !1032, !1033, !1034, !1035}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !1029, file: !166, line: 70, baseType: !1028, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1029, file: !166, line: 73, baseType: !992, size: 64, offset: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !1029, file: !166, line: 78, baseType: !737, size: 64, offset: 128)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !1029, file: !166, line: 85, baseType: !622, size: 64, offset: 192)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1029, file: !166, line: 88, baseType: !595, size: 32, offset: 256)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !993, file: !166, line: 173, baseType: !622, size: 64, offset: 512)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !993, file: !166, line: 173, baseType: !622, size: 64, offset: 576)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !993, file: !166, line: 177, baseType: !594, size: 8, offset: 640)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !988, file: !166, line: 200, baseType: !1040, size: 64, offset: 64)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !166, line: 185, baseType: !1042)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !166, line: 185, size: 128, elements: !1043)
!1043 = !{!1044}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1042, file: !166, line: 185, baseType: !1045, size: 128)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !166, line: 184, baseType: !1046)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !166, line: 184, size: 128, elements: !1047)
!1047 = !{!1048, !1049, !1050}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1046, file: !166, line: 184, baseType: !7, size: 32)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1046, file: !166, line: 184, baseType: !7, size: 32, offset: 32)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1046, file: !166, line: 184, baseType: !1051, size: 64, offset: 64)
!1051 = !DICompositeType(tag: DW_TAG_array_type, baseType: !991, size: 64, elements: !657)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !988, file: !166, line: 203, baseType: !1053, size: 64, offset: 128)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !166, line: 189, baseType: !1055)
!1055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !166, line: 189, size: 128, elements: !1056)
!1056 = !{!1057}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1055, file: !166, line: 189, baseType: !1058, size: 128)
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !166, line: 188, baseType: !1059)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !166, line: 188, size: 128, elements: !1060)
!1060 = !{!1061, !1062, !1063}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1059, file: !166, line: 188, baseType: !7, size: 32)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1059, file: !166, line: 188, baseType: !7, size: 32, offset: 32)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1059, file: !166, line: 188, baseType: !1064, size: 64, offset: 64)
!1064 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1065, size: 64, elements: !657)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !166, line: 180, baseType: !1028)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !988, file: !166, line: 207, baseType: !1067, size: 64, offset: 192)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1068, line: 144, baseType: !1069)
!1068 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1068, line: 100, size: 896, elements: !1071)
!1071 = !{!1072, !1080, !1085, !1090, !1092, !1095, !1096, !1097, !1098, !1099, !1104, !1106, !1107, !1112, !1117}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1070, file: !1068, line: 102, baseType: !1073, size: 64)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1068, line: 52, baseType: !1074)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{!1077, !1078}
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1068, line: 47, baseType: !7)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64)
!1079 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1070, file: !1068, line: 105, baseType: !1081, size: 64, offset: 64)
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1068, line: 59, baseType: !1082)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
!1083 = !DISubroutineType(types: !1084)
!1084 = !{!595, !1078, !1078}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1070, file: !1068, line: 108, baseType: !1086, size: 64, offset: 128)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1068, line: 63, baseType: !1087)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{null, !599}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1070, file: !1068, line: 111, baseType: !1091, size: 64, offset: 192)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1070, file: !1068, line: 114, baseType: !1093, size: 64, offset: 256)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1094, line: 46, baseType: !604)
!1094 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1070, file: !1068, line: 117, baseType: !1093, size: 64, offset: 320)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1070, file: !1068, line: 120, baseType: !1093, size: 64, offset: 384)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1070, file: !1068, line: 124, baseType: !7, size: 32, offset: 448)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1070, file: !1068, line: 128, baseType: !7, size: 32, offset: 480)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1070, file: !1068, line: 131, baseType: !1100, size: 64, offset: 512)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1068, line: 75, baseType: !1101)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!599, !1093, !1093}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1070, file: !1068, line: 132, baseType: !1105, size: 64, offset: 576)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1068, line: 78, baseType: !1087)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1070, file: !1068, line: 135, baseType: !599, size: 64, offset: 640)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1070, file: !1068, line: 136, baseType: !1108, size: 64, offset: 704)
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1068, line: 82, baseType: !1109)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = !DISubroutineType(types: !1111)
!1111 = !{!599, !599, !1093, !1093}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1070, file: !1068, line: 137, baseType: !1113, size: 64, offset: 768)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1068, line: 83, baseType: !1114)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{null, !599, !599}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1070, file: !1068, line: 141, baseType: !7, size: 32, offset: 832)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !988, file: !166, line: 211, baseType: !1119, size: 64, offset: 256)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !201, line: 183, baseType: !1121)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !201, line: 183, size: 128, elements: !1122)
!1122 = !{!1123}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1121, file: !201, line: 183, baseType: !1124, size: 128)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !201, line: 182, baseType: !1125)
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !201, line: 182, size: 128, elements: !1126)
!1126 = !{!1127, !1128, !1129}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1125, file: !201, line: 182, baseType: !7, size: 32)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1125, file: !201, line: 182, baseType: !7, size: 32, offset: 32)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1125, file: !201, line: 182, baseType: !1130, size: 64, offset: 64)
!1130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !737, size: 64, elements: !657)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !988, file: !166, line: 220, baseType: !1132, size: 64, offset: 320)
!1132 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !166, line: 217, size: 64, elements: !1133)
!1133 = !{!1134, !1135}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !1132, file: !166, line: 218, baseType: !1119, size: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !1132, file: !166, line: 219, baseType: !1136, size: 64)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !1138, line: 29, baseType: !1139)
!1138 = !DIFile(filename: "./vecprim.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !1138, line: 29, size: 96, elements: !1140)
!1140 = !{!1141}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1139, file: !1138, line: 29, baseType: !1142, size: 96)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !1138, line: 27, baseType: !1143)
!1143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !1138, line: 27, size: 96, elements: !1144)
!1144 = !{!1145, !1146, !1147}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1143, file: !1138, line: 27, baseType: !7, size: 32)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1143, file: !1138, line: 27, baseType: !7, size: 32, offset: 32)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1143, file: !1138, line: 27, baseType: !1148, size: 8, offset: 64)
!1148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1149, size: 8, elements: !657)
!1149 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !1138, line: 26, baseType: !594)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !983, file: !984, line: 467, baseType: !1151, size: 64, offset: 64)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64)
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !186, line: 374, size: 640, elements: !1153)
!1153 = !{!1154, !1285, !1286, !1299, !1300, !1301, !1302, !1303, !1304, !1306, !1308, !1309}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1152, file: !186, line: 377, baseType: !1155, size: 64)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !623, line: 111, baseType: !1156)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !186, line: 217, size: 832, elements: !1158)
!1158 = !{!1159, !1194, !1195, !1196, !1255, !1259, !1260, !1261, !1279, !1280, !1281, !1282, !1283, !1284}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1157, file: !186, line: 219, baseType: !1160, size: 64)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !186, line: 151, baseType: !1162)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !186, line: 151, size: 128, elements: !1163)
!1163 = !{!1164}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1162, file: !186, line: 151, baseType: !1165, size: 128)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !186, line: 150, baseType: !1166)
!1166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !186, line: 150, size: 128, elements: !1167)
!1167 = !{!1168, !1169, !1170}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1166, file: !186, line: 150, baseType: !7, size: 32)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1166, file: !186, line: 150, baseType: !7, size: 32, offset: 32)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1166, file: !186, line: 150, baseType: !1171, size: 64, offset: 64)
!1171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1172, size: 64, elements: !657)
!1172 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !623, line: 108, baseType: !1173)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64)
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !186, line: 122, size: 512, elements: !1175)
!1175 = !{!1176, !1177, !1178, !1186, !1187, !1188, !1189, !1190, !1191, !1192}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1174, file: !186, line: 124, baseType: !1156, size: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1174, file: !186, line: 125, baseType: !1156, size: 64, offset: 64)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1174, file: !186, line: 131, baseType: !1179, size: 64, offset: 128)
!1179 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !186, line: 128, size: 64, elements: !1180)
!1180 = !{!1181, !1185}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1179, file: !186, line: 129, baseType: !1182, size: 64)
!1182 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !623, line: 66, baseType: !1183)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64)
!1184 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !623, line: 65, flags: DIFlagFwdDecl)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1179, file: !186, line: 130, baseType: !622, size: 64)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1174, file: !186, line: 134, baseType: !599, size: 64, offset: 192)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1174, file: !186, line: 137, baseType: !737, size: 64, offset: 256)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1174, file: !186, line: 138, baseType: !857, size: 32, offset: 320)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1174, file: !186, line: 142, baseType: !7, size: 32, offset: 352)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1174, file: !186, line: 144, baseType: !595, size: 32, offset: 384)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1174, file: !186, line: 145, baseType: !595, size: 32, offset: 416)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1174, file: !186, line: 146, baseType: !1193, size: 64, offset: 448)
!1193 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !186, line: 119, baseType: !708)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1157, file: !186, line: 220, baseType: !1160, size: 64, offset: 64)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1157, file: !186, line: 223, baseType: !599, size: 64, offset: 128)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1157, file: !186, line: 226, baseType: !1197, size: 64, offset: 192)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64)
!1198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !173, line: 100, size: 1216, elements: !1199)
!1199 = !{!1200, !1201, !1202, !1203, !1204, !1209, !1210, !1211, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1245, !1253, !1254}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1198, file: !173, line: 102, baseType: !595, size: 32)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1198, file: !173, line: 105, baseType: !7, size: 32, offset: 32)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1198, file: !173, line: 108, baseType: !1156, size: 64, offset: 64)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1198, file: !173, line: 111, baseType: !1156, size: 64, offset: 128)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1198, file: !173, line: 114, baseType: !1205, size: 64, offset: 192)
!1205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !173, line: 41, size: 64, elements: !1206)
!1206 = !{!1207, !1208}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1205, file: !173, line: 42, baseType: !172, size: 32)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1205, file: !173, line: 43, baseType: !7, size: 32, offset: 32)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1198, file: !173, line: 117, baseType: !7, size: 32, offset: 256)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1198, file: !173, line: 120, baseType: !7, size: 32, offset: 288)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1198, file: !173, line: 123, baseType: !1212, size: 64, offset: 320)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64)
!1213 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !173, line: 87, baseType: !1214)
!1214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !173, line: 87, size: 128, elements: !1215)
!1215 = !{!1216}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1214, file: !173, line: 87, baseType: !1217, size: 128)
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !173, line: 85, baseType: !1218)
!1218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !173, line: 85, size: 128, elements: !1219)
!1219 = !{!1220, !1221, !1222}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1218, file: !173, line: 85, baseType: !7, size: 32)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1218, file: !173, line: 85, baseType: !7, size: 32, offset: 32)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1218, file: !173, line: 85, baseType: !1223, size: 64, offset: 64)
!1223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1224, size: 64, elements: !657)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !173, line: 84, baseType: !1197)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1198, file: !173, line: 126, baseType: !1197, size: 64, offset: 384)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1198, file: !173, line: 129, baseType: !1197, size: 64, offset: 448)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1198, file: !173, line: 132, baseType: !599, size: 64, offset: 512)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1198, file: !173, line: 139, baseType: !737, size: 64, offset: 576)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1198, file: !173, line: 143, baseType: !785, size: 128, offset: 640)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1198, file: !173, line: 146, baseType: !785, size: 128, offset: 768)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1198, file: !173, line: 148, baseType: !594, size: 8, offset: 896)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1198, file: !173, line: 149, baseType: !594, size: 8, offset: 904)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1198, file: !173, line: 153, baseType: !181, size: 32, offset: 928)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1198, file: !173, line: 156, baseType: !1235, size: 64, offset: 960)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64)
!1236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !173, line: 48, size: 320, elements: !1237)
!1237 = !{!1238, !1242, !1243, !1244}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1236, file: !173, line: 50, baseType: !1239, size: 64)
!1239 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !623, line: 58, baseType: !1240)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64)
!1241 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !623, line: 57, flags: DIFlagFwdDecl)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1236, file: !173, line: 59, baseType: !785, size: 128, offset: 64)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1236, file: !173, line: 64, baseType: !594, size: 8, offset: 192)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1236, file: !173, line: 67, baseType: !1235, size: 64, offset: 256)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1198, file: !173, line: 159, baseType: !1246, size: 64, offset: 1024)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !173, line: 72, size: 256, elements: !1248)
!1248 = !{!1249, !1250, !1251, !1252}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1247, file: !173, line: 74, baseType: !1173, size: 64)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1247, file: !173, line: 77, baseType: !1246, size: 64, offset: 64)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1247, file: !173, line: 78, baseType: !1246, size: 64, offset: 128)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1247, file: !173, line: 81, baseType: !1246, size: 64, offset: 192)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1198, file: !173, line: 162, baseType: !594, size: 8, offset: 1088)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1198, file: !173, line: 166, baseType: !737, size: 64, offset: 1152)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1157, file: !186, line: 229, baseType: !1256, size: 128, offset: 256)
!1256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1257, size: 128, elements: !692)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64)
!1258 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !186, line: 229, flags: DIFlagFwdDecl)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1157, file: !186, line: 232, baseType: !1156, size: 64, offset: 384)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1157, file: !186, line: 233, baseType: !1156, size: 64, offset: 448)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1157, file: !186, line: 238, baseType: !1262, size: 64, offset: 512)
!1262 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !186, line: 235, size: 64, elements: !1263)
!1263 = !{!1264, !1270}
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1262, file: !186, line: 236, baseType: !1265, size: 64)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64)
!1266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !186, line: 273, size: 128, elements: !1267)
!1267 = !{!1268, !1269}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1266, file: !186, line: 275, baseType: !1182, size: 64)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1266, file: !186, line: 278, baseType: !1182, size: 64, offset: 64)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1262, file: !186, line: 237, baseType: !1271, size: 64)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64)
!1272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !186, line: 259, size: 320, elements: !1273)
!1273 = !{!1274, !1275, !1276, !1277, !1278}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1272, file: !186, line: 261, baseType: !622, size: 64)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1272, file: !186, line: 262, baseType: !622, size: 64, offset: 64)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1272, file: !186, line: 266, baseType: !622, size: 64, offset: 128)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1272, file: !186, line: 267, baseType: !622, size: 64, offset: 192)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1272, file: !186, line: 270, baseType: !595, size: 32, offset: 256)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1157, file: !186, line: 241, baseType: !1193, size: 64, offset: 576)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1157, file: !186, line: 244, baseType: !595, size: 32, offset: 640)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1157, file: !186, line: 247, baseType: !595, size: 32, offset: 672)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1157, file: !186, line: 250, baseType: !595, size: 32, offset: 704)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1157, file: !186, line: 253, baseType: !595, size: 32, offset: 736)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1157, file: !186, line: 256, baseType: !595, size: 32, offset: 768)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1152, file: !186, line: 378, baseType: !1155, size: 64, offset: 64)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1152, file: !186, line: 381, baseType: !1287, size: 64, offset: 128)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64)
!1288 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !186, line: 282, baseType: !1289)
!1289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !186, line: 282, size: 128, elements: !1290)
!1290 = !{!1291}
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1289, file: !186, line: 282, baseType: !1292, size: 128)
!1292 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !186, line: 281, baseType: !1293)
!1293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !186, line: 281, size: 128, elements: !1294)
!1294 = !{!1295, !1296, !1297}
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1293, file: !186, line: 281, baseType: !7, size: 32)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1293, file: !186, line: 281, baseType: !7, size: 32, offset: 32)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1293, file: !186, line: 281, baseType: !1298, size: 64, offset: 64)
!1298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1155, size: 64, elements: !657)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1152, file: !186, line: 384, baseType: !595, size: 32, offset: 192)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1152, file: !186, line: 387, baseType: !595, size: 32, offset: 224)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1152, file: !186, line: 390, baseType: !595, size: 32, offset: 256)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1152, file: !186, line: 394, baseType: !1287, size: 64, offset: 320)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1152, file: !186, line: 396, baseType: !185, size: 32, offset: 384)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1152, file: !186, line: 399, baseType: !1305, size: 64, offset: 416)
!1305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 64, elements: !692)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1152, file: !186, line: 402, baseType: !1307, size: 64, offset: 480)
!1307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !692)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1152, file: !186, line: 406, baseType: !595, size: 32, offset: 544)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1152, file: !186, line: 409, baseType: !595, size: 32, offset: 576)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !983, file: !984, line: 470, baseType: !1183, size: 64, offset: 128)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !983, file: !984, line: 473, baseType: !1312, size: 64, offset: 192)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64)
!1313 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !984, line: 166, flags: DIFlagFwdDecl)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !983, file: !984, line: 476, baseType: !1315, size: 64, offset: 256)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64)
!1316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !173, line: 187, size: 256, elements: !1317)
!1317 = !{!1318, !1319, !1320, !1321}
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1316, file: !173, line: 189, baseType: !595, size: 32)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !1316, file: !173, line: 192, baseType: !1212, size: 64, offset: 64)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1316, file: !173, line: 197, baseType: !1067, size: 64, offset: 128)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !1316, file: !173, line: 200, baseType: !1197, size: 64, offset: 192)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !983, file: !984, line: 479, baseType: !1067, size: 64, offset: 320)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !983, file: !984, line: 484, baseType: !737, size: 64, offset: 384)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !983, file: !984, line: 488, baseType: !737, size: 64, offset: 448)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !983, file: !984, line: 493, baseType: !737, size: 64, offset: 512)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !983, file: !984, line: 496, baseType: !737, size: 64, offset: 576)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !983, file: !984, line: 501, baseType: !1328, size: 64, offset: 640)
!1328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1329, size: 64)
!1329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !6, line: 2355, size: 576, elements: !1330)
!1330 = !{!1331, !1334, !1335, !1336, !1337, !1339, !1340, !1345, !1346, !1347, !1348, !1349, !1350}
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1329, file: !6, line: 2356, baseType: !1332, size: 64)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64)
!1333 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !6, line: 2356, flags: DIFlagFwdDecl)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1329, file: !6, line: 2357, baseType: !600, size: 64, offset: 64)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1329, file: !6, line: 2358, baseType: !595, size: 32, offset: 128)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1329, file: !6, line: 2359, baseType: !595, size: 32, offset: 160)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1329, file: !6, line: 2360, baseType: !1338, size: 128, offset: 192)
!1338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !595, size: 128, elements: !717)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1329, file: !6, line: 2364, baseType: !595, size: 32, offset: 320)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1329, file: !6, line: 2367, baseType: !1341, size: 128, offset: 384)
!1341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !6, line: 2349, size: 128, elements: !1342)
!1342 = !{!1343, !1344}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1341, file: !6, line: 2351, baseType: !622, size: 64)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1341, file: !6, line: 2352, baseType: !708, size: 64, offset: 64)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1329, file: !6, line: 2371, baseType: !196, size: 32, offset: 512)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1329, file: !6, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1329, file: !6, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1329, file: !6, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1329, file: !6, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1329, file: !6, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !983, file: !984, line: 504, baseType: !1352, size: 64, offset: 704)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64)
!1353 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !984, line: 504, flags: DIFlagFwdDecl)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !983, file: !984, line: 507, baseType: !1067, size: 64, offset: 768)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !983, file: !984, line: 510, baseType: !595, size: 32, offset: 832)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !983, file: !984, line: 513, baseType: !595, size: 32, offset: 864)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !983, file: !984, line: 516, baseType: !857, size: 32, offset: 896)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !983, file: !984, line: 519, baseType: !857, size: 32, offset: 928)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !983, file: !984, line: 522, baseType: !7, size: 32, offset: 960)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !983, file: !984, line: 523, baseType: !7, size: 32, offset: 992)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !983, file: !984, line: 528, baseType: !600, size: 64, offset: 1024)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !983, file: !984, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !983, file: !984, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !983, file: !984, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !983, file: !984, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !983, file: !984, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !983, file: !984, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !983, file: !984, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !983, file: !984, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !983, file: !984, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !983, file: !984, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !983, file: !984, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !983, file: !984, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !983, file: !984, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !983, file: !984, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !983, file: !984, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !983, file: !984, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !978, file: !201, line: 3254, baseType: !737, size: 64, offset: 1536)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !978, file: !201, line: 3257, baseType: !737, size: 64, offset: 1600)
